{
    "symbol": "CNOB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 15:30:19",
    "content": "  Operator: Greetings, and welcome to ConnectOne Bancorp, Inc. First Quarter 2022 Earnings Conference Call. I would now like to turn the conference over to your host, Ms. Siya Vansia, Vice President of Marketing. Good morning, and welcome to today's conference call to review ConnectOne's results for the first quarter of 2022 and to update you on recent developments. On today's conference call will be Frank Sorrentino, Chairman and Chief Executive Officer; and Bill Burns, Senior Executive Vice President and Chief Financial Officer. At this time, let me remind you that certain statements and assumptions in this conference call contain or based upon forward-looking information that are being made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements are subject to numerous assumptions, uncertainties and known or unknown risks, which could cause actual results to differ materially from those anticipated. The forward-looking statements included in this conference call are only made as of the date of this call, and the company is not obligated to publicly update or revise them. In addition, certain terms used in this call are non-GAAP financial measures, reconciliations of which are provided in the company's earnings release and accompanying tables or schedules, which have been filed today on Form 8-K with the SEC and may also be accessed through the company's website at ir.connectonebank.com. We are very pleased to report another strong quarter, delivering solid financial performance, significant organic balance sheet growth and strong performance metrics here at ConnectOne. While Bill will discuss our financial highlights in some more detail, I would like to highlight that our PPNR as a percentage of assets, again, exceeded 2% for the seventh consecutive quarter. Return on assets was again above 1.5%, and our return on tangible equity was greater than 15%, all while our efficiency ratio remained below 40%. Our tangible book value per share was up again this quarter, increasing by 2% since the beginning of the year, and that's in an interest rate environment where others have experienced significant dilution from reduction in fair value of the securities portfolios. However, these once again, impressive financial results really don't tell the whole story of what we are building here at ConnectOne. So first, we continue to invest in and strengthen our organic -- our origination franchise, sorry. By leveraging our strong franchise and client-centric culture, we are gaining new clients as well as hiring experienced bankers from revenue generators to tech talent. We are a destination of choice for some of the best business generating talent in the industry, and a lot of that is stemming from the marketplace disruption created by M&A. So as we sit here today, we clearly see those efforts have enhanced an already solid team and are paying dividends with yet another quarter of annualized sequential growth in loans, exceeding 10% and nearly 15% growth in deposits. Secondly, our pipeline remains near historic levels with strong demand and favorable pricing characteristics across all business lines in our markets. And the factors that made it successful in the New York metropolitan area translate very well to the growing Florida market, and our culture with a client-based focus is a clear differentiator. We’ve already originated approximately $150 million in new commercial loans, some from our existing ConnectOne clients with business opportunities in Florida and some from new clients based in Florida. So, with that, let's move on to some other initiatives ConnectOne has been focused on. This includes improvements to internal workflows to support our hybrid work environment and support scale, along with our investments to enhance our data infrastructure, including digital initiatives that also enhance risk management tools and processes. Look over at BoeFly, even as the number of our franchisor brands on that platform increased, we are turning our efforts towards automated underwriting to improve functionality for the franchisor and franchisee and ultimately increase the profitability of the core business line. We are continuing to -- we are continuously improving the client experience, while also achieving greater efficiency and revenue generation to that platform. Shifting gears, as you may have seen, ConnectOne became an early member bank in the USDF Consortium, which is an association of U.S. banks with a mission to build the network to further the adoption of the USDF which is a tokenized deposit. We are also happy to announce that we recently signed an agreement with Nymbus , a leading fintech company to provide cloud-based banking and core services. Working in partnership with Nymbus, we will be building a niche-focused offering, providing us a new avenue to collect deposits. And today, we've more than doubled in size and yet we've been able to create efficiencies as we continue to build scale. Our capital position remains strong, and we continue to internally generate capital to support growth. As you saw in our press release this morning, the Board of Directors today announced another increase to our common dividend, an increase of nearly 20%. Also, we continue to be opportunistic with share repurchases, having about $2 million in authorized capacity at the present time. So, with that, I will turn it over to Bill to give us a little more depth and some color on our results. Frank just mentioned, we've been focusing our resources on accelerating organic growth. But even with that increased investment and the associated additional expense, we continue to produce superior financial metrics with stability across the board. Our efficiency ratio for the quarter was 38.7%, and that's improved from just slightly above 40% in the prior year first quarter. Our net interest income contracted by just 4 basis points, but remained above 3.70, near historic highs for ConnectOne. And really behind all of this is the strong organic loan growth we maintained at good spreads, which enabled the investment discipline and hedging strategies I just mentioned. So, all in all, ConnectOne is faring quite well in a rising rate environment. The NIM remains high, and we continue to grow per share book value. That's -- that I expected, but was up a significant 15% from the first quarter of last year. And combined with that, the margin expanded by 15 basis points over the past year. In terms of the net interest margin, just to repeat, our margin has been expanding throughout the pandemic and today remains at or near historic highs, and we continue to originate loans at favorable rates and spreads on the asset side are improving in my view. But based on our pipeline indications, our origination yields to be above 4% for the second quarter, could be as high as 4.5%. And although I expect the margin to remain relatively flat for the remaining 9 months of the year, I just want to remain cautious with respect to any guidance as we are seeing competition for deposits heating up. So, excluding that valuation charge because of the rise in interest rates, we were about $300,000 to $400,000 below expectations. And just one last item, and there's going to be some additional BOLI in this quarter. So we're going to probably add about $200,000 per quarter going forward. Turning to expenses, we grew 4% sequentially. As I did indicate in the last call, most of that increase is on the comp line, that reflects new hires, salary increases, wage inflation, and the assertive stance we've been taking to both add to and retain our team. In terms of any additional future BoeFly charges, we've still got a little to go later this year, but it's under $1 million, and that would be the last of any expense associated with both BoeFly earnout. I want to add our operations and tech teams have done a great job of strategic spending on technology, but they’ve also reduced the cost of core and legacy systems. Going forward, I think some of the same trends will continue, quarterly sequential growth in expenses probably in the 2% range. Many banks released reserves in the quarter, while others added modest amounts. The reserving first reflected loan growth, but it also reflected that we made some minor qualitative adjustments to our CECL model, and that reflects an expectation that economic forecast could trend in a negative direction. Our nonaccrual assets have declined for the second straight quarter, while delinquencies and charge-offs remain very, very low. Before turning back to Frank, I want to add a couple of things. First, we have the capital to support double-digit organic growth. Along with that, there's still room for continued dividend increases and share repurchases. And as always, although our strength is organic growth, we continue to opportunistically explore growth through M&A. As you know, deals are hard to come by, but we have a track record of being financially disciplined, and we are going to stick to that. In closing, ConnectOne delivered strong performance for this first quarter. And more importantly, we expanded our market presence and we continue to invest in top talent to support our clients as they expand in capability and in reach. As we move through the rest of 2022, I'd like to reiterate that we are projecting strong organically driven growth, which will be supported by the investments we’ve made in our talent and our technology infrastructure, and we expect our financial performance to remain among the best in the industry. We are excited about our future, and we look forward to updating you in the quarters ahead. Hey, Bill, I want to go back to your comments on new loan yields being at 4%, 4.5% range. And then maybe along the same lines, could you just give us some color on commercial real estate, multifamily spreads. I've been hearing that there have been some spread compression through March, but it sounds like it's starting to reverse. As you know, multifamily is typically lower spreads for the rest of the business. And the other thing is, one thing that stands out is despite on paper, the balance sheet being relatively interest rate neutral, the loan-to-deposit ratio is on the fuller side. However, even though higher deposit rates are lower right now than our wholesale cost of funds. So, I typically use a very conservative approach when I look and analyze spreads using our highest wholesale cost of funds to calculate spreads. But I hope I answered your question, but it's like kind of a mix right now. Deposit rates are going up, but they're actually helping to add to the spreads. I mean maybe going down a different path, but getting to the same outcome. And then, Frank you mentioned …\n There's different ways people look. So, I just feel comfortable that we are going to have stable margins and stable returns in the coming year. Frank, you had mentioned Nymbus as a third-party that you were using. I think that Nymbus offers us an opportunity to custom design a vertical for a new line of business potentially where we will use their core, and we will use their ability to really with laser focus identify what a particular client niche needs and how to attack that particular vertical. So, I’m pretty confident that it's going to allow us to be very, very hyper focused in a particular client vertical. Over time, I mean, I forget who you use right now as a core provider. It's hard to say, Matt. I think even companies like FIS and Fiserv and others, Jack Henry are being pretty progressive about how they're thinking about the future. What I do think I see is, in the past, it was -- you had to identify a core and you ran everything on your bank in concert with 1 basic operating system. Today, it's just not that way. And it started when once APIs came out, you could now start with actual  different products and services to whatever core you have. And so, I think that's what we are going to see going forward. Bill, you mentioned that it had a nice quarter. I think when we had had some conversations in the past, there was discussions about adding some new layers to that and maybe even some fee -- other fee income opportunities like interchange or cards or deposits or things of that nature. So the first thing we are looking at is what does the core platform to do, which is to supply an opportunity for a franchisee applicant to obtain financing. I think as you mentioned before, there are lots of other things we can do there. There are a number of opportunities that don't necessarily need to go through the SBA program, which is where BoeFly really cut its teeth . And now we are building that capability to be able to fund that second, third, fourth request, which would definitely not go through the SBA. And then when you think about BoeFly having a loyal client, of course, we can start to think about all the other products and services that a financial company would want to provide the first -- or the next most logical being all the payments capabilities. But the first part is really getting this whole loan product set really done in a automated way, in a way that the client really feels almost no friction where we pretty much eliminate most of the competition that’s out there for that type of business. Well, all the lending product discussion that I just had is all being done this year, and we're actually piloting right now some of the complete loan product. So, within this year, we are going to see -- or we will be able to discuss exactly how that entire loan pipeline works for all the products that we supply at BoeFly. I would say by year-end, we will have better discovery around what those things will be, what they'll look like and what we will be working on next. But we really want to get this entire loan pipeline under wraps and working well and be able to demonstrate to the marketplace what's coming through there, what the pull-through rate is, what the profitability of that line of business is and what it looks like. I just wanted to add that behind it all, the volumes through BoeFly are increasing. And I think when we bought them, they were -- they had 30 franchisors in the market. I think last time we spoke with you a few months ago, it was 80 or 90. So that’s the key towards the traditional income at BoeFly, which is getting a referral fee for another bank to place the loan. The other things we are talking about are just going to be additive to that, which includes franchisees that are a little bit bigger, some business with franchisors and potentially doing the entire underwriting process at ConnectOne, which right now we -- for the most part, we don’t do that. And obviously, it's top quartile, very strong, and I think investors sometimes wonder like what could make it improve. Right now, there's a lot of revenues, but we are also building platform. So, we are probably at a breakeven, even though that's $400,000 this quarter of revenue. Just on the loan growth side, the pipeline commentary is strong. As we move beyond that, obviously, the economic outlook becomes a little bit more subject to opinion and challenging to pin down. We are certainly seeing things, I don’t want to say slow down, but people are being a little bit more thoughtful about whether they're entertaining a construction project or buying commercial property or starting a business or buying a business. But that we also have to -- and look, my own personal belief is with the amount of money that’s in the economy today, the health of the consumer today, how much liquidity is still exists both on business balance sheets and personal balance sheets. I think we are going to see a higher interest rate environment, which is going to force people to make different financial decisions. But the backdrop to that is that the markets in which we are in, all of them are seeing tremendous M&A going on. And so, we are picking up some great talent today which is going to offset any bit of that slowdown because we're going to organically grow new business from new sources. And to me, it feels like could be one of the best times you've ever been in relative to our ability to grow. So, I think there's -- and every one of those markets is being affected by what I said before about the M&A. So, I feel pretty good about overcoming the slowdown that’s just naturally happening in the economy and taking a bigger piece of the pie. That’s really helpful color, Frank. Well, thank you, everyone for joining us today for our first quarter report."
}