{
    "symbol": "BSQR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 20:29:17",
    "content": " But after that we will cover more deeply than we have in the past our plans for driving organic growth, with an emphasis on our SquareOne product offering. Turning our attention now to the second quarter of 2022, revenue was up again quarter-over-quarter. Total revenue for the second quarter of 2022 improved $700,000, or 7% over the first quarter, with both the Partner Solutions and Edge to Cloud segments contributing to the increase. Within the Partner Solutions segment, revenue increased $200,000, or about 2%, with a large one-time order and one additional shipping day in the quarter driving the improvement. While we have recorded two consecutive quarters of revenue growth in our Partner Solutions segment, we note that our volumes are still well behind those we saw prior to COVID. In the Edge to Cloud segment, a $400,000 increase in quarterly revenue stemmed primarily from a renewed relationship with one of our largest and most important customers. Total gross profit for the quarter also improved, as we achieved a $100,000 quarter-over-quarter increase, driven by the Edge to Cloud segment. That rate is, however, a decrease from the first quarter, when we closed a large one-time order with an above-average margin. Q2 gross profit in the Partner Solutions segment decreased $300,000 quarter-over-quarter. As weâ\u0080\u0099ve discussed previously, the cost of revenue in the Edge to Cloud segment tends to be fairly stable, resulting in gross profits moving commensurate with revenue. This remained true for the second quarter of 2022 as both segment revenue and gross profit were up $400,000 compared to the prior quarter. Moving on total operating expenses in the second quarter were $2.3 million, a decrease of $100,000 compared to the first quarter. Spending on third party services was down quarter-over-quarter as these expenses are typically highest in the first quarter of the year, driven by fiscal yearend audit and tax services. While some of our expenses, like professional fees, fluctuate quarter to quarter based on seasonality, our operating cost structure is relatively stable and has recently only increased because of planned investments in sales and marketing. In the first half of 2022, our product development investment totaled $700,000, of which approximately $300,000 was capitalized on our balance sheet as internally developed software. Overall, loss from operations for the second quarter of 2022 was $700,000, an improvement of $200,000 compared to the first quarter. Net loss for the quarter was $600,000, or $0.03 per diluted share, an improvement compared to a net loss of $900,000, or $0.05 per diluted share, in the first quarter of 2022. As of June 30, 2022, our cash totaled $37.8 million, a net use of $2.2 million since December 31, 2021. In Q2 we continued our efforts to drive organic growth based on the business opportunities we described on previous calls serving customers that are manufacturing, deploying and operating IoT products. In that time, we have helped thousands of OEMs ship millions of purpose-built devices The opportunity also builds on years of experience implementing and operating custom IoT systems for large companies. Our new product offering, SquareOne, is central to our plans for organic growth. As a reminder, SquareOne is our recently-announced product offering that provides secure remote device management for manufacturers and operators of IoT products. I believe it is critical that investors understand our product strategy, and for that reason I am going to turn it back to Chris now, this time in his role as our Chief Operating Officer, to take us through SquareOne in detail. Chris leads our product management, engineering, and operations teams that are building and operating IoT infrastructure for our customers. In some of our more recent earnings calls, we have touched on the SquareOne product and the value it can provide. However, on todayâ\u0080\u0099s call, Iâ\u0080\u0099m going to lift the hood and begin to answer some of the most important questions that investors and observers are likely to have about the product and the strategy weâ\u0080\u0099ve built around it. SquareOne is a complete solution for companies that are manufacturing, deploying and operating IoT products. Based on input from customers, we now offer SquareOne in two packages: SquareOne Essentials is for companies that are seeking to manufacture and support more resilient and more manageable devices. We use the term resilient to describe how SquareOne Essentials helps OEMs build devices that are secure, can recover to a known state in the event of a failure or breach, and whose OS can be upgraded in-place without a loss of device settings or configurations for other previously installed software. SquareOne Essentials directly addresses this need for resilience, allowing our customers to easily incorporate it into their new products and to add it to previously deployed devices. Because the functionality of SquareOne is configured into the OS image itself, the customer doesnâ\u0080\u0099t need to change their product, they can simply enable the capabilities when ready. As customers decide to bundle their OS purchases with SquareOne Essentials, both our per-unit revenue and gross margin increase. In addition, SquareOne Essentials can also be easily upgraded to SquareOne Premier, if and when our customers need to turn on active device monitoring and management. By multi-OS we mean it supports devices running Microsoft Windows IoT, Linux, and Android and can operate fleets of devices running a mix of operating systems. SquareOne Premier is sold as a subscription, where customers pay an amount per month based on the number of active devices under SquareOne management. We anticipate customers will use SquareOne to lower the cost of support, reduce the costs of down time, and to create new revenue streams from new services. SquareOne Premier is easily configured to support unique hardware requirements, using industry standard protocols. As previously announced, our integration of Intelâ\u0080\u0099s Out-of-Band Management technology reduces on-site service costs, simplifies routine operations tasks, and minimizes downtime during maintenance. SquareOne Premier is the complete solution for companies that participate in, or are directly responsible for, the operation of connected IoT systems. Attracting and retaining new customers can be expensive, so weâ\u0080\u0099re designing our messaging to land first with our existing customer base before launching cash intensive marketing campaigns to those that might not yet be aware of BSQUARE or SquareOne. Through this two-staged strategy, we think we can create meaningful organic growth with an entirely manageable cost of customer acquisition. Importantly, SquareOne Premierâ\u0080\u0099s SaaS-based subscription model creates opportunities for recurring revenue, something that has to date not been part of BSQUAREâ\u0080\u0099s business model. As our customers subscribe to the service, reap the benefits of its inherent value, and then extend SquareOne deeper into their operational environments, our revenue builds on itself. BSQUAREâ\u0080\u0099s long history of high-quality customer support and systems expertise should not only encourage long-term relationships, but also help accelerate our customersâ\u0080\u0099 successes. First and foremost, SquareOne taps into our history as a reliable source of system software expertise, device management knowledge, and world class IoT operations. The path from OS licensing to SquareOne Essentials to SquareOne Premier is natural, easy, and tuned to the needs of our customers. Finally, we already have the customer relationships, we know what those customers need, and have developed a product suite that we believe will cause them to buy. Okay, I would like to switch gears now to address a question that has come up during investor conversations and that is: â\u0080\u009cHow we plan to deploy the capital we raised from the ATM in 2021?â\u0080\u009d Clearly, we have the financial ability to invest in organic growth, and we are doing just that. Because we donâ\u0080\u0099t often get many questions on our calls I will remind you that if you would like to arrange a follow up conversation with us, please send an email to investorrelations@bsquare.com."
}