{
    "symbol": "BSQR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 19:06:01",
    "content": "  Operator: Good day, and welcome to the Bsquare Corporation Third Quarter 2022 Earnings Call. Good afternoon, investors and welcome to the Q3 2022 Bsquare quarterly earnings call. Joining me on today's call is Bsquare's CFO and COO, Chris Wheaton. Before we begin, we'd like to remind you that this call is being webcast and the recording of the call and the text of our prepared remarks will be available on the Bsquare website. For anyone who would like to arrange a follow-up conversation with us, please send an e-mail to investorrelations@bsquare.com. After that, I'll discuss the rationale for our planning priorities for 2023 and our shift from growing revenue to achieving breakeven business operations. I'll also cover a question that several shareholders have asked me to address, and that is what we intend to do with our cash reserves. While these results are not what we'd anticipated, they provide an important backdrop for the change in operating priorities that Ralph just mentioned. I'll start with a review of our income statement and then move to a discussion of our balance sheet, specifically changes in our cash balance and recent short-term investments. Partner Solutions decreased $1.8 million and Edge to Cloud decreased $200,000. Revenue in that segment decreased 19% quarter-over-quarter, few large orders in each of the first two quarters bolstered our first half results, but we didn't close similarly large orders in the third quarter. Our OS licensing customers continue to site struggles with their supply chains, causing delays in product launches and purchasing decisions. Further, the threat of recession and increasing interest rates seem to have affected ordering patterns as our customers have become exceptionally cautious about inventories and near-term demand for their products. In the Edge to Cloud segment, total revenue in the quarter was $800,000, down $200,000 or 20%. As we noted last quarter, this contract amendment both extended our relationship and stabilized revenue recognition with this customer, albeit at a quarterly rate lower than was recorded in the second quarter. Overall, we have strong relationships with the customers in this segment and have clear visibility to their needs and plans. Commensurate with the quarterly revenue decline, total gross profit decreased $500,000 driven again by the Partner Solutions segment. Gross margin rate for that segment was 13%, roughly in line with the second quarter, indicating that the $300,000 decrease in gross profit dollars was fundamentally driven by the 19% revenue decline rather than by pricing or mix changes. As we've discussed previously, cost of revenue in the Edge to Cloud segment tends to be fairly stable, resulting in gross profit dollars moving in correlation with revenue. This remained true for the third quarter of 2022 as both segment revenue and gross profit decreased to $200, 000 compared to the prior quarter. Total operating expenses in the third quarter were $2.3 million, which was essentially flat to the second quarter. Overall, loss from operations for the quarter was $1.2 million compared to the second quarter loss from operations of $700,000. Net loss for the quarter was $1.1 million or $0.05 per diluted share, which was more than the second quarter net loss of $600, 000 or $0.03 per diluted share. In total, cash, cash equivalents, restricted cash and short-term investments totaled $37.1 million on September 30, 2022. While this reflects a net cash use of $3 million since December 31, 2021, our liquidity position remains healthy, as is the rest of our balance sheet with mostly current receivables and no debt. For reasons we've covered, these investments haven't yet paid off in top line revenue, but they have allowed us to deepen our customer relationships, giving us better visibility into customers' issues, future product development plans and their requirements. Bsquare has a reputation as the premier provider of technical support and customer service, and we will continue to build on that reputation in 2023. We have continued to work closely with our large customers this year to build a profitable, sustainable business. In addition to ongoing consulting work, we provide critical IoT operation services for these customers. On our last call in August, Chris took you through an in-depth discussion of our Square One offering, and I reviewed our plans for investing in marketing Square One. And lastly, we are finding that prospective customers require longer evaluation cycles for a product that will become a part of their critical operating infrastructure. With our existing OS licensing customers, we are shifting to a partnership selling model. We believe Square One creates a new revenue opportunity for our OS licensing customers and in turn, improves their offering to their customers who are the ones operating and managing systems of devices. For customers new to Bsquare, those who are not running Windows IoT or those who are not -- or those who are operating devices themselves, we will sell Square One directly, emphasizing our multi-OS capabilities as a key differentiator. This shift doesn't mean we'll stop investing in marketing or revenue growth in 2023, but it does mean that the timing and amount of the investment will be subject to both the business opportunity and our financial results. That effort will continue in Q4 and in 2023, running in parallel with our efforts to grow the business organically. We will return to a June meeting cadence next year with the 2023 Annual Shareholder Meeting scheduled for Thursday, June 15, 2023, as was announced in our press release and 8-K filed today. The declassification of the Board will bring us in line with governance best practices, and I'm optimistic we will succeed where prior efforts fail to get sufficient shareholder support. With that, operator, please open the line for questions because we don't often get many questions on our calls, I'll remind you that if you would like to arrange a follow-up conversation, please send an e-mail to investorrelations@bquare.com. So what we're finding in our selling is that most of our OS licensing customers, not all, but most build the devices, and then they sell them to their customers who, in turn, then operate the systems of devices. But what, in fact, we're finding is that they're interested in introducing us and selling in partnership to sell that service to their customer. But instead of selling to our existing OS customers, we're selling to their customers. I think the other big differentiators we're finding is many of our customers are considering moving from not just Windows IoT, but other operating systems and multi-OS environments. And in some cases, customers have come to us specifically about being able to run in a multi-OS configuration. You've worked with over 600 customers in the last two years alone, you've managed millions of devices. With that being said, when you guys -- if or when you guys do get traction on what you're selling, do you have any plans on some marketing awareness, investor relations, hitting the road, pounding the pavement to tell your story. So yes, I would love to hit the road, but I'm going to probably hold fire until I got more customers that I can talk about and more good news to talk about."
}