{
    "symbol": "ESTE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 04:28:07",
    "content": " In fact, during the interim period between the effective date of January 1 and closing on April 14, the Bighorn assets generated such significant free cash flow that after preliminary purchase price adjustments, the consideration for the acquisition was reduced by about $145 million. Our capital spending for the quarter was about 16% below the midpoint of our guidance, but we do expect to see significant impacts from inflation going forward, and we are maintaining our guidance for the full year between $410 million and $440 million, and you’ll hear more about that. As free cash flow is generated, our plan for the remainder of the year is to pay down debt, but as you would expect, we’ll remain open to potential acquisition opportunities that could provide us with additional scale and high-quality production and inventory while still giving us the ability to maintain the strength of our balance sheet. Now going back to the results for the quarter, our first quarter EBITDAX of $123 million was a 44% increase quarter-over-quarter, which was largely attributable to the incremental production from about half the quarter of the Delaware Basin assets and also from higher commodity prices. With the first quarter only including Delaware Basin assets for about half the quarter and not including the Bitcoin assets at all, we are excited about realizing much higher production and cash flow in the second quarter than what we saw in the first quarter, which will include the Delaware Basin asset for the full quarter and the Bighorn assets for about 83% of the quarter. When you take our quarter end balances on the debt side, plus Earthstone’s EBITDAX for the quarter and just to add the Chisholm EBITDAX from the period for the first part of the quarter before we own the assets. To reiterate what we mentioned last quarter, we expect to produce approximately 70,000 to 74,000 BOE per day with about a 41% oil component in the second quarter, which again, factors in a full quarter of the Delaware Basin assets we acquired in February and about 75 days of the Bighorn assets, which we acquired in mid-April. Today’s higher commodity prices, combined with our acquisition of accretive and well-located assets that generate meaningfully high cash margin production has significantly strengthened our free cash flow profile. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}