{
    "symbol": "ESTE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 17:19:02",
    "content": " Our production has increased to almost 105,000 barrels of oil equivalent per day in the fourth quarter of 2022, which is an increase of approximately 250% year-over-year. And finally, the strength of our balance sheet has been and will continue to remain a top priority at Earthstone despite using a considerable amount of debt to fund over $2 billion of acquisitions in 2022, our focus on a conservative balance sheet management and our utilization of free cash flow to pay down debt results in us ending the year with a lower leverage on a last quarter annualized debt-to-EBITDAX ratio than the level at which we entered the year. Previously reporting guidance, our plans call for an investment of approximately $750 million, and we expect to deliver production of approximately 100,000 BOE a day for 2023, both at the midpoint of guidance. Adjusted EBITDAX was $338 million and free cash flow for the fourth quarter was approximately $134 million, bringing our free cash flow for the year to $509 million, which was a company record. From a production standpoint, we are pleased to surpass the midpoint of our fourth quarter guidance range by approximately 4% and by 9% on the oil midpoint achieving production of nearly 105,000 barrels of oil equivalent per day, which was comprised of 45% oil, 31% natural gas and 24% natural gas liquids. However, we expect the $72 million to $75 million in non-D&C CapEx in 2023 to be a bit more front-half weighted with about 80% of that in total expected to be invested in the first half. A good chunk of that amount in the fourth quarter, over half of it, was a onetime expense related to the impact of vesting in performance units that were originally issued in January 2020 that hit max payout of over -- of 200% based on stock performance over that 3-year period. I think probably 20% or 25% of it is capital workover and that just happens to be a little bit more front-weighted too, but the bulk of the $72 million to $75 million is infrastructure, and it's really designed to accelerate some of the things we're doing in Lea County, in particular, in the Delaware more broadly speaking."
}