{
    "symbol": "ESTE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 14:20:03",
    "content": " For the second half of the year, we expect to spend between $300 million and $325 million, which includes the additional rig, a few more legacy Delaware Basin wells getting spud and incorporates inflationary impacts seen to date and expected for the balance of the year. With the closing of the Titus acquisition in the associated expected addition of the fifth drilling rig, we expect to spend around $40 million on incremental drilling and completion activity. With our anticipated five-rig drilling program, three rigs in the Delaware Basin, and two in the Midland Basin, we expect to bring online a total of 61 gross, 50 operated wells for the full year of 2022. Looking at the two Southern Midland Basin acquisitions that we closed in the second half of last year, our second quarter LOE per BOE was down 24% and 51% compared to LOE per BOE cost at acquisition. In conjunction with signing the Titus acquisition agreement, which we expect to close on next week, we obtain $400 million of incremental commitments from our existing lenders, which will increase the elected commitments on our credit facility from the current $800 million to $1.2 billion upon closing of the Titus acquisition. We expect to pay around $535 million of cash at closing on Titus, which we intend to draw under the credit facility, which will bring the balance on our credit facility to around $770 million based on our current funding and bring total debt to around $1.3 billion as of July 31st adjusted for Titus. For the second quarter, our debt to annualized EBITDAX was 0.8 times, and we still expect to remain below that 1.0 times debt target â\u0080\u0093 excuse me, debt to EBITDAX target at year end, including the impact of the acquisition of the Titus assets. With our earnings release, we provided updated guidance for the balance of the year, which accounts for the incremental activity on our base drilling program, as weâ\u0080\u0099re drilling a little faster than expected on the Delaware side, but also to account for the expected closing of Titus in the addition of the fifth rig and also to account for some inflationary pressures. This represents an increase at the midpoint of a little under $90 million, of this near $90 million about $40 million is related to incremental drilling and completion activity from picking up a fifth rig, and including the Titus acquisition and completions, about $20 million of which is related to increment activity and our base drilling program, and about $30 million of which is really related to inflationary impacts. Yes, I think we have laid it out consistently over the past few quarters, as weâ\u0080\u0099ve continued to gain scale; weâ\u0080\u0099ll work on reducing debt first, weâ\u0080\u0099ll look for other opportunities to grow the business through acquisitions or in this case as weâ\u0080\u0099ve identified this morning, expanding our drilling program by adding another rig."
}