{
    "symbol": "MOGO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 18:20:24",
    "content": " First, today's call will contain forward-looking statements that are based on current assumptions and subject to risks and uncertainties that could cause actual results to differ materially from those projected. Second, today's discussion will include adjusted financial measures, which are non-IFRS measures. With some of our peers seeing revenue fall of over 40% within a few quarters, having a diversified business model is more important than ever. We saw this strength in Q1 with member growth up 62% revenue growth, up 50% year-over-year, and record gross profit of over $12 million. It's important to note that this was also driven by the revenue base of our existing products, which is 95% recurring revenue. While existing business model is strong given the current environment like all companies, we're taking a hard look at where we are investing and ensuring that these are areas that will give us a solid ROI with near-term impact. As you can see, if someone gets on track early, they can easily retire millionaire yet for many without the right program, they may never be in a position to retire. To deliver on this, we continue to focus on building out a next-gen digital wealth building platform that has three primary components, spend management, investing and impact. Although, it may not seem obvious, the reality is most people don't realize the most important part of wealth building really comes down to controlling your spending. As we just highlighted 42% of Canadians are actually spending more than they make, which is also why 68% have debt other than mortgages. Our goal is simple to make it easy for anyone to control their spending, so they have money put towards their wealth building goals. Although, we have lots of opportunities to improve this product, today, it is delivering with 93% of our active users saying and helps them better control their spending, with an average monthly savings of over $200. Now $200 might not sound like a lot, but that's actually the amount that it is best in monthly would put someone on track to being a millionaire. Like the rest of our products, we've also built the impact component into the card, each time they use it a tree gets planted. Besides the $200 month savings, our average card user actually offsets double the carbon footprint of an average Canadian. For a low monthly fee of only 3.99 or members can easily set out multiple goals and depending on their goals and risk profile, Moka automatically assigns them a specific portfolio. Given today's current environment, we think helping people save money is more important than ever. When we acquired Moka, we also knew there was a big opportunity to turn this into a best-in-class long-term wealth building solution. Put the $3.5 million in perspective, today less than 5% of Canadians have a net worth of $2.3 million more. With fees that are usually around 2%, even the fun even if the fund mimics the market, the 2% has a big impact on your total return. This 2% fee would actually result in someone retiring with less than 50%, what they would have, if they invested through Moka. Until recently, Moka was designed primarily as the short-term savings app and now some recent updates we have built, what we believe is arguably the most powerful long-term investing solution in the market, with a portfolio designed to mimic the benchmark S&P 500 Index along with industry leading low fixed fees of only $3.99 a month. Today, Mogo Wealth manages just over $300 million, so you can see how big the growth opportunity is. MogoTrade has been our number one growth initiative for the last year, and we couldn't be more excited for this product. Unlikely U.S. market, commission free stock trading is still new in Canada and MogoTrade is actually only the second commission free trading app in Canada. But the first to also include social impact with every trade, along with FX fees are half of what many competitors charge and, real time streaming prices. Now, although the level of retail training has clearly had a big drop recently, this is still a massive market opportunity, even at the lower levels, and we believe our value proposition will resonate more than ever in this type of market. One of the lessons we have learned over the last year though, is how challenging it is to build a fully regulated product like this. Today, we are still in invite mode and continue to gather great feedback and insights that are helping to improve the product and get ready for a full launch. We expect that by the end of this quarter, we will have the product fully available, which positions us for beginning a marketing push sometimes in Q3. An important point on the regulatory challenges is that, although it can also be seen as a positive in that there's a real barrier entry. And unlike what we saw in the crypto space where anyone could easily launch a crypto app, that's certainly not the case with equities. We also believe that, making a positive impact to your money will become an increasingly important element of what consumers looking for especially the next generation. Today, we are focused primarily on climate change given we see this as arguably the greatest social issue of our time, and one where most people struggle to see how they can make a meaningful impact. The ultimate wealth building solution is one in which our members achieve their most important financial and life goals, while also making the world a better place. First quarter highlights included 62% member growth, record quarterly growth profit, and revenue up 51%, strong positive contribution of $7.4 million in the quarter. And lastly, we ended the quarter with a strong financial position of combined cash, digital assets and our investment portfolio of $75 million, excluding our investment in Coinsquare, which had a book value of 98 million at the end of the quarter. Our new member growth fueled continued revenue growth, which was up 51% over the same period last year. Revenue growth was driven by an increasingly diversified group of subscription services revenue, which increased 78% over the comparable quarter. We believe that our high recurring revenue model is becoming increasingly valuable during this period of financial market volatility that has exposed a number of fintech models that are predominantly reliant on non-recurring transaction revenue, with some companies reporting dramatic declines in quarterly revenue. We however expect to grow revenue every quarter this year driven by approximately 95% of our revenue coming from subscriptions, payment processing interest and other recurring revenue streams. Obviously, MogoTrade once fully rolled out will include more volatile trading revenue. In addition to the recurring revenue nature of our business, we've shown that our business model can generate healthy margins is evidenced by the 7% gross margins this quarter. Also, if you've followed me for some time, you will recall that we generated very strong positive adjusted EBITDA through COVID when we decided to reduce our gross spend. Specifically in the first quarter of 2020, we were able to dial back our cash OpEx by almost 50%, which along with high recurring revenue component resulted in its generating an average of 5 million of adjusted EBITDA over the next two quarters before we decided to resume our gross debt. Another area of significant upside for Mogo is the increasing monetization rate of our members, which we've made good progress over the last year increasing from under 10% to 14%. Also, when you compare average revenue across all our members who are monetized members, you can see that the payoff to continue to increase the rate is significant almost eight times. Outside of our core digital finance products, we also continue to see large opportunity for digital payments Carta despite some of the headwinds we were facing in '22. We believe Carta is a valuable and underappreciated asset of ours and in a growing market poised to benefit from secular growth trends, and we remain committed to growing this business going forward. During Q1, we also announced the formation of Mogo ventures to manage our existing investment portfolio, which currently has a book value on our balance sheet of 119 million. We also believe that portfolio investment is another underappreciated asset on our balance sheet, and we will continue to look for value maximization opportunities from this portfolio over the next 12 months. Finally, with today's results, we also updated our guidance reflecting a shift in the role of timeline and expected contribution from MogoTrade as well as the reduced revenue contribution Carta in the second half of the year due to the deferral of certain customer program rollouts. Despite these short-term headwinds, total revenue still expected to grow between 20% to 25% over 2021. In conclusion, despite the current market volatility, we remain highly focused on building out the leading next-gen digital finance platform in Canada. Some of the stuff we're doing with trade including for example, how customers are going to be funding the account actually hasn't been done before. So, when you kind of get into certain details in terms of the product, how it works, again, the devils in the detail, they get very detailed on the flow of funds, and there's a whole host of things. So these things can take a lot of time and you got to spend a lot of time designing solutions, et cetera, and then based on that, we have to make tweaks to the experience to kind of satisfy the regulatory requirements. The good news is, though, essentially all the items that we were looking to get done, we have approved and that was just a question of refining those, and again, the funding was an example. One of the items that that differentiates MogoTrade is, when you open an account, you'll actually be able to instantly fund it up to $3,000. Look, I think it's too early at this stage for us to give any kind of specific guidance here but I think here's what I will say about this. We believe that we are still very much at the early days, of the disruption that's happening around, trading in Canada. And we believe we have got a unique value proposition, a great user experience and really the majority of trading today is still sitting within the big banks, the big brokers, bank owned brokers. So, we see this product as an opportunity to drive meaningful member growth, member engagement at a low cost CAC, given the fact that we are going to be very early. And we also think that in this volatile environment that, there is going to be a shakeout in the industry, which actually in the long run is going be better for larger, better capitalized diversified players like Mogo. I mean the last product really, we launched, would've been our Bitcoin account several years ago and before that card. So in terms of just kind of scope and complexity including the regulatory, I mean, this is probably a 100x anything we have done, which is why we have obviously been focused on it for the last year. And that's also why we have been really careful on the current rollout, including the invitation process, really making sure that we are getting the right feedback. And because of that, making adjustments to the user experience, and then we are going to be doing the same thing once we take the invitational list off and that's kind of the next phase, we start to get more and more people signing up. You are getting a good user experience, good feedback from existing users, and those are the things you need to see and want to see before you kind of hit the go button on paid marketing, right, which is really when you start to get a good return there. There is actually a 32nd spot that we've created, where we have used an external agency that is essentially going to be ready to go once we believe the product is ready. And just given kind of the lower volumes that we're seeing and the other macro challenges we're seeing, we felt it was prudent to be very, very conservative given we haven't actually fully rolled that product out yet. And what's going on there is we were expecting some rollouts with some of our existing customers, which were pushed out to 2023. So, we still expect to get that, but that's going to happen in 2023. I think it's just obviously, in the current environment putting a level of discipline on the spend here that we believe we'll continue to show our path to profitability. Obviously, we are balancing our the opportunities that we see on the investment side in areas like MogoTrade in areas like Carta, with the more volatile markets and investors concern on path to profitability. I think what makes us unique is we're not just saying we have a path to profitability, we've actually proven in the past our ability to generate positive EBITDA, positive cash flow and do that quickly. And by the way, that was back when we're generating 10 million a quarter revenue now we're over 17 million. And then the other component, which I think, is a really important differentiator, which we've talked about in the past, but the market didn't appreciate it is the high recurring revenue nature of our business. So the reality is, if you are a high transaction fee based revenue business, it's very difficult to figure out how to cut your way to profitability, because you don't know what your revenue is going to be next quarter. But we obviously have spent, a long time building up the recurring piece and that obviously gives us the visibility and the ability to manage our spend towards whatever our profitability targets are. And I mean, look, I think one of our advantages is we have multiple products, and we have multiple ways for members to onboard. And obviously, we're super excited about getting MogoTrade out there. And quite frankly, we see that as one of the biggest opportunities to drive that member growth at attractive CAC level. Yes, I mean, a couple of comments, obviously, there's two ways to obviously grow the business, even if the member base actually didn't grow that much. And that's clearly, getting more adoption from our member base or their existing products. As I mentioned earlier, today, we have, over 100, just over 145,000 subscribers on Moka, but as you mentioned, we're close to 2 million on the member side. So, that's still a new product for us, there's a lot of opportunities there in terms of marketing net to our existing customer base including integration. We just rolled out, as I mentioned in my commentary, essentially updates in the Moka app that also position this as a great long-term wealth building solution of which we believe all of our members need. But to also just give you another perspective, obviously, you look at a company like a bank like RBC, and RBC has over 13 million customer accounts, right, in Canada, right. So, it's a combination of obviously increasing the attachment rate of our existing members based on kind of broader product offering as well as obviously increasing the member base. So, you can still grow your business materially just from your existing member base as you kind of bring in other products along with obviously growing it. I know that, it's always tough for Board to buy back shares and you subject to all kinds of restrictions, volume weighted average price, time of day, blackout all this stuff. So obviously, we don't believe that the current share price here is reflective of the underlying value of our business, nor quite frankly, the assets on our balance sheet."
}