{
    "symbol": "DDI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 16:42:09",
    "content": " Now, I would like to turn the call over to DoubleDown's CEO, Mr. During the second quarter of 2022, we continued our lengthy track record of healthy financial results that are intrinsic to our high-margin capital-light business model. Given our flexible operating model, we also reduced operating expenses excluding a non-cash accrual charges to income in the second quarter by 20% from the prior year partially due to a reduction in overall sales and marketing costs. Average monthly revenue per payer was $226 in the second quarter, a year-over-year increase from $218 in the second quarter of 2021, and up slightly from 2025  in the first quarter of 2022. The increase was due to a non-cash accrual of $71.5 million in the quarter, which was included in general and administrative expenses, reflecting an increase in the low end of the reasonably possible range of loss of $75 million to $201.5 million associated with the legal proceedings related to the Benson class action complaint. Excluding the $71.5 million charge, operating expenses for the second quarter of 2022 were down 20% from the second quarter of 2021 and down 6% sequentially from Q1 of 2022. Of note, sales and marketing expenses in the second quarter of 2022 were $18.1 million, representing a nearly $2 million sequential decrease compared to the first quarter of 2022 and lower than the $20.0 million recorded in the second quarter of 2021. It is also worth noting that depreciation and amortization expenses in the second quarter of 2022 were $1.5 million, compared to $5.9 million in the second quarter of 2021. Net income for the second quarter of 2022 reflected a loss of $34.1 million, or a loss of $13.75 per diluted common share and a loss of $0.69 per ADS, compared to net income of $18.4 million, or $8.32 per diluted common share, and $0.42 per ADS in the second quarter of 2021. Note the weighted average number of ADS is in the second quarter of 2022 were 49.6 million, an increase from the second quarter of 2021 of 44.3 million due to our August 2021 IPO. Adjusted EBITDA for the second quarter of 2022 was $26.1 million, compared to $31.1 million in the second quarter of 2021. Adjusted EBITDA decreased slightly sequentially from $26.9 million in the first quarter of 2022 to $26.1 million in the second quarter of 2022, while adjusted EBITDA margin increased sequentially from 31.5% in the first quarter of 2022 to 32.4% in the first  quarter of 2022, due to the reduction of cost and revenue and marketing and R&D costs. Cash flow from operations for the second quarter of 2022 was $21.1 million, compared to $21.8 million for the second quarter of 2021. At the end of the second quarter of 2022, we had $284.4 million of cash and cash equivalents and short-term investments compared to $268.2 million of cash and cash equivalents and short-term investments at the end of the first quarter of 2022."
}