{
    "symbol": "DDI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 12:19:05",
    "content": " Prior to this call, DoubleDown issued its unaudited financial results for the third quarter 2022 in a press release, a copy of which has been furnished in a report on Form 6-K filed with the SEC and is available in the Investor Relations section of the company's website at www.doubledowninteractive.com. Our high-margin capital-light business model coupled with low debt allowed us to continue generating positive free cash flow, which resulted in an increase in our cash and equivalents at the end of the third quarter to over $310 million. Third quarter revenue of $78.8 million is up 14% from the third quarter of 2019, the most recent comparable quarter prior to the COVID pandemic, but was down from $87 million for the same quarter of last year. Our revenue decrease relative to the third quarter of last year is primarily due to the lifting of COVID-related restrictions that more positively impacted our 2021 results, combined with global inflation and recessionary concerns that are impacting player behavior. Despite these dynamics, we were still able to generate positive business KPIs, including average revenue per daily active user or ARPDAU of $0.96, which is unchanged from the third quarter of last year and average monthly revenue per payer of $225, which is comparable to the third quarter of last year at $224. As a result of this agreement, which remains subject to court approval, we recorded a $70.25 million charge to our general and administrative expenses in the third quarter, representing the incremental charge related to the Benson case in addition to amounts accrued in previous quarters of an aggregate of $75 million. As IK mentioned, we believe revenue was impacted relative to the prior year period due to player concerns about inflation and a slowdown in the global economy, combined with the lifting of stay-at-home or work-from-home COVID prevention initiatives in 2022 that were still positively impacting the business during the third quarter of 2021. In particular, average revenue per daily active user or ARPDAU was $0.96 in the third quarter of 2022 in line with the third quarter of 2021. Average monthly revenue per payer was $225 in the third quarter, a year-over-year increase from $224 in the third quarter of 2021. As it relates to certain operating costs, sales and marketing expenses in the third quarter of 2022 were $17.2 million, representing a nearly $1 million sequential decrease, compared to the second quarter of 2022 and consistent with the third quarter of 2021. It is also worth noting that depreciation and amortization expenses in the third quarter of 2022 were $45,000, compared to $2.4 million in the third quarter of 2021. Cash flow from operations for the third quarter of 2022 was $22.2 million, compared to $33.7 million for the third quarter of 2021. At the end of the third quarter of 2022, we had $310.5 million of cash and cash equivalents, compared to $284.4 million of cash, cash equivalents and short-term investments at the end of the second quarter."
}