{
    "symbol": "FOA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 12:03:04",
    "content": " At this time, I would like to welcome everyone to the Finance of America 2022 Second Quarter Earnings Call and Webcast. Actual results for future periods may differ materially from those expressed or implied by these forward-looking statements due to a number of risks or other factors, including those that are described in the Risk Factors section of Finance of Americaâ\u0080\u0099s annual report on Form 10-K for the year ended December 31st, 2021, originally filed with the SEC on March 15th, 2022. Given the negative impact of raising spreads on our business, we recorded a net loss of $168 million or $0.70 per fully diluted share for the second quarter. The write-downs on the balance sheet were a result of negative fair value marks due to spread widening, and should spreads return to the mean, we would recoup these losses. On an adjusted basis, excluding fair value marks and other items, the company generated an adjusted net loss of $22 million. To combat the operating pressures on our business, we are prudently managing costs across the company and continue to implement expense initiatives to right-size the business as we expect current volume levels to persist into the second half of the year. We reduced our workforce in Mortgage Originations to match capacity with current market demand, taking out roughly 35% in costs on a run rate basis, equating to over $100 million annualized. In Reverse and Commercial Originations, rates and spreads increased at such a rapid pace that we could not reprice loans in the pipeline at the same velocity with which the market moved. And yet despite these increases, we saw record origination volumes in Reverse and another strong quarter from Commercial. As the capital markets stabilize, we expect margins in these businesses to return closer to historical averages, and we will take any additional actions necessary to improve profitability. To summarize, we believe the long-term fundamentals underlying our businesses remain sound, and will allow Finance of America to generate returns in line with expectations. And these are: one, optimizing our mortgage business; two, investing in a Reverse, Commercial, Lender Services and Capital Marketsâ\u0080\u0099 capabilities that collectively form SF&S and separate us from other lenders in the category; and three, leveraging our technology, data and operating model to transform from a product to customer-centric company. Overall, Mortgage volume â\u0080\u0093 volumes decreased at the rap â\u0080\u0093 as the rapid rise in rates lead to a steep decline in Refinance volumes. As the purchase market continues to become a larger part of origination volume, our distributed retail business remains poised to take advantage of this shift. Our Home Improvement business which is included in our Mortgage Originations segment, continues to see steady improvement. With the average age of a Home Improvement customer being roughly 52 years old, thereâ\u0080\u0099s an opportunity to sell additional products like Reverse, offering borrowers yet another option to leverage the equity in their homes. Our second strategic priority is to invest in Specialty Financing Services businesses, comprised primarily of Reverse, Commercial and Lender Services. Reverse origination volumes at $1.58 billion in Q2, set yet another quarterly funding record, and was roughly $100 million above the first quarter. Last month, Finance of America Reverse published its inaugural home equity punch list research study, which found that despite having the most equity in their homes, older Americans are also the least likely cohort to consider using their home equity as part of financial planning. In our Commercial segment, we originated $540 million in funded volume in the second quarter, a slight decline from Q1. In addition, early in Q3, we took actions to reduce the quarterly expense run rate by roughly 25% and expect the segment to show improved profitability for the quarter. In our Lender Services business, we continue to introduce new products to diversify our income stream and offset the pullback in the refinance market. We also continue to build on our existing customer relationships, adding new third-party customers in Q2, and expect these relationships to add incremental revenue over time. Finally, turning to our third strategic priority, we continue to invest in technology, data and our operating models to capture the inherent household value in the respective FOA businesses. And, in addition, we see massive tailwinds for both our Reverse and Commercial businesses over the long-term. As Graham mentioned, we faced several macro headwinds this quarter, which had a direct impact on our operating results and the value of the balance sheet. We generated a headline loss, predominantly due to negative fair value marks on the balance sheet. As a reminder, we account for fair value marks on the balance sheet in the Portfolio Management segment, whereas revenue impacts on newly originated assets are reflected in their respective origination segments. In Q2, rates continue to be volatile, as the tenure increased by 115 basis points to 3.49% on June 14th, and then decreased by 51 basis points to close the quarter at 2.98%, up 64 basis points for the quarter. This meteoric rise in both rates and credit spreads put tremendous pressures on our Origination businesses, and also negatively impacted the balance sheet. We hedged the balance sheet against rising interest rates, using a combination of mortgage MSR assets, TBAs and swaps. The fair value marks are net of hedge gains and consists predominantly of spread impacts, as we are unable to efficiently hedge the balance sheet against spread movements. Any future reduction in spreads would result in positive fair value marks, allowing us to recoup these losses. Turning to the operating results, the company generated an adjusted net loss of $22 million and a fully diluted adjusted loss per share of $0.12, as our Mortgage Originations segment continue to be pressured by the rising rate environment. During the second quarter, Mortgage Originations accounted for $21 million of the $22 million in adjusted net loss. From a balance sheet perspective, cash remained relatively flat in Q2, decreasing by $8 million, as hedge gains recognized in the quarter we used to deleverage and strengthen our balance sheet. Tangible equity decreased by $155 million, predominantly due to the impact of non-cash fair value marks from wider spreads. Turning to our individual reporting segments, revenue in Mortgage Originations decreased by 24% relative to the first quarter, due to a 29% decline in net rate lock volume. As a steep decline in refinance volumes more than offset the 21% growth we saw in purchase volume, quarter-over-quarter. As a result, we recorded a $21 million adjusted net loss. As Graham mentioned earlier, we have taken decisive action to manage expenses in this business, to return to profitability at lower volumes. In addition, we are encouraged by the strong quarter-over-quarter growth in funded purchase volume, and our distributed retail model is well suited to capitalize on this market. Our Reverse Origination segments saw 7% quarter-over-quarter growth in funded volumes, setting yet another quarterly funded volume record. However, rapidly widening spreads had a substantial negative impact on margins, despite repricing the pipeline and increasing rates multiple times. As a result, revenue of $80 million was down 26% relative to the last quarter. The Reverse Origination segment generated pre-tax income of $36 million, down 32% from Q2 last year, as a substantial increase in volume was more than offset by lower margins. Similar to what happened in Reverse, our Commercial Originations segment was significantly impacted by market volatility this quarter. Lender Services revenue was down 24% quarter-over-quarter, as lower refinance volumes impacted our Title Agency and Underwriting businesses. Lastly, looking at our Portfolio Management segment, pre-tax income was negatively impacted by the fair value marks on our assets. Our SF&S businesses faced consistent pressures, yet remained essentially breakeven in Q2, and on an adjusted basis, against the backdrop of non-agency credit spreads at new highs. On a year-to-date basis, Finance of America has generated $15 million in adjusted net income, and we will continue to take the necessary actions to improve the profitability and ensure the long-term success of the company. As we look to the third quarter, we do expect volumes in Reverse to come down from recent record highs in response to low refinancing activity. In general, we expect profitability levels for the third quarter to fall somewhere between Q1 and Q2 for both Mortgage and SF&S, given our expectation that our increased margins will not be fully realized until the latter half of Q3. Yes, as I mentioned, right, in our Reverse channel, right, weâ\u0080\u0099re continuing our education to seniors, weâ\u0080\u0099re looking to partner with some strategic relationships that will help improve the penetration. In our Mortgage business, weâ\u0080\u0099re actively looking to fill in areas of whitespace in the country, where we donâ\u0080\u0099t currently have a presence, and with some additional customers into the organization as well. Iâ\u0080\u0099d also add to that, right, our ability to grow our customer base to the Home Improvement segment, and bringing additional borrowers in via the Home Improvement loans that we do today â\u0080\u0093 via contractors. And so, as weâ\u0080\u0099re seeing a shift away from Refinance into new to Reverse, thereâ\u0080\u0099ll be you know some softening of volumes. Youâ\u0080\u0099re in a position right now where youâ\u0080\u0099ve got $219 million in cash or cash equivalents and you got a short position ranging of 3% on the stock and I think all of your upside is in front of you, just listening to your narration, your articulation relative to the scope of the business. Is there any thought process or strategy to announce some sort of repurchase of shares, you have the ability to arbitrarily repurchase shares at your option, and I think if you defend the stock, I think youâ\u0080\u0099re going to get a little bit more momentum and especially with your ability to execute on you know your strategy in the Reverse Mortgage market, which I think is, I think youâ\u0080\u0099re totally correct with that. The first reason is, we see as you mentioned, continued growth in the Reverse business. The second thing Iâ\u0080\u0099d say is, until we can see some stability or less volatility in the market, you know I think our Collective Management team thinks itâ\u0080\u0099s prudent and better for us to maintain liquidity. You know until we see things stabilize, it just creates a little bit more stability and takes some risk out of the balance sheet in the operations on a day-to-day basis. Ladies and gentlemen, this does conclude the Finance of Americaâ\u0080\u0099s second quarter 2022 earnings call and webcast."
}