{
    "symbol": "FBP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 15:07:03",
    "content": " We earned $73.2 million or $0.40 per share in net income achieve, or $122.2 million in pretax provision income and reached an efficiency ratio of 48% even lower than the prior quarter. In line with industry trends, core deposits decreased by $250 million or 2.3% during the quarter, which was actually slightly better than the local market trend for the quarter. We raised our organic loan growth of $762 million when we have two PPP loans on the strategic reduction of residential mortgage, earned 5 million in net income and achieved a record pretax pre-provision income of 475.3 which is up 21% when compared to 2021. In interest income, commercial loan interest income grew $8.2 million, $8 million resulted from repricing during the quarter and we also had about $1.1 million associated with higher loan balances. Just looking at the balance sheet, interest expense grew $11 million, 45 basis points increase from 37 basis points we had last quarter to 82 basis points this quarter. In addition, in the quarter we did have $2 million increase in cost of borrowings, $700,000 relates to repricing of loan great debentures and the other 1.4 million it's basically increasing and the size of the borrowing portfolio FHLB advances and repose. For example, you look at balance as at the end of the year loans were $187 million higher than the average balances for the quarter. In terms of asset quality, as Aurelio made reference, we continue with a very stable asset quality, non-performing decrease $14 million in the quarter, stand at $129 million which is 69 basis points of assets. In terms of net charge offs for the quarter were $13 million, which is 46 basis points of loans compared to 31 basis points last quarter, mostly related to a consumer portfolio. And it's about $7 million lower -- I mean, I meant to say $2.5 million lower than the third quarter -- higher than the third quarter and $7 million lower from last year. The ACL was -- on just loans was $260 million, which is $2.6 million higher than last quarter. Well, again, the securities portfolio, it's given us somewhere approximately $150 million per quarter in cash flows. The cash flow has been fairly consistent over the last few months, it's -- we are expecting, like $45 million a quarter between 40 and 50, it's would we have seen -- a month I'm sorry."
}