{
    "symbol": "FBP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 09:06:06",
    "content": " Obviously, we could see an improved long-term economic outlook in Puerto Rico that also prompted the recognition of a provision benefit of $13.8 million during the quarter. Asset-quality as it continued to improve, non-performing assets decreased by $1.6 million to $156.5 million, primarily driven by the reduction in non-accrual resi -- residential mortgages and the ratio of the ACL to loans and finance leases decreased to 2.21%. After concluding our '22 capital planning process, we announced last night that we're very pleased to announce the approval of another $350 million share repurchase program to be executed over the next quarters and an increase of 20% to our quarterly common dividend. Looking at the specifics, the quarter showed improvements of $1.5 million in net interest income, $2.5 million in other income and expenses were $4.8 million lower than last quarter. But going to the provision, the provision for the quarter was a net benefit of $13.8 million, similar to the $12.2 million benefit we had in the fourth quarter of 2021, driven by the outlook, the positive outlook on the macroeconomic variables, both actual and expected even within the uncertainties going on the -- a war on Ukraine and some of these impacts as they relate to the qualitative factors that we have on the reserves. But in reality, it's all related to $17.2 million in loans that mature in the quarter are in the process of being renewed commercial loans specifically. During the quarter, we did have an impact on tangible book value of common share, which decreased from $10.07 at the end of '21 to $8.63, decreases related to the $50 million in repurchases but more important on $132 million adjustment to other comprehensive loss resulting from the fair value, the decrease in fair value of the securities available for investment based on market interest rates. Clearly, we had originally provided a higher number of $117 million to $119 million after integration and looking at all the components and what's been renegotiated on the contracts -- we feel those expenses, combined with some of these difficulties in getting things on should be more on the $114 million to $116 million range."
}