{
    "symbol": "FBP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-22 12:25:40",
    "content": " As we reported, we continue to perform exceptionally well during the second quarter, we earned $74.7 million in net income or $0.38 per share and delivered our fifth consecutive increase in adjusted pre-tax, pre-provision income by reaching a record of $118.8 million during the quarter. Asset quality continued to improve during the quarter with nonperforming assets decreasing by $9 million, now to $147 million, driven by reductions in non-accrual residential mortgage loans and pay downs of non-accrual commercial loans. Loan portfolio balances, other than PPP loans grew by $144 million when compared to first quarter, driven by increases of $131 million in consumer loans of $59 million in construction on commercial loans. Total loan originations for the quarter were strong, which, excluding credit card utilization activities reached $1.4 billion, an increase of $281 million when compared to the first quarter. The net interest income totaled $196 million in the quarter, which is an increase of $10.6 million, I just mentioned, as compared to $185 million we had last quarter. If we look at components, loan repricing in the quarter represent approximately $3.5 million of the increase in interest income for the quarter and the increase in the portfolio balances, if we exclude the PPP reduction, represent additional $1.9 million in interest income. During the quarter, we also had -- this second quarter, we also had a $1.7 million in expense reductions considered with the resolution of matters that had been previously accrued, which improve the expense base. Looking at some of the other large components, we saw employee compensation and benefit increased $1.7 million this quarter and we expect some additional increases in the third quarter as we continue to fill vacant positions and execute the salary merit increases that we have planned for the third quarter of the year. If we exclude OREO and the other two items I mentioned on expense adjustments, with the second quarter -- expenses would have been about $111.5 million in the quarter. And for the fourth quarter we see expenses excluding the OREOs in a range of $114 million to $115, slightly lower than we had originally mentioned to you on the last call. And inflows to non-performing loans decreased in the quarter by $5.2 million, last quarter was -- we had $21.6 million in inflows, this quarter was only $16.4 million on the overall portfolio. Early delinquency, which is defined as 30 days to 89 days past due also decreased by -- in the quarter they were lower by $8.2 million, primarily for commercial relationships that ended up being renewed, that matured last quarter and will renew this quarter. Net charge-off, as I mentioned, for the quarter were lower, they stood at 21 basis points, that includes a $1.2 million in commercial loan recoveries, compared to 24 basis points we had in the first quarter. The allowance for credit losses at the end of the second quarter was $264 million, it's $4 million higher in the last quarter. The allowance on  (ph) loans, it's $252 million, itâ\u0080\u0099s up $7 million, which reflects basically the increase in portfolio balances, as well as the additional uncertainty that has been reflected as part of the forecasted economic variables that I mentioned before. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}