{
    "symbol": "ESTC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-03 22:02:04",
    "content": " So as we think about what we are doing today, we are continuing to make sure that from a go-to-market standpoint, we focus, first and foremost, on cloud, where there is demand in our customer base new customers are coming to us on cloud, existing customers as they increase workloads, they are tending to increase them disproportionately on the cloud, and that’s good for customers, and it’s something that we absolutely are leaning into. We see that as something that’s good for customers, that’s good for our business, and we’re going to continue that, not only in the go-to-market side but also in the relationships that we formed with the cloud hyperscalers and also on the R&D side, of course. So if I think about the business going forward, we will continue to focus on revenue, particularly because when you look at the monthly cloud business, which is now 17% of revenue, that has no deferred revenue, and that’s a significant enough portion of the business that it just makes the calculated billings conversation less relevant. Ash if you look at the big guys like us like Barclays signing up and being in the cloud with you observability, etcetera, as well, can you maybe talk a little bit about like what is – kind of what’s the message there in terms of how comprehensive your stack is because you obviously, you were known for good lock and log management. So from my perspective, I’m really actually enjoying spending time with the teams because to me, as I think about our go-to-market and the fact that we’ve got this massive opportunity in cloud, it’s really important to make sure that I understand and continue to drive the cloud motion, the solution motions that we have that are working so well throughout the organization and define the plan for FY ‘23 that’s going to allow us to make sure that, that bias in the cloud is even greater than what it has been. From a product perspective, what are the things that you are looking to invest in the cloud platform that would make it a no-brainer for an initial customer who might otherwise be predisposed to the on-prem Elastic question because it’s got such a rich legacy. In the press release, you must have seen some of the work that we have done to make it easier for prospects when they come to the AWS marketplace to start a trial for Elastic Cloud and the integrations that we have done for cloud-native data coming from AWS directly into Elastic Cloud, that’s really very valuable to our joint customers, and that’s really helping strengthen that partnership. In terms of just thinking about monthly and annual and an apples-to-apples way, it’s still probably best just to look at revenue, particularly since the vast majority of our cloud business is now consumption-based."
}