{
    "symbol": "PAAS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 14:31:16",
    "content": " I would now like to turn the conference over to Siren Fisekci, VP Investor Relations. Please see the cautionary statements in our MD&A, news release and presentation slides for our Q2 2022 unaudited results, all of which are available on our website. I'll now turn the call over to Michael Steinmann, Pan American's President and CEO. Thank you, Siren and welcome everyone to our Q2 call. In Q2, we produced 4.5 million ounces of silver, led by strong performance at La Colorada. Production at La Colorada was up more than 50% from Q2 last year to approximately 1.7 million ounces, reflecting the improved ventilation conditions in the mine. In July, the new refrigeration plant began operating, which we expect will further improve working conditions in the mine. Gold production was 128,300 ounces in Q2, despite lower than expected production at Dolores from Phase 9B, which also reduced consolidated silver production. This stems from the shortfall in grades from Phase 9B and the resulting production year-to-date being less than expected, which triggered an analysis for impairment. Incorporating higher cost assumptions, especially affects the value of a shorter live assets such as Dolores. Of course, this is highly dependent on metal prices and costs over the coming years and will be adjusted accordingly. However, this high grades were not fully realized and we now believe the high grade intercepts contributed to localized overestimation of the combined ounces within Phase 9B. We recorded $99.1 million impairment charge for Dolores in Q2, and together with $62.8 million net realizable value inventory adjustments primarily at Dolores shows the net loss of $173.6 million or $0.83 loss per share for Q2. Cash flow from operations totaled $20.8 million, which includes $42.4 million in cash taxes, and the $19.5 million build up in working capital. Moving on to our guidance for 2022, we are maintaining our production guidance for both silver and gold, but expect to be at the low end of the ranges. The slides on our website that accompany this conference call include the quarterly breakdown of production in 2022, which further clarifies our expectations for the year which have always been weighted to the back half of 2022. Cash costs for the silver segments were $12.10 per ounce, and $1,132 per ounce for the gold segment in Q2. All operations were negatively impacted by inflationary pressures, particularly from increased diesel prices, and certain consumables, including cyanide, explosives, and steel products, such as grinding media, as well as supply chain shortages. Further, we are experiencing cost increases in services and other supplies indirectly due to the inflationary impact of consumables on their input costs, particularly diesel fuel. In addition to these global inflationary pressures, gold segment cash costs were impacted by the lower grades at Dolores and at Shahuindo and La Arena from mine sequencing. Excluding net realizable value, NRE adjustments, silver segment all-in sustaining costs are $15.90 per ounce. Both segment all-in sustaining costs were $2,051 per ounce, and $1,540 per ounce, excluding NRV adjustments. We are increasing our guidance for gold segments all-in sustaining costs to between $1,400 and $1,550 per ounce, excluding of NRV inventory adjustments as a result of increased capital spending and the great shortfall at Dolores. Rather than funding these projects through construction loans as we had originally intended, we will fund them directly through cash flow, which will be offset by a decrease in future expected cash flows and loan obligations. Total capital spending is now expected to be between $295 million to $310 million in 2022, up slightly from our original guidance of $280 million to $305 million. In addition to completion of the refrigeration plant, we have set the Galloway structure during the quarter, and now installing the head frame employees for the concrete line ventilation shaft. Yesterday we provided an update for our consolidated reserves and resources as of June 30, 2022, which demonstrated reserve replacement at our most significant mines. At Huaron, we replaced 165% of the silver mine last year. Timmins replaced 26% of the gold mine and added a further 53,000 ounces to inferred resources at Timmins West. On July 21, we announced the most recent results for the La Colorada Skarn, which included the highest grade intercepts to date of 97 meters at 654 grams per tonne of silver, 15.35% lead and 11.38% zinc. This most recent drill results will not be included, because they were drilled after the timing cut off for the new resource estimate. At Escobal, the ILO-169 consultation has now progressed to the consultation phase from pre consultation with the next meeting scheduled for August 21. We look forward to participating in the next phase of the consultation process, and to listening to the Xinka People regarding their perceptions about Escobal in an open, inclusive and respectful process. We're hosting our third annual ESG call on September 22nd, when we will provide more information on our progress, and areas for improvement. In closing, we remain in a solid financial position with cash and short-term investment of $241.3 million, and an undrawn line of credit of $500 million. As you mentioned, I think mining will likely last another two years, and that sounds like residual leaching until year 2030. Actually, the mine plan and the open pit mine did not change the timing -- the two years. As I mentioned in the call, that obviously is going to be an economic analysis that happens every year, right, when you go to whatever 2028, 2029, '30 depending on cost and metal prices, et cetera how long that leach cycle will continue. Yeah, the only thing I would add Cosmos is that the original plan we had after open pit mining ended, we had some stockpiles we were going to run through the plant for -- I think it was initially estimated for a couple of years. If you look at our current life of mine open pit plan, but tons of ore really hasn't changed much at all. And number two, as you said the underground has now been suspended, how easy it is, based on metal prices, maybe hopefully, higher metal prices later on. The current book value is around $260 million, and that includes both the PP&E and the leach pads. And then relative to the underground, yes, we are keeping the dewatering pumps running because that does help in the open pit as well. So we could go back in, there would be a bit of development work that would have to be done towards the open pit to open up the additional ore reserves that moved to resources. But apart from that, everything's in good shape to leach them. Maybe switching gears a little bit onto more positive news, Michael, it certainly sounds like there's positive progress being made at Escobal. Definitely, the change there as we described in the press release that we are now moved to as it's locally defined, is Phase 2, which is the consultation itself. During this phase, the Guatemalan Ministry of Energy and Mines, which leads that process, is a form of dialogue process that stated the aim to identify and clarify baseline conditions, describe potential impacts and define possible impact mitigation so. The Xinka indigenous communities, the Ministry of Mines and -- Pan American Guatemala are obviously a subsidiary of Pan American Silver, are participating in that process. So there's a lot of details on so far what happened in Guatemala on the process, and what's to come on MEM, the government website, so I would refer everybody to that. There's a link, I believe on our Escobal section on our Pan American website. And maybe one last question again, something else here. Provisional pricing, I think, I read in your MD&A that there was a $9.3 million negative price adjustment, which is understandable for the quarter just given the decrease in base metal prices. So I'm trying to reconcile that because I saw that the realized prices for the quarter was 4.42 per pound copper, 1.73 per pound zinc, which is not that bad. Yes, the provisional price adjustments are just a function of the amount of metal that has opened QPâ\u0080\u0099s quotational prices at the end of every quarter. At the end of Q2, we had about 1.2 million ounces of silver that didnâ\u0080\u0099t -- the prices were so open and around thousand ounces of copper approximately and around 3,800 ounces of zinc. But it does vary quarter-to-quarter we do monitor it, and obviously given drops in prices, thatâ\u0080\u0099s what impacts it. Hopefully, I'm not going to repeat too much of what Cosmos just asked. And what I'm trying to get at, I guess, is just trying to understand what would need to change going forward that would let you bring it back online. Alright, Trevor, I assume you're talking the underground mine suspension at Dolores, specifically. Yeah, so it's really, it was truly a function of costs and development needs. I think we've talked in previous quarters, that the residual, the remaining reserves that we had on the books to be mined, was in and around the open pit mine. And now with these increased costs as we look at it and what it takes to develop back in there, at these current cost levels, we just didn't feel the margins were worth pursuing. So if cost structure changes, if metal prices changes, by all means that would open back up and we can get in there and get the residual part of those reserves get moved to resources. I wanted to ask a really, really sort of like, high level big picture question about Dolores and the Minefinders acquisition. So as we approach the end of life at Dolores, I mean, I think it's pretty fair to say that it's kind of underperformed expectations since the Minefinders acquisition back in 2011. Well, I think one of the major differences is when -- remember, the acquisition happened in 2012 at substantially much, much higher metal prices, and while we did a lot of analysis at different metal prices I believe at that time, silver was probably in around $30. Definitely, now, of course, much higher cost that we see. But there's still some time left, but it's a shorter life now and obviously, we will need to see quite some changes in metal prices or cost as Steve said to like, to for example, restart the underground. Yeah, just add to what Michael said, Lawson, and clearly the margins are squeezed greater than we thought, given the metal prices weren't as high as what we used for the acquisition basis back in 2012. And then the cost kind of squeezed on the other side too, so the margins were not as prescribed given most factors. But mine overall, despite this issue of what we're facing today at 9b in the open pit, the mine resource overall was performed I think pretty close to the expectations all in all. But apart from that, it was really the margin squeeze based on price and cost. We've already talked a lot about Dolores, I wanted to ask just about a few of the other assets. No, we're strictly mining in the oxide zones. We know pretty well based on all our modeling where that boundary is, and we were pretty well above that and we're outside of that. Currently, I think we think the economic pit depth limits are going to be above that zone. We're still drilling, we're still going down. And we don't really mine any of that sulphide ore, it doesn't really recover on the leach pads. Just to add something to La Arena and you probably heard in the call that I mentioned, also in the press release that we again replaced 46% of the gold ounces mined. But just astonishing when you think in our purchasing model, we assumed that La Arena will be mined out, the offsets will be mined out, I believe it was mid-2021. With the new reserve update, I think we go well into 2026 which still quite some update -- upside, we're still drilling there and I think there's probably a good chance for more to come. So at least another five years added in mine life up to now with more upside, so very positive story there. I couldn't agree more there, thatâ\u0080\u0099s certainly been a very -- thing. So in Q2, you had really, really strong lead production and then a little bit lower silver production. Certainly, as the amount of different veins we have from , which is high copper, we've got all these different structures with the lead and the silver more predominant, or we've got lead, zinc, silver, copper, et cetera. And certainly we would be performing to budget and forecast, and so I think you can expect potentially us reverting back to our budget. I just would add to what Chris said, Lawson, Steve here is, to be honest we really drive that plan on NSR and from a corporate mine planning perspective, the sequencing is really related to the development and the opportunities that the team has to develop into different zones. So I'd say it's hard for us to predict exactly what's going to happen in the second half, but I think generally we will probably not see the same degree of lead, maybe a little bit more copper is my general gut sense going into the second half, but not materially different. And then just following the same theme here at Huaron looking at the reserves, 165% replacement of silver ounces. Huaron is a long time with the company, I believe soon we will be -- probably soon having two decades of -- probably most reserve replacement at Huaron. And of course, much easier, that stands to replace your reserves in the vein deposits than in an open pit where you're bound to pitch out. I guess you were asking about the lead, obviously you have silver production guidance for each mine, but undermined by mind level, there is no base metal production guidance. And I recall years ago going to the Marlin Gold Mine, where the local people spoke a language called Mam. Would you say that 100% of the consultation involves things that Pan Am can control and manage or does the consultation stray where a large fraction of it is contemporary social issues of the country or the last 500 years where the Xinka people might not have been represented by the government or 1700s, the Catholic Church paid bounties on Incaâ\u0080\u0099s scalps, things like that. And there's a Xinka language, but the meetings are held in Spanish right now. We expect that we're going to be providing information as a company, the Ministries of Health, Culture, Environment, and Energy & Mines will be presenting information about the project as well as the company in the next few months. I think at that time, you will hear specifics about the concerns, and the then weâ\u0080\u0099ll have to address what the government is going to do and will probably be asking the company for what are the mitigations might be possible, so we expect that to be developing in the news coming up in the next few months. So up to this point, the meetings have really been about the process itself. And again, I expect that we'll get into those kind of details that you're asking about over the coming months, that's things that we discussed as the information is presented, the concerns are raised and then the issues are resolved. Basically, no, the outlook at those mines hasn't changed. So Don, as you know, we are always very active on the business development side. There's different ways to do that, one is exploration. As I mentioned before, there was a lot of strong replacement of our reserves in many of our flagship assets. Like the example, I gave at La Arena, I can give that example for several mines here. And I would really like to add there, the Skarn discovery. I think when you looked at the last results we published, and this is becoming a really, really big discovery. We will publish the new resource update at Skarn, I would say probably within a month time or so. But as you can imagine, the old resource we have that is currently on our books already, 100 million tonnes. And then the third way is obviously acquisitions, which we always have to look out there to see what there is either an earlier stage project or later stage. As I always stated, we are very picky on that because we want to -- we're looking for acquisitions that are accretive. So it's really those 3 pillars, not different than for any other mining company, I would say, we're in a very strong financial position. But as I said, now I mean we have shown over years and years and years on our exploration success, and I think that really got topped with the Skarn discovery at La Colorada. Shifting over to La Colorada, performed well, and I see that some of the access to high-grade zones resumed, thanks to the ventilation. Certainly, on the throughput side, this ventilation is really, really helping us a lot and the refrigeration plant is also helping a lot. So it is allowing us to catch up, if you will, on ground control and development into the areas that were originally scheduled to mine a couple of years back. So we do anticipate seeing throughput come up, but we do think grades will kind of maintain in and around the reserve grade of the deposit. We see this as a very long-term asset, and we'd like to mine it consistently at reserve periods as we go forward. Just to segue into the Skarn then, we're all excited to see the resources. There's a lot of work right now going on, as you can imagine, as it is so large and a lot of decisions on the mining method. So we're talking about a few weeks here, not a major change and well within Q3 that we will publish those new resources. In terms of the mining method, I mean, we are making great progress in evaluating this bulk mining method that we talked about a couple of quarters ago. And correctly, we've got a lot of really high talented consultants who have developed these things around the world. So we need some time to work through that and be comfortable before we start coming out with mining plans, mining costs, things of that nature. Thanks, operator, and thank you, everyone, for joining us on this call."
}