{
    "symbol": "SYY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-08 12:10:06",
    "content": " I would like to highlight again that Sysco's sequentially improved sales and volume performance every month compared to 2019 levels until the impact of Omicron began being felt Thanksgiving weekend, and we are confident that we will get back to that growth pattern as Omicron receives. The increase in gross profit was driven by year-over-year improvements in volume versus fiscal 2021 and compared to the same quarter in both fiscal 2021 and fiscal 2019, increases in gross profit dollars per case across all four of our reporting segments as we successfully managed increased costs for our product suppliers while addressing some, but not all, of our increased operating costs. Turning back to the enterprise, adjusted operating expense came in at $2.4 billion with a combination of planned and unexpected expense increases from the prior year, really driven by four things; first, the increased variable costs associated with significantly increased volumes. Pennies that we could save from furloughing staff in December and January, would cost us twice as much as we attempted to restock the bench and bring people back off furlough because in today's labor environment, we furlough someone, they're going to get a job in another industry at another company. So it seems like the end zone is still at the same spot, but just wondering whether there's a concern that there's more of a hockey stick type recovery or whether you still believe that starting in the back half of fiscal 2022, a lot of the initiatives you put in place are really going to start to bear fruit putting aside kind of the Omicron variant. And just the power of that data being provided to our sales reps and also to the customer through Sysco shop, it's going to increase penetration with existing customers, which is the best way to improve profitability for a distributor like us, but it's also going to enable us to win new business."
}