{
    "symbol": "POWL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-06 15:49:07",
    "content": " And good morning, everyone. By market sector revenue from our oil and gas markets totaled $60 million and grew 24% compared to the prior year, while our utility revenue grew to 42% to over $40 million. And good morning, everyone. Revenues for the fourth fiscal quarter of 2022 increased by 26% to $163 million, compared to last year's fourth quarter of $130 million. Net orders for the fourth fiscal quarter were $259 million, a $138 million higher than the same period one year ago, and strong demand spanning across most of our core end markets. Compared to the fourth quarter of fiscal 2021, domestic revenues of $133 million increased by $38 million or 41%, while international revenues decreased by 15% to $30 million on the winding down of large customer projects in the Middle East and Asia. We reported $33 million of gross profit in the fiscal fourth quarter of 2022, which was higher by $11 million, or 49%, versus the same period in the prior year. Notably, the margin rate also benefited from the favorable closure of a long-standing prior year claim related to costs associated with a US based municipal project, which generated $2.5 million of gross profit or an incremental 130 basis points to the margin rate in the quarter. Selling, general and administrative expenses increased by $4.5 million or 27% in the quarter versus the prior year, attributable mainly to variable performance-based compensation. SG&A expenses were $21 million in the fiscal fourth quarter or 13.2% of revenue, compared to 13.1% of revenues a year ago, and the higher volume in fiscal 2022. On a net reported basis, fiscal fourth quarter net income was $8.7 million, or $0.73 per diluted share, which included $2 million of nonoperational income attributable to the previously mentioned prior year municipal project cost recovery, generating $0.17 per diluted share. Orders were $719 million, 78% higher versus fiscal 2021 led by the sustained recovery of our oil and gas end market, coupled with the continued market penetration in the utility sector and the incremental growth in the commercial and other industrial end markets. Based upon our fiscal year end order book at $592 million, coupled with the strong commercial activity that we're presently experiencing, we anticipate solid revenue growth into fiscal 2023 versus the prior fiscal year. And then there is the element of the strategic side where the team did a nice job taking a risk approach to other projects out there to expand our services both on the front end of the project as well as the back end of site services to prudently look at the jobs and make commercial tenders into these markets to test our strategies and to build capability into the team, and we're successful throughout the year, these jobs tend to be a little quicker on the cycle than a long run capital project."
}