{
    "symbol": "POWL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-08 15:17:03",
    "content": " Our results in the second quarter saw a strong sequential uptick in new order activity, as well as year-over-year revenue growth of 8% as our customers and end-markets continued to recover from the pandemic induced downturn. Then our industrial markets, revenue from our oil and gas sector increased year-over-year by 7% for the second straight quarter, while the petrochemical sector increased by 85%, after growing by 88% versus the prior year in the first quarter of fiscal 2022. While, we see our second quarter results as another step in a positive direction, perhaps most noteworthy is the fact that we continue to see an encouraging and broad recovery in overall order activity, despite the slower recovery dynamics of our industrial end-markets These are legacy markets for Powell that have historically constituted the majority of our order book and revenues and while we have been experiencing a steady increase in cost estimating activities across an increasing funnel for our industrial end-markets, including our core oil, gas, and petrochemical customers, capital spending still remains modestly below pre-pandemic levels. Offsetting the pace of the industrial recovery, during the second quarter, the business recognized a greater proportion of utility and light industrial orders, while also continuing from the first quarter of fiscal 2022, our Global Services team has delivered a strong performance in line with our strategic objectives. In the second quarter of fiscal 2022, we reported net revenue of $128 million, higher by $9 million or 8% versus the same period in the prior year. New orders booked for the second fiscal quarter of 2022 was $151 million, $62 million higher versus the prior year and $43 million higher sequentially. As a result, our book-to-bill ratio based upon reported orders was $1.2 million in the period, with $440 million of backlog at the end of the second fiscal quarter, which was $3 million higher as compared to the same period a year ago. Compared to one year ago, domestic revenues were slightly lower by 1% versus the prior year to $87 million, while international revenues were 33% higher compared to the prior year, driven by strong value across all of our traditional international markets based in Canada, UK, and the Middle East. Offsetting these year-over-year revenue increases, our traction sector was lower by 34% versus the second fiscal quarter of 2021 on the timing of new large traction projects. So, first I'd say, on a total year basis, the effective tax rate when we are near at or near breakeven, very, very difficult to predict, but considering the commercial activity that we are seeing across our light industrial and utility end-markets, especially during the second quarter here, in conjunction with the gradual recovery that Brett mentioned across our core industrial end-markets, we anticipate additional revenue and margin versus our prior estimate on a total fiscal 2022 year basis."
}