{
    "symbol": "POWL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-09 14:41:19",
    "content": " New orders placed in the first quarter included $122 million of gross new orders, partially offset by a $14 million scope reduction on a previously booked project for a total of $108 million of net new orders. The $122 million of gross new orders is modestly higher than the prior quarter, and is an increase of 34% from the prior year. In the first quarter of fiscal 2022, we reported net revenue of $107 million flat versus the same period in the prior year. Net new bookings for the first fiscal quarter was $108 million, $17 million higher versus the prior year, which reflected a current quarter reduction in net bookings due to a project re-scoping of roughly $14 million. As a result, our book-to-bill ratio based upon reported net orders was 1.0 in the period, with $416 million of backlog at the end of the first fiscal quarter, which was $49 million lower as compared to the same period a year ago. Compared to one year ago, domestic revenues were higher by 2% versus the prior year to $82 million, while international revenues were 6% lower compared to the prior year, driven by lower project volume in Asia Pacific. As a percentage of revenue, gross profit decreased by 450 basis points to 12.6% versus the same period a year ago, driven in large part by higher raw material costs, which added roughly $2.5 million of additional cost to the quarter, in addition to a substantially lower volume of project close outs from backlogs. In the first quarter of fiscal 2022, we reported a net loss of $2.8 million, or a loss of $0.24 per diluted share, compared to a net loss of $364,000, or a loss of $0.03 per diluted share in the first quarter of fiscal 2021. During the first quarter of fiscal 2022, net cash used in operating activities was $28 million, driven by annual variable incentive compensation, as well as the ongoing build-up of working capital for new projects, as well as the projects currently in the manufacturing stages of production. But what we want to do is first establish in select markets, both in the industrial base, or in certain geographies where this engineered obsolescence is one area that you'll hear us talk about in the future, how can we and we've got some really good examples that have underpin this strategy where we go into a client that we know really well, and they want to extend for various reasons, their installed base, CapEx that they put in 20 - 30 years ago, the engineering strength of power, we should be able to leverage and build that where we can go in and design a custom breaker or a custom low voltage motor control bucket and put it in the existing infrastructure so they don't have to pull out and rip out all of that metal and wires they can get it to take advantage of new technology, new components and extend the life of that another 10 to 20 years so."
}