{
    "symbol": "HII",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 13:33:04",
    "content": " In 2022, we reported record sales of $10.7 billion, net earnings of $579 million and free cash flow of $494 million. Operating income for the quarter of $105 million decreased by $15 million or 12.5% from the fourth quarter of 2021 and operating margin of 3.7%, compared to margin of 4.5% in the prior year period. Ingallsâ\u0080\u0099 2022 revenues of $2.6 billion increased $42 million or 1.7% from 2021, driven primarily by higher revenues in the LHA and DDG programs, partially offset by lower NSC program revenues. Ingallsâ\u0080\u0099 2022 operating income of $292 million and margin of 11.4%, both improved from $281 million and 11.1% last year. At Newport News, 2022 revenues of $5.9 billion increased by $189 million or 3.3% from 2021, primarily due to higher revenues in both aircraft carriers and submarines, partially offset by a lower revenue in naval nuclear support services. At Mission Technologies, revenues of $2.4 billion increased $911 million or 61.7% from 2021, primarily driven by the acquisition of Alion in the third quarter of 2021. Turning to slide 10 and our outlook for 2023, while we continue to expect Shipbuilding growth of approximately 3% over time, our 2023 outlook range of $8.4 billion to $8.6 billion acknowledges uncertainties around the current environment, particularly the labor challenges we have discussed. For Mission Technologies, we expect 2023 revenue of approximately $2.5 billion, organic growth of approximately 5% year-over-year. On slide 11, we have provided an update -- updated view on our free cash flow expectations through 2024, consistent with how we presented this data in the third quarter, this outlook assumes the current R&D amortization treatment for tax purposes remains in place and we are reaffirming the $2.9 billion target. As I noted earlier, we significantly outperformed our 2022 free cash flow expectation of approximately $350 million by accelerating collections. Consistent with our normal seasonality, we expect the first quarter of 2023 free cash flow will be the weakest of the year and given the pull-forward of collections into the fourth quarter of 2022 is likely to be an outflow of $200 million to $300 million. We are reaffirming our capital allocation priorities focused on debt paydown, which is on pace to retire about the $400 million bond this year and the remainder of our Alion acquisition term loan in 2024, and our commitment to return substantially all free cash flow after planned debt repayment to shareholders through 2024. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. So we finished at $494 million, pretty healthy against an expectation of start the year at $300 million to $350 million, we pulled that down to $200 million to $250 million kind of midyear with the re-guide and then Q3 we told you $350 million, we finished $494 million with healthy free cash flow in 2022. And also Iâ\u0080\u0099d ask you to take a look at the three years that we have had, the $757 million, $449 million and $494 million free cash flow. That $757 million really had two things that actually helped it, and if you normalize it out, how to make sense of how we are marching to be north of $700 million in free cash flow as we get out to the 2024 timeframe, but the $757 million had the FICA release, which was $130 million and it also has the COVID repayment benefit for $160 million. So I really look at it, we have normalize for what we have seen because of COVID with FICA and repay, itâ\u0080\u0099s more like a match of $460-ish million to $510 million last year to $555 million, $550 million this year. As I mentioned earlier, we finished 6.1% 2022, we will be in the mid-6s for 2023 and then itâ\u0080\u0099s going to swing down below 5% for 2024 and 2 points of margin against the topline of $10.8 million, is about $200 million. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. But if I just kind of zoom out on the cash flow statement and look at a long history, it sort of ranged $400 million to $600 million for a while and the business is pretty stable topline and margin. The north of $700 million in a few years, I guess, if 2024 is $780 million midpoint about $200 million of working capital, once you get to the working capital goal, you then cease to have positive change in working capital flow to the cash flow. So I walk through how we normalize out the 2021 and 2022 because of COVID that you can see we are incrementally going from that $460-ish million to $510 million to $550 million with the guide of $425 million this year, COVID-adjusted, thatâ\u0080\u0099s another $550 million."
}