{
    "symbol": "HII",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 13:44:10",
    "content": " Ingall's operating income of $50 million and margin at 8% in the quarter declined from last year, primarily due to lower risk retirement on the DDG program, partially offset by higher LPD risk retirement. At Newport News, revenues of $1.4 billion increased by $91 million or a robust 6.7% on from the same period last year due to higher naval nuclear support services as well as submarine and aircraft carrier revenues compared to the previous year. Newport News operating income of $102 million and margin of 7.1% were up from the last year due to contract incentives on the Columbia class submarine program, partially offset by lower risk retirement on the VCS program. At Mission Technologies, revenues of $595 million, increased $201 million compared to the third quarter of 2021, primarily driven by the acquisition of Alion in the third quarter of last year. Cash used by operations was $19 million in the quarter and net capital expenditures were $77 million or 2.9% of revenues, resulting in free cash flow of negative $96 million. This compares to cash from operations of $350 million, net capital expenditures of $73 million or 3.1% of revenues and free cash flow of $277 million in the third quarter of 2021. While third quarter free cash flow was below the projection we provided on our last earnings call, this is simply a function of timing as well as a tax payment of approximately $80 million that we elected to make in the third quarter given the lower probability of delayed deferral of changes to the R&D tax treatment. But you think -- jeez, as think about defense strategy and you think about the CNO NAV plan and the amount of visibility we have right now into what our backlog will be and the demand signal we're going to get in shipbuilding, we have very good visibility and high confidence that we're going to be in a pretty good place over the next 10 to 15 years from a visibility standpoint. And over the last 2 or 3 calls, we've highlighted that as we're working closely with our customer or customer and how the Virginia class and the Columbia class play out, both the additional boats to Block V, the Block VI boats and then we're working closely to program offices as far as what those requirements look like, what are the schedule requirements the both have to fly out here and that drives capacity and capability requirements within Newport News. But obviously, as soon as that loss swings over, as we've been highlighting, it's a $250 million impact, a positive impact to the free cash flow. So I would tell you that, as I told you at the Q3 call that believe it was going to be pushed to the end of the year right now and that's a piece of the uptick that we have in our free cash flow guidance that we gave you. So it's an uptick in -- for this year, it's an adjustment in the free cash flow bridge that we gave you in the briefing and we anticipate paying those back in the first quarter of '23. And then, if you look at Newport News and you back out the Columbia, right, the $41 million, that suggests the balance of the business was at maybe 4% margin in the quarter."
}