{
    "symbol": "HII",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 14:33:04",
    "content": " Moving on to Slide 6, Ingalls revenues of $631 million in the quarter decreased $18 million or 2.8% from the same period last year, driven primarily by lower on the DDG program, partially offset by high amphibious assault ship revenues. Ingalls operating income of $86 million and margin of 13.6% in the quarter were down slightly from last year due to lower risk retirement on the LHA and DDG programs, which was largely offset by increased risk retirement on the LPD program, following the delivery of LPD28. At Newport News, revenues of $1.4 billion, decreased by $17 million or 1.2% from the same period last year due to lower aircraft carrier and naval nuclear support service revenues largely offset by higher submarine revenue. Newport News operating income of $81 million and margin of 5.8%, we're down from last year, primarily due to lower risk retirement on the VCS program partially offset by higher risk retirement on CVN 78. Please go ahead with your question. I would tell you that because of the purchase intangibles both with empty about $30 million in line specifically for 24 net return on sales metric is not, probably a good lead indicator as far as where we want to land that's why we kind of give you the EBITDA perspective from 8% to 8.5%. We take with the CRM or sales light and obviously the margin will follow the sales, so we're comfortable with where we stand and from a perspective of where we could go, we've told you for the year is 8% to 8.5% from an EBITDA perspective as a percent of revenue and from now going through 2024 we've highlighted that it's more appropriate to think about 8% to 10%is is a range at where MT can land. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question."
}