{
    "symbol": "CCL",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-27 13:14:06",
    "content": " As mentioned on previous calls, to help support this growth and drive overall revenue generation over time, I've actively been working with each brand on their strategies and road maps to ensure they have clearly identified target markets, capacity that is appropriately sized to the market potential, demand generation capability to hone in on the target market at the lowest possible acquisition cost, and deliver an amazing guest experience on board to drive Net Promoter Scores and resulting advocacy higher. While we'll always look at opportunistic refinancing opportunities with adjusted free cash for the year expected to be positive, our revolver renewal behind us, more committed export credit financings in hand, our reduced CapEx profile going forward and over $8 billion of liquidity, we believe we are well positioned to pay down near-term debt maturities from excess liquidity and have no intention to issue equity. The improvement was driven by two things: First, $82 million of favorability in both improved ticket prices as net per diems were up 7.5% and higher occupancy of over 91%; and second, $28 million of favorability in adjusted cruise costs without fuel due to the timing of expenses between quarters, both of which were partially offset by a $31 million unfavorable net impact from higher fuel prices and currency. We expect to continue to close the gap as we progress through 2023, setting us up for improved year-over-year adjusted EBITDA starting in first quarter 2024, driven by higher revenue because of the occupancy improvement. Off the base of our industry-leading cost structure, adjusted cruise costs without fuel per ALBD for the full year 2023 versus 2019 are now expected to be up 8.5% to 9.5%. First, with record booking levels on both sides of the Atlantic during the first quarter, we increased the occupancy levels on which our December cost guidance was based, driving food costs and certain other operating expenses higher but also driving adjusted EBITDA higher."
}