{
    "symbol": "ULCC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 21:50:06",
    "content": " In fact, over the first nine months of the year, we've grown capacity about 12%, while increasing total operating revenues by 31% compared to the same period in 2019, demonstrating the strength of our leisure focused ultra-low cost business model. As Barry mentioned, during the first six months of 2022, Frontier operated with the lowest adjusted CASM plus net interest of all U.S.-based carriers, with the improvement in our unit costs during the third quarter and the execution of our cost strategy, we expect our total unit cost advantage versus the industry to expand. But if you look at the increase in propensity to travel and the fact that people are traveling more times per year on at least in their -- in what they've been doing right now and what they plan to do, I think a recessionary impact could only maybe just bring that back to what you had kind of pre-pandemic. One moment for questions. Part of the improvement in unit costs in the last quarter over Q2 and what we're seeing going into Q4 is on top of improving utilization and lengthening the stage really in the airline, is this project that we've been embarking on, which is showing real promise and real savings. One moment for questions. One moment for questions. But look, we will progress through Q1 is always a quarter that's slightly higher cost than the rest of the year, and so your trajectory towards $0.06 for the year, you should see it in Q1 but it'll obviously show up more closer to the second half of the year as you drive utilization and the assets come into the business. We've also â\u0080\u0093 looked, we've also -- as part of our work on November schedule where we've worked on a stream modularity and on thecost change, we've also looked to performance of the network, we've also made changes there that are going to help, drive volume in the business because we're focusing on whether or not things are doing well. One moment for questions."
}