{
    "symbol": "DEA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 15:53:15",
    "content": " Finally, turning to this morning's announcement, at a time when the transaction market is nearly paused, Easterly is pleased to report we've executed our first portfolio disposition with an experienced private buyer of GSA leased real estate. At a time when the market is bringing company's balance sheets into greater focus due in part to rising interest rates, I am pleased with the strength of our portfolio and the actions we've taken to recycle capital, enhance our leverage profile, and position ourselves for opportunities to come. Pro forma for this morning's disposition announcement portfolio metrics look even stronger, with a revised portfolio size of 85 operating properties and 8.4 million leased square feet, either wholly-owned or through our joint venture, our new weighted average remaining lease term is enhanced to 10.3 years and reflects the company's bullseye investment thesis. With the completed sale of the 10 property disposition portfolios subsequent to quarter end, we expect net proceeds will be used to pay down outstanding debt obligations, taking Easterly's adjusted net debt to annualized quarterly pro forma EBITDA ratio down to 6.9 times as of September 30th. This guidance is predicated upon a number of factors, including no additional wholly-owned acquisition activity beyond the approximately $107.7 million already completed year-to-date, the closing of properties in the VA portfolio totaling approximately $145 million at the company's pro rata share, the completed sale of all 10 properties in the disposition portfolio, and no additional material development related investment in 2022. But I also think that there's another factor at play right now, as we saw cap rates compressing at a incredible rate from last November until basically March of last year, basically, from the sixes down to the low fives during that period of time, and everything got compressed, I mean, the good stuff, the okay stuff, and even the bad stuff, which obviously, we were not interested in, were really moving down as you saw a lot of appetite in this particular sector. But we've always, as I said human to the same, same discipline and we always have said that we want to concentrate on those builders who have mission-critical bullseye properties and that's what you're going to see as buy and that's what you're going to -- I think if you see sales in the future for any reasons, they will probably be in the plain vanilla category. When I look at the dispositions, right only two months' impacts and you're going to be -- and that's before you even redeploy the proceeds is probably about -- before you\n Sorry if you make sure that -- is roughly $0.04 due to the due to rates, $0.03 on wholly-owned transactions that are not -- are no longer in our guidance and just about $0.01 for the disposition impact."
}