{
    "symbol": "BYD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 23:19:05",
    "content": " Starting with the Locals segment, revenues and EBITDAR both grew 2% over last year's records with particularly strong gains in our non-gaming business, including hotel, food and beverage, and entertainment. We generated approximately $17 million in EBITDAR from online gaming during this quarter, up more than 100% over the prior year, as we benefited from a strong football season, new FanDuel operations in Louisiana and Kansas and contributions from Pala Interactive, which we acquired on November 1st. So look, I think we've talked about some of this through our prepared comments, but look, the Locals business, once again, we've performed exceptionally well with our out-of-time guests during the quarter as convention attendance and visitation in Las Vegas continued to grow. And I would say as we look back over quarters, earlier in the year, there'd be a soft quarter, an okay quarter and then a really strong quarter, and that's -- sorry, soft month, a good month and then a really strong month, and that's what happened in the fourth quarter as well. So, that's not a driver of -- really, we saw outsized performance in Q4 of last year in those assets, really even superior to what we had seen in the earlier quarters of a very strong 2021. And we've got -- we've had increasing demand for our non-gaming amenities, both hotel and F&B, and we feel like that will continue to be an opportunity as well as depending on how the overall gaming consumer feels and trends for the rest of the year, for 2023, we feel that's also an opportunity to continue to grow loyalty customer. So, again, that's what makes it hard to determine if like there's any relevancy to what happened in the first part of the quarter or not because the business really kind of picked back up with the best part of the quarter being the last week of the year and then just has continued into January. I think, look, I think we -- the Las Vegas Locals, as Keith said in his prepared remarks, really benefited from a strong out-of-town business as well as big demand or stronger demand for our non-gaming amenities, not necessarily opening more amenities, just a growing demand among our customer for that particular aspect of our business. We also saw not only -- well, primarily in Las Vegas, we saw kind of a strong core business, again, supported by out-of-town business from our core customer that just continue to get healthier as we move through the quarter."
}