{
    "symbol": "SPB",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-10 14:32:05",
    "content": " Starting with net sales, which decreased 5.8%, excluding the impact of $39.6 million of unfavorable foreign exchange and acquisition sales of $67.8 million, organic net sales decreased 9.5% from reduced customer replenishment orders and they maintained focus on inventory reduction and from lower consumer demand for hard goods and consumer durables categories compared to last year. Gross proï¬\u0081t decreased $17.4 million and gross margin of 28.3% declined 70 basis points from a year ago, from the reduction in sales and from sales of higher cost inventory accumulated during the prior year. The decline of $1.5 million was primarily driven by lower volume, the unfavorable impact of FX and the impact of capitalized variances as we continue to sell our high-cost inventory last year. Your line is open. you know they are through â\u0080\u0093 they've dropped tremendously, and so that's why we believe â\u0080\u0093 you know as I sit here today, weâ\u0080\u0099re kind of 30 days away from seeing that inflection point actually flow through the P&L, right, because that new inventory at these lower freight costs are starting to hit the balance sheet and as we turn our inventories a little quicker, we think we'll see that margin uptick. We pulled $170 million I believe in inventory out of our business in the last six months, and we're going to continue to drive that down to create cash for ourselves, and so that's the â\u0080\u0093 we've got these working capital in the right position ï¬\u0081nally, and that's something that's within our control. Your line is open. David, I think it was back in the summer, you kind of threw out a number around $400 million in adjusted EBITDA before the company normalized, and I know we are really still in a very tough environment, but I guess, has anything changed over the last six months or so where you feel differently about the earnings power of the company. Your line is open. Your line is open. Your line is open. Your line is open."
}