{
    "symbol": "BNED",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-31 11:09:02",
    "content": " We experienced stronger general merchandise sales, especially within our logo and emblematic products as on-campus traffic grew from increased student recruitment events and other activities as compared to each of the two prior years. In addition to the strength of our general merchandise business, our first quarter results also benefited from the continued growth of our inclusive access programs, which drove a 1.5% increase in comparable course material sales. 111 of our campus stores are utilizing the First Day Complete for this Fall term, representing undergraduate enrollment of approximately 545,000 students, representing an 85% growth rate over Fall 2021 based on undergraduate student enrollment. The adjusted EBITDA loss increased on higher selling and administrative expenses primarily related to the expanded staffing at stores in response to greater on-campus activity and to prepare for the peak Fall term, including support for the growth of our First Day programs, which offset the sales and gross margin improvements during the quarter. On a gross comparable store basis, in which logo and emblematic sales fulfilled by Fanatics and Lids are included on a gross revenue basis, retail sales increased 15% during the quarter, consisting of a 1.5% increase in textbook sales which is incremental to the 21.9% increase a year ago and a 34% increase in general merchandise sales, which is incremental to the 119.4% increase a year ago. Net sales for the Wholesale segment decreased $7.4 million or 16.6% to $37.1 million, primarily due to COVID-19-related supply constraints resulting from the lack of on-campus textbook buyback opportunities during the prior fiscal years and lower customer demand resulting from a shift in buying patterns from physical textbooks to digital products. We also have, as we've noted, 111 campus stores that are utilizing First Day Complete as compared to 65% in the prior year and a significant 85% growth in the number of enrolled students. I think that the fact that we grew courseware sales in the summer, we grew them in fiscal year '22 speaks to the strategy of First Day Complete and why it was put in for exactly that reason, we knew enrollments at least longer term, as you know, are going to be affected by the demographic shift where the traditional college-age student demographic is going to be dropping off fairly dramatically in a couple of years."
}