{
    "symbol": "CPRI",
    "quarter": 1,
    "year": 2022,
    "date": "2021-07-30 14:28:07",
    "content": " Last month, we shared Capri Holdings’ growth strategies and long-term outlook during our Investor Day. Revenue of $1.25 billion increased 178% versus prior year, meaningfully exceeding our expectations. These results were driven by robust e-commerce sales, which increased approximately 60% as well as strong store sales. By geography, the Americas was the strongest performing region with total revenue increasing 304% versus prior year. In EMEA, where an average of 25% of stores were closed during the quarter, revenue increased 148%. Versace revenue was $240 million, 158% increase compared to prior year and above our expectations. For Jimmy Choo, revenue during the quarter increased 178% to $142 million, well above expectations as we began to benefit from our strategic growth initiatives. Jimmy Choo ended the quarter with a global fleet of 233 retail stores, a net increase of 5 from prior year. At Michael Kors, total revenue of $871 million increased 184% compared to last year, also exceeding expectations. The Michael Kors ended the quarter with a global fleet of 820 retail stores, a net decrease of 2 from prior year. This improvement reflected better-than-anticipated performance in the retail channel across all three brands, including material increases versus prior year at Versace and Jimmy Choo, driven by a strategic initiative. However, as anticipated, wholesale penetration was approximately double prior year levels, resulting in an overall lower gross margin for Michael Kors in the quarter. Operating expense as a percent of revenue was 47.2%, better than our expectations as higher revenues resulted in increased expense leverage. On an absolute basis, operating expense increased approximately $140 million versus prior year, primarily reflecting the significant increase in revenue, which generated higher variable expenses. As a result of higher gross margin and lower operating expense as a percent of revenue, total company operating margin of 20.8% was above our expectations. All brands’ operating margins also exceeded our expectations, reflecting both, better gross margins and operating expense leverage. At Jimmy Choo, operating margin was 7.7%, and at Michael Kors operating margin was 27.6%. Looking at inventory, we ended the quarter with $760 million, down 20% compared to prior year. This assumes Versace revenue of approximately $1.025 billion, Jimmy Choo revenue of approximately $550 million and Michael Kors revenue of approximately $3.725 billion. This increase reflects stronger first quarter results as well as gross margin expansion in each quarter of the year, despite higher transportation costs. As a result, we now expect an operating margin of approximately 16%, an increase of 200 basis points relative to our prior guidance. We forecast for Versace revenue of approximately $260 million, Jimmy Choo revenue of approximately $120 million, and Michael Kors revenue of approximately $870 million. We now anticipate our second quarter operating margin will be approximately 13%, an increase of 200 basis points relative to our prior guidance. This reflects a 50 basis-point increase in gross margin versus last year, as well as expense leverage on our higher revenue forecast. As the world emerges from the pandemic, we remain confident that Capri Holdings is positioned to deliver multiple years of revenue and earnings per share growth as well as increased shareholder value. By the way, I’m joining you for today’s call from Paris, France, where we have just a little over a month ago opened our brand-new world flagship for Versace, which I might say is spectacular. So, it’s quite exciting to be here to see that. As we discussed in our earlier prepared remarks, the momentum that we’re seeing in accessories is really -- it’s coming much quicker than we had anticipated. And the two new collections that we introduced, first, the Virtus, which is the Barocco V, it’s really selling across not only accessories products but really strong in footwear, belts and on some of our ready-to-wear categories. And quite frankly, we’re having trouble keeping up with demand in the stores right now. So, that’s, I guess, to some degree, a good problem to have. And again, we’re seeing that resonate across men’s shirts and belts and other product categories. And now, before we’ve even landed La Greca, which is the overall signature pattern, the signature of La Greca on our sneakers in both Trigreca and the La Greca sneaker are -- again, we’re having trouble keeping up with demand, which is not something we ever anticipated to position to be in right now. So, the good news is, is that the pillars that we’ve kind of put in place today are already absolutely resonating with customer, and interestingly, resonating with a younger customer as well, which is something we’ve hoped for. And you can see that the database grew by 20%, which is really quite extraordinary, because these are all growing on top of what were large increases over the kind of the last 18 months. And I think what they’re pleased about seeing with all of the pillars that we’ve been introducing is, there’s a real rhythm to Versace now where maybe in the past, we were a little bit more full fashion driven and we didn’t have enough core products. And again, our large competitors have those core products, which really you can generate a lot of revenue and also you can generate a tremendous amount of gross profit. And I think we’ve told you, and we’ll talk more about it in our upcoming call in October, is that the launch of La Greca is going to be very, very powerful. And with her 90 million-plus fans and along with our huge following, I think we’re going to make quite an impact around the world. So again, I just -- we’re so pleased and I hope some of you -- most of you on this call are based in New York, please go to see our new Green Street store, which opened a few weeks ago. First, we’ve seen a return to socializing, obviously, in the United States. We’ve been on a very, very strong run in China with Jimmy Choo really during the entire pandemic. So, where we’ve seen reopenings occur and people resuming, socially engaging with one another, the dress business is really quite strong. I would say it’s not really the go-to work part of the dress business, but it’s more things around parties, around -- especially casual for the summertime, people going away on holidays. So, we’re feeling quite good about that. But on the other side, the casual part of our business, which, as I’ve commented before, has really not been a strength of the Company. We’ve really made huge inroads, in particular in our sneakers and our DIAMOND franchise, which has really taken hold. Again, we’re having a little difficulty keeping up with demand on that. But, we’re learning how high is high on that category. So, I think we have a lot in our arsenal with Jimmy Choo to really start accelerating that business. I know wholesale is coming back, but you’ve reduced it compared to historical levels. And if you’ve got any visibility on timing on those, that would be great as well. Kimberly, the growth in the quarter, I just want you to be really clear, was first led by the great performance at retail. The second thing that happened in the quarter, because I think this will add color to your -- Tom’s commentary, is the wholesale business in North America, which is the biggest piece of our wholesale business, has actually rebounded very, very positively. Still not running at the rates that we’re seeing in our full price business, but the sell-throughs are excellent. We’re seeing consumers return into the stores -- into the department stores, which I have to tell you is really exciting to see. So, I just want you to get a feel for the color that it’s not just happening in our retail stores, but people are absolutely returning to shopping in department stores. So, we saw great performance across all brands with better full price sell-through and Michael Kors signature was a larger portion of the business, at Jimmy Choo and Versace accessories, as well as some pricing at Jimmy Choo and Michael Kors. So, wholesale is going to grow off of a smaller base, but being smaller that’s more profitable. So, we’ve anticipated the situation will continue. And despite that, we’re still expecting to grow margin on the gross margin line every quarter this year. I’m just curious, I mean, such a robust start to this year. Mike, I’ll take the first part. When we look at gross margin versus a couple of years ago, Michael Kors is significantly above where it was in that pre-COVID world. With Michael Kors, we are not focused on LLY, and really because we’ve reset the business and what our expectations are for the business. So, it’s going to be hard comparing it when we’re trying to have a smaller wholesale business. And I also might add that even when we’re looking at LLY, there’s still situations in Japan and Southeast Asia and Australia and Europe, which are -- we are not back by any stretch of the imagination to full prior year levels. But on the other hand, we see North America going much quicker than we’ve seen. And we see strength in China, where again we’ve had strong double-digit growth across the entire group. So, there’s going to just be puts and takes as we go through this. But again, I want to remind you, Michael Kors, we’re kind of not focused on where we were two years ago. We’re only focused on our expectations, more profitable business, growing in a way that’s really focused on full price sell-throughs and growing categories, not just accessories as we talked about in our long-term strategies, where we see opportunity to grow some of our ready-to-wear businesses, men’s accessories. And Ike, as it relates to fiscal year 2023, I think that’s too early for us to point to that. Tom mentioned in his prepared remarks, we’re seeing continued strength in the second quarter. On the back half of the year, we’ve just got to see how some closures look or restrictions, as this Delta kind of moves through some of the economies around the world. On operating margin, Tom, as we think about the bridge between today’s 16% operating margin forecast for the year relative to the 14% prior, have you changed back half assumptions at all really today, or is this really first and second quarter? And looking at the operating margin going from our prior guidance of 14%, we’re really pleased to increase it to 16%, and it’s really a combination of factors. When we look at the back half of the year, I would say we’re reinvesting some of the benefits that we saw in lower spending, lower expenses in the first quarter into the back part of the year. We’re very pleased to be increasing the guidance, but also want to make sure we’re doing the right things to support our business to achieve that longer-term growth. So, great question you asked, by the way, which really dovetails into Tom’s remarks just now. And we think we’ve got a fairly sophisticated team that’s working with our data analytics and the way that we’re working to drive customer growth and engagement, as I said. All of that is something that, I think, we have a pretty good idea on how we can do and we’ve got a good feeling for that. And all three of the brands really were able to -- and Versace, we can grow these accessories too, as I said in my prepared remarks, $1 billion. At Michael Kors, we have really a huge opportunity in our ready-to-wear categories online, in particular, where those could be much bigger percentages of our business and also very profitable for us. On brick-and-mortar, we’re pleased with what we see happening in North America in terms of traffic, also happy with what we see happening in China. So, I’d say, we’re optimistic but cautiously optimistic on the actual brick-and-mortar traffic part of the business. Hopefully, we’ll see Europe have that same kind of lift we’re seeing in North America. Well, Lorraine, I think we’re obviously very pleased with our revenue growth and our earnings per share growth, operating margin growth, et cetera. So, I don’t think we have a absolute desperate need to see the operating margin expand beyond this new 16% guidance. And truthfully, if we saw significant revenue upside again over the next few quarters, I don’t know that we would 100% flow it all through. I think that what we want to do is to continue to build for 2023, 2024, which I’ve said to you at our Investor Day, we’re going to do over $7 billion with this Company, and there’s more to come even beyond that. And hopefully, if we continue to see the type of sell-throughs that we’ve seen across the group, hopefully, you’ll see some of that also flow to the bottom line. But, I don’t think that’s our absolute priority right now. Our absolute priority is to continue to make sure that all three of these luxury houses are building stronger and stronger bases, so that as we look out into the future, we’ll be looking at a much bigger number than $7 billion in terms of revenue. And as we’ve said, long-term operating margins that will hopefully have something, the two plus in front of it. You mentioned revenues were strong, but you are guiding the quarter two I think down 13% versus two years ago, which is a pretty big deceleration versus what you saw in 1Q. Tracy, I’m going to let Tom touch on that. But remember, you can’t go by what happened in Q1. So, I think while we’re extremely proud, and I think we’ve had one of the best performances of a luxury group globally by the results, I think that we were up against some major closures. Most of Southeast Asia is either under lockdown or -- while, stores may be open, there’s very little business transacting there. And while North America is really robust, as we’ve said in our remarks, and China is moving ahead very nicely, we’ve got some other issues still to deal with. But, at the same point in time, as we said, we’re off to a good start in the quarter, and we like the way the consumer is responding to our product from all three of the luxury houses. And Tracy, I’d just refer and reiterate something that John mentioned a little earlier that having reset our business strategies and objectives and in particular, for Michael Kors, we really do believe the forecast is the more appropriate benchmark to evaluate our progress. And with Michael Kors, we’re planning for a smaller but more profitable business. On the earnings per share side, we’re going to be ahead of our original expectations. So, we’re really pleased with our profitability. Obviously, we’ve got a lot more runway to go with profitability, and you can understand that because as we -- as our revenues increase, we’re going to create leverage. Yes, we’re going to spend some of that on marketing. But as we get into ‘23 and whatnot, we’re going to create a lot of leverage. Simeon, we made a decision really just going back kind of almost two years ago that we were going to walk away from trying to chase every competitive environment situation around promotional activity. And I think -- well, we know, I don’t think, I know that what you’re seeing in the gross margin performance is not only full price sell-through, but it’s just -- we’ve got considerably less activity around certain discounting that we did. So, it won’t happen. And not only that, we just don’t want to do it anymore. As you’ve heard, we’re raising prices on Michael Kors. And by the way, I mentioned on our previous call, we’re going to raise prices again for spring season next year, prices are going to go up considerably. And also in Jimmy Choo, we’ve talked about that as well. So, we’re going the opposite direction. That won’t happen for us, given the way we’ve purchased product, where product is flowing today and given where we think our brand is positioned. We’re going up, not down. So, that’s really our clarity on that topic. Watches and jewelry, I’m sorry. It’s all I can say is, wow. It’s almost -- to them, we’re a new brand. And they’re the ones who are really driving our signature business and accessories, our watch business. So, we’ve finally got some nice traction on that business, both in our own stores and at our wholesale partners around the world. And last thing I’ll just mention is, for the group, licensing revenues were up very significantly. As I’ve commented before, we have one of the largest fragrance businesses in the world with Versace and our partners at EuroItalia have done an amazing job. And the same -- Michael Kors, our business is really up, I don’t know, 50%, 60% in fragrance with the new launch of our new pillar. And so all things are really clicking for us on our license business, and we’re pleased to see that on a global basis. June historically is not the biggest quarter, but you’re already at 20% EBIT, John. So, curious if there’s any changes of how you’re thinking about the long-term 20% guide, particularly given how robust the demand has been across accessories. I know it’s early days, but you’re clearly building a pretty robust platform there. Well, Erinn, I’m not surprised you asked that question because we were prepared for it. As I’ve mentioned on our Investor Day, I believe, one of the biggest things that will create leverage at Versace is higher revenues in our flagship stores. We have the right locations, we have the right amount of space, we don’t need to build bigger. We’ll get to 300 over time, but that’s going to be super tight. And again, I don’t want to say we’re surprised, we’re presently -- we’re pleased that we’re moving much quicker on the accessories than we thought. So, if that continues on like this, the obvious answer is yes, we’re going to move quicker than what we thought and that we presented at our Investor Day. But, I think, we’ve got to, again, be cautious. Versace is a very big business in Europe, and we’ve got to get consumers back into the stores in Europe. Well, that’s not the case here. And when we see that, you’re going to see a very, very big lift again in operating margins for Versace. So, I think it’s a great question you asked. I can’t say whether it’s going to be quicker or not, but I think we’re much, much more confident over the last 90 days. But if it does and it gets in and it clicks, then we’ll really -- we’ll be off to the races. And without them, we would not be achieving the success that we’re having today."
}