{
    "symbol": "CRSR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 22:07:02",
    "content": " The Gamer and Creator Peripherals segment contributed $134.1 million of net revenue during the first quarter, a decrease of 23.7% from $175.9 million in Q1, 2021, but still a healthy 76.8% above pre-pandemic Q1, 2020, of $75.9 million. The Gaming Components and Systems segment contributed $246.5 million of net revenue during the quarter, a decrease of 30.3% from $353.5 million in Q1, 2021, primarily driven by a shortage of reasonably priced GPUs and supply and logistics constraints. Overall, gross profit in the first quarter decreased by 43.4% to $90.8 million from the record $160.3 million in Q1, 2021. Gross profit margin was 23.8%, a decrease of 650 basis points from the record 30.3% in Q1, 2021, mainly due to significant increases in logistics costs, especially ocean freight, promotion activity and lower absorption on reduced volumes. The Gamer and Creator Peripherals segment gross profit was $43.1 million, a decrease of 37.5% from $68.9 million in Q1, 2021, primarily driven by a decrease in revenue in the same periods, increased supply chain and logistics costs and a return to more normal pre-pandemic level of promotions. Gross profit margin was 32.1%, a decrease of 700 basis points from the record 39.1% in Q1 2021, largely due to the previously mentioned supply chain and logistics costs and rebate levels. The Gaming Components & Systems segment gross profit was $47.7 million, a decrease of 47.8% and from $91.5 million in Q1 2021, primarily driven by the decrease in revenue in the same periods and increased logistics costs. Gross profit margin was 19.3%, a decrease of 660 basis points from the record 25.9% in Q1 2021, primarily due to freight costs as well as some under-absorption associated with the lower revenues. First quarter SG&A expenses were $76.1 million, a slight decrease of 2.2% and compared to $77.9 million in Q1 2021, primarily due to a decrease in personnel-related costs. First quarter net loss was $3.3 million, of which $2.9 million attributable to Corsair Gaming, Inc. or a loss of $0.05 per diluted share as compared to a net income of $46.7 million or $0.47 per diluted share in Q1 2021. Adjusted EBITDA for the first quarter of 2022 was $15.4 million, a decrease of $65 million compared to $80.4 million for Q1 2021, resulting in adjusted EBITDA margin of 4.1% compared to 15.2% in Q1 2021. In the components area, pretty much every category has gained market share -- the two that are notably more than we expected was the ones we've been doing for a while, which is memory, which is our first product line and power supplies memory, we went from 60% in Q4 to 65% in Q1 and by March, we were 67%."
}