{
    "symbol": "CRSR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 19:49:03",
    "content": " In terms of specifics, Q4 2022 net revenue increased to $398.7 million compared to $311.8 million in Q3 2022. Net revenue for the year was $1.375 billion compared to $1.904 billion in 2021, a decrease of 27.8%. The gamer and creator peripheral segment contributed $117.8 million of net revenue during the fourth quarter, up from $96.8 million in the prior quarter and a decrease of 33.4% from $176.9 million in Q4 2021. For the year, gamer and creator peripheral segment net revenue was $437.8 million, a decrease of 32.4% year-over-year. The gaming components and systems segment contributed $280.9 million of net revenue during the quarter, up from $214.9 million in the prior quarter and a decrease of 15.8% from $333.7 million in Q4 2021. For the year, gaming components and systems segment net revenue was $937.3 million, a decrease of 25.4% year-over-year. For the year, gross profit was $296.6 million Note that this was impacted by the $19.5 million charge taken previously in the second quarter to account for inventory reserves in excess of our normal run rate to address overhang in the channel. The gamer and creator peripheral segment gross profit was $39.7 million, a decrease of 24.9% from $52.8 million in Q4 2021, primarily driven by a decrease in revenue. The gaming components and systems segment gross profit was $58.2 million, a decrease of 15.6% from $69 million in Q4 2021, primarily driven by the decrease in revenue. Fourth quarter SG&A expenses were $68.5 million, a 16% decrease compared to $81.5 million in Q4 2021, driven in part by reduced freight costs out to our customers on lower revenues and lower freight rates. Fourth quarter R&D expenses were $15.7 million, up slightly from $15.1 million in Q4 2021 as we continue to invest in our new products. For the year, we had adjusted net income of $18.4 million or $0.18 per diluted share. We took the opportunity to fortify our balance sheet in Q4, ending the year with a cash balance of $154 million which includes the addition of approximately $81 million from our November equity offering. Outlook; in terms of the full year 2023, we expect total revenue in the range of $1.35 billion to $1.55 billion, adjusted operating income in the range of $75 million to $95 million and adjusted EBITDA in the range of $90 million to $110 million. Assuming we maintain the same cash balance in 2023, we would expect to earn about $1.5 million of interest income per quarter, an effective tax rate of approximately 18% to 22% for 2023 and full year weighted average diluted shares outstanding of approximately 106 million to 108 million shares. So the first priority for us is to keep up with that demand is very strong, stronger than I think most people would expect given sort of a recessionary period, you would think it would be difficult for people to spend $2,000 or $3,000 on building the MPCs but that's what everyone is doing at a very good rate, substantially above pre-pandemic levels."
}