{
    "symbol": "RGNX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 15:23:13",
    "content": " We're bicoastal today, Steve Pakola, our Chief Medical Officer on the West Coast recently attended Retina Society, he will provide an in-depth overview of the data that was presented yesterday at the Retina Society Meeting from our Phase 2 ALTITUDE trial evaluating RGX-314 for the treatment of diabetic retinopathy or DR using suprachoroidal delivery. Yesterday, as I mentioned at the Retina Society meeting, new positive interim data was presented from our Phase 2 ALTITUDE trial of RGX-314 for the treatment of DR using suprachoroidal delivery and Steve will lead to review and discussion of these data in greater detail shortly. ALTITUDE is a multi-center open label randomized controlled dose escalation Phase-2 trial evaluating the efficacy, safety and tolerability of suprachoroidal delivery of RGX-314 using the SCS Microinjector in patients with a DR diagnosis of moderately severe or severe non-proliferative diabetic retinopathy, NPDR or mild proliferated diabetic retinopathy PDR. At six months, patients treated with RGX-314 demonstrated clinically meaningful improvements in disease severity versus observation control as measured by the Diabetic Retinopathy Severity Scale or DRSS. As the audience can hear, we're very excited about this interim data that Lejla presented in the potential of RGX-314 for patients with DR, as we continue to build upon the drug profile of RGX-314 in DR, we've made the decision to expand the ALTITUDE trial to include a higher at third dose level of 112 GC/eye. Lejla really outlined at great, which is, we have two products that are FDA approved for treatment diabetic retinopathy and the regulatory endpoint that we use is Diabetic Retinopathy Severity score, which really is something that we do with reading center level in general at a clinical level Lejla and I won't be counting my grinders, and looking at it as closely as we do with a clinical study. A few patients get better and if you look at the control groups say exhibit miss Ride/Rise et cetera some Panorama some of these other studies that have been done it's about 10% to 15% will actually improve a little bit, and largely that's not due to the fact that the disease is getting better in general what that - is that the patient in that study is suddenly realize oh, wait a minute. I think before I go to the next question I'll -- I think Peter you're -- I think it's a nice question to really get your sense when you get into the data, how do you look across cohorts based on the baseline characteristics for example -- \n Yes, I think, whenever you look at interim data, especially in Phase 2 relatively small numbers of patients, who don't want to read too much into."
}