{
    "symbol": "RGNX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 00:11:05",
    "content": " We've also progressed our RGX-314 trials using suprachoroidal delivery for the treatment of wet AMD and diabetic retinopathy, or DR. And in May we announced completion of enrollment of a Phase 2 ALTITUDE trial evaluating RGX-314 for the treatment of DR and more recently in July, we announced completion of enrollment in cohort 5 of our Phase 2 AAVIATE trial evaluating RGX-314 in the treatment of wet AMD. I would note that following our announcement in November 2021 at the launch of the pathway development consortium, co-founded by REGENXBIO and Solid Biosciences, which brings together key stakeholders, including the FDA, with the goal of expediting patient access to AAV therapeutics, we've seen an increased interest in the accelerated approval pathway across the gene therapy industry. Our pivotal program will measure GAGs in the CSF which we believe can be considered a surrogate biomarker that is reasonably likely to predict clinical benefit in MPS II disease under the accelerated approval pathway, as the buildup of GAGs or glycosaminoglycans in the central nervous system of MPS II patients leads to clinical manifestations, including neuro developmental deficits. And so I think as we're thinking about these diseases, thinking about surrogate biomarkers for approvable endpoints in things like the accelerated approval pathway thinking about how to make not just the logical scientific arguments but the scientific arguments connect with a biomarker argument that's going to connect with confirmatory studies that we also believe are part of the process of kind of dynamically engaging in accelerated approval pathway program, we really saw the totality of that with respect to RGX-121. My view is that what's been most encouraging about these discussions is that there's a lot of confidence in the data that we brought forward in terms of the safety, the correlation of the potential of surrogate biomarkers, in animals, in the human data we've shown to the disease process to the outcomes that we've shown with respect to things like the neurodevelopmental outcomes and the caregiver reported outcomes already. And so with respect to the 121 program question, I think just continuing to support, the understanding here, that the dynamic conversations with FDA, have certainly included the data that we have presented on podium, as well as information that we've included in both the amendment, with respect to the CAMPSIITE study, and conversations that we have multiple of these designations including things like Fast Track, that allow for a dynamic interaction with respect to FDA on this topic. And it's, something that also has been part of multiple I'd say, interactions that we've had with stakeholders including FDA, on the topic of accelerated approval for things like Hunter and Rett  syndrome I think, I alluded to in my remarks. And I think validated through, kind of the announcement today is that, there's support for accelerated approval to rely on a justifiable endpoint something, like GAGs and CSF based on the emergence of -- I've seen FDA leadership allude to, animal data and supportive. In terms of the correlation to where the confirmatory evidence is going to come from, I think it's inherent in the biomarker, from my perspective that when -- especially in the case of GAGs and CSF, when you're talking about the substrate of the enzyme that's deficient in the disease, that it's going to has correlated with changes in pathology and animal models, and is going to correlate with changes in pathology in the humans and eventually be confirmed in things, like the neurodevelopmental outcomes and the caregiver reported outcomes. So I think, there is a unique space in my view, for the MPS CNS diseases in their relationship with respect to AAV Therapeutics, that has been part of many discussions including for diseases that are more rare than the MPS diseases, as well of course REGENX and many other companies are part of this other paradigm approach for bespoke AAV gene therapies, where I've observed there have been similar conversations about, how do we speed the -- and accelerate the development of AAV therapeutics, once we have safety and sort of stable manufacturing capabilities for patients. So what we've seen and what we've continued to do in our clinical program is to collect all of that data collect all the domains of things like Bailey and the, sort of, equivalent assessments on an age-adjusted basis include caregiver reported outcomes, includes the biochemical measures and the other measures that are sort of evidence of the gene therapy turning on gene therapy having both biochemical and sort of cellular and morphological changes occurring. I think we've seen R&D expense grow as we've expanded into a pivotal phase of development and sort of increased manufacturing and supply requirements for things including the Duchenne muscular dystrophy program, which obviously is larger quantities of AAV that we need on a per patient basis."
}