{
    "symbol": "NUS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 21:29:05",
    "content": "  Operator: Good day, and welcome to the First Quarter 2022 Nu Skin Enterprises Earnings Conference Call. After today's presentation, there will be an opportunity to ask questions. Today on the call with me are Ryan Napierski, President and CEO; Connie Tang, Chief Global Growth Officer; and Mark Lawrence, CFO. On today's call, comments will be made that includes some forward-looking statements. Also, during the call certain financial numbers may be discussed that differ from comparable numbers obtained in our financial statements. This evolution of our business is vital to our long-term success as we lean into the rapidly evolving commercial landscape, and we take advantage of emerging market trends such as product personalization, social commerce in the gig economy in order to rejuvenate sustained growth in the coming years. For the first quarter, we were pleased to report strong results, including revenue of $604.9 million, which exceeded the high end of our prior guidance by approximately $15 million. Our outperformance was driven by solid gains in the U.S., Taiwan and Southeast Asia and continued effective product rollouts including ageLOC Meta and Beauty Focus Collagen+, which both performed well in the quarter. These two product introductions helped to further strengthen the wellness side of our business, improving from 35% of revenue to 44% year-over-year. We're particularly encouraged with our results considering the continued global pandemic disruptions, including increasing lockdowns in China, the conflict in Europe and global economic challenges. On March 4, we announced suspension of our limited operations in Russia and Ukraine, and are experiencing some softness in EMEA due to the broader distractions associated with the war in this part of the world. In Mainland China, we remain optimistic in our long-term view of this market, substantial potential for our unique beauty and wellness products. However, operations in the latter part of first quarter were impacted by COVID related lockdowns and other factors. In other regions, the roll out of Meta and Collagen+ and other new products coupled with the continuing advancement of our social commerce initiatives remain encouraging, contributing to return to growth in Southeast Asia and continued growth in the U.S. and Taiwan. Nevertheless, given the global uncertainties in China, EMEA and the broader economy, we're lowering our outlook for 2022 by approximately $150 million. Now, in spite of this and the short-term challenges, we remain focused on the transformation of our business with Nu Vision 2025. While still in the early stages, we are fully engaged in this major strategic transformation to capitalize upon the commercial shifts of product personalization in beauty and wellness, social commerce, and the gig economy. For the first time in three years, we are preparing to meet with our team elites in London to align with our top global sales leaders around Nu Vision 2025 and our three strategic imperatives, Empower Me, affiliate powered social commerce and our digital ecosystem. Our Empower Me personalization, beauty and wellness strategy is intended to provide consumers with deeper insights into their individual skin care and body care needs, IoT connected devices will be a key aspect of Empower Me beginning with the launch of LumiSpa iO in early Q3 followed by some limited previews of Body iO, beginning in Q4. Now these unique input/output devices will enhance the consumer experience and forge even stronger connections with the company to enhance personalization of product and content curation, improving customer loyalty and lifetime value. Next, affiliate powered social commerce builds on our roots of person-to-person marketing, to amplify messaging around authentic personal recommendations from our roughly 250,000 paid affiliates by leveraging social media scale and reach. In 2022, we are leveraging key learnings from our Western markets as we refine our product promotions cadence in, introduce a new global pricing model, beginning with LumiSpa iO and further train our sales force around the globe to embrace this new social commerce model. And thirdly, we continue to build out our digital-first ecosystem with the introduction of Vera and Stella apps towards the end of the first quarter. While the Stella app enables brand affiliates to easily access key information and tools to better manage and build their businesses, all from their mobile devices. Now to help you better understand our transformation and measure progress along the way, we committed in February to providing greater transparency into additional key drivers. Our first notable change is to begin reporting the number of paid affiliates, which is a broader segment of our sales force, who actively share products with customers on a much more flexible basis. We recently released our fourth annual sustainability report where we highlighted our progress in several key areas, including the reduction of 131 tons of plastic and more than 34 tons of paper in 2021, due to packaging changes to more than 60 products and other related initiatives. In addition, the two Communitas Awards we recently received further reflect our tremendous commitment to our entire organization towards corporate social responsibility. Nu Skin also continues to lean into diversity, equity and inclusion as we're pleased to be named to Forbes list of the world's top female-friendly companies for 2021, as well as their list of America's best employers for 2022, where we rank number two within packaged goods and number 57 out of 500 midsize companies overall. So in summary, while there are near-term uncertainties with China, Europe and the broader economy, there are also new opportunities arising as our world continues to evolve. Our agile model is built on a strong foundation and is globally diversified, which helps to mitigate risks and enables us to continually find new pathways for growth. In the early phases of Nu Vision 2025, I really am as confident and as ever in our future as we leverage our capabilities and resources to transform, to becoming the world’s leading integrated beauty and wellness company powered by our dynamic affiliate opportunity platform. So with that, I’ll turn it over to Connie to provide some additional insight on market performance. Before I share more information about our market performance by segment, I’d like to provide detail on the addition Paid Affiliates to our earnings report that Ryan mentioned earlier. As we continue to focus on customer acquisition, our Brand Affiliates, who primarily share products are a bridge to attracting new customers and nurturing relationships and community. The number of Paid Affiliates that we report includes any Brand Affiliates, as well as sales employees  compensation during the quarter. Instead of just reporting the number of sales leaders who achieved certain qualification requirements in the last month of the quarter, we will be providing an average of all three months more accurately reflectivity for the entire quarter. Collectively, we believe reporting this information each quarter provides a more complete picture  participating in our business opportunity at current levels, whether it be through sharing products within a team, or leading a sales organization. Now when we look at our results by segment for the quarter, our multiyear growth in the Americas, specifically the U.S. continued in quarter one, coupled with solid Southeast Asia Pacific results, we continue to progress in our efforts to balance our global revenue distribution. In the Americas, growth in the U.S. market continues to be offset by macroeconomic factors in Latin America. We also continue to drive further adoption of our social commerce model in the U.S. Now, Latin America continues to face macro pressure, we have  leaders who continue to provide them with training to support the adoption of social commerce. In addition, we are adapting the Collagen+ Playbook, which generated strong results in the U.S. and we believe can do the same in Latin America. The war in the Ukraine has created major disruptions in Eastern Europe, and the impact is greatly across the entire region. From a business perspective, as Ryan mentioned, we have suspended operations in Russia and Ukraine. Our leaders are identifying opportunities to read those business momentums in the EMEA region, despite the ongoing conflict. As Ryan mentioned, our Mainland, China business has been disrupted due to severe COVID-related lockdowns and other factors. Shanghai and other areas continue to be under strict lockdown, furthering the disruptions of sales events and promotional activities and requiring frequent pivots. As we stated last quarter, we anticipate challenging headwinds to continue in Mainland, China, but we are looking forward to the launch of ageLOC, LumiSpa IO  to help shift the momentum. Taiwan teams success with new customer acquisition through our Enjoy customer loyalty program with 4% growth in customers for the Taiwan, Hong Kong segment. Hong Kong was one of the markets hit hardest by strict COVID shutdowns during the quarter, but we were able to mitigate some of the impact of the lockdown with a live shopping broadcast event. While Japan was down slightly, the market was able to regain some momentum in the second half of the quarter, after a slow start due to strict COVID lockdowns. In the second quarter, we will continue to focus on signing up subscribers and we will run a TR90 challenge, which is typically driven sales and customer acquisitions market. Finally, in Southeast Asian Pacific, we grew revenue 11% in constant currency. Combined with some loosening of long lasting COVID restrictions throughout the region, this preview has built some energy ahead of the full launches of ageLOC Meta and LumiSpa IO later in the year. Now, looking ahead, we are building energy among our affiliates with continued launches of ageLOC Meta and Collagen+ across our global markets and the upcoming empowerment launch with our first connected beauty device, the LumiSpa IO in the third quarter. So first Connie just described our monthly paid affiliate number, we can talk more in Q&A about that. But again, this is a new indicator that sits really between customer and sales leaders. On the geographic front real quickly, as she just summarized there Americas growth really continues to be somewhat of a bifurcated path where we have strong growth in the U.S., which was up 15%, but Latin America continues to be pulled down by the macroeconomic environment as we all understand. She talked about Mainland, China, obviously that continues to be a major focus for us, but these extreme lockdowns in Shanghai and now extending through Beijing, Guangzhou, which are the major parts of their business. Hong Kong and Taiwan were up 6%, which we were pleased with related to new product introductions and some good promotional activity there. Korea was down 4%, still struggling with some lockdowns, but we are seeing some encouraging signs with subscriptions with TR90 business and the like. I think a key bright spot for us was in the South Asia Pacific, which grew 11% predominantly related to Meta previews and also the market opening up a little bit more, although there are some continued lockdowns there. And again, during Q&A happy to go a little bit deeper if you had any questions on that. For the first quarter, our results beat expectations with revenue of $604.9 million with a negative foreign currency impact of 3%. We were down 8% in constant currency compared to Q1 2021, which was our largest first quarter in company history. In Q1 2022, revenue benefited in part by sales late in the quarter prior to an April 1 price increase. Selling expenses as a percent of revenue was 40.1%, 70 basis points below the prior year period. For the Nu Skin core business, selling expense was 43% compared to 43.7%. For the quarter, G&A declined $19 million year-over-year, as we remain focused on carefully managing expenses. The other income expense line reflects a $1.5 million expense, compared to a $1.6 million gain in the prior year. Cash from operation was $7.5 million, compared to a negative $18.9 million in the prior year. We are pleased with the inventory decline of $17 million during the quarter, and remain committed to strategically invest in inventory to support our supply chain and plan to further reduce inventory levels as global supply chain constraints ease. Our tax rate for the quarter was 23.6% compared to 26.5% in the prior year period, and was within our guidance range of 21% to 25%. Our Rhyz segment, which includes our manufacturing partners declined 12% in the quarter. Given the continued economic uncertainty, increasing COVID-related factors, foreign exchange pressure and geopolitical conflict, we are adjusting our annual guidance. We are reducing revenue by $150 million consisting of a $100 million reduction in China, a $25 million reduction in EMEA, and a $25 million reduction due to increased FX headwind as the dollar continues to strengthen. We are projecting second quarter revenue of $590 million to $620 million, assuming a foreign currency headwind of 3% to 4% and a tax rate of 25% to 28%. So while we face near-term headwinds, we remain focus on making the right operational decisions and investments to resource the transformation of our business to new vision 2025 and becoming the world’s leading integrated beauty and wellness company powered by our dynamic affiliate opportunity platform. Can you just help think through what tools are available to them today, maybe how broad spread those tools have been deployed. And then as you think about that group specifically, what are their biggest advantages to your model, whether that’s connectivity to the end consumer data intelligence feedback loops. So, yes, the paid affiliate class is a really important one for us and will be for you as the transformation continues to evolve. Affiliates are really more of what I would define is kind of the gig economy type shares, they participate much more flexibly. It is a fairly, it’s a newer classification, or I guess, focus for the company, although we’ve had affiliates for a long time, but with social commerce and the social sharing aspect, it’s important that we really place more focus on them. And so the tools so far as I mentioned, the Stella app and the Vera app, or specifically the Stella app that we just introduced literally, I think of the last day of Q1. So we’re just starting to roll that out is a predominant tool for them that will help them to effectively share products, manage their connections through various tools that we have some CRM activity and the like. Now we really expect by the end of this year, that that tool will be much, much more robustly developed. I think advantage wise, what we like about this group, again, plays into the gig economy, where there’re far more people interested in kind of flexibly working Uber driving, et cetera. All right, that’s great. I’m really curious about what a connected device can afford you in terms of more iterative innovation in the future, versus I think what we’ve known of you in the past, these big launches, and then you kind of manage the post-launch cycle. Yes, I – and I’m glad you asked the question, I’ll comment. I’d actually like Mark to maybe share a few thoughts from his Amazon days on this, because it really is an important part. I mean, we really see this shift step from a customer integration standpoint between the company and our customer to be very important from a strategic shift. In our case, it’s persona driven product curation. For us, what will be very important with these IOT connected devices and coupled with the Vera app is the personalized product experience that will – that we will be able to offer through both the app and the connected device will be based more upon their personal needs and desires as a customer. And so you can imagine from a preferential perspective will have preference data through the app where they fill out a personal product recommendation that gives them, helps them profile their personal beauty and wellness needs that then moves into their purchase history. So what products they’re buying and then using AI and ML, we can feed recommendations through that process. But just as we’ve seen with Netflix over the last decade, the degree of personalization through persona driven management is going to increase significantly. And a lot of this for me is why we’re so focused on new vision 2025, and taking us a couple of years to build these personas out and continue to advance them. I think back to my times at Amazon, so think seven years back when the Alexa device and the Echo devices came out, they didn’t do very much. If we find, our customers are spending 65% of the time on the right side of their face versus the left side of their face, maybe there’s something we can do in the design of the next generation product that makes that better for that customer. If we find that they’re using it three times a week versus five, there’s so many things that we can learn about the customer that will help us make our next generation of product that much better and a better  along with all of the personalization that I had mentioned. And I – you’ll be able to hear this, but I think what’s really exciting for me about the iterative process is that it translates from the data into how we operationalize and how we as a company put forth programs and iterate on our own programs, based on the data that’s collected, meaning we can improve the programs that are designed for customer acquisition, for retention, as well as for loyalty development. The more we learn about behaviors and the more we learn about preferences, as well as consumption of the content that is both company created and user generated, the more we can more personalize as well as deftly execute and implement programs that are relevant and key to customer retention. Yes, so we instituted a global price increase this year about 5%. There are a couple of markets that will implement that in the early summer, even later in the year. Yes, so I mean, so far we – as we were watching the quarter unfolded, it is probably unfair to look at a single month simply because our product launches and introductions and our promotion schedule varies market-to-market. Again, I think what we're probably most focused on right now, Doug, is China and the broad media that we're hearing as well from our teams where these lockdowns are going from Shanghai, we're now hearing them they're in Beijing and in Guangdong, or which is the Guangzhou area, so the three major metropolitan areas of China. So, we're watching with significant focus to understand what the government there is going to do and how severe it's going to be. I mean, while we certainly believe that in-person activities are important such as this team elite trip where we get to align, it's been three years since we've met with our top leadership. Success trips as well in half the world, those have been able to resume predominantly in the west, again in Asia, there's still pretty severe lockdowns on travel in many parts of the geography. And that those are helpful from a kind of a motivation and alignment, because those are qualified trips that motivate sales leaders to do it, as far as the broader larger meetings, the convention type meetings, we really haven't turned those back on. And I would imagine in the future, as we think about it, there's a place for that at a limited basis, but it's not going to be the extent that we were in the past. If I may, I think there will be a new version of a hybridized world of how the balance and the shift I think is a lot more agile between virtual, digital and in-person. And we've seen some interesting, not only interesting, but encouraging success across our markets who have been limited due to external factors. And I'm also curious, was pricing contemplated in the original guidance, I guess I'm just trying to get a sense of how to think about, I know you don't talk about volumes, but how would we think about kind of the underlying volumes relative to the revenue guidance that was updated, inclusive of the benefit of 5% pricing, but also obviously by some impact of not just the pricing and volume impact, but just everything else that's going on in the world. And then just the broader strokes too, on the guidance reduction from a revenue standpoint by geography number seem like pretty rounded numbers, I guess. I'm just curious how you got there, how you're sort of thinking about the impact from what's going on given what you're expecting now. So that works out to be about $25 million and, and again, the breakout of the 150 is intended to be somewhat rounded, right. And when we looked at that, it was about $25 million. And then as we looked at what we were seeing in China, it was about $100 million. So, all those numbers are plus or minus $2 million to $5 million depending on the size of them, but the overall impact about $150 million. But when you were talking about margin performance, I think you said something about something, something that impacted growth margin in the quarter. And then as far as our guidance for the year with the 73.3% in the quarter, we believe that our model still gets us to – I originally guided 75% to 76%. No, it’s a great question. I think as we evaluate, we certainly are mindful and sensitive towards the neighboring countries in particular, if you think of the likes of Poland or Romania, Hungary, we need to be mindful of their mindset today. And so we do have a series for the remainder of the year, as this conflict is now entering, I think day 72 or 74, we’re getting further and further away. And Linda, I might add is, while the Q1 results are negative 25% year-over-year on a two year look back that market is still up 50%. We’re pleased with the way the business is operating and the fact that even with all this going on in the world, we’re still maintaining much on 2021. It’s a really cool, if you haven’t downloaded, I’d encourage you to download it. It also, it allows you – you go in and you fill out a skin – a personal skin consultation. And again, what we call a minimum lovable product right now, we’re building upon it, but it has that good feature and functionality in it. The whole point of this app is also to allow for it really, I call it democratizing the consumer experience. It allows for every customer to have access to information and to kind of discover and journey through what the app offers in terms of product information, coupled with your personal preferences and needs that are both taken into account through questionnaire format, as well as visually through a camera that will take a picture of your skin. So I think it’s really number one, super fun and at the same time we hope it’s part of every consumer’s journey as they engage with us. And I want you to know as a management team, we’re committed to this vision and to the transformation. It’s not always easy, and there’s a lot of puts and takes along the way. If you have any additional calls or would like to reach out, feel free to reach to Scott Pond or to Mark, myself. We’re happy to answer any questions as we go, but again, just wanted to thank you for your time. And with that, I think we’ll end."
}