{
    "symbol": "NUS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 23:27:03",
    "content": " As we've discussed with you over the past few quarters, we are actively engaged in Nu Vision 2025 and our multi-year transformation to becoming the world's leading integrated beauty and wellness company that's powered by our dynamic affiliate opportunity platform. We've also established some momentum in both Southeast Asia and Taiwan through our new ageLOC Meta and Beauty Focus Collagen+ product launches, and we're gaining some traction with our social commerce model in these markets as well. Over the past several months, we've continued to advance our three strategic imperatives that underpin Nu Vision 2025, including Empower Me personalized beauty and wellness, affiliate powered social commerce and our digital-first ecosystem. Looking towards the balance of the year, we are acutely focused on furthering Nu Vision 2025 with the introduction of Empower Me personalized beauty and wellness, beginning with LumiSpa iO and we're optimistic that momentum will begin to build sequentially throughout the remainder of this year. In summary, while the near-term environment remains challenging, we continue to execute on the strategic priorities that underpin Nu Vision 2025, ensuring that all our resources are aligned to drive the transformation of our business to our vision of becoming the world's leading integrated beauty and wellness company powered by our dynamic affiliate opportunity platform. We looked at our assets around the world, look at our different geographic balance of our business as it shifted pretty dramatically over the last few years and then really work to realign the allocation of resources to where our business is really thriving and where is thriving and ensure that we're putting resources towards the future towards New Vision 2025. Over the course of time as social commerce continues to evolve, we found that the retail margin is such a critical part of that -- and a part of the social commerce model for new brand affiliates who are really early in their business, being able to get earnings going. But Mark, maybe \n I would say that we were happy to see sequential improvement in gross margin in Q2, we're projecting for the second half margin stabilization, which basically means we're expecting margins about where they are today and there's going to be a number of puts and takes in our business, foreign exchange movement, and we're seeing a heavy headwind in foreign exchange."
}