{
    "symbol": "OTIS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 11:57:06",
    "content": " Organic sales were up 0.4% and adjusted operating profit margin expanded 20 basis points and was up $16 million at constant currency, driven by strong performance in the service business. Looking ahead to our 2022 outlook, we're revising our full year outlook and now expect organic sales growth of 2.5% to 3.5%, with net sales in the range of $13.6 million to $13.8 billion. New Equipment organic sales were down 5% in the quarter, as low single-digit growth in EMEA and high single-digit growth in Asia, excluding China, was more than offset by mid-single-digit decline in the Americas due to a tough compare from the prior year and slowdown in building construction, and a low teens decline in China from COVID-related lockdowns. These actions helped us manage through the continuing macroeconomic challenges and achieved low single-digit organic sales growth, $50 million of earnings growth at constant FX and 15.8% adjusted margins, a 30 basis point improvement over the first half of 2021. First half free cash flow generation of $800 million, 50% of our guide for the year enabled us to repay $500 million of debt, raise dividends by 20% and complete $400 million in share repurchases. Despite our backlog being flattish versus prior year and up from the end of '21, we now expect Otis China organic sales to be down mid-single digits driven by lower market expectations now expected to be down approximately 10% at the low end of our prior guidance and the impact of lockdowns during Q2 that have moved projects to the right into '23. We now expect organic sales to be up 5.5% to 6.5%, an improvement of 50 basis points from the prior outlook of 5% to 6%, driven by strong maintenance pricing, robust repair order growth in the second quarter and incrementally higher confidence to convert a modernization backlog and that is up 4%. The $0.18 or $110 million headwind from commodities is more than offset by the $230 million to $260 million of operational improvement through higher service volume and pricing, productivity in both segments and other cost containment actions resulting in profit growth of $120 million to $150 million at constant currency. Overall, this outlook clearly reflects our ability to mitigate the macro challenges and deliver another year of solid organic top line growth, margin expansion, robust free cash and importantly, strong new equipment backlog and service portfolio growth that positions us well for 2023 and beyond. I mean you're clearly seeing, like if you go to China, prices were down 15% in second quarter, they're down about 30% year-over-year in Q3."
}