{
    "symbol": "OTIS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 12:40:05",
    "content": " This quarter, we demonstrated that performance through accelerating maintenance portfolio growth, which was up 3.8% in the quarter, growing modernization backlog 7% and gaining about one point of New Equipment share year-to-date, with share about flat in the quarter. Year-to-date, free cash flow conversion was 106% of GAAP net income, and we kept our capital allocation plans on track with another $300 million of share repurchases in the quarter, completing the $700 million in repurchases we had planned for 2022. Organic sales were up 0.8%, and adjusted operating profit was up $35 million at constant currency with 60 basis points of margin expansion driven by segment mix and strong performance in the Service business. In the quarter, we generated $215 million of free cash flow, which was down versus prior year, driven by an increase in inventory to support backlog conversion and the timing of supplier payments. We're revising our full-year outlook and now expect organic sales growth of 2% to 2.5%, with net sales in the range of $13.4 million to $13.5 billion. New Equipment organic sales were down 5% in the quarter, as mid single-digit growth in EMEA and low-teens growth in Asia, excluding China was more than offset by 4% decline in the Americas due to a tough compare and delays in building construction and a high-teens decline in China driven by the challenging market conditions. Despite our backlog being up slightly versus prior year and up from the end of '21, we now expect Otis China organic sales to be down 10%, driven by the shift of project execution to the right and lower market expectations now expected to be down roughly 15%. We expect to more than offset the $110 million headwind from commodities with $230 million to $250 million of operational improvement from higher service volume and pricing, productivity in both segments and other cost containment actions, resulting in profit growth of $120 million to $140 million at constant currency. Your line is now open. Your line is now open. One moment for our next question. Your line is now open. One moment for our next question. Your line is now open. And just on the '23 as going -- as what Judy said, we're going to end the year with a very good backlog, both on service as well as on New Equipment side on service more than maintenance growth. One moment for our next question. Your line is now open. One moment for our next question. Your line is now open. One moment for our next question. Your line is now open. One moment for our next question."
}