{
    "symbol": "G",
    "quarter": 1,
    "year": 2021,
    "date": "2021-05-10 21:38:04",
    "content": " We delivered total revenue of $946 million, up 1% on a constant currency basis; global client revenue of $853 million, up 5% on a constant currency basis; adjusted operating income margin of 17.2%, expanding 250 basis points year-over-year; and adjusted diluted earnings per share of $0.59, up 11% year-over-year. Global Client revenue, which represents 90% of total revenue increased 6% year-over-year or 5% on a constant currency basis including an approximate one point contribution from revenue related to certain divested GE businesses that is now included in Global Client revenue as of January 1st, 2021. Excluding this revenue, Global Client revenue would have increased 5% year-over-year or 4% on a constant currency basis ahead of our expectations largely driven by better transformation services performance led by strong analytics growth. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. One of the things that our teams did, which I'm really proud of is systematically in the last two quarters of 2020 they went down the path of cross-training people, because they said, if something like the current situation in India were to happen, how do you have backups for individuals are very different from the situation we were in last year where all we wanted to do, which is a mammoth exercise is move from work in office to work from home everyone. Your line is open. Your line is open. And we feel very good about that, because the number of new clients who are wanting to have partnerships and the number of existing clients who are opening up many more services and connected buying centers in order to drive enterprise-level transformation is just improved the total addressable market, which kind of then relates back to the first question, which is, our ratio of a typical year where revenue growth is still materially contributed by existing clients."
}