{
    "symbol": "G",
    "quarter": 2,
    "year": 2021,
    "date": "2021-08-05 21:50:44",
    "content": " Our second quarter performance saw Global Client revenue return to double-digit growth earlier than we anticipated driven by accelerated momentum in Transformation Services, particularly in Analytics, and the strength of our Intelligent Operations business. In the second quarter 2021, we delivered total revenue of $988 million, up 7% on a constant currency basis; Global Client revenue of $893 million, up 11% on a constant currency basis; adjusted operating income margin of 17.9%, expanding 170 basis points year-over-year; and adjusted diluted earnings per share of $0.66, up 27% year-over-year. With our expanding addressable market, we are bringing more Transformation Services and Intelligent Operations solutions to our clients, setting the stage to continue our long-term journey of delivering annual double-digit to low teens Global Client growth and deliberate adjusted operating margin expansion. With our strong first half performance and better visibility for the full year, we now expect total revenues to be between $3.96 billion and $4 billion, representing year-over-year constant currency growth of 5.5% to 6% compared to our prior outlook of 5% to 6.5%. We expect our adjusted operating income margin during the second half of the year will be lower relative to the first half as we ramp investments in sales and marketing and research and development to support our long-term growth initiatives, absorb transition costs related to deal ramps and increase travel-related activity. Given this updated outlook, we are now estimating adjusted earnings per share for the full year 2021 to be between $2.36 and $2.39, up $0.09 from our prior estimate of $2.27 to $2.30 due to expected higher gross and adjusted operating income margins and $0.01 related to the FX remeasurement gain we recorded this quarter. Your line is now open. And the other thing that I would say is as we continue to drive better than company average growth, Global Client growth in things like FP&A, supply chain, financial crime, sales and commercial, these are all, as I said, services that pivot to driving value beyond cost and productivity for our clients. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}