{
    "symbol": "RDFN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 21:18:02",
    "content": " Loyalty deals, which we define as repeat referral customers as well as customers from a Redfin agentâ\u0080\u0099s personal network, also kept growing as a fraction of our brokerages total deals, up from 31% in the third quarter of 2021 to 33% in the third quarter of 2022. Improving the performance of our brokerage mortgage and title business is the most well-established way to increase the gross profits we earn from each online visit to redfin.com, but we are also investing aggressively in digital services with gross margins above 70%. Third quarter revenue was $601 million, up 11% from a year ago and within our $590 million to $627 million guidance range. Real estate services revenue, which includes our brokerage and partner businesses, generated $212 million in revenue, which was down 18% year-over-year, while coming in above the high end of our guidance. The Property segment, which consists primarily of homes sold through RedfinNow, generated $300 million in revenue, up 26% from a year ago and driven by a 37% increase in homes sold. Our rentals business generated $39 million, down 4% from a year ago, but up slightly from the second quarter of 2022, marking our second consecutive quarter of sequential rentals revenue growth. Our Other segment, which now includes title and other services, contributed revenue of $7 million, an increase of 122% year-over-year, driven by increased attach rates for our title and closing services. Total gross profit was $58 million, down 54% year-over-year, with a total gross margin of 9.7%. The decrease was primarily attributable to lower revenue and gross margins as the housing market slowed, offset by an $8.3 million year-over-year decrease in operating expenses. Please state your question. Please state your question. Weâ\u0080\u0099re just saying that these existential anxieties about how do you make a business work when you have $1 billion in revenue and 30% plus gross margins, I think you decided to spend too much in headquarters or you cut those costs back. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question."
}