{
    "symbol": "RDFN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 21:12:08",
    "content": " Overall revenue of $597 million was $37 million above the top of the range we projected in our last earnings call; our core business of brokering home sales through our employees and our partner agents generated $177 million in revenue, up 5% from the red-hot first quarter of 2021, and $6 million above the top of our range. Our engineers aren’t just driving demand from Redfin.com to our agents, but also arming those agents with better products to sell: the automation to support a 1% listing fee, the machine learning to give homeowners an immediate RedfinNow offer, and on-demand tours for buyers to see homes first. First quarter revenue was $597 million, up 123% from a year ago. Our rentals business, which we acquired subsequent to the first quarter of the prior year, generated $38 million of revenue and contributed approximately 14 percentage points to total revenue growth. Real estate services revenue, which includes our brokerage and partner businesses, generated $177 million in revenue, up 5% year-over-year. The properties segment, which consists primarily of homes sold through RedfinNow, generated $380 million in revenue, which was up from $93 million in revenue in the prior year. Our mortgage segment generated $3 million in revenue in the first quarter, a decrease of 49% year-over-year. Finally, our other segment, which now includes title, and other services, contributed revenue of $4 million, an increase of 20% year-over-year. Operating expenses were up $80.8 million year-over-year and represented 26% of revenue, down from 29% of revenue one year ago. Now turning to our financial expectations for the second quarter of 2022: Consolidated revenue is expected to be between $613 million and $650 million, representing year-over-year growth between 30% and 38%. We are still determining the proper split between cost of revenue and operating expense, but our current expectation is for approximately $47 million for mortgage cost of revenue and $22 million of operating expenses in the second quarter."
}