{
    "symbol": "RDFN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 20:30:22",
    "content": " It will be a major achievement to take share in a year where we're also improving annual profits by nearly $200 million, driven by higher gross margins, lower spending and the closure of money-losing businesses. We have more room to grow as a brokerage on as a website, nearly 20 years since online real estate portals first launch, about 95% of homebuyers search for listings online, just based on the sales claimed by Zillow and Redfin, it seems likely that only about 5% of home sales originate with people asking the agents on major real estate sites for service. From the fourth quarters of 2021 to 2022, the percentage of eligible brokerage customers who used our title service, Title Forward, also increased from 12% to 44% and lending and title margins improved in the fourth quarter, a trend likely to continue through 2023 as the lending industry completes its adjustment to lower volume, price competition may ease. Net bookings, a measure of the annualized revenue rent added through sales to new customers less the annualized revenue loss from departing customers nearly doubled quarter-to-quarter from $5 million in the third quarter to $10 million in the fourth quarter. Rent's fourth quarter revenue grew year-over-year for the first time since 2017 by 5% compared to the third quarter of 2022, fourth quarter revenue grew 6%. Real estate services revenue, which includes our brokerage and partner business generated $146 million debt in revenue, down 35% year-over-year. The property segment, which consists primarily of homes sold through RedfinNow generated $261 million in revenue, down 31% year-over-year. Finally, our Other segment, which includes title and other services contributed revenue of $6 million, an increase of 89% or $3 million year-over-year. We expect our real estate services segment to account for $122 million to $130 million of that revenue, representing a year-over-year decline between 31% and 27%. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question."
}