{
    "symbol": "CAE",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-10 22:46:17",
    "content": " But if I expanded, look, even -- and Iâ\u0080\u0099m sure the follow-up question might be that -- and I think weâ\u0080\u0099ve intimated in the remarks that even if you take those 2 charges out, the profitability of our defense business in the quarter is still very low. The other thing I would tell you is that I talked about some of the -- although weâ\u0080\u0099ve done really, I would say, really well in the quarter on orders and especially on defense orders, I think weâ\u0080\u0099ve said in the past that not all orders are created equal. Well, I think the first thing Iâ\u0080\u0099ll tell you is, as I said in the remarks that although we bid in that way, weâ\u0080\u0099re quite confident the rebased lining of the programs that weâ\u0080\u0099ve won, all the progress that weâ\u0080\u0099ve won in recent time, certainly, since weâ\u0080\u0099ve had the new organization in place under Dan Gelston, the profitability profile of that backlog supports our objective of low double-digit margin defense. Iâ\u0080\u0099m wondering if you can update us on any evidence you were seeing, whether itâ\u0080\u0099s in this most recent quarter or maybe the last couple of quarters, a growing demand for virtual military training relative to Live are just new applications for simulation and the technology that support that secular growth story for simulation-based training, Iâ\u0080\u0099m thinking of aviation more specifically. Iâ\u0080\u0099m wondering if you can update us on any evidence youâ\u0080\u0099re seeing whether itâ\u0080\u0099s in this most recent quarter or the last couple of quarters a growing demand for virtual military training relative to live, are just new applications for simulation and the technology that support that secular growth story for simulation-based training, Iâ\u0080\u0099m thinking of aviation more specifically. Well, I would tell you, look, the trend that weâ\u0080\u0099ve seen increased use of simulation for training in military and continues to increase for very real reasons that -- what does the military do and when theyâ\u0080\u0099re not in operations, they train for operations. No, look, I think demand for the simulator for the MAX aircraft overall and not basically break it down to MAX8 or MAX10 theyâ\u0080\u0099re very strong, very strong, and itâ\u0080\u0099s part of the backlog that weâ\u0080\u0099ve signed and simulated orders over the past -- as well as training that weâ\u0080\u0099ve signed in the last 12 months."
}