{
    "symbol": "LYLT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 04:27:10",
    "content": " Finally, we remain committed to the capital allocation priorities that we outlined earlier this year, which are designed to deliver stronger marketing ROIs and top-line growth for our sponsors and partners and, in turn, drive growth in both AIR MILES and BrandLoyalty. BrandLoyalty's revenue and adjusted EBITDA were each down compared to the year ago quarter due to the timing of programs in the market, or said another way, our larger programs are scheduled for later in 2022. As we noted last quarter, AIR MILES has always used first-party data in assessing consumers' behavior to deliver personalized offers on behalf of our partners and sponsors. We will deliver automated communications through Adobe's real-time customer data platform or CDP, which integrates within our data warehouse and enables AIR MILES to reach collectors with the right message at the right time. AIR MILES adjusted EBITDA declined 19% or $7 million as compared to the first quarter of 2021 due to the revenue impact, combined with the addition of key hires to help advance our business development and technical capabilities. Similar to last year, we expect AIR MILES quarterly revenue and adjusted EBITDA to be fairly consistent across 2022, subject to foreign exchange developments. As we move to the last page, we're confident that the strategic priorities we outlined today will enable us to strengthen the leadership positions of both AIR MILES and BrandLoyalty, by building upon our relationships with existing clients, attracting new sponsors and clients and driving enhanced collector and consumer engagement with our loyalty programs. From a brand loyalty standpoint, you're right, we are expecting to see a leg up in the second quarter as we come off what's typically our – one of our smallest quarters in Q1 and then the mix of programs – we had a little different shift or a different mix of programs this year relative to last year, where last year, we started off with some of the larger programs."
}