{
    "symbol": "WH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 11:50:23",
    "content": " Our EMEA region also had a tremendous year, opening 57% more rooms organically than they did last year or 6% higher than 2019 with impressive fourth quarter additions like the Bulk and Jewel resort, a trademark collection conversion in the resort town of Razlock near Sofia, Bulgaria, and the Ramada Riyadh King Fahd, the first new Ramada addition since buying back our master license agreement in Saudi Arabia. The number of domestic contracts signed in the fourth quarter was 40% higher than what we awarded last year and nearly 90% higher than what we awarded in the fourth quarter of 2019, reflecting record developer interest in our brands for the full year. Our franchising segment grew fourth quarter revenue by 12% year-over-year, primarily reflecting global RevPAR growth and higher license fees. Adjusted EBITDA increased 8% to $138 million, as the revenue increases were partially offset as expected by the timing of higher marketing spend in the quarter, which unfavorably impacted margin by 200 basis points. In our Hotel Management segment, full year revenue and adjusted EBIT declines reflected the first half of 2022 exit of our select-service management and owned hotel businesses, which contributed fee-related and other revenue of $50 million during 2022 and $125 million in 2021 and adjusted EBITDA of $18 million during 2022 and $37 million in 2021. For full year 2023, we expect global net room growth of 2% to 4% and global RevPAR growth of 4% to 6%, which translates to 6% to 8% above 2019 levels, a data point that we still consider to be relevant since the select-service space, which represents over 90% of our U.S. portfolio, recovered to pre-COVID levels much faster than the industry's full service base. We are projecting adjusted EBITDA of $650 million to $660 million, which reflects comparable basis growth of approximately 5% when neutralizing for the variability in the marketing funds year-over-year, which will contribute approximately $10 million less adjusted EBITDA in 2023 as we expect to completely recapture our 2020 investment. Finally, we are expecting free cash flow conversion from adjusted EBITDA of 50% to 55%, which reflects the impact from our expected increase in development advancement from $48 million in 2022 to approximately $60 million in 2023 as well as higher interest expense. So we're really, really excited about what we're hearing from our teams over there and just thrilled with everything our team accomplished despite the challenges with that 10% Q4 net room growth in our direct franchising business and how many more hotels they were able to open in a tough quarter than they were last year. We'd like to, once again, thank our valued team members for their significant accomplishments around the world and for helping us deliver our eighth sequential quarter of organic net room growth along with a 12% growth and at a development pipeline that's never been stronger than it is today."
}