{
    "symbol": "WH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 12:25:29",
    "content": " We are pleased to report another strong quarter, where we delivered $191 million of adjusted EBITDA and generated nearly $100 million of free cash flow, demonstrating the continued resiliency and consistency of our business model while returning over $160 million to shareholders bringing our year-to-date capital return to $400 million or 5% of our market cap. Here in the United States, RevPAR for Q3 ran 250 basis points higher than last yearâ\u0080\u0099s record third quarter and finished 10% above 2019, the highest absolute quarterly RevPAR ever recorded for our brands. Internationally, RevPAR ran 46% ahead of last year and 17% above 2019, driven by our EMEA, LATAM and Canada regions, which all generated RevPAR well in excess of both 2019 and 2021 levels. The year-over-year signings of our cost-efficient new construction prototype have increased approximately 40% above 2019, the percentage of our pipeline that we have poured new foundations for new construction increased 250 basis points compared to this point last year and we have more new ground breaks planned for the remainder of 2022 than we did in both Q4 of 2021 and in Q4 of 2019. Revenue generated in the U.S. from direct bookings on our brand.com sites grew over 10% in the quarter compared to 2021, outpacing the rate of growth across all third-party channels driven in large part by the Wyndham Rewards loyalty program with nearly 50% of all U.S. guests, representing Wyndham Rewards members. Adjusted EBITDA increased 4% to $201 million as the revenue increases were partially offset as expected by the timing of higher marketing spend in the quarter, which unfavorably impacted margin by 270 basis points. In our Hotel Management segment, revenue and adjusted EBITDA declines reflected the sale of our select service management and owned hotel businesses, which collectively contributed approximately $34 million in revenue and $10 million in adjusted EBITDA last year. We generated $97 million during the quarter and $321 million year-to-date, an increase of 6% compared to 2021. Hi, good morning, everyone. Weâ\u0080\u0099re certainly not seeing that from the demand in our new construction prototype brands, I mean, weâ\u0080\u0099ve seen â\u0080\u0093 aside from Echo, weâ\u0080\u0099ve seen great growth on just across the board, our Moda prototype when we look at where it was versus this time last year and our pipeline up 12%, our Wyndham Garden up 20%. Hi, good morning, everyone. Weâ\u0080\u0099re up 8% year-over-year and the program is up 25% to 2019, but the ability to drive that one out of every two check-ins domestically, into our hotels is whatâ\u0080\u0099s most important, and our teams are doing a phenomenal job and are very focused on continuing to see that share of occupancy for our owners, which is really our value proposition in terms of what franchisees are paying for in terms of direct contribution is whatâ\u0080\u0099s nearest and dearest to our hearts."
}