{
    "symbol": "PRDO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 23:58:02",
    "content": " First, as discussed last quarter, we believe the prolonged pandemic and its resulting safety measures, as well as the macroeconomic and governmental responses, have impacted overall student engagement and will continue to have a lingering impact on total student enrollments throughout 2022, especially as the COVID-19 era restrictions ease, and we continue to emerge from the pandemic. We reported first quarter net income of $32.1 million or $0.46 per diluted share, while adjusted earnings per diluted share, which excludes certain significant and non-cash items, was $0.57. Total student enrollments as of March 31, 2022, were 14.7% lower as compared to the prior year quarter end. For the first quarter of 2022, total company operating income increased by 7.6% to $43.7 million as compared to an operating income of $40.6 million. Adjusted operating income, which excludes certain significant and non-cash items, and which we believe is more reflective of the underlying operating performance was $50.9 million for the first quarter, reflecting an increase of 30.5% when compared to the prior year quarter. As it relates to our segments, total student enrollment as of March 31, 2022, decreased by 13.9% at CTU and 16.1% at AIUS as compared to the prior year quarter. While these factors may continue to impact total enrollments, through 2022, we believe that once changes to our marketing processes begin to annualize with the third quarter and as students further adjust to an environment post COVID-19, the rate of decline in total student enrollment should gradually improve throughout 2022. Revenue decreased 10.3% to $69.5 million for the quarter, primarily due to the decrease in total student enrollments. Operating income of $9.5 million decreased 15.9% compared to the prior year quarter as a result of the decrease in revenue, which was only partially offset with decreased operating expenses. For the second quarter of 2022, we expect adjusted operating income to be in the range of $37 million to $39 million as compared to $42.3 million in the prior year quarter, with adjusted earnings per diluted share to range between $0.36 and $0.38 per diluted share versus $0.41 in the second quarter of 2021."
}