{
    "symbol": "PRDO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 19:42:01",
    "content": " Adjusted operating income, which excludes certain significant and non-cash items, was $164 million, or 6.6% lower as compared to the prior year. Commensurately, for the fourth quarter, adjusted operating income of $32.4 million was 22.9% lower, as compared to the prior year quarter and adjusted earnings per diluted share was $0.31, as compared to $0.40 for the prior year quarter. Please note, the full year adjusted operating income of $164 million exceeded our latest outlook range of $157 million to $160 million, primarily due to better-than-expected student retention and engagement in the fourth quarter. Fourth quarter revenue at CTU was $108.4 million or 13.1% higher than the prior year quarter, while the full year revenue increased by 2.7% to $419.6 million. Operating income of $34.1 million for the quarter was $1.6 million lower versus the prior year quarter, while full year operating income decreased by 4.6% to $141.6 million. At AIUS fourth quarter revenue was $67.4 million or 5.9% higher than the prior year quarter, while full year revenue decreased by 3.1% to $274.5 million. Operating income of $3.5 million during the quarter was $6.8 million lower versus the prior year quarter, while full year operating income decreased by 14.9% to $33.3 million. Key drivers of cash for the year were: positive cash flows from our academic institutions, which were partially offset by, cash outflows related to $28.9 million of income tax payments, $23.1 million of share repurchases, $12.6 million of capital expenditures and $84.3 million related to the two acquisitions during 2022. For the first quarter of 2023, we expect adjusted operating income to be in the range of $51 million to $53 million as compared to $50.9 million in the prior year quarter, with adjusted earnings per diluted share to range between $0.55 and $0.57 per diluted share versus $0.50 in the first quarter of 2022."
}