{
    "symbol": "FTV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 17:59:04",
    "content": " So we'll take down a little bit of backlog here, but we'll -- I think the robustness of what we do relative to FBS has those continued improvements helping us, and that's why you see strong growth in IOS in the fourth quarter. We don't -- it takes longer to get pricing in the health segment, and so I think inflation is a little bit ahead of us there, unlike maybe the rest of our portfolio where we've been able to be ahead and we're ahead of the total on that. So parsing quarter-by-quarter is a little bit dangerous just because of the strong demand we had -- stronger demand in the first half, and I think that really speaks to the strength that what Chuck just described of how we really, obviously, saw very strong third and we're going to continue to see a strong fourth. Just when we're trying to think about the overall healthcare business from here, I think this year, you're guiding for just under 2% core growth for the year with a very big -- or a decent step-up again in Q4. And we've got, obviously, a really -- a very specific set of places where we think there's great investment opportunities, but we're also patient relative to those situations. First on China, do you think the strength here is kind of reflective of just the lockdown balance, or I don't think you're expecting 20% organic growth to continue necessarily, but it does seem extraordinarily strong. And whether it's Provation example we were talking about or what we do at ServiceChannel like we talked about in the prepared remarks, how we're bringing innovation and design cycle times down with our Tektronix solutions, what we talked about in the prepared remarks around solar with Fluke, we're really focused on saving money for customers with our solutions because of our workflow strategy. What I just meant like as a country, what do electives actuallyâ\u0080¦\n I think they're just going to continue to improve a little bit, but not -- they're not going to go from 90% to 105% or 110% right away. And that's why the point I made around our value proposition is so important, because I think we're going to stay at the top of the list of things to do with our customer base simply because of the value proposition and our ability to save money and the return profile that you get from an investment in the workflow solutions that we've sort of developed over the last five or six years. So it doesn't mean it's going to happen exactly like we think it is from a time frame perspective, but we're not seeing things fall out yet, which I think is good news for the -- into '23 for sure. I think the gross margin and operating margin expansion and free cash flow on the accelerated organic revenue is just demonstrative of the power of what we're building here, and we're really excited about what's going on."
}