{
    "symbol": "FTV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 19:13:05",
    "content": " Your line is now open. I would say so I think as we look around the world and I’ll stick to the orders or order question obviously continued improvement in orders, I like the fact that when we look at things like U.S. POS or Fluke and Tek as an example, that those numbers were in line with POS or order growth was pretty close to our sales out. Your line is now open. And to be just consistent with what I’ve said pretty much for the last nine months, we really never anticipated the supply chain issues would go away in 2022, what we anticipated and what I think what we saw in the quarter and will continue to see is the impact of our countermeasures. I think number one is if we look at tax performance in the quarter, you never like to say if China hadn’t had, but the reality is we had an unanticipated shutdown of a manufacturing facility in the last week of the quarter, if we shipped some of that, that volume roughly $15 million, you’re into a good growth rate for Tek. Your line is now open. So it’ll slow a little bit in the second quarter because of a comp that we had a Gordian last year where they had a, some finishing of contracts that of job order contracting that was some upside in the second quarter last year, but in the base business and kind of on a two year stack, we’re seeing good performance Q1 to Q2 sequentially with the common in those businesses for sure. I think the idea that we grew gross margins by 60 basis points in the quarter, I don’t know a lot of companies that grew gross margins in this environment and for us to grow gross margins in the quarter, I think is just a real testament to the high quality work we mentioned on the slide, the price realization work, and the price kaizen that we do really, continuing to demonstrate our ability to get price, but also quite frankly, our ability to still maintain and deliver value to customers. Your line is now open. And then lastly, what inning you think Fortive is in, in terms of the portfolio pivot that has started a couple years ago, because you think back at 2016, you had a set of businesses and it’s been dramatically changed in terms of a higher gross margin, higher recurring revenues, more software. Your line is now open. That doesn’t mean we think most of our deals are getting to the 10% ROI in five years, and we’re very pleased with progress, but coming out with the last couple years, we feel like we’re inflecting here and we’re going to start seeing more from these deals and that’s what we’re trying to talk about. I think we’re in a really good place relative to those doesn’t mean we won’t have an issue or two, but I think what we’ve seen certainly in the last several quarters, as well as these inflections have started to happen in the businesses. Your line is now open. Your line is now open. But I think at the end of the day, just more broadly about how we think about things, I would say, it’s, we’re probably still waiting a little bit more until some of the – maybe some of the uncertainties that we’ve seen recently sort of find their way to kind of know in the natural direction of what that might be interest rates being one of them the macro, some of those things. Your line is now open. Yes, I think, it’s something we spend a lot of time on Josh, obviously when you build a another 130 million in backlog, like we did in the first quarter, obviously a topic of conversation every month with our operating reviews, with the Presidents and CFOs, I would say I’d break it into a few places within Fortive. Your line is now open."
}