{
    "symbol": "CDXS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 17:15:06",
    "content": " With me today are Dr. Stephen Dilly, Codexis' President and Chief Executive Officer; Kevin Norrett, Chief Operating Officer; and Ross Taylor, Chief Financial Officer. During this call, management will be making a number of forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including our guidance for 2022 revenue, product revenues and gross margin on product revenues, as well as our strategies and prospects for revenue growth and successful execution of current and future programs and partnerships. To the extent that statements contained in the call are not descriptions of historical facts regarding Codexis, they are forward-looking statements reflecting the beliefs and expectations of management as of the statement date, November 3rd, 2022. You should not place undue reliance on these forward-looking statements because they involve known and unknown risks, uncertainties and other factors that are in some cases beyond Codexis' control and that could materially affect actual results. Additional information about factors that could materially affect actual results can be found in Codexis' Annual Report on Form 10-K filed with the Securities and Exchange Commission on February 28th, 2022 and on Form 10-Q filed with the SEC on, August 5th, 2022, including under the caption Risk Factors and in Codexis' other periodic reports filed with the SEC. Since our second quarter earnings call, we've been working to refine Codexis strategy by assessing the markets where Codexis and our proprietary CodeEvolver platform have a clear competitive advantage. Kevin Norrett, who is with us on today's call recently joined Codexis as Chief Operating Officer. Right now, we're very focused on prioritizing the most attractive market opportunities for our business segments and heightening our commercial discipline across the company. One of our critical guiding factors is to ensure we maintain cash runway through the end of 2024, providing us with time and flexibility to leverage the extensive scientific capabilities and intellectual property that we have at Codexis. Specifically, when discussing our Performance Enzymes segment, we will focus on our pharmaceutical manufacturing and Life Science businesses, which represent roughly 95% of the revenue that we generate in this segment today. Within the Life Sciences market as with the rest of our business, we aim to identify and invest in programs to drive deeper value from a more concentrated set of assets. Similarly, in our Biotherapeutics business, we will highlight which of our assets based on analysis of the market opportunity and competitive environment we view is having the greatest potential to create significant value within the next few years. Even when we exclude profit contribution from PAXLOVID, we project our pharmaceutical manufacturing business when looked on as a standalone entity will generate a very healthy operating margin in 2022. As a reminder, today we are selling enzyme to biocatalysts, to pharma manufacturers for 14 therapeutic drugs that are currently approved for commercial sales. To continue to compete effectively, we must increase our commercial efforts to reach new customers and work tirelessly to improve our responsiveness and value add proposition. Shifting now to our Life Science business, we believe this is an area with significant growth potential for Codexis in 2023 and beyond. Specifically, we view genomic sequencing and DNA and RNA synthesis as attractive markets in which Codexis technology and products can deliver strong competitive advantage. To date, this has been publicly demonstrated by our licensing to Roche of an improved DNA ligase for NGS library prep, which continues to progress towards commercialization in new kids, as well as our development what we believe to be a best-in-class terminal transferase enzyme for enzymatic DNA synthesis in collaboration with Molecular Assemblies. Our goal is to focus on identifying opportunities for Codexis to act as a long-term partner, ultimately providing end-to-end solutions for customer needs as opposed to being limited to our standalone enzyme product offerings. Now raving out the performance enzymes segment, there are clearly applications for our technology in other areas such as food, nutrition and industrial enzymes. However, these end-markets represent a very small component of our current revenue and there is considerable if need both in terms of investment and expertise to turn this into a profitable business. EPI occurs when a patient cannot produce sufficient pancreatic enzymes specifically lipase to digest fat, protease to digest protein and amylase to digest sugars and leads to weight-loss, metabolic disturbances in fat malabsorption. Despite their current limitations, the two leading therapeutics on the market today have combined annual sales of roughly $1.5 billion. Our second clinical stage asset CDX-6114 fully out-license Nestle Health Science is an oral enzyme candidate to treat patients with phenylketonuria, one of the most common inborn areas of metabolism or . Specifically, we can use CodeEvolver to engineer proteins that may improve targeting an expression within the body when administered as transgenes in gene therapies offering potentially improved therapeutic benefit as compared to the current options for treatment for conditions like Fabry disease, Pompe disease and Hemophilia A. As with our collaborations with Nestle, our partnership with Takeda is structured to help us learn, derisk, cover cost and ultimately leverage the power of our transgene engineering capabilities to introduce new therapeutic options for rare diseases and in markets where the unmet need remains high. In summary, as a relatively small company, we have an abundance of opportunities to build value both on our own and in carefully chosen partnerships, but we need to be disciplined about how much we can successfully take on given our finite resources. As many of you know, I've been with Codexis since the beginning of October and since then I have been spending my time understanding our capabilities and assessing current market opportunities to determine our best bets for future commercials. I joined Codexis because of the impressive core science, validating partnerships, existing profitable business and vast potential for growth across a variety of life science markets. As I've gotten to know the company over the past five weeks, I recognize that there are opportunities to increase our understanding of the commercial opportunity and to refine our customer strategy. My work is focused on driving consistent short-term revenue growth within pharmaceutical manufacturing and life sciences, as well as delivering long-term value creation through our Biotherapeutics pipeline. In pharmaceutical manufacturing, we have strong relationships with many of the pharmaceutical manufacturers in the world, building upon the strong foundation, my goal is to improve our targeted identification process, with a focus on customers that require support for both pharma manufacturing and DNA and RNA synthesis. By focusing on adjacent customers end markets, we can leverage our expertise to quickly drive commercial engagement. In Life Sciences, our initial forays have typically focused on specific enzymes for insertion into customer workflows as replacements for a particular step. As we evolve our strategy in this space, we expect to target workflows more holistically, co-optimizing several enzymes for combination by our customers and longer-term consider developing and selling kits, which could provide our customers with a more complete solution. To accomplish this, we need to develop suites of enzymes that work in tandem for our end customers. Finally, in our biotherapeutics business, we are in the process of prioritizing our pipeline of assets and clarifying the investment required to reach the next critical value inflection point to support partnering or Codexis driven clinical development. With a focus on the market opportunity, competition, reimbursement, potential pricing, we plan to develop a deep understanding and clear parameters about how much to invest in an asset, when to partner and when to stop investment. This is an exciting time for Codexis and the key thing I want to convey today is though, as we shape the go forward plan, we are committed to prioritizing our time and financial resources on areas where we believe we have the strongest commercial opportunity and the greatest probability of success. Total revenues for the third quarter of 2022 were $34.5 million, a decrease of 6% from the prior year period. On a segment basis, $31.1 million in revenue was from the Performance Enzymes segment and $3.3 million was from Biotherapeutics. The decrease was due to lower enzyme sales related to PAXLOVID, which were $12.9 million in the third quarter of 2022 compared to $18.9 million in the third quarter of 2021. For the first nine months of 2022, product revenue growth excluding PAXLOVID was 16%. The change was largely driven by changes in product mix, particularly from the decline in enzyme sales related to PAXLOVID, variations in prices for volume sold and higher shipping costs. SG&A expenses for the third quarter of 2022 were $13.5 million, essentially flat with $13.4 million in the third quarter of 2021. As of September 30th, 2022, the company had $109 million in cash and equivalents. In addition, we have not drawn any funds from our $50 million ATM equity facility that we put in place in May of last year. Before the allocation of corporate overhead expense, operating income for this segment was $10.8 million in the third quarter for an operating profit margin of 35%. In our biotherapeutics business, revenue was $3.3 million and we generated an operating loss of $11.4 million, again before the allocation of corporate overhead expenses. We expect product revenues to be solidly in the range of $112 million to $118 million, which includes approximately $75 million related to Codexis' proprietary enzyme used by Pfizer to manufacture PAXLOVID. Gross margin on product revenue is expected to be in the range of 65% to 70%, consistent with prior guidance. We anticipate R&D and SG&A expenses combined will be in a range of $136 million to $138 million for the full year compared to the range of $136 million to $140 million that we disclosed in our last earnings call, due to continued expense reduction and prudence around cash burn. Also in Q3, we incurred approximately $1 million in non-cash stock compensation expense related to our CEO transition, which is included in the revised expense expectations that I just outlined. As Stephen noted, we expect our existing cash and equivalents, combined with our future expectations for product revenues, R&D revenues and expense management will be sufficient to fund our planned operations through the end of 2024 without any contribution from new financing. In closing, our ongoing aim is to focus, simplify and execute on what we're good at. As part of our refresh of the Codexis strategy, we're making strategic, organizational and cultural changes to refine our commercial focus, enhance both short and long-term revenue opportunities and concentrate our spends on programs where we are best positioned to win. Please proceed with your question. But I guess maybe one for Kevin, lot of really good color in the slides on the enhanced commercial focus. The near-term actual thing is really to focus on our existing customer base in terms of  pharma in our pharmaceutical manufacturing, looking at additional products coming down the pipe. We talk about this later on as well in terms of the 20 or so products that are in Phase II, Phase III development that could eventually turn into real revenue products for us in the near term. And then back in July when you noted a few different reasons for the reduced R&D outlook, one of them was around kind of this macro impact driving a slowdown in partnering activity and then cadence of kind of new client conversations on both the Performance Enzymes side and Biotherapeutics. But I think in terms of our -- the overall macro environment and certainly our expectations for our R&D revenue, it's really not changed materially from what we outlined several months ago. I would note that in terms of our expectation to have two years of cash runway at the end of this year, that really is reliant on deals we have in hand now and not anticipating any large future deals just to be conservative in our outlook. Yes and thanks and Matt, Stephen here, I'd like to add a little bit of color to that which is the thing that we really are tracking and hang our hat on is the product revenues because product revenues have a very good margin and they can bring money to the bottom line. In terms of our R&D revenues, they really consist of fee-for-service work, which is kind of breakeven or reimbursement for shared expenses, which is actually negative margin. Also increasingly as we change our focus to decrease barriers to entry to partners, it becomes a less good metric for future revenues and future commercial sales. Please proceed with your question. We're looking at a modest expansion on the order of another, say, five to ten folks to be able to expand our reach, both in pharma manufacturing as well as life sciences. We're still working through that in specific areas, specifically as we look at how we're organized geographically, but it's not completely just a sales effort. It's also looking at our service organization, support other pieces of running a smooth and efficient commercial organization that we're looking at as well. And could you speak to maybe the competitive environment that you're seeing in Biocatalysts, just namely there's some other partnerships I've seen in the space. We've -- if you look back to 2018, we had 14 molecules in partnership in Phase II and Phase III for pharma manufacturing, seven of which have converted to be commercial products now. Right now, if you take the same cut, we've got 20 products in Phase II and Phase III. Now, what's happening is that the big companies are either developing their own biocatalysis capability or they're partnering for it and it's becoming sort of a baseline capability for the big players. Also we're really, really good at what we do because we've spent many years evolving these enzymes. And they tend to be in fairly narrowly defined families, such as keto reductase for instance, where if you've made one, it enables you to make the next one much more rapidly and much more effectively than if you are starting from ground zero. And I think that Kevin, you've been talking about a lot is actually lowering the barriers to entry, so we're very easy decision to partner with us. Please proceed with your question. No, I think this is early stages and first ensuring that we understand what the key customer needs are in terms of this market. I think we're at the early stages of our strategy in terms of full test kits, but it is something on our radar as a key strategic investment going forward. So I think not necessarily near term other than continuing with some of our evolving and preparing of new enzymes for that customer set, but we want to make sure we really understand the customer needs before we dive headfirst into that in terms of full test kits. Yes, one of the -- now having downplayed the importance of R&D revenue earlier, what I'm going to say is one interesting signal that we've got in the NGS space is the increasing number of R&D collaborations, we've got people testing our enzymes on their platforms, that kind of stuff. It sounds like you're deemphasizing the food and beverage to focus on the larger, more profitable markets in life science tools and pharma. One of the lenses we're looking through is how big a lift is it to go from what we are extremely good at, which is inventing an improved enzyme to actually addressing a market. When you move into things like food, it impacts the amount you have to make, the expression system you have to use, the kind of structure of the customer that you're trying to address, it's all really rather more complicated than just making the enzyme. And so what I'm saying is, when we move out of our sweet spot, we have to be super cautious that we understand the market that we're going for and just right now, it's about emphasis in the core areas of pharma manufacturing and life sciences. Yes and I would just add, Matt, the food, industrial part of our business, it's about 5% of our revenue today spread across both R&D, as well as product revenue. You mentioned Tate & Lyle specifically, but that is an existing customer. Kevin, Ross and I are really looking forward to meeting with many of you in person, the investor conferences in New York and Nashville."
}