{
    "symbol": "MFA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 14:15:03",
    "content": " Lima One was a continued bright spot for MFA as they turned in another record quarter with over $600 million of originations, because we are intimately involved in the securitization market. As Craig outlined in his opening remarks, MFA’s results for the quarter were impacted by the prevailing interest rate environment as a dramatic increase in interest rates across the yield curve, combined with spread widening resulted in net valuation declined in our investment portfolio, despite significant additions to our swap hedges that we proactively made early in the first quarter. Due to the increased uncertainty, we slowed purchases of non-QM loans in the first quarter by approximately one-third or $300 million less than the previous quarter. We had high hopes for Lima One, we acquired them in July of 2021, but the results have exceeded our expectations as Lima has originated over $1.6 billion of high yielding high quality BPL loans for MFA’s balance sheet over the last three quarters. In a challenging quota for originators, Lima generated $4 million of net income from origination and servicing activities in the quarter, representing an annualized return on allocated equity of approximately 10%. Loan acquisition activity remained robust as we added approximately $210 million UPB with over $330 million max loan amount in the quarter, all of which originated by Lima One and grew the portfolio by over 20% in the quarter. The UPB of 60-plus day delinquent loans declined by $19 million as a percentage of UPB, the 60-plus declined from 15% to 10% in the first quarter. Lima One originated loans are currently about 90% of our fix and flip holdings and they have a 60-plus day delinquency rate of approximately 3%, speaking to the quality of Lima’s origination and servicing activities. We acquired over $290 million of SFR loans in the quarter, all of which originated by Lima One and grew the portfolio by 27% end to approximately $1.2 billion at the end of the quarter."
}