{
    "symbol": "EWBC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 14:56:05",
    "content": " This morning we reported net income of $238 million and earnings per share of $1.66 for the first quarter of 2022, both up by 37% annualized from the fourth quarter of 2021. As of March 31, 2022, total loans reached a record high of $43.5 billion, an increase of 17% annualized from December 31, 2021. Total deposits reached a record high of $54.9 billion as of March 31, 2022, up by $1.6 billion or 12% annualized from December 31, 2021. Deposit growth this quarter was primarily driven by non-interest-bearing demand deposits, which grew to a record $24.9 billion and made up 45% of total deposits as of March 31, 2022, up from 43% from December 31. C&I loans outstanding, excluding PPP, were a record $14.5 billion as of March 31, 2022, an increase of 27% annualized from December 31, 2021. Total commercial real estate loans were $17 billion as of March 31, 2022, up by 20% and annualized from December 31. Residential mortgage loans were $11.6 billion as of March 31, 2022, growing by 11% annualized from December 31. First quarter average loans of $42.1 billion, excluding PPP grew by $1.8 billion or 19% annualized. First quarter average growth -- deposit growth of -- first quarter average deposits of $54 billion declined by $291 million or 2% linked quarter annualized, primarily due to a decrease in noninterest-bearing demand deposits partially offset by increases in average interest-bearing checking and savings deposits. The positive impact of rising interest rates on our portfolio will be more evident in the second quarter average loan yields, as 33% of our loans are linked to the prime rate which did not increase until mid-March. I'll also note that, of our $28 billion in variable rate loans $3.1 billion had fully indexed rates below floors as of March 31st of which $1.7 million were 50 basis points or less from their floors and another $700 million -- billion -- $700 million excuse me or 50 to a 100 basis points from their floor rate. Customer-driven fee income and net gains on sales of loans were, $65 million an increase of 3% linked quarter or 11% annualized. Moving on to slide 18, first quarter non-interest expense was $189 million excluding amortization of tax credits and core deposit intangible amortization, adjusted non-interest expense was $175 million in the first quarter down $3 million or 1.5% sequentially. For the full year of 2022, compared to our full year 2021 actual results we currently expect year-over-year loan growth excluding PPP of approximately 13% to 15% reflecting year-to-date performance, current loan pipelines which are very robust. So, with that said and when we're modeling out when we also use multi scenarios as far as looking at we shared during the last call that we started this year when we thought rates were going to increase 100 basis points the deposit beta assumption for the full year of 30%."
}