{
    "symbol": "UE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 17:17:13",
    "content": " This brought future rents from signed, but not opened tenants, to $23 million, representing 10% of our annualized NOI, one of the best indicators of future NOI growth. Some of the significant transactions we completed this quarter include: at Montehiedra, we leased 81,000 square feet of the 107,000 square foot Kmart box to two retailers; Ralph's Food Warehouse, an island-based full service grocery store; and Urology Hub, a medical user that will provide a great use occupying the back portion of the former Kmart space. We also had significant rent commencements in the second quarter including the 127,000 square foot AAA wholesale industrial conversion in Lodi New Jersey, the 45,000 square foot Amazon Fresh at Broomall Commons and a 9,500 square foot Five Below and 7,100 square foot Sketchers at Tonnelle Commons bringing that asset back to 100% physical occupancy. Same property NOI growth in the second quarter of last year was 25%, which benefited from approximately $4.7 million of bad debt reversals compared to $2.3 million in the second quarter of this year. You may proceed with your question. Because we do have an SNO pipeline, which we talk about and I believe that number is $23 million, which gives us another 10% on top of our existing NOI, but the net value of the leases that are under negotiation that amounts to $35 million annually. I remember back in the old days, gap had a real long average of five-year leases so that they could control 20% of their fleet every year and you see that happening more with tenants across the board, and that's more on the anchor side. You may proceed with your question. So when you've got the large tenant taking the entire second floor and half of the ground floor we've got some shallow space that we're considering small shop tenants for but there probably will be some form of an anchor tenant that's anywhere from call it, 15,000 to 25,000 square feet depending on how the box breaks up. You may proceed with your question. You may proceed with your question."
}