{
    "symbol": "CMTG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-17 13:43:03",
    "content": "  Operator: Hello, everyone and welcome to Claros Mortgage Trust Fourth Quarter 2022 Earnings Conference Call. I'm joined by Richard Mack, Chief Executive Officer and Chairman of Claros Mortgage Trust; Mike McGillis, President and Director of Claros Mortgage Trust; and Jai Agarwal, CMTG's Chief Financial Officer. We also have Kevin Cullinan, Executive Vice President, who leads MRECS Originations; and Priyanka Garg, Executive Vice President, who leads MRECS Portfolio and Asset Management. We will also be referring to certain non-GAAP financial measures on todayâ\u0080\u0099s call, such as net distributable earnings, which we believe may be important to investors to assess our operating performance. Good morning, everyone, and thank you for joining us for the Claros Mortgage Trustâ\u0080\u0099s fourth quarter earnings call. I do not have to remind everyone that 2022 is a volatile year, and today we remain in an economic environment of conflicting signals. This is probably the number one factor impacting non-office real estate assets, and it is our view in the asset valuation rates between rising rents and interest rates. China's decision to end its zero COVID policies, continued volatility in global energy and food prices, and ongoing geopolitical risks are just a few. We delivered on the strategic priorities we outlined over the past year, including maintaining liquidity and taking advantage of what we believe were attractive risk adjusted returns available to us. We concluded the year with total originations of 3.5 billion, this significantly outpaced the prior year and drove the portfolio to an all-time high of 7.4 billion of carrying value, and 9.4 billion of total loan commitments. During the year, we primarily focused on senior floating rate loans collateralized by multi-family assets in addition to other select property types with strong supply demand dynamics such as industrial, life science and build to rent homes. We also increased our presence in markets that continue to benefit from rapid economic and demographic growth, including Dallas, Nashville, and Miami. As noted previously in quarterly earnings calls, these are some of the asset types and markets where Mack Real Estate Group has been increasing its equity investments most rapidly and where we believe asset valuations are holding up best. In addition, during the year, we expanded and diversified our funding sources, which included entering into $150 million acquisitions facility and closing on a $1 billion financing facility. We believe our ability to diversify and grow our financing options in a difficult capital market environment speaks to the credibility of our platform, the strength of our portfolio, our management team, our institutional relationships and the fairly conservative leverage position of our balance sheet. We expect that the impact of a higher interest rate and loan spread environment and potential slowing consumer demand will likely translate into continued pressure on real estate valuations and muted transaction volumes, even if recent spread tightening accelerates in the high yield bond market, the CLO and CMBS markets. In addition to the challenges, we have seen in the office asset class, we are beginning to see initial weakness in performance at the asset level across the industry, especially in blue states and cities. And while we expect this trend to continue, we believe that asset performance will be uneven and highly dependent on property type asset quality and market. As a general perspective, we feel our asset allocations and market selections position CMTG to withstand deteriorating conditions, and Mike will provide a more detailed discussion of our portfolio later in the call. Despite our confidence in our portfolio, we recognize that our business and borrowers are not immune from the current macroeconomic or interest rate environment. In addition, Mack Real Estate Group's experience in commercial real estate development, ownership and property management provides us valuable and distinct market intelligence driven by boots on the ground and a large network of industry relationships. We understand that a period marked by challenging market conditions is an inherent aspect of managing a commercial real estate portfolio, and that this should provide us with an opportunity to distinguish our performance and to go on the offensive when the time is right. As I look ahead, I have much confidence in our team's expertise and ability to lead us through these times and to find the entry point to resume an opportunistic stance when the tides inevitably change. I'd like to provide a summary of our investing activity for the fourth quarter and full year of 2022, and then turn to our market perspectives and outlook on certain property types, specifically multi-family, hospitality and office. During the fourth quarter and full year of 2022, we executed 359 million and 3.5 billion in originations respectively, while further diversifying our portfolio by property type and geography. Our fourth quarter originations were all senior floating rate transitional loans across three investments, collateralized by life sciences, multi-family and industrial property types with a weighted average credit spread of 600 basis points over -- and a weighted average LTV of 58%. As a result of the higher interest rate environment, we expect this trend to continue as borrowers exercise as of right extensions and protect their investments with additional equity infusions. At year end, the portfolio had a weighted average all in yield of 8.6% and a weighted average LTV of 68%. Notably, we increased our multi-family exposure to 41% at December 31, 2022 from 30% at year end 2021, while also decreasing our exposure to office, land and for sale condo. As Richard mentioned, we also enhanced our geographic diversification by expanding our presence in high growth markets while expanding our national footprint by entering several new markets. During the year, New York as a percentage of the portfolio organically decreased as a result of our robust origination activity and New York loan repayments we received during the period. At December 31, 2022, New York represented 23% of the portfolio down meaningfully from 38% at year end 2021. We've seen borrowers continue to support their properties by replenishing interest reserves, funding debt service shortfalls, funding operating expenses out of pocket, and purchasing replacement interest rate caps. However, as Richard mentioned, given the economic outlook and expectations for the real estate industry, we are approaching the coming year with caution. Multifamily continues to be our largest exposure by property type, representing 41% of the portfolio at year end. In the portfolio, we're seeing generally strong occupancy and positive trade-outs on new leases and rent growth on renewals. However, we are also starting to see softening rent growth, marking the end of record growth rates reported by the industry over the past several years. While we anticipate rental demand to remain strong in the face of a more expensive home ownership market, we do expect to see the top line normalize as owners compete to retain residents and markets absorb new supply. However, we're keenly focused on the asset class as borrowers contend with negative leverage in this rising interest rate environment. Thus far, we've been encouraged by the desire and wherewithal of our borrowers to protect their equity, but are prepared for the alternative as well. Turning to our hospitality portfolio, hospitality represented 20% of our portfolio at year end 2022. Throughout the year, the industry benefited from a sharp rebound and hotel demand as consumers redirected their discretionary income from consumer goods to travel and leisure coming out of COVID. Consumers and businesses have historically pulled back on travel related spending during our session, and we expect they'll behave similarly during this economic cycle. In anticipation of potential softening demand and elevated costs, our asset management team has been carefully monitoring our investments collateralized by hospitality assets, and we anticipate that as the year unfolds, certain loans in our portfolio will require a more keen focus than others. In terms of office, office comprised only 15% of our portfolio at year-end 2022, 19% including the office allocation within mixed use assets. While the prevalence of work from home seems to be waning a bit, it remains a persistent theme driving much of the uncertainty around the sector's future. In demand office assets are outperforming based on their asset quality and location, and New York City leasing in particular has seen a number of strong data points. That said, in this higher rate environment, borrowers are required to make decisions about investing additional capital to protect their equity. In light of reduced demand for certain types of office properties, we anticipate a wide variety of outcomes dependent on each borrower's source and cost of capital, their ability to withstand a protracted period of uncertainty. We believe that the expertise of our asset management team, the way we structure our loans coupled with our deep borrower relationships and broader industry relationships, position us well to respond to whatever conclusion our borrowers reach in their decision-making exercises. For the fourth quarter of 2022, distributable earnings increased to 53.7 million or $0.38 per share compared to 47.1 million or $0.33 per share last quarter. This was primarily due to higher benchmark rates, continued capital deployment, as well as performance of the REO hotel portfolio. We reported a GAAP net loss of 22.7 million or $0.17 per share, which reflected increase in both specific and general CECL reserves during the quarter. Both investments are cash flowing, but were impacted by rising interest rates requiring borrowers to decide whether or not to support the properties. The sponsor has supported these assets throughout the covid downturn, but was unable to continue doing so in the rising interest rate environment. So we did average advance rate on loans subject to asset specific financings remained at a conservative 65%, which can be further bifurcated into a 74% advance rate on multi-family loans and 58% on the other loans. While the capital markets have shown modest signage improvement so far in 2023, we continue to focus on maintaining adequate liquidity. Obviously, that's a potential risk and I just want to understand whether or not caps are sort of fully extended or we should think about them as expiring with the initial term. Overall, 90% of our portfolio has interest rate caps in place today as we sit here. And one thing we did while we were reviewing 2023 budgets with our borrowers was making sure they understood, looking forward to the next 12 months and then the ensuing six months after that when in the calendar year they'd have to come up with the capital and ensuring that they were speaking to their investors to the extent that they had investors if they have to call capital for, to buy those caps. So, thus far, borrowers are doing what they're supposed to do, but obviously, you're asking a question for the right reason, which is costs have skyrocketed, but we've not waived those conditions to this point. So in some cases some borrowers have only even if they have three years left, they might take only a one year cap. One, obviously non-accruals went up this quarter through the two loans. So, yes, we did obviously, as Richard said in his remarks, we're approaching 2023 with extreme caution. We downgraded two office loans, two hospitality loans, and then the investments that Jay mentioned that have the specific CECL reserves, two office loans and two hospitality loans that we downgraded was really, because the team is spending additional time on those loans working with borrowers to ensure that we have a path to pay off. So that's really what was driving those the two office and the two hospitalities, it wasn't any sort of specific borrower behavior. It's the four loans, two the same as the prior quarter and the two that it got added, or the same five rated loans that Jai mentioned that have the specific CISO reserves. So I can't say either way what's going to happen, but I will say that there's several reasons that we feel very good about the strength of our portfolio composition. Number 1, our office exposure is only 15%, which is I think the office is the one sector where we think there might be a real fundamental shift in values, and our exposure there is limited, and it's limited really to office stock. The second point I would make is the same point Mike made, which is 60% of our exposures in the multi-family and hospitality sectors. So that means that sponsors are going to have best-in-class real estate upon completion, which means that we're going to fare better in an uncertain environment, and it reduces our risk on repayment. They've been protecting their interests, they've been doing everything that they're supposed to do in the loan documents, funding debt service shortfalls, rebalancing, construction loans purchasing the replacement rate caps we just discussed. So while we're cautious and I hesitate to make a statement either way, and where non-accruals go, we do feel good about where the portfolio stands today. Reviewing the multi-family exposure, there's quite a lot of loans in some of these high growth markets, which will have extremely elevated unit deliveries over the next probably 18 months, including Colorado, Arizona, Texas, Tennessee, Utah. So just wanted to see if you could provide an update on that exposure, as some of those loans were potentially originated during sort of the peak frothiness of the market. The pace of growth is swelling, but we're still seeing positive trade outs. That said, the long-term thesis there in many of those loans that were made in the markets you mentioned were really about investing a little bit of capital and moving it from a Class B asset to a Class A asset. And that's been borne out by the fact that a lot of those same assets had interest rate, or sorry, had interest reserves. So, so we think that while the growth is certainly slowing, borrowers are continuing to believe in their long-term thesis. So Jade, I think that it's also important to remember that a lot of our origination in these markets happened post the CLO market backup. And as we look at it with very little good news happening, we really like both what we're getting paid and our basis in these assets. There's, you know, unfortunately right now the, for the borrowers, they're moving from negative leverage to positive leverage, in most cases as they are marking to market and certainly as they renovate. And so, yes, there is softness because of increased growth, but I think I'd still rather be in the high growth markets because we have seen construction starts fall off a cliff. And yes, we're delivering a lot in those markets, but I think you're going to have another surge in rent growth as we absorb a lot of the projects that are being completed now. With the commercial mortgage REITs and even some CMBS loans, there seems to be a phenomenon developing from an outsider's perspective of borrower strategic defaults. And one of your peers used language, they said, you know, the borrower's acting in non-economic ways and some of some of the credit sub-performance has caught people off guard. Are you seeing borrowers strategically default as a means to extract concessions from lenders because they know many lenders are caught, you know, in a, between a rock and a hard place, they have loans funded on credit facilities that need to maintain coverage and they may not be able to issue CLOs as well. Just in terms of the strategic default, I think that because of how we structure our loans, we actually have not, have not seen that because we have active cash management in place. So there's not this ability of borrowers to sort of hold back cash and say there's going to be a default, and then, try to use that as a negotiating tactic. I mean, look, we're we -- that strategy doesn't work that well with us. And so we don't see this a lot and forgive me for saying it that way, but I think it's important that we -- that borrowers understand that we're certainly in almost all the asset classes that we're involved in. So I just wanted to hit on originations, which slowed in the quarter and sounds like it's due to macro conditions and you guys just being cautious. So yes, I think you've seen quarter over quarter throughout the course of the year origination or transaction volume slow down. But as we look at the overall portfolio size, given the future fundings that we expect to fund over the course of the coming quarters, that we do expect net portfolio growth as we sort of weight that against projective repayments over that period of time. We're assuming very few repayments throughout the year, and we have very few final maturities during 2023. I just want to say thanks for everyone for joining again, and finish by maybe making the obvious statement that this team is laser focused on execution and asset management every day. And we appreciate everyone's time again, and thank you, and we look forward to speaking to everyone on the next quarterly our earnings call."
}