{
    "symbol": "RS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 16:19:06",
    "content": " Our full year 2023 capital expenditure budget is another new record at $500 million, with an expected total cash outlay of approximately $400 million to $450 million in 2023, which includes some carryover from 2022 and prior year projects due to ongoing extended lead times throughout the supply chain. Our fourth quarter average selling price per ton sold of $2,799 declined 7.9% compared to the third quarter of 2022, consistent with our expectation of down 6% to 8%, that remained elevated by historical standards. We achieved fourth quarter earnings per diluted share of $5.88, which when combined with effective working capital management resulted in record quarterly cash flow from operations of $808.7 million. We recorded LIFO income of $99.1 million in the fourth quarter, compared to $27.5 million of income in the third quarter of 2022, which drove a 210-basis-point improvement in our gross profit margin for the prior quarter. We ended 2022 with a LIFO reserve of $744 million as our inventory cost on hand continue to catch up with lower replacement costs or should metal prices trend lower in fiscal 2023, this reserve will generate LIFO income and continue to support our gross profit margins and reduce the volatility of our earnings. Our fourth quarter non-GAAP SG&A expenses decreased $17 million or 2.7% compared to the third quarter of 2022, mainly due to moderation in inflationary pressures, lower incentive based compensation resulting from lower profitability and lower variable warehousing and delivery expenses associated with lower tons shipped. On a year-over-year basis, our fourth quarter same-store non-GAAP SG&A expenses decreased $9 million or 1.5% as lower incentive based compensation from lower FIFO pre-tax profits offset moderating inflationary factors, including higher wages, freight, steel and plant supply costs. Our fourth quarter 2022 diluted earnings per share of $5.88 benefited from the combination of a LIFO income impact of $1.25 per share, compared to anticipated LIFO expense of $0.09 per share and lower than anticipated tax rate of $0.24 per share. Our 2022 record annual operating cash flow of $2.12 billion funded a record $341.8 million in capital expenditures and the return of $847.4 million to our stockholders comprised of $217 million of cash dividends and $630 million of share repurchases, resulting in nearly 6% reduction in common shares outstanding. To-date, pricing for many of our products has started to stabilize compared to December, which was the low point in the fourth quarter, and as a result, we estimate our average selling price per ton sold in the first quarter of 2023 will be down 3% to 5% compared to the fourth quarter of 2022."
}