{
    "symbol": "MPW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 16:05:29",
    "content": " The self-evident point to be made is that two very sophisticated institutional investors, the infrastructure funds and the lender, did substantial diligence on the operations cash flow and value of Steward's Massachusetts operations and concluded that MPT's contractual rents on its real estate were well supported. First, we announced a few weeks ago that the Yale New Haven Health System has agreed to acquire Prospect's Connecticut facility including our real estate, which we expect to sell for approximately $457 million of which cash proceeds from Yale are expected to compromise a substantial majority. Yale's attraction to these facilities is a good example, of why we think hospital real estate should not be valued based solely, or even primarily on the financial performance of any particular operator, during any particular time period. In addition to the $1.5 billion, we have of course announced expected proceeds in 2023's first half from pending transactions that is Springstone and Yale, of up to another $650 million. Finally, MPT's long-standing consistent and successful business model has always been to invest in hospital real estate that regardless of the operator is underwritten to generate sustainable long-term cash rental revenue. So it's important to note that, if you look at second quarter to third quarter, the preview we don't have all of the numbers in from all of our hospitals at this point, but what we've seen so far is that, there is an improvement over the second quarter from first quarter and there's also a continued improvement in hospitals in the months of June â\u0080\u0093 I'm sorry, July and August. And at those kind of really tying to my bigger question is, with that EBITDA projected to be $50 million to $80 million for Steward this year then going to $350 million next year, when you think about that just in the context of the breakdown of the Steward facilities geographically that you guys always show on Page 11 of your supplement between Utah, Florida Texas Arizona etcetera. And then the math I wanted to check was, if Steward's expecting $350 million of EBITDA next year, I think your cash rent payments are around $375 million. So remember a few years ago, the auditing rules makers made us recognize as an MPT expense â\u0080\u0093 let's just say for example, we paid an insurance premium, sometimes insurance premiums and frankly in this case are very large on an annual basis say, $7 million."
}