{
    "symbol": "MPW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 17:07:13",
    "content": " Our hospital real estate was being operated at an attractive EBITDA coverage ratio even when the parent company, who was our guarantor, was deeply  because of the facility level profitability and because our lease is almost always mandate that our lessee is a special purpose entity, creditors may not attach our real estate assets or facility operations other than secured receivables. Secondly, I remind you that Stewardâ\u0080\u0099s Massachusetts operations, it's first and among its largest markets, was recently subjected to detailed and sophisticated underwriting as part of last quarter's completion of our joint venture with Macquarie Infrastructure Funds. But we expect additional contributions Steward's improving operations will also include, again, as Ed mentioned, by the middle of next month, Steward will have fully repaid over $400 million of MAP funding and have completed its transition from Tenantâ\u0080\u0099s Management of its recent Florida Portfolio acquisition, freeing up between a total of $45 million and $50 million of cash flow per month starting earlier than in October. First, the previously disclosed sale of Steward's value-based Medicare business to CareMax would not only generate additional liquidity of as much as $125 million, but just as importantly, will align the interest of both organizations in a manner that will pave the way for future profitable growth opportunities. I hate to go back to this, but just in terms of Steward's EBITDA run rate, -- just so we're clear, this only happens after we get through the $200 million investment in Florida, $420 million in MAD obligations and that delay in Texas funding. And I realized it was kind of standard practice and a standard cost for hospitals, but it's a little unique in the traditional net lease world is -- is that part of the reason why maybe it wasn't emphasized before this is just that it's kind of status quo on the hospital side."
}