{
    "symbol": "EVOK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 19:11:06",
    "content": " With me today are David Gonyer, Evoke's Chief Executive Officer, Chris Quesenberry, Gimoti’s Chief Commercial Officer from EVERSANA, and Matthew D’Onofrio, Evoke's Chief Business Officer. We encourage everyone to read today's press release as well as Evoke's quarterly report on Form 10-Q new, which is now filed with the SEC. First and very important, on April 27th, we announced that Evoke was granted new drug product exclusivity by FDA for Gimoti. Gimoti's marketing exclusivity along with other factors I'll discuss in a moment, will enable us to continue our mission of getting Gimoti to more patients who may benefit from our novel solution. Concurrent to our efforts to fortify Gimoti's intellectual property estate, a critical element to growing our patient population, we're also expanding patient access with new channel sales partnerships through our strategic collaboration with EVERSANA. Just as a reminder, the extension of our agreement with EVERSANA that we discussed last quarter, allows for them to utilize their internal sales organization and other commercial functions for market access, marketing, sales, distribution, and other patient support services. Staying on the theme of our efforts to increase patient access of Gimoti, last month we announced that Gimoti was added to the Texas Medicaid -preferred drug list. Notably, Gimoti was also previously added to the New York State Medicaid program, another significant coverage area with a large patient population. I should add that during the first quarter, government programs including Medicaid and Medicare made up approximately 51% of the filled prescriptions for Gimoti. With EVERSANA 's robust patient support and reimbursement team, we've been able to allow for reimbursement submission of Gimoti for patients seeking treatment, and Chris will talk a bit more about that in a moment. Net revenue increased by 16% to approximately $418,000 in the first quarter of 2022 compared to last quarter. In addition, the number of Gimoti new cumulative prescribers increased by 41%, from 425 on December 31st, to 538 new healthcare providers or HCPs for short on March 31st of this year. Two other key data points I'd like to share are one, patient enrollments for new prescription increased by 18% in the first quarter to 474 from 388 in Q4. And two, billed prescriptions increased by 28% in Q1 compared to the fourth quarter of last year. As mentioned last quarter, when a presentation of Gimoti's benefits as delivered, we've frequently see prescriptions soon after. These trials samples will allow patients to experience the benefits of Gimoti while waiting coverage completion from insurances, and allows patients to start treatment even if they currently do not qualify for insurance reimbursement. Before I turn the call over to Chris, I would like to touch on two important events, one that took place in the first quarter and another that will occur later this month. On March 16th, together with the research team at H.C. Wainwright, we hosted a virtual key opinion leader, fireside chat with Dr. Viplove Senadhi, who is the CEO and Medical Director of Greater Montgomery Patient Centered Gastroenterology and Hepatology, and a Gimoti prescribing physician. His case studies of patients who've benefited from Gimoti we're very encouraging, but also very heartening as we heard how patients lives have been changed for the better. Leveraging the 80 million patient Truven markets scan database, a team of key opinion leaders led by Dr. Richard McCallum of Texas Tech University Health Sciences examined the association between TD and risk factors such as age, sex, underlying medical diagnosis, and exposure to drugs, including metoclopramide. During our last call, I outlined four strategic areas to accelerate our Gimoti commercialization. In that call, we said we needed to raise awareness of Gimoti among patients and motivate them to advocate for better treatment. Strong awareness of Gimoti, which is a score of four or five out of five, is that 48% for all HCPs. Among all other HCP survey, 89% of all respondents intend to prescribe Gimoti. In a newly completed market research study among patients, 19% of patients indicated familiarity with Gimoti compared to 8% last fall. Moving to positioning for Gimoti, our second priority, we continue to position Gimoti as the optimal treatment for appropriate patients with diabetic gastroparesis and continue to ask our customers why are we still prescribing orals to patients with a dysfunctional gut. For patients in particular, when they saw the profile for Gimoti and our new campaign, they indicated an overwhelmingly strong interest in learning more about Gimoti, scoring it on a scale of five, a score of 4.9, which is an unprecedented score. Despite the call plan introducing 39% new targeted HCP to our sales organization, which many of them were nurse practitioners and PAs, our sales team has already reached 57% of them. About 50% of Gimoti is precribed and generated by gastroenterologist, and nurse practitioners and PAs are starting to increase their prescribing and represent the next largest specialty in prescribing. When we look to our third priority of market access and educating payers, we continue to make progress on the access of Gimoti among insurance companies and pharmacy benefit managers. Without contracting, Gimoti is covered or reimbursed for 45% of the lives in the U.S., improving since the end of last year at 42%. We continue to have productive discussions with payers through our capable national account team, and as Dave mentioned, two states have recently added Gimoti to their preferred drug list, New York and Texas. And, at least 94 plans have approved at least one prescription of Gimoti since launch. As they see demand grow, experience how patients respond to Gimoti clinically, and are educated on the needs of this patient population and the differences between oral and the nasal route of administration, we believe they will understand the value proposition of Gimoti. This pilot deployed by six out of our 27 representatives demonstrated improvements in HCP acceptance and ultimately generated increased prescribing among existing and importantly, new prescribers. As we move from our priorities to look at prescribers in more detail, through the end of March we have increased our cumulative new prescribers by 26% in the first quarter, as compared to the new prescribers  launched to-date through the end of fourth quarter. As we're seeing an increase in the breadth of physicians prescribing, we are also seeing those physicians who initially prescribed Gimoti increase the depth of their prescribing, which means they are seeing the benefits of Gimoti. In monitoring how HCPs are using Gimoti through our ATU study, we see that while the majority of prescriptions are switches to Gimoti for an existing gastroparesis patient, an increasing number of HCPs are considering Gimoti for newly diagnosed patients. Many of them are positioning Gimoti's second-line after oral metoclopramide, which is either tablet or solution. Target GI starting oral tablet metoclopramide then using Gimoti account for 45% of their use, moving from 31% last quarter. They also prescribed Gimoti first-line 9% of the time, up from 5% last quarter. We see this trend of increased utilization of Gimoti and positioning Gimoti earlier in the treatment paradigm among non-targeted GIs, primary care physicians, and importantly, advanced practice providers, those nurse practitioners and physician assistants that are so important to us. Anecdotally, feedback from HCPs continues to be strong and HCPs are continuing to share positive feedback from patients. Feedback from the group about Gimoti was very strong, with many of them having positive examples of symptom improvements with their patients. One of the most revealing discussions was regarding particular success in prescribing Gimoti for patients who had previously had an inadequate response to oral metoclopramide, or a failure. At the end of the meeting, each of the four advisors subgroups indicated the ideal position for Gimoti was first-line. Finally, as we continue to support increase adoption of Gimoti, there are a few other noteworthy strategic developments. Additionally, we observed that many HCPs who were hesitant to prescribe Gimoti without a sample to provide patients were willing to prescribe Gimoti after seeing a positive respond to a sample. In summary, we're confident in the continued progress we see with Gimoti and the increased adoption of Gimoti by providers and patients. Our first quarter was our strongest quarter since launch, and we anticipate continued and increased performance in the months to come. As Dave mentioned for the first quarter of 2022, net sales were approximately $418,000 compared with approximately $90,000 in the first quarter of 2021. Net loss was approximately $2.2 million or $0.07 per share in the first quarter of 2022, compared with approximately $2.6 million or $0.08 per share for the same period in 2021. During 2022 and 2021, we incurred expenses for ongoing stability testing of batches of Gimoti, our manufacturing has received a FDA approval of Gimoti NDA in June of 2020. For the first quarter of 2022, selling general administrative expenses increased by approximately $67,000 compared with the first quarter of 2021. In addition, we also received net proceeds of approximately $7.1 million from sales under our ATM program after March 31, 2022. We believe based on our current operating plan that our existing cash and cash equivalents, as well as future cash flows from net sales of Gimoti will be sufficient to fund our operations into the second quarter of 2023. We haven't also divulged the average net realized price as that's a direct factor associated with any contracting related topics and obviously, understanding our WAC price at $1750, and then the patient programs we have in place down to $20 per prescription. And then the last question here is that, based on the call of first quarter of '22, that seems to be substantially lower than prior quarters, at least most of the prior quarters. I'll just conclude by saying that we're all optimistic about the progresses that we are making in generating higher net prescription sales, inking new partnerships and collaborations to provide additional sales channels for Gimoti as Chris just described, strengthening our IP protection for the product, bringing up board additional Gimoti HCP prescribers, gaining additional Medicaid coverage territories, increasing patient enrollments for new Gimoti prescriptions, and growing the number of filled Gimoti prescriptions. While we're encouraged by all of these incremental improvements in Gimoti sales and prescriptions and continue to receive very positive feedback from both patients and healthcare providers, there's clearly continued room for improvement."
}