{
    "symbol": "EVOK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 18:56:05",
    "content": " With me today are David Gonyer, Evoke's Chief Executive Officer, Chris Quesenberry, GIMOTIâ\u0080\u0099s Chief Commercial Officer from EVERSANA, and Matthew Dâ\u0080\u0099Onofrio, Evoke's Chief Business Officer. We encourage everyone to read today's press release as well as Evoke's quarterly report on Form 10-Q new, which is now filed with the SEC. I'll be providing updates on key developments that have occurred during the second quarter, ending June 30 and thus far in Q3. This patient support program provides patient access to pharmacists and nurses, support for benefit verification in prior authorization and is critical to patients obtaining access to the medicines their provider prescribed for them. One significant feature of our HUB platform is the streamlining of the complex process to submit and receive approval for medicine, for both providers and patients. The recent announcements of the new state Medicaid approvals in Texas and Florida are so important, as these states provide services to approximately 10 million or nearly 16% of the Medicaid population nationally. We're pleased with the progress and access for the Medicaid population, as it represents a recognition of value and limited alternative of options for patients. On last quarter's call, we mentioned that Evoke was granted FDA market exclusivity in April. As a result Evoke has exclusive U.S. marketing rights over a three-year period, beginning on GIMOTIâ\u0080\u0099 s FDA approval under the Hatch-Waxman Act to protect the product from generic competition. Another positive development during the quarter was the main announcement that our first ever patient-centric survey conducted by Evoke and Everson reported, increasing patient awareness, trial, and product usage of GIMOTI. I'll let Chris tell you a bit more in a moment, but overall, these data gathered from patients are promising and clearly show the vast potential value that GIMOTI provides to people suffering with symptoms associated with gastroparesis. The reception and feedback I received was quite rewarding, very encouraging, and rather humbling as it relates to patients struggling with gastroparesis and how GIMOTI is helping. My experience out in the field allow me to speak, discuss, and further understand the benefits of GIMOTI with frontline healthcare providers first hand. It also provided me the increased confidence for GIMOTI is important and needed place in the treatment of patients with gastroparesis, for today and for the future. And we are gratified to present a poster of distinction to scientific and clinical experts and key opinion leaders that provided real world statistics using the largest claims database available, which covers over 80 million lives in the U.S. to assess the incidence of TD, including patients taking metoclopramide over a 10-year period. Results from patients that received metoclopramide demonstrated a lower risk of developing tardive dyskinesia or TD, than stated in previously reported studies. The data showed 98.8 per 100,000 incidences of TD, or just 0.1% among gastroparesis patients treated with metoclopramide. By supporting the largest ever real-world study on this important issue, we hope these data help HCPs and organizations understand the incidence of TD, recognize patients who might be at a higher risk and revisit the benefit versus risk of this important compound in patients with gastroparesis. In the second quarter and now in the third, we continue to expand access, to GIMOTI in collaboration with Eversana and other partners that will help us access patients who need help with their disease. vitaCare is an e-prescription service that provides an effective, quick and convenient way for patients to receive medications. While the specifics of a deeper, long-term partnership are still being discussed between vitaCare and Evoke through Eversana, we've expanded the service from a pilot in February to full scale launch in May, which has contributed to the increase in prescriptions, especially inbound. And specifically vitaCare care helps patients understand coverage and identify available savings opportunities, as well as facilitating communications between providers and payors. Performance wise, we had the strongest quarter to date with 24% increase in prescriptions. In addition, the number of GIMOTI new cumulative prescribers increased by 23% from 543 at March 31 to 669 new prescribers at June 30 of this year. There are several contributing factors to this, including improved brand messaging, stronger execution from our sales team and key initiatives to streamline the prescription process for patients and providers. Prescriptions vitaCare, already account for 62% of the prescriptions through the end of second quarter. I'm going to spend a good amount of time on the second piece here, which is patient awareness and what we've learned about patients. In the second quarter, we conducted our first patient ATU study, which stands for awareness, trial and usage. And most of these patients have taken medications for their gastroparesis, including many that take multiple medications. Off those patients in the study who were aware of GIMOTI prior to the survey, 43% are current users. HCP awareness stands at 80% of target GI and awareness among non-target GIs, primary care physicians and NPs and Pas have all risen since January. In the second quarter, we accelerated our speaker programs and trained both GI and nurse practitioner and physician assistant speakers. Also in the second quarter, we updated our physician campaign and messaging. This campaign is a natural evolution from our Spray Away Symptoms Campaign, which focused on the route of administration for GIMOTI, and the benefits of bypassing the GI tract. We are moving from Spray Away Symptoms to think outside of the pill box patient feedback to this campaign via Marco research was very well received when patients saw the profile for GIMOTI and our new campaign, they indicated an overwhelming interest in learning more about GIMOTI rating, their interest of 4.9 out of five, which is unheard of. Importantly, we expect plans to want to drive generic utilization for patients and would require patients to try Carlson of oral therapy, first Our position is to work with payers to allow access for patients who cannot take oral or for those who orals pro provided inadequate response. As I see demand grow, experience how GIMOTI, patients response clinically and are educated on the needs of this patient population and the differences between oral and nasal route administration, we will believe â\u0080\u0093 we believe they will understand the value proposition of GIMOTI. Our performance continues to steadily improve in terms of reach and access to providers, prescription volume, number of new and total prescribers, breadth of prescribing from different specialties and depth of prescribing among other leading indicators. We are showing signs of progress among specialties with the greatest response from targeted GIs and NPs and PAs saying they preferred use GIMOTI a second line, 40% and 44% respectively. We have taken significant strides to improve the access to GIMOTI, enhance patient and provider experience through programs, including our partnership with vitaCare. For the second quarter of 2022 net product sales were approximately $462,000 compared to $237,000 during the second quarter of 2021. Research and development expenses totaled approximately $191,000 for the second quarter of 2022 compared with approximately $195,000 for the second quarter of 2021. For the second quarter of 2022, selling, general and administrative expenses were approximately $2.3 million compared with $2.1 million for the second quarter of 2021. We continue to expect that selling, general and administrative expenses will increase in the future as we continue to progress with the commercialization of GIMOTI and we reimburse Eversana from the net profits obtained from the sales of GIMOTI. In addition, we also received net proceeds of approximately $7.1 million from the sales under our ATM program during the second quarter as Dave mentioned."
}