{
    "symbol": "PLBY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 19:46:06",
    "content": " As we said in our last call, this year we are focused on two main priorities: one, is the continued expansion of our direct-to-consumer business, by integrating in the assembling the pieces we have acquired; and the other is to build out of our creator platform Centerfold, which we expect to ultimately drive incremental high margin revenue and create a flywheel effect for our consumer products. Direct-to-consumer revenue was up 125% year-over-year to $49.6 million in the first quarter and we made great strides executing on our growth strategy, which consists of expanding our product line, building out our merchandising and marketing function, strategically expanding our retail footprint and consolidating and optimizing our tech infrastructure. We talked about it a lot in the prepared remarks around how strong we see the brand to be and how strong we see demand out there, that's not only true for Playboy, but it's also true for Honey Birdette and was a big reason why we acquired that company, because they have such a loyal following and are really able to generate such brand equity. Anytime we've done a collaboration on the Yandy or if we’ve sold Playboy product in Lovers stores, we actually see really strong demand for that, a lot of the growth we saw at Playboy in particular was driven through expanded assortment, better awareness of Playboy.com as an e-commerce destination, not a content destination that's something I talked about. So obviously the opening of new stores, is some of the best awareness we can build and so when we look at the roadmap for the balance of the year as we move Honey Birdette into the Northeast and around the New York metropolitan region, that's the best marketing, because it's profitable marketing, right, where as Lance said those stores do about 30% EBITDA margin and off the back of that what we see is a very high return customer rate on e-com as well. The other thing that we've talked about is leveraging the Centerfold platform as an engine for organic customer acquisition, a lot of these creators that we're working with already have a propensity to wear and to use Honey Birdette branded product."
}