{
    "symbol": "PLBY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 23:10:35",
    "content": " Playboy continues to see strong global consumer demand with the Gen Z customer and the strength of our strategic partnerships, which include recent premium collaborations with Yves Saint Laurent featuring Romeo Beckham, Halo and  (Ph) and we are expanding our portfolio to include Playboy lingerie designed by the Honey Birdette team, which we will launch later this year. Embedded in our prior fiscal year 2022 adjusted EBITDA outlook with an expectation that on a pro-forma basis, non-product costs would increase by a little more than $30 million this year, an increase of roughly 17% year-over-year to over $210 million annually. Over half of that expected cost increase for this year, or more than $17 million was expected to be driven by our investments in building out both our direct-to-consumer business and CENTERFOLD around seven million of the expected cost increase due to technology and infrastructure costs. But we have decisions to make on the remaining store openings that were planned for this year, Our existing U.S. stores that perform quite well averaging a million dollars of annualized revenue per store was 30% for a while EBITDA margins, which makes for a compelling argument to push forward with our previously communicated plans. Same thing on the licensing side, it is predictable but if - as we saw Yandy second quarter, if our if our partners start to experience worsening trends, and then they come to us and say, hey, our forecast for the rest of the year is lower than we thought it was in Q2, we are going to have to take down revenue even further. Your tech and infrastructure costs that you are putting in this year, call it $7 million whether the business that is $300 million or $600 million of revenue, that tech cost is going to be largely $7 million, maybe it goes up by a million dollars if you were to double your revenue, but it is largely a set cost."
}