{
    "symbol": "PLBY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 22:34:15",
    "content": " After our prepared remarks we will open up the call for questions when we'll be joined by Ashley Kechter, President of Global Consumer Business The information discussed today is qualified and its entirety by the Form 8-K that has been filed today by PLBY Group Inc, which may be accessed on the SECâ\u0080\u0099s website and PLBY Groupâ\u0080\u0099s website. Forward-Looking Statements are subject to risks which could cause PLBYâ\u0080\u0099s actual results to differ from its historical results and forecast, including those risks set forth in PLBY Groupâ\u0080\u0099s filings with the SEC and you should refer to and carefully consider those for more information. As we have stated throughout 2022, we had two goals this year, the consolidation of our DTC businesses and the continue build out a recruiter led digital platform. This inflationary period continues to impact consumer retail businesses with higher costs, rising interest rates, oversupply and declines in discretionary consumer spending. Part of this reduction includes the sale of the Big Bunny aircraft, which we sold for 17.5 million generating a more than 2x return on our initial cash investment, and more than 10 billion pressing questions and under two years of ownership. As a result, our business will align around Honey Birdette and our hero brand Playboy. Honey Birdette continues to perform well, especially given the macroeconomic environment and the strong U.S. dollar that continues to impact results. Following on the success of our Honey Birdette store in the luxury high traffic Westfield Century City Mall in Los Angeles, we opened our first own Playboy pop up store in mid October. The space features rotating iconic Playboy favorites, brand collaborations and seasonal lines, and we are encouraged by its early success. The current margin for Playboy's pop up location is also 7 percentage points higher than Playboy's e-commerce margin, and we expect that to increase as we incorporate more of our owned and operated merchandise into the store. Last week, our first true private label consumer product for Playboy launch was Playboy lingerie to great early success. Within our licensing business, we're excited about recently launched brand partnerships in Asia, including My Sugar Babe in trendy Japanese streetwear brands and an experiential lounge collaboration with retail pop up and world renowned nightclub 1OAK in Tokyo. Long-term, we believe Playboy needs to be integrated into or replace Lovers as the brand. With the iOS changes last year, the Yandy business has become even more challenging to operate efficiently. Second, we believe it can be a highly effective top of the funnel customer acquisition engine that we expect will lower our customer acquisition costs across all of our PLBY business lines over time. And third, we can believe it can become the Playboy magazine of the 21st century and its ability to drive enormous cultural relevance and priceless emotional connection with a massive consumer base around the world. On the first point, we strongly believe that the Playboy creator space is right for a brand that is aspirational, one that creators are proud to show off their affiliation with and one that is deemed safe by creators and consumers alike. For nearly 70 years, the pages of Playboy were the place for creators of their time to freely express themselves and monetize their sex appeal, and they sophisticated and aspirational way. This brand authenticity makes Playboy today enormously appealing, is a high-end space for creators and talent to launch their careers and make money from those fans who are eager to connect with them. For example, we now offer superior messaging capabilities, custom personalized data analytics, and advanced content organizational tools for creators to most effectively engage with and monetize their fan relationships. Since new platform has gone live, the number of creators who are making money in any given week has doubled. And most importantly, on average each week, 70% of our creators are making more money than they made the previous week. We're very encouraged by the strong desire we see from top and emerging creators become part of Playboy, and we're confident that we can provide them with a superior product experience to the competition. The fact that our Playboy lingerie model search has already generated more than 10,000 applicants less than halfway through the open submission proves that the potential to be on the face of Playboy is an enormously effective creator recruitment tool. As paid digital marketing continues to become less effective and efficient, with privacy changes and other industry challenges, expanding our owned network of fashion influencers and affiliates has enormous strategic advantage. Of course, as we scale are actively engaged creators, we believe this should exponentially scale the traffic we're generating, thus growing our customer database and helping us drive reduce CAC across the organization. Our Yandy, Lana Rhoades collection released in Q3 was a great early test of how we can execute these special opportunities for creators in a way that drives accelerated growth across our business lines. The built in promotional monitor drove to the collection across her social media channels drove an 84%, uptick in traffic yandy.com, and the 37% increase in daily revenue at a margin 10% higher than similar lingerie. We also saw Playboy creators like Amanda Cerny, organically support Lana, pointing to the value of nurturing a Playboy community of creators. We are well poised to enter this great brand 70th year, which just so happens to be the year of the rabbit with great brands and business momentum driven by our creators. Revenue in our direct to consumer segment was up 22% year-over-year to $44 million, and on a constant currency basis was up 25%. Similar to the trends we saw in the first half of this year, we continued to see strong revenue growth at both Honey Birdette and Playboy, offset by significant declines at the Yandy and to a much lesser expensive hours. Honey Birdette posted solid growth, revenue was up 34% year-over-year to just over $21 million in the third quarter, and on a constant currency basis revenue grew 41%. As Ben mentioned, we expect to open three new stores in the fourth quarter which will bring our U.S. store footprint to 11 by the end of the year. We've also signed the lease in Boca Raton, Florida with plans to open next summer and are working to land additional suitable locations in the U.S. and Europe, planning to open in the back half of next year. The success we saw on email and SMS is a direct result of building out a CRM team and program to focus on customer segmentation, new SMS capabilities, and a digital marketing strategy to reward our loyal customers through early access events and new product launches. It's also particularly interesting given we've not yet started to tap into the email database that the Playboy creator platform form brings, which we believe will be a powerful unlock to drive growth and reduce customer acquisition costs for our direct-to-consumer business over the long run. While the current macro environment continues to negatively impact discretionary spending habits of the target Yandy and Lovers consumer, we're focusing on the levers within our control. This has meant spending less on digital marketing in light of the reduced efficiency we seen in those channels, ultimately leading to lower revenue but increased profitability. The decline mostly driven by a $1.7 million reduction in overages that we received compared to last year, as our retail partners are facing similar challenges and the current macroeconomic environment. In the third quarter, we recognized around $306 million of impairment charges related to the write down of goodwill, trademarks and other intangible assets. In the third quarter, we'd also recognize $5.9 million of inventory reserves. One major factor is the supply chain challenges that we've encountered over the last two years, leading to late arriving seasonal inventory that it's not turned as quickly as the inventory that arrived on time. Additionally, the significant decline in Yandy revenue has left us with low quality and low margin wholesale inventory that we need to liquidate as we realign our business around higher quality and higher margin owned and operated Playboy products. We have made significant progress on our expense reduction initiatives, taking roughly $18 million of annualized OpEx out of the business. Adjusted EBITDA for the third quarter was over $700,000, a sequential improvement of $3.3 million, despite $1.8 million less revenue compared to the second quarter. Even with continued investment into our growth initiatives, we expect cash flow from operations to remain roughly neutral to the end of this year. Your line is now open. And actually before Ashley and Ben get into that I misspoke I wanted to make sure I updated the impairment charges were actually 301.9 million of impairment charges, but I'll let Ashley and Ben answer your question? As we look to simplify and streamline our business, we have a brand that is probably one of the most recognized brands in the world and December will be in 78th year. And that will enable us to continue to sell the strong merchandise we have through the Lovers brand, but to more to exponentially add the Honey Birdette product that we're seeing success in as well as rolling out a much bigger expression of our Playboy pleasure product. And so, we're going to start with the Playboy pleasure line and then lead into additional store opportunities that we will either rebrand or integrate into the Lovers business that exists today. As a hero, Playboy store, I think that you can imagine that Lovers will be branded something with the Playboy name in it, but might be Playboy pleasure or something else is we work through that branding as we enter 2023. We did talk about last quarter, how we've -- we've worked out some payment plans with our partners, because they have been impacted by the COVID lockdowns. It's important for everyone to just be aware that, they continue to pay us some of those payments do get delayed, because a lot of people don't know this, but the payments that they make us are subject to withholding tax at the time that they send out the wire. Alex, let me just also add long-term as we sort of think about 2023 and beyond, I think I stated this historically, but for the past couple of years, we believe transitioning our China Business into joint venture would be the most beneficial to provide long-term stability and growth in the market. And so, as we move forward, I think that is the best structure for our business and also provides the most stability and long term growth and that's what we're focused on. Your line is now open. And so, we delivered a strong Halloween season with continued interest in the bunny suit and also integrated some additional Yandy Halloween costumes into the Playboy business and we saw that through much of Q3 and then into October. Last year, we were operating with Yandy in a very different way where we were driving revenue at the expense of profitability and going after top-line aggressively. As we've seen the ineffective marketing results as we've looked at, iOS privacy changes have hit us, we've significantly reduced the paid media side with item earnings. And what we saw, which we feel pretty good about is we reduced our paid media spend by 2.5 times versus the decline we saw in revenue. Just one follow-up on Centerfold, it was really great detail you shared about the progress being made there on the tech side. And also, how do you view the competitive landscape obviously, listen, existing players there, Twitter over recent weeks has mentioned the possibility of launching sort of similar tools and services to their users. The way we're thinking about was the Centerfold product, which is really now Playboy as we integrate everything together. But we know what the consumer is wanting, we know comes down to messaging, we have started to onboard creators at a faster pace over the past few weeks now that we feel very comfortable with the product. And when we think about the top of the funnel and the integration that it provides for the rest of the ecosystem, you're seeing it through our social media posts. And as Lance said, we saw a massive increase in our email and SMS at playboy.com and that's without tapping into the tens of thousands plus of customers that we have, we see their email on at Centerfold. So as we move forward, this is a brand that has worked with creators for the past 70 years. And I believe that if we are successful and continue to be successful with the creators that we bring onto the platform, it will not only lead to a very profitable business into Centerfold by itself, but it will drive the rest of the business as well. So, one of the other things that we've done to integrate across both our Centerfold business and our consumer products business, we currently have a model search going on through this partner orbit. And what we're seeing is as we have applicants into this program, we are able to shift them into the creator program and have a significant amount of interest from those same applicants to join Centerfold. And so for us, this is a big win where there's a significant amount of synergy between creators that want to be part of Playboy. Yes, I think it's everything we do is going to be centered on one ecosystem moving forward. And as we look to further consolidate the business and integrate products, such as our legacy products, we now have a platform that we can do that on, which allows us to have better operating efficiency moving forward. Your line is now open. So from a cash perspective, as I mentioned, we're pretty much flat today, to where we ended the quarter, right around 65 million of cash equivalents and restricted cash. In terms of where we see things moving forward, our business -- our businesses are creating cash flow, right. But we are reinvesting that cash flow back into these growth initiatives around building out that creator led platform, building out our owned and operated business on the direct-to-consumer side, because we see the long-term potential for margin uplift there. So, we can make a choice that we could not be investing back into those businesses and produce more cash flow where we're trying to strike a fine balance here between reinvesting that cash flow into the business but not investing too much in the current environment. I mean, I also said on the call, we've got a lot of levers right now within our control in terms of managing our costs and managing investment back into the business. I mean, when you think about it, on an annualized basis, you can save around $1 million just on the infrastructure costs alone based on the work that we've done there. So, we're going to continue again to make those near-term investments and kind of balance everything in terms of our liquidity needs and make sure that we're living within the covenants of our credit agreement. And like I said, we've got a lot of different levers that we can pull if need be, but I think right now we're managing as best as we can to the current environment and we feel good about the flexibility that we maintain. You've got -- we're really just starting to put out our private label products, and we're seeing it right now with the initial launch of Playboy lingerie. And yes, I think these investments that we're making, we've talked about this kind of time and again, we're making near-term investment that we expect to pay off over the long-term in terms of margin pickup. I think you'd also asked about the interest expense, I mean, look, hard to know exactly where rates are going to end up continue to increase. But look next year, I anticipate the debt service costs to go up by at least $10 million or more. To make sure that we're, like I said, cash flow breakeven for the year. And that's really what we're targeting is to reinvest back into business in a thoughtful way, and preserve cash to whether the current environment. But unfortunately, at this time, I can't answer that question, as you can imagine, for legal reasons, and also, just for business reasons. I'll just sort of reiterate, we're enough for like, just to follow-up on what you asked Lance to, what we're focused on right now is continuing to streamline the business. So you look at what Ashley's team has done, which really didn't get into place until July timeframe, with what they've developed in a short period of time with lingerie what they have coming over the next year with private label product, all of these things allow us to enhance our margins. And then you start to think about the consolidation of our, what I would say is these very small legacy businesses into what I would say as hero products moving forward. We've seen great growth on Centerfold in other areas and Playboy lingerie after a great start, coupled with making sure that we've maintained plenty of headroom with our covenants and our cash balances, given no one knows how long the economy will be where it is, and if it will get worse or not. Your line is now open. Regarding your, the kind of formula, the guidance you provided about this, I think last quarter, you called them the annualized non-product costs. I mean, the one thing that we are seeing, you're obviously seeing this across the Board, and you'll see it you thought in the third quarter you're going to see it in the fourth quarter is, stepped up promotional activity, right. But in terms of input costs there, they're not really changing in terms of how we're thinking about it over the long term. And so we're looking pretty heavily into how we can go after savings there, across our brands, and then identify, obviously, the improved product margin and tightened buys on inventory in the current quarter all the way through the front half of next year. But right now, what we're focused on is consolidating the businesses we have around the brands that we know that work, which are Honey Birdette and Playboy. And one of the challenges with a 70-year-old company is you have a lot of small business lines that that take back office infrastructure, finance, accounting, legal, HR, etc, to maintain. And so right now, as we said, we're looking through everything from a strategic standpoint, we think there's a real opportunity to lower our fulfillment costs. We've talked about the consolidation, really on the brand side, and how do we leverage the Playboy brand within Lovers within Yandy because those aren't really brands standalone. We also -- we never really talked about it on this call, but historically, we've talked about the product, I guess breadth at Yandy, which was kind of historically how they operated with well over 10,000, 15,000 SKUs. So that's another way that we think about consolidation as Ben mentioned, if we're able to consolidate warehouses to consolidate operations on that side of the house. When we look at standard fulfillment costs as a percent of revenue, we run incredibly high relative to where we think we should be over the long-term. But going back to that consolidation point, we've got to really figure out how to kind of tie all this together, both from an inventory perspective and from a systems perspective."
}