{
    "symbol": "PLBY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-17 00:03:08",
    "content": " The business has a lower risk profile, $346 million of future royalty guarantee payments through 2031, high-quality recurring cash flows and the opportunity to be much larger than it is today. In 2022, the licensing business produced approximately $61 million of revenue, and we believe through the right partnerships, we can more than double this business over the next few years. The business is growing at over a 9% weekly CAGR since relaunch in mid-September 2022, with pro forma annualized weekly GMV already in excess of $15 million. Finally, the China JV structure has allowed us to significantly reduce the amount we pay our licensing agent on a cash basis and enables our new partner, the Fung Retailing Group, to earn up to 15% ownership of the China business at a $250 million valuation. We believe the JV we have established in China is a good model for other parts of our licensing business, especially as we think about when our contract expires in 2028 with our global licensing agent, which we were paying approximately $9 million annually too. Let's talk to more detail about Honey Birdette, our third core area of focus because I continue to believe that business is a $1 billion opportunity based on the current revenue and EBITDA growth profile. When we bought Honey Birdette in 2021, the business was doing approximately $73 million in revenue on a trailing 12-month basis and grew to $84 million in 2022. In my opinion, our current valuation is very dislocated from the immense value of the sum of the parts represent, including our lucrative brand, Playboy, are approximately $300 million of federal net operating losses, our extensive art and archive collection, the present value of our forward booked licensing revenue and the value of Honey Birdette. When you think about the value of the creator platform that we're building, and it's off to a good start, if you annualized your weekly GMV today, you would get in excess of $15 million. So, if you're able to get that to breakeven, that puts you closer to $33 million on a go-forward basis to the extent you're able to get incremental revenue and EBITDA from opening, like we said, four to five new Honey Birdette stores. So, we won't get the full annual benefit of it this year because we're already -- it's already March 15th, but we've eliminated $10 million as of this week and then the other $5 million will be coming shortly hereafter as we continue to simplify the business. If you actually applied the 9% weekly growth, and we're not assuming that continues, but if it did continue, you would get to roughly $135 million plus for the year of GMV. So, I think the question on digital longer term is what would the creator platform margins look like we've seen historically when we launched the NFT project, that was incredibly high EBITDA margin when we generated $11 million of revenue in the fourth quarter of 2021. In fact, when you think about how the deal is structured, and we talked about this a little bit on the call, moving from what was a cash licensing fee to allowing our partner to earn equity based on performance in the business at a $250 million valuation. And so, when you add that all up and as we've reduced the corporate overhead and simplified the business, and we'll continue to do that, we are focused on making sure that on a net cash basis after debt service, after cash taxes, even though we have $300 million of NOLs in some foreign jurisdictions and after CapEx that we are running this business to be cash flow positive after everything. So, if the business is cash flow breakeven, it's the $25 million plus to $8 million, that gets you to $33 million that Lance was talking about."
}