{
    "symbol": "VET",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 12:26:19",
    "content": " As shown on Slide 2, we delivered another quarter with record fund flows of $453 million and record free cash flow of $340 million, which is over $2 a share, that's up 16% and 12% respectively from the previous quarter. And finally, we said that we would increase our return of capital when we achieve the line of site to our $1.2 billion mid cycle debt target, with less than two quarters remaining in 2022 and a robust outlook for 2023, let me now return -- review the return of capital framework on Slide 4. Going forward, base dividends will remain a key component of our return of capital framework, however, we want to ensure the base dividend is resilient over the long term through the commodity cycles, while allowing for ratable increases over time where they have placed a burden on our business or the balance sheet. With our debt approaching target levels, we will pivot from allocating free cash flow for debt reduction to the return of capital, maintaining a strong balance sheet is a core principle at Vermilion, and we remain focused on that going forward. We plan to enhance our return of capital to shareholders going forward while continuing to reduce debt to a target of $850 million by the end of 2023, which implies approximately another $350 million of further debt reduction beyond our year-end 2022 target. Based on a return of capital allocation grid, recent commodity strip and internal estimates, we anticipate returning up to 25% of free cash flow in the second half of 2022 and up to 50% to 75% of free cash flow in 2023 while achieving our debt targets. As you can see on a pro forma basis including the full year impact from the Corrib acquisition, we are forecasting pro forma fund flows of 2.4 billion and free cash flow of $1.8 billion or approximately $11 per share. We also show our year end debt target of $1.2 billion, which incorporates the return of upwards of 25% of free cash flow in the second half of this year. As outlined on Slide 6, looking at our cumulative free cash flow over a three year period from 2022 through to 2024 assuming flat production from our existing asset base and applying the forward pricing, we expect Vermilion to generate over $5 billion of free cash flow over this time, representing by the blue bars. And as you can see, the majority of the free cash flow was allocated to debt reduction in 2022, including the funding of over 1 billion of acquisitions, whereas for 2023 and â\u0080\u009824 we will pivot and majority of the free cash flow will be available for return of capital to shareholders now that we have a much stronger balance sheet."
}