{
    "symbol": "USFD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 16:53:08",
    "content": " Your line is open. Your line is open. The positive thing is in the third quarter, so we saw the least amount of sequential inflation that we've seen since, I think, at the beginning of 2021 and very small amounts relative to the first half of the year, yet our gross profit per case remained quite strong. Your line is open. Your line is open. And that really is underscored by the points that both Andrew and I made of the majority -- vast majority of our gross profit gains are coming from the things we're doing in our four walls as part of our plan as opposed to deflation or inflation and the pieces of inflation that are helped, especially on the parts of the business that are a percentage markup, we think are sticky. I think when you look at any business, looking across and having sort of some level of, I'll call it, hygiene and what's the right mix and replacing customers the better customers is part of what we and you would expect, I would think others to do as we go through there. Your line is open. Your line is open. Your line is open. Your line is open. I think we would say as far as what we're seeing in the competitive environment today and have done through much of the last couple of years, is there's still continues to be, I would say, a fair degree of rationality from a pricing standpoint. Your line is open. And so I think a combination of those things as well as just some of the great work the team has done around just focusing on ongoing after business in the areas where it's growing have been really made the business sort of the year of the success it's been in terms of our ability to continue to grow, grow share across those key profitable segments you mentioned. But there's a lot of things we've also been exploring, as we mentioned earlier, a seven-day work week, which has, we think, some really important benefits from a select or turnover standpoint, but we also think there's an opportunity by spreading some of the volume across the week of creating a much better service experience for our customers as well, which is why we're very optimistic about what that could bring. Your line is open. Your line is open. Your line is open."
}