{
    "symbol": "AGI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 15:27:08",
    "content": " We expect La Yaqui Grande and higher grades in Island Gold to drive our production closer to 500,000 ounces per year over the next few years, with all-in sustaining costs, decreasing 18% to approximately $1,000 per ounce by 2024. Following the completion of the phase three expansion at Island Gold, and with the development of Lynn Lake, we have the capacity to increase our production by 65% to approximately 750,000 ounces of gold per year at 30% lower all-in sustaining costs of $800 per ounce. We're also working on an updated mined plan to be released mid-year, which will incorporate the 1.4 million ounce increase in high grade reserves and resources since the phase three expansion study was completed in 2020. Moving to slide 10, Mulatos produced 22,500 ounces in the first quarter at total cash costs of mine-site all-in sustaining cost of $1,570 and $1,782 per ounce respectively, which was consistent with our first half guidance for the operation. And we clearly have the option of staggering those projects to some extent maybe get a couple of years of development at Island Gold finish before say we would start at Lynn Lake, that's pretty much an option. So from that point of view, Island Gold is one of those very unique businesses that you see from time to time in the mining industry that can really just by virtue of the fact that it's very high grade, and it's really relatively straightforward to mine and mill, and putting all those things together that project is going to be the last one you would worry about, it's more than likely that when we come up with the economics, the increased scope for that project that we're looking at right now, and it's going to have to more than offset any inflationary costs, and I think it will. It's still a tremendous project, we'll drop our cost by -- on the order of $40 per ounce when we get it online \n And just on the La Yaqui Grande, it looks like the grade that you've stockpiled in that 16,000 ounces that you've mined already today is pretty high. I mean, it's, I mean, what if gold prices were to run to $3,000 an ounce or something like that, for example, and we're generating tremendous cash flows from operations. But given the grades that we're mining, just, for example, if we were to push it to 2,400 tons a day that would take us closer to 300,000 ounces of gold a year from that current 236,000 ounce rate that we're contemplating."
}