{
    "symbol": "IMGN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 11:45:23",
    "content": " We also advanced patient enrollment in PICCOLO, our single arm study of MIRV monotherapy in recurrent platinum sensitive ovarian cancer patients with high expression of folate-receptor alpha intended to support label expansion. As we look to position MIRV as the combination agent of choice in ovarian cancer and expanded reach, we are in the process of initiating our Phase III GLORIOSA study which will evaluate the benefit of MIRV plus bevacizumab maintenance versus bevacizumab maintenance alone in the second-line platinum-sensitive setting and Trial 420, which is intended to inform a potential path to registration in recurrent platinum sensitive ovarian cancer. Trial 420 is a single arm Phase II study of MIRV plus Carboplatin followed by MIRV continuation in approximately 110 platinum-sensitive ovarian cancer patients with low, medium or high expression of folate-receptor alpha. These are: with the compelling data from SORAYA redefining expectations for positive outcomes with MIRV and platinum-resistant ovarian cancer; supporting adoption of early folate receptor alpha testing and establishing standards for in-house and centralized testing upon approval; seeking broad payer access and reimbursement to deliver a seamless patient experience and finally, ensuring positive physician and patient experiences through tailored education and guidance for patient management. Looking at mirvetuximab plus bevacizumab maintenance in the recurrent platinum sensitive setting versus bevacizumab alone, and we already have wonderful relationships with well over a 100 sites, actually over 200 sites from the MIRASOL study throughout the U.S., Europe, as well as some countries in Asia Pacific. I mean, it's already beginning to come out, showing that patients who've had a PARP inhibitor are no longer quite as sensitive to platinum based therapy, and I think the emerging data will help us align with FDA on a benchmark that will support potential approval from the PICCOLO study. And I would just add that in the clinical trials as we expanded our reach to more and more sites who were new to Mirvetuximab, I think, the clinical trial data speak to the fact that Mirvetuximab is really well tolerated and we've had less than 1% of patients discontinue for ocular adverse events."
}