{
    "symbol": "IMGN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 10:33:04",
    "content": " 2022 was a landmark year for ImmunoGen with significant progress on multiple fronts highlighted by the approval and launch of ELAHERE as the first and only ADC for the treatment of platinum-resistant ovarian cancer encouraging data from our second pivotal program, PVAC advances in our early stage programs, including reaching the recommended Phase 2 dose for 936 and initiating Phase 1 development with 151, rebuilding our rebuilding our pipeline through collaborations with Oxford BioTherapeutics and , and strengthening our management team with Michael Vasconcelles in a newly created role as Executive Vice President, Research, Development and Medical Affairs; and Daniel Char, as General Counsel. With the momentum generated over the last 12 months, we look forward to a number of important milestones in 2023 that will include building on the strong start to the ELAHERE launch, about which I'll have more to say in a moment, reporting data from our confirmatory MIRASOL trial and submitting regulatory filings to support full approval of ELAHERE in the EU and U.S., sharing ORR data from PICCOLO in platinum-sensitive disease, completing enrollment in our pivotal BPDCN study and updating data from expanded frontline cohorts in AML with PVC and reporting top line data from the expansion cohorts with 936. Your line is now open. Your line is now open. So in terms of the regulatory bar for recurrent platinum-sensitive ovarian cancer, and I would say, later line patients, so with two or more priors, there is no clear bar, unlike in the platinum-resistant setting where we aligned with FDA as you pointed out, on 12% based on multiple Phase 3 trials with investigator choice chemotherapy. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. But I think, again, the most important point for everyone here is when we look at our business plan to include cash, cash equivalents, anticipated revenue from ELAHERE, and also, we've got this very broad portfolio of partnering agreements that include multiple folks with very active programs to include, for example, , who expects to file with the Chinese FDA that we would get a milestone payment upon filing, and that's coming in the second half of this year. Your line is now open."
}