{
    "symbol": "ZWS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 14:58:05",
    "content": " The recently completed merger with Elkay and the prior year Wade Drains acquisition contributed 67% year-over-year growth and the core business drove 16% growth, with price realization contributing high single digit growth year-over-year, and the balance of the core sales growth coming from our non-residential markets and our strategic share capture initiatives. Our non-residential business which is comprised of drinking water and commercial sinks, below double digits on a year-over-year basis driven by solid market demand in both product categories and improving price realization as we've quickly implemented ZEBS price realization standard water across all product categories within the Elkay product groups. The residential sink product group declined mid-single digits in the quarter as the improved price realization was more than offset by the overall softening in the residential market, as well as the $5 million of product line exits as we started our 80:20 simplification actions in the quarter began to exit certain residential commodity, private label and OEM sink SKUs I just discussed. With respect to Elkay, margin saw a substantial improvement from low double digits in the prior year third quarter to mid-teens in the 2022 third quarter driven by the accelerating price realization I discussed earlier, as well some early benefits from an integration actions partially offset by some investments needed in the business, as well as the adverse impact on material and transportation related inflation. But hopefully by the time we get to the second half next year, we're sort of on play and it's not as big of a headwind as it was in the third quarter and the fourth quarter and likely will be you know, as we start 2023. I mean, I think the big takeaway, it's starting '23, is it really is just one business with two additional really, really dynamite product lines that are now structured and being run, like we're running the Zurn business. And so, I think there'll be a period of time where, expectations need to get reset, we really have to understand in terms of value but I think we're going to continue to do what we've been doing for a long time, which is cultivate things that fit inside of our core transact at reasonable levels and integrate it well and then grow from there. On the non res-side, I think that when you look at residential, I think we're taking a big whack out of it in the third and fourth quarter, there may be a little bit in the first quarter, but I don't think it's material in the grand scheme of things. In the first step, if you think about that as more of a mid-single digit on the Elkay as we're going to blend it together, it's that low to mid-single digit range from a price realization going into next year, Jeff. Well, I think specifically as it relates to the fourth quarter, we're going to see free cash flow in the $90 million to call it $100 million range. No, I think we're going to hit the ground running in 2023 with the synergy realization as a result of I think the significant work we've done around on creating these as product lines and moving on some of the -- you know, costs that we had line of sight to, I'll leave it to Mark and Dave to communicate. So, I think they'll all be amplified by margin perspective relative to where they've been solely because of the synergies that we're going to generate, but I don't know that it's outsized at any one quarter relative to the next. We'll obviously provide more colors at the close, but right now, it's you know, we wouldn't say that it's overweight back out or the way front, I think that a lot of the actions are occurring now what we feel pretty good about being at that run rates going into next year."
}