{
    "symbol": "OSBC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 15:52:03",
    "content": " Net income adjusted to exclude West Suburban acquisition related costs, less net gains for brand sales was $24.1 million or $0.53 per diluted share in the fourth quarter. The margin benefit resulted from balance sheet mix improvement, the impact of rising rates on the variable portion of the loan portfolio and strong loan growth for both the second and third quarter, which are now represented in the growth in net interest income. The allowance for credit losses on loans increased to $49.5 million at the end of the year, from $48.8 million at the previous quarter, which is 1.28% of total loans and just a few basis points more than the total ACL to gross loans at September 30, 2022. At quarter end $1.6 million of provision for credit losses on loans was recorded, partially offset by a reduction of 74,000 up for provision for unfunded commitments. The increase in the ACL on loans was primarily driven by a slightly higher loss rate in the fourth quarter compared to the prior few quarters, primarily due to the sale and related charge-offs resulting from one larger non-performing credit, which we have spoken about on this call for over a year now. Non-interest income continues to perform well with growth noted in the fourth quarter of 2022, compared to the third quarter of 2022 in wealth management fees, bowling  income and card related income. On the expenses front, a little bit elevated in the fourth quarter, in large part due to incentive compensation and Old Secondâ\u0080\u0099s performance this year on loan growth and bottom line performance relative to budget. Non-interest income decreased from last quarter by $2.6 million, driven by a $1.1 million net decrease in mortgage banking revenues, primarily stemming from a reduction in MSR income, as well as $910,000 net losses on security sales. So reduction in other income due to pretext gains recorded in the third quarter of $743,000 from the sale of our Visa Credit Card portfolio and $180,000 due to the sale of the land trust business, both acquired with the West Suburban acquisition. Provision for credit losses of $1.6 million and our economic outlook remains largely unchanged from the third quarter, with an unemployment rate projection of approximately 4.5% to 5.75% through December 31 of this year and over the remaining life of the loans. Classified loans decreased modestly as Jim noted and I would add that a larger credit we downgraded in a prior quarter was sold early in the first quarter 2023, resulting in an $800,000 charge off taken at year-end."
}