{
    "symbol": "KNDI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 12:25:03",
    "content": " And my last question is, since off-road looks like a major primary business in the U.S. for Kandi, I would think it's time for the company to start breaking down each of the segments in the security filings instead of all together under off-road vehicles. Year-to-date the company has only put out one breaking news type of PR back on January 10, 2022, Kandi PR announced, Kandi enters framework agreement to produce battery swap enabled electric vehicles, referencing has signed framework agreement with Hunan Hengrun Automobile Company to jointly produce battery swap enabled pure electric vehicles. One other question from a PR by Hengrun on its website in China, October 13, 2022, they announced their Hengrun H23, formally the Kandi K23 with quick battery exchange has been officially released for sale at RMB139,800 around US$19,800. On our last conference call, Mr. Hu confirmed that in the earlier 10-Q also the Kandi had at that time received two contracts for electric golf carts, totaling some US$70 million for this year with almost all in the second half. A few weeks ago on info I got from an exciting Kandi independent dealer, who was patiently waiting for his own golf cart order, and the truck, by the way, said Lowe's Corp. was now selling Kandi's golf carts. However, with this information available, it's easy to see that Kandi has already embarked on an incredible future in just this very hot sector alone that could pass 80 million in sales the second half of this year, surprising all of last year's revenues. Anyway, it's very rare that blue chip companies such as Coleman and Lowe's would risk their reputation and give such a vote of confidence on such a new provider's Kandi in this high ticket market unless they saw a bright future together. Although we have a more stable revenue since quarter three compared to quarter two, which stays around US$6.3 million for the whole fiscal year of 2022 we expect to generate roughly US$27 million or US$28 million of the sales from this Jiangxi Huiyi entity."
}