{
    "symbol": "OCFC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-20 15:22:08",
    "content": "  Operator: Hello everyone, and welcome to the OceanFirst Financial Corp. Earnings Conference Call. I would now like to hand over to your host, Jill Hewitt, Investor Relations Officer to begin. Good morning, and thank you all for joining us today. I'm Jill Hewitt, Senior Vice President and Investor Relations Officer at OceanFirst Financial Corp. We will begin this morning's call with our forward-looking statement disclosure. We refer to our press release and other public filings including the risk factors in our 10-K, where you will find factors that could cause actual results to differ materially from these forward-looking statements. This morning, I'm joined by our President, Joe Lebel; and our Chief Financial Officer, Pat Barrett. This morning, we will provide brief remarks about the financial and operating performance for the quarter and some color regarding the outlook for our business. As a reminder, in addition to the earnings release issued last night, an investor presentation is also available on our company's Website. After our discussion, we look forward to taking your questions. Our record earnings reflect expanding margins, disciplined expense management and strong loan growth with benign credit conditions. While provision expense was $3.6 million for the quarter, an increase of $2.6 million from the prior linked quarter. With the potential for a recession ahead, the increase in provision for the quarter represents general macroeconomic factors and risks external to our portfolio's asset quality and loss experience. Tangible common equity per share increased to $17.08, reflecting earnings momentum and stable AOCI marks related to our investment portfolio. Over the past eight quarters, tangible common equity per share has increased 14%. At this point, I'll turn the call over to Joe to provide some more details regarding our progress during the quarter. Loan growth for the quarter totaled $199 million, capping off a record year of net loan growth of $1.3 billion. Loan originations of over $3 billion for the year were primarily driven by the commercial bank, with growth across the bank's footprint. Originations were also bolstered by our conservatively underwritten construction vertical, which we expect to drive additional loan growth in 2023. Regarding credit risk metrics, we ended the year with net credit recoveries, decreased delinquencies, sharply lower criticized and classified assets and improving portfolio risk ratings. At just 15 basis points, nonperforming assets, excluding PCD loans, are among the lowest level the bank has ever recorded. That said, we expect loan growth to continue in the mid single-digit ranges with less noise from prepayments. The deposits of $9.7 billion decreased just $57.6 million, less than 1% as compared to the prior year. The loan-to-deposit ratio ended the year at 102.5%, up from 97.6% in the prior quarter and slightly above our target of 95% to 100%. We expect modest deposit growth in the coming quarters, but we will exercise price discipline and pace deposit growth to approximate the growth in well-priced credit facilities. We will be methodically focused on deposit gathering through our seasoned relationship bankers, treasury management teams and competitively priced consumer deposits. With that, I will turn the call over to Pat to review margin expansion, expenses and tax rate expectations. Net loan growth of $199 million in our historically asset-sensitive balance sheet drove another quarter of margin improvement, which expanded by 28 basis points to3.64%. While our margin was clearly impacted by higher funding costs, it's important to expand or reiterate Joe's remarks and highlight that our deposit betas to date have proven to be lower than we would have expected, and we believe will ultimately outperform others in this respect through the current rate cycle. First, the quarter end loan portfolio of nearly $10 billion was $100 million higher than the fourth quarter average. Second, nearly a quarter of our earning assets are floating rate, providing further opportunity for margin expansion, although likely at a more modest rate. Also of note, although not material to the fourth quarter's performance is that we resumed securities purchases during the quarter as part of an overall effort to lock in longer-term investment yields and in conjunction with other efforts, move our asset sensitivity towards a more neutral position. Core noninterest expense remained relatively flat in the fourth quarter compared to the prior quarter, with almost equal and offsetting increases and decreases in professional fees and data processing expense, respectively. It's also worth noting that our effective tax rate for the quarter was 24.6%, and we expect that to remain in the range through the rest of this year. Overall, we continue to remain very disciplined around expense management. This, combined with our steady growth puts us in a position to highlight that we've already outperformed both the 2022 and 2023 quarterly efficiency and profitability targets that we announced at our last Investor Day in third quarter of 2021. As a reminder, the 2023 core target metrics set at that time were to earn $0.65 per share, meter exceed 1.1% ROA and achieve an efficiency ratio of around 50%. Having largely achieved that performance a year earlier than originally anticipated, we continue to work through how we should be thinking about financial targets going forward. Not only are we considering the external economic and interest rate environment, we're also reviewing how our efficiency and productivity across all of our operating businesses and processes compared to industry benchmarks. More to come on this topic during the second quarter, but expect that over the near to medium term, our targets may be framed more in terms of relative performance rather than absolute goals. Your line is open. Just wanted to talk about the -- Joe, you mentioned the pipeline, but still, I think, talked about mid single-digit loan growth from here. Sure, Frank, it's Chris. In terms of the strategy over the loan-to-deposit ratio, we love being like 95%to 100%. I mean, frankly, the last couple of days of the year, we had just a couple of variations in deposits that were a timing thing. We'd like to try and manage to stay around 100, there's really no issue going to 102 or 103, but we are not going to become a bank that's going to go to 120. So I would expect, as we go into this year, we think we're going to have mid single-digit loan growth based on as much as we can see now, right, which is really early in the year. So in terms of where we're going to get those deposits, we have a terrific group of commercial bankers that have had a little bit of a luxury in the last couple of years not to have to focus as much on that. Obviously, their goals and objectives this year will be heavily focused on deposits. So I would think about deposit growth coming in as a blend, some of which may be noninterest-bearing, but a lot of it may be either less price-sensitive interest-bearing accounts and some of it will be just be market-sensitive rates. So when we blend on that and we look at the loan opportunities in the pipeline, I think we can maintain margins. As Pat said, there's an opportunity potentially for additional margin improvement, as long as rates continue to increase and then maybe flattening out after the increase is top. And then, Pat, you also -- Pat also mentioned the securities purchases. Well, it's kind of the trade you make for future asset-sensitivity versus future log-in future returns. So net-net, we are -- if you consider incrementally, we are funding it at wholesale costs, we probably clear about 1% on those increases. Now the combination of that and some other efforts that we are looking at, we are hoping to get to where our downside sensitivity is reduced from what we had last year. And frankly, as we move through this year, we kind of like to try to position ourselves relatively neutral. This is an opportunity for us to try and minimize the risk to future margin compression, should rates begin to change in the back half of the year and going into 2024. So in the period of zero interest rates, we were comfortable letting the bank get pretty asset sensitive. But as we start to get closer to terminal rates, we want to make sure that we've got kind of reduce some of that volatility that you might see in spreads. So we are dollar averaging into a few positions, we are going to watch the market, watch what rates do, watch what our own interest rate sensitivity evolves to be, and also look at the peer group and make sure that we kind of stay in the band of folks that we want to be in with. Your line is open. Hey, Danny, it's Pat. So, yes, I think fourth quarter is a pretty good jumping off point. So we might see it tick up just a little bit with merit increases, but the run rate on most of our line items is pretty solid right now. The FDIC assessment will hit us like everybody else to the tune for us, it will be about $2 million on the new rate scale. And then maybe on the fee income side, a little bit below what we're all looking for. Yes, I'd say a couple of things just on swaps and the outlook there and then Joe may chime in on both loan volume and Trident. So while loan growth has been pretty good, the origination volume has come down quite a bit. So we're seeing kind of slower prepayments, and that's what's affecting growth. So if you looked at the swap income that's going to vary with your new originations, not with your portfolio growth. So Joe, any comments on swaps or Trident or â\u0080¦\n I think you hit right on the head. Relative to swaps, relative to Trident, I'd say that there's always a little seasonality in the fourth quarter, but I think there's also a mechanism that rates have gone up substantially in the residential market. While we're still doing the commercial business and we are doing more and more of penetration there of our own book into Trident, that we expect that run rate may be a little bit muted over the next year until we get a little bit more normalized, less volatile rate environment in the residential space. And then lastly, just on the -- I guess, on CRE loan growth, in particular, just curious, the interest cap renewals, I mean, there was an article in Wall Street Journal recently about how that may impact values of real estate in the industry and that potentially loan demand there. So at the very beginning, we are looking at how interest rate changes over time will affect that borrower's ability to kind of roll that loan. So we have less than 1% of our assets, in central business district office underwritten CRE. Most of the exposures we have been well stressed tested at the beginning and have enough room that we don't think rollover risk is going to be material, at least if rates kind of top out where the market expects now. Any thoughts you have about other segments, Joe, you've seen outside the office segment and kind of continuing strength. I think one of the things we do well is, and especially in the CRE book is we have diversified not only within asset classes. So in the last few years, with the advent of our  New York offices, which are now already 4 years old and more recently, Boston, Baltimore, we've really diversified the portfolio. Your line is open. Number one, on the kind of one of the opening slides here, you guys talk about the balance of efficiencies and technology investments you guys are making. So Pat, maybe asking the expense question a little differently. And certainly, we can do better in preparing for further scale in growth across the business lines that we are in over time. And so in this environment -- in any environment, we would be focused on that, but particularly in this environment, we know that our revenues over time are likely to fall, and we want to try to protect the efficiency or the operating leverage that we've achieved even in the face of the falling revenue environment as rates come down over time. But again, it's an important focus for us this year. And then just secondly, Chris, you mentioned the I forgot how you clarified it, but I think it was the central business district office. And -- and as you think about growth opportunities for next year on the commercial side, Joe, as a follow-up to that, I mean, -- can you maybe just give a little bit more color both kind of by product and geographically, where maybe the pipeline could rebound faster? So for us, that would be New York, Philadelphia and Boston. So as I mentioned earlier, we have about $1.1 billion in office in the portfolio. Central business  office is only about $125 million, which as Chris mentioned, 2% of the CRE book, 1% of the total loan book. And if you strip out, as Chris mentioned, if you strip out life sciences or credit tenants, that's -- it's down to $50 million in central business district. We look, but we have a fairly narrow credit band, which I think has served us pretty well. In terms of growth in CRE and growth in the book, I'd say this, we -- I think I mentioned last quarter, end of period pipeline is just a day and time things rotate back and forth at a fairly rapid pace. We've seen already -- we saw some pullback in Q4 with some of our clients, yet already in Q1,we've had people out looking for opportunities. So there's still a lot of liquidity in the investor market, and people want to put money to work. I would just to kind of complement Joe and his team, weâ\u0080\u0099ve assembled a group of commercial bankers that specialize in a lot of different things, which gives us the opportunity to really diversify not only the portfolio, but the growth we're putting on in any one period and the geographic diversity. And then just lastly for me, it was great to see the ROE of the business. You guys talked a lot about the inputs being ahead of schedule, but like the 15% level, high-level for you guys over the last handful of years. There's a narrative that banks are kind of at peak earnings and there's pressures on OpEx, NIM, all those things. It's hard for any of us, I think, to have a lot of certainty around what's coming. Yes, we are going to be a little more competitive around deposits in the first half of the year. But our existing deposit base has been rock solid, and that's going to continue to serve us well. In terms of loan yields, you saw the loan yield pickup, the investment yield pickup this quarter. So -- so without growth, I think you've got some margin expansion. In terms of operating efficiency, I think we've done a good job to date. I'd kind of look back, absent the pandemic, which I know is a giant shock to the system, that happened to be the point in time where we crossed $10 billion, and we had to work through a whole variety of things, including the scale to overcome the -- amendment changes and things like that. But realistically, with our price discipline and our credit cut, we are not going to be growing at double digits this year. So I don't know if that helps, but that's a general outlook for us. Your line is open. Chris, or Joe, Slide 6, you break out the loan geographic distribution by region. I don't know where the end game is because of the cloudiness as Chris referred to it, at least for '23. They have a little bit of a larger team as we tend to do, we are always outlooking for seasoned successful bankers will continue to do that. And the Baltimore group is largely focused on the C&I space, whereas Boston has been largely focused in CRE. But if you look at the trajectory of what we did in Philadelphia and New York, I do think we have an opportunity to grow those meaningfully down the road. And then I think maybe, Joe, during the  you mentioned some opportunities on the construction segment. Well, you guys may recall that we started a construction vertical just a few years ago with the acquisition of a very talented banker has been in the space for 30 years, and we built out that team a bit. A lot of that, as you would expect, is undrawn because these are projects that are being built out. And so we do see that even if we were to slow activity in that space because of the uncertainty, these projects are going to fund and help us support some loan growth in that segment regardless. And as you all know, especially, we will use New Jersey as an example. If you think about our construction book, a significant chunk of it, approximating 40% is non-speculative, another 40% of that spec is apartment-based. And as Joe noted, in the Northeast, we tend to have a much more stable level of inventory and prices. In fact, the home prices in New Jersey despite all the slowdown in unit sales or continue to be up about 6% year-over-year. So it's very prudently underwritten, very conservative a very thoughtful portfolio that we feel very good about. I think it's a combination of factors, David. And we were, as we tend to be typically very conservative in looking at the client base that was adversely affected by COVID during that period, we were quick to downgrade credit into classified or criticized because we had concerns, the vast majority of those folks were paying, but it made sense for us to do what was prudent for the company. As they've rebounded post-COVID, it's allowed us to upgrade those. And we've had some payoffs from that bucket as well and some recoveries, which we anticipated that we would. So I think it's just a foundational aspect of the way we approach things when we have uncertainty, we will downgrade when we need to. The first was in the third quarter of 2020, we derisked the portfolio by pushing out the stuff we thought would have a higher likelihood of having a post-COVID issue and sold that off. So we took a position that we gave a lot of short-term deferrals, worked with our borrowers, really made sure that we kind of got them through a difficult time, but we did not restructure the facilities, and enter into these kind of longer-term IO periods or payment plans that would have allowed weakness to continue. So we were able to move through that, I think, pretty effectively. When you think about last 8 quarters, 2 years in a row, having net recoveries on a balance sheet our size. I think that kind of proves out our thesis back in the third quarter of '20, which was not very popular, I think, held true. Your line is open. Good morning, Chris and team, youâ\u0080\u0099ve all mentioned 2024 as part of your thought process for managing the bank now. That's exactly what we're trying to do to learn from the experience we went through in 2020, in particular. So kind of coming through that COVID cycle, we had a strongly asset-sensitive position at the time. That resulted in our margins decreasing going down into the 270s -- and what we've been doing, and this began in the fourth quarter will continue over the next couple of quarters is doing what we can, and you can only do so much around the edges, but doing what you can to make sure that we have a more neutral interest rate risk position. So we are not trying to kind of game and environment, make money one way or another. And again, it's not to protect against additional Fed increases. So the hedge position, I guess the effective durations that we are putting on are probably in the 7, 8 year range for the cash balance sheet purchases Chris talked about swap. With respect to the cash flows that come off the book, it's around $25 million a month. Your line is open. But on the construction line that, that might come in and help with growth going forward. And they kind of have a similar, like, I think, like 6.5% yield roughly? Well, I think the average construction transactions are higher anywhere between half and 1 over prime. I'm sure some of our borrowers are disappointed that the rates have continued to rise, but they look at it from the long-term. If you build a multifamily project today and it may cost you prime plus one to build it, you can still, at the end, when you fill it up and stabilize it to get an end loan at 200 over a 7 or 10 year treasury, which is 5.5 today. And then when you get to the end game, you're going to stabilize it and get much better cash flows. Or is it kind of you're purposely being more selective, you're seeing better yields, you're price conscious. So you see a little bit less economic activity, so that does pull down the opportunity for all of us. And then as rates go up, borrowers are a little discriminating over which projects they want to take on. So you're going to be judicious about using that capital when you can make it work for you, but you're not entering into that lightly. So historically, and I have no reason to believe differently the Northeast has been less impacted by business cycle risk around things kind of boom and bust cycles. So we don't we have not observed in our markets, kind of the significant over capacity or overbuild or vacancy rates with some selective submarkets like the central business district office is certainly an area that we've got an eye on. As you can imagine, like everyone, right, we've had our trials and tribulations with CECL and the kind of high class problem to have is when you have no charge-offs, it's really hard to come up with a quantitative allowance. What I would say is that I'm very comfortable that the composition of our loan portfolio and the underwriting and credit risk management would leave us better than the peer group, which is why you tend to see our reserve being a lower coverage ratio. Yes, I don't know which segments would be hurt and to what degree. And just as a long data point, we use the Moody's SQ as kind of our foundation for our quantitative models, and still have to layer in a whole bunch of qualitative to get to the point where we are today. Your line is open. So that's an important note, right, not contraction. We -- I think the last time we spoke with all of you, we were thinking that it might be single high single-digit NIM expansion and the deposits outperformed in the fourth quarter, and we did much better than that. So a lot of it is going to be determined ultimately by how much deposit pressure we see, we haven't seen a lot to date. So we still see some modest expansion as long as the Fed is raising rates, and we think that will continue for about a quarter after they stop raising rates, and then you should start to see us flat now. So it could be 10 basis points, but I would hesitate to give you a number. So we have about 68% or so of the book is fixed and the -- and the rest, obviously, is float. But I hesitate -- but I think that when you think about deposit betas, I think you're still going to see us on the low end of the pack going forward. If we do see a slowdown in loan growth, obviously, the balance sheet has been a bit more protected from AOCI, so your tangible equity ratio is pretty solid. And obviously, we've not been doing buybacks. Obviously, we see growth slowing a little bit as we kind of go through what could be the -- maybe at the beginning of a recession this year. But we don't --we're in the camp with many others that the recession will not be deep, will not be particularly distracting to us and there'll be another side to it. And we have no doubt that we will find a good opportunity to use it for our shareholders in the coming year or two, and we'll be patient about it. So -- if it's a little slower growth this year, a little faster growth next year or that may be the case. But at this point, we are building up our capital levels because I'm confident we will find a good use for it. My last one, just odd ball question, but there's been some undulations in unrealized gains in investments, there's a $100 million equity portfolio. I don't think in the equity portfolio, you're likely to see much movement, positive or negative absent a giant move in interest rates. So the $100 million you're referring to is preferred instruments that carry a good yield, but they're -- it's mostly banks. And so as rates were to continue to go up a lot, maybe you would have a little bit, but I don't think there's much risk of that in either direction. Thank you very much. Thank you very much. Our fourth quarter results were consistent with our strong performance throughout 2022, and they leave us well-positioned for what may be an economically challenging year in 2023.As always, we appreciate your time and interest in OceanFirst, and we look forward to speaking with you after our first quarter results are published in April. Thank you very much."
}