{
    "symbol": "MAXR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 01:06:08",
    "content": " On a trailing 12-month basis, the Earth Intelligence business is running at roughly 1x, and we announced that we received 27 awards during the quarter across 9 U.S. government customers, 8 of which are Department of Defense or intelligence community organizations for up to $202 million of work on artificial intelligence and machine learning applications, advanced data analytics, software development, data conditioning, geospatial production and dissemination, maritime domain awareness and training and development. Although within our guidance from a year-over-year standpoint, expenses increased in the quarter compared to last year as a result of investments we're making to satisfy the Space Infrastructure business, diversifying the Space Infrastructure business and advance our product development on the Earth Intelligence side, including R&D, systems and product capabilities. I think, if I got your question right, as we look at the future weeks, obviously, making investments today on WorldView Legion that Dan points out, we're also making investments in product, investments in the Space Infrastructure business as well. And on the Defense and Intel side, we always said that was a longer-term cycle of opportunities, but we're seeing really good traction and sometimes that will be as a sub-toe to one of the large majors, sometimes it will be priming those, but on a continual trend of winning types of study awards and providing technologies and I think efficient price points for the customers on a commercial basis that they're excited about. So yes, we do think it's important to look at it on a 12-month basis because, among other things, -- there's the big  award that comes in the third quarter of the year, and then it burns off in the other quarters on Earth Intelligence. And but keeping in mind that an earth intelligence, once again, there's the bleed-off of the third quarter, big award on the EPFO contract and also a fair amount of the business is now book-to-bill, and our space infrastructure of the business is just lumpy in terms of awards coming in, and so one quarter really doesn't add that much meaning. Look, if budgets go up in a lot of countries are now committing to at least the 2% number, both in NATO as well as Southeast Asia and some other locations like that, we see that as a very strong positive trend for the defense and intelligence work that we've historically done a very good job of capturing across the world with U.S. allies and relationships across\n And your next question comes from the line of Austin Moeller of Canaccord Genuity."
}