{
    "symbol": "USB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 10:38:02",
    "content": " End-of-period assets for the company totaled $675 billion, reflecting the acquisition of Union Bank and certain balance sheet optimization actions. Notable items related to Union Bank acquisition are comprised of three primary elements that reduced earnings per share by $0.63 related to balance sheet optimization, merger and integration costs, and the impacts of -- on provision expense related to acquired loans and actions taken to optimize the balance sheet. During the fourth quarter, the company recognized a one-time $399 million pre-tax loss on a net basis related to several actions taken to optimize the balance sheet, manage the interest rate volatility impact on capital levels and position the company for future growth. Union Bank, which was included in our consolidated results for one month, contributed $302 million of revenue, $221 million of non-interest expenses, $81 million of operating income and $44 million of net income to the company, representing $0.03 per diluted share. On slide 9, end of period loans increased 13.3% on a linked-quarter basis to $388 billion, which included core loan growth and acquired loans from Union Bank. Union Bank contributed ending loan balances of $54 billion net of purchase accounting adjustments, partly offset by a reduction in balances of $15 billion related to balance sheet optimization actions, including loan sales and securitizations. End-of-period deposits increased 11.4% on a linked-quarter basis to $525 billion driven by the acquisition, which contributed $86 billion of lower-cost deposits, and actions taken as a result of the deal to optimize our funding sources. Adjusted net revenue totaled $6.8 billion in the fourth quarter, which included revenue contribution of $302 million from Union Bank, primarily representing net interest income. For legacy US Bancorp, net interest income grew 5.5% on a linked-quarter basis and 29.2% year-over-year driven by strong earning asset growth and net interest margin expansion, which benefited from rising interest rates. After adjusting for acquisition impacts and the balance sheet optimization activities, net charge-offs totaled $210 million or 0.23% of average loans, up from 0.19% in the third quarter, which reflected the continuing normalization of credit losses. The allowance for credit losses as of December 31st totaled $7.4 billion or 1.91% of period-end loans, which reflects increased economic uncertainty and the incorporation of the Union Bank portfolio. Acquisition impacts of 180 basis points included an increase in goodwill and other intangible assets that reflected the impact of credit and interest rate marks, the initial provision for credit losses, balance sheet optimization actions, as well as the increase in risk-weighted assets with the addition of Union Bank. Total non-interest expense as adjusted is expected to be in the range of $4.3 billion to $4.4 billion, inclusive of approximately $125 million of core deposit intangible amortization related to Union Bank. For 2023, average earning assets are expected to be in the range of $610 billion to $620 billion with net interest margin expansion of between five to 10 basis points compared with the fourth quarter of 2022. Total non-interest expense as adjusted for the year is expected to be in the range of $17 billion to $17.5 billion, inclusive of approximately $500 million of core deposit intangible amortization related to Union Bank. Just maybe kind of coming back to the net interest margin, we expect see lift related to Union Bank coming on, that five to 10 basis points and then from there, kind of flattish to maybe moderate increase or expansion in net interest margin through the rest of the year. If I pull out the $189 million from the optimization, it looks like the net charge-off ratio is around 43 basis points, including the Union Bank numbers."
}