{
    "symbol": "DXR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-26 19:06:05",
    "content": " I'm pleased to announce that in the last six months, we've made important breakthroughs building on our focus in each of these key areas, balancing our growth and commercialization with strategic investment, fueling our next generation systems, which are the most important technology launch for the company in 20 years. Blood volume derangement is a central feature, and something that has to be managed in such very costly areas, such as heart failure, which affects more than 6 million patients in the U.S. alone, for which the U.S. spends more than $30 billion a year managing areas such as hypertension, sepsis, critical care and syncope just to name a few areas. We've seen a strong growth in sales, revenue and new customer acquisition, while our research and development efforts have been accelerating the development of our next generation blood volume analyzer systems. Revenue growth was driven by a combination of the sales and leasing of our capital equipment to hospitals, orders for our single use disposable blood volume diagnostic kit, used in areas such as heart failure, critical care and other indications, along with a 9.2% increase, there was well received by the market. The company feels that there is still substantial growth opportunities at existing accounts, as there is room for growth from winning a higher percentage of patients within existing departments as well as expanding to other departments within hospitals where blood volume analysis devices are present. MedAxiom sees the Quadruple Aim as a key focus, and that Daxor's blood volume technology fits every single part of the Quadruple aim, improving outcomes, lowering costs, improving the clinical experience, and the patient experience as well. There was a net realized loss of $1,535,071 from the operating division relating to investments in research and development, sales and overhead, as the company continues to invest judiciously in research and development, for our 2022-2023 product launch, ramping the commercial sales teams, as well as production facilities for our next generation blood volume analyzers. So we anticipate that there will be substantial demand for our faster, easier, simpler version of our test from many different stakeholders within the hospital system, everybody from the current lab customers, who will be able to recapture a substantial amount of their space in order to justify the new system, as well as our ability to see improvements from utilization in the fields of critical care."
}