{
    "symbol": "DXR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 15:04:06",
    "content": " There's a net realized loss of $3,264,419 from the operating division relating to investments in research and development sales overhead as the company continues to invest judiciously in research and development for our 2022 2023 product launch, ramping commercial sales teams as well as production facilities for our next generation of blood volume analyzers. One of the reasons why that's quite important is because unlike, let's say, a company that produces another version of a commonly used diagnostic that has some kind of marginal competitive advantage, often companies like that seek to take market share from an existing company, and then of course face the challenges of other competitors undercutting their innovation and doing the same. So this is all part of Daxor's strategy of raising clinical awareness, seeking guideline recognition for our technology, and raising the felt need amongst the administrators of leading hospital systems to take advantage of Daxorâ\u0080\u0099s technology to both improve clinical outcomes, but also quite importantly to save costs. Right now, within our hospital systems and accountable care organization's costs or paramount challenge, any kind of technology that could reduce the length of stay in our case as measured by this study by 55% or full two and a half days, represents a very substantial cost saving and opportunity for healthcare systems and becomes a key driver for those healthcare systems to adopt our technology. That's one of the reasons why we're particularly excited about our next-generation analyzers because our next-generation analyzers promises to be several times faster than the current technology capable of being administered potentially by users beyond lab technicians, for example, nurses and doctors because it's a clear waiver status that we're seeking. And that's actually a very important trial, because I want investors to be aware that it's not only the area of heart failure, but it's also in the areas of critical care that Daxor has found uptake for our diagnostic and substantial need. And that's true whether it's in heart failure for both inpatient and outpatient care, where I would like to add that the company has excellent reimbursement from both public and private insurance or in hospitalized patients, whether they're in the ICU or in the heart failure award. We think that there's a lot of headway that we can make just without even opening further accounts, but going to hospitals where they're not necessarily at capacity in terms of their utilization and driving further adoption of the technology within different departments within the hospital."
}