{
    "symbol": "PROV",
    "quarter": 1,
    "year": 2022,
    "date": "2021-10-27 14:17:15",
    "content": " 03:18 During the most recent quarter, we also experienced fifty three point nine million dollars of loan principal payments and payoffs, which is down from seventy nine point nine million dollars in the June twenty twenty one quarter and still tempering the growth of loans held for investment. 04:23 For the three months ended September thirty, twenty twenty one, loans held for investment increased by approximately one percent, compared to the June thirty, twenty twenty one with increases in the single family and multifamily loan categories, partly offset by declines in the commercial real estate and construction loan categories. 05:34 As of September thirty, twenty twenty one, there was one single family loan in forbearance with an outstanding balance of approximately three hundred eight thousand dollars or zero point zero four percent of gross loans held from investment. 06:36 Our net interest margin expanded by seventeen basis points for the quarter ended September thirty, twenty twenty one compared to the June twenty twenty one sequential quarter, as a result of a fourteen basis point increase in the average yield on total interest-bearing assets, and a five basis point decrease in the cost of total interest-bearing liabilities. 07:14 Notably, our average cost of deposits decreased by two basis points to thirteen basis points for the quarter ended September thirty, twenty twenty one compared to the prior sequential quarter. Additionally, our borrowing costs decreased by approximately three basis points in the September twenty twenty one quarter compared to the June twenty twenty one quarter primarily due to a twenty one thousand dollars prepayment fee in June that was not replicated in the September twenty twenty one quarter, in addition to the schedule maturities in the September quarter of higher cost borrowings. 07:52 The two point seven one percent net interest margin this quarter was also positively impacted by approximately five basis points, as a result of decrease in amortization and net deferred loan cost associated with the loan payoff in the September quarter in comparison to the average net deferred loan cost amortization of the previous five quarters. Also the net interest margin approved as a result of the one hundred and thirty nine thousand dollars recovery of loan interest income on two partially charged off loans that paid in full in the September twenty twenty one quarter, impacting the net interest margin by approximately five basis points. We will note that we reported a one point two million dollars of credit for the employee retention tax credit in the September twenty twenty one quarter, consistent with the Consolidated Appropriations Act of 2021 and the American Rescue Act of 2021, where eligible employers can claim a maximum credit equal to seventy percent of ten thousand dollars of qualified wages paid to an employee per calendar quarter. So, there's about five basis points as well that could potentially be meaningful with respect to a negative implication in the December quarter relative to the two seventy one margin, so there's ten basis points on that two seventy one that is potentially at risk with respect to the December quarter, so it wouldn't surprise me if we dropped a bit in the margin in the December quarter depending upon the outcome of those two areas."
}