{
    "symbol": "SMLR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-21 19:27:07",
    "content": "  Operator: Good afternoon, and welcome to the Semler Scientific 2022 Fourth Quarter and Full Year Financial Results Conference Call. Before we begin, Semler Scientific needs to remind you that certain comments made during this call may constitute forward-looking statements, are made pursuant to and within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 as amended. Good afternoon, everyone, and thank you for joining us for our fourth quarter 2022 and our full year results call. Wayne has served as a member of the Board since May of 2014, has a broad health care experience and confident that he will lead and be able to lead the company into the next phase of growth and continue to make a difference every day for our customers and the patients we serve. Our products will increase access, promote health equity and enable earlier diagnosis of progressive diseases that affect millions of people globally. Semler will be presenting and hosting one-on-one meetings at the Needham Virtual Healthcare Conference on April 18, 2023. On this call, we will summarize the fourth quarter and fiscal year-end 2022 financial results, discuss the factors at play in our market, talk about the 2024 CMS advance notice, outline Q1 2023 guidance, provide details about the QuantaFlo product extension and speak about other investment activities at Semler. We reported record high annual revenue in 2022, but our revenue growth slowed for the year compared to 2021. For the fourth quarter ended December 31, 2022, revenue was $13.8 million, which represents an increase 20% compared to the corresponding quarter in 2021. For the full year ended December 31, 2022, revenue was $56.7 million, an increase of 7% compared to the full year of 2021. In Q4, fixed fee revenues were $9 million, an increase of 14% period-over-period. For the full year, fixed fee revenues were $34 million, an increase of 11% year-over-year. We saw increased interest in our products from hospitals, retail locations and delegated medical groups, which we believe is due, at least in part, to gaining traction from the two major studies published in 2022. In Q4, variable fee revenues were $4.5 million, an increase of 30% period-over-period. For the full year, variable fee revenues were $21.3 million, a decrease of 1% year-over-year. In Q4, equipment and other revenues were $300,000, which was an increase of 96% period-over-period. For the full year, equipment and other revenues were $1.4 million, which was an increase of 42% year-over-year. Because the majority of equipment sales are to variable fee customers, we believe it is a harbinger of strength in the fee per test market. In the fourth quarter of 2022, our two largest customers, including their related affiliates, comprised 43.3% and 25.8% of quarterly revenues. For the full year 2022, our two largest customers comprised 40.4% and 29% of annual revenues. In Q4, operating expenses, which includes cost of revenue, were $10.2 million, an increase of 4% period-over-period. For the full year, operating expenses were $39.5 million, an increase of 18% year-over-year. Operating expenses increased for the full year primarily due to increased headcount in line with our business expansion plans, wage inflation and increased insurance and professional fees. In Q4, pretax net income was $4 million, an increase of $2.3 million or 132% period-over-period. For the full year, pretax net income was $17.7 million, a decrease of $1.8 million or 9% year-over-year. In Q4, net income represents $3.2 million or $0.48 per basic share and $0.41 per fully diluted share, an increase of 113% period-over-period. For the full year, net income was $14.3 million or $2.13 per basic share and $1.79 per diluted share, a decrease of 17% year-over-year. During the fiscal year 2022, we repurchased $5 million worth of shares or 149,000 shares. We had cash, cash equivalents and short-term investments at December 31, 2022, of $43.1 million, approximately $30.5 million of which is held in short-term U.S. treasury bills at December 31, 2022. As you know, last year, two large independently conducted peer-reviewed studies by QuantaFlo customers were published that underscore strongly the clinical benefit of identifying asymptomatic PAD patients in order to put preventative measures in place. The study followed over 13,000 asymptomatic Medicare Advantage beneficiaries aged 65 and older for three years approximately 32% of these patients had PAD. In positive PAD patients versus negative patients, that was independently associated increased risk of 60% to 70% for all-cause mortality and/or morbidity at one year and independently associated increased risk of 40% to 50% for all-cause mortality and/or morbidity at three years. The HouseCall studies, which was published in AJPM focus and Open Access Journal jointly launched by the American College of Preventative Medicine and the Association for Prevention Teaching and Research is another significant study, this one conducted by Optum's in-house HouseCall's program -- in the home HouseCall's program. It confirmed and expanded on the many findings in the Nevada Paper that identification of QuantaFlo positive versus negative status carries increased risk of mortality and major adverse cardiovascular events as well as verified our severity scale in the worse PAD as measured by QuantaFlo conferred a more dire prognosis, which might be a valid reason to retest patients more frequently. Importantly, these studies showed there was a markedly increased risk of mortality and morbidity rights in PAD-positive patients, which would make them more costly to care for if they are not identified early when preventative measures can be put in place. Further, the American Heart Association and American College of Cardiology guidelines clearly recommend routine screening for PAD in patients age 65 and over as well as those age 50 to 64 with risk factors such as smoking and diabetes. We saw not only increased interest in our products from large insurance and home risk assessment companies, but also hospitals, retail locations and delegated medical groups, which we believe is due at least in part to gaining traction from these two major studies. These include further establish our QuantaFlo for PAD product as a standard of care in the industry, given the proven clinical benefits of early diagnosis and preventative treatment. So there is room for continued growth, to make new additions to our customer base, including diversifying our customer base further to hospitals, including the VA, value-based care providers and retailers, expand orders from existing customers, introduce QuantaFlo as an aid to assess heart dysfunction or HD to our customers. Now I will turn it back over to Renae to discuss developments at CMS, our Q1 2023 guidance, QuantaFlo HD and other business development activities. As many of you are aware, in early February, CMS issued an advance notice with proposed payment updates for Medicare Advantage programs for 2024, which included some potential changes to treatment of vascular disease under the Medicare Advantage risk adjustment model, creating uncertainty whether all identified patients with PAD will continue to qualify for an increased capitated payment. It is premature to speculate about the impact to our customers and ultimately our business as CMS will issue the final 2024 rate announcement no later than April 3, 2023. Regardless of potential changes in reimbursement rates, we believe that QuantaFlo provides important clinical value to our customers in terms of better patient care and potential for future cost savings and identifying positive PAD patients and those with HD. We expect revenue will range from $17.4 million to $17.8 million and pretax net income, which includes interest income of approximately $400,000, to range from $5.6 million to $5.8 million. We are on track to achieve our highest quarterly revenue ever, which we believe is a testament to the clinical value our customers see in using QuantaFlo to aid in the early diagnosis of PAD in their patient population. In light of the CEO transition and the anticipated final CMS rate announcement, we are not issuing guidance for the year ended December 31, 2023, at this time. Health care providers now have a point of care low-cost, accurate means for detecting potential heart dysfunction in their primary care setting before overt signs of symptoms present. For those of you who have been with Semler for a long time, you may recall the prolonged lead times for many of our current customers with the initial adoption of QuantaFlo for PAD. Published studies have shown there are over 1 million hospitalizations per year in the United States from heart failure, and the annual cost of care exceeds $30 billion. A medical assistant performs the test in a primary care setting, similar to how one uses QuantaFlo for PAD. Like PAD, asymptomatic HD patients are not routinely tested in the current standard of care because echo is not a screening test. The sensitivity, specificity and accuracy of QuantaFlo HD all were greater than 88% compared to using echo with strain as a gold standard as the methodology for identifying heart failure. As you know, diabetes is a large market with over 35 million people diagnosed in the United States, growing at 4% to 5% a year. To-date, our diabetes portfolio includes investments and a distribution agreement with Mellitus, whose platform Insulin Insights offers an algorithm that helps primary care physicians titrate insulin for type 2 diabetic patients. Primary care physicians find value with Insulin Insights because by approximately easily adjusting insulin levels in type 2 diabetic patients, patients who have less risk of adverse complications with insulin use. In addition, plans have the potential to save on total cost of care and medication costs, as well as achieving higher  star quality measures as patients have improved HbA1c levels, demonstrating that their diabetes is under good control. In December 2022, we announced a commitment to invest up $5 million in Monarch, a privately held company through the purchase of a senior secured convertible promissory notes. As of December 31, 2022, Monarch had borrowed $3.5 million out of the $5 million committed principal amount of the notes. In closing, I want to reiterate that regardless of policy changes affecting reimbursement and other market forces beyond our control, our fundamental value to our customers is and always has been the clinical value of earlier diagnosis of chronic progressive cardiovascular condition and improved simpler management of diabetes. Despite the changes that will always exist in health care reimbursement, there will still be patients, physicians, facilities and payers. As Wayne mentioned, we'll be presenting and taking one-on-one meetings at the upcoming 22nd Annual Needham Virtual Health Care Conference on April 18, 2023. And we believe that our customers use our products because of the clinical benefits and potential cost savings in addition to any risk adjustment payment they may receive because in general, prevention is very important, as you know. Also, as we have talked about this quarter and also prior quarters, we do have many customers that don't participate in the Medicare Advantage program where we can shift resources to. Obviously, one of the unique and special approaches that Semler has taken to the marketplace is primarily working with Medicare Advantage market participants, and that's worked incredibly well, in my opinion, been a brilliant strategy. So we've remained strong in the Medicare Advantage health plans and directly with the insurers, but also this broadening to the other areas that we've mentioned, hospitals and delegated medical groups and others, retail, for example."
}