{
    "symbol": "JOAN",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-01 23:43:04",
    "content": " Recall that on our last earnings call, we mentioned that we would continue to build inventory units in the second quarter while also taking actions to reduce inventory receipts in the back half of the year. Net sales for our second quarter totaled $463.3 million, a decline of 6.8% compared to last year with total comparable store sales decreasing by 6.2%. After adjusting for these noncomparable expenses, our gross profit of $242 million declined by 9% compared to the same quarter last year and increased by 7% compared to pre-pandemic levels in fiscal 2020. Our gross margin rate on a GAAP basis was 46.4% in Q2, a decrease of 730 basis points from last year and reflecting a 580 basis point impact from increased supply chain costs, of which the biggest contributor was excess import freight. After adjusting for excess import freight costs, our gross margin of 52.2% decreased by 150 basis points from last year. Selling, general and administrative expenses increased by 4.7% compared to the second quarter of last year, driven by increased distribution costs of earlier arriving seasonal merchandise. On a cash basis, we expect to spend $50 million to $60 million less in total ocean freight costs in the back half of fiscal 2023 compared to last year. Based on the cumulative level of cash generated by our improving operating performance, targeted cost savings, a less pressured supply chain outlook and our inventory reduction plan, we intend to substantially delever our balance sheet by year-end relative to Q2 levels with the target range in the low to mid $800 million range for net debt. But the kind of circa $180 million, $200 million debt reduction we're talking about to get to that target, you can basically build it up from the receipts Tom talked about $120 million net year-on-year benefit 50 ocean freight, you've got another 20-ish between CapEx and SG&A and all other. We put in place of the $120-ish million, the import freight costs and we were incurring quite a bit last year and the back half of this year based on current rates. And last year, it was more or less flattish and that flattish was again because of just the massive amount of supply chain costs and cash basis that were paid in the back half of the year as well as the later and elevated receipts. So we feel we've done a very good job of making sure that we have the inventory we need no more for the categories and having it here on time or earlier this year than -- since I remember since then here last year, even though we were in pretty good stock on a relative basis, a lot of our seasonal flow as much as 3 weeks late, one of our core categories."
}