{
    "symbol": "JOAN",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-23 22:35:19",
    "content": " As I mentioned, we faced many challenges in fiscal year 2023, including significant supply chain disruptions, inflationary pressure and tariffs, resulting in increased incremental costs of over $200 million. Despite the headwinds we faced, our full year adjusted gross margin remained at 170 basis points above fiscal 2020, and we delivered adjusted EBITDA for the year of $98.5 million or 4.4% of net sales. In the fourth quarter, net sales totaled $692.8 million, a decline of 5.8% compared to last year, total comparable sales decreasing 5.9%. On a GAAP basis, our gross profit in the fourth quarter was $303.7 million, a decrease of 6.4% from last year and a decrease of 7.5% from pre-pandemic levels in fiscal year 2020. Adjusted for excess ocean freight and related supply chain costs, gross margin declined by 110 basis points from last year to 51%, primarily driven by increased domestic carrier and fuel rates, higher shrink expenses and lower vendor allowances due to our strategic inventory receipt reduction. For the full year fiscal 2023, our net loss was $200.6 million, which includes $95 million of noncash pretax impairment compared to net income of $56.7 million last year. Launched in fiscal year '23, focus, simplify and grow focused on reducing annual cost by approximately $200 million in 3 broad categories across all areas of our business, including approximately $100 million of supply chain costs, approximately $60 million of product costs and another approximately $40 million of SG&A costs. This positive change, combined with ongoing efforts to claw back inflationary increases in our product costs, and identify and implement SG&A reductions will provide a growing cash benefit throughout fiscal year 2024 and due to the timing of inventory sell-through should have a mostly annualized adjusted EBITDA impact in early fiscal year 2025. However, based on the factors we have discussed today, such as the positive momentum we saw in the fourth quarter of fiscal '23 and carry over into early portion of first quarter fiscal '24, the proactive steps we have taken to reduce costs and improve liquidity as well as our continued investment in our strategic initiatives, we are excited for what's ahead, and we believe we are well positioned for fiscal year 2024 and beyond."
}