{
    "symbol": "JOAN",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-12 21:04:02",
    "content": " Our omni-channel efforts yielded an additional bright spot in the quarter with sales representing over 11% penetration of JOANN's sales, plus 40 basis points to last year and over 600 basis points to fiscal year '20. Of note, we anticipate the majority of supply chain savings to come from reductions in ocean freight costs and the majority of these savings will offset the phase out of the ocean freight adjustment, which we have been making over the past five quarters in which we anticipate will be fully eliminated in the first half of fiscal year '24. On a GAAP basis, our gross profit in Q3 was $281 million, a decrease of 11.9% from last year and a decline of 1% from pre-pandemic levels in fiscal 2020. After adjusting for excess import freight costs for both corresponding periods, our gross profit of $299.5 million declined by 9.3% from last year. As we communicated in our previous earnings call, we've continued to experience spillover effects from higher inventory costs incurred during the peak period of last year's supply chain headwinds. Since we are now cycling the impact of extremely high ocean freight costs from the back half of last year, the year-over-year decline in our GAAP gross margin was much more moderate in Q3 and compared to the 730 basis point decline in the prior quarter. After adjusting for excess import freight costs, adjusted gross margin of 53.2% and represents a decrease of 80 basis points from last year, driven by the timing of clearance activity, increased carrier and fuel rates as well as . On a cash basis, we also expect to realize $15 million to $20 million of improvement in the fourth quarter from lower ocean freight expenses based on favorable comparisons to last year and ongoing improvements in the spot market. Yes, I just want to reiterate what Wade said there, particularly at the end that we do expect to see this impact on a cash basis first and more significantly than on an EBITDA basis in fiscal 2024, because with both ocean and those product cost savings, which is a good chunk of that $200 million, that's going to need to roll through the balance sheet."
}