{
    "symbol": "SHW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 13:21:03",
    "content": " Sherwin-Williams had an excellent performance in the third quarter, including high-teens sales growth resulting in the first $6 billion sales quarter in company history; significant, sequential and year-over-year gross margin improvement, record adjusted diluted earnings per share and strong cash flow. So what I would expect in the fourth quarter is, you're going to see your normal seasonal slowdown in architectural demand, which is typical, and you also see a sequential decline in operating margin, but we expect stronger flow through in our fourth quarter, really upwards of over 30%. But to meet the strong demand that we're seeing, specifically within TAG with mid-teen volume growth in our third quarter and high -- low double-digit we expect in our fourth quarter, I think what you're going to see us do is try to manage our architectural inventory by year-end, maybe up another 4 million gallons. And it's -- as we talked about on our second quarter earnings call in July, it's part of our normal earning process that we continue -- and as John talked about, we continue to assess these portfolio of business brands and customer programs and their ability to drive above-average market share growth and the operating margin and cash flow targets we set for them. Greg, I think what you're going to see in our fourth quarter, with the TAG stores that we've invested in and then opening another 40 to 50, and in our fourth quarter along with the reps to support that, we'll continue to grow or control our SG&A pretty tightly. I'd say, some of what you're seeing in our DIY first in our stores -- and Al was right, we've seen more DIY in our own stores, but it's a relatively small percentage of our business. We think we can get down there around 11% to 11.5% by the end of this year, knowing we're going to carry a little bit more inventory into next year or I should say it that way, I should say, we'll be back to a more historical level of inventory than we were a year ago, obviously. We talk about resi repaint, but you also would have to include property management in there, the auto refinish, the packaging, all of these are really better positioned, but we're going to be, I think, in a better position to grow volume as well, more absorption through the plant than we may have to the last cycle as well. The strategy work that we've done to allow us to better focus on the sub-segments and those customers within there that are willing to pay for the solutions that we bring is where we're focused, and we think that's going to benefit us."
}