{
    "symbol": "SHW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 18:05:37",
    "content": " On the top line, the quarter was characterized by strong demand in pro architectural and North American industrial end markets, partially offset by softness in the North American DIY channel, which we first described at our Investor Day on June 8; and tight supply of certain resins, particularly alkyd resins, which impacted our North American nonpaint sales, namely aerosols and stains. Our earnings per share were impacted by multiple factors, including no meaningful improvement in raw material costs, supply chain inefficiencies incurred in serving our customers, the sales shortfall at North American DIY, slowing European and Asian demand, and higher other and interest expense. I'll go through just a few of the numbers at a high level and then turn it over to John, who will talk about the demand and cost trends we are seeing, how we're responding and our revised outlook for the year, including what we expect will be significant earnings per share growth in the second half. Within The Americas Group, we continue to see extremely strong demand across all of our pro-architectural markets, including New Residential despite higher interest rates with customers reporting strong backlogs that will take them through the end of the year and likely longer. If you look at our operating margin in TAG at 21% in the second quarter, yes, it was down year-over-year, but I think the strong volume and the pricing actions that we're taking are going to help us get into a strong improvement in our second half. And even with the macro challenges that we're facing in Europe and Asia that we can expect to continue in our second half, the pricing actions, the market share gains that we're experiencing in packaging and coil, in particular, gives us great confidence that we'll be able to expand our margins in the second half in that business. Even though the volumes are down, our expectation is that business returns to 20% operating margins as we improve our operating efficiencies, as we focus on our continuous improvement initiatives and we drive shareholder value and generate cash flow, and that's going to be part of this portfolio review that we do."
}