{
    "symbol": "SHW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 16:13:03",
    "content": " Your line is live. Your line is live. Your line is live. Your line is live. Your line is live. If you think about what we call the Pros Who Paints, it's someone that might be involved in either house flipping or remodeling and while we're very focused on the painting contractor through our store, there are customers who enjoy the wide breadth of assortment and availability of products that they get through a different format like a home center. Your line is live. Your line is live. Your line is live. Your line is live. I think, Vincent, the thing that -- I would say it this way, the thing that we're watching specifically is within TAG and within new residential -- and the -- it's not an exact science when you look at the timing of a potential slowdown as John talked about, and the macro headlines of single-family starts slowing. So as we continue to work with our national homebuilders and get a clean line of sight of that and the impact that not only has on our new residential and TAG, but also kitchen cabinets, flooring and furniture on our Performance Coatings businesses, that's going to be the main driver of whether the second half is stronger or less strong than what our current outlook is. As John talked about, we do not have 100% market share in any of our businesses, segments or regions and that's the way we're going into 2023. Your line is live. And I think that's what the focus of our TAG team is on with the specific investments in dedicated new res repaint stores and dedicated res repaint reps.\n As part of what gives us the confidence as we compare this to the last slowdown, we came out of the last slowdown determined to grow that residential repaint business to help offset, we call it almost a resilient segment, having the growth that we have had and we continue to invest. Your line is live. So even a slight decrease, increase or movement within that range doesn't impact the overall fact that we're going to maintain the majority of that price as we've done in similar environments in the past, and I think that's similar across the industrial businesses and consumer because we are looking at the total input cost basket that's affecting what price increases we've gone out with and what continued investments we've been able to make as we bring our gross margin back towards that long-term rate of 45% to 48%. And I think when you look at it in an inflationary environment, and we've talked about this in the past, you tend to see more -- and I'll use as res repainters move up to a higher quality product because they're going to pay more for that gallon of paint. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live."
}