{
    "symbol": "SO",
    "quarter": 3,
    "year": 2021,
    "date": "2021-11-04 17:35:02",
    "content": " The change in the Unit 3 schedule into the third quarter of 2022 is primarily a function of the time needed to address the full scope of the remaining remediation work and to account for the impacts on productivity resulting from higher than expected attrition and slower than expected on-boarding of new electricians, field engineers, and supervisors. Considering this decrease in available resources over the next several months, plus recent productivity trends, we now expect Unit 4 in-service during the second quarter of 2023. On Slide 7 of today's earnings call deck, we have included a forecast of the remaining ITAAC submittals required to support a projected May 2022 fuel load and third quarter 2022 projected in service date. Now, considering our recent volume of ITAAC of metals in October, and the expected completion and turnover of significant systems in the months ahead, the site is targeting ITAAC completion earlier than what is indicated in this forecast, which would provide margin to Unit 3's remaining schedule. From a cost perspective, Georgia Power share of the total project capital cost forecast, increased by $264 million, largely driven by our updated schedule, productivity consistent with recent trends, the cost of additional resources to complete the full score for remaining work with necessary focus on quality and the replenishment of contingency. Major drivers for our adjusted earnings results for the third quarter of 2021 included higher retail kilowatt hour sales at our state regulated utilities, as we continue to see recovery from the pandemic, strong customer growth and impacts of several constructive regulatory outcomes, partially offsetting these impacts, non-fuel O&M reflects the trend towards more normal operating conditions relative to 2020 milder than normal summer temperatures in the Southeast also negatively impacted earnings per share by $0.02 compared to our estimate and by $0.07 compared to the third quarter of 2020. This most recent order allows $2.1 billion of investment in Vogtle Unit 3 and the Vogtle Units, 3 and 4 common facilities to be moved from the Nuclear Construction Cost Recovery tariff or NCCR, into retail rate base the month after Unit 3 goes into service, where it will learn Georgia Power 's full allowed rate of return. With these expected changes and the recent retirement announcement of two coal units at Mississippi Power's plant, Daniel, since 2007, Southern Company will have announced total decreases in its coal-generating capacity from more than 20,000 megawatts, across nearly 70 generating unit to less than 4,500 megawatts of coal capacity, remaining at 8 generating units. Importantly, our current 2024 earnings-per-share base of $4 to $4.30 is based upon our current 5-year capital plan with potential incremental investments, providing the opportunity to strengthen our position, both within that 2024 range and within our 5 to 7% long-term growth range. So given the results at the Georgia Public Service Commission earlier this week, that will mean that rates will go into place for $2.1 billion of Unit 3 in the comm facilities, earning Georgia Power's full cost of capital. And so it is that time that we're looking at right now that I would say to you is probably the shared view of Dr. Jacobs in particular and us, as the biggest risk to schedule that remain, right now, our assessment of that work, if we get the 103 g letter early let's say January, then I'm going to guess, and this is just a guess on my part, so don't hold me to it. The total amount of time is, let's just say 3 to 4 months\n And Paul just stated a different way with our September assumption for in-service of third quarter. If in 3 months we turned over 11, 17 to go I just said 3 to 4 months, that's a little inaccurate because all the systems are being worked on and we're getting closer to complete all the systems."
}