{
    "symbol": "CDRE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 07:00:23",
    "content": "  Operator: Good afternoon, everyone, and welcome to the Cadre Holdings Third Quarter Ended September 30, 2022 Conference Call. At this time, I'd like to turn the conference over to Mr. Matt Berkowitz of The IGB Group for introductions and the reading of the safe harbor statement. Thank you, and welcome to Cadre Holdings third quarter 2022 conference call. Before we begin, I would like to remind everyone that during today's call, we will be making several forward-looking statements, and we make these statements under the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Please also note that we have posted presentation materials on our website at www.cadre-holdings.com, which supplement our comments this evening and include a reconciliation of certain non-GAAP financial measures. I would like to remind everyone that this call will be available for replay through November 24, 2022, starting at 8 p.m. Eastern Time tonight. At this time, I would like to turn the call over to Cadre's Chairman and CEO, Warren Kanders. I'm joined today by our President, Brad Williams; and Chief Financial Officer, Blaine Browers. In our first year as a public company, we have made significant progress capitalizing on the attractive long-term tailwinds, driving demand for our mission-critical safety and survivability equipment. We are delivering on our M&A strategy while generating significant free cash flow, standing margins and exceeding our 1% pricing growth target above material inflation. Our operating model has been resilient in a challenging macro environment, and we are pleased to reaffirm 2022 guidance. In addition to acquiring businesses that complement our core, we are pursuing diversification plays consistent with our focus on safety and survivability. As you can see from the presentation, we incurred transaction expenses in the third quarter and expect to incur additional transaction expenses in the fourth quarter, which shows that we are actively engaged in this activity and will continue to be thorough, disciplined and thoughtful about our approach as we evaluate deals. At the same time, as the Fed and other central banks have raised interest rates and switched from quantitative easing to quantitative tightening, the credit markets have tightened, increasing the cost of borrowing for everyone and impacting the ability to get credit at all, in some cases, regardless of the cost. Our net leverage as of the end of the quarter was 1.7 times net debt-to-EBITDA, and we expect to further delever through  the end of the year. Considering the financial markets, our tailwinds and favorable industry macros, we believe we have solid organic drivers for our businesses that create the foundation to continue pursuing accretive acquisitions. You'll see on Slide 4 that on today's call, we'll provide a quarterly update and business overview, including a review of our M&A strategy and cover our financial performance and full year outlook followed by a Q&A session. As Warren mentioned, our execution since going public just about one-year ago has been strong. Importantly, we have advanced strategic objectives while navigating a difficult macro environment characterized by persistent supply chain disruptions and inflationary pressures. We have an exceptional team in place to tackle these challenges, and we are excited about the continued implementation of our operating model, which will enable Cadre to create further value for our customers and all stakeholders. Our Q3 adjusted EBITDA conversion rate of 97% was above the high end of our guidance range and reflects the strength of our low CapEx model, resulting once again in significant cash flow generation. As we anticipated, our product mix was more favorable in the third quarter and adjusted EBITDA margins improved 300 basis points. As of September 30, 2022, our backlog stood at $125.2 million, primarily driven by recent acquisitions as well as strong demand for armor and large federal government orders, offset by a reduction in EOD backlog that we had anticipated. In terms of M&A, we remain well-positioned to capitalize on a robust pipeline, complementing our core organic growth initiatives. Building on our two accretive acquisitions year-to-date, we continue to actively pursue attractive opportunities and remain focused on high-margin companies with leading market positions and strong recurring revenues and cash flows. Later on the call, Blaine will discuss our M&A strategy and pipeline in greater detail. Finally, as evidenced by our strong cash flow generation in the quarter and throughout 2022, we remain poised to both execute acquisitions and consistently return capital to shareholders. In November, we declared our fifth consecutive quarterly dividend of $0.08. Moving to the next two slides, we'll discuss macro tailwinds supporting our long-term sustainable growth, as well as provide an update on current market trends. On Slide 6, we highlight fundamental drivers of demand and visibility for Cadre's mission-critical products, which have remained fairly consistent throughout 2022. With the focus on crime during this midterm election cycle, we continue to see a push to refund police budgets rather than defund. These represent long-term opportunities supporting demand for Cadre's mission-critical products, and we continue to anticipate our total addressable market to grow, particularly internationally. As we have noted in the past, North American police budgets remain healthy as we are seeing signs of increasing spend per officer. We expect that the ongoing conflict will provide incremental opportunities in Europe, primarily in EOD. Turning to our supply chains, we continue to experience disruptions and delays, which have affected the flow and availability of certain fabrics, electronic components and various raw materials. Against this backdrop, our pricing power continues to serve us well, and we have worked closely with our partners to reduce the impact on our product lines. Regarding trends in our consumer segment, we continue to see stable demand but are monitoring the macros. Under Warren's leadership, Cadre has always been a patient investor with a long track record of successfully rate  acquiring, integrating and optimizing high-margin companies with leading market positions and strong recurring revenues and cash flows. As we have outlined in the past, we will continue to remain disciplined and seek compelling opportunities to either expand our product and technology offerings, enter new markets and/or grow our geographic footprint. This year, we have completed two accretive acquisitions that further expanded Cadre's international presence and added multiple growth avenues. Integration of both businesses has progressed as expected, and we anticipate ongoing progress implementing Cadre operating tools. In terms of future M&A, we continue to actively evaluate deals and have a robust funnel of targets consistent with our key criteria. As we discussed last quarter, it's becoming more difficult for businesses to refinance, which could lead to new acquisition opportunities in the market. But based on what we've seen up to this point, we believe there's still a disconnect between sellers pricing expectations and the current market environment. On Slides 11 and 12, we detail our third quarter 2022 results. As you can see, net income, adjusted EBITDA and adjusted EBITDA margin each improved sequentially, illustrating our resilient operating model and the more favorable Q3 mix that Brad mentioned earlier. The increase in the product segment was primarily a result of recent acquisitions and armor volume, partially offset by a large contractual armor order that was held in the prior year in our product segment. Gross profit margin was 39.2% for the third quarter, a significant sequential improvement, consistent with our expectation that second half 2022 margins would be similar to the strong margins we saw in the first half of 2021. Excluding the amortization of inventory step-up on the Cyalume acquisition, Q3 2022 gross profit margin was 40.7%. Net income was $4.9 million for the third quarter compared to a net loss of $5.3 million for the quarter ended September 30, 2021, which included a loss on the extinguishment of debt related to the August 2021 debt refinance. As a result of the more favorable Q3 product mix, third quarter profit increased more than 11% as compared to the second quarter. And I'd like to remind everyone that from a cash generation perspective, we have very low ongoing CapEx needs at approximately 1% of revenue annually, excluding facility expansion or upgrades. Turning to the next slide, we illustrate the anticipated top line and adjusted EBITDA growth for the full year 2022. Based on the midpoint of our guidance range, we expect approximately 5% annual growth for both full year net sales and adjusted EBITDA. Our net debt was $116.8 million, and we believe our net leverage below 2 times provides significant financial flexibility to grow organically and more importantly, inorganically through acquisitions. As we approach the conclusion of the year, we are reaffirming our 2022 outlook based on our strong performance to date and fourth quarter expectations. Of note, like most businesses with exposure overseas, we continue to see FX pressure due to the strength of the U.S. dollar and ongoing challenges with our supply chain. If the rates were to hold, this could be around $1 million headwind for the year for FX versus our guidance. Additionally, we expect adjusted EBITDA conversion to be between 92% and 95% for the full year 2022. Before opening the call to questions, a note that our progress in 2022 and since our IPO in November 2021 has been strong amid persisting macro headwinds, while we continue to be conscious of supply chain and inflationary pressures, we have an exceptional team to navigate this environment and are focused on further implementing our operating model, which we believe will create long-term value for customers and shareholders. As we approach the end of the year and look towards 2023, we will continue to draw on our leading and entrenched market positions across our life-saving product categories to capitalize on additional selling opportunities. Further improving gross and adjusted EBITDA margins over the long term remains a priority, and we will continue to seek to achieve cost structure optimization to drive operating leverage and expect margin expansion over time. Finally, we will continue to see compelling M&A opportunities that expand our product and technology offerings, enter new markets and grow our geographic footprint. We remain extremely optimistic about our long-term prospects underpinned by this robust pipeline and the strong long-term macro tailwinds driving demand and visibility for Cadre's mission-critical products, both domestically and internationally. I want to comment on the product side and the strength you saw there, you noted in the release, stronger armor sales. So from the intelligence we have, what we've seen is pretty consistent with us in terms of supply chain with the couple of competitors in this market space and how they're doing. And we have those wins based on, like we've talked about in the past, really based on our value proposition of our product and really the strong brand that we do have in the position in the marketplace. And then, one, maybe on Europe just thinking about the long-term growth there, you guys have achieved obviously really strong share in the U.S. between holsters and armor. It's not a single market, its multiple markets. And for us, Radar was that first step in that process of localization and getting closer to the customer and having more of an impact where the decisions are being made. So, I think it's possible. It's just a little more difficult to get there and will take us a little more time because in the U.S., it's much easier. They do a lot of sharing between agencies locally and nationally, just information sharing that is, as you get into Europe, they're a little wall-off in that sense and not quite as much information sharing or even following kind of what some other departments do. With our superior products and position with the Radar brand on board now, we think that's certainly the goal long term, but it's certain we didn't get here today in the U.S. overnight, and I don't think it will happen in Europe overnight either. And then we have, as you know, limited kind of view on backlog, and that's what drives a lot of that between both portfolio mix or different kind of product mix, but also mix within the products itself. Very happy with the execution the teams have done around price and productivity in Q3, seeing no signs of that slowing. So it's really more about that mix as we talk to and in particular, EOD looks. So Brad, last quarter you noted you were doing some more research to better understand where police hiring stands these days. So with headcount being down, it gives them the ability to continue to upgrade and potential cases and continue to focus that funding on a less smaller group of officers. So for 2023, we're currently in the process internally of evaluating what things look like. And the one piece we always have to come back to is if you think about kind of armor for instance, or there's a core, what we call kind of run rate portion of the business that's very repeatable. So I think on the core products, duty-gear armor, as Brad kind of mentioned, Warren talked about, we have those tailwinds and then we'll have to go through the EOD side of the world to see what the cycle looks like in the backlog and what one looks like. So we successfully delivered Phase II for SOCOM and not only successfully delivered it, but there's trials that were also completed with what we would consider good findings from the trials. So that's really what's on deck, what we've done and what's up next. Elizabeth, we talked about really being about $1 million of headwind for the year versus guidance. 2023, we expect armor to be good where you have to have some tailwinds behind us as we kind of entered the year. But as Brad mentioned, that wouldn't be filling up that complete gap. And then EODs the side of the world, but we take a little more time with because it is programmatic, and we want to really have kind of nailed down. In terms of supply chain, you called out some weakness and shortages around electronics or raw materials and fabrics. So based on what we're seeing this year in 2022 versus 2023 from a supply chain perspective, we think it's going to be some of the same, which has been fairly inconsistent within the supply chain. We've worked on increasing those safety stocks either within our four walls in our facilities or within the facilities of those suppliers, which has been helpful, too. So we feel like next year will be similar as we go forward, but the teams have done a great job managing through it. And the one area to your working capital question, we did take a strategic view on inventory, in particular, on ballistics, and you really saw the impact in the cash flows here in Q3. The cash use of about $7.2 million, about half of that is related to that holistic reserve, another half is really just timing in the quarter. So at this point, we do not expect it to be a significant drag on working capital or cash flow next year, but it's something we'll continue to evaluate. For example, some of the ballistic materials that we have within the supply chain, we do group calls on that with those suppliers it stems from. Typically, the most common one has been within their supply chain, whether it's within their facilities or one step back in the supply chain of labor availability has been one of the biggest issues, which is, as many of us know, fairly common across the globe in terms of labor type issues. And then if I could ask one more, the police sirens in the background, being in transport in New York City are not intentional, but you guys have talked about the police department sort of looking to fill positions and maybe struggling a bit. Again, I wish we had some specific data to be able to continue to look at and see if things are improving or going up and down, but we get our information through our company-owned distributors that we owned up the East Coast and then also our third-party distributors that have feet on the street and then also our own sales force. And they continue, things have not gotten worse, it seems, continue to recruit, and they have folks going into recruit classes. So we've been making a lot of great progress there in terms of that implementation with monthly business reviews, daily management, the budgeting process, pricing power tools as we've worked with them. Behind the scenes, we do have a separate team on the selling side of things with the Safariland selling team, working with the Cyalume selling team on coming up with the next steps in terms of how we approach the marketplace and various opportunities, both within their core products and then a couple of other product areas that we feel like there could be some growth within. We're currently engaged with a couple of countries around funding for demining and EOD applications, which is really where we think the opportunity for Cadre is in Ukraine. Right now, when you look at the funding, the U.S. military recently put out for Ukraine, it's been heavily towards offensive weapons. In fact, I think I saw a Wall Street Journal article pop up around U.S. military buying or artillery rounds from South Korea and shipping them over. So we think the tempo of the conflict is still a little bit too high for them to get very serious, but we do expect that to pick up in 2023, and the teams are being very proactive in working with both Ukrainian context as well as local government contacts as well. On the police side, as we looked at kind of the day over the years, the funding has been stable during the recessionary times for police. When it comes to government funding, again, we're generally a non-discretionary products. But from a municipality perspective and the data supports it, the spending is not significantly trended down during those 2008, 2009 financial crisis or even during the other industrial session in the early teens. And then similarly, you guys talked about capital markets being tough and potentially opening up some M&A opportunities. I would say in the last 30 to 60 days, we've certainly added more targets into the funnel, which has been positive. As I mentioned in my comments, and I think Warren alluded to it, it's just the timing, right. It's expensive and waiting for the sellers to adjust to that, which it may take some time to get their expectations along with the current market conditions. But we remain bullish just on the level activity, a number of targets out there, and I believe as these rates come into effect and other companies are looking at refis that will really open the door for increased activity. You said, I think, about $1 million headwind against the guidance. As we look through it, is it pretty much $1.8 million or some of that other expense not quite as tied to FX? Year-to-date versus our guidance, it's about $700,000 of $1 million, a little bit more to go into Q4. A lot of mine have been asked and answered, but I just wanted to clarify and make sure I understand the fourth quarter implied sort of guidance here. As we've kind of looked historically at their quarters, it's been fairly level loaded. We definitely have talked about a majority of Radar's revenue comes in really that September through December time frame, which we've seen looks to be happening this year. Again, a good visibility on backlog in orders and really just managing the supply chain portion of it, but again, Radar's not a large business. If you go back to kind of what we paid for it, it's not going to significantly move that needle on the overall revenue. And then could you just put a finer point on what's baked into the EBITDA margin improvement in the fourth quarter, if I look at it year-over-year, pretty healthy improvement assumed. And it sounded like, if I'm hearing you correctly, it's just a richer mix of product revenue. We talked a little bit about this coming into the year is the commercial markets, consumer markets were quite unpredictable in the back half of last year and unpredictable being a very strong first half and a softer second half. We've since seen that normalize and it's been steady through the year so far, which is great, but that is certainly one of the bigger drivers. And then the EOD volume as well is another large component, and that's more of a sequential comment, but due to year volume and then that channel mix on the consumer side is certainly a big lift for us. And with no other questions at this time, I would like to turn things back to you all for closing remarks."
}