{
    "symbol": "CUE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-21 23:00:23",
    "content": " CUE-101's clinical data continues to support the clinical validation and the corresponding reduction of risk for the entire IL-2-based CUE-100 series and importantly, appears to provide us with defined options for potential registration paths. As shown on Slide 5, data from the ongoing clinical trials with CUE-101 as monotherapy and in combination with pembrolizumab have provided clinical proof-of-concept in derisking of our Immuno-STAT platform. As previously and consistently stated, we believe CUE-101's mechanism of action, as evidenced by the ongoing data generated to date, provides effective and tolerated dose levels, enabling selective expansion of targeted tumor-specific T cells directly in the patient's body. The data we have observed throughout the monotherapy trial bolsters our position and enhances our confidence that CUE-101 is in fact stimulating the targeted cancer-specific T cells within a subset of these patients, resulting in demonstrable antitumor effect. Regarding the intended PD effect, i.e., activation of targeted tumor-specific T cells, we have observed, as shown in the middle panel, robust expansion of tumor-specific E7 reactive T cells in their peripheral blood of patients as early as one week after administration of CUE-101, paired and post-treatment biopsies demonstrate an increase in tumor infiltrating T cells and associated tumor necrosis. Four of the first 10 evaluable patients treated at the recommended Phase II combination dose of CUE-101 at 4 milligrams per kilogram plus pembrolizumab have experienced partial responses, i.e., at least two consecutive scans demonstrating a cumulative reduction of tumor burden of minus 30% or greater. As previously announced, the robust data on CUE-101's activity in monotherapy and in combination with pembrolizumab enabled the granting of Fast Track designation for the treatment of patients in both the first and third line setting. The evolving and maturing data from these programs is so extremely gratifying for me to see early on as an adviser to Cue, I recommend the potential promise of the platform for engineering biologics that could target cancer-specific T cells and could potentially deliver clinically meaningful levels of IL-2 to patients without the well-known toxicities associated with IL-2 that we all are aware of, such as vascular leak syndrome and cytokine release syndrome observed with Aldesleukin. Research and development expenses for the year were $38.6 million and $41.3 million for December 31, 2022 and 2021, respectively, and the decrease was due to a decrease in costs related to clinical trial activity for the CUE-101 monotherapy and combination clinical trials and lower manufacturing costs related to the CUE-101 and CUE-102 clinical material. With CUE-101 exemplary of the IL-2-based CUE-100 series, demonstrating clear evidence of single-agent clinical activity and what appears to be at least a doubling of overall response in combination with KEYTRUDA and frontline patients. Importantly, CUE-101 has demonstrated clinical activity in combination with KEYTRUDA in patients having a low CPS score, that is in patients whose tumors appear to be immunologically inactive or less active, where a checkpoint inhibitor is thought to be less likely to provide benefit. I would just reemphasize that it's really the strength of the data as it's evolving and maturing that really provides options from a regulatory registrational point of view, for development, both as a monotherapy in laddered lines is really late line patients, so patients that have progressed on prior chemo and checkpoint inhibitor that's really an area that represents an unmet need where there's really no standard of care. With regards to the combination, you'd ask about the data sets really by the end of the year, we should have rather mature data on the response rates for the 20 patients to be enrolled in Part D. And really, the efficacy that we're observing to date, if that's maintained and strengthened positions that to enable a trial really that could have a proximal endpoint of PFS or objective response rate in the context of a confirmatory enrolled patient trial that could potentially support an earlier approval."
}