{
    "symbol": "FMC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 14:06:06",
    "content": " We continue to expect a strong second half of the year, driven again by price increases and volume growth in a supportive market environment. Overall, adjusted EBITDA was $360 million, an increase of 3% compared to the prior year period, and $10 million above the midpoint of our guidance range. For the first half, performance was very strong as a result of price increases and volume growth, which contributed $178 million and $132 million to EBITDA, respectively. These drivers more than offset significant cost and FX headwinds of almost $250 million, resulting in 9% EBITDA growth over the prior year period. After a strong first half of the year, we are raising full year 2022 revenue to a range of $5.5 billion to $5.7 billion, representing an increase of 11% at the midpoint versus 2021. The range for 2022 adjusted earnings per share is narrowed as well, and is now expected to be in the $7.00 to $7.70 per diluted share, representing an increase of 6% year-over-year at the midpoint. Q3 EBITDA and EPS growth are expected to be limited by the highest cost increases of the year, despite the targeted mid to high single digit price increases. Interest expense for the second quarter was $35.3 million, up $2.7 million versus the prior year period, primarily due to higher short-term interest rates and higher debt balances, partially offset by benefits of the refinancing activity completed in fourth quarter 2021. When you look at the size of our company and you look at the market given where it is today, we have roughly 9% market share of the crop protection chemical market, with the most robust pipeline and new product introductions that are now, this year alone, the products that have launched over the last five years is $600 million of business that we will do with those new products. And what we're seeing from Q4, Q4 is the largest cost -- excuse me, Q3 of '22 this quarter, coming quarter, is the largest cost increase we've seen and the largest cost increases we expect for the year. I would say the only structural cost that's been embedded is as we're investing in SG&A resources and R&D projects that are more longer term, those are driven around the growth of the company, the market access that I talked about in places like Brazil, Argentina, India, parts of the ASEAN region, and the U.S. as well."
}