{
    "symbol": "FMC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 11:06:06",
    "content": " Overall, adjusted EBITDA for the third quarter was $261 million, a decrease of 11% compared to the prior year period, but $6 million above the high end of our guidance range, primarily due to somewhat lower cost inflation than we previously anticipated. With continued strength in market demand and the success of pricing actions to help offset cost increases and FX headwinds, we are raising full year 2022 revenue to a range of $5.6 billion to $5.8 billion, representing an increase of 13% at the midpoint versus 2021. We are narrowing the full year adjusted EBITDA range to $1.37 billion to $1.43 billion, representing 7% year-over-year growth at the midpoint and reflecting the confidence in our order book and supply availability. The range for 2022 adjusted earnings per share is narrowed as well and is now expected to be $7.10 to $7.60 per diluted share, representing an increase of 7% year-over-year at the midpoint. Full year price increases of mid- to high single digit and strong volume growth are expected to more than offset cost and FX headwinds, keeping the midpoint of our guidance unchanged at $1.4 billion. Your line is now open. And we are seeing costs still higher than they were, but the rate of increase is slowing down, and that's very important because what that tells us is that as we enter the first half of next year, the materials that we will be buying and the cost of flow through the P&L in the second half of the year will be lower. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Then I think you said well, but you're on pace for 8% or nothing you say wouldn't take out of the range, that normal 7% to 9% growth rate off of this year, that would imply $1.5 billion EBITDA next year. In terms of the working capital impacts on cash flow, look, we're dealing with massive cost inflation and large price increases at the midpoint, $650 million in sales growth this year. Your line is now open. But what we do feel very confident about is that relationship between top line growth at a multiple of the overall market driven by a balance of volume and pricing, with leverage to the bottom line, particularly in the second half next year as we get to a reversal of the cost direction that we've had for past multiple years, that, I think, is something we can feel very confident about going into 2023, even in the absence of a full budget. Your line is now open. You have to think about maintaining that, if we continue to have effective full year price increase next year and the second half where costs are declining, you get that -- you're starting to get real margin recovery. Your line is now open. Your line is now open."
}