{
    "symbol": "FMC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 13:09:11",
    "content": " FMC’s full year revenue is forecasted to be in the range of $5.25 billion to $5.55 billion, representing an increase of 7% at the midpoint versus 2021 driven by volume and price growth in all regions, partially offset by currency headwinds. Think about the comments I made about--you know, we’re going to have $600 million of revenue this year from products introduced in the last five years. I talked about the $600 million of revenue from the products in the last five years, but I think it’s the growth rate of that that’s occurring. It was $400 million last year, it’s $600 million this year - that means we got $200 million of brand-new growth, so that’s what we should be focused on and that is coming from not only the big products that we launch, whether it’s a fluindapyr fungicide or an Isoflex herbicide, those are the bigger products that are in the multi-hundred million dollars range when they reach their peak size. Michael, please go ahead. We’re obviously not going to cover the gap that we’ve had over the last couple of years, so we will likely end up somewhere at the low end of that range at the end of the five-year plan - commendable results, to say the least, given everything that we’ve had, and frankly this year’s cost and FX is higher than we’ve seen at any point of the last five year in terms of this plan, so we’re swimming against a very strong tide and right at the edge of our range. We would expect to come out with a new long range plan towards the end of 2023, where we’ll be public with where the company is going over what time frame, but for now we’re just sticking with where we are and obviously that 7% to 9% EBITDA range is what we’d be aiming for for next year. It does seem like there was a good amount of pre-buying in a lot of different regions ahead of maybe an expectation of additional price increases, concerns around supply chain, and just if you could just take a tour around the world about where you think channel inventories sit as you’re going into certainly the northern hemisphere growing season and Brazil, where you’re more off-season, just how you think activity levels and restocking sits there. Michael, please go ahead."
}