{
    "symbol": "FMC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 12:34:03",
    "content": " Overall, adjusted EBITDA for the fourth quarter was $432 million, an increase of 17% compared to the prior year period, resulting in EBITDA margin expansion in excess of 40 basis points. More than $600 million in sales came from products launched in the last 5 years, growth of 50% over the previous year and about $100 million came from products launched in 2022, continuing the multiyear trend of strong growth from new technologies. Adjusted EBITDA was $1.407 billion, an increase of 7% compared to 2021, despite $463 million in cost headwinds and $74 million in FX headwinds. We expect adjusted earnings of $7.20 to $8 per diluted share, representing a 3% increase at the midpoint, with EPS growth limited by higher interest and tax rates. Adjusted EBITDA is forecasted to be in the range of $345 million to $365 million, flat versus the prior year period at the midpoint, mainly due to pricing gains being offset by expected cost headwinds. Looking ahead to 2023, we expect full year interest expense to be in the range of $200 million to $210 million, an increase of more than $50 million at the midpoint versus 2022, driven primarily by higher U.S. interest rates. FMC generated free cash flow of $514 million in 2022, down 28% versus the prior year. Overall, free cash flow conversion from adjusted earnings for 2022 was 55%, with rolling 3-year average free cash flow conversion at 67%, slightly below our long-term goal for 3-year average cash conversion of 70% or more due to the inflationary impacts on working capital. With this free cash flow and a modest increase in net debt year-on-year, we deployed $566 million in 2022 with nearly $370 million returned to shareholders through $267 million in dividends and $100 million of share repurchases. Underlying this forecast is our expectation of adjusted cash from operations of $800 million to $920 million, up $200 million at the midpoint, with the increase driven by growth in EBITDA and slower growth in working capital resulting from lower sales growth and easing input cost inflation. As you can see on the left-hand side of this page, we've improved 3-year rolling average free cash flow conversion from adjusted earnings from 42% in 2020 to 67% at the midpoint of 2023 guidance. Strongly rewarding shareholders with nearly $2 billion in cash returned over 2019 to 2022, split equally between share repurchases and dividends, while fully funding our organic growth, as well as directing $268 million to inorganic growth investments like our recent acquisition of BioPhero. Robust volumes driven by our market access initiatives and the continued accelerated growth of new products as well as strong pricing gains helped to overcome significant cost, supply and FX challenges in the year. I think what we're looking at is solid revenue growth and flat EBITDA, entirely due to cost headwinds in the first quarter, we're will be close to offsetting them with price increases in the first quarter, but we don't really get to that positive price cost comparison and for any strong way until we get into the following quarter."
}