{
    "symbol": "IGT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 13:09:22",
    "content": " Our business segments are performing at a high level while executing on their strategic objectives with lottery delivering operating income margin at the high end of the 2025 target range, gaming recovering swiftly and exceeding the full year 2019 OI margin and digital and betting executing on growth initiatives, including the acquisition of iSoftBet. Second quarter revenue of over $1 billion was up 3% year-on-year at constant currency, led by 20% growth in Global Gaming with Global Lottery down 4% and as the prior period benefited from the impact of gaming hall closures in Italy. Year-to-date, revenue increased 5% at constant currency to $2.1 billion, with operating income of $480 million and adjusted EBITDA of just over $840 million in line with the prior year. Digital and betting revenue of $43 million was in line with the prior year and up 4% at constant currency, driven by iGaming expansion into Connecticut and West Virginia partially offset by softness outside of the U.S. Sports betting GGR was impacted by lower hold levels. We are tightening our 2022 full year revenue outlook to $4.1 billion to $4.2 billion lowering the high end of the previous range by $100 million, solely to account for changes in currency and the impact of the pending sale of our Italy commercial service business. As I just mentioned, we are reconfirming our full year operating income margin outlook of 20% to 22%, mitigating the impact of around $200 million or 400 basis points of currency movement and various headwinds. For the third quarter, we expect revenue of $1 billion to $1.1 billion and operating income margin of 18% to 20%, reflecting 150 to 200 basis points in higher project-related expenses. And I think that we will see -- we're hopeful that we'll see continued improvement, especially in the -- we've seen continued, I think, support for the elevated play levels that we've experienced post COVID which gives us a lot of confidence, I think, in the -- and what's important to me which is the long-term outlook, can continue, yet we now have another quarter same-store growth in the mid-single digits versus 2019 supporting our thesis of higher play levels post-COVID."
}