{
    "symbol": "PLCE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 23:15:07",
    "content": " Looking ahead, we are projecting Digital to represent approximately 60% of our total retail sales by the end of full year 2024 versus 33% of retail sales in 2019, almost doubling our Digital penetration in only five years. Digital traffic is up over 5% quarter-to-date versus last year and quarter-to-date Digital sales are running down 5% versus last year, higher than we had anticipated, considering our record shattering August last year. This year, we're projecting August sales to represent about 38% of the quarter, due to the continued growth in our e-commerce business, which generates significantly higher basket sizes. Net sales decreased by $33 million or 8% to $381 million versus $414 million in Q2 2021 and decreased $39 million or 9% versus $420 million in Q2, 2019. And as we had planned, sales in the quarter were also negatively impacted by lapping the impact of the enhanced child tax credits, which started last July combined with the pent-up demand from last year's return to in-person learning, and the impact of permanent store closures, representing approximately $14 million for the quarter. In terms of sales by channel, consolidated digital sales decreased 7% versus Q2 2021, with our Digital penetration growing to 47% of our total retail sales, versus 45% in 2021 and 30% of retail sales in 2019. The 610 basis point, unplanned decrease in gross margin rates down as follows: First, the slowdown in consumer demand combined with the unexpected increase in promotional activity from our key competitors, pressured our top line sales and fashion AURs, resulting in lower-than-planned merchandise margins in both channels versus our internal projections. The sales mix shift to wholesale, which operates at a lower gross margin, we had planned for outsized growth with Amazon in Q2, but we significantly overachieved our internal Amazon sales plans for the quarter driven by the strong customer response to our back-to-school basic programs. Adjusted SG&A was $114 million, flat to last year and versus $115 million in 2019 and deleveraged 223 basis points to 29.8% of net sales compared to 27.6% of net sales last year. Adjusted operating loss was -- for the quarter was $12 million, a decrease of $52 million versus $40 million of operating income last year and deleveraged 1,277 basis points to negative 3.1% in net sales compared to 9.7% in net sales in Q2 2021 and 1.4% of net sales in Q2 2019. Inventories ended the quarter up 34% versus last year and the increase breaks down as follows; 42% of the increase was due to higher AUCs, driven by higher input costs; 24% increase was due to higher inbound freight costs; 18% of the increase resulted from the elevated transit times, including the impact of the worsening port disruption on the East Coast; and the remaining 16% of the increase was driven by our investments in inventory to support our strategic growth initiatives with unit growth in place to support Amazon, Gymboree, and Sugar & Jade. Despite the slowdown in consumer demand, we were able to exit the quarter in a strong seasonal inventory position with spring and summer inventory units down 45% versus last year, better positioning us for the back half of the year. For fiscal 2022, the company expects net sales to be approximately $1.725 billion, reflecting a low double-digit decrease in comparable retail sales versus fiscal 2021 and a positive mid single-digit comp increase versus full year 2019. And so, we're I think are really well positioned currently right now, which is I think why we're seeing the bounce back in AUR and that emotional product, be it pumpkin picking or harvest or apple picking and then all the way through Q4 we have, like I said, an earlier launch on holiday, we have more receipts behind dress-up than we did last year, because we anticipated when we saw what happened in Easter, the continuation would happen for Christmas."
}