{
    "symbol": "PLCE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-19 21:38:03",
    "content": " Looking ahead, while the impact of last year's stimulus will eventually wane and the weather will eventually change, we believe that the unprecedented levels of inflation, which are now projected to persist into 2023 will continue to have an outsized impact on the lower income consumer, particularly due to significantly higher gasoline and food prices. Our US net sales decreased by $79 million or 21%, the $306 million versus last year's $385 million while our Canadian net sales increased by $1 million or 2% to $31 million versus last year's $30 million. The gross margin decrease versus last year was the result of the impact of incremental inbound freight transportation, driven by higher levels of air freight costs and higher container rates, impacting our Q1 gross margin by approximately 275 basis points. As an additional point of reference, our occupancy expenses were $18 million lower in Q1, 2022 versus Q1 2019 due to favorable lease negotiations and reductions in occupancy expenses for permanent store closures. Adjusted SG&A was $108 million versus $104 million last year and $127 million in 2019 and deleveraged 595 basis points to 29.9% of net sales, compared to 23.9% of net sales last year. Adjusted operating income for the quarter decreased $50 million to $21 million versus $71 million last year, and deleveraged 1,057 basis points to 5.7% of net sales compared to 16.2% of net sales last year and increased 409 basis points versus Q1 2019 when adjusted operating income was 1.6% of net sales. Inventories ended the quarter up 31% versus last year with 24% of our inventory in transit, as we continue to take actions to mitigate the impact of the ongoing global supply chain disruption and elevated transit times by pulling up receipts. When you think about going forward to your question about what's happening in the macro environment with respect to the inflation as you mentioned, lack of stimulus, all the supply chain mess and cost pressures, '21 is becoming somewhat less relevant in our opinion as a compare, which is why we mentioned that we are going to continue to compare throughout the balance of the year our progress towards our pre -- versus our pre-pandemic results in 2019. So we're looking at those results to be directly correlated, if you will, to the structural reset of our business model, which is why we are going to keep driving in 2022 to the $10 EPS and the $10 operating margin goal, because what we've been able to accomplish in the last couple of years has really been a pretty massive structural reset, and we have ended up with a much more resilient model that can kind of weather some of these storms, to your point, about taking the sales down mid singles is our latest projection. So if you look at the balance of '22 with the top line, what we're thinking about, we obviously don't think we're going to drop 16% again in any one of the quarters coming up, but we are going to be very, very careful at the end of this quarter and very, very careful in August, because we are not going to make the same mistake that we made in March by miscalculating the impact of stimulus and as we all know, we've got one category of business and it's kids clothes."
}