{
    "symbol": "SNPO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 00:50:02",
    "content": " We remain focused on controllable strategies consistent with our long-term growth algorithm that will enable us to outperform, including the following: one, increasing our share of wallet with existing integrators through the adoption of our ecosystems; two, continuing to innovate and launch the exciting products I referred to earlier; three, opening new local branches; four, adding new partners across our business, including in security and commercial markets. To begin, net sales in the fiscal third quarter increased 7.9% to $281.2 million, up from $260.7 million in the comparable year-ago period. The growth in net sales during the quarter reflects organic growth, including the continued ramp of local branches opened in the past year and the cumulative impact of proprietary product price adjustments taken in the past year. Contribution margin, a non-GAAP measurement of operating performance, increased 4% to $113.8 million or 40.5% of net sales in the fiscal third quarter. Selling, general and administrative expenses in our fiscal third quarter decreased 14.9% to $89.4 million or 31.8% of net sales from $105 million or 40.3% of net sales in the comparable year-ago period. Adjusted EBITDA, a non-GAAP measurement of operating performance, decreased 0.8% to $31.9 million or 11.3% of net sales in the third quarter of '22 compared to $32.1 million or 12.3% of net sales in the comparable year-ago period. Adjusted net income, a non-GAAP measurement of operating performance decreased 11% to $14.9 million or 5.3% of net sales from $16.7 million or 6.4% of net sales in the comparable year-ago period. We now expect net sales in the fiscal year ending December 30, 2022, to range between $1.10 billion and $1.115 billion, which represent an increase of 9% to 11% compared to the prior fiscal year on an as-reported basis and 11% to 13% after adjusting fiscal 2021 to remove the impact of the 53rd week. We believe the contributing factors for our 2022 net sales growth on a 52-week adjusted basis are as follows: 8% to 10% of our growth drives some organic growth, which includes volume, local branch openings, historical price adjustments and is net of FX headwinds and supply chain challenges that we've mentioned. Your line is open. Your line is open. Your line is open. We believe we can grow through a slower environment based on all the things I talked about, the products, opening local sites, share of wallet strategies, new partner acquisition, the growth we see, the outsized growth we see in the commercial and security markets, which continue to grow at a much faster pace than our, what I will call core residential technology market. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}