{
    "symbol": "SNPO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 21:30:51",
    "content": " As a reminder, our growth strategy remains rooted in five key pillars: one, increase our wallet share with existing integrators; two, expand our global integrator network; three, innovate with new products, software and tech-enabled workflow solutions; four, develop new software services and revenue models; and fifth, execute strategic M&A such as Staub Electronics and Clare Controls. As John said, net sales in the fiscal second quarter increased 17.2% to $296.9 million, up from $253.3 million in the comparable year ago period. Contribution margin, which is a non-GAAP measurement of operating performance, increased 15.2% to $116.5 million or 39.2% of net sales in the fiscal second quarter, up from $101.2 million or 39.9% of net sales in the comparable year ago period. Selling, general and administrative expenses in fiscal second quarter 2022 increased 21.3% to $95.4 million or 32.1% of net sales, up from $78.7 million or 31.1% of net sales in the comparable year ago period. The remaining increases in selling, general and administrative expenses is related to an increase in equity-based compensation expense of $5.6 million, increased costs associated with becoming and operating as a public company, ongoing investments to support the strategic growth initiatives, wage inflation and the acquired cost of Access Networks and Staub, which we did not own for the full period of the prior fiscal year second quarter. Adjusted EBITDA, which is a non-GAAP measurement of operating performance, increased 8.1% to $31.7 million or 10.7% of net sales in the second quarter of 2022 compared to $29.3 million or 11.6% of net sales in the comparable year ago period. Adjusted net income, a non-GAAP measurement of operating performance increased 19% to $16.5 million or 5.6% of net sales, up from $13.9 million or 5.5% of net sales in the prior year. Net cash used in operating activities was primarily driven by investments to protect against supply chain uncertainty, resulting in a use of net working capital, including a significant increase in inventory, which year-to-date has increased $64 million since the end of 2021. We expect net sales in the fiscal year ending December 30, 2022, to range between $1.16 billion, and $1.18 billion, which would represent an increase of 15% to 17% compared to the prior fiscal year on an as-reported basis and 17% to 19% after adjusting fiscal 2021 to remove the impact of the 53rd week. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}