{
    "symbol": "ALGM",
    "quarter": 1,
    "year": 2022,
    "date": "2021-07-31 12:42:06",
    "content": " I am joined today by Allegro’s President and Chief Executive Officer, Ravi Vig and Allegro’s Chief Financial Officer, Paul Walsh. With strong execution, we achieved the highest quarterly revenue level in our history for our core end markets and the strongest gross margin result to go with it, both on a dollar and percentage basis. Automotive and industrial both reached record revenue levels, demonstrating strength across our increasingly diversified business and we achieved record revenue for both magnetic sensors and power ICs reflecting increased content in our target applications. In addition to the benefit of the near-term recovery on our business, remarkable design win momentum gives us confidence in our long-term growth trajectory. We believe strong demand for our differentiated technology across growing markets puts us in the best position ever to deliver on profitable, sustained outsized growth. However, we continue to execute well and expect to see another healthy quarter in Q2. Automotive represented 71% of revenue and increased 13% sequentially in Q1 to a record $133.5 million, up 75% year-over-year. Our Automotive growth again compared favorably to global car production, which declined during the same fiscal period, reflecting growth in our content per vehicle and the favorable trend toward feature-rich vehicles. Industrial represented 16% of revenue, reaching $30.3 million, another record. Despite meaningful growth across our top customers, none exceeded 10% in Q1. Gross margin performance was strong with GAAP gross margin of 50.0%, up 36 basis points sequentially. Non-GAAP gross margin was 52.2%, also up sequentially by 129 basis points and ahead of our guidance as a result of stronger revenue and continued improvements from our manufacturing transformation. Non-GAAP adjustments include $0.5 million of stock compensation expense, $0.5 million of COVID-related expense and onetime wind-down costs in Thailand, $0.3 million of acquired intangible asset amortization and a $2.8 million charge for a reserve from Voxtel legacy module inventory. Revenue upside in FQ1 was anchored on strength across our strategic product lines and end markets, particularly due to content expansion in automotive. The industry provides favorable tailwinds, and we believe that the underlying diversity of our business, our continued design win momentum and alignment to multiple growth vectors supports the potential to continue to outperform the market. Power ICs were up 60% year-over-year, representing 36% of our revenue in the quarter. Strength in Automotive reflects our cross-portfolio content opportunity in automotive systems, particularly in ADAS applications such as steering and braking. Customers are awarding Allegro design wins in these two high-growth areas at a faster rate than ever before, providing us with a strong foundation for continued growth. As a result of the transformative shift underway in our automotive business, we are well ahead of our design win targets in both established and new applications across customers and geographies. For example, we locked in steering business for more than 25 new vehicle models across multiple global OEMs in Q1. These advanced lighting features have high adoption rates in today’s vehicles and are one of the fastest-growing applications in our safety, comfort and convenience revenue. During the quarter, we also launched strategic new products for ADAS, including 3DMAG position sensors, combining planar and vertical hall-effect technologies to enable true 3D sensing capabilities with high precision and accuracy. We have received more wafers, which have allowed us to service the market upside. So, we will continue to see more wafers out from our Polar wafer source. And then on the sort of just outlook for the automotive market, I know there are supply constraints. Well, we see that car companies are focusing more on feature-rich vehicles. So, we continue to see strength in our xEV and ADAS business. Maybe just a follow-up on the last question on supply, if I heard you right, I guess, the upside in June was that you were able to kind of get some supplies. And then I’m just kind of curious, I think you said that the back half should grow. And then I guess as you look at gross margin as you ramp these external, I know Polar was a bit of a drag when you had to use more of that. So – in Q2, we’ve definitely seen some of the benefits of the manufacturing transformation that we’ve been discussing for a while. And we anticipate, as we’ve guided for this quarter, a continued strength in gross margin, 52%. So Polar, I think we can all agree is generally lower margin sourcing for you from a gross margin perspective. And UMC, I think, is higher margin revenue for you. From a mix perspective, as we’ve mentioned in the past, Polar does have an increase or is a higher cost wafer than UMC or TSMC. So we get the benefit of having additional supply from Polar to service this demand, and we’re able to then maintain 52% margin. As we look into TSMC and UMC, as those – you hit those on the head exactly. When we look at minimum purchase requirements for Polar, where – that’s not an issue. And – what we need to focus on is that these wafer supply sources, as they come on, we are allocating them to service our top line growth. And as the blend of new wafer sources comes on, our overall cost basis will also appropriately adjust. But we remain bullish on the business, both from a gross margin perspective as well as from a top line perspective. Wanted to get a stat from you guys in the past, and I apologize if I missed it, you’ve given us a percentage of your Automotive sales that are driven by xEV and ADAS applications. Well, as we said that our xEV and ADAS business grew at 80% for the quarter year-over-year. And the overall business was at 74% of sales for the quarter, although our automotive business grew about 74% year-over-year. So clearly, the xEV and ADAS business has outperformed the rest of the auto business. Ravi, clearly, the key concern investors have right now has been times where things are this tight, there’s inevitably inventory build that’s going on that we mostly only ever see in arrears and so I understand that you’ve got sort of good visibility into distribution. And I guess as we look into next year in your auto business, do you think it’s still going to be a SAAR plus content type growth year for you or do you think we will end this year with some inventory that will dampen growth next year? We have a fairly reasonable inventory views into our customers from a perspective that we’re speaking with them on delivery issues, on supply alignment, etcetera. And to the best of our knowledge, what we believe is that the products that we are shipping to our customers are predominantly going right through to service end demand. And we look at the outlook for the rest of the year, and we keep believing that at this point the supply constraint – the supply-demand imbalance will continue. We have no indication at this point given the feature-rich vehicles, given our design win momentum and what that’s doing to drive market share gains, etcetera. And the growth in ADAS, xEV applications, we see that. And then Ravi, just going on to the power side of the business. Great growth year-over-year in that business, I am assuming the design pipeline there is as strong, if not stronger than the magnetic sensor. So for example, our ADAS business is really focused on motion control, where we provide sensors for angle sensing, torque sensing, speed sensing, current sensing, but we also provide  drivers, disconnect switches and regulators. So this is an example of a motion control system play that we have, and that’s been very successful in – as being part of our ADAS story. Power has focused and aligned itself into – in many of the segments that the sensor business was focused on, which is under the hood power. Power is also growing in our – in LED lighting, for example, but we don’t really particularly speak much about the interior lighting. So in Industrial, we’ve previously discussed our great take-through in data centers on our three-phase BLDC drivers. And this has had great take rate, both predominantly initially in data centers, but now also in secondary applications in Automotive. On the June quarter, I know you talked about orders up 13% sequentially, which is pretty strong given I think LVP, SAAR was down 8%, probably underlines your EV leadership. So what we look at from a design win perspective that in EV, we continue to win in inverters. We had spoken about – in the last couple of quarters that we’ve seen great pickup on our inverter products in EV, but also in our onboard chargers, etcetera. And – so in xEV, we see the core systems that we focused on, basically inverters and onboard chargers, is growing nicely. We also see the entire industrial ecosystem on EV that is – that we are participating in, both in infrastructure associated with EV and factory – battery factory technology in EV. And just going on the backlog a little bit, I know you mentioned backlog has been historically strong now. While we haven’t provided specific details in the past or today about the level of backlog, it continues to grow at a very healthy rate. And we’re seeing growth in the backlog in all these end markets and in the submarkets like xEV and ADAS within Auto and then within the markets of Industrial as well. Maybe one for Paul first, on the gross margin, Paul, the sequential flow through is roughly 70% in the last couple of quarters. So I think what you’ve seen in the past few quarters, Srini, is the – our ability to absorb the closure of the Thai facility into the Manila facility. And what we had always talked about is this being a major phase, a major milestone in the gross margin transformation of the company to get it to 52%. And then as the company grows, mix and other favorable growth trends within product mix will help benefit. I think that growth trend, though, is – was more of an absorption of the – of two factors into one. So the facility in Thailand is closed, where just we had certain wind-down costs, but that’s more on the SG&A side from a legal perspective. From a gross margin perspective, none of that’s been impacted. And now some of the efficiencies that we anticipated to see in our Manila factory, once everything has been installed and up and running, we’re starting to see those benefits. And so – and that’s an ongoing activity, and we’ve seen some benefits of that already. Ravi, I guess some of your peers are talking about the visibility is still being very strong and supply is still being very tight. At the same time, it looks like things aren’t getting worse from here. It also is coupled with the clear trend towards feature-rich vehicles that’s really beneficial to the company, which is ADAS and xEV in Automotive. So from an Allegro perspective, we continue to see that as supply comes on, it’s being dedicated to service real applications, real growth, market share expansion. So we have no visibility at this point when inventories will stabilize, just given from an Allegro perspective, given the momentum that design wins provide us. Paul, maybe for you, you’ve worked at a number of different semiconductor companies. On the disti side, we have excellent visibility into what the – as do many semiconductor companies, as to what the disties have for inventory. I mean, essentially, there – when product is shipped to distribution, they ship it right out to the end customer. And so we have that visibility, and we are very careful, of course, to make sure that, that doesn’t – that the situation that you described doesn’t happen. On the non-disti side, Ravi alluded to earlier, just in discussions with many customers on the non-disti side, large auto customers or industrial customers, that these types of – this is more anecdotal, but these types of conversations are such that they wouldn’t be happening if their inventory was – if they had the inventory and they were in a smoother production ramp. And that’s as a way to manage their inventory, and we can see that, and that provides us another lever for visibility. So as Ravi mentioned earlier and my view is that I don’t know when the supply-demand will balance, but I think many – between what we see from our end customers and from what we see from our peers and what we see internally, I think that’s not in the near-term or the medium-term."
}