{
    "symbol": "CGNX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 20:12:05",
    "content": " The final thing I would say is I think a lot of what we're seeing more is delaying of projects is giving us some concern rather than we're not seeing -- I can't think of really any cancellation of projects that we're seeing, nor would we expect to in the near term. Well, I'd say, Jim, we're still kind of continuing to learn about the seasonality in logistics it appears that Q1 and Q3 will be the stronger revenue generating quarters this year for our logistics and then we would probably expect, as we have in previous years, lower revenue, certainly in Q4 for the reasons you suggested. I don't necessarily see the dynamic we're playing -- you're referring to really having a marked effect on our business this year overall, but those -- the overall quarterly phasing with a stronger Q1 and Q3 is probably what we're expecting at this point. I think we expect logistics to be accretive to our overall growth this year, but unlikely to grow anywhere close to our 50% stretch goal after a remarkable year last year and a remarkable 3 years, really, I think, that we've seen. So I would say those dynamics, I think, are borne out, if you look over the last, say, 18-month period of results, -- in terms of new competitors, we're always very focused on what's going on in terms of new entrants and new competitors. I think we have seen good automotive growth in the first quarter, and we're -- so I don't think we've given more guidance for the year overall. I think what's maybe a little more unique for Cognex relative to others who are citing several different factors, core component cost inflation, freight and broker buys is really the broker buys are the vast majority of the delta between last year's gross margin of 77% and certainly us versus 72% now versus the 75% or mid-70s target. And I think that's some of the exciting part of logistics business and why we're confident about continuing to grow very strongly as a business, regardless necessarily of what happens in the U.S. You got the data, and that's been playing out the sort of relatively faster growth for some -- abroad for some time now."
}