{
    "symbol": "CGNX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 20:14:06",
    "content": " In addition to the slowness with a few large e-commerce customers throughout the quarter and slower business activity more broadly at the end of the year, foreign currency translation lowered revenue by $45 million or 4% in 2022 and by 6% in the fourth quarter. But I think it's also fair to say that, we see lower PMI data across all of the regions that we serve in our regular business, and that's certainly reflected in the activity that we're seeing, which is at a lower rate than we were expecting a few months ago. And then, of course, as I think I've explained quite a lot, the logistics business is really at a very low level, really as a result of the large customers really pulling back on e-commerce spending. And I think we've spoken to this before, but obviously, over the last couple of years, semiconductor has -- which is generally small for us, kind of might have been 5% of our business two or three years ago and still below 10%, but it certainly has experienced quite robust growth. And I think various recent -- various things that have been going on in the world are certainly continuing to drive that kind of sentiment for sure, production is being moved to other markets such as India and Vietnam, and we've been seeing that over a number of years, and it's definitely continuing and gathering pace. Hi, thanks for taking my question. But I think over -- I think we think we're in a pretty good three year period with what's going on in the industry with our capabilities, the SEC acquisition we discussed a lot of drivers, I think, really, again, no pun intended, helping us grow that business over the years to come. Hi, thanks for taking my question. I think over -- that's going to cycle up and down over time periods, but I definitely think EV battery investment and the timing about when it comes, is going to and it helped drive higher growth rates for us last year and could -- and I hope to see that again in the years to come."
}