{
    "symbol": "CGNX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 22:31:06",
    "content": " You may proceed with your question. You may proceed with your question. So I think the $50 million really relates to a slowdown in the market and deferred business that we're seeing in logistics, it's a phenomenon. Factors I think we're all reading about and aware of, I would say those two markets also are still really the majority of the spend that's going on. And then I think there's an another phenomenon which was in the rest of Asia, China, we reported some really great results as you've seen, but in the rest of Asia, we also saw some projects getting deferred, some challenges that some of the players had there with implementation, whether it was around electronics for new smartphone platforms and some of the challenges that they are seeing, or whether it's also in more broadly in automotive in the rest of Asia. You may proceed with your question. Well, when we exclude largest customer and perhaps one or two other large customers that we have in logistics, that's how we think about logistics, kind of the Tier 1 large type customers, they are going be down. Now when I think about the 30% new growth rate for logistics, so you said that a five-year CAGR previously was 50% in line with your prior target that included like the world's largest eCommerce customer becoming your largest customer at the company. But I also think we have other applications as I've spoken about with Vision  where we don't really play substantially today because we haven't had products, but we do expect to be introducing products and particularly none the parcel and postal segments would be areas where we see large potential for us to grow. I also fully expect we're going to see more large technology leaders emerge and we would expect to be their partner of choice in bringing machine vision, just like we've been the partner of choice for the most sophisticated and entrepreneurial, large manufacturing companies that make discrete products. I think and I think logistics will be significantly impacted based on the timing and what we're able to get out of the door, because I think we have a very big backlog there and there's the market itself before the fire happened was I think confused about the timing of implementation and also the ability of integrators â\u0080\u0093 large integrators to execute on the plans that customers have. You may proceed with your question. And I think you'll see larger incremental growth rates from those types of customers in markets like Asia, as they start to invest and we're riding into those markets with the confidence of what we've been able to do with them in the U.S., and obviously being the company they want to work most with in those markets. You may proceed with your question. Well, I think we're uncertain where the year will end at this point, but based on what â\u0080\u0093 how strongly Q4 comes in and there's a whole bunch of variables on that, which â\u0080\u0093 what we can share from what customers want to take."
}