{
    "symbol": "DGX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 14:02:10",
    "content": "  Risks and uncertainties, including the impact of the COVID-19 pandemic that may affect Quest Diagnostics' future results include, but are not limited to those described in our most recent annual report on Form 10-K and subsequently filed quarterly reports on Form 10-Q, and current reports on Form 8-K. 01:08 The company continues to believe that the impact of the COVID-19 pandemic on future operating results, cash flows and/or its financial condition will be primarily driven by the pandemic severity and duration, health care insurer, governments and clients payer reimbursement rates for COVID-19 molecular tests, the pandemic's impact on the U.S. health care system and the U.S. economy, and the timing, scope and effectiveness of federal, state and local governmental responses to the pandemic, including the impact of vaccination efforts, which are drivers beyond the company's knowledge and control. 10:06 In the quarter, our direct-to-consumer revenues more of than doubled compared to the prior year, driven by strong growth in both our COVID-19 testing operations as well as our base business testing. The year-over-year decline in adjusted operating income was primarily related to lower COVID-19 testing volumes, a higher portion of COVID-19 molecular testing volume from non-traditional channels, which carry additional expenses or logistics costs, investments to accelerate growth in our base business and lower average reimbursements for COVID-19 molecular tests. Your line is open. Your line is open. So, as Mark indicated in his prepared remarks, changing dynamics that are business with investments in the second quarter and then less COVID in the back half of the year and what we indicated we will be coming out of the year in the back half with – the amount of COVID testing we would expect, there's a good level to think about in 2023. 30:51 So, as you think about that transition, and then think about the investments we're making and thinking about the nice momentum we're building in the base business it gives you some perspective of how we're going to come through the three remaining quarters of this year, and then guide us to a reasonable place to be able to deliver what Mark indicated for 2023. Your line is open. Your line is open. We're very comfortable with the base business, we’ll be at or above pre-pandemic levels and we'll have a larger base business in 2023 with some level of COVID testing and in the margin performance that you saw in Q1, we're not expecting it to erode, even despite the factor, we did talk about raising up some of our CIT investments in Q2. Your line is open. And so, when we talk about the second part that you mentioned of putting in place a new platform, also where a consumer business we're investing in some marketing to get the growth we expect, and we are getting the results so far and we'll continue to see the results in the back half of the year. Your line is open. And then as we got further along past Investor Day we started to signal that we would expect it would be closer to the $8 or on the upper end of the range and because 2022 has more COVID revenue, I would just remind everybody, the growth rate in 2023 is going to be below that CAGR, but the absolute number we're saying should still be where you would have calculated it back in March of 2021. Obviously, we're assuming right now we're a lower price, we will continue to have COVID testing in 2023 and we’ve always assumed in our outlook going forward for growth in the topline and bottom line will be COVID testing  portfolio. Your line is open. Your line is open. Your line is open. Your line is open."
}