{
    "symbol": "HBI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 12:56:02",
    "content": " However, by taking this action, we believe we're well positioned to release working capital and drive operating cash flow this year. We believe the combination of these actions positions us to generate approximately $500 million in operating cash flow in 2023, to exit the year with a meaningfully higher run rate for both gross and operating margins, and to operate more efficiently, which unlocks long term growth. However, by quickly aligning inventory units with demand, we believe we're positioned to generate better efficiencies, and more importantly, to release working capital and drive operating cash flow back to more historical levels in 2023. We have eliminated the quarterly cash dividend to focus all of our free cash flow, which we defined as cash flow from operating spends less capital expenditures to pay down debt and bring our leverage back to a range that's no greater than two to three times on a net debt to adjusted EBITDA basis. As we move through the second half, particularly the fourth quarter, we expect year-over-year margin improvement as we begin selling lower cost inventory and we anniversary last year's manufacturing timeout cost. We see the path to improving margins by the end of the year as inflation eases and we benefit from our savings initiatives for driving higher operating cash flow, and we're continuing to progress on implementing our full potential plan. And then you look at the balance sheet where I think we're about 46%, payables to inventory, and it's really, because we were pulling back but you're still paying your vendors. And we're seeing lower commodity costs, lower freight costs, all that, again, the units that we were producing today, that well, again, as we talked about, in the earlier remarks, from a margin standpoint, as you look over the course of the year, I'm very encouraged with the trends, you're going to see a sequential improvement in margins throughout the year as we are again, selling off the higher cost inventory in the first half."
}