{
    "symbol": "TIGR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-07 12:47:05",
    "content": " With growth in the Tubi  business and prudent capital deployment, the total revenue of the second quarter increased by 2% from the first quarter to US$53.5 million. In the second quarter, mark-to-market loss too had an adverse impact on the total current asset, which slightly decreased by 2.3% to US$14.9 billion compared to the end of the first quarter. In the second quarter, average CAC for credit account was about US$300, a 10% decrease from the first quarter where we'll keep acquiring high quality clients. The average net asset inflow of our newly acquired clients in Singapore exceeded US$9,000 in the second quarter, further decreased from around US$8,000 in the second quarter â\u0080\u0093 sorry, in the first quarter, solidifying our leading position in both market share and client quality in Singapore. Total revenues were $53.5 million this quarter, a decrease of 11% year-over-year, as market backdrop, particularly in the U.S. market was still choppy, which is slow down trading and margin activities. Interest expense was $3.5 million, a decrease of 27% from the same quarter of last year, primary due to more interest expense savings from self-clearing. Employee compensation increased 25% year-over-year to $25.6 million this quarter, as we added headcount during last year to support our global expansion, in line with the head count increase, occupancy expense increased 69% to $2.5 million, but general and administrative expense decreased 15% year-over-year to $4.3 million due to one off professional service fee occurred last year. Marketing expense were $8.4 million this quarter, decreased 65% year-over-year. More than 60% of our total newly acquired clients in the second quarter coming from Singapore and the average net asset inflows of our new funded clients in Singapore exceeded US$9000, while average CAC  decreased sequentially. Therefore, average CAC in Australia and New Zealand is still relatively high, which brings the total average CAC to about us$300 in the second quarter, decreased about 10% on a quarter-over-quarter basis. In the second quarter, over 70% of newly funded users were acquired from overseas markets in which about 20% of funded accounts came from Mainland China, more than 60% came from Singapore and for the rest 10% to 20% were from Australia and New Zealand."
}