{
    "symbol": "AKTS",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-14 11:36:06",
    "content": " All statements other than statements of historical facts included in this conference call, such as expectations regarding our strategies, operations, costs, plans and objectives, including the timing and prospects of product development and customer orders, our expectations regarding achieving design wins from current and future customers, the possibility of entering into collaborative or partnering relationships, potential impacts of the COVID-19 pandemic, litigation matters, guidance regarding expected revenue, product orders and milestones for the current and future fiscal quarters and expectations regarding the integration of acquired business operations are forward-looking statements. From a product development standpoint, we achieved the majority of our stated milestones for the quarter, including multiple targets in 5G mobile and Wi-Fi, as well as renewed activity in our 5G network infrastructure and other market segments. Such funding would position Akoustis to manufacture and deliver billions of XBAW filter chips annually and position us to service both Tier 1 and Tier 2 mobile companies for 5G smartphones, as well as other multibillion-dollar end markets, including 5G networks, high-frequency Wi-Fi devices and other wireless markets. We started sampling two exciting new Wi-Fi 6E and Wi-Fi 7 compatible XBAW filter solutions during the September quarter, including our next-generation 5.5 and 6.5 gigahertz coexistence filter solution that covers the UNII-1 through 3 and UNII-5 through 8 bands. Our new 5.6 and 6.6 gigahertz solution can utilize all of the 5 gigahertz bands in Wi-Fi 6E and Wi-Fi 7 to support the North America market, we expect design wins for both our new next-gen 5.5, 6.5 gigahertz and our new 5.6, 6.6 gigahertz solutions and expect the new filters to be qualified and in production by the June quarter of 2023. Recently, we announced three additional Wi-Fi design wins in Wi-Fi 6E for carrier class applications, two design wins are for leading European carrier class Wi-Fi OEM that will be using the Akoustis 5.5 gigahertz and 6.5 gigahertz standard XBAW coexistence filter solutions, as well as the 5.6 and 6.6 gigahertz standard XBAW coexistence filter solution that allows for greater usage of the UNII 4 band. We continued our momentum in 5G mobile during the September quarter, getting closer to our goal of securing our first design win in the 5G mobile market by the end of the current quarter and entering production in the first half of 2023, with the first of 3 Tier 1 customers with whom we are currently engaged. In the current December quarter, we expect multiple new Wi-Fi 6E and network infrastructure customers to ramp production, and therefore, we expect to see record revenue with revenue up between 5% and 10% sequentially from the September quarter, and based upon our growing backlog of design wins, we anticipate that robust top line growth will continue into our next fiscal year and beyond. The ongoing semiconductor chip supply shortages and supply chain delays that are impacting the broader industry continue to impact our customers, while our design win momentum and customer activity continues to grow, driven by Wi-Fi 6, Wi-Fi 6E, Wi-Fi 7, 5G mobile, 5G infrastructure and other markets, our ability to grow revenue continues to be impeded in the near term given the broader market disruptions. We are expanding our market share in CBRS and now 5G infrastructure experiencing strong demand for our new Wi-Fi 6 and Wi-Fi 7 products and are targeting production ramp in the 5G mobile smartphone market in the first half of calendar 2023, which should result in accelerated revenue growth. By the end of the current quarter, we expect to ramp production to more than 17 customers with additional customer design wins expected across all our markets to finish calendar 2022. Further, we expect to secure at least three new Wi-Fi 6E design wins during the quarter and we expect to secure a Tier 1 SoC chipset Wi-Fi 7 reference design win."
}