{
    "symbol": "ICCM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-18 14:06:04",
    "content": " Notably, at the 23rd Annual Meeting of the American Society of Breast Surgeons in April, IceCure publication regarding our ICE3 breast cancer cryoablation study interim results originally published in the scientific journal, the Annals of Surgical Oncology was chosen as one of the best data of 2021from thousands of breast cancer articles published annually. For the three months ended March 31, 2022, revenue decreased by 48% to approximately $0.75 million, compared to $1.4 million in the first quarter of the last year. As a result of lower revenue and increased operation activities, net loss reported for the three months period ended March 31, 2022 increased to approximately $4.4 million, or $0.12 per share, compared with a net loss of approximately $1.4 million or $0.07 per share, for the same period last year. I wanted to review, I know that Mr. Shamir mentioned that we had published the interim results of the cryoablation without excision for early-stage breast cancer in the prestigious journal Annals of Surgical Oncology this past fall and it was brought to the attention of the members at the American Society of Breast Surgeons as one of the better papers from the year. We also – Mr. Shamir mentioned the coding for cryoablation with the help of the American Society of Breast Surgeons, as well as other organizations such as the American College of Radiology couple of years we’re very successful in getting a Category 3 new technology code for cryoablation of breast cancer. The reason that’s important is because, as the utilization increases and continued work on treating patients with breast cancer, we will be able to convert this Category 3 code to a Category 1 code, which already exists as Mr. Shamir mentioned for other areas of cancer, as well as for benign breast tumors. We are working very closely and of course, together with Dr. Fine and the board, the society, the leadership of the society to finalize the drug that basically supposed to be under the rules of the society and also everything will be finalized on that on the protocol aside from the group number of patients who approaching the number of sites, then of course we will do a proper announcement, but the society we’d like to work with I see it very closely."
}