{
    "symbol": "ICCM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 01:40:08",
    "content": " They are joined today by Dr. Kenneth Tomkovich, the Co-Primary Investigator for IceCureâ\u0080\u0099s ICE3 ProSense clinical trial on cryoablation of small, low-risk breast cancer. For the six months ended June 30, 2022, revenue decreased by 27% to $1.5 million, compared to $2.1 million in the first half of last year, the decrease is due to decrease revenue recognition of approximately $400,000 from distribution agreements with Terumo for the commercialization of process, to treat malignant breast tumors in Japan, Singapore, and Thailand, and a decrease in sales in Asia, which continue to be impacted by COVID surges and associated restrictions on commercial activity. But today in 2022, I can honestly say that the acceptance of this procedure and the way we perform this procedure using the ProSense system and the IceCure Medical technology has really become increasingly accepted and adopted amongst many sub-specialties including breast surgeons, interventional oncologists, breast radiologists, general radiologists, and interventional radiologists. There was a presentation there on, results six-year part results from the ICE3 trial, as well as a poster that presented the imaging findings post cryoablation, which are very important to radiologists, because there is no data set of these imaging findings, except for that in the ICE3 trial, because thereâ\u0080\u0099s been no long-term studies on this prior to ICE3, showing the specific imaging findings of patients who are followed with cryoablation without resection. Iâ\u0080\u0099ve also presented this year at the Chinese society in the past year, the Chinese Society of Interventional Radiology conference on the topic of breast cancer cryoablation in which we actually had a symposium and a whole course was offered for that meeting, which was â\u0080\u0093 I was honored to be asked to participate in that and that was a great presentation as well. After that I attended the ARRSD American rank race society meeting in New Orleans, whereas a moderator for interventional radiology session and attended a session presented by my colleague Dr. Ward from Brown on trial cryoablation for breast cancer at that meeting. And I guess I could mention that coming up for RSNA 2022, Iâ\u0080\u0099ve also had a public paper presentation on this very topic on breast cancer cryoablation and the imaging findings that Iâ\u0080\u0099ll be presenting along with Dr. Huang and her colleagues from MD Anderson at RSNA 2022. Again, Dr. Fukuma from Japan and Dr. Fine in the us are two of the leaders that are â\u0080\u0093 they are breast surgeons and the patients that weâ\u0080\u0099re seeing that, that really if you think about the patients that are the ones who were included in ICE3 that really comprises about 50% to 60% of all the breast cancer patients that I see on a daily basis in my clinical practice."
}