{
    "symbol": "HEP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 13:21:03",
    "content": " Today, we reported third quarter net income attributable to HF Sinclair shareholders of $954 million or $4.45 per diluted share. These results reflect special items that collectively decreased net income by $29 million and excluding these items, adjusted net income for the third quarter was $983 million or $4.58 per diluted share, compared to adjusted net income of $210 million or $1.28 per diluted share for the same period in 2021. Solid demand in the regions we serve, coupled with low inventories and improved crude differentials resulted in Refining EBITDA of over $1.4 billion in the third, compared to $295 million in the same period last year. Lubricants and Specialty Products reported EBITDA of $15 million for the third quarter, compared to adjusted EBITDA of $82 million for the third quarter of 2021. Marketing segment reported EBITDA was $10 million for the third quarter and total branded fuel sales volumes were 362 million gallons, representing a $0.03 per gallon margin. HEP reported adjusted EBITDA of $110 million in the third quarter, compared to $83 million in the same period last year. Pre-tax earnings included a $17 million charge for lower cost to market inventory valuation adjustment, HF Sinclairâ\u0080\u0099s pro forma -- pro rata share of HEPâ\u0080\u0099s share Osage pipeline environmental remediation costs of $10 million and acquisition integration cost of $11 million. HEPâ\u0080\u0099s third quarter 2022 net income attributable to Holly Energy Partners was $42 million, compared to $49.2 million in the third quarter of 2021. HEPâ\u0080\u0099s third quarter 2022 adjusted EBITDA was $110.1 million, compared to $83.3 million in the same period last year. HEP generated distributable cash flow of $78.7 million and we announced a third quarter distribution of $0.35 per LP unit, resulting in a distribution coverage ratio of 1.8 times. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}