{
    "symbol": "AMWL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 00:16:03",
    "content": " At this time, I would like to welcome everyone to the Amwell 2Q 2022 Earnings Conference Call. Before we begin our prepared remarks, I'd like to take this opportunity to remind you that during the course of this call, we will make forward-looking statements regarding projected operating results and anticipated market opportunities. Q2 was another important quarter for our company as we make progress on the launch of CONVERGE, our technology platform, powering the innovative healthcare organizations leading the way to our hybrid care future. We are proceeding according to our plan for the year, and our team is engaged and inspired by our clarity of purpose and well-defined role in a digital-first future. I'll start by reviewing some highlights of the quarter, then I'll take a moment to discuss the market for our solution and some customer examples. The CVS Virtual Care digital front door is an exciting new initiative, and we are honored to be selected as the backdrop for this vision. with CVS well underway and a substantial part of our platform in live deployments, our R&D efforts are focused on bringing CONVERGE over the finish line. Visits on CONVERGE remains steady, 9% of total visits through the AML platform, which is reasonable and expected as we shift our focus to more complex, sizable CONVERGE customer migrations, which naturally take longer. We continue to add to the Enel team, putting in place some great additional talent to enhance the clinical dialogue around CONVERGE. This positions us to deliver this compelling solution to the market more quickly, enabling our payer and provider customers to reach more members than patients with best-in-class care, driving substantial cost savings and patient benefits during this time of great need. We are also innovating real time as we deploy with our customers, creating digital-first best practices that are setting the standard for broader industry utilization. In another example of CONVERGE differentiation, we introduced the next patient feature, which creates a seamless way for providers and payers to connect patients and clinicians with speed and efficiency. The next patient capability allows providers to accept the patients without a previous appointment from a queue directly in their EMR or their provider portal, blending clinical networks to increase patient access and maximize revenue. patients coming in for their provider or health and portals are automatically matched with the next available provider, creating shorter wait times and an optimal patient experience. With this feature, the benefits accrue to all players as we complete the build of CONVERGE and with each additional customer migration, we drive an ongoing transformation at our company from being a healthcare services company to a technology company that enable meaningful transformation of our clients' digital care delivery. Now, I'd like to take a moment to discuss the market and how we plan to pursue growth through a land-and-expand strategy. In my regular discussions with our customers, there is a strong recognition of the pressing need to evolve to a hybrid model of care that blends the physical, virtual and automated modalities in a single digital-first experience. The need for operational efficiency, the staffing crisis and technological fragmentation all combined to create an urgent need to achieve a vision for digital care delivery. Workflows, priorities and talents will vary, but the future that seamlessly integrate digital care delivery is certain and plays right into the heart of our value proposition. As we migrate customers over to CONVERGE, we are engaging in the sales conversations, which demonstrate the ROI benefits of a digital-first approach to healthcare that includes various programs and modules that are optimized on CONVERGE. For example, St. Luke's University Health Network is leveraging our solution to unify multiple care delivery platforms and deliver care directly from the EHR. Our solution is also enabling improvements in health equity that enhance patient outcomes with multiple paths of care, including automated programs and coaching. Specifically, silver cloud health research has found that up to 80% of users show improvement in their depression or anxiety and 56% of patients with clinical diagnosis are diagnosed free within 3 months of commencing care. -- and sort health MSK programs have demonstrated 60% lower rates of surgery intent, lower reported levels of pain and reduced medication consumption by nearly 50%. The Dignity Health digital behavioral health team told us they aim to make virtual care indistinguishable from in-person care, thanks to insight from the data they are using to demonstrate quality outcomes. With our programs, they were able to drive behavioral health visits up from 300 per month to well over 1,000 per month, allowing Dignity Health to dramatically leverage their providers and extend the benefit of digital care in the bear health ramp. Additionally, our solution empowers and accelerates our customers' urgent need to reduce burnout and retain their teams. Last quarter, we told you how Spectrum Health were saving $1 million per year by lowering Edreadmission rates. Specifically, spectrum use our technology to create a new transition team that stands between patients and the ED to buffer the demand, to manage care and to allow care providers to spend their time appropriately. Our converse automated engagement programs, increased patient touch points while reducing unnecessary outbound calls to patients by as much as 50% and have demonstrated more than doubling of nurse capacity for post-surgical patients. Also addressing the crisis in clinician burnout, our automated care programs augment the care team, enabling them to practice at the top of their license. The authors highlighted earlier interventions when problems occur, improved outcomes and stronger trusting relationship between patients and care managers as key benefits. These are some of the examples shared at our sales meeting, and they are great stories to tell out in the field as we are gearing up our teams to sell to new customers and expand within existing ones. Now, there is one additional element of differentiation that I want to spend the moment on -- we are delivering a powerful multifold ROI benefits of efficiency and revenue generation with the superior patient and provider experience of our AMG providers. When customers choose, we provide much needed bandwidth to help alleviate burn out and solve for critical care team shortages like behavioral health, dermatology or neurology. In fact, as we engage in sales conversations with our customers around their digital care delivery aspirations, we are finding that our history as a service provider is a differentiating advantage for us is the software vendor. To wrap up Q2 highlights, I would like to close by saying that we are evolving our platform to help our customers make the transition from transaction in healthcare to continuous self-care. Before closing, I want to add that I'm proud of the way our teams are executing during our transition year, putting in place the crucial elements of our solution, driving engagement and executing on our mission to define and deliver the fundamental infrastructure, enabling the future of healthcare. We ended the second quarter with approximately 103,500 total active providers, representing 45% growth compared to a year ago. Virtual visits have continued to grow nicely despite much improved access to in-person care, demonstrating the continued acceptance of virtual business as a standard of care. Total visits were over $1.5 million in the second quarter, representing 19% growth versus last year. Scheduled visits grew 20% year-over-year and represented 73% of visit volume, about even with the first quarter and up from approximately 30% precoded -- we are making steady progress on CONVERGE development and the migration of our customers to our new platform is proceeding according to our plan. In Q2, total visits on CONVERGE comprised approximately 9% of total visits, which is in line with our average over the last 2 quarters. Total revenue was $64.5 million, reflecting growth of 7% versus the second quarter of '21. The components of revenue are as follows: Subscription revenue grew 10% over a year ago and was $29.6 million, which is fairly flat compared to Q1. Our AMG business is an important differentiator in the market and critical to many of our clients, and we view this offering as an important supporting element of our CONVERGE strategy. Gross profit margin was 43%, approximately flat to last quarter and a year ago. Our gross margin can vary quarter-to-quarter based on mix dynamics, and we believe as we ramp up CONVERGE deployments, the efficiencies associated with our multi-tenant SaaS-based platform will lift our gross margins. Turning to operating expenses and in support of our CONVERGE strategy, R&D spending was flat to last quarter at $37.1 million. As we indicated in our annual guidance, as we complete the more intensive development work on the platform, R&D should begin to decline during the second half and start to normalize into next year as our long-term path to profitability describes. This step down is seasonally typical because Q1 is a big marketing quarter for us with important industry conferences, making preparations for our sales meeting and some first of the year ad campaigns on behalf of our clients. Finally, adjusted EBITDA improved to negative $42.8 million from negative $47.1 million last quarter and is in line with our plan and guidance for the year. We are gearing up our teams to sell converge, and customers are pleased with the product and connecting with our vision. We believe we have a solution to specifically address many of these challenges, making our solution relevant regardless of the environment, and we can help them evolve their organizations through this time and beyond to true digital first healthcare delivery. We enter the back half of this year, laser-focused on execution and also realistic about the uncertainties in the broader market environment. To summarize, our second quarter was an important and encouraging quarter for us on many fronts, and we believe we are very much on a path to achieving the broader strategic and financial goals we outlined in February. By putting our technology at the heart of our future, we believe we are on a solid ground to execute through this transition year and proceed on a path toward long-term high-margin subscription revenue growth and expanding profitability. -- in pursuing the strategy to deliver the leading digital care delivery infrastructure, our future is about increasing our mix of high-margin subscription software as we pursue our long-term path to profitability and beyond. As you know, we are very careful to never talk about any of our specific customers, big or small, and CVS is no doubt, a very important relationship for the company. CBS is a fascinating organization that blend, insurance capabilities, retail capabilities, care delivery networks, PBM, population management services and so much more. Obviously, you came in better, I think, than expected on the second quarter. And if I recall correctly, you had talked about as you're ramping up CONVERGE, you're going to be running duplicate platforms, you outperforming the gross margins. Yes, Charles, I would say that â\u0080\u0093 we do note that the quarter came in better than the consensus for adjusted EBITDA. The back half, thereâ\u0080\u0099s a lot going on in terms of getting customers up and running, finishing off the CONVERGE development R&D and kind of across the board in terms of the income statement. So I would stick by the guidance we provided on the â\u0080\u0093 at least for now, for the adjusted EBITDA and not really think about that different in the context just because of the quarter. I think when we were discussing the long-term growth and margin trajectory, the second quarter was called out for being the highest burn, particularly around the R&D line, and that looked like it was flat quarter-over-quarter. Granted the commentary with some of the large migrations happening in the back half of this year makes sense, but there was also paired with R&D going down over the course of the year. Can you just help us rebucket where the back half of the year expenses look to go and just within the context of about $90 million of EBITDA burn in the first half of the year, just annualizing that gets you to the high end of your EBITDA guidance. So -- but we do still stand by the thought that relative to -- on a quarterly basis, we do expect to see some decline in the back half of the year. So whether that comes to pass second half over first half or just fourth quarter over third quarter, I don't want to be too specific around that. But I would tell you that I don't expect that the second quarter is the high quarter for the year on the R&D front, looking at where we are right now. And then gross margins are right now and in the first quarter, a bit higher than we had talked about in February. I think we talked about gross margins coming in flattish for the year, given all the puts and takes, and we still stand by that. So, I think youâ\u0080\u0099ll see some â\u0080\u0093 as visits ramp up over the back half of the year, that has an impact on gross margin as services ramp up over the back half of the year, that has an impact on margins. So we will see gross profit margins come in relative to this quarter, which is probably the high for the year. I think that probably covers the largest moving pieces, itâ\u0080\u0099s really going to be around R&D gross margins. And as we get into the fourth quarter with services and care points ramping up, those are some of the lower-margin products that we offer. And on the prior call â\u0080\u0093 or the first quarter call, there was a mention of other key modules that were being converted over â\u0080\u0093 or being integrated to CONVERGE. It's a very, very large infrastructure that is designed to host really indefinite number of modules and programs. Down the road, I would not be surprised if the majority of our models and program will not be manufactured by AML, but we will just serve as a very large integration layer for all parties, for patients, providers and of course, payers and employers. We donâ\u0080\u0099t tend to announce things before theyâ\u0080\u0099re ready, but you should fully expect more and more diversity, more and more comprehensiveness across the full care continuum on CONVERGE this year and in years to come. People are much more careful when they buy the focus on ROI, and we prepare to have this discussion with existing and new customers. And in many ways, hard press to find a client or even a potential client that doesn't see digital care delivery enablement is the necessary infrastructure they would need in order to survive and compete in this market. At the same time, we are -- we understand that the ability of people to commit to very large projects upfront really translate into risk that some people are hesitant to make at this time. And this is why we build the platform, not only converge, but the combination of converged, different type of clinical services, strategic services and even hardware in a modular way. But as we think about the CVS relationship, is the Sibos relationship could become more of a blueprint for CONVERGE being, letâ\u0080\u0099s say, the digital outright care delivery infrastructure. We make the point not to compete with the different players, especially not with the providers and really bring them together to create a singular experience, organizations that really have many of the moving parts would be a terrific example to the capability of the platform. But even if you have less of the parts and you want to engage sharing and exchanging information and services with other organizations, we don't necessarily compete with you, but really complement your offering and make it better and more sticky and more valuable to your own customers, we really created this tool in order to do that, which is a stark differentiator. This may be your last question, I'm not really sure, but I want to just make the point that I was told recently that this may be one of your last calls, Ricky. So, I wanted to express the gratitude of myself and our entire team for many, many years of terrific reviews and analytics and wonderful guidance and wish you a very best on the next chapter in Korea. Description as an integrator make an interesting partner for technology companies looking at healthcare, I love to have there any updates on the Google relationship and also your views on Amazon expansion in healthcare, both digital and care delivery. We made a very important decision to use our clinical data repository on Google, which opens the way for us to give much better reporting and analytics which is so important for CIOs as they look at multiple vendors that we bring together and they really want not only on digital door, but there's really one set of oversight into the many ways they touch and engage with the patients. And Amazon is known for many things, but they are especially known for the logistics and their obsession about the consumer experience, which finally is arriving into healthcare. Eric, you've been on many calls with us, you know that we are equally religious about that, a lot of effort was put in CONVERGE to truly create the phenomenal provider and consumer and really any other type of user experience. But perhaps most importantly, we see this movement by Amazon as the very strong accelerant to many of our customers who can use our platform in order to survive and flourish in a marketplace that is becoming incredibly more sophisticated and more competitive to them. Aron is an enabler, a role as an integrator does not hurt anyone, but it could be very, very helpful when they look at their plans to really create an edge for themselves into the future. Apart from many wonderful relationships really across all levels of both Oracle and Cerner that we maintain our recent conversations with both organizations have been very, very positive and really indicate that we are likely to continue and see them as a very good partner of AMR for many years to come. On the AMG business side, I donâ\u0080\u0099t think this is something that we have typically broken out quarter-to-quarter specifically I would say it was down a bit seasonally as we talked about kind of in line with revenue. I keep talking about the hybrid of physical virtual, but we really need a very good technology and capability around the automation, which this strategic acquisitions are more than delivering. If you think about automation, it allows the patients to experience healthcare as the companion is always on something that you can be in touch with the different participants, the fraction of the cost and has many, many ROI benefit, some of which I shared in my prepared remarks, other are available on our website and even with the third parties. So, regardless of the exact impact on revenue of specific programs, these capabilities, which are now part of the anal platform really allow us to complete everything we have to have in order to end 2022 with a very competitive offering across our entire market. And just as a follow-up, I think you projected last year that youâ\u0080\u0099re going to have about $30 million in revenue for that acquisition. We -- as do talked about, opted to accelerate the earn-outs and speed the integration of those assets as we saw the value that, that could bring us in marketing and integrated offering. And so with that, we're not really looking at these as stand-alone businesses at this point. Conversa is offered to customers on the health plan side as you can buy 1, 2, 3, 4 different Conversa packages along with an amount of visits and that will determine up and down kind of where you are on your subscription. So, it's really -- we're not really thinking about these as stand-alone line items from a revenue perspective anymore because you really just can't break them out in a package sale context. So I would tell you the businesses are performing as expected and -- but more importantly, the strategic value that they bring us and that they have brought us is better than we could have hoped. Look, I would say that -- we're seeing pressures on the cost side, no different than anybody else. We've really tried to optimize from a staffing perspective by using -- given the nature of the development of CONVERGE, we have used a lot of outside contractors because as we complete the development of CONVERGE and those discrete projects roll off, we're not -- we haven't ramped up headcount and then have to ramp that down. That being said, it hasn't put us in a position where I feel like we should be guiding you any differently from an R&D line item perspective going into the second half year. We've, I think, done a good job in dealing on a net basis with our -- with FTEs and again, really leveraging up on the contractor side. But what we're also doing, I think, rather uniquely is allowing a provider allowing our customers to use their own providers in addressing the virtual primary care needs. And so while that may necessitate us ramping up some, what I think it really will be doing is allowing our customers to utilize their assets a lot more efficiently as they roll out virtual primary care across their footprint. I would tell you, the lion's share more than the lion's share is urgent care related. My just last question is, as you guys are rolling out CONVERGE with payers, should we be looking for, for example, like with the LiveHealth Online JV, should we be looking for like a new platform or a new consumer-facing app to support that launch or those several launches. So a year ago, we -- our brand was very important to us, and we have different apps. In general, everything we do is web responsive -- so whether it's an app or a website, whether it's a computer or a tablet, it all works exactly on the same way, and it has the faith that our customers want us to have. So, we gracefully took one step backwards, if you will, allowing our customers to take their natural place to the forefront. If you think about your own family, would you rather get care from Cleveland Clinic or into Mountain or Amwell. Of course, we love unwell, but we think that your level of trust with the academic medical center or your trusted network in your community is rightfully much stronger and much more robust and our role is really to empower and enable them. As you can see, this is a very exciting quarter in a super exciting year. We can't wait to gear up our sales CONVERGE into 2023, who is bound to be a very interesting selling year for us."
}