{
    "symbol": "HON",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 12:16:09",
    "content": " We met or exceeded our second quarter guidance, despite these challenges with adjusted earnings per share of $2.10, up 4% year over year and $0.02 above the high end of the guidance range. Organic sales grew 4% year-over-year led by strong double digit growth in our commercial aviation, building products, productivity solutions and services, advanced sensing technologies, advanced materials and recurring connected software businesses. While demand trends remain strong, supply chain constraints continue to weigh on volume growth, predominantly in Aero, HBT and SPS, causing our path to backlog to increase sequentially by more than $100 million in the quarter. Business and general aviation original equipment returned to growth in the quarter, growing double digits, while air transport original equipment continue to strong 2022, growing over 25% year-over-year. Safety and Productivity Solutions sales decreased 10% organically in the quarter, in line with our expectations as strength in advanced sensing technologies and productivity solutions and services was offset by lower personal protective equipment and warehouse automation volume. So, for overall Honeywell, we exceeded our sales outlook growing top-line 4% organically, and we executed operationally to expand second quarter segment margin by 50 basis points to 20.9%, meeting the high end of our margin guidance range with expansion in PMT, HBT and aerospace. With that as a backdrop, we expect third quarter sales to be in the range of $8.9 billion to $9.2 billion, up 7% to 11% on an organic basis, or up 8% to 12% excluding the 1 point impact of our lost Russian sales. In Building Technologies, where supply chain constraints particularly around semiconductors, have improved slightly each quarter so far â\u0080\u009822, we expect sequentially improved volumes and pricing actions will support continued growth into the second half of the year. For overall Honeywell, we expect third quarter segment margins to be in the range of 20.9% to 21.2%, resulting in year-over-year margin contraction of 30 basis points to flat due to timing of high margin catalyst shipments in PMT and some mix headwinds in Aerospace. We expect a full year effective tax rate of approximately 22%, and we expect a weighted-average share count to be in the range of 684 million to 687 million shares for the year, reflecting our commitment to repurchase $4 billion of Honeywell shares in â\u0080\u009822. As a result of all these inputs, we have raised a low end of our full year adjusted earnings per share expectations to $8.55 to $8.80, up 6% to 9% year-over-year, reflecting confidence in our ability to more than offset a $0.05 foreign exchange headwind versus our initial guide from February as well as navigate evolving external risks."
}