{
    "symbol": "HON",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 13:35:05",
    "content": " We met or exceeded our first quarter commitments despite these challenges with adjusted earnings per share of $1.91, down 1% year-over-year, about $0.01 above the high end of our guidance range. Long cycle orders grew over 20% in the first quarter, led by strength in the overall Aerospace portfolio, PMT process solutions projects and SPS warehouse automation to help facilitate sustained growth through the coming years. First quarter backlog increased 9% year-over-year to $28.5 billion, or up 10%, excluding the impact of approximately $300 million of backlog we moved due to the Russia conflict. First quarter sales grew by 1% organically as supply chain constraints, predominantly in Aero, HBT and SPS, continue to hold back volume growth and cause our past-due backlogs to increase by approximately $500 million in the quarter. Turning to the segments, aerospace sales for the first quarter were up 5% organically compared to the first quarter of 2021, despite continued supply constraints as the ongoing flight-hour recovery led to more than 25% year-over-year sales growth in both air transport aftermarket and business and general aviation aftermarket. Aerospace segment margins contracted as expected in the first quarter to 27.4% due to higher sales of lower-margin original equipment products, the impact of inflation and the absence of a one-time gain in 2021, partially offset by our pricing actions. With that as a backdrop, we expect second quarter sales to be in the range of $8.5 billion to $8.8 billion, down 2% to up 2% on an organic basis, or flat to up 4%, excluding the 1 point impact of the mask sales decline and the 1 point impact of lost Russian sales. Despite the ongoing macro uncertainties, we now expect full year sales of $35.5 billion to $36.4 billion, which represents an increase of $100 million on the low end from our prior guidance, up 4% to 7% organically, with accelerated growth as the year progresses. We expect that our disciplined price actions will keep us ahead of the current inflationary environment, contributing approximately 5% to our sales growth, which is higher than we anticipated in our original guide and offsetting the majority of the approximately $400 million of lost Russia sales. In Building Technologies, we expect momentum to continue with sales growth both sequentially and year-over-year throughout 2022 as supply chain constraints, particularly around semiconductors, begin to ease and we deliver on strong demand for fire and security products and building management systems. For second quarter segment margins, we expect to be in the range of 20.5% to 20.9%, resulting in 10 to 50 basis points of year-over-year margin expansion. Since we stood up our sustainability program in 2004, we’ve achieved every one of the ambitious targets we have set for ourselves, reduced our greenhouse gas emissions intensity by approximately 90% while spending over $4 billion on remediation projects to restore thousands of acres of land for our communities. Despite the ongoing geopolitical challenges, including approximately $400 million of lost Russian sales, we raised the midpoint of our full year sales range and increased our earnings per share expectations. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}