{
    "symbol": "HON",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 12:20:02",
    "content": " While navigating a challenging backdrop, we delivered organic sales growth of 9% year-over-year or 10% excluding the impact of the wind down of operations in Russia led by strong double-digit growth in our Advanced Materials, commercial aerospace and building products businesses, a testament to our ongoing resiliency and our rigorous operating principles. We expanded segment margin by 60 basis points year-over-year to 21.8%, exceeding the high end of our guidance range by 60 basis points, with margin expansion in all four segments as we remain ahead of the inflation curve through continued commercial excellence. Our backlog continues to be strong, up 9% year-over-year in the third quarter, led by aero, PMT and HBT as our demand profile remains robust. Our strategic pricing and productivity actions, along with favorable business mix, brought segment margins for SPS in its highest level since the fourth quarter of 2018, expanding 250 basis points year-over-year to 15.7%. In the third quarter, we delivered GAAP earnings per share of $2.28 and adjusted EPS of $2.25, which was up $0.23 year-over-year despite a $0.05 foreign exchange headwind as the dollar continued to strengthen throughout the quarter. To dimensionalize this further for the full year, on a year-over-year basis, we expect $1.1 billion of sales headwinds from foreign currency, which compared to our original guidance from February is approximately $750 million of incremental headwind, a substantial challenge, which, as I mentioned, we've overcome on EPS. We expect the fourth quarter to be in the range of 22.8% to 23.2%, resulting in year-over-year margin expansion of 140 to 180 basis points due to timing of high-margin catalyst shipments in PMT, stable business mix and productivity in SPS and increased volume leverage in HBT. For full year 2022, we are upgrading our segment margin expansion expectations by 30 basis points on the low end and 10 basis points in the high end to a new range of 21.6% to 21.8% or 60 to 80 basis points of year-over-year expansion. Our full year expectations for Aerospace are slightly improved on a stronger third quarter, and we now expect full year organic sales to be up mid-single to high single digits year-over-year, with modest declines in segment margins as a result of OE mix . For overall HBT, we still expect double-digit organic sales growth for the full year and increased volume leverage should allow for continued sequential segment margin improvement in the fourth quarter and healthy expansion for 2022 overall. Thanks to a strong third quarter, we now expect sales for overall PMC to be up double digits for the year, an upgrade from our outlook last quarter of up high single digits and we expect segment margin to expand both sequentially and year-over-year in the fourth quarter. Turning to our other core guided metrics for overall Honeywell -- net -- impact, which is the difference between segment profit and income before tax, is expected to be in the range of negative approximately $60 million to positive $40 million in the fourth quarter and negative $125 million to negative $50 million for the full year. We expect the adjusted effective tax rate to be approximately 19% in the fourth quarter at approximately 22% for the year, and the average share count to be approximately 676 million shares in 4Q and approximately 683 million shares for the full year, reflecting our commitment to repurchase at least $4 billion of Honeywell shares in 2022. As a result of these inputs, our adjusted EPS guidance range is between $2.46 and $2.56 for the fourth quarter, up 18% to 22% year-over-year. For full year EPS, we are upgrading the low end of our guidance range by $0.15 to a new range of $8.70 to $8.80, up 8% to 9%, reflecting the confidence in our ability to more than offset foreign exchange headwinds of $0.19 year-over-year and $0.08 versus our initial guide from February as well as absorbing ongoing macroeconomic risk. So in total, we are raising the midpoint of our full year 2022 organic sales growth, segment margin and adjusted EPS guidance ranges while absorbing headwinds of $1.1 billion in sales and $0.15 in adjusted earnings per share versus our initial guidance from lost Russian sales and incremental FX, a strong indicator of our ability to successfully deliver results in a fluid operating environment. We met or exceeded our third quarter guidance for all metrics despite ongoing external difficulties, and we raised the midpoint of our full year organic sales and adjusted earnings per share guidance as well as increased our segment margin range, fully absorbing a series of higher-than-previously anticipated negative impacts, including FX."
}