{
    "symbol": "HON",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 11:55:05",
    "content": " Organic sales were up 10% year-over-year or up 11%, excluding the impact of the wind-down of operations in Russia, led by double-digit growth in commercial aviation, building products, advanced materials and UOP businesses, a testament to the underlying strength we are seeing across our end markets, particularly in long-cycle businesses. The fourth quarter was another strong one for our backlog, which grew to a new record of $29.6 billion, up 7% year-over-year and 2% sequentially due to strength in Aerospace and Performance Materials and Technologies. Free cash flow was $2.1 billion in the fourth quarter, with 125% adjusted conversion, down 18% year-over-year but delivering in line with our original guidance for the year. For the full year 2022, we delivered outstanding results above the high-end of our initial guidance for segment margin and adjusted earnings per share, despite approximately $2 billion in year-over-year top line headwinds and constantly shifting macroeconomic conditions. We finished the year with 6% organic sales growth, 70 basis points of margin expansion and $8.76 of adjusted earnings per share, up 9% year-over-year and above the top end of our original $8.70 guide. Safety and Productivity Solutions sales decreased 5% organically in the quarter, in line with our expectation, as continued growth in sensing portion of sensing and safety technology business was offset by lower volume in warehouse automation and productivity solution and services. We generated $2.1 billion of free cash flow in the quarter, down 18% year-over-year but delivering the midpoint of our full year free cash flow guidance at $4.9 billion. Given the backdrop Vimal just shared, in total for 2023, we expect sales of $36 billion to $37 billion, which represents an overall organic growth sales range of 2% to 5% for the year. Orders in our Sustainable Technology Solutions business have accelerated dramatically over the past two years, and we're expecting more of the same in 2023 as we continue towards our $700 million sales target by the end of 2024. We expect 2023 free cash flow, excluding the settlement of the legacy legal matters we discussed earlier, to range between $5.1 billion to $5.5 billion, up 8% year-over-year at the midpoint as we had previously spoken about. As a result, we expect first quarter EPS between $1.86 and $1.96, down 3% to up 3% year-over-year or up 5% to 10%, excluding the year-over-year impact of lower non-cash pension income. While 2023 brings new -- including potential recession scenarios, leading to uncertain demand in short cycle with a record $30 billion backlog, a robust balance sheet and one that has been further derisked due to the NARCO settlement and the ability to deploy capital organically and inorganically, I remain optimistic about the future of Honeywell and believe the company is well positioned to drive innovation to solve some of the world's most challenging problems. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. One moment for our next question, please. Your line is open. Your line is open. One moment for our next question, please. Your line is open."
}