{
    "symbol": "ATGE",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-11 23:26:00",
    "content": " We made good progress on the integration of Walden, delivering our first year target of $30 million in run rate cost synergies and using the integration as a catalyst for transforming the whole of Adtalem, starting with the introduction of a more dynamic, efficient and better integrated operating model. For the full year, we grew operating margins by 230 basis points year-over-year, and we reported adjusted EPS of $3.24, which was 40% higher than the prior year. Revenue in the fourth quarter increased 62% to $361.2 million compared with the prior year, driven by the acquisition of Walden. Consolidated operating income, excluding special items for the quarter, was $88.1 million, an increase of 175% compared with the prior year due to the addition of Walden and operating efficiencies. For the full year, consolidated operating income, excluding special items, was $271.3 million an increase of 73% versus the prior year, resulting in operating margins of 19.6%, an increase of 230 basis points year-over-year driven primarily by operational efficiencies and realization of cost synergies associated with the Walden integration. For the full year, net income from continuing operations increased 33% to $158.2 million, resulting in diluted earnings per share of $3.24 or a 40% increase compared with the prior year, excluding special items. The Chamberlain segment reported fourth quarter revenue of $140.2 million, a decrease of 1% when compared with the prior year and operating income of $41.1 million, up 37% from $30.1 million in the prior year. Total student enrollment during the quarter decreased 5.8% compared with the prior year, which was primarily attributable to COVID-related headwinds in our post-licensure online nursing programs leading to fewer new starts. Total student enrollment during the quarter decreased 9.5% compared with the prior year because of COVID-related headwinds in our post-licensure nursing programs, leading to fewer new starts. Revenue in the fourth quarter increased 3% to $83.9 million compared with the prior year, and segment operating income increased 30% to $14.5 million. Operating income, excluding special items, was $19.6 million, an increase of 74% compared with the prior year, driven by the revenue increase coupled with the benefit from cost synergies. Taking into consideration the net effect of these different factors, we expect FY '23 revenue to be in the range of $1.38 billion and $1.45 billion and adjusted diluted earnings per share of $3.95 to $4.20 from continuing operations, excluding special items, reflecting continued year-over-year expansion of our operating margins. We remain on track to deliver an additional $30 million in cost synergies on the completion of the second anniversary of the acquisition of Walden, which will help drive the year-over-year improved operating margins."
}