{
    "symbol": "TWOU",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 22:05:32",
    "content": " We concluded 2022 with strong results, including $58 million of adjusted EBITDA for the quarter or growth of 178%, beating our guidance by nearly $10 million. For the full year, we delivered $125 million of adjusted EBITDA or growth of 88%. No more â\u0080\u009cempty calories.â\u0080\u009d Looking at the top line of our degree business for 2022, revenue slowed by 3% year-over-year to $572 million. In 2022, we reduced paid marketing by $47 million when compared to 2021 and we generated revenue above our expectations despite lower marketing spend and a strong labor environment. Paul will cover the 2023 outlook in more detail, but the highlights are a range of $155 million to $160 million for adjusted EBITDA with positive EBITDA from our Alternative Credentials segment in the back half of the year and our first ever year of positive levered free cash flow. As you have seen from our press release, we had a strong finish to the year, delivering revenue of $236 million and EBITDA of $58.4 million in the fourth quarter. Degree segment revenue decreased 10% to $137.1 million for the fourth quarter reflecting a 9% year-over-year decline in FCE enrollments, with average revenue per FCE remaining relatively flat. On a full year basis, Degree segment revenue decreased 3% to $571.6 million, driven by a 2% decrease in FCEs and average revenue per FCE. The Alternative Credentials segment continued to deliver strong revenue growth in the fourth quarter, with revenue increasing to $98.9 million, up 8%. On a full year basis, the Alternative Credentials segment revenue increased 11% to $391.5 million. Turning to operating expenses, operating expense totaled $230.6 million for the quarter, a decrease of $62.7 million or 21% compared to last yearâ\u0080\u0099s fourth quarter. Adjusted EBITDA for the quarter increased 178% to $58.4 million, a margin of 25% compared to a margin of 9% for last yearâ\u0080\u0099s fourth quarter. Segment profitability or adjusted EBITDA for the Degree segment came in at $60.5 million, a margin of 44% compared to $39.4 million in the fourth quarter of 2021. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}