{
    "symbol": "TWOU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 20:56:17",
    "content": " During what was clearly a complicated quarter, our confidence in our platform strategy increased due to meaningful progress on various tactics we discussed on last quarter's call, including organic demand generation and the publishing platform of edX. Harsha and his team including our newly appointed Chief Marketing Officer, Michael Kurbjeweit who's also been with 2U nine years, will focus on optimizing marketing spend at a platform level while continuing to drive growth. Adjusted EBITDA in the Alternative Credential segment was a negative 18%, a 600 basis point decline from the second quarter of 2021, primarily due to increased losses in the exec ed business related to macroeconomic conditions and the inclusion of edX's operating expense. Your line is open. What I would add is, $150 million minimum of EBITDA in 2023 and I do think it's worth pointing out the reason I turn your attention to Slide five is, the percent of sales and marketing for 2U has been part of the discussion around the company for a long time. Your line is open. So just as investors look to have confidence in the 2023 EBITDA and free cash flow projections, just help us with that agreed trends, because it looks like that's your primary profit pool and degree took a pretty big step down in revenue this quarter. Your line is open. So ultimately quite proud of the high-quality outcomes across the business including this was not the quarter to have the prepared remarks with a whole bunch of strong statements about how great some particular thing is we were really proud of the Gallup survey related to our boot camp programs, which didn't get that much attention and we think should have that proved that the year one ROI was effectively equal to the cost of the boot camps. And so effectively the core bundle offers a set of core services that we believe when combined with the edX platform because it includes nurturing -- lead nurturing, we think it will drive quality profitable programs 2U with a significantly smaller like very little J curve so much lower investment upfront. Your line is open. Your line is open."
}