{
    "symbol": "TWOU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 11:17:11",
    "content": " We delivered $253.3 million in revenue, a 9% year-over-year increase over Q1 2021 and adjusted EBITDA totaled $12.3 million. We reported solid topline performance, with strong adjusted EBITDA and cash flow performance, which is particularly noteworthy considering that first quarter is typically a higher expense quarter and the quarter with the highest use of cash and we did this while diligently prioritizing the executing -- the execution and integration of edX. The Degree Program segment grew 6% and the Alternative Credential segment grew 15%, all on a year-over-year basis, while edX contributed $10.9 million. Expense for the quarter totaled $364.7 million, including $18.3 million of operating expense from edX and $58.8 million of non-cash impairment charges related to certain of our acquired intangibles and goodwill assets. Adjusted EBITDA for the quarter totaled $12.3 million, margin of 5%, while free cash flow used on a trailing 12-month basis, came in at $34.1 million. Taking a closer look at our results, revenue for the quarter totaled $253.3 million, up 9% from a year ago, driven by 5% increase in full course equivalent enrollments or FCEs, which came in at 85,000 for the quarter. In the Degree Program segment, revenue in the first quarter totaled $154.2 million, growth of 6% from the first quarter of 2021. Revenue from the Alternative Credential segment totaled $99.1 million, growth of 15% from the first quarter of last year, driven by higher student enrollment, an 8% increase in FCe. This increase includes 3% growth in revenue from our boot camps, 9% growth in exec ed revenue, and an $8.2 million contribution from edX. net loss for the quarter totaled $125.8 million, an increase of $80.2 million from the first quarter of last year, reflecting the $58.8 million of non-cash impairment charge, $6 million in higher interest expense and $18.3 million of additional operating expense from edX. Adjusted EBITDA margin in the Alternative Credential segment was a loss of 24%, compared to a loss of 14% in the first quarter of 2021, driven by an $18 million impact from edX expenses. Now for our discussion of the balance sheet and cash flow statement, we ended the quarter with cash and cash equivalents of $233.6 million, a decrease of $16.3 million from year end 2021. Josh, so I think if we look back at the first quarter and when we provided numbers, we had $80 million of EBITDA, $80 million of CapEx, expecting the neutral net working capital for a year. If you look back at our plan and the taking of the year, we were probably expecting somewhere between $25 million and $40 million of use of cash in the first quarter."
}