{
    "symbol": "TWOU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 20:10:14",
    "content": " The steps we took reduced marketing spend by $26.5 million year-over-year and drove down our cost per lead by approximately 30% versus the prior year, resulting in marketing and sales expense as a percent of revenue of roughly 37%. Full course equivalent enrollments or FCEs came in just over $80,000 for the quarter, reflecting a 3% increase on a year-over-year basis, while average revenue per FCE declined at 5% compared to the third quarter of 2021, primarily driven by mix. Revenue for our Degree Program segment decreased 7% compared to the third quarter of last year, driven by a 1% decline in FCE enrollments and a 6% decline in average revenue per FCE, reflecting a greater percentage of lower cost edX masters and undergraduate programs. In our Alternative Credential segment, revenue increased 12% compared to the third quarter of last year, reflecting the inclusion of legacy edX offerings, a 15% increase in FCE enrollments and an 8% decline in average revenue per FCE. Adjusted EBITDA for the quarter increased $17.8 million to $32.5 million, or a 121% improvement when compared to the third quarter of last year. Your line is open. Your line is open. Like, we're working on a whole bunch of new partners, new content and the flex model on the degree side allows us to really aggregate great degrees without the J curve that you've historically seen in our Degree business. Your line is open. Your line is open. Your line is open. Your line is open. And with the production -- with the EBITDA expansion that we're expecting next year, those are the types of things that are giving us the optimism that we're seeing in terms of getting it extended and also focusing on terms that can help us, whether it's a cap, whether it's reduced rates all those types of things are on the table. But the bottom line is we want to make sure we take that risk off the table, that is somewhat a perceived risk because at the end of the day, look, we -- by the time we get to next quarter and exit the year, -- we believe we have good liquidity, strong liquidity from a business perspective, close to $200 million of cash exiting the year."
}