{
    "symbol": "ATCX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 15:10:37",
    "content": " On today's call, I'll provide an overview of the quarter, what we're seeing in our core markets and updates on our strategic priorities, and then David will continue with a more detailed discussion of our third quarter financial results and our outlook for the remainder of the year, then we'll then open up the call for your questions. This growth was driven by a combination of factors, including the backlog growth we have experienced over the last several quarters, continued strength in our core transportation and environmental end markets and our ability to cross-sell a broader portfolio of technical services across existing and new customers. Our backlog at the end of the quarter reached another record level of $864 million, which is up 14% from last year and up 1% from last quarter, which is especially impressive as our third quarter is our highest revenue quarter of the year. Gross revenue of $162.1 million in third quarter of 2022 was up 16.9%, compared to the prior year quarter, driven by 10% organic growth with strong performance in all our service areas, as well as contributions from acquisitions. Adjusted EBITDA was $25.8 million in the quarter, up 30.3% from last year and represented 20% of revenue, excluding subcontractor costs. The markets where we're seeing growth, as I mentioned in the call, we're seeing pretty steady across a lot of the end markets, but I'd say, clearly, our transportation markets, end markets continue to show considerable growth, as well as our public markets, and that's anywhere from, as we talked about from our indoor air quality services to program managed services. Hi Rob, well, certainly really pleased with where we landed in the third quarter, itâ\u0080\u0099s our highest organic growth quarter since we've gone public, 10%, which puts us at about 7% year-to-date, fits nicely with where Joe and I have guided since the beginning of the year to land the year somewhere between 5% and 7%. I'll defer guiding to next year or beyond, Rob, just for the reason I mentioned, we're in the throes of our planning process right now and we've got about another month's worth of work to do, so, weâ\u0080\u0099ll look forward to talking to you about that at year-end, but we do certainly anticipate the positive trend you've seen over the last two years with us to continue."
}