{
    "symbol": "AZZ",
    "quarter": 1,
    "year": 2023,
    "date": "2022-07-11 13:52:08",
    "content": " Those risks and uncertainties include, but are not limited to, changes in customer demand and response to products and services offered by the company, including demand by the power generation markets, electrical transmission and distribution markets, the industrial markets and the metal coatings markets; prices and raw material costs, including zinc and natural gas, which are used in the hot-dip galvanizing process; and the coil coating process; changes in the political stability and economic conditions of the various markets that AZZ serves, foreign and domestic; customer-requested delays of shipment; supply chain vendor delays, acquisition opportunities; currency exchange rates, adequate financing and availability of experienced management and employees to implement the company's growth strategies. When sales are combined with AZZ's metal coating segment, led by Bryan Stovall, we anticipate over 75% of our second quarter revenue to be derived from our Metal Coatings businesses. After the first quarter closed on June 23rd, we announced entering into a definitive agreement to sell 60% majority stake in Infrastructure Solutions to Fernweh Group LLC for estimated cash proceeds of $228 million. With the addition of Precoat during the middle of May, we generated sales of $314 million with the AZZ Metal Coatings segment posting almost $161 million, which is another record quarter. The results also reflect a full quarter of DAAM and Steel Creek Galvanizing, but Metal Coatings still had organic sales growth of over 20% versus prior year's first quarter. Precoat on a pro forma basis, for the first quarter had sales up almost 40% year-over-year at $237 million, operating income up 57% at over $46 million with 19% margin and EBITDA of $54 million, up over 40% at 20 - 2.8% margin. On a 7.6% growth in sales, the AIS team increased operating income by over 33% to $12.9 million, primarily as a result of electricals strong quarter. As Tom noted, we reported first quarter sales of $314 million, 37% higher than the $230 million reported in the first quarter of last year. Excluding $44 million in sales contributed by Precoat Metals in the last half of May, sales were still roughly 18% above the prior year on a comparable basis. Today, we reported first quarter operating income of $40 million, which was a 30% increase over the prior year first quarter, reported operating income of $31 million. Excluding these transaction-related expenditures, operating margins for the first quarter would have been 16.7% of sales or 330 basis points above the prior year same quarter. On an adjusted basis, net income was $35.9 million or 61% above last year's first quarter. Cash flows from operations in the quarter increased 110% to $23.3 million compared with $11.1 million reported in the first quarter of last year, primarily on higher earnings. Highlights of our new credit facility include $400 million 5-year revolving credit facility, and we had zero outstanding at the end of the quarter, a 7-year $1.3 billion Term Loan B, an 8-year $240 million Blackstone, 6% subordinated notes that should convert into preferred equity following our Annual Shareholder Meeting, which is being held tomorrow."
}