{
    "symbol": "DECK",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-02 23:31:04",
    "content": " Total portfolio DTC increasing 19% versus last year, to represent 52% of volume with both HOKA and UGG contributing to this mix shift, an all-time-high for the third quarter, and our international revenue increasing 12% on a reported basis, and growing 25% on a constant currency basis, when adjusting for the significant FX headwinds. HOKA growth in the third quarter was driven by share gains with one specialty account in the wholesale channel as product flow improved this year relatively to last, allowing HOKA to increase sell through, added points of distribution with select strategic accounts as the brand has been slowly expanding throughout the year, global DTC revenue more than doubling versus last year, as consumer acquisition and retention increased 95% and 109%, respectively. In terms of consolidated channel performance in the third quarter, we saw strong growth in both global DTC and wholesale, but the majority of revenue growth was driven by global DTC which increased 19% versus last year on a reported basis, and 22% on a DTC comparable basis. With the exceptional demand our brands were able to capture through DTC combined with a strategic actions taken on the UGG wholesale front, our third quarter DTC mix increased from 50% last year to 52% this year. Growth in the quarter was driven by continued expansion of HOKA, which more than doubled its global DTC business through impressive increases in consumer acquisition and online retention, and increased wholesale revenue by 83% versus last year due to market share gains and select increased points of distribution with strategic partners. Inventory was $723 million, up 31% versus the same point in time last year, primarily to support the continued growth of the HOKA brand, which was light on inventory in the prior year due to factory delays, with some offset from UGG inventory being down year-over-year, and during the period we had no outstanding borrowings. You know, and I think you have to pull back and look at the full year results of this brand, and especially the way both of our brands and Q3 performed in a very challenging environment, FX pressures, promotional environment, and to come out with this rate of high level â\u0080\u0093 high price, full price sell through, healthy margins, and still momentum and demand in the marketplace. But you know, I think coming out of the year-to-date so far in China, listen, I give our teams over there, the leadership and management team, the way they have managed the last three years in that marketplace with all the challenges from COVID and lockdowns, and you know, consumers not being able to spend, I think weâ\u0080\u0099re in you know, exceptional shape and our brands as considering the marketplace."
}