{
    "symbol": "DECK",
    "quarter": 1,
    "year": 2023,
    "date": "2022-07-28 23:04:06",
    "content": "  All statements made on this call today, other than statements of historical facts are forward-looking statements and include statements regarding changes in consumer behavior, strength of our brands and demand for our products; changes to our product allocation, segmentation and distribution strategies; changes to our marketing plans and strategies; changes to our capital allocation strategies; the impact of the COVID-19 pandemic on our business and supply chain; our anticipated revenues; brand performance; product mix; gross margins; expenses; inventory and liquidity position; our potential repurchase of shares; and impacts of the macroeconomic environment on our operations and financial conditions. First quarter revenue increased 22% versus last year to $614 million, and we delivered earnings per share of $1.66. Importantly, our first quarter result demonstrated momentum behind our long-term vision to build HOKA into a multibillion dollar major player in the performance athletic space further diversify the UGG brands product, geographic and seasonal mix, grow our DTC business through consumer acquisition and retention, and drive international markets through strategic investments. During the first quarter, HOKA delivered global revenue of $330 million, an increase of 55% versus last year. Global DTC across all brands grew 15% as a result of increasing consumer acquisition and retention by 13% and 28%, respectively, and revenue from international markets increased 36% versus last year, which includes earlier distributor shipments. Starting with the brand highlights, global HOKA revenue for the first quarter increased 55% versus last year to $330 million. The HOKA brands strong quarter featured outstanding revenue growth across the brands far reaching global ecosystem of access points highlighted by international markets increasing 66% versus last year, led by the strength of the EMEA region, which was partially influenced by the timing of selling for our distributors as we strategically build new markets. U.S. increasing 49% versus last year, with DTC growth leading wholesale global DTC increasing 58% versus last year, driven by continued momentum with retained consumers, as well as the continued acquisition of new consumers and global wholesale increasing 53% versus last year, as the brand increased market share and existing accounts and benefited from select doors added to strategic accounts. During the quarter, DTC acquisition increased 48% and retention increased 58% versus last year, with gains among 18 to 34 year old consumers far outpacing these increases. Moving to UGG, global revenue in the quarter decreased 2% versus last year to $208 million dollars. Across a global direct-to-consumer even though revenue dollars are below last year due to these product mix shifts, demand for UGG remain robust as the brand experienced increases of 8% and 13% and acquired and retain consumers respectively versus the prior year. From a channel performance perspective in the first quarter, global wholesale segment revenue including distributors was the primary driver of growth increasing 25% versus last year. The quarter just completed HOKA represented 53% of DTC revenue, which is up from 39% last year and 27% 2 years ago, with nearly all of the HOKA brands DTC business occurring through e-commerce, our most profitable channel. HOKA revenue increased 55% versus last year accounting for nearly all of this quarterâ\u0080\u0099s revenue growth due to the exceptional demand experienced across the brands global ecosystem of access points, and improved inventory availability. Additionally, first quarter gross margin was impacted by product mix and normalized promotional activity for UGG as the brand sold more sandals and discounted select styles in line with pre-pandemic activity and channel mix shifting towards the wholesale and distributor segment, in particular, our international distributor business that shipped product earlier than in years past. While we have maintained our overall guidance, Iâ\u0080\u0099d like to highlight a few additional items contemplated within the guidance, which include stronger HOKA revenue growth now expected to increase in the 40% range versus last year, reflecting upside from greater inventory availability, which aligns to our expectation of using less air freight than originally anticipated, and incremental foreign currency headwinds, primarily affecting UGG growth due to the brands wholesale business model and concentration of planned growth from the international regions."
}