{
    "symbol": "PMTS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 12:37:05",
    "content": " Net sales increased 25% to $125 million, our third consecutive record quarterly sales level, led by 31% growth in our Debit and Credit segments and 8% growth in our prepaid debit segment. Our sales growth generated strong operating leverage with net income increasing 80% to $12 million and adjusted EBITDA increasing 32% to $28 million in the quarter, despite inflationary impacts on production costs. Third quarter net sales increased 25% to $124.6 million, compared to the prior year quarter, led by volume growth as price increases provided a low single-digit contribution to the growth percentage. The 31% increase in our Debit and Credit segment was primarily due to increased sales of higher-priced contactless cards, but we saw good growth across our portfolio, including contact cards, personalization services and Card@Once Instant Issuance Solutions. Third quarter gross profit of $48.4 million increased 29% from the prior year, while gross profit margin increased from 37.8% to 38.9%, driven by operating leverage from sales growth, including benefits and price increases, partially offset by the impact of inflation on production costs primarily on material costs. Year-to-date gross profit of $128.3 million increased 16% from the prior year, while gross profit margin decreased from 39.2% to 36.7% due to inflationary impacts on production costs, primarily materials, partially offset by pricing benefits. Income from operations for the Debit and Credit segment increased 44% in the quarter to $29.4 million, driven by the higher net sales and operating leverage partially offset by higher production costs, primarily material. Prepaid debit segment income from operations increased 7% in the quarter to $9.1 million, driven by higher net sales, partially offset by increased material costs. The free cash flow usage in the first nine months of this year was driven by increased inventory purchases of $14 million to continue to support customer demand and $15 million increase in accounts receivable, driven by the high sales levels in the third quarter."
}