{
    "symbol": "PMTS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 10:55:31",
    "content": " As we look back on 2022, there were four main drivers that were critical to our success: first was our differentiated innovative products and services and end-to-end solutions; second, our market-leading quality and customer service; third, our strong supply chain execution while the industry faced challenges; and fourth, we benefited from a strong growth year for the card markets in the U.S. Our differentiated end-to-end solution, leading quality and customer service and strong supply chain execution each contributed meaningfully to our market share gains. Our initial financial outlook for 2023 projects mid-single digit growth for net sales with higher expected net sales growth in our Debit and Credit segments, which comprised 82% of net sales last year, and Prepaid Debit segment net sales similar to the 2022 levels. Also, face challenging comparisons with our 2022 performance as the 27% net sales growth last year benefited from significant contributions by large portfolio additions with existing customers, particularly eco-focused cards and strong Card@Once printer upgrade sales. Fourth quarter net sales increased 36% to $126.4 million compared to the prior-year quarter, with strong growth across our Debit and Credit portfolio and in Prepaid. Prepaid Debit segment net sales increased 39% compared with the prior year, driven by new customer additions outside the traditional retail channel and growth with existing customers. Fourth quarter gross profit of $47.5 million increased 54% from the prior year, while gross profit margin increased from 33.2% to 37.6%, driven by operating leverage from sales growth, including benefits from price increases, partially offset by the impacts of inflation on production costs, primarily on materials costs. Net income in the fourth quarter increased from $700,000 in the prior year to $12.5 million in 2022, and adjusted EBITDA increased 100% to $27.2 million. Full year gross profit of $175.8 million increased 24% from the prior year, while gross profit margin decreased from 37.7% to 36.9% due to inflationary impact on production costs, primarily materials, partially offset by operating leverage, including the benefits of price increases. Full year net income increased 129% to $36.5 million, primarily due to the sales growth and the impact of debt refinancing costs incurred in the 2021 first quarter. Income from operations for the Debit and Credit segment increased 68% in the quarter to $31.2 million, driven by the higher net sales and operating leverage, partially offset by higher production costs, primarily materials. Prepaid Debit segment income from operations increased 35% in the fourth quarter to $5.2 million, driven by higher net sales and operating leverage. For the full year, Prepaid Debit segment income from operations decreased 5%, primarily due to the inflationary impact on production costs, with the majority of the impact on materials and increased operating expenses, partially offset by higher sales, including the benefit of price increases."
}