{
    "symbol": "PMTS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 13:39:04",
    "content": " We are pleased with our start to the year as we increased sales 25% to $111 million, which is record quarterly sales level since we became public in 2015 and significantly improved our margins from the fourth quarter levels. As a result of the strong sales growth overall, we were able to deliver increased adjusted EBITDA in the quarter compared to the prior year despite cost pressures and comparisons with a very strong margin in the first quarter of 2021. The increased range is a result of the improved sales outlook, and we now expect our full year adjusted EBITDA margin to be slightly below 20%, reflecting expectations for continued and accelerating inflationary impact on costs. First quarter net sales increased 25% to $111.4 million compared to the prior year quarter, driven by a 32% increase in our debit and credit segment. Net income in the quarter increased 149% to $6 million, primarily due to the impact of debt refinancing costs incurred in the 2021 first quarter as well as increased sales growth and the resulting operating leverage, partially offset by the increased material, labor and SG&A costs. Adjusted EBITDA increased 2% to $22.5 million, while adjusted EBITDA margin declined from 24.8% in the prior year to 20.2% in the 2022 first quarter. While our adjusted EBITDA margin was 24.8% in the 2021 first quarter, it averaged 19% in the remaining 3 quarters as the higher SG&A expenses and increased labor costs impacted results. Income from operations for the Debit and Credit segment increased 20% in the quarter to $24.1 million, driven by the higher net sales and operating leverage, partially offset by increased material and labor costs. Increased working capital usage in the first quarter was expected, primarily driven by increased inventory purchases of $13 million to continue to support future growth and a $10 million increase in accounts receivables due to the 25% sales growth in the quarter."
}