{
    "symbol": "PMTS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 11:53:03",
    "content": " Second quarter sales growth has led by our debit and credit segments which increased 29% and included strong contributions from contactless cards, including eco focus cards and our Software-as-a-Service-based Card@Once instant issuance solutions. Second quarter net sales increased 22% to $113.3 million compared to the prior year quarter, driven by a 29% increase in our debit and credit segment. Approximately $1 million of incremental professional services costs, and approximately $1 million related to various items including increased IT expenses, and comparisons with a sales tax benefit in the prior year quarter. Adjusted EBITDA margin declined from 20.7% in the prior year to 17.4% in this 2022 second quarter due to the inflationary impact on production costs, which offset operating leverage and higher SG&A expenses. First half gross profit of $79.8 million increased 10% from the prior year, while gross profit margin decreased from 39.9% to 35.5% due to the inflationary impact on production costs. SG&A expenses increased by $8 million in the first half compared to the prior year, primarily due to $4 million increased compensation expenses, including approximately $2 million of stock compensation, and approximately $2 million of incremental professional services costs, including $1 million related to Sarbanes-Oxley. Net income in the first half increased 41% to $12.2 million, primarily due to the impact of debt refinancing costs incurred in the 2021 first quarter. Adjusted EBITDA increased 2% to $42.2 million, while adjusted EBITDA margins declined from 22.7% in the prior year to 18.8% in the 2022, first six months. Income from operations for the debit and credit segment increased 25% in the quarter to $25.3 million, driven by the higher net sales and operating leverage, partially offset primarily by increased material costs. The free cash flow usage in the first half of this year was driven by increased inventory purchases of $18 million to continue to support customer demand and a $12 million increase in cash receivables due to the 22% sales growth in the quarter."
}