{
    "symbol": "CURI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 23:49:02",
    "content": " Fourth quarter adjusted EBITDA improved by $2.6 million compared with the prior year quarter, while adjusted free cash flow improved by $22.7 million year-over-year. The year-over-year change was primarily driven by a $9.5 million reduction in content licensing revenues, a $2.2 million reduction in bundled distribution revenues and a $2.1 million reduction in Other revenues, partially offset by continued revenue growth in our direct and enterprise categories. As Clint mentioned, we are implementing a price increase for our new standard plan subscribers and have transitioned to a performance-based customer-acquisition marketing model, as we entered 2023 with less than $1 million of marketing commitment for the year. Turning to content licensing, which was our second largest category this quarter, we generated $3 million of revenue, compared to $12.5 million in the prior year quarter. Excluding the $2.6 million of revenue we generated from this contract in the fourth quarter of 2021, bundled distribution revenue grew 29% year-over-year on an adjusted basis. Moving to profitability, despite lower revenues and ongoing legacy content amortization and advertising expenses, adjusted EBITDA loss of $13.6 million improved year-over-year from a loss of $16.3 million in the prior year. Adjusted free cash flow improved year-over-year during the quarter by $22.7 million, from negative $31.5 million to negative $8.8 million. Moving to our first quarter guidance, we expect revenue in the range of $11 million to $13 million and adjusted free cash flow in the range of negative $8 million to negative $6 million. Along with our planned reduction in cash content spend, we expect our zero margin pre-sales content licensing revenue, which amounted to approximately $19 million in 2022 to be in the low-to-mid single-digit million dollar range in 2023. I think AVOD and FAST, so AVOD and FAST -- our brand partnership business has been a little bit lumpy in the past, because oftentimes, itâ\u0080\u0099s we might be -- we might do a $1 million deal that happens in a quarter. And so I think, if you look at how companies that are looking to expand in FAST that have this kind of positioning, I mean, they will typically look at it, itâ\u0080\u0099s like, okay, with FAST channel we can generate $3 million to $4 million per year and that assumes you have 250 hours of good content to roll through. The bundled distribution revenues was down by $2.2 million, but in the comparable quarter, a year earlier, there was $2.6 million of revenue in that category that was associated with the distribution agreement that we did not renew in the middle of 2022 and then $2.1 million was a reduction in other revenues. But I mean, our direct -- we said our direct customers grew and they grew 25% year-over-year and on the bundled side, grew a little bit, and that was a combination of -- in certain cases, we are paid basically a fixed fee based on the numbers, not -- itâ\u0080\u0099s not a fee per subscriber, itâ\u0080\u0099s a fixed fee and the distributor customers, subscribers can go up and down a little bit and so thatâ\u0080\u0099s why it was kind of marginal growth over the quarter there."
}