{
    "symbol": "BIG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-27 10:47:02",
    "content": " But we see significant opportunities ahead, while remaining highly focused on managing the business prudently, including: first, getting inventory back in a cleaner position by the end of Q2, which will increase our open to buy, enabling us to leverage our muscle to go after closeout opportunities; second, getting back to an acceptable gross margin rate in the high 30s by Q4; third, continuing to accelerate our expense reduction efforts. More specifically on gross margin, our key priorities include: a strong focus on lowering opening price points to drive traffic; having more open to buy to chase closeout where we expect there to be significant opportunities, which we are already starting to see; minimizing detention and demurrage charges as our new FTCs and lower receipts reduce the pressure on our supply chain. The gross margin rate for the first quarter was 36.7%, down approximately 350 basis points from last year's rate, significantly underperforming our guidance. On a full year basis, we now expect SG&A to be down around $100 million to our original plan, driven by expense flex on lower sales, lower bonus accruals and $70 million of additional cost reductions, partially offset by higher distribution and outbound transportation expense, including the impact of higher fuel rates. So we see our ability to sell through and get better inventory, better opening price points, get the closeouts in place, get new items at better price, and have that value that's good for the customer and also good for our margin in the back half of the year. Recent examples, bedding, soft home, tabletop, et cetera, we're seeing nice opportunities to get 50-plus points on margin rate at very good opening price points. Shrink, we remain optimistic that we're going to see a benefit even if we don't -- didn't -- even if we didn't get a substantive benefit, there's an accounting benefit in Q4 because of what we booked in Q4 of 2021, which was essentially a full year's worth of incremental shrink, but we do think we're going to see a benefit from that. And I think the proof points are just what we're seeing in May right now as we get to the right price points for her, we're seeing mid double-digit comps, 3-year comps across all categories. So I think, Karen, one of the key points along the way will be Q4 where we think we can get back to a much better gross margin rate after dealing with some of the challenges we're facing in Q2 and Q3. So certainly, part of the path for us, has to be getting gross margin rate back up closer to historical levels than it's running in Q1 and Q2 and some of it in Q3, which we're confident we can do."
}