{
    "symbol": "BIG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-01 10:45:03",
    "content": " The adjusted income tax rate in the quarter was 24.8%, compared to last year's rate of 29.3% with the rate change primarily driven by lower non-deductible executive compensation, partially offset by the effect of employment related tax credits and audit settlements. Sequential gross margin rate improvement will be driven by the factors we laid out on our last call, including easing of inbound freight costs, other cost of goods reductions, more targeted and efficient pricing and promotions, and an expected shrink benefit as we lap the cumulative shrink accrual adjustment we recorded in the fourth quarter of last year. The good news is the work that we're making in increasing our bargains, our opening price points in those categories, the end caps and making sure we've got more bargains in treashers is going to play out nicely and should be a good trade down opportunity as we go into 2023, but it is a lag into Q4 at this time. Going back to your question about inventory, yes, we expect to end the year very clean on inventory, as well as dealing with the seasonal overhang that we've had for the past couple of quarters, we've been dealing with other slow moving inventory, including in some areas in furniture where given the change in the environment, there's been some obviously slower terms there. So along with all the other bargains and treasures that we'll be adding, the opening price points, I think we're going to have a very compelling assortment and a delightful shopping experience for those trade down customers. No, it's a broader initiative, something that we've been looking at throughout the last several years, especially with the pandemic that just delayed it, because that's which she was shopping and we -- but we also knew even while we're doing well in those areas, which are predominantly in the essentials, which is for the most part food and consumables and make up the majority of that."
}