{
    "symbol": "BIG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-30 10:37:06",
    "content": " Although furniture business has been challenging on an industry-wide basis, we are proud to be one of the few furniture retailers that customers can go to and take their furniture home that same day, while still providing her options to order online and pickup in store-at-the curb or delivered the same day from nearly 1,000 stores across the U.S. We continue to enhance our unique position with the new furniture sales model with improved staffing and incentive-based compensation to drive engagement and sales. As we move into Q4, we expect the cleaner inventory levels improving sales momentum due to our efforts in providing better value to customers and lower freight and non-freight costs will lead to a recovery in Q4 gross margin to be approximately in line with the prior year. First, relative to Q3, sales should improve sequentially on a one-year comp basis as our inventories get into a clean position creating open-to-buy opportunities to offer better deals for our customers increased bargains and closeout offerings, unique and exciting treasures and lower opening price points. Your line is now live. Your line is now live. And so the majority of our inventory bulge and markdown, promotional activity was to move that product in Q2, which we -- for the most part, put behind us to go-forward seasonal inventory is on lower ticket items and more seasonal items that we've curtailed and rightsized for the Q3 and Q4 we expect to see really nice sell-throughs on that and better management overall across our product lines. Your line is now live. Your line is now live. During the last couple of years with the inflation rates and so on, they really pushed some of our products out of opening price points, and we've worked hard with our great vendor community to bring those back down, especially in areas like furniture. Your line is now live. So I feel like we're in a good position, and it's getting better every week, and it's going to get stronger through the back half of this year, and we'll enter '23 from a really good position with a nice balance of bargains, treasures and everyday essentials. Your line is now live. Your line is now live."
}