{
    "symbol": "CPT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 17:33:05",
    "content": " The $0.03 per share variance to the midpoint of our prior quarterly FFO guidance resulted primarily from approximately $0.025 from higher occupancy, lower bad debt and higher rental rates for our same-store and non-same-store portfolio, and $0.01 from an unbudgeted earn-out received from the sale of our Chirp investment completed in 2021. This increase is primarily the result of an approximate $0.09 increase related to our acquisition of the fund assets comprised of a $0.22 increase from consolidating the NOI from the two fund portfolios, a $0.03 increase from the non-cash amortization of net below-market leases assumed in the acquisition, a $0.07 decrease in equity and income of joint ventures and property and asset management fees, a $0.04 decrease due to the assumption of approximately $514 million in existing secured debt, and a $0.05 decrease related to additional shares issued to fund the transaction. We are also now anticipating an approximate $0.04 sequential increase in same-store NOI resulting from higher expected revenues during our peak leasing periods, partially offset by the seasonality of certain repair and maintenance expenses, expected increases from our May insurance renewal and a sequential increase in property tax expense due to higher refunds received in the first quarter. You may now go ahead. You may now go ahead. You may now go ahead. I mean, at least we're getting 8% to 9% increases in new leases but it's nothing like Tampa or Phoenix or some of these other really white hot markets. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. So it takes longer sometimes to entitle and -- but ultimately, I think it's an interesting area for us to look at and to ultimately maybe get some benefits from how they're operated and have that translate into more efficient operations in our final projects. You may now go ahead. If you look at our new leases our average household income is about $116,000 and our lease to the rent-to-income ratio is slightly less than 20%, but overall it's a little -- right at 20%. You may now go ahead. You may now go ahead. You may now go ahead. So I think he believes his numbers have captured, the slippage that is happening above historical rates and he thinks we're going to be up 50,000 completions across Camden's markets next year which if you look at it market by market there's not none of them look terribly troubling at this point as long as we continue to get decent job growth. You may now go ahead. You may now go ahead. So it's -- that's a big part of the story is that, as other places kind of moderate from 20% to 16%, you still have Washington and in parts of California where we're getting no rental increases or CPI-type rental increases. So -- but I think it's -- I think we feel like we're in a really good position, given the uncapped rental increases that we're going to get to at some point. So if you think about market rents and sort of increasing on a year-to-date basis, on a full year for 2022, we think it's going to be up right around 4%. You may now go ahead."
}