{
    "symbol": "DAVA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-16 12:11:06",
    "content": " Our remarks today include forward-looking statements including our guidance for Q3 fiscal year 2022 and for the full fiscal year 2022 and statements regarding our perceived opportunities and anticipated future growth and geographic expansion, our expectations regarding digital transformation of businesses, and industries and other industry trends, the necessity of digital transformation for many companies, and Endava's ability to benefit therefrom, potential technological advances, our expectation for future partnerships, and ability to expand our existing relationships, anticipated client demand for Endava services, our ability to attract and retain employees, and be an employer of choice in multiple geographies, our integration of FIVE and Levvel, and our ability to execute on our sustainability objectives, as well as other forward-looking statements. Endava reported revenue of £157.7 million for Q2 of our fiscal year 2022, representing a 53.4% year-on-year increase in constant currency from £105.2 million in the same period in the prior year. We ended the quarter with an adjusted profit before tax for the period of £33 million, representing a 60.4% year-on-year increase from £20.6 million in the same period in the prior year. Importantly, we grew the number of larger clients with a total of 107 clients who are paying us in excess of £1 million a year compared to 75 in the same period last year, representing a 42.7% year-on-year increase. The average spend of our top 10 clients continues to grow strongly and was up 40.4% year-on-year in the three months ended December 31, 2021. Revenue from North America grew 79.8% for the three months ended December 31, 2021 over the same quarter last fiscal year. Endava's revenue totaled £157.7 million for the three months ended December 31, 2021 compared to £105.2 million in the same period in the prior year, a 49.8% increase over the same period in the prior year. Our adjusted profit before tax for the three months ended December 31, 2021 was £33 million compared to £20.6 million for the same period in the prior year. Our adjusted profit before tax margin was 20.9% for the three months ended December 31, 2021 compared to 19.6% for the same period in the prior year. Our adjusted diluted EPS was £0.46 for the three months ended December 31, 2021 calculated on 58.0 million diluted shares as compared to £0.29 in the same period in the prior year calculated on 57.1 million diluted shares. Revenues from our 10 largest clients accounted for 34% of revenue for the three months ended December 31, 2021, compared to 37% for the same period last fiscal year. Additionally, the average spend declined from our 10 largest clients increased from £3.9 million to £5.4 million for the three months ended December 31, 2021, representing a 40.4% year-over-year increase. In the three months ended December 31, 2021, North America accounted for 35% of revenue compared to 29% in the same period last fiscal year. Revenue for North America grew 79.8% for the three months ended December 31, 2021 over the same quarter of fiscal year 2021. Revenue from TMT grew 32.5% for the three months ended December 31, 2021 over the same quarter of 2020 and accounted for 25% of revenue, compared to 28% in the same period in the prior year. Our adjusted free cash flow was £31.2 million for the three months ended December 31, 2021 compared to £18.7 million during the same period last fiscal year. CapEx for the three months ended December 31, 2021 as a percentage of revenue was 2.4% compared to 1.6% in the same period last fiscal year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}