{
    "symbol": "DAVA",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-27 10:19:05",
    "content": " Endava reported revenue of Â£180.4 million for Q4 of our fiscal year 2022, representing a 35% year-on-year increase from Â£133.6 million in the same period in the prior year. Endava's revenue totaled Â£180.4 million for three months ended June 30, 2022, compared to Â£133.6 million in the same period in the prior year, a 35.0% increase over the same period in the prior year. Our adjusted profit before tax margin was 20.1% for the three months ended June 30, 2022, compared to 22.0% for the same period in the prior year. Revenue from our 10 largest clients accounted to 32% of revenue for the three months ended June 30, 2022, compared to 36%, the same period last fiscal year. Additionally, the average spend per client from our 10 largest clients increased from Â£4.8 million to Â£5.8 million for the three months ended June 30, 2022, representing a 21.0% year-over-year increase. In the three months ended June 30, 2022, North America accounts for 35% of revenue, compared to 37% in the same period last fiscal year. Revenue from North America grew 27.0% for the three months ended June 30, 2022 over the same quarter of fiscal year 2021. Revenue from TMT grew 32.5% for the three months ended June 30, 2022 of the same quarter of 2021 and accounted for 25% of revenue unchanged compared to the same period in the prior year. Revenue from other grew 39.1% for three months ended June 30, 2022 over the same quarter of 2021 and now accounts for 24% of revenue unchanged, compared to the same period in the prior year. Our adjusted free cash flow was Â£43.4 million for the three months ended June 30, 2022, compared to Â£32.6 million during the same period last fiscal year. CapEx for the three months ended June 30, 2022 as a percentage of revenue was 2.1%, compared to 1.2% in the same period last fiscal year. Endava's revenue totaled Â£654.8 million for the fiscal year 2022, compared to Â£446.3 million in the previous fiscal year, a 46.7% increase over prior year. Our strong revenue growth continues to translate into solid profitability and our adjusted profit before tax for the fiscal year 2022 totaled Â£138.3 million, compared to Â£92.1 million in the prior year, a 50.2% year-over-year increase. Our adjusted diluted EPS was   for the fiscal year ended June 30, 2022, calculated on 58.0 million diluted shares as compared to   for the previous fiscal year calculated on 57.1 million diluted shares up 48.5% year-over-year. Revenue from our 10 largest clients accounted for 34% of revenue for the fiscal year ended June 30, 2022, compared to 35% for the previous fiscal year. CapEx for the fiscal year ended June 30, 2022, as a percentage of revenue, was 2.1%, compared to 1.2% during the same period last year."
}