{
    "symbol": "SYF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-18 12:24:07",
    "content": " In short, Synchrony has continued to see strong engagement across our customer base and momentum across our product suite, thanks to our ability to deliver flexible financing options that specifically address whatever our customers' transactions may look like on any given day, whether they're looking to cover a health care need, purchase supplies for a home repair, or they're simply convenience or value shopping. Synchrony's first quarter performance reflected continued strength across our diversified sales platforms and, in particular, the powerful combination of our digitally powered product suite, seamless customer experiences and compelling value propositions, which resonate deeply with the needs of our customers and partners. We generated over $40 billion of purchase volume in the first quarter of 2022, reflecting a 17% increase compared to last year. On a sequential basis, first quarter payment rate was down approximately 25 basis points to 18.1%, but was still approximately 45 basis points higher than last year and approximately 225 basis points higher than our 5-year historical average. Provision for credit losses was $521 million, an increase of 56% versus last year due to lower reserve release that was partially offset by lower net charge-offs in the first quarter 2022. Our portfolio's strong delinquency trends have continued to drive year-over-year improvement in our net charge-off rate, which was 2.73% compared to 3.62% last year, an 89-basis-point improvement year-over-year, primarily reflecting a very healthy consumer and a 45-basis-point higher payment rate. So again, it really says this is across the board, and we don't necessarily think it's inflation-driven, but part of, I think, the migration that we anticipated back on payment rate back to the mean that we anticipate the exact time of which we're not 100% sure of, but again, we're starting to see that turn."
}