{
    "symbol": "ARC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 14:34:20",
    "content": " Such statements are only predictions based on information as of today, May 4, 2022 and actual results may differ materially as a result of risks and uncertainties that we highlight in our quarterly and annual SEC filings. For the past year, our strategy to diversify our addressable market has been performing to plan and our first quarter performance gives us confidence that growth will continue. Demand especially is high in digital printing, and just getting off the ground in scanning and imaging. Our bottom line results for the first quarter were impressive, with net income and earnings per share growing well over 100% despite inflationary pressures, competition for labor, and the need to ensure that we have the materials and resources on hand to supply our products and services. Many other small companies took on heavy debt loads over the past several years and with the benchmark rates expected to rise, these companies are likely to be cash constrained in the near future. By contrast, our debt load is small enough to manage with the reward of our interest rate, required debt payments and our leverage ratio are all at all time lows and the cash on the balance sheet will remain at more than $50 million. As a result, we believe the demand for our services in digital printing will continue to remain high and that we still have a new market, we'll have new markets to approach with our services. As I mentioned earlier, we also believe that the growing need for scanning and imaging is likely to be at its early stages, getting documents out of boxes and into the cloud there anyone can reach them fast is becoming a necessity regardless of the industry, we think the diversity in the market for scanning and document conversion services may even rival that of our printing services. During the month of March, we noted a higher percentage of our large customers executing their plans to increase the work from office days. However, the hybrid work model seems to remain very popular among many of our customers. As customers cater to a hybrid workforce, it is essential that the important documents are converted to a digital data and hosted in a cloud platform. While document scanning is done by many, we bring special expertise to our customer for document search and indexing using our domain experience and our own proprietary software. Paper scanning is easy, but the ability to help customers with quick and easy search is complex and requires good technology and expertise. While this puts pressure on printing volume done at our customer sites it fits very well into our strategy to drive print volume through our service centers to leverage our equipment, economies of scale and cross trained workforce. As the needs of office printing evolve due to hybrid work schedules and digital workflow, ARC is in a great position to provide high quality outsource print services via 140 digital print center. Unlike in the past, we don't see customers using their capital to purchase print equipment for long term use. Many manufacturers have been reducing their production capacity of office and specialty paper which affects price and availability where they are possible, we have been passing down these cost increases to our customers to maintain our margin. In terms of building our base of new customers, our web, digital and social media marketing activities continue to generate good results. As customers work from home and search for new services, our ability to showcase our products and services online is a very important component of our marketing and sales efforts. Overall growth helped us drive gross margins up by 190 basis points, in spite of some pressures from inflation, supply chain issues, which manifested themselves primarily in the form of increased costs. As many of you know, historical cash flows in the first quarter are at their lowest level of the year due to the timing of sales and bonus payments, and this year was no different. Finally, we remain committed to returning shareholder value spending $2.4 million during the first quarter, primarily via our quarterly dividend payment. As we look ahead, we expect solid sales growth for the year just as importantly, we expect margins to remain strong and earnings to continue to grow."
}