{
    "symbol": "ARC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 22:56:03",
    "content": "  Operator: Good day, everyone, and welcome to the ARC Document Solutions 2022 Year-End and Q4 Earnings Conference Call. At this time, I would like to hand things over to Mr. David Stickney. On the call with me today are Suri Suriyakumar, our CEO and Chairman; our President and Chief Operating Officer, Dilo Wijesuriya; and Jorge Avalos, our Chief Financial Officer. Please note that today's call will contain forward-looking statements and they're only predictions based on information as of today February 22, 2023 and actual results may differ materially as a result of risks and uncertainties that we highlight in our quarterly and annual SEC filings. I'll now turn the call over to our Chairman and CEO, Suri Suriyakumar. And as I have reported in the past three quarters, our earnings are impressive. Best of all, we will continue growing in 2023. And of the more than 50 industry verticals we serve, 30 of them purchased more than $1 million of products and services from us in 2022. Architects, engineers, general contractors, subcontractors, homebuilders and property developers all purchased multiple services from us. Far from buying blueprints alone, these customers purchased environmental graphics, safety signage, on-site print services, scanning services, as well as equipment and supplies. This is a tremendous achievement by itself, but taken together with diversifying sales in all markets we serve, it represents a great progress in transforming our business. To give you an idea of what we went -- or what went into our success in 2022 and what the future holds, I'll now turn the call over to Dilo and Jorge for a review. Retail, office, education and construction segments drove sales for digital color graphics. If more customers return to their offices, we will like to see a moderate increase in print volumes. Our go-to-market plan for winning new customers and expanding the annual spend of existing customers, continue to focus on three actions. First, our demand generation programs have been designed to drive more qualified sales leads to our sales teams. Second, we focus on communicating and educating our customers regarding our new innovative products such as sensory graphics, flex graphics and Scan by the Box programs. Third, we focus on account-based marketing programs to expand our reach to different buyers within our customer companies. These actions all support ARC's overall growth strategy I outlined in August of last year, with the primary focus being on selling into more industry verticals. As Suri mentioned earlier, we service around 50 business verticals now and we continue to increase the types of customers we do business with us. Should economic conditions soften, the diversification of our market will help us remain relevant and continue to maintain our sales momentum. While Jorge will outline more details in a moment, I should also point out that our gross margins remained healthy in both the quarter and the year, thanks to our operational efficiency. Price escalation of print supplies has moderated, though we continue to pass on increases to our customers as a normal course of business. In all, our operations teams have been vigilant and proactive, contributing significantly to the results we have reported today. At this point, I'll pass the call to Jorge for a discussion of our annual financial performance. If we adjust for the $800000 drop in our Chinese joint venture during the fourth quarter, we would have posted top line growth for the seventh consecutive quarter. Without the adjustment, we still posted annual growth of 5% or $13.8 million. Overall, it expanded by 140 basis points. Of note, we expect average EBITDA per quarter to be $10 million or more in 2023, as well. As we grow earnings in 2023, cash flow from operations will also continue to increase. With regard to investing and financing cash flows, payments on finance leases will decline by approximately $2.5 million in 2023 and our need for capital expenditures remains low. Our debt, net of cash is $13.9 million which amounts to an $8.4 million reduction from prior year. In 2022, we continue to honor our commitment to return shareholder value. Taken together, we returned more than $10 million to shareholders in a single year, significantly more than we returned in 2021 or any other year in our history. Looking forward into 2023, we expect to do more of what we did last year. As I said in the beginning, with moderate sales growth, we could expand our margins, increase EBITDA, grow cash flow from operations and achieve a double-digit growth percentage in EPS. In closing, I want to assure you that we remain committed to returning shareholder value at a similar or possibly higher rate than we did in 2022. With that said, I'll turn the call back to Suri. For the year, our Chinese operations are providing about $7 million in revenue on an annual basis. Obviously, you could just divide that by 4 to give you the quarterly amount. How it compares to the past, if we look back five years, they used to be $30 million plus. And then you mentioned, you're still expecting growth in the top line in your guidance for 2023 or your commentary around 2023. So as we mentioned in our earnings release, if you take the primary segments of -- if you take a look at the outsource print that comes to our printing shops, especially for digital printing, we see most of our customers are continuing to stay strong. Yes, there will be some slowdown in certain customer segments as the industry makes its adjustments and so forth. However, we -- with our diversification program that we've embarked over the last three years or so we feel confident that many other customer segments will continue to grow in their marketing activities and so forth. There are many segments in the market that are continuing to grow, especially in the manufacturing, education, higher education, travel and leisure industry, the trade show -- trade show industry. Lots of companies are continuing to take part in marketing activities, trade shows, regional activities, large corporate meetings and so forth. The second area is the off-site services that we provide our customers, where we provide multiple types of services, where we provide all our hardware. Though that segment will continue to grow as more customers come back to the offices and change their business habit and so forth, we should see continued -- maybe a small growth will come from that segment. Document scanning segment has been fairly strong, because many of the companies are continuing to digitize their documents and bring their digital content into a workflow, that is -- that can support employees from remote places, as well as focusing on capabilities using mobile as a platform to access the information. So overall, we feel good about what we see for 2023, as the market -- there are certain markets which are a little volatile, certain industries which are volatile these days. But however, the transformation that we've embarked in the last two, three years is continuing to take place at ARC. We are focusing on multiple verticals, that are continuing to grow. So, 2023 should be a good year. That's â\u0080\u0093 today, we have outlined in our earnings release. As I mentioned on the script, with moderate sales growth, we feel we could achieve growth on most of our key -- or all our key metrics including, our gross margins and EPS. So we think with moderate sales growth, we will be able to better leverage our overhead, depreciation costs as it relates to equipment. And frankly, we also don't think we're going to be hampered like we were in 2022, with high inflationary increases. We've seen some of that in 2022, but a lot of that benefit or leveraging was taken away by higher labor or higher material costs. So when you look at those dynamics, then with moderate sales growth, you should be able to leverage your cost if you will, your cost structure hence, seen an improvement in gross margins. We think, that's very doable. Maybe, just another point to add is that, we have enough capacity in our stores. We have 140 stores and we have quite a bit of capacity to accommodate all that extra revenue, that we plan to bring in this year. So, obviously, we've had a nice 5% growth year-over-year and we've seen the COVID-related activities that we had in 2020, right, and there was a slight repeat of that work in 2021. But however, 2022 was a very clean year of all traditional digital printing and services that we provide normally to the customers. So, the sales growth for last year primarily, came from two specific areas. First, was our expansion of customer verticals, because we were able to expand our services to multiple verticals. Second, we were able to grow the number of customers using us in these verticals. And the third one, was we were able to sell additional services to the same customer as well. So the trend in 2023 obviously, it was -- it started very strong in the first quarter, the second quarter because we were comparing from the previous year's quarter. But going into 2023, we feel that we may not have the same amount of growth as 2022, but we should still have a nominal growth in 2023. From our company, we start seeing the activity flow increase in February and March is really the month that makes the quarter. And obviously, there's a lot of talk in the market about direction of the economy. So obviously, when the economy is a little weak, dictation is spending from customers do slow down. So in 2008 recession and so forth, we were very heavily onto construction-related activities and construction-related plain paper client printing that we used â\u0080\u0093 we did for the customer, but however today that segment is very, very small. So therefore, we feel very bullish about our transformation that we have â\u0080\u0093 that has happened over the last couple of years. And we feel that, even if there's a slowdown in certain segments in the industry, there are other certain industries that are going to be â\u0080\u0093 continue to do well. With regard â\u0080\u0093 obviously, you guys have done a great job with cash flow and managing your working capital. Yeah, we still have $10 million available in our stock repurchase program that extends out a couple more years. Obviously, that's about $8 million. So, overall as I said in my script those two combined we returned shareholder value of over $10 million in 2022, which was an all-time high for our company and we expect to meet that or beat that in 2023. But today probably that's about almost 20%, 30%. Rest of it comes from signage and other services that we provide; scanning, document scanning, on-site services, supplies that we provide them and digital color graphic services that we provide. And due to -- since we are able to see the types of customers that get busy in certain parts we have national data or we have centralized data available to look at and say, look at the types of customers that are getting busier in a certain period types of customers that visit our website, types of customers who ask for quotes right, when we have that data from our central marketing team, we realize okay there is this particular vertical or these three verticals that are getting stronger -- or busier or more active during a certain period of time, then we have good visibility as to what are they buying from us, right? So we have that data centrally available now, because we have a centralized marketing and a data management program within our organization here. So by looking at that then we know, okay, these are specific targets that or vertical that we want to focus. So we then do a little bit more research as to the buyers, the buyers' personas, what do they buy, price points and so forth, and we interview the customers, because we have this national presence, we are able to understand what did the -- why the manufacturing company in Michigan buy from us and compare it to why did somebody buy from Arizona, right. Because when we train our salespeople when we onboard and train our salespeople, there's nothing called specific training for construction anymore, because even within the construction customers, they buy different services from us than they purchased before. So we show them opportunities, because we have -- unlike in the past we have multiple buyers within the same office as well. So the IT staff versus the HR staff, the project managers, they buy different services from us. So the idea is to continue to train how to look for multiple miles in the same markets and that's where the diversification has been very, very helpful to us."
}