{
    "symbol": "BOXL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 21:59:05",
    "content": " Revenues for the 3 months ended September 30, 2022, were $68.7 million as compared to $61 million for the 3 months ended September 30, 2021, resulting in a 12.7% increase, primarily due to the inclusion of FrontRow and increased demand for our solutions in the U.S. FrontRow revenues for the 3 months ended September 30, 2022, totaled $5.6 million or approximately 8% of our total revenues. Gross profit for the 3 months ended September 30, 2022, was $21 million as compared to $15.8 million for the 3 months ended September 30, 2021. Total operating expenses for the 3 months ended September 30, 2022, were $14.6 million as compared to $12.3 million for the 3 months ended September 30, 2021. Other expense for the 3 months ended September 30, 2022, was a net expense of $2.8 million as compared to net expense of $1.4 million for the 3 months ended September 30, 2021. The company reported net income of $3.1 million for the 3 months ended September 30, 2022, as compared to net income of $729,000 for the 3 months ended September 30, 2021. Net loss attributable to common shareholders was $2.8 million and $412,000 for the 3 months ended September 30, 2022 and 2021, respectively, after deducting the fixed dividends to Series B preferred shareholders of $317,000 in both 2022 and 2021. Total comprehensive loss was $1.9 million and $1.3 million for the 3 months ended September 30, 2022 and 2021, respectively, reflecting the effect of foreign currency translation adjustments on consolidation, with the net effect in the quarter of $5 million loss and $2 million loss for the 3 months ended September 30, 2022 and 2021, respectively. Earnings per share per basic and diluted share for the 3 months ended September 30, 2022, was $0.04 and $0.03, respectively, compared to EPS per basic and diluted share of $0.01 for the 3 months ended September 30, 2021. EBITDA for the 3 months ended September 30, 2022, was $8.5 million as compared to $4.7 million EBITDA for the 3 months ended September 30, 2021. Adjusted EBITDA for the 3 months ended September 30, 2022, was $9.9 million as compared to $7.2 million for the 3 months ended September 30, 2021. Revenues for the 9 months ended September 30, 2022, were $179 million as compared to $141.2 million for the 9 months ended September 30, 2021, resulting in a 26.8% increase due primarily to the acquisition of FrontRow in December 2021 and increased demand for our solutions across all markets. On a constant currency basis, operating revenues increased 34% for the 9 months ended September 30, 2022, compared to the 9 months ended September 30, 2021. Gross profit for the 9 months ended September 30, 2022, was $50.5 million as compared to $37.2 million for the 9 months ended September 30, 2021. The gross profit margin was 28.2% for the 9 months ended September 30, 2022, compared to 26.3% for the 9 months ended September 30, 2021. Gross profit margin, adjusted for the net effect of acquisition-related purchase accounting, was 30% for the 9 months ended September 30, 2022, as compared to 28% as adjusted for the 9 months ended September 30, 2021. Total operating expenses for the 9 months ended September 30, 2022, were $46.6 million as compared to $34.2 million for the 9 months ended September 30, 2021. Other expense for the 9 months ended September 30, 2022, decreased approximately $0.6 million to net expense of $5.1 million, as compared to net expense of $5.8 million for the 9 months ended September 30, 2021. The decrease was primarily due to a gain of $0.9 million recognized upon the settlement of certain debt obligations in 2022 compared to a loss of $3 million recognized upon the settlement of certain debt obligations in 2021 and a $1.7 million decrease in the fair value of derivative liabilities, partially offset by an increase in interest expense of $4.7 million associated with increased borrowings under our credit facility. The company reported a net loss of $2.7 million for the 9 months ended September 30, 2022, as compared to a net loss of $7.2 million for the 9 months ended September 30, 2021. The net loss attributable to common shareholders was $2.7 million and $7.2 million for the 9 months ended September 30, 2022 and 2021, respectively, after deducting fixed dividends to Series B preferred shareholders of $952,000 in each period and the fair value revaluation deemed contribution of $367,000 following the redemption amendment with the Series B shareholders during the 9 months ended September 30, 2021. Total comprehensive loss was $13.2 million and $8.4 million for the 9 months ended September 30, 2022 and 2021, respectively, reflecting the effect of cumulative foreign currency translation adjustments on consolidation with the net effect year-to-date of $11.4 million loss and $1.7 million loss for the 9 months ended September 30, 2022 and 2021, respectively. The earnings per share loss per basic and diluted share for the 9 months ended September 30, 2022, was $0.04 compared to a loss of $0.12 per basic and diluted share for the 9 months ended September 30, 2021. EBITDA for the 9 months ended September 30, 2022, was $12.9 million as compared to $5.2 million of EBITDA for the 9 months ended September 30, 2021. Adjusted EBITDA for the 9 months ended September 30, 2022, was $16.3 million as compared to $14.1 million for the 9 months ended September 30, 2021. At September 30, 2022, Boxlight had $22 million in cash, $62.3 million in working capital, $49.4 million in inventory, $214.5 million in total assets, $59.2 million in debt and $46.8 million in stockholdersâ\u0080\u0099 equity."
}