{
    "symbol": "BOXL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 22:26:21",
    "content": " Revenues for the 3 months ended June 30, 2022, were $59.6 million as compared to $46.8 million for the 3 months ended June 30, 2021, resulting in a 27.5% increase, primarily due to the inclusion of FrontRow and increased demand for our solutions across all markets. Gross profit for the 3 months ended June 30, 2022, was $16.8 million as compared to $12.8 million for the 3 months ended June 30, 2021. Total operating expenses for the 3 months ended June 30, 2022, were $16.0 million as compared to $11.3 million for the 3 months ended June 30, 2021. The company reported net income of $26,000 for the 3 months ended June 30, 2022, as compared to a net loss of $2.2 million for the 3 months ended June 30, 2021. The net loss attributable to common shareholders was $0.3 million and $2.2 million for the 3 months ended June 30, 2022 and 2021, respectively, after deducting the fixed dividends to Series B preferred shareholders of $317,000 in both 2022 and 2021, and the fair value revaluation deemed contribution of $367,000 following the redemption amendment with the Series B shareholders in the second quarter of 2021. Total comprehensive loss was $4.6 million and $1.7 million for the 3 months ended June 30, 2022 and 2021, respectively, reflecting the effect of foreign currency translation adjustments on consolidation with the net effect in the quarter of $4.6 million loss and $0.5 million gain for the 3 months ended June 30, 2022 and 2021, respectively. Revenues for the 6 months ended June 30, 2022, were $110.2 million as compared to $80.2 million for the 6 months ended June 30, 2021, resulting in a 37.5% increase due primarily to the acquisition of FrontRow in December 2021 and increased demand for our solutions across all markets. Gross profit for the 6 months ended June 30, 2022, was $29.4 million as compared to $21.4 million for the 6 months ended June 30, 2021. Total operating expenses for the 6 months ended June 30, 2022, were $32.0 million as compared to $21.9 million for the 6 months ended June 30, 2021. Other expense for the 6 months ended June 30, 2022, decreased to $2.1 million to net expense of $2.3 million as compared to net expense of $4.4 million for the 6 months ended June 30, 2021. The company reported a net loss of $4.8 million for the 6 months ended June 30, 2022, as compared to a net loss of $7.4 million for the 6 months ended June 30, 2021. The net loss attributable to common shareholders was $5.5 million and $7.7 million for the 6 months ended June 30, 2022 and 2021, respectively, after deducting fixed dividends to Series B preferred shareholders of $635,000 in each period, and the fair value revaluation deemed contribution of $367,000 following the redemption amendment with the Series B shareholders during the 6 months ended June 30, 2021. Total comprehensive loss was $11.2 million and $7.1 million for the 6 months ended June 30, 2022 and 2021, respectively, reflecting the effect of cumulative foreign currency translation adjustments on consolidation with a net effect year-to-date of $6.4 million loss and $0.3 million gain for the 6 months ended June 30, 2022 and 2021, respectively. EBITDA for the 6 months ended June 30, 2022, was $4.4 million as compared to $0.5 million of EBITDA for the 6 months ended June 30, 2021. Adjusted EBITDA for the 6 months ended June 30, 2022, was $6.4 million as compared to $7.0 million for the 6 months ended June 30, 2021."
}