{
    "symbol": "NHTC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 05:58:03",
    "content": "  Orlando: Chris Sharng - President and Director Scott Davidson - Senior VP and Chief Financial Officer\n Greetings, and welcome to Natural Health Trends Corp Second Quarter 2022 Earnings Conference Call. Thank you, and welcome to Natural Health Trends' second quarter 2022 earnings conference call. Thank you, Michelle, and thanks to everyone for joining us this morning to discuss our second quarter 2022 financial results. In the second quarter we continued to face significant COVID-related disruptions as lockdowns and social restrictions, along with supply chain bottlenecks persisted in greater China. Despite these challenges, we generated revenue of $13.4 million, an increase of 16% compared to the first quarter of 2022. The increase over prior quarter can be attributed to a well-attended virtual event held in late June, as well as a promotional incentive to which our members strongly responded. Despite the general global economic downturn impacting many of our markets, we remain committed to the fundamentals of our business and to driving future growth through new local level promotional initiatives, ongoing leader development and training, technology advancements to enhance the user experience, and provide insights for improved business management and market expansion. In summary, we are pleased with the second quarter financial performance to achieve sequential topline growth and deliver bottom-line profitability due to our ongoing efforts to manage costs in alignment to sales. Total revenue for the second quarter was $13.4 million, an increase of 16% compared to a $11.5 million the first quarter of 2022 and a decrease of 17% compared to $16.2 million in the second quarter of 2021. As Chris mentioned, the sequential quarter increase in revenue was primarily due to a special virtual event and incentive held in June designed to encourage new member engagement. Gross profit margin of 74.6% decreased from 75.7% in the second quarter last year due to the impact of relatively fixed cost on a lower level of net sales, as well as a decrease in administrative fee revenue. The decrease in our SG&A from the prior year quarter reflects lower event costs as we held a major event in June 2021, as well as lower professional and credit card fees. As a result, operating income for the quarter was $215,000 compared to $385,000 in the second quarter last year. We recorded income tax provision of $207,000 for the quarter compared to $97,000 in the second quarter last year. Net income for the second quarter totaled $183,000 or $0.02 per diluted share compared to $229,000 or $0.02 per diluted share in the second quarter of 2021. Net cash used in operating activities was $1.2 million in the second quarter compared to net cash provided by operating activities of $134,000 in the second quarter last year. As returning capital to our stockholders remains a top priority, I am pleased to announce that on August 1, Board of Directors declared another quarterly cash dividend of $0.20 per share, which will be payable on August 26 to stockholders of record as of August 16. While this quarter represents a positive trend in top line improvement, we look forward to continuing to revitalize growth and deliver improved financial performance in 2022 and beyond."
}