{
    "symbol": "NHTC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 12:23:12",
    "content": "  Operator: Greetings, and welcome to the Natural Health Trends Corp. Third Quarter 2022 Earnings Conference Call. Thank you, and welcome to Natural Health Trends Third Quarter 2022 Earnings Conference Call. Thank you, Michelle, and thanks to everyone for joining us this morning to discuss our third quarter 2022 financial results. In the third quarter, results were adversely impacted by extended and ongoing COVID-related measures in China, the continued social restrictions, mass testing, surveillance and lockdown present challenges for consumer-facing businesses such as ours. For the quarter, we generated revenue of $11.7 million, a decrease of 12% compared to the second quarter of 2022. While not the outcome we hope to achieve, we are encouraged by positive signs of engagement as our team safely and cautiously meet as small local gatherings attend our virtual conferences and are following the well-structured online training system we put into full effect during the quarter. As a refresher, this new online training program incorporates company-sponsored product training and member-led business, motivational and leadership training, all in an effort to better support the ongoing development and engagement of our members. During the quarter, several markets embarked on incentive trips, including: our Peru members traveling to Punta Cana in the Dominican Republic; our European team traveling to Zadar, Croatia; our Russian team traveling to Lake Baikal; and our Taiwan team traveling to Yilan. Total revenue for the third quarter was $11.7 million, a 12% decrease compared to $13.4 million in the second quarter of 2022 and a decrease of 18% compared to $14.3 million in the third quarter of 2021. As Chris stated, the extended and ongoing COVID-related measures in China adversely impacted our results during the third quarter of 2022. Selling, general and administrative expenses for the quarter were $3.9 million compared to $4.1 million a year ago. As a result, operating loss for the quarter was $145,000 compared to operating income of $479,000 in the third quarter last year. We recorded an income tax benefit of $5,000 for the quarter compared to $45,000 in the third quarter last year. Net income for the third quarter totaled $47,000 or breakeven per diluted share compared to $471,000 or $0.04 per diluted share in the third quarter of 2021. As returning capital to our stockholders remains a top priority, I am pleased to announce that on October 31, our Board of Directors declared another quarterly cash dividend of $0.20 per share, which will be payable on November 25 to stockholders of record as of November 15."
}