{
    "symbol": "KVHI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-08 11:35:03",
    "content": " We wrapped up a very positive and exciting third quarter that was highlighted by solid financial results, the sale of our inertial navigation business, the launch of our new TracNet H Series, and we also completed a lengthy competitive process, which resulted in a five-year renewal of our U.S. Coast Guard contract. Excluding any contributions from inertial navigation, we recorded $35.2 million in revenue, up 2% from the third quarter of last year. Adjusted EBITDA of $4.1 million, non-GAAP EPS of $0.07 per share, and we ended the quarter with more than 6,800 airtime subscribers. Third quarter OpEx on a reported basis was $14 million, an 11% decrease versus Q3 of last year. As discussed during our call in August, we sold inertial navigation assets to EMCORE, which resulted in net proceeds of approximately $52 million. We recorded airtime revenue of $27 million, an 8% increase in comparison to the same period last year. With that, as Brent mentioned earlier, our third quarter revenue came in at $35.2 million, increasing $0.8 million from the $34.4 million recorded in the third quarter of 2021. Service revenue for the third quarter was $28.5 million, an increase of $1 million or 4% from $27.5 million in the third quarter of last year. This increase was primarily due to a $2.1 million increase in mini-VSAT broadband airtime revenue primarily offset by a $1 million decrease in content service sales, which was largely due to the sale of our radio business in April of this year. As Brent noted, airtime revenue grew to $26.7 million, or approximately 8% over the third quarter of last year and total subscribers passed 6,800. Product revenue for the third quarter was $6.6 million, a decrease of $0.2 million or 3% from $6.9 million in the third quarter of the prior year. This decrease in product sales was primarily due to a $0.4 million decrease in VSAT product sales and a $0.2 million decrease in TV land product sales, partially offset by a $0.4 million increase in maritime TV product sales. Operating expenses for the quarter were $14 million, down $1.6 million or 11% from the third quarter of last year. At the operating income level, these changes in revenue, margins and operating expenses resulted in a net loss from operations of $1 million which was a $2.5 million improvement compared with the $3.5 million loss recorded in the third quarter of 2021. However, last year's income included $7 million of other income due to the forgiveness of our PPP loan. After those adjustments, we had net income of $1.2 million compared with a net loss of $1.4 million last year. Cash provided by financing activities was $0.6 million and cash received from the sale of the inertial navigation business with $55 million, resulting in an ending cash balance of approximately $70 million which includes approximately $2.4 million of cash collected for inertial navigation customers after the sale and is, therefore, owed to EMCORE. With respect to our outlook for the full-year and our second quarter earnings release, I had said that we expected adjusted EBITDA to be between $11 million and $15 million. Our first half on a consolidated basis, including inertial navigation was $6 million, and with $4.1 million from continuing operations this quarter, that would give us $10.1 million year-to-date."
}