{
    "symbol": "NLY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 12:52:07",
    "content": " Consistent with the broader market, Annaly's portfolio was vulnerable to the exceptional volatility in this environment despite our efforts to defensively position our portfolio, experiencing an economic return of negative 12%, with a reduction in total portfolio size of roughly $5 billion to end the quarter at $84.4 billion in total assets. We are pleased to have announced the sale of our middle market lending portfolio to Ares this past Monday, the $2.4 billion transaction, inclusive of our on-balance sheet portfolio as well as assets managed for third parties follows the completion of a highly competitive process that is expected to be accretive to book value and validates the quality of our differentiated corporate credit portfolio. Book value decreased by $1.20 for the quarter, primarily due to lower other comprehensive income of $3.4 billion or $2.34 per share on higher rates and spread widening, and the related declining valuations on our agency positions as well as the common and preferred dividend declarations of $349 million or $0.24 per share, partially offset by GAAP net income of $2 billion or $1.37 per share. Consistent with the prior quarter, our multifaceted hedging strategy supported book value, providing a partial offset to the agency declines due to the basis widening mentioned above, with swaps, futures and MSR valuations contributing $1.98 per share to the book value during the quarter. GAAP net income also benefited from higher net interest income of $581 million compared to $361 million in Q4 2021, primarily due to premium accretion of $25 million compared to premium amortization of $219 million in Q4 2021 due to lower CPR, and higher net servicing income of $31 million compared to $27 million in Q4 2021 on higher average balances of MSR. These increases were offset by higher interest expense of $75 million compared to $62 million in Q4, primarily as a result of higher average securitized debt and repo balances as well as higher rates, higher net swaps expense of $63 million compared to $59 million in Q4 2021 on higher average notional balances, and higher G&A in the first quarter due to timing of payroll taxes and other compensation items. Additionally, to further enhance the firm's overall liquidity profile, we continue to focus on securing financing facilities and structures for our growing resi loan and MSR businesses, including a new $250 million facility for our residential credit group subsequent to quarter end."
}