{
    "symbol": "BEKE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-23 22:27:03",
    "content": " Our existing home transaction services continue to outpace the market according to data from the Beike Research Institute, nationwide GTV of existing home sales dropped 45% year-over-year in the second quarter. Whereas GTV of existing home transaction on Beikeâ\u0080\u0099s platform was on the RMB393.5 billion, down 14% year-over-year, or which existing home sales declined 41% outperforming the market throughout the second quarter. Amidst the market headwinds GTV on new home sales on our platform with RMB222.7 billion, down 55% year-over-year and up 15.6% quarter-over-quarter. Despite the short-term challenges, we expect a stable new home market with higher certainty in the long-term of   whether continue to strengthen our strategic focus and increase cooperation with high quality stay and a centrally owned developers iterate on risk control protocols, data products, and other value added products and services, while further reducing costs and enhancing efficiency. While our home renovation and furnishing business generated pro forma revenue of RMB1.37 billion, rising more than 10% year-over-year, and 58% quarter-over-quarter and our contractor sales reached close to RMB1.7 billion, meanwhile, reached organizational structure as well as strong rules and systems to support a better connection between home and emerging businesses. In particular, our net revenue from existing home transactions decreased by 42.5% to RMB5.5 billion in Q2 compared to RMB9.6 billion in the same period of 2021, primarily due to a 39.6% decrease in GTV of existing home transaction to RMB393.5 billion in Q2 from RMB652 billion in the same period of 2021. Our net revenue from the new home construction services decreased by 52% to RMB6.7 billion Q2 from RMB13.9 billion in the same period of 2021, primarily due to a 35.3% decrease in GTV of new home transaction to RMB222.7 billion in Q2 from RMB498.3 billion in that same period of 2021. Our net revenue from home renovation and furnishing were RMB1.0 billion in Q2, compared to RMB43 million in the same period of 2021, primarily because of the company completed the acquisition of Shengdu Home Renovation coordinated and the right business opportunities do it. Operating margin was negative 11% in Q2 compared to 4.6% in the same period of 2021, primarily due to: one, a relatively lower gross profit margin; and two, an increase of the percentage of total recurring operating expenses of net revenues in Q2 primarily due to decreased net revenues; and three, additional severance costs of RMB438 million incurred in the second quarter of 2022 compared to the same period of 2021. Partial to efforts were reflected in the improvement of the contribution margin of the new home transaction services, which was at 2 years high of 24% in Q2, despite still sluggish in new home market. Secondly, where weâ\u0080\u0099ll continue to make the investment in our 2 businesses, home renovation and furnishing services, and the Beike rental services, despite of the top market environment, we will especially make the necessary and sufficient investment is a home renovation and the rental services, which enjoys a much larger total addressable market compared to the housing transaction services. We have to set up an introduction of our policies, multiple cities so the sub-sequential recovery income leading indicators is including the number of new property listings, new home customer and all sorts of property tools as well as the agent competence in those cities, also saw the substantial recovery in the transaction volume region in the second half of 2022 ways by the various stages to continue using the easing policies to support the steady market recovery. Overall, according to Beike Research Institute, in the second quarter, the GTV for China new home sales market increased by 9.8% quarter-over-quarter, and the decline 45% year-over-year, a series of leading indicators monitored by Beike such as the home to impact number of new customers and a new listing under the price index, such as that the market expectation rebounded in May and June from the bottom. Same thing in Lianjia, the proportion of these new home transactions increased to nearly 38% in the first half of 2022 from 28% in 2020 that is certain that the existing home market will continue to recover our greater scale in the second half of the year. Regarding your second question, Iâ\u0080\u0099d like to say in the first half of this year, the national new home market was weak, both on the supply and the demand side, particularly up to 2 new home sales from the National Bureau of Statistics recorded a year-over-year decline of 36%. Another example is the   also reflect in the improvement of our contribution margin of new home business, which was at two years high opportunity 4% contribution margin in Q2, despite the still sluggish new home market, followed by this due to Q2 market recovery in the coming quarters."
}