{
    "symbol": "MICS",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-15 02:41:11",
    "content": " Our net sales were consistent for the 3-month period ended -- the 3-month periods ended September 30, 2022 versus 2021, with net revenues of $17.1 million compared to $17.4 million, respectively. Net sales for the 6-month period -- the 6-month period were $28.8 million versus $23.4 million, an increase of approximately $5.4 million and 23%. Our gross profit increased to $3.9 million compared to $3.3 million for the 3-month period ended September 30, 2022 versus 2021, an increase of approximately $600,000, primarily due to an increase in gross profit margin from 19.2% to 23.2%. There was an increase in the component cost -- sorry, there was a decrease in the component cost of one major customer's promotional item, and that contributed approximately 1.8 points gross margin points, so the remaining increase due to significant cost reductions to inbound containers from China, price increases to customers, and margin contribution from new products introduced into one major customer's consumer electronics department. Our gross profit increased approximately $7.1 million compared to $4.9 million for the 6-month period ended September 30, '22 versus '21, an increase of approximately $2.2 million. There was a decrease in the component costs, as we talked about earlier, the one major promotional item that contributed 1.6 margin points year-to-date with the remaining increase due to significant tariff reductions as the same as for the quarter, and that had to do with reductions in inbound containers from China, price increases to customers and margin contribution from new products introduced to the major customers' consumer electronics department. Operating expenses increased to approximately $3.4 million for the 3-month period ended September 30, 2022, as compared to approximately $2.6 million for the 3-month period ended September 30, 2021. We also had onetime costs of approximately $300,000 relating to our public offerings, NASDAQ uplisting, regulatory filings, change of control, which included increases in legal fees, professional fees, stock transfer fees and investor relations fees. Operating expenses increased to approximately $6.4 million for the 6-month period ended September 30, 2022, compared to approximately $4.6 million for the 6-month period ended September 30, 2021. The increase of approximately $1.8 million in operating expenses were primarily due to the following: we had increases in selling expenses of approximately $200,000 and is primarily due to royalty commission discretionary marketing expenses. Onetime costs, as we discussed early have approximately $400,000 year-to-date relating to our public offering, NASDAQ uplisting, regulatory filing, change in control, and this had to do with legal fees and professional fees, stock transfer fees and investor relation fees are related to this project. We also had onetime costs of approximately $200,000 relating to IT projects and product firmware update with the remaining increase due to variable expenses that have increased due to inflation. As a result of these activities, we recognized income from operations during the 3-month period ended September 30, 2022, of approximately $584,000 compared to income from operations of approximately $750,000 for the 3-month period ended September 30, 2021, representing a decrease of approximately $165,000. Income from operations for the 6-month period ended September 30, 2022, versus 2021 were approximately $731,000 and 260,000, respectively, representing an increase of approximately $471,000. We recognized net income of approximately $296,000 for the 3-month period ended September 30, 2022, compared to net income of $692,000 for the 3-month period ended September 30, 2021. But it should be noted that during the second quarter of the prior year, we had the benefit of $236,000 in onetime gains from the settlement of accounts payable with one of our factories with no similar gains during our first quarter ended September 30, 2022. We recognized net income of approximately $280,000 for the 6-month period ended September 30, 2022, compared to net income of $574,000 for the 6-month period ended September 30, 2021. And again, it should be noted that during the 6-month period, the prior year, we had the benefit of $236,000 in onetime gains from the settlement of that accounts payable with one of our factories of approximately $236,000 and also from the forgiveness of the payroll protection plan loan of approximately $448,000, with no similar gains during our first quarter ended September 30, 2022."
}