{
    "symbol": "MICS",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-23 15:23:03",
    "content": " We've started our new fiscal year 2023 with some encouraging results for our first quarter ended June 30, 2022, as compared to the first quarter ended June 30, 2021. But anyway, our revenues for the first quarter ended June 30, 2022, increased by $5.6 million to $11.7 million compared to $6.1 million for the first quarter of the prior fiscal year. There was a successful initial product set in the consumer electronics department of one of our major customers which accounted for approximately 56% of the revenue increase, with the remaining increase primarily due to another major customer who switched from direct import and requested earlier delivery that historically has been shipped in the second quarter. However, our gross profit margin increased by 120 basis points primarily due to the assortment of new products and mics that command higher gross profit margins and they were part of the initial product set in one major customer's consumer electronics department as we -- as I talked about earlier. While we did experience an increase of approximately $1 million in operating expenses, primarily due to inflationary warehouse distribution costs and some one-time logistics and project expenses of approximately $3 million -- $0.3 million sorry, an increase in onetime professional on the legal fees associated with the recent equity raise and NASDAQ Pump listing that was approximately $200,000 and bad debt reserve expense of approximately $200,000 but that's commensurate with the increase in revenue. So as a result of these activities, we recognized a $16,000 net loss for our first quarter ended June 30, 2022, compared to a net loss of $119,000 in the first quarter of the prior year. It should be noted that the first quarter of the prior year, we had the benefit of $0.5 million in onetime gains from the forgiveness of the payroll protection plan and a gain from related party receivables but we had no similar gains or one-time gains during the first quarter ended June 30, 2022. That allowed us to finance the excess inventory from the prior fiscal year due to global logistics as well as strengthening our cash position to $2.3 million as of June 30, 2022, compared to $1.4 million as of June 30, 2021."
}