{
    "symbol": "AZZ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-01-10 12:36:05",
    "content": " Those risks and uncertainties include, but are not limited to; changes in customer demand and response to product and services offered by the company, including demand by the power generation markets, electrical transmission and distribution markets, the industrial markets, and the metal coatings markets; prices and raw material costs, including zinc and natural gas, which are used in the hot-dip galvanizing process; changes in the political stability and economic conditions of the various markets that AZZ serves, foreign and domestic; customer-requested delays of shipment; acquisition opportunities; currency exchange rates; adequate financing and availability of experienced management and employees to implement the company's growth strategies. Metal Coatings generated another excellent quarter, with sales up 15.4% to over $133 million, and Infrastructure Solutions sales down 11%, at about $99 million. The Infrastructure Solutions segment delivered operating income of over $9 million, with operating margins improved 140 basis points, to 9.2% as compared to the prior year. Bookings or incoming orders in the third quarter were $248 million, a $53.6 million or 28% increase over the third quarter of the prior year. Third quarter fiscal 2022 sales were $231.7 million, $5.1 million or 2.3% higher than the prior year third quarter sales of $226.6 million. Year-over-year, for the third quarter, Metal Coatings segment sales were up $17.8 million, and were partially offset by lower sales in the Infrastructure Solutions segment, mostly in the industrial segment where we took significant actions to restructure the business in the middle of last year. Operating income for the quarter was $30.1 million compared with $27.9 million in the third quarter of the prior year, a $2.2 million or 8% improvement year-over-year. Year-to-date sales through the third quarter of fiscal 2022 were $678 million, a 5.4% increase from last year's third quarter."
}