{
    "symbol": "TAL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-04-29 15:07:05",
    "content": " In the fiscal quarter ending on February 28, 2022, we recorded $541 million in revenue, $0.6 million to $600,000 in GAAP operating income and $108 million in GAAP net loss attributable to TAP. In the fourth quarter of fiscal year 2022, net revenue totaled $541 million, representing a 60% decrease from $1,363 million in the fourth quarter of fiscal year 2021. Non-GAAP selling and marketing expenses, which excluded share-based compensations decreased by 82% to $113 million from $635 million in the same year ago period. Non-GAAP general and administrative expenses, which excluded share-based compensation expenses decreased by 31% to $203 million from $294 million in the same year ago period. Non-GAAP income from operations, which excluded share-based compensation expenses, was $0.8 million compared to non-GAAP loss from operations of $217 million in the same period of the prior year. Non-GAAP net loss attributable to TAL, which excluded share-based compensation expenses, was $108 million compared to non-GAAP net loss attributable to TAL of $89 million in the same period of the prior year. As of February 28, 2022, the company's deferred revenue balance was $188 million compared to $1,417 million as of February 28, 2021, representing a year-over-year decrease of 87%, which was primarily driven by the succession of K-9 Academic AST Services. Non-GAAP loss from operations, which excluded share-based compensation expenses, was $440 million for the fiscal year 2022 compared to non-GAAP loss from operations of $233 million in the fiscal year 2021. Net loss attributable to TAL was $1,136 million in the fiscal year 2022 compared to net loss attributable to TAL of $116 million in the previous fiscal year. Non-GAAP net loss attributable to TAL, which excluded share-based compensation expenses, was $961 million compared to non-GAAP net income attributed to TAL of $89 million in the fiscal year 2021. Looking forward, we expect learning services, learning technology solutions, and content solutions to have viable business models and we'll continue to invest into other new initiatives."
}