{
    "symbol": "APO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 14:18:08",
    "content": " If I look at Wheels Donlen, which is our fleet leasing platform, our initial investment in Wheels Donlen was $2 billion of AUM in the first quarter of 2021, pro forma for the announced acquisition of lease plan and other growth during the year we should close the year out at more than $7 billion of AUM across this platform. We launched this product with $15 billion of invested or committed capital, $10 billion off the same balance sheet, $1.5 billion from Sumi Trust, which we announced at the end of July, and a sizable commitment from an Asia-based institutional investor, and a high net worth money manager. We fully expect that the business plan that we laid out for all of you in October of past year is well within our reach of doubling AUM, doubling earnings and generating $15 billion of cash flow over the five-year period as per our Investor Day comments. We generated very strong quarterly inflows of $36 billion, including $24 million from asset management and $12 billion from retirement services, and the quarterly total would have been nearly $50 billion if included in the recent Fund X commitments that Marc cited. And across the platform, gross deployment totaled $40 billion in the second quarter and $175 million over the last 12 months, which demonstrates the scale and breadth of our investing capabilities. We've also issued nine CLOs and opportunistically purchased over $1 billion of investment-grade CLO tranches this year-to-date, for both our retirement services clients and other accounts with yields approaching 8% to 10% for AA to AAAB risk when considering original issue discounts that are infrequently available. Our hybrid value franchise, in particular, proved quite resilient with our first vintage appreciating 1% in the second quarter, and we held a final close for a Cohort 5, raising approximately $2 billion of capital in just a few short months. The attractiveness of Atheneâ\u0080\u0099s product suite in a rising rate environment was also in full display in the second quarter with record quarterly inflows of $12 billion, underwritten to attractive returns. Second quarter activity also included a $4.3 billion pension group annuity transaction with Lockheed Martin, the largest deal of its kind in the industry so far this year, and we see a strong pipeline for that channel heading into the back of the year. Over the last 12 months, our origination volumes totaled $100 billion, as we laid out in Investor Day, and included a higher proportion from proprietary origination platforms in the second quarter. We took an important step in the second quarter and announced the launch of our new Asia Pacific credit strategy with $1.25 billion in assets, including a $500 million anchor investment from Hostplus a large superannuation fund in Australia. Total AUM reached a new record of $515 billion at the end of June, increasing 9% year-over-year, driven by robust inflows from both asset management and retirement services. Inflows from our asset management business totaled $24 billion in the second quarter and included $8 billion of financing across several strategies such as credit strategies, Accord V, Accord Plus, total return and several yield managed accounts as well as some of our newer funds, namely AAA and Asia Pacific credit. Looking to the second half of the year, we expect AUM will benefit from approximately $20 billion of identified inflows before consideration of organic growth from Athene and other asset management fund raising. As part of our five-year plan, we expect to generate $15 billion of capital to use for shareholder value creation, including $5 billion to fund the base dividend, $5 billion for strategic growth investments, and $5 billion for dividend growth and opportunistic buybacks."
}