{
    "symbol": "APO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 12:22:04",
    "content": " For the third quarter, we reported fee-related earnings of $365 million, an increase of14% year-over-year or $0.61 per share and spread-related earnings of $578 million or $0.96 per share. As Noah already mentioned, record FRE of 365, up 14% year-over-year, record Apollo capital solutions revenues north of $100 million, as Martin will take you through. I'm very optimistic, just like with Global Wealth, where we like -- I think we're likely to exceed our $50 billion AUM target, we are likely to exceed our $500 million revenue target for Apollo Capital Solutions. As Marc noted, our investment has begun bearing fruit as we generated record quarterly transaction fees of $105 million in the third quarter, of which the vast majority is from capital solutions fees. Moving to FRE, we reported third quarter fee-related earnings of $365 million as previously referenced or $0.61 per share, which increased 14% year-over-year and reflected continuing momentum in our results after increases of 3% and 7% in the first and second quarters, respectively. As we look to 2023, we still expect fee revenue growth of more than 20%, driven by revenue accretion from new strategic growth initiatives, robust organic inflows from our retirement services clients, fees from additional capital for Fund X and continued progress in our capital solutions build out. Moving to our Retirement Services segment, we generated SRE of $578 million or $0.96 per share in the third quarter, which represents a net spread of 120 basis points  as a percentage of average net investment assets. Normalizing our alternative returns to 11% and excluding certain notable items, SRE, as Marc noted, was $598 million in the third quarter, translating to a normalized net spread of 124 basis points. We've been a beneficiary of this rising rate environment with higher short-term interest rates generating approximately $100 million of incremental SRE from our net floating rate income in the first 9 months versus the comparable period of 2021, with $60 million of this increase or $0.10 a share in the third quarter. Lastly, our business generates a substantial amount of free cash flow, and we expect to deploy $15 billion of capital through 2026 in strategic growth investments, funding the base dividend and both growing the base dividend and opportunistically repurchasing shares. In the third quarter, we spent approximately $200 million of capital on HoldCo investments to drive future FRE growth as well as approximately $50 million on share repurchases."
}