{
    "symbol": "APO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 14:56:02",
    "content": " Additionally, a variety of funds and manager accounts across the yield strategies that are currently raising capital, or will be later in the year similar to our Accord series as well as a variety of perpetual products, as Marc mentioned, in the global wealth channel, including the non-traded BDC, non-traded REIT and two interval funds. Zooming in though, it's clear that Athene success is driven more than just the industry tied expanding distribution, differentiated asset origination and ample capital resources to support that robust growth, which has allowed us to generate record flows while writing business at compelling spreads. As Marc mentioned, capital solutions fees reached a record quarterly $142 million in the fourth quarter, bringing full year revenue to $414 million, up approximately 40% year-over-year, an incredible result amid a turbulent capital markets backdrop, highlighting the quality of our team and the capabilities we've built. In retirement services, normalized net spread reached 140 basis points and 123 basis points in the fourth quarter and for the full year '22, respectively, well above our initial 110 to 115 basis point guidance as the higher interest rate backdrop, more interesting investing climate, and robust organic growth trends drove upside to our expectations. The bulk of this growth should be driven by management fees, resulting from a variety of new strategic growth initiatives that Marc and Jim walked through, robust organic inflows from Athene, strong capital deployment in yield and hybrid strategies, and additional capital raised for Fund X. And as ADIP2 comes online, we expect greater utilization of third party capital to support incremental growth, likely double 2022's level or approximately 40%, which will make the business even more capital efficient than it already is today. As a reminder, we expect to generate $15 billion of capital to invest over 2022 to '26, including $5 billion to fund the base dividend of $1.60 per share, $5 billion for additional capital returned via opportunistic buybacks and dividend increases and $5 billion for strategic growth investments. And the choice is keep 100% of the business on the books, realize the growth in SRE and deploy our own capital, as thatâ\u0080\u0099s Atheneâ\u0080\u0099s balance sheet capital, or allocate a portion of the business to sidecars and essentially receive a fee for fronting that at Athene, receive FRE at Apollo for managing that and allow investors to earn the spread."
}