{
    "symbol": "ALIT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 17:28:04",
    "content": " And we've recorded $958 million in cumulative BPaaS bookings since the first quarter of 2021, putting us well on the path towards $1.3 billion in bookings by year end 2022. Taken all together with the revenue visibility we have into the next six months, we are reaffirming our full year revenue growth projections of 6% to 7% and adjusted EBITDA guidance of $650 million to $662 million. As I mentioned earlier, we have sold almost $1 billion in BPaaS bookings, since the first quarter of 2021 and we are now on track to realize over $500 million in BPaaS revenue by year-end. Specifically in the second quarter, we signed $234 million in BPaaS bookings, which puts our first half total at $356 million, more than halfway to our full year goal of $680 million to $700 million. We recognized $128 million in BPaaS revenue, up 36% from last year with BPaaS now accounting for 17.9% of revenue, up from 14% a year earlier. On a total contract basis, BPaaS bookings for the second quarter, were $234 million and for the first half totaled $356 million, which is tracking ahead of our $680 million to $700 million target for 2022. On a year-over-year basis, second quarter total revenue increased 6.4% to $715 million and total revenue excluding our legacy Hosted business, increased 6.7% to $705 million. And adjusted EBITDA increased 6.5% to $147 million, with adjusted EBITDA margins at 23.9%. Second quarter revenue decreased slightly by $1 million to $91 million due to a 3.3% decline in project revenue due to timing delays on three large projects that we anticipate will start by year-end, partially offset by stronger-than-anticipated recurring revenue. Adjusted EBITDA was a loss of $3 million and adjusted EBITDA margin was negative 3.3%, as we made the strategic decision to retain key accredited talent to support a strong pipeline and book of business to be realized later this year. We had previously provided a 2022 outlook of $3.09 billion to $3.12 billion or 6% to 7% revenue growth, adjusted EBITDA of $650 million to $662 million and adjusted diluted EPS of $0.54 to $0.60. For the third quarter, we anticipate revenue of $735 million to $750 million and adjusted EBITDA of $115 million to $125 million. And for the fourth quarter, we anticipate revenue of $915 million to $930 million and adjusted EBITDA of $245 million to $255 million. Second, on adjusted EBITDA we are continuing to make investments in our business with the remaining $15 million of the $38 million total investment to be completed in the third quarter."
}