{
    "symbol": "ALIT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 11:53:06",
    "content": " As a reminder, today's call is being recorded and a replay of the call will be available on the Investor Relations section of the company's website. And now, I would like to turn it over to Greg Faje, Head of Investor Relations at Alight to introduce today's speakers. Earlier today, the company issued a press release with first quarter 2022 results. Before we get started, please note that some of the company's discussion today will include forward-looking statements. These factors are discussed in more detail in the company's filings with the SEC, including the company's 10-K filed with the SEC. Also throughout this conference call, the company will be presenting non-GAAP financial measures. On the call from management today are Stephan Scholl, CEO; and Katie Rooney; CFO. As I've said before, two of the most important aspects of people's lives are their health and financial wellbeing, and the pandemic had a hugely negative impact on both for so many workers. The Alight Worklife platform brings together all aspects of physical, mental, and financial wellbeing, positioning Alight to be one of just a few enterprise-wide platforms that companies can rely on. When we combine the simple and seamless technology experience of the Alight Worklife platform, with the data and analytics of our content layers and our global delivery capabilities, we can power more confident decisions for employees and provide companies with the information they need to make smarter decisions around their people, their most important asset. That approach is resonating in the market and continuing to see momentum with major global brands like Navistar, Shell and Sartorius, joining our enviable client roster. In fact, one of our largest fortune 50 clients recently shared something with me that, I think, really captures the value that we bring. She told me that previously their strategy was to offer a wide variety of programs to meet every employee's needs, but it was overwhelming and people weren't getting the most from the investments the company was making. Now, they are using the Alight Worklife platform, which will drive proactive, personalized communication to increase the engagement with their key programs. During the first quarter, we signed $122 million in BPaaS bookings, which is 205% higher than last year's $40 million. And we recognized $114 million in BPaaS revenue, up 23% from last year and now accounts for 15.7% of revenue, up from 13.5% a year earlier. We continued to make significant investments in the business, including in the upcoming go life of the key federal contract. In technology, to drive the Alight Worklife platform development, including our recent rollout to more than 450 clients. As a result of these critical investments, employer solutions, gross profit margin declined to 32.7%. At the same time, we continue to generate strong annual cash flow, which reflects the strength of our foundational business and provides us with financial flexibility to do bolt on M&A. Taken all together, 2022 is off to a solid start, and we believe we are well positioned to deliver on our commitments for the year and are on our way to 10% revenue growth in 2023. What we offer for clients is a differentiated approach to human capital management, an approach focused on leveraging data to drive outcomes. An Alight Worklife is offered in four tiers, starting with the most foundational level that gives users access to our robust cloud-based content layers, and then moves all the way up to the highest tier that adds even greater analytics capabilities to measure ROI and employee outcomes. Companies can layer in various content through the addition of our modular, cloud-based solutions for health, wealth, payroll, wellbeing, clinical, and retiree health. Most importantly, the data within the content layer allows us to deliver a highly personalized experience to meet the specific needs and circumstances of our users and their family members. Some of these services include one-on-one help to navigate important life moments, like having a baby, talking with a nurse about managing a critical illness, or leveraging a financial advisor to prepare for retirement. We believe our approach is powerful, and when it comes down to it, the reason our clients buy from us are threefold. First, we have an incredibly strong core business with a long proven track record of serving some of the largest, most complex clients in the world, including over 70% of the Fortune 100. Secondly, because of our core business, we have approximately 200 million interactions from more than 30 million users and their family members, which provides us with an enormous data set that underpins our platform. And lastly, this data together with our platform, allows us to drive more confident decisions and better outcomes. The multinational Fortune 50 client, I mentioned earlier already has some more than 4 million interactions yearly across its thousands of employees and offers a wide range of wellbeing programs to meet employee needs but few employees are actually using these programs. First, Alight Worklife provides one integrated experience that engages the employee in actions that drive physical, financial and emotional wellbeing. Second, we can leverage that data to personalize the content delivered through the platform with prompt's for the next best action to drive outcomes and motivate employees with the programs most relevant to them. First, its employees were having difficulty defining the best benefits resource at the right time, which led to poor health outcomes, care avoidance, reduced productivity and engagement and increased claims expenses. Second, this client did not have high-touch concierge health services, which left the company at a recruitment and retention disadvantage in today's highly competitive market for talent. To address these challenges, we will provide the Alight Worklife platform paired with our health cloud solution and this combination helps us meet these challenges head on for our client. And this is why we believe we are well on our way to our goal of 1.3 billion in BPaaS bookings by year end, which allows us to reaffirm our 22 commitments and gives us, confidence in our path to 10% growth in 2023. With our strong bookings as of March, we already had more than 85% of projected 2022 revenue under contract, which gives us confidence in reaffirming our 2022 outlook. First for employer solutions first quarter revenue grew 6.1%, which reflects a combination of acquisitions, volumes and net commercial activity. Recurring revenue increased 6.9%, which was partially upset by a 1.9% decline in project revenue. Adjusted EBITDA increased 4.4% to $142 million, and adjusted EBITDA margin decreased 40 basis points to 22.8% as we continue to invest in our business. Turning to our professional services segment, first quarter revenue decreased slightly to $90 million due to a 4.8% decline in project revenue, partially offset by 3.4% growth in recurring revenue. Adjusted EBITDA was flat, and adjusted EBITDA margin was unchanged at zero percent. A quick note on our Hosted segment, as the plan runoff continues we have one remaining client with approximately $40 million in annual revenue whose contract ends in 2023. On March 31st, our cash and cash equivalents were $326 million and our total debt was $2.9 billion. First, we're focused on ensuring a successful go-live for the federal contract ahead of its targeted launch in the second half of the year. Second, in products and technology, we are investing to support the ongoing development of our Alight Worklife platform and mobile app as well as the supporting content clouds and we are integrating the clinical navigation expertise we bought with consumer medical. Concurrently in our commercial go-to market efforts we are hiring market makers and solution architects to go after the transformational deals that demonstrate the power of our offerings, as well as investing in demand generation and sales talent. Third, we remain cautiously optimistic about a project revenue rebound in professional services. With over 85% of 2022 revenue under contract, which is seasonally weighted towards the fourth quarter and our known investment timing we believe EBITDA growth will be more weighted to the fourth quarter. Given this visibility, we are reaffirming our 2022 outlook and believe that we are on our way to 10% revenue growth in 2023. Katie or Stephan, I guess maybe Katie you reaffirm the EBITDA guidance despite the additional investments. We talked a bit at the end of the year about investments we were making this year, and I think it's just important these were anticipated investments, but I think being able to quantify and help kind of ensure folks understand the benefit of those investments and the timing of them is really what we're trying to articulate here. So I think the – the point is we have a path forward to hitting our guidance with the investments, and those will become tailwinds as you think about kind of exiting the year into 2023. And then just, congratulations because obviously a lot of folks are seeing cost headwinds, things like that. Honestly, our team's doing an incredible job trying to manage that every day. If you think about, we've talked a little bit about the Professional Services business about some of the call centre activity. We do have provisions in place where when you think about kind of the employer cost index, we put in increases if they're above a certain threshold say we call it 3% on an annual basis, and so that helps us offset some of that pressure as well. I was curious, it sounds like the Thrift Savings contract is a little bit ahead of schedule in development implementation, which is great. Particularly if you think about our partnership with Wipro, right, that's a contractual agreement with kind of that – the price inflation locked in. And so that provides a natural hedge, sometimes the upside, sometimes the downside but FX was not kind of a material driver for us given that contract. I don't think there is any – I mean, obviously there's nothing of that significance. Remember we called out some great contract wins last year with Navistar, PWC, I mean, the team is doing a fantastic job, bringing those contracts live this year and into next year. So, that obviously will help later in the year. We have some big deals in the pipeline, you saw obviously great BPaaS bookings for the first quarter. But remember last year, right, as you think about some of the seasonality, we had, a bigger Q2. So, again, I'd go back to we're on track for our guidance on BPAs bookings of the $680 million to $700 million. I want ask on the project revenue some line of site there in terms the rebound in NPS, Katie, I think, you referred to. Yes, because I mean, again, overall, I think, that was a great news seeing close to 7% growth and recurring revenue was obviously where we've been focused. But if you think about some of the names Stephan mentioned on the call, like the Genuine Parts Company, right, that was a nice Professional Services win that we've been talking about in terms of kind of the pipeline building. And, I think, the thing on the PS side is, as I said before, while it's a Professional Services business in the past, largely around implementing Workday, in the last 18 months, I've shifted that focus to be more one, a light focused which Workday is a piece of that. So the Professional Services business is going to get some good tailwinds and helping us execute on that broader, global, integrated strategy. My quick follow-up, just thinking about this earnings season, we've heard a lot from some of the service or the outsource guys that there seems to be a pickup in demand in enterprises, small businesses, you name it all looking for help on the servicing side. If you look at all my top clients, I've said this now for two years, unlike the ERP world, and supply chain world, which has had 10, 15 years of consolidation, the human capital management arena, hasn't. It's kind of the big holdout where people are now realizing its fragmented systems, they're geographically based. And then for us, it's the platform piece, the Worklife piece, where people are starting to see the consolidation of building the relationship with their employee on our Worklife platform. And then we're the ones responsible as Alight to take the content pieces of health, and wealth, and wellbeing, and retirement and payroll and then consolidating that into one enterprise approach on the platform. So people are moving fast, because not only is it a cost takeout opportunity for them in consolidation, it's also just a better way to serve their employees better during this last couple of years. Thank you, ladies and gentlemen, we have reached the end of the question-and-answer session and I would like to turn the call back to Stephan Scholl for closing remarks. We look forward to the chance to meet with many of you at conferences, such as the JP Morgan TMT Conference in May, the Baird Consumer, Technology & Services Conference in June and at other investor events in the months ahead."
}