{
    "symbol": "HBM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 14:43:10",
    "content": " In this presentation today, I'll give a brief overview of our first quarter financial and operating results, discuss highlights from our recent annual reserves and resources announcement and provide an update on the ongoing progress at Copper World and our other growth initiatives. Our consolidated copper production in the quarter was 24,700 tonnes, in line with our expected quarterly cadence for the year as we anticipate significantly higher copper grades in Peru later this year. Consolidated sustaining cash cost increased to $2.29 per pound in the first quarter compared to $1.95 in the fourth quarter due to the same reasons affecting cash costs, but partially offset by lower sustaining capital expenditures and capitalized exploration. Operating cash flow before change in noncash working capital was $77 million during the first quarter, reflecting a decrease from the fourth quarter, primarily as the result of lower copper gold and zinc sales volumes in Manitoba, partially offset by higher silver sales volumes and higher base metal realized prices. Given the elevated inventory levels in Manitoba at the end of the first quarter and the positive expected quarterly production cadence, our cash balance is forecasted to grow throughout the remainder of the year based on current commodity prices. As previously disclosed, full year production in Peru is expected to benefit from significantly higher grades in the fourth quarter of 2022, and we have affirmed or reaffirmed our 2022 production guidance for Peru. Peru combined unit operating costs in the first quarter were within the guidance range, but higher than the fourth quarter due to continued inflationary pressures on consumables and energy costs and fewer tonnes of ore milled due to the planned mill maintenance shutdown. Peru's cash cost in the first quarter were $1.54 per pound of copper, higher than the fourth quarter, primarily due to higher milling costs and lower copper production. Copper production increased by approximately 4% quarter-over-quarter, whereas gold, zinc and silver production decreased by 7%, 4% and 13%, respectively, due to expected grade variability and lower ore mill. Ore mined at the Manitoba operations in the quarter was lower than the fourth quarter due to employee absenteeism caused by COVID-19, unplanned maintenance requirements of the ore handling system that temporarily affected hoisting ability at Lalor and planned lower production on the 777 as the mine approaches closure in June. Manitoba combined unit operating costs in the first quarter were within the guidance range, but 5% higher than the fourth quarter, primarily due to higher propane usage during the colder winter coupled with continued inflationary cost pressures for bulk commodities and fuel and lower tonnes processed."
}