{
    "symbol": "HBM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 11:47:06",
    "content": " Our consolidated copper production in the third quarter was 24.5k tonnes, a 5% decrease compared to the second quarter due to the closure of 777, but partially offset by higher copper grades in Peru. Consolidated gold production was 53.2k ounces, a 9% decrease due to the closure of 777 and slightly lower gold grades in Peru, but partially offset by significantly higher grades at Lalor and higher recoveries in Snow Lake in Peru. This significant improvement was primarily a result of lower on-site costs in Manitoba, partially offset by higher on-site costs in Peru, higher treatment and refining charges, higher freight costs and lower consolidated copper production with the closure of 777. Our Peru operations benefited from higher copper grades and higher molybdenum recoveries, partially offset by lower throughput due to a planned semiannual mill maintenance program during the third quarter. Production of copper and molybdenum was higher than the second quarter, while production of gold and silver was lower primarily due to slightly lower precious metal grades. Third quarter combined unit operating costs in Peru were 9% higher than the second quarter, primarily due to continued inflationary pressures on fuel, consumables and energy costs. As a result of ongoing inflationary cost pressures and the additional mill maintenance in the fourth quarter, full year unit operating costs in Peru are expected to be near the top end of the 2022 guidance range. Peru's sustaining cash cost declined by 6% compared to the second quarter, mainly due to the same factors affecting cash costs, offset by slightly higher sustaining capital expenditures and royalties. Costs are expected to decline in the fourth quarter, but due to continued inflationary pressures, we expect the full year combined unit costs in Manitoba to exceed the upper end of the guidance range by approximately 5%. Gold cash cost in the second quarter were $216 per ounce higher than the second quarter, primarily due to lower byproduct credits as gold revenue continues to increase and become the largest contributor to total Manitoba revenue. And it actually -- we're looking to the potential earlier commissioning of the gold recovery, I mean, the copper recovery project in Constantia because it's tied to tying in some finalized pumps at the end, and that was originally going to be later on in the year and that will be pulled forward now that we've shifted those shutdowns ahead by a couple of months."
}