{
    "symbol": "SIVB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 20:25:06",
    "content": " Your line is open. So, if you start to see those rates play out on the commercial banking side, we're seeing kind of what we're seeing now which is we believe there's going to be some softness in the venture capital levels. Your line is open. So, in the quarter if there's -- if you think about four sources of funds flow, you've got venture capital, public funds, international, which isn't an in the US venture capital numbers, obviously, and then private equity. And I don't think it's -- personally I don't think it's going to be that far off, a quarter or two quarters out because I think the public markets in my view are going to be soft at these levels maybe a little bit higher for a little while. I still think it's going to take time to get to our assumptions of 60% deposit beta that we're using at least, for our net interest income guidance. Your line is open. Your line is open. But Dan and the team are working on ensuring that we're as protected as we can be if rates – I know, it's funny we're talking about potential rate decline, when we're just not having really seen the rate increases, but you have to think that way being prepared for that. And then if I may squeeze in a final follow up on your comments around the proactive interest rate risk management and sort of in that scenario, I mean, it's impressive like in this quarter where we've seen many banks, setting aside the larger ones where there's a direct impact to the regulatory capital and buyback capacity. So especially with the amount of liquidity that came in last year, being able to protect again, what would have been a higher rate environment that's not now played out, which we think even though it's not counted for regulatory capital, it's still important to be able to manage capital from a strength perspective all-in. And even as we're thinking about the higher rate environment today that's what Greg was talking about, thinking through how to sustain the rate environment that we're seeing today and to be able to protect against downside risk is the shift in how we're starting to think about things. Your line is open. During the quarter, I think there's been a lot of investor concern or disconcern that higher rates would really have a detrimental effect on private equity venture capital investments and need for capital call lending. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}