{
    "symbol": "BCEL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-29 20:36:02",
    "content": " From the platform, we've generated a robust pipeline led by ATRC-101, which as we'll discuss later, has demonstrated durable anti-tumor activity in the ongoing Phase 1b trial, and which we believe validates the ability of our platform to identify active tumor targeting antibodies with therapeutic potential. Slide 21 focuses on the durability of tumor response observed by cancer type for all patients treated with ATRC-101, a small therapy or in combination with pembro and whose tumor was target positive. As shown by the different line colors depicting different cancer type, durable activity is seen across multiple tumor types, including melanoma, non-small cell lung cancer, head and neck cancer, colon cancer as well as breast cancer patients who had progression-free survival documented at study day 210. Yes, I probably just add to that, Roger, that I think given the heterogeneity of these patients, different tumor types and the sort of open-label nature of the trial, I think we certainly need to have more patients before we could really draw conclusions about the efficacy or the activity that we're seeing and how it compares with standard of care. But clearly, we'll need more patients, and that's why we're continuing to enroll adding additional centers, and hope to have sufficient data by the end of this year to really be in a position to make a decision about whether and where to go to Phase 2 or ATRC-101. I think what we're looking at is for response rate and disease control to give us an idea of the signal and help us prioritize which indication is most likely to be seeing, driving some kind of benefit from being treated with ATRC-101, and that sets the stage related for the Phase 2 study that John was talking about, where there in a more formal way and ideally in the controlled fashion, appropriate control, we would be assessing what a true treatment effect would be for Phase 3 in order to appropriately design the Phase 3 trial."
}