{
    "symbol": "CUTR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 17:44:04",
    "content": " During the period, total revenue for the third quarter was $62.8 million, representing approximately 17% growth on a constant currency basis. Our results were further bolstered by the contribution of more than $1 million from our AviClear product, our new acne product and procedure with 2 quarters of limited commercial release in North America now under our belt. North America delivered 23% capital equipment constant currency growth and posted sequential growth over the second quarter of 2022, a first for this business in the seasonally slower third quarter. At the close of third quarter 2022, we actually had greater than 160 active devices in the field treating over 600 new patients throughout the period as patient volumes ramped steadily over the quarter, generating procedure revenues of approximately $1 million. Total revenue for the third quarter was $62.8 million compared to $57.4 million for the same period in 2021, representing an increase of approximately 9%. International capital equipment revenue for the third quarter was $15.6 million, up 36% as reported and up 50% in constant currency from the third quarter of 2021. Recurring revenue, defined as our consumables, global service, skincare and AviClear product lines was $21.8 million in the third quarter, down 13% as reported and down 2% in constant currency. The decrease over the prior year was driven by skin care revenue of $9.4 million, down 36% as reported and down 21% in constant currency as well as services revenue of $6.3 million, down 6% as reported and down 1% in constant currency. Non-GAAP gross profit for the third quarter of fiscal 2022 was $34.8 million with a gross margin of 55.4%, representing a decrease of approximately 290 basis points compared to the same period last year. Excluding 130 basis point impact due to the acne program and a 240 basis point impact from foreign exchange headwinds, the non-GAAP gross margin in the third quarter would have been 59.1%, an approximately 80 basis point improvement over the prior year. Non-GAAP sales and marketing expenses for the third quarter of 2022 were $23.9 million compared to $17.9 million for the same period last year, driven by continued expansion in our sales force, higher commissions, increased travel as well as $6.3 million in expenses associated with AviClear. Non-GAAP R&D expenses for the third quarter of 2022 were $5.8 million compared to $4.7 million for the same period last year, driven by increased investments in AviClear and additional clinical studies. Finally, non-GAAP G&A expenses for the third quarter of 2022 were $7.1 million compared to $5.7 million in the same period last year, driven by an expansion in our headcount. For the third quarter of 2022, our non-GAAP operating income, which we refer to as adjusted EBITDA was a loss of $2 million compared to a profit of $5.1 million in the prior year period. Excluding acne program impacts of $7.9 million for the third quarter of 2022 and foreign exchange headwinds over the prior year of $3.1 million, adjusted EBITDA would have been $9.1 million. The full year impact of these foreign exchange headwinds is expected to be more than $17 million, implying a constant currency growth of 18% to 20%."
}