{
    "symbol": "CUTR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 22:21:05",
    "content": " Overall revenue for the first quarter was $58.0 million, representing approximately 17% growth over prior year as reported and 21% on a constant currency basis. Recurring revenue, defined as the combination of Skincare, Consumable Products and Service, was $21.5 million in the period, an increase of 1% over prior year as reported, but representing a 7% growth on a constant currency basis. Finally, on Skincare, our revenue for the quarter was $11.6 million, a decline of 5% from the prior year on an as reported basis, but also representing growth of 4% versus prior year on a constant currency basis. Our sales for the first quarter were $58.0 million compared to $49.7 million for the same period in 2021, representing an increase of approximately 17% on an as reported basis. International Capital Equipment revenue for the first quarter was $13.8 million, up 20% as reported and 27% in constant currency from the first quarter of 2021. Recurring revenue, defined to include our Consumables, Global Service and Skincare product lines, was $21.5 million in the first quarter, up 1% as reported and up 7% in constant currency. Excluding acne costs of $0.9 million, non-GAAP gross margin in the first quarter was 57.3% and approximately 90 basis points improvement as compared to the same period last year. Non-GAAP sales and marketing expense for the first quarter of 2022 was $23.5 million compared to $13.5 million for the same period last year, driven by continued expansion in our sales force, higher commissions, increased travel as well as expenses associated with the launch of AviClear. Non-GAAP R&D expense for the first quarter of 2022 was $5.5 million compared to $3.8 million for the same period last year, driven by increased investments in AviClear and additional clinical studies. Rounding out our operating expense commentary, non-GAAP G&A expense for the first quarter of 2022 was $7.1 million compared to $6.2 million in the same period last year, driven by inflation and an expansion in our head count. For the first quarter of 2022, our non-GAAP operating income commonly referred to as adjusted EBITDA was a loss of $3.8 million compared to a profit of $4.6 million in the prior year period. Based on how we see 2022 evolving, we are reiterating our original revenue guidance of $255 million to $260 million, but at the updated FX rates, implying underlying constant currency growth of approximately 13% to 15% and increase from our prior constant currency growth rates of 10% to 12%."
}