{
    "symbol": "ANIK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 20:31:04",
    "content": " We accomplished much this quarter, including reporting the exciting results from the conclusion of our third Phase III clinical trial for our next generation OAP management product, CINGAL making significant progress towards completion of enrollment in the pivotal Phase III clinical trial for HYALOFAST, our single stage cartilage repair product, and receiving great surgeon feedback during the limited launch of our X-Twist Fixation System for sports medicine, soft tissue repair. Third quarter revenue was $43 million up 2% from the same period last year, driven by growth in joint preservation and restoration, which was up 6% and by last time buys of certain non-core, non-orthopedic products in the quarter. While staffing and supply chain issues remain headwinds across our portfolio, we continue to benefit from our newer products such as Tactoset as well as from our market-leading HA-based OA pain management solutions, with multi-injection ORTHOVISC and single injection MONOVISC in the U.S. and internationally as well as our next generation CINGAL product currently only sold outside the United States. With our transformational strategy, we are leveraging Anika's more mature and profitable OA Pain Management franchise to invest in high opportunity adjacent spaces, including the larger and faster growing joint preservation market, where we are establishing a strong foundation for our multi-year growth strategy. While we see strong demand and potential across X-Twist and our other new joint preservation products, the supply chain has constrained the growth that we expected to see this year, but we are on a path to deliver steady supply for the full launch in early 2023. Our joint preservation and restoration revenue increased 6% to $11.8 million on improved procedural volumes year-over-year, but that growth was limited in the period due to the market dynamic Cheryl described, impacting the prioritization of elected procedures, as well as supply chain challenges. We are very excited about our new product development pipeline with a series of joint preservation products set to launch over the coming quarters, specifically targeted for the faster growing segments of the market, beginning with the X-Twist full market release in early 2023. In summary, Anika continues to demonstrate the value of its strong financial foundation in the midst of a challenging macroeconomic environment, enabling the Company to take advantage of its exciting in-house portfolio of products and technologies, to position for new product launches, and accelerated growth in support of our multiyear growth targets. I would like to close by highlighting that Anika is uniquely positioned for success with a strong cash position and no debt, robust foundation of clinical data and a comprehensive portfolio of product and technology solutions and new product pipeline for osteoarthritis pain management, regenerative solutions, sports medicine and bone preserving joint technologies that we are delivering on."
}