{
    "symbol": "MSI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 22:01:02",
    "content": " Additionally, we ended the quarter with record Q3 ending backlog of $13.5 billion, up 19% from last year, inclusive of over $800 million of unfavorable currency impact. And finally, based on our exceptionally strong Q3 results and our expectations for the remainder of the year, we're raising our full year guidance for both sales and EPS for the second consecutive time, despite full year FX headwinds that now total about $220 million up $50 million from our expectations last quarter. For the full year we expect operating cash flow to be approximately $100 million lower than our prior guidance, primarily due to our continued investment in inventory, which is helping us execute in a dynamic supply chain environment and deliver against the continued record demand we're seeing in video security and LMR. Operating earnings were $375 million or 24.5% of sales up from 20.6% in the prior year, driven primarily by higher sales and operating leverage, partially offset by higher material costs. Total software revenue was up 17% driven by strong demand in video, while in LMR services revenue was up 4% after $33 million of FX headwinds. Operating earnings in the segment were $301 million or 35.7% of sales, down 30 basis points from last year driven by higher acquisition expenses. International Q3 revenue was $686 million, up 4% versus last year with growth in all three technologies, partially offset by unfavorable FX. Moving to our backlog, ending backlog was a Q3 record of $13.5 billion, up 19% or $2.1 billion compared to last year, inclusive of approximately $826 million of unfavorable FX and a $99 million orders reduction related to the planned exit from the ESN contract. Sequentially backlog was up $87 million driven by several large orders received during the quarter, partially offset by $411 million of unfavorable FX and the $99 million adjustment for ESN. In the Products and SI segment, robust order demand in both LMR and video continues to drive record backlog, which was up $1.2 billion or 35% compared to last year. In Software and Services backlog was up $876 million compared to last year, driven by the Airwave extension and a $288 million increase in multi-year services and software contracts in North America, partially offset by $722 million of unfavorable FX and the adjustment related to ESN. So sequentially backlog was down $426 million or 5% driven primarily by unfavorable FX, the ESN adjustment and revenue recognition for Airwave and ESN during the quarter. This updated guidance now includes full year FX headwinds of $220 million, up $50 million from our prior guidance, a weighted average share count of approximately 172 million shares and an effective tax rate of approximately 20.5%. Our investments in the portfolio, combined with a robust funding environment are driving increased demand for our solutions, our supply chain execution and higher inventory is helping us navigate a continually challenging environment to meet this record demand and our record Q3 backlog positions us well for another year of strong revenue and earnings growth into 2023. Your line is open. Your line is open. Your line is open. The progress we're making in satisfying this record demand is the decision to carry higher inventory to meet this record demand, pay more in PPV premiums, we had said we thought we'd spend $120 million for the full year. Your line is open. Your line is open. And second, weâ\u0080\u0099ve prioritized public safety shipments this year, so we have some lower tier PCR sitting in backlog that will have to flush through in Q4 and also into next year being a little bit of a counterweight to just a peel off of that $150 million. Your line is open. Your line is open. Your line is open. Your line is open."
}