{
    "symbol": "MSI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 20:20:02",
    "content": " This decline in operating earnings was primarily due to the $50 million of higher semiconductor costs that we outlined on our last call, related to the acquiring critical supply in the secondary market for semiconductors. Non-GAAP EPS of $1.70 per share compared to a $1.87 last year, a decrease primarily due to the operating earnings impact I described related to higher semiconductor and freight costs and increased operating expenses from acquisitions, partially offset by higher sales and a lower tax rate. OpEx in Q1 was $492 million, up $37 million versus last year, primarily due to higher expenses related to M&A, investments in video and higher selling costs commensurate with our higher sales. Operating earnings were $96 million or 8.7% of sales, down from 12.9% in the prior year, driven by the $50 million of higher semiconductor costs and higher freight costs previously mentioned, partially offset by higher sales. Operating earnings were $278 million or 35% of sales, down 170 basis points from last year, driven by a change in year-over-year mix and higher M&A operating expenses, partially offset by higher sales. Some notable Q1 highlights in this segment include $27 million command center software order for a customer in Latin America, a $20 million US federal multi-year service contract orders, $8 million command center software record management order for the City of Phoenix and an $8 million services agreement with the City of Chicago. International Q1 revenue was $587 million, flat versus last year with growth in video security and command center software, offset by a decline in LMR due to FX. Ending backlog was a Q1 record of $13.4 billion, up 19% or $2.1 billion compared to last year, driven by the Airwave extension recorded in the fourth quarter of ‘21 and increased demand across all three technologies. Software and -- Software and Services backlog was up $1.3 billion compared to last year, driven by the Airwave extension and a $320 million increase in multiyear services and software backlog in North America. Products and SI backlog was $852 million compared to last year and up $106 million sequentially, driven primarily by strong LMR and video demand in both regions. For the full year, we are maintaining our prior revenue guidance of 7% growth and non-GAAP EPS guidance between $9.80 and $9.95 per share despite the significant strengthening of the US dollar since our last call. Additionally, our full year operating cash flow guidance for approximately $1.9 billion and full year OpEx expectations of approximately $100 million increase over last year are also unchanged, inclusive of the new acquisitions we announced, offset by targeted reductions we're making. Your line is now open. So as we set out the year and described in the last call $100 million is elevated cost that we're incurring to buy these parts at a premium in the first half, but the second half is only $20 million, that's in part driven by the elevated costs that we faced last year with comp. Your line is now open. One, we're paying a premium for semiconductors that aren't available directly from the manufacturer and getting them through alternative secondary markets, that's a $120 million that is in the P&L this year as we get after that critical supply. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}