{
    "symbol": "MSI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 21:20:14",
    "content": " Additionally, we ended the quarter with record Q2 backlog of $13.4 billion, up 19% versus last year, inclusive of approximately $500 million of unfavorable currency impact. In Q2 and the first half of the year, our cash flow has been primarily impacted by 2 items: first, our planned investments in inventory to navigate the dynamic supply chain environment and position us to fulfill the record demand we're seeing in Video and LMR; second, higher employee incentive payments that were tied to 2021's performance and paid out this year. Operating earnings for Products and SI were $188 million or 14.6%, down from 16.2% of sales in the prior year, driven primarily by the higher material costs and higher freight costs previously mentioned, partially offset by higher sales. Operating earnings in the segment were $309 million or 36.1% of sales, down 110 basis points from last year, driven by a change in year-over-year mix and higher M&A expenses, partially offset by higher sales. International Q2 revenue was $656 million, flat versus last year, with growth in all 3 technologies, offset by unfavorable FX. Ending backlog was a record -- Q2 record of $13.4 billion, up 19% or $2.2 billion compared to last year, inclusive of approximately $500 million of unfavorable FX. Sequentially, backlog was down $21 million, driven primarily by a $397 million movement in unfavorable FX and the quarterly revenue burn related to the Airwave and ESN contracts, partially offset by record Q2 orders in LMR products, video and Command Center Software. In the Products and SI segment, continued robust order demand in both LMR and Video is driving record backlog, which was up $986 million or 30% compared to last year. In Software and Services, backlog was $1.2 billion compared to last year, driven also by the Airwave extension and a $380 million increase in multiyear services and software backlog in North America. Sequentially, backlog was down $227 million or 2%, driven primarily by unfavorable FX and revenue recognition for the Airwave and ESN contracts, partially offset by record second quarter orders in Command Center Software. But I would note that we've -- the $190 million has all been targeted at the highest tier, which is the original APX NEXT with subsequent releases in the second half of this year with the mid-tier portfolio, which we're starting to engage in customer discussions on. And Erik, the $190 million of orders is since the APX NEXT product was introduced, but I'd also add that just, in general, Q2 was a record for P25 public safety devices, which is more broad than APX NEXT as well. We agree with the -- we still are maintaining the guidance on the 3 technologies: LMR, mid-single digits; video security, approximately 20%; Command Center Software, low double digits as we continue to contribute to backlog and we like the momentum in the back half, I think it positions us well as we head into 2023. I'd simply say for the first half of this year, given our performance kind of in the mid-teens growth over 68% and 80% orders growth comps, we think we're performing relatively well. The second half will be certainly better, and we'll get to approximately similar and OE slightly up for the year, which will cover the $100 million of OpEx, you're right, of increase that we're expecting for the year-over-year, $75 million of which from the OpEx side is related to M&A."
}