{
    "symbol": "WFC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-14 14:52:05",
    "content": " When looking at simple averages across the entire consumer portfolio, deposit balances per account decreased from the second quarter, but were still higher than a year ago and remained above pre-pandemic levels. Period-end loans increased for the fifth consecutive quarter, but growth slowed as expected, with commercial loan balances holding relatively stable from the second quarter while consumer loans grew driven by credit card and first lien residential mortgage loans, partially offset by continued declines in our auto portfolio. We currently expect full year 2022 net interest income to be approximately 24% higher than a year ago, with fourth quarter 2022 net interest income expected to be approximately $12.9 billion. Middle Market Banking revenue increased 54% from a year ago, driven by higher net interest income due to the impact of higher rates and higher loan balances. Banking revenue increased 28% from a year ago driven by stronger treasury management results, reflecting the impact of higher interest rates as well as higher loan balances. Commercial real estate revenue grew 29% from a year ago, driven by higher loan balances, the impact of higher interest rates as well as improved commercial mortgage bank-backed securities gain on sale margins. Average loans grew 19% from a year ago, with broad-based growth across our businesses to fund clientsâ\u0080\u0099 working capital needs, but the pace of growth slowed in the third quarter with average balances up 3% and period-end loans down 3% from the second quarter. On Slide 13, Wealth and Investment Management revenue grew 1% from a year ago as the increase in net interest income driven by the impact of higher rates offset the decline in asset-based fees driven by lower market valuations. Your line is open, sir. Your line is open. Your line is open, sir. Your line is open. Your line is open. Your line is open. Your line is open."
}