{
    "symbol": "WFC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-15 11:46:02",
    "content": " Revenue declined as growth in net interest income driven by rising interest rates and higher loan balances was more than offset by lower non-interest income as market conditions negatively impacted our venture capital, mortgage banking, investment banking, and wealth management advisory businesses. While credit quality remains strong, our results included a $235 million increase in the allowance for credit losses due to loan growth, this follows six consecutive quarterly decreases in the allowance, including $1.1 billion in the first quarter and $1.6 billion a year ago. Mortgage banking, which has slowed in response to higher interest rates and our affiliated venture capital and private equity businesses, which a year ago generated elevated gains but recognized impairments in the second quarter of this year due to significantly different market conditions. Operating losses increased $273 million from a year ago, primarily driven by increased litigation expense, which included a recovery in the second quarter of last year, and higher customer remediation expense predominantly for a variety of historical matters. Consumer and Small Business Banking revenue increased 17% from a year ago, driven by the impact of higher interest rates and higher deposit balances. Home lending revenue declined 53% from a year ago and 35% from the first quarter driven by lower mortgage originations and compressed margins, given the higher rate environment and continued competitive pricing in response to excess capacity in the industry. Middle Market banking revenue increased 27% from a year ago, driven by higher net interest income from the impact of higher rates and loan balances. Banking revenue increased 4% from a year ago, primarily driven by stronger treasury management results given the impact of higher interest rates as well as higher loan balances. On slide 14, Wealth and Investment Management revenue grew 5% from a year ago as the increase in net interest income due to the impact of higher rates and higher loan balances more than offset the declines in asset-based fees, driven by lower market valuations as well as lower retail brokerage transaction activity. These businesses contributed $580 million of revenue in the second quarter of 2021, including the gain on the sale of our student loan portfolio, and they accounted for approximately $375 million of the decline in expenses in the second quarter compared with a year ago, including the goodwill write-down associated with the sale of our student loan portfolio. In summary, while our net income in the second quarter declined driven by lower venture capital and mortgage banking results, our underlying trends reflected our improving earnings capacity with expenses declining and strong net interest income growth from rising rates and higher loan balances. Your line is open, sir. Your line is open. Your line is open, sir. And I think we'll see what happens as -- if we see continued outflows of deposits, but as you put it out, like our mix of deposits as we came in this environment sets us up pretty well, and you can see that in the results so far where the consumer deposits are a much bigger percentage of the overall pod than they were just a couple of years ago. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. But when you go category-by-category and say, okay, well, spending in the card space continue to increase at the same pace given some of the uncertainty in the economic environment, we'll see maybe commercial real estate, certainly, given what we're seeing in the real estate market there, that appears like it will slow down a little bit again in the second half of the year."
}