{
    "symbol": "MMYT",
    "quarter": 1,
    "year": 2022,
    "date": "2021-07-27 19:16:03",
    "content": " Moving onto our business segment, air ticketing adjusted margin stood at $19.2 million representing an increase of almost 4.5 times the level achieved in the same quarter a year ago, but lower by half on a quarter-on-quarter basis on constant currency terms. The adjusted margin for our hotels and packages business stood at $12.3 million in Q1, which is nearly ten times the adjusted margin in the same quarter a year ago, but lowered by nearly two-thirds on a quarter-on-quarter basis in constant currency terms. As for our bus ticketing business, adjusted margin stood at over $3.9 million and represented nearly 12 times improvement from the year ago level of Q1 in the last year, but down nearly two-thirds as compared to the previous reported quarter in constant currency terms. Lastly, the adjusted margin in other businesses was $2.5 million, representing a year-on-year improvement of recovery of nearly 2.2 times, but just less than half the levels achieved in the previous reported quarter in constant currency terms. And therefore, in that manner of thoughts, these are not really like-to-like kind of linked quarters and right through the pandemic, there have been significant amount of changes to the working capital cycle depending upon the kind of recovery or setbacks as you have seen on the business side. As you can imagine, this was a quarter really hit by the second wave of the pandemic, and we have seen when the market kind of demand appetite is extremely low, we’ll usually find suppliers kind of very willing to put in a bit more in terms of margins to transplant liquidity and try and kind of drive volumes. Secondly, if you see, despite the significant impact on business recovery, which had gone into kind of high 50s, and even if you see some of the exiting months of the previous reported quarter, we had kind of gotten into almost like 60s and 70s in terms of domestic recovery."
}