{
    "symbol": "MMYT",
    "quarter": 2,
    "year": 2022,
    "date": "2021-10-26 14:14:08",
    "content": " Even more encouraging is that on a booked basis, October, months to-date, we are seeing a 90% recovery so far, indicating the strong travel demand for this year's peak travel festive season, where we are seeing top sectors booked like Delhi-Goa, Mumbai-Goa and Hyderabad-Goa, all exceeding pre-pandemic levels already. With profitable operations at even 50% of pre-pandemic levels, we believe that MakeMyTrip Group is very well poised to ride the ongoing recovery in India's travel industry in the quarters to come with its leading OTA brands and bus brand, as well as the balance sheet strength of about $0.5 billion in cash and cash equivalents. As far as budget is concerned as compared to the last quarter where the recovery was mostly led by the chain hotels the premium category hotels even the super-premium category hotels this quarter that we're reporting out and as we see and even in current month, the budget segment also seems to be now recovering nicely with all the demand segments, which are sort of -- which focus on more budget segment category of hotels and accommodation be it students slowly, and gradually also the small and medium enterprises who almost like from a consumer behavior standpoint behave like the retail customers. And one of the -- given that we are a comprehensive travel platform with all the products available -- the other alternative transport options, we thought it might be a good idea for the waitlisted candidate, for example and there is a huge number of waitlist tickets that happened on rail as you know, that if there is a cancellation or if even if the customer wants to -- last minute sort of -- the cancellation happens because he has not the confirmed tickets, we're saying that we should be able to give you an alternative mode of transport, right, where the value could be on an average basis, maybe 3x, where you will be able to pick up an alternative transport. And therefore, we thought it would be an interesting idea to sort of further strengthen the product offering with Hopper, given the fact that they have also done a great job in terms of -- in their own market in the US, in terms of scaling that up and with that thought, we thought we will come together and sort of further strengthen this whole offering, leveraging and comparing notes between the two; our own learnings from our own product, behind the scene, the way the modeling works and similarly sort of learning from their -- learnings from their respective market as well, and trying to come together and make the product even more stronger. So -- and it might differ from a segment-to-segment standpoint as well, given the fact that we are a comprehensive travel platform for a hotel and packages segment, or let's say, for the hotel segment first will be a completely different and more like the global sort of OTAs, whether it is booking.com and mostly maybe booking.com and in the alternative accommodation it could be Airbnb, that one could sort of also learn from and as against only sort of watching them. My second question is just on the shift to online; you've talked about in the Air business where now the market share is 30% on an overall basis, probably some of it are also due to the shift in online, but if you can talk about the hotels and the bus business in particular where online penetration at least pre-pandemic used to be in the sub-20%, so is there anything to suggest in the data points or anything your own sense that during the pandemic there's been like a pretty rapid shift to online in the hotels and buses segment which in your view could potentially stay as demand recovers."
}