{
    "symbol": "NLS",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-09 23:23:10",
    "content": " Despite our sales miss, we achieved our adjusted operating margin guidance for the second quarter of low single digits, while increasing our investment in advertising in JRNY by nearly $8 million versus LY. Specifically, we are increasing our second half forecasted OpEx spend by $12 million to $14 million in JRNY versus LY and marketing as a percentage of sales will increase by 9 to 11 points versus last year. Selling and marketing expenses were $22 million or 16% of sales, up $3 million from last year, driven by higher advertising. Adjusted G&A expenses were $11 million or 8% of sales, up $2 million to LY, primarily driven by increased investments in JRNY. R&D was $6 million or 4% of sales, up $1 million compared to LY, again driven by increased costs related to JRNY. Gross profit was $98 million and gross margins were 30%, down 13 points versus last year. We expect sales to be between $290 million and $320 million, which represents growth versus LLY between 47% and 62% or a two-year CAGR of 21% to 27% versus the six months ending March 2020. Second half JRNY COGS which includes depreciation, content, customer support and per subscriber variable costs, will be between $6 million and $8 million this year. Second half OpEx JRNY which includes R&D, IT, product management, and the amortization of stock based compensation and earn out associated with our VAY acquisition will be between $18 million and $20 million this year. We continue to expect CapEx to be between $12 million and $14 million for the full-year with the majority earmarked for JRNY and lastly, we now expect JRNY members to be between 250,000 and 350,000 by the end of fiscal '22. You asked about marketing, so yes we're increasing marketing as a percentage of sales and that's a combination of we now have a great set of connected products and experiences we don’t want to talk too much about and we do want to be a little bit more competitive in just share of voice in the back half of the year."
}