{
    "symbol": "DOMO",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-08 21:05:26",
    "content": " Statements made on this call include forward-looking statements related to our business under federal security laws, including statements about financial projections, the plans and expectations for our go-to-market strategy, our expectations for our sales and new business initiatives, the impact of the macroeconomic and other conditions on our business and our financial condition. For a discussion of these risks and uncertainties, please refer to the documents we filed with the SEC, in particular, today's press release, our most recently filed annual report on Form 10-K and our most recently filed quarterly report on Form 10-Q. In addition, during today's call, we will discuss non-GAAP financial measures, which we believe are useful as supplemental measures of Domo's performance. Other than revenue, unless otherwise stated, we will be discussing our results of operations on a non-GAAP basis. Before I discuss our third quarter performance, I want to recognize Bruce and discuss the CFO transition we announced today. After eight years at Domo, the Bruce will be transitioning out as Domo CFO. In addition to helping advance our strategy, Bruce has elevated the entire finance function at Domo and helped us successfully navigate through the pandemic. Along with the CFO succession planning, I'm working closely with our executive team during our fiscal year '24 planning cycle, to determine ways to optimize our business and leadership so that we can better serve our customers and operate more efficiently. And I look forward to sharing more details as planning evolves over the coming months, and we assess our needs and plans for fiscal year '24. With that, let's dive into our third quarter results. In Q3, our total revenue growth was 21%, our subscription revenue growth was 22% and our billings growth was 5%. I'm particularly pleased that for the first time in the company's history, we achieved a positive non-GAAP operating margin. Based on the changes we announced last quarter, we've seen good production from our corporate sales team where we are putting incremental focus. Additionally, we're seeing progress from our enterprise team and new logo and upsell opportunities and continue to provide transformational experiences for some of the largest companies in the world. I also want to recognize the tremendous work from our customer success organization, who helped customers realize value from their investment in Domo in ways that truly transform how their businesses run. In Q3, our customer success team achieved a gross retention rate of over 90%, which is a strong testament to our team's commitment to customer success and the power of the Domo product. In terms of the macro environment, we're seeing deals more scrutinized and slowed, resulting in and are seeing some early signs of pipeline aging with accounts of all sizes. Regardless, we don't see this as a reflection of Domo's value proposition as our win rates remain consistently strong, and we continue to see strong top of funnel demand. With today's market conditions, whether it be the macro economy, supply chain issues or shifting business priorities, companies are faced with how to optimize their existing processes, and how to do more with less, particularly with how they drive action with real-time data in their organizations. We integrate, manage and make data actionable by putting it in the hands of an organization's employees, customers and partners through self-serve analytics and apps that optimize business process workflows. For companies earlier in the stages, instead of separately sourcing, managing and integrating multiple point solutions for data connection storage, integration and delivery, Domo provides a pre-integrated end-to-end cloud native platform to rapidly address business problems without the need to stitch together multiple solutions. And for companies further along in their maturity that have existing infrastructure investments, Domo can be plugged in to rapidly fill the gaps they have and leverage their existing systems without having to rip and replace existing technology. Today's organizations are looking to do more with less faster, which is right in Domo sweet spot. In September, I was able to attend Domopalooza Japan, and it was so exciting to hear the customer success stories coming from that market. For example, we heard from Rakuten, Japan's largest ecommerce retailer and our first customer in Japan, which was also recently named by LinkedIn as the number one place to work in that country. When we spoke to Rakuten, at Domopalooza, we talked a lot about their data, democratization journey, and how it's designed to help them better serve their 1.6 billion customers all over the world, and to better run the business. As far as Q3 highlights, one significant win in the quarter was a seven figure ELA upsell with a Fortune 50 healthcare company to provide improved data access across the organization. This company's contract value is now 12x the size of our initial contract from 2015, showing the power of Domo as it spreads across an organization to literally 10s of 1000s of people who are touched by Domo via apps. This was a POC including services contract over $500,000 to support their development of an app that would allow its marketing team to optimize billions of dollars of marketing spend through a multi-channel attribution solution using Domo and our data science offering. The company chose Domo and our Domo Everywhere solution to monetize and provide better, more scalable self-serve and customizable analytics for their customers. Domo Everywhere, which allows our customers to share data with their customers and partners continues to be a highly differentiated offering that allows customers to securely extend the full power of Domo to external parties, expanding adoption beyond just their internal use cases. In Q3, Domo was named customers choice in Gartner's Peer Insights â\u0080\u0098Voice of the Customerâ\u0080\u0099 report for analytics and business intelligence. In Q3, we, along with our customer Walker Edison, received a nucleus research award for achieving a total ROI of 1,670%. Walker Edison, a global furniture company runs its entire business on Domo and gives everyone across its organization access to the insights they need to help the business move more quickly and compete against larger players. Monica has provided strategic HR leadership for companies such as Microsoft, PepsiCo, Sony, and the Walt Disney Company, bringing a depth of experience to help build our organization for long-term sustained growth. In closing, I'm pleased with the progress we've made in the sales organization in Q3. We continue to drive tremendous business value for our customers large and small, and we plan to continue to do so in any economic environment. It's been a privilege to work alongside John, our executive leadership team, and all the incredible people at Domo. In Q3, we posted 5% billings growth and 22% subscription revenue growth. The results in the quarter were driven primarily by sales to our corporate customers, which experienced 31% revenue growth, consistent with Q2. I am pleased that our gross retention rate was above 90% and up from Q2, as this represents durability and stickiness within our customer base, which should be a protector of growth should we enter into a recession. Our current RPO of 230.3 million grew 21% year-over-year, while our total RPO grew 19% to 354.3 million. On a dollar weighted measure, we now have 65% of our customers under multi-year contracts at the end of Q3, up from 61% a year ago. Subscription revenue grew 22% year-over-year, representing 87% of total revenue, and was slightly down from 23% growth in Q2. Services and other revenue was up 18% year-over-year in Q3, driven by increased billable hours, and the delivery of more custom data apps. In Q3, cash used in operations was 6.5 million, in part from the cash payments resulting from our Q3 cost reductions and also slower cash collections from our customers that we attribute to the macro. We expect Q4 cash flow from operations to be negative, but an improvement from Q3 and we expect Q1 fiscal year '24 cash flow from operations to be positive. Given our focus on costs and managing the positive operating income, we believe we have enough cash on the balance sheet to allow us to meet our long-term financial objectives. For Q4, we're guiding to billings of about 107 million. As we mentioned on our last call, our near-term billings growth is being impacted by temporarily reduced quota capacity that we're in the process of increasing. We're being cautious in our billings outlook as we increase our capacity, and at the same time are aware of potential macro headwinds. During the last two months, we've seen a significant improvement in sales rep turnover. Our guidance implies full year billings growth of about 10% year-over-year, down from our previous guidance of about 13%. For the fourth quarter of fiscal year '23, we expect GAAP revenue to be in the range of 77 million to 78 million. For the full year of fiscal '23, we expect GAAP revenue to be in the range of 306 million to 307 million representing year-over-year growth of 19%. Looking ahead to fiscal 2024, although we're early in the planning process, we're very focused on managing profitability with reasonable growth. And therefore, we're being cautious with our spending plans, and we'll meet our investments based on our near-term outlook. We still plan to increase sales capacity, but with a greater emphasis on ramping reps we have recently hired rather than aggressive new hiring. Based on our caution around in economic slowdown, and a lower than previously planned sales capacity, we're providing a preliminary revenue growth outlook for fiscal year 2024 of about 10%. For fiscal year 2024, we're also planning for positive non-GAAP operating margin for the year. In closing, we're pleased that we were able to achieve a positive non-GAAP operating margin in Q3. Just to start-off with the billing number maybe, any detail on how much slower was doing slow this quarter due to the sales capacity versus the macro having an impact, and then I have a follow on. And the quota time and that's out is, is lower than we had originally planned by a significant amount, actually. The macro is more of an overlay that we are, observing certain behaviors from some of our customers, particularly the large customers that just seem to be much more reluctant to step into larger deals. We're seeing on the edge, a little bit slower collections not necessarily bad debts is another one. And so I'd say, yeah, there's macro. But for this year, really the impact has been based on sales capacity. And then on the collections point, maybe just sort of thinking through fiscal year '21. And we're taking a much more cautious posture on spending, not so much that we still have building sales capacity, but kind of spending in other areas. That's just a seasonally high number, against modest increases in spending in some cases decreases that really sets up Q1 to be a pretty good cash flow quarter. It's been a fun ride, good luck in your next venture. And can you just give us a sense of kind of what the level of productive sales capacity growth is today or what you're expecting, exiting Q4. I think the sales organization and he has done a great job of managing the attrition there, I think we've seen that stabilizing, get much more positive in the last couple of months. So that team is building and just the rigor around pipeline management, hygiene of prospecting activities, things like sales blitz is it's a muscle that we're kind of digesting, first half and really getting the rigor muscle back in place. And on the demand side, we continue to see strong demand, the top of funnel is working pipeline is healthy, it's as strong as it's ever been, frankly. We are actually still building sales capacity, on the one hand with the metric that we call ramped sales heads. One of the challenges we have on the numbers is, however, we've kind of had a mixed change in the business, in favor of the corporate sales reps, and they just generally have lower quotas. And while I'm at it, we think we're in a good position to really get the enterprise being a much bigger contributed to next year, we have great reps that are here, they know their accounts well, extremely engaged. The value proposition seems to be showing even better in this economy, even though we have to deal with the budget challenges of our customers on the one hand, but we have the right kind of architecture and approach. So yes, we look forward to getting into next year. But is it fair to say, how come we're not seeing more seasonal strengthen in revenue in Q4. Is it just because you don't have the level of enterprise business, which is typically a big Q4 seasonality as you did a year ago, and so that's a tougher comp. Two main items, one is, we're being very cautious in the new business and the contribution to new business and the revenue contribution. It's prudent do so given these numbers are quite large, going into Q4. It's possible -- if it is commensurate with what we've seen just recently, there's some upside there. So that's why it's really services driven, I would say in terms of like, what's really causing that. That's a long time, but I will also add. And frankly, I kind of put myself out of the job that's so good. And I have a vested interest in making sure the stock is when I sell it, it's much higher than where it is here. So Domo's agreement with Josh James expires on March 1, 2023. I would say that the team that's here is really, really solid and focused on operating the business in a prudent way. If you just look at the top lines of 300 million in recurring revenue, 90% retention, 80% gross margins, operating margin positive, that was a big, big milestone. But just curious to know if we're drafting a change in the sales compensation architecture, either kind of payouts for corporate or skewing that towards the front half of the year versus back half of the year. We're kind of right in the middle, I'd say of the planning process for next year, which is -- it's kind of -- it's exciting to be able to plan for next year and look at the progress we've made this year. But also, we're pretty bullish on the value proposition that Domo brings to customers. When we see it every single day with these customers who are actually transforming how they do business with the Domo product, and we think that they are a real significant positive in this environment. And I'll add, the big mistake this year was in the sales reorg, so to speak, quotas were too high, the ability to get the business just wasn't where it needed to be, for a set of reps to make their number. We're planning next year, one of the principles is, the sales guys have to make money, or salesmen and women have to make money. And then working with Ian, and his sales ops team, so I'm making sure that's set up. And we're doing it early this year, too. And then I want to make sure I understand expectations for the operating expenses for Q4, and then I guess I may as well address at least early on for Q1. And that because expenses or revenue could flex a little bit but the commitment, we have is to make sure we hit our target and definitely be positive in Q4. Well, let's say full year for now. And when we get to like formal guidance at the end of Q4, we may provide some more color about how that could be divided amongst the quarters between the quarters."
}