{
    "symbol": "GIS",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-21 15:20:03",
    "content": " What I would say, in this environment there is a huge trade-off, but I'm not sure there is a trade-off between higher service level cost and that's because if we were to take our foot off the gas on service, what you would -- what we would find is that we create more deleverage and we would incur fine because and be more inefficient and get fine for our retail customers because the more efficient and then we'd be shipping truckloads stuff that we're probably most efficient, and so there really isn't a cost trade-off. As Kofi said, we do expect our margin performance year-over-year to improve, which is really all about the comparisons which get quite a bit easier as we have more other supply chain costs in the back half of last year. Yes, I think we generally don't comment on forward-looking pricing and just know that we have pricing already in the marketplace that we've already announced to our customers and so we're confident that that it will be higher in the second half of the year, but overall we don't comment on the specifics of forward-looking pricing. But I guess my question is with regard to the competitive activity, I know you said private label really isn't a threat and they're not gaining shares, but sort of over a longer term basis, your share trends have been neutral effect, but I assume at some point competition is going to sort of fight back harder and maybe in terms of cereal, your competitor -- your major competitor has their hands tied behind their back a little bit from a supply perspective. And I'm not looking for specifics or things you haven't announced yet, but just generally can you comment kind of thinking maybe about calendar 2022, if you think the innovation pipeline things to come or as strong as you've launched over the last six to 12 months, just sort of conceptually as innovation still set to be a good a strong driver of hopefully more -- even more market share gains. We look back to lot of the practices that we put in place at the beginning of the pandemic, so one of the things we have are daily  meeting historic level for North American retail, I share a weekly supply chain huddle together with all of our senior leaders across the business talk about these issues and trying to help our team work through some of the challenges that are out there. The other half is really relating to those factors in the disruption in the supply chain, so most of which is driven by a direct costs that things that Jon alluded to inefficiency in trading, supply all the things that we're doing in this environment to ensure in key customer service levels."
}