{
    "symbol": "ELTK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-17 11:43:04",
    "content": " Before I turn the call over to Mr. Eli Yaffe, Chief Executive Officer; and Ron Freund, Chief Financial Officer, I'd like to remind you that they will be referring to forward-looking information in today's presentation and in the Q&A. In the second quarter of 2022, we recorded a revenue of $9.1 million lower than what we forecasted due to the fire that broke out in one of our manufacturing department in June. Revenues for the second quarter of 2022 totaled $9.1 million, same as in Q2 2021. Revenues for the six -- the first six months of 2022 totaled $18.8 million compared to $16.3 million in the same period last year. Gross profit for the second quarter of 2022 totaled $1.7 million compared to a gross profit of $2.4 million in the second quarter of 2021. The decrease in gross profit is due to a higher efficiency achieved during the second quarter of 2021, while our operations were negatively impacted by the fire in June 2022. Gross profit for the first six months of 2022 totaled $3.6 million compared to $3.5 million in the same period last year. Operating profit amounted $0.3 million in Q2 2022 compared to $1 million in 2021. Operating income in the first six months of 2022 totaled $1 million compared to $1.2 million in the same period last year. The increase in the second quarter of the U.S. dollar exchange rate against the NIS contributed to our Q2 2022 results of operation as we recorded financial income in the amount of $0.6 million. For the first six months of 2022, we recorded financial income in the amount of $0.7 million. Net profit was $0.8 million or $0.13 per share in Q2 2022 compared to net profit of $0.9 million or $0.16 per share in Q2 2021. Net profit for the six months of 2022 was $1.4 million compared to $1.2 million in the first six months of 2021. EBITDA was $0.8 million in Q2 2022 compared to $1.5 million in Q2 2021. For the six months of 2022, EBITDA was $1.9 million compared to $2.1 million in the same period last year. As of June 30, 2022, we had cash and cash equivalents of $8.2 million compared to $9.3 million at December 31, 2021. As of December 31, 2021, this exchange rate was NIS 3.1 per $1. While as of June 30, 2022, the exchange rate was NIS 3.5 to $1."
}