{
    "symbol": "JG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 14:03:04",
    "content": " Total revenue rose to RMB 86.9 million, up 8% quarter-over-quarter, and both Developer Services, our core business and vertical applications have achieved sequential growth with the biggest revenue growth contribution by Developer Services at 11%. Furthermore, we ended this quarter on a higher note with more than RMB 142 million in total deferred revenue our remaining performance obligations up 15% versus last year. Developer Service revenue increased 11% quarter-over-quarter to RMB 63.2 million, which was mainly due to the increase in both Subscription Services and Value-added Services. Year-over-year, Developer Services revenue decreased by 1.5%, mainly due to the weakness in Value-added Services, offset by the growth in Subscription Services. Subscription Services revenue were RMB 46.3 million, up 11% quarter-over-quarter and up 4% year-over-year. The value-added services revenue increased quarter-over-quarter by 10%, and it was the first quarter-over-quarter growth in 2022, a major positive sign for us. Year-over-year revenue was down 44% to RMB 16.9 million, and we expect the year-over-year growth trend will continue to recover in 2023. Our Market Intelligence Services delivered strong revenue growth, up 16% quarter-over-quarter and 27% year-over-year to RMB 10.4 million. All 3 components within OpEx category recorded year-over-year noncash reduction in particular, R&D expenses decreased by 22% to RMB 35 million, mainly due to lower headcount that reduced salary costs and associated share-based compensation and a decrease in cloud costs and depreciation expenses as a result of improvement and optimization of our cloud platform. G&A expenses increased by 149% to RMB 35.9 million, mainly due to a RMB 22.4 million noncash increase in the long-lived asset impairment due to onetime costs for going cloud in this quarter. And let me recap some of the highlights of this quarter, and we achieved lowest adjusted operating expenses since IPO at RMB 62.8 million, down 19% year-over-year."
}