{
    "symbol": "UWMC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 16:24:09",
    "content": " But the data we're accumulating about each client, the information we're doing with the broker channel, seeing their retail loan officers and how they're acting towards brokers, seeing that convert, it's been so magnificent, that we're watching it a little longer. Long term, we're thinking about this as a big investment to be a multi billion dollar investment as in not investment, multibillion dollar returns for our investors, I can look at acquiring a company, $500, $700 million, or maybe get a little market share pickup, maybe turn some loan officers from retail to wholesale, probably won't get much data out of it, or I spent a couple of hundred million dollars in the gain on sale, you guys can notice it there. The problem was, the wholesale channels growth didn't work as well back then, because it turned into a refi, boom, the market turned into 2019, 2020 COVID, 2021 major refi boom, so the loan officers shift didn't happen at the pace that we're seeing already. And as I told you, we've been waiting for this time in the industry, where rates went up, they went up fast, everyone else's who's kind of caught doing the refi game and the little, merry go round with doing every refinance all day like that doesn't work for a long term strategy. I could even make an argument that I would take out the Game On quarter or Game On half of the year, because it's just a long term investment, but even with that we'll still be in that 75% to 90% range for the year and we're able to have 99% in the first quarter and second quarter as you probably saw. And on top of that, one last thing, not only loan officers coming over, the one piece that maybe have not reiterate enough is the loan officers in the broker channel right now, John Smith, in the broker channel, he is wining to loan against the retail loan officer, a guaranteed rate or movement or loans, like always good -- those are good times, I'm not saying anyone negatively. I think that maybe I misunderstood what you're saying, because our warehouse costs and those things are going down as a spread, but at the same time compared to the note rate we're making money, because it's all relative to the note rate on the loan. But hundreds of loan officers out here every week to get training, success track, getting better, finding ways to improve, finding ways to talk to real estate agents and grow their business, the broker channel has so much growth, it's like a six foot 11, 15 year old that's, athletic and  he's going be NBA star. And that's what we have to do with UWM with our technology, with my account executives, with my operations team, with my partnership, with our training, with our initiatives, help brokers grow, with them watching our videos, we track everything to make sure that they're getting the vantage and the benefit of this. And so, I think that's really the key, the stickiness is the right question that you ask, because that's really what we're focusing on to make sure that they become not just third quarter clients of UWM, but lifelong clients for UWM."
}