{
    "symbol": "CMA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-20 12:36:04",
    "content": " Good morning, everyone, and welcome to Comerica's second quarter 2022 earnings conference call. Participating on this call will be our President, Chairman and CEO, Curt Farmer; Chief Financial Officer, Jim Herzog; Chief Credit Officer, Melinda Chausse; and Executive Director of our Commercial Bank, Peter Sefzik. The presentation slides and our press release are available on the SEC's website as well as in the Investor Relations section of our website, comerica.com. Please refer to the safe harbor statement in today's earnings release on Slide 2, which is incorporated into this call as well as our SEC filings for factors that can cause actual results to differ. Today, we reported first quarter earnings of $261 million, or $1.92 per share, an increase of 40% over the first quarter. Pretax pre-provision net revenue was up 53%, and our ROE increased to 17%. These results reflect the rising rate environment, including prudent actions we have taken to lock in higher rates. In addition, we produced strong loan growth and generated a solid increase in fee income. While the overall economic environment is uncertain, overall, our customers are generally optimistic about the future. And while they may be seeing some pressure on their margins, they remain in good shape. As I discussed on our last earnings call, we kicked off several initiatives related to modernization as we continue to evolve and adapt to meet the changing landscape and move into a new era of banking. Therefore, we recently unveiled a refreshed corporate logo that represents our commitment to both our 173-year legacy and our vision for the future. Also last month, we announced actions taken as part of our retail bank transformation, which included adding small business bankers in strategic locations, updating our web and mobile banking platforms and expanding our interactive teller machine network. In addition, we are consolidating 22, or 5% of our banking centers, which is expected to be completed by the end of the third quarter. In the second quarter, our green loans and commitments continue to grow and totaled $2 billion at quarter end. Once again, our commitment to corporate responsibility has been recognized with honors from the National Diversity Council as one of the 50 most community-minded companies in the U.S.  Also, we appointed a National Hispanic Business Development Manager to further support our commitment to strengthening relationships with Hispanic business leaders, entrepreneurs and communities. Second quarter loan growth was one of the highest in our history, with increases in nearly every business line. The biggest drivers were general middle market, large corporate, equity fund services as well as modest growth in National Dealer Services. In general, customers are rebuilding inventory levels, which has resulted in increasing working capital needs, while CapEx spending remains relatively slow. We are strategically managing deposits and customers are putting their excess liquidity to work, which resulted in a decline. Credit quality remained excellent, and fee income increased 10%, led by syndication, derivative and warrant activities. Overall, a strong quarter, and we feel positive about the path we are on as we move through the remainder of the year. And now I will turn the call over to Jim, who will review the quarter in more detail. As Curt just mentioned, loan growth was very robust, increasing $1.8 billion, driven by favorable environmental factors as well as our relationship-focused approach. As of quarter end, loan commitments were up $2 billion, or 4%. However, these balances remain well below our typical run-rate of about $4 billion. Borrowing needs are being driven by higher material prices and inventory levels as well as M&A and, to a lesser extent, CapEx. We continue to have great success in our equity fund services business, where we provide capital call and subscription lines to venture capital and private equity firms. Of note, Mortgage Banker increased about $125 million. While home sales were seasonally higher, volumes remain depressed due to higher rates, lack of housing inventory and shorter dwell times. Loan yields increased 42 basis points, primarily reflecting the benefit from higher rates. As shown on Slide 6, on a year-over-year basis, average deposits were up $2.1 billion. Relative to the first quarter, deposits declined as customers continue to put their excess liquidity to work, and we prudently manage pricing as it relates to non-relationship-based deposits in highly rate-sensitive segments. Approximately half of the decrease occurred in our municipalities and financial institutions businesses, which fall under general middle market. Notably, retail and wealth management deposits increased. Average balances increased $1.7 billion, as shown on Slide 7. During the second quarter, we repurchased $3.5 billion in MBS with average yields of 350 basis points, and we had repayments of $650 million. As we continue to execute our balance sheet hedging strategy, we will likely pivot towards swaps given the relative size of our securities book and the desire to maintain adequate cash to fund loan growth. The larger portfolio, along with the favorable new purchase yields, resulted in a $23 million increase in securities income. The rise in rates resulted in a mark-to-market impact on our securities portfolio of $850 million, which runs through OCI and affects our book value, but not our regulatory capital ratios. While we maintain the portfolio as available for sale, mostly for liquidity purposes, we typically hold these securities to maturity, in which case the unrealized losses should be recouped. And as I mentioned, the increase in the size of our securities portfolio at higher yields added $23 million. Higher rates on deposits at the Fed added $29 million, which was partly offset by lower balances and together added 26 basis points to the margin. Altogether, the rise in rates provided a net benefit of $82 million to net interest income. Credit quality remained excellent as outlined on Slide 9, including no net charge-offs. Overall, our customers have continued to perform well, and they maintain strong balance sheets despite supply chain issues, labor constraints and inflationary challenges. Strong credit metrics, loan growth and a somewhat weaker economic forecast resulted in a relatively stable allowance for credit losses at 1.18% of loans and a provision of only $10 million. Nevertheless, with our consistent disciplined approach to credit, as well as our relationship-based diverse portfolio, we believe we are well positioned to manage through a recessionary environment. Syndication activity was strong and increased from a seasonally low first quarter, resulting in an $8 million increase in commercial lending fees. Derivative income increased $7 million, including $5 million of favorable credit valuation adjustments, along with increased interest rate derivative activity. Fiduciary income increased $4 million, mainly due to annual tax-related fees. Finally, deferred comp, which is offset in expenses, decreased $7 million to a total negative return of $14 million for the quarter. Of note, relative to the second quarter last year, deferred comp decreased $20 million and card fees declined $15 million due to last year's stimulus-related activity. Annual merit, higher staff insurance and technology-related contract labor each added $4 million. This was partly offset by the resetting of annual stock comp and payroll taxes, which impacted the first quarter. Finally, as I mentioned on the previous slide, deferred comp asset returns decreased $7 million. Of note, our staff levels were stable as we are successfully retaining and attracting talent in a very competitive market. Litigation-related legal costs were higher, and the increase in occupancy includes our branch consolidation activity. Operational losses decreased from the elevated first quarter level, and we received a $4 million state tax refund. As Curt described, we continue to make progress on certain modernization initiatives, which totaled $7 million in the second quarter. We continue to closely monitor loan trends, and we expect to move closer to the targeted CET1 ratio over the near term through capital generated from strong earnings retention. As always, our priority is to use our capital to support our customers and drive growth, while providing an attractive return to shareholders. Excluding the OCI losses, our common equity per share increased to $1.35. Therefore, as demonstrated in the second quarter, our balance sheet reacts very quickly to changes in interest rates. In order to provide a more sustainable earnings stream through the rate cycles, we have been adding hedges to lock in market expectations for future short-term rates, while, importantly, reducing the downside impact of a potential decline in short rates overtime. To provide an outlook for net interest income, we used the forward curve as of June 30 as well as expectations for loan and deposit activity for the remainder of the year. We now expect 2022 net interest income to increase by approximately 31% relative to 2021, and increase to about 21% in the third quarter relative to the second quarter. Of course, there are many dynamics that may cause results to differ, specifically the pace of changes in short-term rates, deposit betas and loan activity. Given the robust broad-based loan growth we've generated so far this year, we are increasing our expectation for average loans to grow 6% to 7% year-over-year, excluding PPP loans. Relative to the second quarter, we expect average loans to grow 1% to 2% per quarter. In the first half of the year, in certain areas like middle market, for example, we saw increased utilization as customers work to rebuild their inventory. In the second half of the year, we expect that trend to stabilize. Consistent with customers' increased borrowing needs, we expect they will continue to draw down deposits. Also, the impact of the Fed's tightening is expected to be partly offset by our typical fourth quarter seasonality. As far as rates, we are closely monitoring the environment and staying close to our customers. Assuming that the macroeconomic challenges continue to remain manageable, we expect criticized and non-accrual loans to remain low and net charge-offs could begin to trend to the lower end of our normal range of 20 to 40 basis points. Recall that 2021 was the highest on record and included elevated levels of warrants, derivatives, stimulus-related card fees and deferred compensation. Following strong activity in the second quarter, we expect some pressure on commercial lending fees, derivatives and fiduciary. We expect expenses to increase 4% to 5% year-over-year, excluding any notable expenses related to our modernization program. This year-over-year increase is primarily due to higher performance-based compensation, annual merit, technology investments and inflationary pressures. Relative to the first half of the year, the second half is expected to increase 5% to 6%, excluding modernization-related expenses. The increase is driven by annual merit, higher staff insurance, advertising, business investment and outside processing expense, partly offset by lower performance-based comp and deferred comp. Excluding the $21 million benefit from deferred comp in the first half, which is not expected to repeat, expenses are expected to be up 3% to 4% in the second half of the year. And finally, as I indicated on the previous slide, we are focused on our CET1 target of 10% as we monitor loan growth trends. In summary, our outlook for the full year has improved with the benefit of higher rates, including the execution of our hedging strategy, more robust loan and fee income generation partly offset by higher expenses in conjunction with growing revenue and our strong financial performance. Many business lines continue to show good momentum, with very strong loan growth and increases in commitments in our pipeline. Our balance sheet structure has quickly produced benefits from rising rates, and we expect to continue to appropriately add hedges with the goal of providing a more consistent earnings performance through the cycles. It was a strong quarter, and I am very grateful for the dedication of my colleagues who work hard every day to ensure Comerica's success. It would imply, assuming the June 30 forward curve holds, say, fourth quarter net interest income of $720 million. Of course, we're not offering '23 guidance at this time, but there are some puts and takes there. On the other hand, deposit betas do lag, and you could see some upward pressure there once we get beyond the fourth quarter. And so with that said, I think it's a pretty good jumping off point in the fourth quarter. Of course, we'll have loan volume increases and other balance sheet movement, but it does position us very well for 2023. In terms of how we react to interest rate changes, our goal all along has been to reduce the asset sensitivity to the point where we can produce a very high level of net interest income. And I will note that $720 million, if the forward curve, is realized is by far and away the highest net interest income we've ever earned for a quarter. Yet, at the same time, we're protecting that net interest income. And to answer your question more directly, our goal, once we enter 2023, is to have our asset sensitivity to the downside at a low single-digit percentage. So that would imply that our short-term rates do drop, we should be largely protected. And then I just wanted to ask on deposit costs, so the 5 basis points of deposit cost is just terrific. And frankly, I don't think you can ever point any one Fed hike when these hikes are so close to each other. But we will certainly start seeing us move towards, not just our standard betas in the third quarter, but by the end of the year, we'll probably be approaching our standard beta for the accumulated standard beta that we published also. But those conversations will go on, and I'll just stress that it's a very relationship-based model here. I'll go first on customers and then, Melinda, you can talk about the economic outlook. But I think recession watch that you used there, that's not unique to you or all of us. That said, I think that they are doing really well. They don't feel like '22 concerns, but obviously, inflation, interest rates, all the things that we're dealing with. It does depend a little bit on geography, and it does depend a little bit on line of business. But overall, we feel like our sentiment of our customers is still pretty good at this time. So as you know, we use a variety of third-party forecasts and the Q2 economic forecast, although it was still positive, did show some deterioration from the first quarter with weaker growth, higher likelihood of recession and a higher -- much higher degree of uncertainty. We also use a severe recessionary scenario stress, certain parts of our portfolio, and this is really used to inform the qualitative component. Assuming the economic forecast remains sort of stable and the portfolio metrics don't change to the downside, the reserve build will tend to tie pretty closely to loan growth. And then obviously, if the economic forecast worsens, then we'll see reserve builds. Historically speaking, companies drawing down on deposits to fund business investment is a good thing, but we also have companies now drawing down to earn a higher yield. If you look at where we were pre-pandemic, our mix of noninterest-bearing deposits was just under 50%. I mean a lot of our deposits that are going to be rate driven that are going to be in our bigger businesses, you might say. So call it, U.S. banking our business deposit services businesses where they're moving higher deposits, but we have relationships, but it's not -- we don't have like all the treasury management. So there're deposits that are going to move for rate, but we can negotiate that if we need to. So if we think through this, right, the Fed actions are going to have an outsized impact on deposit markets. I think we will see the bulk of it likely in that fourth quarter of '22 to first quarter 23% range, at least that's our forecast right now. Predicting deposits is always a little bit challenging, not just pricing can lag a little bit, but sometimes customer reaction can lag a little bit, too. Having said that, these outsized changes by the Fed do put the antenna up on some customers. But having said that, you'll recall earlier from my opening comments, we usually get seasonality in the fourth quarter. So may not be apparent when you see the fourth quarter results, it would probably manifest more in the first quarter. When I look at line utilization -- not line utilization, but commitments increasing, it could be a sign that customers are more optimistic or it could be a sign that they're more cautious on recession coming. We don't really see this as defensive asks or recession concerns, certainly nothing like what we saw when the pandemic started, and we saw tremendous asks for recession lines of credit insurance. We're seeing business reason asks for all those things that Jim and Curt outlined of working capital needs, everything costs more money. And at this time, it doesn't appear to be or we're not seeing indications of it being recession preparation sort of asks. I guess just one, Jim, to follow up on Scott's initial question around NII. In a world where the Fed stops hiking by the end of the year potentially gets to cutting interest rates at some point in '23, do you expect NII in that backdrop to stabilize compared to, I'm looking back to '19 when NII peaked the same quarter when the Fed stopped hiking. And as I mentioned, the goal by the end of the year is to get down to the single-digit percent of net interest income at risk for a gradual 100 bps hike or 50 bps on average. Jim, I just -- with some puts and takes around where deposit betas might go and what loan growth does in 2023. As I mentioned, the full impact of November, December hike has been factored into that fourth quarter guidance. Loan volume is not factored in, but deposit betas made lag into the year. But I mean the whole goal along Ebrahim, as you know, and you've heard us say, is to protect ourselves better protect yourselves from a drop in rates. So that's what we've been working on, and we're largely successful up to this point. Well, we typically think about a 30% standard beta. I do think that we will, through the third quarter, be approaching that with hikes and probably go a little past for individual hikes by the end of the year. But at this point, I think it's more likely to be early the first quarter of '23. But we'll see how market forces react and respond, and how we work with our customers. And second, I think -- the other thing that you mentioned, I think, Curt, was you're not seeing a high degree of CapEx spend driving demand. As of right now, we still see really low inventory levels on dealer lots. Our floorplan usage is still really, really low compared to historical levels. We believe, and I think when you talk to a lot of customers that it's probably somewhere in the middle. I don't think you're going to see 90 days of inventory, but I don't think you're going to see 10 days either. But at the same time, different OEMs are communicating different things to the dealers, and so we'll just kind of see what that looks like on a go-forward basis. As far as the CapEx, I don't want to suggest to you that there's no CapEx going on. I think that most of our customer base, though, is being -- as we have said, recession watch, making sure that they don't do something that stretches themselves too much. So we are seeing a little bit of CapEx, but it's not probably the main driver of the borrowings that we have mentioned. I think that it's all been very prudent, and we make sure to talk to our customers about what sort of investments they're wanting to make and understand those. And so far, we're seeing really good decisions. Just on the cost side, I know you're recalibrating in the second half versus the first, and that deferred comp is a part of it. We're seeing it a little bit -- as contracts renew, there's a bit of a lag effect there. T&E, we're seeing it, as I mentioned. I mentioned earlier this year that I thought, overall, on a full year basis, it would perhaps add 1% to the overall expense base. In terms of operating leverage, that's always our goal to achieve positive operating leverage. Having said that, we're not prepared to offer guidance on '23 yet, but that is always the goal to generate positive operating leverage. Jim, I might just add from a bigger picture perspective, I mean, we are managing the business for the long-term. So we've had eight consecutive quarters of double-digit ROE, 17% this quarter or 58% efficiency ratio. Certainly, if the environment changes, we know how to manage expenses appropriately, but sort of balancing the two is really important for us taking the longer-term view. Almost all of the specialty businesses showed good direction, and I think that might have been a little surprising, especially with what's going on in dealer mortgage equity fund services. Yeah, Ken, it was a great quarter with all of our businesses kind of moving in the right direction. But as we mentioned, we booked a ton of business, and we expect that to continue. So the outlook for all of them continues to be pretty positive, as I think we've said, maybe not in the second half of the year what we've seen in the first half, but it does feel positive. We're just -- we haven't seen the type of activity, as everybody knows, with interest rates, housing inventory, affordability. But the rest of the businesses have got really good pipelines, really good outlooks, and we feel good about it. And also, I think you touched upon it in your prepared remarks, backing off the securities purchases and just trying to see -- trying to gauge what the asset levels will be for the next few quarters. Chris, yeah, historically, we have always maintained probably a little larger cash buffer than perhaps other regional banks just because of our commercial banking model. So typically, we like to hold at least $2 billion to $3 billion in cash, and we have a little more than that. Obviously, we're starting to approach those levels. We certainly have very strong and efficient borrowing channels, whether it be broker deposits or FHLB line. So to the extent we start getting down to those minimum cash levels and need to borrow, that's not necessarily worrisome for us whatsoever. It's been contemplated, and it's really what we've been preparing for. Where earning assets go overall, that's obviously going to be dependent on loan growth and where deposits goes. We're not necessarily forecasting earning asset levels themselves, but we feel really comfortable with what we're mapping out over the next couple of years in terms of managing cash and being able to fund loan growth. And then if I could, as a follow-up to Steve's question about the DDA reversion, I guess, mean reversion. If I'm looking at the mix of deposits, you said a couple of years ago it was low -- high-40s, now it's mid-50s. We will see overall deposits, of course, go down, and you'll see some of that from both DDA and interest-bearing. But at the same time, you will see even for balances that stay on the balance sheet, you will see for rate-sensitive customers and where we're price competitive, you will see some of those DDAs moved interest bearing. I believe you said modest growth you expect in commercial real estate, but I want to confirm that. And then maybe if you can talk about equity fund service outlook, corporate banking and middle market. There's been a lot about private equity funding, fund formation and so forth. Our utilization was actually down in EFS this quarter, but our commitments grew, our outstandings grew despite that. We feel like we're a leader in that business and feel really good about the opportunities, knowing that there is some challenges in the fundraising space, but overall, we've got a really good pipeline there. Our corporate business, so U.S. Banking has had really good success. I think larger companies with more geographic or international, national exposure, that's where our sentiment probably did drop a little bit more than the rest of our portfolio. That said, we did have a really good quarter, and our activity level there continues to be really good. Within U.S. banking, we've got some great specialty businesses around our gaming business, around our sports franchise lending business. And so the activity level there continues to be really, really solid. California has come back from kind of where it was last year, a little bit behind, although we did see a little bit of drop in sentiment in California versus the other two markets, but our activity level is still really, really strong. We're hiring relationship managers, and we feel really good about the opportunities that we're starting to see there. And then on commercial real estate, John, what I said there is we didn't see maybe as much outstanding loan growth in the second quarter, but we did see a tremendous amount of commitment production. And the opportunities for those customers have been really, really good. And so we expect to see outstandings increase from here with commercial real estate, just with the amount of activity that we have closed so far. So I hope that gives you a little bit more, John, on each of the businesses that you were asking about. And then my follow-up is just around the around loan growth overall, I know you're looking at 6% to 7% growth ex-PPP for 2022, which is pretty solid. And I know you're formally out there with 2023 expectations, but I wanted to see if you can maybe help us think about the trajectory of that growth rate as you look at 2023, particularly with the expectation of potential economic slowing. I'll comment first, and I don't know what Jim wants to add. But we're going to continue to do everything we can to keep that growth rate, as we have said, above GDP. Whether or not that looks like 6% to 7% in '23 versus the overall economy, I don't know. I think we would be optimistic, but a lot of it is going to depend on the economy and how we move through '23. With the deposit growth slowed down significantly for the industry, just wondering what Comerica is doing in terms of tweaking its strategy there, whether it be employee incentives related to deposit gathering or adding more small business bankers. And so whether it's in our commercial bank, in our retail bank, in our wealth management organization, we've got the ability to flex up on pricing if we need to, to do that. And so we're just trying to make sure we're staying focused on the relationship side of this, leveraging treasury management services. So that's where we're leaning in on this issue when it comes to gathering deposits into the future, particularly, as you mentioned, I think you'll see more talk from us about the small business space, which is a great deposit business. And I would just say, along with digital deposits, I'd love the emphasis we're putting on treasury management investment and I love treasury management, we love treasury management, not just for the noninterest income, but the deposits that come with it. As you think about kind of building that back up over 10% late this year or, say, early in 2023, if that comes to pass, given the kind of uncertainty in terms of the economy and growth, would you  maybe being more constrained on the buyback even in that scenario where you're back over 10% over the next several quarters, let's say? We do think we will, at least in our baseline forecast, likely get back to 10% by the end of the year. I think we can accrete capital at 10 to 15 bps per quarter, maybe closer to 15. On one hand, I am really excited about the fact that we will stabilize net interest income, stabilize a lot of earnings that makes it a little easier to activate things like the share buyback. We would look at the credit environment, and that would certainly weigh on how quickly we weigh back into a share repurchase program. You guys talked about next year wanting to be in the, I guess, single-digit range for downside to NII in the event of break cut. Yeah, I think we have on the slide that we will likely need up to $10 billion of hedges to get to the low-single-digit percent. It is going to be dependent upon how the balance sheet shifts, deposit levels will probably be the most important variable there. So it could end up being far less than 10, but I would just say, up to $10 billion, and it could be far less than $10 billion depending on how the balance sheet shapes up. I just would say again, it was a very good quarter. Thank you, as always, for your interest in Comerica, and I hope you have a very good day."
}