{
    "symbol": "SE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 11:15:28",
    "content": " Our nonoperating income for the fourth quarter was primarily due to a $200 million net gain from 2022 convertible bond repurchase, partially offset by investment losses recognized amidst lower valuations in the broader markets. At the same time, we believe that all these efforts we are making in reducing the cost structure of our ecosystem, and strengthening our ability to serve our users with better user experience will allow us to capture a larger share of the pie in the long run and further strengthen our market leadership which is a dual role in addition to profitability we have for our Asian markets. So I think it's going to be a highly dynamic process for each market at any period of time, we'll assess the market condition the natural user growth rates, the competitive landscape, our operational cost structure in that market, and then we'll assess what would be a reasonable profit margin we could achieve in that market versus the growth we want to achieve in the market. We do think that while we some of our measures that we are focused on such as cost structure improvement, logistics improvement, seller management, better consumer services and better buyer experience all will improve the efficiency of any investment we make into our ecosystem and also improve the profitability as well as growth. So that's the trick of the business, but also, I think our range of strength in operating a highly diversified markets and with different development strategies, I think overall, we -- in long run, of course, we believe in sustainable growth, which also means profitable growth for the business, and we still see this as our strong growth engine. However, we are aware of weakness -- continued weakness in online physical consumptions by users across various markets and in particular, some of the markets like Malaysia, as we previously also shared before, remain relatively -- in terms of year-on-year comparison, probably particularly that they saw, but of course, previously during COVID, some of these markets also happen to enjoy the strongest and the most spectacular growth during the COVID, so this remains tough comparison. The drivers behind the fast reduction in order loss per order, similar to our other Asian markets, coming from both top line growth as well as cost improvement, in particular, logistics costs that we are very focused operationally on reducing for our users."
}