{
    "symbol": "BBY",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-03 16:11:05",
    "content": " In addition to record revenue and earnings, our leaders continue to drive new ways of operating, and our employees continue to do amazing things in the face of unprecedented challenge and change to support our customers’ technology needs in knowledgeable, fast and convenient ways. Thank you so much, Matt. In addition, we’re expanding our addressable market by entering new categories in areas like health and electric bikes that are being disrupted by technology in a good way as well as areas where we can really complete solutions for customers, like indoor and outdoor living. However, with online penetration growing so rapidly in the last two years, we’re making investments in our stores to provide a better, more seamless shopping experience as customers move from online shopping to visiting our stores to video chatting from their home. Thank you so much, Matt. And so, while we think there’s a bit of a step back next year, all of this massive interest in the industry, the new ways that people are using technology, the innovations that are happening in spaces like metaverse or some of the things that Jason talked about in his prepared remarks, all of those, we believe, start to create that ramp as we get on the other side of a little bit step back in the next year. What’s assumed in that number as well is essentially, we would expect to still modestly gain share on a baseline of our business but then be able to accelerate our share growth with these initiatives that we talked about and then expand our markets with the items that Jason shared and also Best Buy Health as well. First, I’d say, over the last couple of years, this team you see on the camera, everyone in the building and the field have been doing amazing job just navigating and accelerating a number of the strategies to lift our business and improve the profitability over the last couple of years managing through the pandemic. We also talked about how health is at $525 million today and that we’re going to grow at a high CAGR rate over the next number of years that would indicate that by FY25, it’s about $900 million of growth, too. And we’re continuing to evolve how we see those interactions that are most important to those longer-term relationships and almost every strategy that we underscore today, whether it is what Damien talked about in terms of our more experiential stores, or whether it is Totaltech or whether it is a relationship with patient or someone we’re helping to provide help for, all of those are the types of relationships that keep customers stickier to the brand."
}