{
    "symbol": "VTRS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 13:58:07",
    "content": " Thank you, and good morning, everyone. I am pleased to say that we are off to a good start to the year with strong first quarter results in line with our expectations across all key financial metrics, delivering on our financial commitments and making good progress on the reshaping initiatives we announced in February. In the first quarter, we reported total revenue of $4.19 billion, adjusted EBITDA of $1.59 billion and free cash flow of $1.07 billion, a 34% increase over last year. We strongly believe that our company’s equity securities continue to be significantly undervalued, and as we continue to generate strong operating cash flows from our business and realize the proceeds from more efforts to unlock value, we are focused on maintaining our quarterly dividend, paying down debt, future share buybacks and other actions, all of which will enhance shareholder value over the short, medium and long-term. Thank you, and good morning, everyone. We are off to a good start and saw strength across the business, operation revenue was stable relative to prior year, gross margin was strong, SG&A benefited from realization of synergies and free cash flow improved significantly. So just looking at the EBITDA impact of key or on key products, I mean it looks like it was effectively 100% margin and I think that’s relatively consistent with what you outlined at year end, but the EBITDA impact on other base business assets at least in terms of the margin profile of those products was quite a bit higher. So at the end, after we done with reshaping what you are going to be left with there is a company that’s very well positioned to house a broad portfolio of generic medicines that reaches across in our global commercial network, addresses patient need for high quality affordable medicines that will always be a core of us, complex products, injectables, off patent and rebrands including some of the iconic brands that came in from legacy Upjohn. So first quarter SG&A came in lower than a kind of internal tracking it’s that essentially timing and we expect to catch that up, and I said that in my opening comments, we expect SG&A and R&D to ramp up, 52% of our yearly spend is going to happen in the second half of the year."
}