{
    "symbol": "VTRS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 14:41:03",
    "content": " These include: one, further details on our planned divestitures; two, the stability of our base business post Phase 1; three, our future capital allocation priorities and plans for Phase 2; four, how we will return our business back to growth; and lastly, confidence in our ability to ultimately execute on all actions that we have outlined to date. Additionally, when including the potential financial impact of the two acquisitions announced this morning, which we expect will only be additive to our growth, we are targeting during Phase 2 a top line total revenue CAGR of approximately 3%, adjusted EBITDA CAGR of approximately 4% to 5% and, most importantly, an adjusted earnings per share CAGR of approximately mid-teens. For Phase 2 beginning in 2024, we expect to reshape and rebase features to generate at least $2.3 billion of free cash flows per year, excluding transaction, costs and taxes, of which we intend to earmark 50% annually to be returned to shareholders in the form of dividends and future share repurchases. In fact, only $1.8 billion out of an estimated $16.5 billion of our estimated sales in 2022 will represent the total sales of our generics in the U.S. We have deliberately taken steps to minimize such exposure by derisking our business model in the United States through geographical expansion and also by moving up the value chain with more highly complex products launched in the United States and elsewhere where our products would be differentiated and with a better financial analog. As you can see, and consistent with our strategy which we announced in February, we continue to make important strides to reshape Viatris, and we believe we have a clear, defined path to return our company to top and bottom line growth from 2024 and beyond and to have the necessary financial flexibility to return significant capital to our shareholders as well as to continued business development. These include no additional significant LOEs on the horizon, our purposeful diversification of our core generics portfolio, which is now repositioned towards complex products; our decreased dependency on the commoditized U.S. generics market, today the total U.S. generics portfolio contributes approximately 11% of total net sales; and anticipated divestitures of certain non-core assets which, once completed, will not only help simplify the Company but will also help to further stabilize the remaining business. We remain confident in our ability to contain erosion to 2% to 3% and generate $450 million to $550 million in new product revenue annually, which we expect will not only offset the erosion but enable us to generate a 1% organic top line CAGR growth of the base in Phase 2. Taking into account the net divestiture proceeds and the significant free cash flow from our base business, we have the confidence that we will not only be able to deliver our Phase 1 commitment but also be able to increase our return of capital shareholder in Phase 2. Key assumption to support these targets, including base business erosion of approximately 2% to 3% being fully offset by new product revenue from our pipeline, the return to growth will also be supported by the ophthalmology franchise. The free cash flow generation, along with financial flexibility from divestitures, gives us confidence in achieving our Phase 1 commitments, increasing our capital return to shareholders and positioning the business for future growth in Phase 2. And Robert, I think you mentioned between divestitures, the SEC accounting as well as additional spend on new tuck-ins, it sounds like there's an additional $1 billion to $1.2 billion worth of headwinds on EBITDA, and that's without sort of the impact of China VBP rollout back on schedule next year. Now as we shift our attention and really have identified what we consider to be what was once a core asset, no longer to be really a core asset, where we want to focus our attention going forward, both in human capital and financial resources, we think that today is a very good example of the opportunity to really once and for all set the interest on the trajectory of growth and do it in a way where we can grow that top line, grow the EBITDA, continue to generate significant cash flows while returning a substantial amount back to shareholders and especially through the share repurchases. So if you take a look at the 1% that we see in the base business alone and then add the Oyster Point asset on top of that, that's how you get to the 3% revenue CAGR from '24 to '28 and a 4% to 5% EBITDA growth from there."
}