{
    "symbol": "VTRS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 11:08:06",
    "content": " And though we are not giving guidance for 2024, I am even more confident today that we will not only generate a minimum of $2.3 billion of free cash flows, excluding transaction costs and taxes, but now also see the potential for accelerated top line growth from 2023 to 2024 as well. In 2022, we delivered total revenue of approximately US$16.3 billion, adjusted EBITDA of approximately US$5.8 billion and free cash flow of approximately $2.5 billion on a reported basis, at approximately $2.8 billion after adjusting for the transaction costs and taxes associated with the Biocon transition. By being laser-focused on our Phase 1 priorities, integrating the two organizations, generating $1 billion in cost synergies, deleveraging the balance sheet and strengthening the balance sheet, paying down at least $6.5 billion in debt, reducing our gross leverage towards our long-term target of three times, maintaining our investment-grade credit rating, returning capital to shareholders through quarterly dividends and the share repurchase programs and reshaping the company through key divestitures and acquisitions, we are successfully stabilizing the business. And as a result, although we're not giving guidance beyond 2023, we're confident in our expectation that 2024 will begin a period of renewed growth of Viatris and generate at least $2.3 billion in free cash flows per year, excluding transaction costs and taxes, of which we intend to earmark approximately 50% annually to be returned to shareholders in form of dividends or share repurchases. As mentioned, although we are not giving guidance beyond 2023, we expect to have at least $2.3 billion in free cash flow from the underlying business in 2024 before any divestment cost and taxes. As a result, because of the Biocon transaction closing in late November, we're adjusting our guidance down by approximately $86 million in total revenue, $31 million in adjusted EBITDA, and $20 million in free cash flow relating to the exclusion of results since closing. And if I just got a second clarification one on the 2024 free cash flow number, I know you're not giving formal guidance, but that $2.3 billion of free cash flow, just are on the same page, can you just elaborate what's included in that number as we think about whatever you can say on EBITDA versus one-time costs, what you have for divestitures, et cetera? I think the new piece of information that we telegraph today, even though we're not giving guidance for 2024 and the fact that we're showing growth now in 2023 top line over 2022, when you take out the biosimilars business, is the accelerated growth we see in top line from 2023 to 2024 now."
}