{
    "symbol": "EURN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 14:45:25",
    "content": "  Operator: Good day, and welcome to the Euronav Fourth Quarter 2022 Earnings Conference Call. I'd now like to turn the conference over to Brian Gallagher, Head of Investor Relations. Good morning and afternoon to everyone, and thanks for joining Euronav's Q4 2022 earnings call. Before I start, I would like to say a few words. The information discussed on this call is based on information as of today, Thursday, the February 2, 2023 and may contain forward-looking statements that involve risks and uncertainties. Forward-looking statements reflect current views with respect to future events and financial performance and may include statements concerning plans, objectives, goals, strategies, future events, performance, underlying assumptions and other statements, which are not statements of historical facts. All forward-looking statements attributable to the company or to persons acting on its behalf are expressly qualified in their entirety by reference to the risks, uncertainties and other factors discussed in the company's filings with the SEC, which are available free of charge on SEC's website at www.sec.gov and on our own company's website at www.euronav.com. Each forward-looking statement speaks only as of the date of that particular statement, and the company undertakes no obligation to publicly update or revise any forward-looking statements. With that, I will now pass over to Chief Executive, Hugo De Stoop to start with the conference slide on Slide 3. Thank you, Brian, and good morning or afternoon to wherever you are, and welcome to our call. I will run through the Q4 highlights before passing on to Lieve Logghe, our CFO, who will then highlight key factors over the quarter and important work the finance team have done in increasing, again, our liquidity through sustainable financing. After that, Brian will run you through some current market trends before I return to summarize our strategy and where we believe we are in the current cycle and outlook. The strong demand for tankers reflected in higher freight rates was created by 3 factors: seasonal pattern into the Northern Hemisphere winter, a sustainable supply of oil from OPEC and non-OPEC. And then finally, a repositioning of the world fleet ahead of the embargo on crude from Russia that was enacted on December 5. Given our current corporate situation in full respect to the combination agreement with Frontline, we are unable at this stage to release dividends beyond the trees and minimum outlined in that agreement. However, to give some guidance and reassurance to our investors, we are indicating what level of returns could have been and this in line with our past commitments. Future developments will determine if, how and when this can be returned to our shareholders. Our leverage has improved positively to 45%, boosted on one hand by incoming cash from the higher freight markets, and on the other hand, from sales proceeds of some older vessels. This figure was clearly boosted by $62.6 million of asset sales, reflecting our continued fleet renewal program. Such capital gains are, in our view, correctly retained within the capital structure of our business and not for distribution. It is important, this capital is recycled into new and more energy-efficient fleet, which we have done and we'll continue to see with these 7 vessels currently under construction. Over half our financing now comes from sustainability-linked sources, making Euronav the leader in the sector and among shipping companies globally. The new facility we agreed, totaling $377 million comes with some challenging ESG objectives, including social targets for the first time, but also with a higher incentive of candid when hitting such targets. This change in the incentive structure, we believe, has further to run as this gives motivation to increase the scale and penetration of our sustainable funding. With that, I will now pass it back over to Brian Gallagher to give some thoughts on the current market cycle. I start with the slide from the last sector we gave in Q3, illustrating the very real step change that we've seen in the oil on the water and in transit. And the positive follow-through is had on freight rates, especially over the last -- second half of 2022. Historically, as one would expect, there's been a very positive correlation between time 28 and volumes of cargoes on the water, but the Russian mid-dislocation started last March and subsequent increase in ton miles across the tanker sector has given a structural boost to our markets. This provides a strong base going forward for the sector, along with the age of the world fleet, which is at a 22-year high, and the fact that order books were a 40-year low, giving a very, very strong vessel supply signal. The other key factor short term for investors is also to look at China, which we now look to analyze on Slide 9. The cargo accounts for February and March, in particular in the VLCC sector, have been very, very encouraging and positive as China opens up an activity returns. And as I mentioned, we are starting to see the early signs of this. Whilst there was a lot of noise and clearly, there was a lot of dislocation itself within Russia with refinery shutdowns, production shutdowns and maintenance programs, volumes are now back to levels that we saw pre December 5 and the Unaoil. Production levels were also back to November run rate and also the nature of the crude and sport trade is changing with more evidence of more ship-to-ship transfers occurring across Europe and in the Mediterranean on to larger vessels in particular, VLCCs, with Siedmand-Apramax  now are doing more shuttle-type runs between those low tensions rather than the entire journey themselves to the prior is. So in summary, our short-term market views continue to remain very, very positive and our current trend is very supportive as we move into Q2. The recent firming in freight rates have been driven by shorter-term factors, and this will now give way to very solid longer-term drivers. The global fleet is all by historical standards, and yet the order book is at 40 year lows, but no one is ordering because of the high price regulations and time to delivery as shipyards are not able to deliver tankers until 2025, 2026. On the demand side, we see China returning to normal levels of demand, a global economy bringing back even modest levels of demand growth, and all of that oil needed to be transported further distance than in the past. Indeed, Euronav delivered on its promise to be an energy transition leader in the past 5 years and accelerated that in the past 12 months, and we'll continue to do so. Now on to the traffic lines, Slide 15. This time, demand is driven mainly by the prospects from China reopening. That is true, but there still remains some upside in investment supplies and also in demand in our view. With that, I would now like to pass it back to the operator, but with a final word. Given the sensitivities and regulations around that process, we will not be in a position to take questions on that. Now, back to the operator to take the other questions. First off, I can commend you, you and the team for being able to continue really executing on the business here, given all the distractions. I appreciate the comments you made, Hugo, just before we started the Q&A session, especially regarding arbitration ruling. No, I think it's a very good question. I mean, summary proceedings are dealing with aspects that require urgency in a judgment. So I may take an example, which is, unfortunately, a couple of divorce, husband has the title on the house -- he doesn't know what the judge will decide whether it's why I can stay in the house, have the house or whatever. And if he sells the house, then there is nothing left, say, in the estate, maybe the money body can spend it. So an emergency judgment will say, you cannot sell the house until we have decided the outcome of the divorce and who gets what. So it's not on the merits, it's not on whether or not -- there were some damages created, whether or not there was the right terminate, et cetera, et cetera. It's really to see what should be sort of frozen until -- or for a certain period of time and probably until there is a judgment on the fundamental state, which are called the merit. And I think that it is for them to express what they would do if the outcome is favorable to them, I can only repeat what we have said in the press release, which is that we at or continue to be constructive and try to find solutions to all the problems. And obviously, there are 3 parties around the table. We're not the type of people who say, well, we are all enemies, and let's go to war. And as long as the 3 parties have the same attitude, I'm sure that we will find a very positive outcome that will be beneficial for all the shareholders, which also means that probably nobody will have the perfect solution that they want for themselves, but it will be a compromise and we very much hope that that will be the case. When I don't know, how I don't know. Obviously, a very complicated situation, but one that can be resolved. So I appreciate the time you go, and I'll pass it over. On China, I guess you're seeing less U.S. crude exports to Asia being one of the main reasons for the -- in the VLCC rates. It's -- well, the facts are correct. Let's not forget that when we are talking the U.S., it's very important for ton-mile, but in fact, we're talking about the West Coast of the Atlantic Basin. So it's the U.S., but it's also Brazil in the next -- well, starting now, but in the next 2 or 3 years, it's also going to be Guyana. So there's a lot of expansion in the production of oil coming from what we call long distance, very positive tone light. The second aspect is that there was a lot of export from the U.S., but they were mostly going to Europe. So -- in fact, if you say 2 cargoes going to -- or 3 cargoes going to Europe, is the equivalent ton mile and on cargo going to China. So it is complex, and we are a little bit -- we have the same visibility that the new guys have. And as I said, I mean, it depends on how many barrels, how many cargoes are being released from different places and that has always been difficult in all markets to forecast that. Overall, we see that there are more restrictions than in the past due to the Russian situation. And overall, we see that these cargoes at least have to complete much further distance than in the past, and that's positive. About China, in particular. Obviously, China is no reopening. Let's not forget that we have had our waves, but they are having their first real wave now. And once that is over, we are very optimistic about the fact that the economy will grow massively compared to the previous quarter, which was -- which were hampered by this situation. Well, we will see. That's it for me. First, I just want to be clear, in the last cycle, it was an 80% payout ratio. And of course, mixed with dividends and buybacks, and that's what you're ideally hoping for in this cycle. And the second part of that is, I do understand that February 7 is only 5 days away. But from your divorce example, it sounds like that's only making a determination on whether the house can be sold or not. So on the first part, you're absolutely right. And obviously, the share price will be a very important factor that we take into account as much as the outlook and to a certain extent, capital allocation, but that's no different than what we did in the past. On the second part -- it's -- well, it's very complicated. So until next Tuesday, it's difficult to give you an exact or precise date, especially because even on the merits, we don't know how long it will be, but quite frankly, we're all business plan. I mean, this is a very important transaction, as you can imagine, but not being able to return any capital to shareholders for launch period of time would not be ideal for the business. My second one kind of goes along the lines of how you defended that answer, focusing on the business, but being businessmen. -- to 25% shareholders, if the arbitration goes 100% in your favor, I would think the next step would be a shareholder vote, but a shareholder vote would be the merger, we have 2 25% shareholders who apparently don't want it. It's only a couple of days away, and I really don't want to risk anything by commenting on something that would be great. The first question is, operationally, I've seen that your reported breakeven, the breakeven for the P&L has gone quite a lot. Can you maybe explain what can be expected there looking at 2023, also given the strong rise in inflation and in wages. And the second question, yes, is on corporate governance -- have you agreed with the future marriage with frontline and now certainly your husband-wife, no longer wants to marry without giving any reason at all and really stepping you and your team in the back. So you're very far because you're allowed to ask one question, one sentence, you asked 3 or 4. I think the first one, I'm going to give the word to leave about OpEx inflation, if I understand well, knowing that it has come down year after year, certainly, in the last 4, 5 years, and that was due to an exercise in trying to use economies of scale, and that does take time. But it is, as you've seen, paying off very, very well. So indeed, we have to take into consideration, and we have budgeted for an inflation increase between 4% and 5%. because there, indeed, we still can optimize it because as Hugo mentioned, we did a step down over the 2 or 3 last years. But now this -- because of inflation everywhere popping up, it's a topic which will hit negatively but to a smaller amount of our OpEx. And then combined with the fact that also for technical and fuel loop oils, we will have a bit of a negative impact or inflation kicking in also in the environment of 4% to 5%. So globally, looking to our budget, we are speaking here for 4% to 5%. The second part of your question, it's a complex one, and I'm not sure the appropriate forum, but maybe I can explain in theory. So in some contracts, you have termination close and then each party has a termination that can be well, financially compensated or nothing here. The termination clause is pretty clear, but Tuesday, we will see whether there was any right to even it or not. And let's wait until Tuesday to see indeed is the reason for which frontline is terminated, we are valid or not, I'm not a judge, so I could not help you there. On the financial side, I think that we first need to see what comes out on Tuesday, even though that's not on the merits and the medics is very much and leading to the financial part, but that's also a relatively complicated calculation that is being done as we speak. And I think that will agree with me in this kind of transaction where you're not simply buying something that is valued in the market, but where you're exchanging shares and the calculation becomes a little bit more complicated and each side will have to make its own. And then again, someone else called an arbitrator that will decide what is the right or wrong financial compensation. And 3 months later, people get very anyhow. And again, we are always talking about there is a problem, let's identify the problem and let's see if we can find a solution that problem. Maybe the solution is that we don't marry, maybe the solution is that we marry, maybe we change the place of the way. But this idea that because you no longer want to marry at a certain point in time, it's forever and that this person that you were in love with becomes an enemy is something that is not part of our philosophy. Well, that's not our job  crude oil. And honestly, I only have 24 hours in a day. In case you didn't hear me, I don't have any comment on that specific question. So given the structurally higher rate environment that we kind of expect here, given the regulatory uncertainty around future fuel technologies, et cetera, it seems like owners will have a pretty big incentive to hang on to older tonnage for as long as possible over the next few years. So this seems to me like it will create a real need for fleet renewal as we get further along towards 2030, not only in the tanker segment, but also other segments as well. And often, we are focused on the short term -- as you know, there are different technologies, which fuels basically greenfields that are being investigated. And then some people believe that ammonia will be better because there is no CO2 emission, but this technology does not exist today. Obviously, starting with smaller engine and because of the size of our ships, we have the biggest engine, and we have been told that this would be developed at a later stage. On the shipyard themselves, I think that it's true that there is some sort of a set capacity at the moment, which is spread between 3 countries. There are some efficiency, sorry, gains that can be done simply going from 2 shift to 3 shifts, which they used to do within the same space could increase marginally the capacities, but marginally in every yard means a few more ships. When you say everybody, in the shipping industry will have the same at the same time. I tend to slightly disagree if you allow me with you because we have seen that the guy carrying gas, but obviously, they are using gas as a fuel, and they will probably bet that green metal, sorry, green methane will be produced. When you look at the container guys, I think at the more we see -- we've seen a lot of orders also dual fuel LNG. But now, more recently, we're seeing a lot of people betting on methanol. And then maybe in the future, there will be also orders on ammonia and we're certainly a party that is interested in that development. So part of the industry, the gas carrier, the container guys, even some dry bulkers and some tankers have met already on some technologies and those technology will exist. As far as our industry is concerned, the reason why we have such a thin order book is because we didn't have the market allowing people to go to the shipyards with the cash that they had earned in the market. Now the picture is a little bit different, but the yards have been populated with many orders coming from many segments. And therefore, we see that for the next 2, 3 years, the capacity is constrained. So overall, I think that as I want to say, as always, I think that the industry, in general, the shipyard industry compared to the owners will find a way to produce enough ships when they are required. But it is true that what we are thinking of at Euronav is whether or not there is an advantage to be a leader, i.e., a first-time owner of a particular type of ships in our category. I mean, it could be a methanol dual fuel. You know that the last order that we placed for Suezmax, they are both methanol and ammonia ready, and we are continuously working with the yard, and we have a joint development program with HHI in particular, to add on to those ships as much technology as we can upon their delivery. So they're not completely dual fuel ready, but converting them is very likely in the future. And at this point, we don't want to make a bet on a specific field because if you look at the last 18 months, well, 12 months ago, everybody was saying it's LNG is not going to be anything else. Then suddenly, the wind shift a bit and now you see more order and do a few methanol. And I bet with you that in the future, maybe 2 or 3 years down the road, it's going to be able to do a few et don't feel ammonia so. As a follow-up, I just wanted to focus on a few of the new building vessels that you have taken delivery of. Depending on where you build your vessels, It's, I would say, a minimum of 5 tons up to 12 ton improvement. And obviously, because in our industry, we talk about TCE and the TC takes into account the consumption the improvement in the TCE is just a multiplier of the number of tons that you save per day times the price of the fuel at that time. So at the moment, I would say 5 tons, it's -- we're probably 600, I suppose, $600. If it's 10 tons and obviously, it's a lot more if it's 12 to then you make the math yourself. Then there is -- in addition to that, on the modern versus, certainly, the model vessels that we'll take at Euronav, we have also invested quite a lot on the digitalization platform that allows us to improve the voyage, I would say, the bone optimization, which takes into account a number of big data, such as the weather, the current, the temperature of the sea. I mean, all those little aspects have an impact on the consumption. And in the past, we could not take all of them into account because we didn't have the technology. The good news is when it works on the super modern chips, then we can also apply that same technology on the older ships, so we can also improve the consumption of all the ships, thanks to that and maybe other hardware equipment that we are constantly testing. I think that you look at the contract and you look at what close should continue to exist for the time being, as I've said, until there is a judgment on the fundamental right or wrong of terminating the contract and the damages that come with them. So it's really, as I said, the guy cannot sell the house because if the judge would award the house to the wife a year later, the house is no longer there, there is a new owner in it. So, it's very -- so he says don't sell the house until you have that outcome. Well, the supply is the new buildings, but also the recycling. And in order to turn it green, we would see a lot more recycling because when you look at the age profile, we should have seen a lot more recycling. First of all, the rate environment has improved. So obviously, now maybe less than last year. Secondly, and that was a reason pointed out earlier in this call, if everybody watch the order book and see that very few orders will be placed for the reasons that we already explained. Otherwise, you're really going to have a squeeze -- and last but not least, there was for a pretty -- well, a long period of time, there was a little bit of a cash squeeze into the cash buyers who are the recyclers of those vessels. And obviously, when you have a VLCC, I mean, it's a lot of money that you need to pay sort of in advance of recycling it and selling the scrap metal. That's it for me. Hugo, I think you've been really helpful kind of laying out your view here. I guess maybe what I don't know that we've heard this morning, though, is sort of earnouts management's view on what the future of the business should be. I don't know that that necessarily -- I guess maybe the question is, what do you guys want to do with the business sort of thinking bigger picture, maybe taking a step back from this potential ruling and thinking about the direction of Euronav from an M&A perspective. Is that still something that is attractive to you, understanding that maybe the deal that we've been talking about maybe can't get done. I just want to get a better sense of sort of where the heads are from management as opposed to some of the technicalities about rulings and various things about this past transaction, our pending transaction. That question is extremely refreshing, Chris. At Euronav, we -- well, first of all, we continue to operate the business. I'm very, very thankful for the remark that was done in the first question that when you look at the performance, we didn't forget to manage the business. And as a matter of fact, we have split a little bit the management team and some people are entirely focused on the business because that's what matters. So yes, continue to be focused on the current operation. We do believe that going forward, the market deserves to be consolidated, can be consolidated. And to a certain extent, we've been successful there. I mean, not only because of what we have done in the past, but also more recently because the pool has grown in numbers. But when you look at the evolution of the pool, we have had many owners with many vessels and those same owners has the capacity to add even more vessels. And then as far as Euronav is concerned, we definitely continue to believe that bigger is better. We do believe that the way we can service our clients who themselves are becoming bigger and bigger, will be better. if one day, you can have a one-stop shop for your needs of our transportation that would be best and that's a little bit what we're trying to do together with the pool, continuing to be a big member there. So yes, in short, if you were to ask the management of this company and the current board because let's not forget that the Board is setting the strategy together with management. The ideas continue to grow, find alternative. This one cannot -- if you cannot marry this beautiful lady that let's find someone else, and let's make it a happy family. Coming back and let's say, maybe in a repeat, but I also want to thank for a great execution in Q4, of course. And it really is busy, you cannot distribute more dividends right now. It's a combination of many things, has to be honest. And from time to time, you need to wait until the next step is all this produced to be able to watch it. Now fully agree, but you started to mention the merge, et cetera. And the only cases where I know that the husband and the white came together again when they certainly found out that there already was baby created -- so then the next question is, well, has there already been -- maybe being created, but probably not. Otherwise, people would get lost in translation. Well, I just wanted to thank everyone for attending our earnings call. And yes, hopefully, we will speak soon together. And certainly, next few days, an important day."
}