{
    "symbol": "VVOS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 18:05:19",
    "content": " Factors that could cause actual results to differ materially include, but are not limited to, the risk factors described in other disclosures contained in Vivos' filings with the Securities and Exchange Commission, including the risk factors and other disclosures in our Form 10-K for the year ended December 31, 2022, which was filed with the SEC today, and our other filings with the SEC, all of which will be accessible on the Investor Relations section of the Vivos' website, as well as the SEC's website. Also on the good news front, during the fourth quarter of 2022, product revenue increased 21% due to price and volume increases, as we sold 2,938 oral appliance arches for approximately $2 million compared to 2,707 during the fourth quarter of 2021 for approximately $1.7 million. And for the fourth quarter of 2022, we recognized approximately $200,000 in our Billing Intelligence Service revenue, consistent with what we reported in the same period the prior year and $100,000 in OMT revenue, again, consistent with the comparable prior year period. During the 12 months ended December 31, 2022, we enrolled 196 VIPs, net of cancellations, for a revenue of approximately $4.8 million compared to 197 VIPs and revenue of $8.5 million for 2021. During the year ended December 31st, 2022, we sold 12,281 oral appliance arches, for a revenue of approximately $7.8 million, a 29% increase in appliance revenue and an 8% increase in the number of appliances shipped compared to the year earlier, when we sold 11,355 oral appliance arches, for a revenue of approximately $6 million. And for the full year 2022, we had approximately $600,000 in center revenue compared to approximately $0.5 million for the prior year, and approximately $900,000 in OMT revenue compared to $300,000 in 2021 due to the introduction of this service in 2021, and increased demand for these services, resulting in a 3x increase year-over-year. Gross margin for the fourth quarter of 2022 was 60% compared to 71% during last year's fourth quarter, primarily driven by higher costs associated with increased sales volume of our appliances and increase in the cost of raw materials and VIP enrollments, as well as costs related to our new programs, including the sale and leasing of sleep image rings and OMT. Sales and marketing expense decreased by over $200,000 to $5.3 million for 2022 compared to approximately $5.6 million for 2021, primarily due to reduced expenses related to the annual Breathing Wellness Conference, and expenses related to the Vivos website. General and administrative expenses were approximately $6.9 million for the fourth quarter of 2022, compared -- and approximately $29 million for the year ended December 31, 2022, compared with approximately $9 million for the fourth quarter of 2021 and $25.8 million for 2021. I'll jump to the takeaway in this call, which is that by working with Vivos, we believe a single DSO practice can add about $1 million in annual revenue and $300,000 in EBITDA per year."
}