{
    "symbol": "RCEL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 21:03:13",
    "content": " And we are pleased to report record commercial RECELL revenues, which exclude BARDA revenue of $8.2 million compared to $6.7 million a 23% increase over the same quarter last year. Our commercial revenue was $15.7 million in the half year ending June 30, 2022 an increase of $4.4 million, or 39%, compared to $11.3 million in the corresponding period in the prior year. Our commercial revenue, which excludes BARDA revenue, was $8.2 million for the three months ended June 30, 2022, an increase of $1.5 million or 23%, compared to $6.7 million in the corresponding period in the prior year. Total revenue, which includes BARDA revenue, was $8.3 million in the current year compared to $10.3 million in the corresponding period in the prior year, which included $3.6 million in BARDA related revenue that resulted from our delivery of units to manage inventory for BARDA for emergency response preparedness. Net loss increased by 33% or $1.5 million to $6.3 million or $0.25 per share, compared to a net loss of $4.7 million or $0.19 per share in the corresponding period of the prior year. Relative to our six months ended June 30, 2022 financial results, our commercial revenue, which excludes BARDA revenue, was $15.7 million in the six months ended June 30, 2020 to an increase of $4.4 million or 39%, compared to $11.3 million and the corresponding period in the prior year. Total revenue, which includes BARDA revenue, was $15.9 million in the current year, compared to $19.1 million in the corresponding period in the prior year, which included $7.7 million and BARDA related revenue that resulted from our delivery of units to manage inventory for BARDA for emergency response preparedness. Net loss increased by 47%, or $5 million to $15.7 million or $0.63 per share, compared to a net loss of $10.7 million or $0.45 per share in the corresponding period in the prior year. Turning to guidance, commercial revenue in calendar year 2022 are projected to be approximately $30 million, excluding BARDA revenues, which represents a 20% increase year-over-year."
}