{
    "symbol": "SBGI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 14:05:26",
    "content": " When you look at the adjusted free cash flow we generate, excluding Diamond's consolidated results for the first 2 months of the year, Sinclair currently trades at a free cash flow yield of approximately 50%, which is more than double the broadcast industry average and an even greater disparity to major market indices. Media revenues for the quarter were up 5% versus the same period a year ago driven by higher political ad revenues and higher distribution revenues, offset in part by the lower management fee and lower core advertising due to political crowd-out and the other factors Rob discussed. The $836 million in media revenues, while below our guidance range was primarily due to timing of political, which we expect to capture in Q4; softness in a couple of ad categories; and higher core advertising crowd-out in certain markets where political is running very strong; themes, all of which I mentioned at our Investor Day. Adjusted EBITDA for the quarter grew 5% over the third quarter of last year mainly on the strength in political revenues, partially offset by the Diamond management fee deferral and the higher expenses as discussed. I want to remind everyone that in the fourth quarter of last year, we experienced the cybersecurity incident that negatively impacted advertising revenues by approximately $63 million. And as already mentioned on this call, this would put our full year political revenues at an expected $335 million to 334 -- $340 million, so $335 million to $340 million, which would be over 30% more than what we booked in 2018 and only down less than 5% compared to the 2020 pre-Georgia runoff presidential election year. Political revenues are the main driver for media revenues, increasing approximately 10% to 12% versus the cyber-adjusted fourth quarter last year of $862 million. Fourth quarter adjusted EBITDA is expected to be between $294 million and $313 million compared to $202 million pro forma last year, which is not adjusted for the cyber incident. So in the -- while Chris mentioned that we don't have the exit scheduled, there is one that's included in the free cash flow guidance, just over $20 million of exit distributions. And then going forward, that's one of the big reasons why we put out the 3-year CAGR expectation at Investor Day because we do have -- we're not -- net retrans will not grow in 2023, but we have between the end -- at the end of '23 and the beginning of 24, there's 70% of our subscribers up on the distributor side."
}