{
    "symbol": "SBGI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 14:21:01",
    "content": " After a breakthrough year, launching its national fast channel exclusively on Samsung TV Plus, T2 Sinclair's second original 24/7 Live Pro Tennis Network, will now begin rolling out on other free streaming platforms, expanding total homes reached by tens of millions and TC International's worldwide regional platform expansion plans continue with France, Spain, Australia and Latin America, all targeted new markets. With 50% of our big four subscribers renewing in the second half of 2023 and another 40% front-end loaded in 2024, we expect net retrans to decline in 2023, but grow in 2024 and 2025, such that our three-year CAGR grows low single-digit percentage. Turning to the fourth quarter of 2022, media revenues were up 19% versus the same period a year ago, driven by higher political ad revenues and higher core advertising, offset by lower distribution revenues and a lower management fee. Media expenses were 7% higher in this yearâ\u0080\u0099s fourth quarter versus last year, on higher network programming fees, higher sales expense on the favorable revenue and higher G&A expenses, but were favorable to guidance. Adjusted EBITDA for the quarter grew over the fourth quarter of last year, mainly on the strength in political revenues, partially offset by the Diamond management fee deferral and the higher expenses discussed. For the year, pro forma adjusted free cash flow was $847 million, representing a 95% adjusted EBITDA conversion ratio and over $11.50 per share. Media expenses are expected to be $604 million to $610 million for the quarter and $2,392 million to $2,407 million for the year, which includes roughly $75 million for new investments in technology and our pillars of growth that Chris discussed. First quarter adjusted EBITDA is expected to be between $99 million and $113 million compared to $200 million pro forma last year, with the decline primarily the result of the absence of political lower net retrans as discussed and the management fee change. So the $75 million that weâ\u0080\u0099re spending is largely on transformation efforts and what a big part of that this year will be our moves to the cloud, which does result in significant OpEx and CapEx savings in the forward  years starting in 2024, but really starting â\u0080\u0093 making a big impact to 2025 and beyond. And the broadcast radio head will also go to market at the end of this year, which will be needed for any cellularized build-out of the broadcast spectrum, which is how we expect India to roll out, also Korea is looking at that specifically and to the extent that single-frequency networks get built here in the U.S. And then the third significant project we have going on with Saankhya, which will also be ready for commercialization later on this year is the operating system required â\u0080\u0093 the software required to run components of that network on a sort of more telco basis rather than a broadcast basis."
}