{
    "symbol": "BLND",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 21:38:10",
    "content": " I'll cover 3 things today: First, I'll highlight our Q2 results and business trends, which are reinforcing Blend's underlying growth thesis; second, allowed our plan for realigning our cost structure and positioning Blend for future profitability; and third, I'll speak to key trends in our business, and how we'll continue to win going forward. As Nima highlighted, we continue to see growth drivers that reinforce market share gains within mortgage, ongoing revenue diversification led by consumer banking and marketplace and the opportunity to responsibly increase prices as we deliver greater value to our customers. On the Title365 side, we're raising our guidance range of $90 million to $100 million to $95 million to $105 million, largely attributed to the outperformance of our default and home equity products within that segment, which is expected to offset the decline in origination Title volume. We mentioned PNC, but there's a number of others that we've also signed in the last few months that have continued to grow our volume base as well as rolling out customers we sold before that, which is why you're seeing us outperform in the mortgage segment compared to the market. And the other piece in consumer banking more broadly, we continue to win there, whether it's home equity or personal loans or or other aspects of the mortgage life cycle that we haven't touched yet, we continue to increase our diversification of revenue, which has been a great way for us to not just expand our revenue base, but expand our TAM and create some countercyclical measures that make us less exposed to interest rates that might negatively impact revenue if things change. And so we're -- you're seeing some of the plans to become more profitable by cutting back on some of those things, and we'll continue to do so as well as driving those high ROI products for our customers in the short and medium term."
}