{
    "symbol": "BLND",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 23:08:02",
    "content": " For this call, I'd like to cover four topics; first, a summary of our Q1 highlights and our general operating environment; second, an update on current market conditions and how this impacts our business; third, how we're executing against our long-term growth thesis; and lastly, an update on how we're thinking about near-term management of the business and capital allocation. In fact, we delivered 3% growth in Blend Platform segment revenues as compared to Q1 2021, despite Q1 mortgage market volumes being down an estimated 44% year-over-year. At the end of Q1, 22% of our Blend Platform revenue came from Consumer Bank and Marketplace and approximately one-third of our total customer base now use one or more of these products. We are focused on the following three growth areas: first, helping our customers be more efficient through fully integrated software; second, delivering the best possible experience for our consumer banking product lines; and third, being the platform that powers the end-to-end value chain and home ownership. To summarize, with an industry-leading platform, a growing roster of customers, well positioned for the next upturn and increasing revenue diversity as we bring more customers live on consumer banking and marketplace offerings, we are in an excellent position to drive digital transformation at a time when institutions need it the most. The higher-than-expected result can be attributed primarily to better-than-expected Blend platform performance, both the mortgage and consumer banking marketplace and lower-than-expected year-on-year decline into Title365 revenue for the period. Non-GAAP operating expenses for the first quarter of 2022 were slightly under $69 million compared with slightly under $40 million in the prior year, reflecting higher personnel costs and sales commissions associated with our expanding teams focused on development, marketing and sales of new and existing products as well as the addition of costs from Title365. Meanwhile, and as a reminder, our anticipated 2022 consumer banking and marketplace revenue reflects triple-digit growth employ year 2021 levels, which includes the transition of revenue from the Title365 segment, as customers' transition to the Blend Platform and the Blend Title Solution as well as contributions from other consumer banking and Marketplace products. Our growing market share in mortgage banking is leading to significant outperformance against pronounced industry declines, while we're seeing solid consumer banking and marketplace revenue growth as more customers adopt our platform and our new products."
}