{
    "symbol": "BLND",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 19:32:04",
    "content": " We grew our Blend Platform segment revenue modestly by 3% year-over-year to $36.1 million despite a 63% decline in industry mortgage volumes for Q3 2021 to Q3 2022, according to the Mortgage Bankers Association. First, the migration of software-enabled title revenue to a Blend Platform as we fully integrated Mr. Cooper onto the platform; second, the strength of our performance in mortgage banking and related revenue relative to industry volumes; and third, roughly 50% growth in Consumer Banking & Marketplace revenue, excluding software-enabled title. One, our ability to cross-sell consumer banking products and mortgage add-ons like income and close; two, our ability to secure price increase on contract renewals due to increased value in the platform; and three, new marketplaces like software-enabled title. Our Consumer Banking & Marketplace revenue has grown significantly, as I noted at the outset, driven by the transition of Mr. Cooper to software-enabled title by integrating them into our platform, along with home equity and personal loan growth. Within Blend platform, our mortgage revenue declined by 27% year-over-year in Q3 to $19.9 million amidst the 63% mortgage market volume decline in the same period. Year-on-year, total nonmortgage linked consumer banking transactions grew by approximately 145,000 to approximately $229,000 in Q3, driven by additional home equity and personal loans as well as credit cards and deposit account openings being processed on our platform. Although economic conditions remain highly uncertain, our Blend Platform revenue expectations reflect lower expected mortgage volumes offset somewhat by continued growth in Consumer Banking & Marketplace revenue, including the migration of software-enabled Title revenue. So on the other aspects of why the Consumer Banking & Marketplace grew, some of it was add-ons like income verification, Blend Close, the digital closing solution, home equity lending is not an add-on, but it's an additional product that's grown and personal loans have also grown for us."
}