{
    "symbol": "COUP",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-06 20:32:04",
    "content": "  Operator: Good afternoon, ladies and gentlemen, and welcome to the Coupa Software First Quarter Fiscal Year 2023 Earnings Conference Call. Joining me today are Rob Bernshteyn, Coupa's CEO; and Tony Tiscornia, CFO. Our remarks today include forward-looking statements about guidance and future results of operations, strategies, market size, products, competitive position and potential growth opportunities. A reconciliation of certain of these measures is included in today's earnings release, which you can find on our Investor Relations website. It's been amazing getting back in front of customers to collaborate in face-to-face, real-time sessions to help them fully understand what we're doing here at Coupa. We're giving them visibility, control and agility over their business spending, helping them build foundational resilience in their back-office operations for the long term and empowering them to make strategic, data-driven decisions that yield positive outcomes for their businesses. As we look at our results, let me start by sharing a few financial highlights from the first quarter, this being our 53rd quarter of execution. In Q1, we delivered $196 million of total revenue, including $178 million of subscription revenue. We once again reported strong free cash flow margins, coming in at 23% for both, the quarter and the trailing 12 months. Our approach remains dynamic and agile in the context of consistently changing times, which we have navigated over the last 13 years of operational execution. As our business -- as business is planned for tougher economic times, we believe our model of growth with profitability makes us especially resilient over the long term. And speaking of resiliency, we were overwhelmed with incredible positive energy from the thousands of our customers and prospects that we connected with live at our Inspire events in Las Vegas and Berlin this quarter. As well, they are preparing to use our platform to help their businesses navigate the potential uncertainties ahead. Now, as we are all acutely aware, the global business environment is currently highly volatile. We have seen some early signs of potential softening in Europe, especially as the war in Ukraine and inflationary pressures appear to be weighing more on business leaders than they were before. Yet in this context, we remain agile and pragmatic in how we run our business and make investments. With that backdrop and a strong pulse on our business, we feel confident raising our subscription revenue guidance for both, the second quarter and the full year. Now more than ever, it's undeniable that business leaders recognize the importance of optimizing their business spend. Through our industry-leading BSM platform built on our vision areas of being comprehensive, open, user-centric, prescriptive and accelerated, we are providing our customers with one source of truth to run their businesses. And as we look to the coming years, we believe that we're on our way to becoming the de facto business spend management platform for CPOs, CFOs and with the support of forward-thinking CIOs. Now, our path to winning the BSM market and unlocking vast amounts of real measurable value for our customers is paved by our three-wave strategy: first, capturing all spend; secondly, optimizing every dollar spent; and finally, amplifying community value. For the first wave, capturing all spend, let me share a couple of customer stories that demonstrate how our platform increases operational efficiency by digitizing processes. The first story is that of CBRE, the world's largest commercial real estate services and investment firm. CBRE uses Coupa in 49 countries around the world, including in Japan where the digital payments process for more than 700 supply partners were streamlined. Not only did they reduce cycle times by more than 50%, they were also able to improve payment fulfillment in Japan by 85%, positively impacting cash flow. I'm appreciative of the comment they shared with us, which was: \"Coupa has made material improvements in CBRE's cross-functional collaboration internally and with their business partners. Another example of transforming business spend from manual to digital is that of Rivian, an electric vehicle automaker. By leveraging Coupa's ability to improve processes and drive automation, Rivian has maintained the same procurement operations team size while its overall employee base has grown 20x in the last 18 months. With Coupa, Rivian has gained visibility into and control over their spend and has benefited greatly from the scalability of our platform. As many of you know, a key component of our first wave is Coupa Pay. Also, we surpassed $10 billion of cumulative total payment volume in Q1 and are now processing payment transactions at a run rate of more than $1 billion per month. Now, let's move on to the second wave of our strategy, optimizing every dollar spent through suite synergy. The first example I'll share with you is that of Ally Financial, a financial services and insurance company that is experiencing firsthand the benefits of end-to-end business spend management. By taking a comprehensive approach, Ally is able to work more strategically and collaboratively across the organization, delivering strong ROI and maintaining the agility to make changes when necessary. Another example is Microsoft, who is a Coupa supply chain design and planning customer. With such a wide range of products for multiple types of customers that get delivered through so many different distribution channels, they clearly have an extremely complex supply chain to manage. Using Coupa's supply chain design and planning solution, Microsoft is achieving its goals of maximizing the cost-benefit equation, minimizing lead times and working towards being carbon-neutral by 2030, all with data as a driving force. Now, it's also data along with community collaboration that makes up the key components of our third wave, amplifying community value. With our cumulative spend under management reaching nearly $3.6 trillion this quarter, our customers are tapping into real-time spend data and prescriptions to better identify ways to reduce risk, increase efficiency and be more profitable. While the best is yet to come, we continue to unlock value for our customers through community.ai, and we see an increase in utilization of prescriptions by our customers. By linking negotiated contracts, the customer can ensure better pricing and compliance to the Company's preferred suppliers. Customers using the Antares app can access supplier risk at the time of sourcing but also provides ongoing monitoring of third-party data and instant visibility into supply risk scores across cyber, ESG, financial, geopolitical and operations. As we continue our pursuit of winning the BSM market, our thought leadership and innovation play an increasing role in the mind activation of our community, especially through ESG. To help these customers, we have introduced more than 80 different capabilities in our sustainable BSM toolkit to impact ESG. On the social front, we recently shared our own diversity, equity and inclusion statistics via vlog by our Chief People Officer, Ray Martinelli, and have reinforced our commitment to continued improvement in our own hiring processes. Along the lines of governance, we joined the Chief Executives for Corporate Purpose, an organization that advises companies on how to further their corporate-purpose strategies and shares actionable insights with a CEO-led coalition to address stakeholder needs. Now speaking of making an impact, let me share with you, Coupa's MVP award winners for Q1 who best exemplify our core values as voted by colleagues. I'll begin with Kate McIntire, who exemplifies our first core value of ensuring customer success. Next, Rahul Mehta was recognized by epitomizing our second core value, focusing on results. Rahul makes sure we aren't just delivering functionality, but rather using the feedback of all members of the community to deliver a solution that is highly impactful and adoptable from day one. Our customers commended her on her tireless work ethic, which resulted in clear value delivery. As we recognize our colleagues for their contributions, we're also humbled to be recognized for the value-as-a-service we're delivering to the market as a company. As I mentioned earlier, we couldn't have been more thrilled to reunite with these groups at our Inspire event in Las Vegas a couple of months ago and again more recently in Europe. We welcomed thousands of attendees who continue to embrace being united by the power of spend and who appreciate the value of being part of a global community of forward-thinking leaders from supply chain, procurement, finance, treasury and IT. They include ADM, AstraZeneca, BMW, DHL, General Mill, General Motors, Jabil, Lowe's, Mastercard, Maersk, Microsoft, Staples, Unilever, UPS, Walmart and so many more. Now, before I turn it over to Tony, let me restate the obvious that the global market environment remains uncertain, yet we are well positioned to navigate and thrive. We continue to deliver solid top line growth, best-in-class unit economics and strong free cash flows. Keep in mind that we built the foundation for this business during the heart of the financial crisis over a decade ago, and the discipline forged during those years is in our DNA. We are the leader in business spend management, which has a huge total addressable market. As Rob highlighted, we delivered strong top line growth, margins and cash flows for Q1. Total revenue for the quarter was $196 million, including subscription revenue of $178 million, up 27% year-over-year. Total calculated billings for Q1 was $188 million, up 26% year-over-year. Subscription calculated billings for Q1 was $170 million, up 37% year-over-year. In Q1, we benefited from some renewals that closed earlier than we anticipated, contributing approximately $10 million to calculated billings. If you make this adjustment, our reported subscription billings growth would have been 29%. Also in Q1, due to the strength of the U.S. dollar, particularly against the euro, both subscription and total calculated billings were impacted by approximately 200 basis points on a constant currency basis. For the trailing 12-month period, adjusted free cash flows were $171 million or 23% of total revenue. As we head into Q2, we continue to make thoughtful investments into our business to drive growth. However, along with growth and on the back of best-in-class unit economics, we also prioritize sales and marketing efficiency and free cash flow margins as key pillars of our financial performance. While we are focused on growth, we will continue to make investments thoughtfully as we continue on our path towards our long-term target of 30% to 35% adjusted free cash flow margin. Cash at quarter-end was $786 million, an increase of $57 million from last quarter. As a reminder, we define Rule of 40 as the total revenue growth rate plus the adjusted free cash flow margin for the period. This quarter, we reported $18 million of professional services and other revenue. In Q1 of last year, we reported $27 million. As we've highlighted in the past, the decrease is due to our planned migration of supply chain implementation work to Coupa partners and conversion of legacy term license contracts to subscription. In Q1 of this year, we had $3.6 million in supply chain, pro serv and license revenue. As I'll discuss in a few moments, we will be providing additional details on subscription billings, which is more reflective of the underlying health of our business. Also in Q1, our gross renewal rate was in our consistent historical range of 94% to 96%. The number of customers with annualized subscription revenue greater than $100,000 was 1,441 at the end of the quarter, up 27% from a year ago. And we ended the quarter with $1.3 billion in total RPO, a 35% year-over-year increase. With that, let's now turn to guidance. Before sharing guidance, as Rob noted, toward the end of Q1, we began seeing signs of some potential softening in the European demand environment driven by the Russia-Ukraine conflict, pressure on European currencies and inflation. Though we have not yet seen a meaningful impact on our business, we have factored this uncertainty into our guidance. For Q2, we expect subscription revenue of between $185 million and $188 million and professional services and other revenue of approximately $17 million, yielding total revenue of between $202 million and $205 million. With respect to calculated billings, given the impact of the year-over-year decline in professional services and license revenue, we are also providing guidance on subscription calculated billings, which is more reflective of the health and heart of our business. Also factored into our guidance is the assumption that FX rates will remain similar to today's rates, which would result in a 100 to 300 basis-point impact to our subscription revenue and billings results for Q2 and for the rest of the year. Given the timing of the $10 million in earlier-than-anticipated renewals in Q1 that will not benefit Q2, let me normalize our subscription billings guidance by first sharing guidance for the first half of fiscal '23. For the first half of fiscal '23, we expect year-over-year subscription calculated billings growth of approximately 25% on an as-reported basis and between 26% and 28% on a constant currency basis. Since we haven't shared this data in the past, I'll now share our historical subscription billings figures going back to the beginning of last year. For fiscal '22, subscription billings were $124 million for Q1, $173 million for Q2, $172 million for Q3 and $298 million for Q4. For Q1 of this year, subs billings were $170 million, and we expect approximately $202 million for Q2. Also for the first half of this year, we expect year-over-year total calculated billings growth of approximately 19% on an as-reported basis and between 20% and 22% on a constant currency basis. We expect Q2 non-GAAP operating income of $9 million to $12 million and non-GAAP net income of $6 million to $9 million, resulting in non-GAAP net income per share of $0.07 to $0.10 on approximately 87.5 million diluted shares for the quarter. We expect Q2 adjusted free cash flows of approximately $20 million, coming off the strong collections finish we had in Q1. Now, let's move on to the full fiscal '23 guidance. We expect non-GAAP gross margin for the year of between 72% and 73% and non-GAAP operating income for the year of $36 million to $41 million, resulting in non-GAAP net income per share of $0.21 to $0.27 on approximately 88.5 million weighted average diluted shares for the year. And I would also say, in Europe, that weakness feels much more of a lagging indicator than a leading indicator. As I mentioned, we just came back from Berlin, I think about two weeks ago, where we had just an incredible Inspire conference with nearly 2,000 people, many, many customers, hundreds of prospects, incredible energy, lots of conversations about transformational projects getting back on the rails that have been sort of arguably postponed for a number of years. So, we're feeling pretty bullish all around. Carrying on that last question a little bit, maybe one for Tony and one for Rob. But generally speaking, some of the softness we saw late in the quarter in Europe drives kind of a wider range of potential outcomes. If you think about 2009, 2010, 2011, some of the wind in the sails of the value proposition we offer were there and are here today, the focus on tightening expenditures, the focus on getting more spend on contract, the desire to have greater visibility to business spending. Today, we're incredibly viable. And the last component, I think, worth calling out as well. What we saw during COVID is that people become more and more aware of just how their back-office information technology capabilities were lagging those of front-office capabilities, particularly in the cloud. And that gives us an opportunity to really take folks in a much more modern, agile, resilient world with, as I mentioned, thousands of proof points to get them comfortable. I think you covered most of it, Rob, but -- and thanks for the question, Keith. Overall, I would say our guidance methodology has not changed from last quarter. There's always a range of outcomes, and now there's a broader range of outcomes given the uncertainty in European demand. You also have to consider the constant currency impact of between 100 and 300 basis points for billings in Q2 and for the rest of the year, and this is factored into our guidance. But definitely, we feel excited about our pipeline, and we're excited about Q2. Last quarter, you talked about sales capacity increases. Well, we're seeing really nice attach rate across the board. As you know, our average subscription value per deal has grown virtually every quarter now for 53 quarters. But specifically to Pay, the largest attach rate ever in this quarter, meaningfully greater than 30%. Mid-market, I mentioned, well over 50%. We're seeing strong uptake of virtual card in the enterprise, and we continue to push upmarket with our digital payments capability. As I noted in my prepared remarks, we're definitely still investing for growth, but we're doing so thoughtfully. You saw this quarter that we delivered 27% subscription revenue growth, and we had meaningfully higher sales and marketing OpEx as well as other areas. But we're doing so thoughtfully, and we delivered 23% free cash flow margins for the quarter and for the trailing 12 months. Part of our calculation, of course, is we meet every quarter and discuss our investments very carefully. And the confidence, Rob, that you have that this was a Europe-only issue given the war and the factors and not something you're seeing in the U.S., but are you being prudent in the sense that some of your outcomes do incorporate degradation of the same factors domestically? And then for Tony, I appreciate you guys talking about efficiency in cash flow a lot more in the script, and that makes total sense given what we're seeing both in the demand environment but also with valuations. This quarter, you talked about it on a trailing 12-month basis. Well, look, I would tell you, obviously, we're looking at every segment of our business both geographically as well as mid-market, upper mid-market, enterprise, strategic. And we look at a whole host of operational metrics to make sure we have not only a really strong portfolio effect, but that we're properly investing against opportunities in front of us quarter in, quarter out. With the exception of some of the late quarter softness we saw in Europe, I can tell you that all of our other segments are just really executing beautifully, and we're scaling them accordingly with their -- with how they're progressing along the way, making thoughtful investments as we've done for obviously dozens of quarters now. And Alex, on your second question, look, I mean, we definitely are investing in growth to take advantage of a large market opportunity and the momentum we have with our new business. And we're doing so thoughtfully, though, right, with respect to both, sales and marketing efficiency, unit economics, free cash flow margins. So, we're focused on both, top line growth but also thoughtful about free cash flow margin. But as we continue to grow the scope, the scale of our business, we obviously see opportunity in harvesting. And I would tell you that as with all elements of our business, we continue to make, as Tony mentioned, thoughtful investments quarter in, quarter out to make sure we maximize the opportunity for many years to come. And then on the net revenue retention, if you could help us unpack a little bit where the incremental add-ons expansion kind of deals are happening within the power user stack. There's just so much in there, and there's a lot of moving parts right now with the macro and supply chain. I would imagine that there's quite a difference today in terms of the mix of business you're seeing versus, say, a year ago. Well, look, first of all, in the mid-market -- and thanks to an incredible leadership and it's just an amazing growing team in mid-market. And so, we continue to just push into that market quarter in, quarter out. And we feel like it's very predictable as well, which is a wonderful thing to have from a portfolio effect perspective and just the continued growth -- for the continued growth of our business. From net retention and add-on, it's across the board. I mean you -- obviously, you have add-on business in terms of users that's across the board. But in terms of modules, it's everything from supplier risk to supply chain design and planning to contingent workforce. We're seeing utilization, we're seeing more and more inventory management, treasury, strategic sourcing. So, it's really across the board. So, that's what we're seeing there. I don't know if I would say that specifically, but I will tell you, as I look at the enterprise business, particularly what we saw in the U.S. and other regions around the world, the larger scale, more transformational projects are coming back on line, and we're engaging in the flesh, physically, with prospects. So, it certainly feels promising, and that's seen in how we're thinking about the business and how we're investing into the business. Rob, I was actually in that Microsoft session out of Inspire, and it was interesting to hear kind of the value proposition for them. I would say at the core, the -- sort of the negative element is that most companies are still in a very acute phase as it pertains to dealing with this supply chain disruption. So, engaging more broad transformational supply chain design and planning engagements hasn't been as fast as we would like. Having said that -- having said that, we're seeing incredible buildup in the pipeline of that area. So, boding very well for us, when you look at this in a kind of mid- to long-term arc rather than a short-term kind of add-on quick growth kind of arc. Rob, I mean, obviously, the climate -- talked about fundamentals in the environment of playing in your favor, obviously with the tech you provide. Well, look, as Tony mentioned, when we think about hiring and then we think about -- not just sales, when we think about hiring sales head count, we think about investment in sales training and enablement, when we think about discretionary marketing investments and how to place those, that is a quarterly planning process for us. We want to make sure we're very thoughtful in the way we manage our own business spending, Peter. But, as you could tell from the tone of both our comments, what we're seeing in the market is one that bodes well for us in terms of wanting to be a little bit ahead of the curve because it's returning results for us. Having said that, it's dynamic out there, and we're prudent executives that are going to be very, very thoughtful with the money that we have to spend against the opportunity. Tony, I'm hoping you can give us a little more detail on what you're seeing in the business with the return to office and particularly travel and expense volumes coming back. I think in the past, you've given us a little bit of commentary around the portion of the business that is tied directly to T&E expense management. So interestingly, when we look at our business spend index and look at the data there, it's showing a pretty steady increase in travel. Obviously, they're not fortune tellers, but that's kind of the consensus of what we're hearing out there. And that is incredibly good timing for us to have released our own travel booking solution, which we've been working on now for roughly a year or so, and that is just incredibly usable product that is in its early stages. It will begin its journey in the mid-market, primarily in the U.S., and we think it could be a really promising growth vector for us as travel continues to emerge. As Rob noted, we're very excited about our positioning as travel begins to reemerge from COVID. I'd also point out with respect to our spend under management figures, which are roughly $1 trillion running through our core on a trailing 12-month basis, that the large majority of that is from POs and invoices. And there's a small percentage in there, very, very small, that's directly related to T&E. So, we have hundreds of customers using our T&E solution, and we're excited about the go-forward. First, for Rob, it's going to be about vendor consolidation. We're hearing a lot from our enterprise software companies where because of their platform capabilities, they're seeing bigger deals, though, as they can displace point solutions. And then for Tony, last quarter, you did, I think, give some perspective on current RPO at about 33% growth. Well, look, I mean, the beauty of our deal size -- the positive on our deal size is that virtually every quarter, as I've shared in the past, they've continued to grow and 53 quarters of growth in deal size. So there's two sides to that, but generally quite healthy, generally quite healthy. It's all about getting that vision lock with the prospect around comprehensive business spend management, showcasing for them references in their industry in which -- in cases where we have literally hundreds in every industry, being the platform and the partner that's highest likelihood to help them succeed and lowest likelihood of failure. So, that's how it's faring for us. As you pointed out, our total RPO growth year-over-year was 35%. So, going forward, that's what we're going to focus on. Tony, you mentioned the move to emphasizing subscription billings. Michael, we definitely benefited in fiscal '22 from being very successful with the conversion of legacy supply chain licenses to subscription and also from rebilling customers at 100% for the deferred revenue components that came over at a 50% haircut. However, as we look forward, we're confident in mid-20s subscription calculated billings and mid-20s subscription revenue growth. I know the attach rate in mid-market, I know was quite a bit higher than in enterprise. Well, certainly, the mid-market is generally more greenfield as it pertains to every one of our modules, but we continue to push upmarket with pay capabilities not only in virtual cards but in digital payments. I will tell you, Joe, early enterprise adopters should be using the platform in the coming two to three quarters, which should drive much more transaction volume and should really bode well for us in terms of building up a revenue -- a reference base rather and being able to go wider and wider with the solution. So, we're feeling really good about the progress we're making there. It's not a one-, two- or three-quarter kind of story, obviously. It's a multiyear journey, but we're really into that journey now. And as we shared, I think, I guess it was Analyst Day 1.5-year ago or so, we're in this accelerate phase now where we're making it happen. You're breaking up a little bit there, but I think at the core of your question was how we feel about pipeline, particularly coming out of these in-person events. For certain, the movement of that pipeline from early stage through to close is something where we're strongly focused on. And my instinct, if I could be so bold, is that the pipeline that is touched physically, particularly in the enterprise, tends to move a bit quicker than purely through Zoom or virtually. And we want to be very prudent with how we manage our expectations for everyone involved, especially -- and especially how we make our investments quarter in, quarter out. So, if we adjust total billings growth for the early renewal, it looks like the upside was a little bit softer than what we've seen in the past. And then, as a second part to this question, just when we look into 2Q, the guide for subscription revenue and billings looks pretty strong, just given that it looks like 2Q has the toughest comp and some of the macro commentary you called out. So with respect to total calculated billings, first of all, as everyone knows, the U.S. dollar has been strengthening meaningfully against some of the foreign currencies, including the euro. Honestly, it's going faster than we even originally expected. And really, this is to the benefit of our customers and our subscription business. So, if you add back those two things, you get closer to mid-20s for total calculated billings. Thanks for taking the question…\n Robert, if you're speaking, we can't hear you. I know that can be a gray area at times, but just can you kind of help there would be appreciated. Well, so look, first of all, it should be noted that of the $3.6 trillion or so that's run through our platform cumulatively, a significant portion of that is in fact direct spend and has been growing in proportionality for years. And we've made significant strides in helping our customers manage inventory for their spend, help them manage complex strategic sourcing as it pertains to their expense, now over the last few quarters, helped them in their supply chain design and planning for direct spend. So for us, we're quite agnostic in terms of how we engage with our customers. We start from the indirect, the longest of the long tail, the most complex supply chain and direct spend requirements that they have and find ways to bring them into a modern cloud platform that drives value for them. So, it's boding quite well for us. Thank you, everyone, and we look forward to speaking to you next quarter."
}