{
    "symbol": "MCD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 11:08:08",
    "content": " Well, I think starting with -- we've talked about on a number of calls over the last several years that guest count is a very imprecise measure, and it's imprecise because of what we've seen with delivery, but also what we've seen with digital, where we're now getting multiple orders. Well, I think as you've heard, us and particularly me speak to, I think, particularly in Europe, we're seeing some quite strong headwinds due to the levels of inflation on things like commodity costs, energy prices and, of course, labor. I mean, I think -- obviously, we've seen significant levels of food inflation, significant levels of energy inflation, even though energy maybe hasn't gotten to the peak of where some were predicting because Europe's had a warm or milder winter so far. So I think it's this that's really going to help us stay focused on the category-leading momentum we have and make sure that we -- as we get out of these headwinds, we're in the strongest possible position. Maybe I'll just hook on to that a little bit because I think as Chris touched on, I mean, we're laser-focused on those two consumer-facing metrics and value for money and making sure we've got those affordable choices across our menu. I think certainly, the best way to work through any kind of short-term pressures is to continue to make sure we're driving strong top line momentum, which I think our quarter four results reflect, and it's certainly our focus for 2023. And as we get through these short-term pressures, certainly believe that, that strong top line momentum will mean that we're beginning to drive greater leverage and operating margin and anything that's kind of dependent on sales as we go forward like G&A. I think that's certainly -- and with the demand and volume that we've created, has created some challenges just in managing the capacity and the volume of customers we're dealing with in some of our restaurants across our owned markets."
}