{
    "symbol": "QRHC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 20:37:04",
    "content": "  Operator: Good day, and welcome to the Quest Resource Holding Corporation Third Quarter 2022 Earnings Call. At this time, I would like to turn the conference over to Dave Mossberg, Investor Relations representative. Thank you, Jenny, and thank you, everyone, for joining us on this call. Before we begin, Iâ\u0080\u0099d like to remind everyone that this conference call may contain predictions, estimates and other forward-looking statements regarding future events or future performance of Quest. Use of words like anticipate, project, estimate, expect, intend, believe and other similar expressions are intended to identify those forward-looking statements. Such forward-looking statements are based on Questâ\u0080\u0099s current expectations, estimates, projections, beliefs and assumptions and involve significant risks and uncertainties. Actual events or Quest results could differ materially from those discussed in the forward-looking statements as a result of various factors, which are discussed in greater detail in Quest filings with the Securities and Exchange Commission. Quest forward-looking statements are presented as of the date made, and we disclaim any duty to update such statements unless required to do so by law. In addition, in this call, we may include industry and market data and other statistical information, as well as Quest observations and views about industry conditions and developments. The data and information are based on Quest estimates, independent publications, government publications and reports by market research firms and other sources. Although Quest believes these sources are reliable and the data and other information are accurate, we caution that Quest does not independently verify the reliability of the sources or the accuracy of the information. These non-GAAP measures are used by management to make strategic decisions, forecast future results and evaluate the companyâ\u0080\u0099s current performance. Unless it is otherwise noted, should be assumed that any financials discussed in this call will be on a non-GAAP basis. With that said, Iâ\u0080\u0099ll now turn it over to Ray Hatch, President and Chief Executive Officer. Thank you, Dave, and thanks, everyone, for your interest in Quest. We delivered a 78% increase in gross profit, a 57% growth in adjusted EBITDA. We generated $73.4 million in revenue, $12.2 million in gross profit and $3.8 million in adjusted EBITDA. In the quarter, there was an adjustment of $850,000 for expenses related to one vendor at one of our recently acquired companies, which lowered our gross profit. Without that expense, adjusted EBITDA for the quarter would have been $4.7 million. And due to the nature of our pricing structure, gross profit dollars were not materially impacted by commodity price fluctuations. In addition, we continue to make positive progress optimizing recent acquisitions. We are moving new opportunities through the pipeline, which Iâ\u0080\u0099ll explain more in detail later. And we see relatively stable economic activity across our customer base, all of which positions us well for continued profitable growth during the fourth quarter and next year. Before I get into more detail, I want to welcome our new CFO, Brett Johnston, to his first earnings call with Quest Resource. Brett is a great addition to our team, and with extensive financial leadership experience, and Iâ\u0080\u0099m happy to have him on Board. Thanks, Ray, and good afternoon, everyone. Iâ\u0080\u0099m excited to join Quest, especially at this point in its history, and I am excited to be part of the transformation that is well underway. Quest has a unique value proposition in a very large market, and I see a lot of potential for continued growth. Plus, also has a strong culture and proven leadership, and Iâ\u0080\u0099m thrilled to become part of the team. Before I review the financials, Iâ\u0080\u0099d also like to thank Laurie Latham, our former CFO, for her ongoing support as we make the transition. Third quarter financial results were in line with expectations, and all the major growth drivers of our business contributed to year-over-year growth. Revenue increased 96% year-over-year due to a combination of growth from new customers, expansion with existing customers and M&A activity. During the third quarter, gross profit dollars increased to $12.2 million, which was a 78% increase year-over-year. In addition to incremental gross profit dollar contribution from acquisitions, we expanded service programs with existing customers, and we continue to see strong year-over-year growth from new customers that we have added in the past 12 months to 18 months. Additionally, growth will come as we optimize the delivery and cost structure of service delivery across our customer footprint. Over the last few quarters, there have been variations in the sequential comparisons for gross profit dollars. As was discussed on our last call, during the ongoing process of applying operational and accounting best practices to the acquisitions we completed at the end of 2021, we identified and made some one-time positive adjustments with some catch-up billings during the second quarter. Similarly, during third quarter, we identified a necessary adjustment that negatively impacted cost of sales. I will point out that this adjustment has not affected our expectations for our acquisitions, and our year-to-date results are in line with our plan and are consistent with the annual performance expectations we gave last quarter. As Ray said earlier, we were able to offset inflationary cost pressure with flexible pricing and cost recovery fees. Due to the nature of our pricing structure, which produced fairly consistent gross profit dollars per unit of measure regardless of commodity price fluctuations, our gross profit dollars were not impacted during third quarter. As was mentioned during the last quarterâ\u0080\u0099s call, we expect gross profit dollars during the second half to be similar to the first half of the year. Additionally, gross profit should benefit from continued momentum in organic growth and continued improvements from our integration efforts, and be partially offset by the return of a normalized seasonal pattern that we have seen historically during the fourth quarter. During the fourth quarter, we expect SG&A costs will continue to be about $9 million to $9.5 million. The increase reflects the added overhead costs from acquired business operations, ongoing acquisition and integration costs and increased investment in systems, processes and people to continuously improve our efficiency and scalability of our platform. During the third quarter, depreciation and amortization increased to $2.5 million versus $508,000 a year ago. During the third quarter, interest expense increased to $1.9 million versus $542,000 last year. Our cash balance was $7.1 million at the end of the quarter versus $4.2 million at the end of the second quarter, and $8.4 million at the beginning of the year. We used $4.3 million in operating cash flow during the first nine months of the year, and the pace of operating cash flow used slowed down to about $521,000 in the third quarter. The use of cash year-to-date and, to a lesser extent, in the third quarter, was primarily related to investment in working capital to support more than doubling the size of our company year-over-year. While our September 30 receivables balance was larger, I would point out that the collectibility of our receivables is within our normal expectations. As was noted on our last earnings call, we have had several new customers that have ramped quickly during the year. In particular, our industrial customers were onboarded with extended payment terms. During the third quarter, we transitioned those terms to a more typical payment schedule, which will cycle through during the fourth quarter. As such, we expect to generate positive cash flow from operations during the fourth quarter. That is, of course, barring any significant acquisition or meaningful step-up in organic growth from the current run rate. During the first nine months of 2022, CapEx was $627,000, and we utilized approximately $3.1 million in cash to finance a smaller acquisition during the first quarter. At the end of the quarter, we had $74.9 million in notes payable versus $67.9 million at the beginning of the year. At this time, Iâ\u0080\u0099ll turn the call back to Ray. Regarding inflation, as we have mentioned on previous calls, weâ\u0080\u0099re able to offset cost pressures with flexible contracts that allow us to pass through increases such as future surcharges. These pass-through increases have been in place throughout the year, including in the third quarter, and have not affected our gross profit dollars. Regarding volatility in commodity prices, we structure our agreement so the gross profit dollars are not materially affected by these swings. These are the same contract structures we have had in place since the early days of our company, when used motor oil was one of the largest recycling streams. We now recycle a wide variety of commodity waste streams being generated by our clients, including used motor oil, scrap metals, used cooking oil, plastics, pallets, cardboard and other commodities. The price and the value of these recycled commodities can fluctuate significantly from quarter-to-quarter, which was the case this past quarter. To give you an example, we estimate during this last quarter, there was a $6 million sequential decrease in the value of the scrap metals that we recycle for our clients. However, the gross profit dollars and the volume of these materials remained relatively even with the prior quarter. We continue to see stable activity levels across our end markets, and our value proposition is resonating well with both existing and new customers. Within our installed base of customers, we use the land and expand strategy to deliver growth. We added several new service capabilities with our recent acquisitions, and weâ\u0080\u0099re actively introducing those new services to our existing clients. In addition, we recently rolled out a new scrap metal recycling program at retail business locations. This new service line has been well received, and weâ\u0080\u0099re now implementing it with two existing customers, each of which we expect to generate seven figures in revenue at maturity. By adding new services like these and continuing to expand geographies, we feel confident that existing customers will continue to provide a major contribution to our organic growth for years to come. On top of growth from existing customers, during the last couple of years, weâ\u0080\u0099ve improved new client targeting and are closed in the right new clients. During the third quarter, we added new prospects and several large opportunities across multiple end markets. Since the end of the third quarter, weâ\u0080\u0099ve had two new seven-figure customer wins, one in the industrial end market and one in the automotive surface market. We will begin implementing our new industrial customer in January, and it will eventually ramp up to seven figures in annual revenue over the course of the following 12 to 18 months. In addition, by centralizing the management of all their waste streams with Quest, we can use our scale and expertise to improve efficiencies, divert more waste from landfills and maximize the value from recycled commodities. These are the core elements of our value proposition, helping our clients become more environmentally friendly in a cost-effective manner. As weâ\u0080\u0099ve grown in the industrial market, having multiple referenceable clients has helped us secure this new client. Specifically, our data platform and expertise in environmental disposal compliance allows us to efficiently manage the federal state and local regulations, as well as reporting and data archiving requirements of the specialty and hazardous waste streams from this customer. Along with this data platform, we also offer innovative processes to ensure compliance such as color coding system to manage the different containerized waste at each facility. As weâ\u0080\u0099ve discussed in the last couple of calls, weâ\u0080\u0099ve been busy integrating RWS and InStream, the large acquisitions were made at end of 2021. As Brett mentioned, the integration has cost of volatility and the sequential comparisons. As Iâ\u0080\u0099ve said before, there will be years like 2021 where we found several good deals of fair criteria, but there may be periods when we donâ\u0080\u0099t find any. Regarding our outlook, overall, our positive outlook for profitable growth has not changed. Now that weâ\u0080\u0099ve at least partially digested this growth, we expect to return to operating cash flow generation in the fourth quarter. Pressured to improve sustainability, increasing regulation and increasing cost of landfills are lowering the bar for adoption of recycling services. Based on all these factors and with the business we have in hand, weâ\u0080\u0099re optimistic weâ\u0080\u0099ll continue with positive momentum for the next several years. Thanks for taking the questions. It was one acquired company, one vendor, and it was some identifying expenses. As you recall, Aaron, and we talked last quarter through our diligence, our integration effort. We found a lot of client non-billings, meaning clients that have been received as services not billed, we caught up on that. This quarter, we also found something on the vendor side that hadnâ\u0080\u0099t been recorded properly, and thatâ\u0080\u0099s done now. And then maybe just on the pipeline, good to hear about a couple of those new wins. I think the close rate â\u0080\u0093 I think itâ\u0080\u0099s more about â\u0080\u0093 itâ\u0080\u0099s been slower to fruition, and I think a lot of these have taken longer to get done than anybody anticipated, including the client. And we feel like as we â\u0080\u0093 in this quarter, weâ\u0080\u0099ll get some nice â\u0080\u0093 more good news and hopefully, will continue on into Q1. So itâ\u0080\u0099s hard to quantify it, Aaron, because really what it boils down to is getting these things signed. But one of the indicative elements of it, I think, is important, several years ago or even a couple of years ago, our pipeline had a lot of customers that I donâ\u0080\u0099t know, maybe they were smaller in their potential purchase. These clients have all got, not all, but the vast majority, have got really significant ability for revenue. Theyâ\u0080\u0099re large multi-location, in some cases, industrial that are generating quite a bit of complex waste streams. So the funnel is bigger than it was, but weâ\u0080\u0099ve got to keep filling the top of it, Aaron, as we get these things closed on the bottom. Thanks for taking the questions. You talked about â\u0080\u0093 I think, if I heard you correctly, three customer expansions and one in a wood pallet. I was going to say those are â\u0080\u0093 yes, those are existing clients, great clients, and weâ\u0080\u0099ve added some service profiles, some service abilities capacities that weâ\u0080\u0099ve been able to cross-sell into them, which is really exciting. Yes, itâ\u0080\u0099s a great question, Gregg. I mean, this is something weâ\u0080\u0099ve been focused on for quite a while. I mean, we all â\u0080\u0093 and weâ\u0080\u0099ve talked about this. And so what our systems that weâ\u0080\u0099re investing in and allow us to be quicker, more automated, more accurate to allow builds in and build out in a much more efficient way, which allows us to add new revenue volume with relatively little additional G&A. And also, weâ\u0080\u0099re expanding our capabilities as far as reporting data back as well on an ongoing basis. But the net effect, Gregg, if you boil it all down, thereâ\u0080\u0099s a lot of complexity associated with the charts that show what weâ\u0080\u0099re doing. But at the end of the day, it allows us to do a lot more with a lot less, which enables us to rapidly grow without having to go find a lot of people to help us do it. Itâ\u0080\u0099s been â\u0080\u0093 weâ\u0080\u0099ve been waiting all year, and it sounds like thereâ\u0080\u0099s opportunities for more of those things in the pipeline to cross the finish line potentially this year. You look at your, letâ\u0080\u0099s say, portfolio of customers, do you have â\u0080\u0093 is there a way that you can gauge how many of your customers have â\u0080\u0093 Iâ\u0080\u0099m not sure, Iâ\u0080\u0099m trying to figure out the easy way to say it. Well, thatâ\u0080\u0099s the term that we use here. I mean, I can tell you, I canâ\u0080\u0099t think of a single client where thereâ\u0080\u0099s not more opportunity, but some thereâ\u0080\u0099s a lot more than others. And I will tell you, I canâ\u0080\u0099t emphasize enough the expanded capabilities like the cross-selling that some of these acquisitions brought us to sell into our significant client base. We have a client services group that just â\u0080\u0093 that really, really takes care of our existing clients. I just â\u0080\u0093 we know by client, but we donâ\u0080\u0099t really have a macro number probably. No, thatâ\u0080\u0099s a great question. I was hopeful as opposed to expecting, maybe thatâ\u0080\u0099s a better way to put it. So I would say, it definitely has the potential to massively exceed any expectation I have. And currently, itâ\u0080\u0099s more than I thought where we would be at this point. I donâ\u0080\u0099t know that weâ\u0080\u0099re seeing any change at this point, Gerry. Manufacturing, if anything, I think is thereâ\u0080\u0099s more onshoring going on. Again, Iâ\u0080\u0099m not an economist, but I can look at what we see, and I havenâ\u0080\u0099t seen any indication of weakness in any of our end markets, frankly. On the new customer win side, I would say â\u0080\u0093 and Iâ\u0080\u0099m not sure if Andy is on the call. Andy has done a great job on the sales side, work in our industrial side, along with Stephen and others. The food waste segment continues to grow because of the â\u0080\u0093 for no other reason, because of the landfill diversion goals, a lot of these grocers and manufacturers have and finding ways to meet those. So I mean, really, if I had to pick one, I would have to say our industrial sector is strong. But the food waste side has got a lot of interest going, too, as well. Can you help us a little bit understand not whatâ\u0080\u0099s the nature of that, but how would it be distributed during the year. I think on the people side, weâ\u0080\u0099re in the late innings. Itâ\u0080\u0099s difficult when your company is purchased by another company to adapt as well, and I think theyâ\u0080\u0099ve done a fine job. On the process side, far along, but maybe not quite as far along as the people side. So Iâ\u0080\u0099d say, process standpoint, and also on the vendor relations sourcing procurement side, I think theyâ\u0080\u0099re probably in the middle to later innings as well. On the systems side, thatâ\u0080\u0099s lagging behind a little bit for obvious reasons. But weâ\u0080\u0099re on down the innings on all three, just different stages on those, George. And then just want to point out something, but Iâ\u0080\u0099m not exactly sure how to wrap that into a question. But like at the beginning of 2021, weâ\u0080\u0099re looking at customer concentration, and the top two were 47% of revenue, and now the top two are just 21%. So it seems like the customer risk has massively, massively sort of come down with the growth and also partly with the acquisition. Well, Iâ\u0080\u0099ll call that a question, George, so I can answer it. George, the interesting thing is we donâ\u0080\u0099t focus a lot on those guys. I know that sounds silly, but we focus on finding the prospects that need, what we do best. Thereâ\u0080\u0099s a lot of people that pick up trash, thereâ\u0080\u0099s a lot of people that will pick up used motor oil. And so competitively, I donâ\u0080\u0099t think the front has changed at all, George. And with no other questions in the queue, I would now like to turn the call over to Ray Hatch for any additional or closing comments. Weâ\u0080\u0099ve come a long ways, and we really got a lot of traction and moving forward. And I want to take another moment to, one, welcome Brett to the team; and two, to thank Laurie for all of her service and all the things sheâ\u0080\u0099s done for all of us. We appreciate her, and weâ\u0080\u0099re excited to have Brett as well."
}