{
    "symbol": "TV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 19:04:06",
    "content": " During the third quarter, Grupo Televisaâ\u0080\u0099s consolidated revenue reached Ps.19.3 billion, representing year-on-year growth of 3.6%, while operating segment income reached Ps.7 billion equivalent to a year-on-year decline of 6.7% mainly driven by the amortization of costs related to the transmission rights of the World Cup at Sky. As a reminder, during the COVID recession in 2020, excluding the other businesses segment, as most of them were fully closed for a significant portion of the year, Grupo Televisaâ\u0080\u0099s segment revenue and operating segment income, where our three core operations grew by 2% and 2.1% year-on-year respectively. In addition, we firmly believe that weâ\u0080\u0099ll continue to deliver strong revenue growth at TelevisaUnivision and resilient operating performance at Grupo Televisa during the fourth quarter driven by several factors such as the monetization of the World Cup rights, increased advertising spending in Mexico due to the Qatar World Cup, midterm elections in the U.S. and solid RGU net adds in the reminder of the year at cable. In the U.S., advertising revenue growth slowed 5% year-on-year compared to 12% increase in the first half of the year due to relocation of advertising budgets from the third to fourth quarter, the lack of major soccer tournaments and a softening of the ad market. In Mexico, advertising revenue rolled up 8% year-on-year also slowed compared to a decrease of 11% in the first half of the year as clients pushed advertising spending to the fourth quarter to benefit from the World Cup transmission. A suspected total growth has went down by 12%, but with a significant improvement in postpaid additions, we went from 11% to 23% postpaid share in October and we expect Q4 to be the first quarter in two years to be postpaid net adds positive. In terms of strategic alliances to increase Sky telecom revenue stream, in our previous call, I mentioned that in second half of this year we would be launching a new mobile service build on AT&T network like an MVNO model. In terms of financial performance, revenue declined 8.7% compared to last year third quarter driven primarily by lower prepaid recharges and a decline in our postpaid customer base in Mexico and more importantly, in Central America. At TelevisaUnivision, solid operating and financial performance during the first nine months of 2022, with year-on-year revenue growth of 9% midterm elections in the U.S., the Qatar World Cup and the successful launch of our global streaming platform should allow us to deliver double-digit revenue growth for the second consecutive year, which has allowed us to finance our digital transformation strategy and the launch of our two-tier global streaming platform."
}