{
    "symbol": "TV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 11:24:03",
    "content": " During the second quarter, Grupo Televisa's consolidated revenue reached MXN 18.5 billion, representing year-on-year growth of 0.3%, while operating segment income reached MXN 7 billion equivalent to a year-on-year decline of almost 5%. As you may recall, during the COVID recession in 2020, excluding the other businesses segment, as most of them were fully closed for a significant portion of the year, Grupo Televisa's segment revenue and operating segment income for our 3 core operations grew by 2% and 2.1% year-on-year, respectively. Despite a higher probability of a recession, we still expect growth in 2022 to be back-ended loaded both at TelevisaUnivision and Grupo Televisa driven by several factors such as the monetization of the World Cup rights, increased advertising spending in Mexico due to the Qatar World Cup during the fourth quarter, mid-term elections in the U.S., solid RGU net adds in the remainder of the year at Cable and closing pending contracts for new projects at our enterprise operations. The company delivered another outstanding quarter with revenue of $1.1 billion, growing 11% year-on-year on a pro forma basis, while EBITDA of $373 million, declined by 8% as streaming investments ramp up, following the launch of the ViX AVOD service on March 31 and ahead of the ViX Plus SVOD service launched on July 21. Moreover, during the first half of the year, TelevisaUnivision's revenue has increased by 11%, while EBITDA has just declined by around 1%, a remarkable achievement considering the launch of ViX and ViX Plus, which illustrates the power and uniqueness of our combined assets as well as the focus and discipline of our execution. July 21st marked another milestone from our streaming service with the launch of our completely new SVOD service ViX Plus, featuring more than 10,000 hours of ad-free premium entertainment programming in its first year and up to 7,000 hours of live sports with a monthly price of $699 in the U.S. and MXN 119 in Mexico. Thank you very much, Alfonso. In terms of financial performance, revenue declined 7.7% compared to last year's second quarter, driven primarily to lower prepaid recharges and decline in postpaid customer base in Mexico and Central America. At TelevisaUnivision, solid operating and financial performance during the first quarter -- sorry, during the first half of 2022, the very strong upfront announced both in the U.S. and Mexico, the new licensing contracts with virtual MVPD in the U.S., the Qatar World Cup and the successful launch of our global streaming platform should allow us to deliver double-digit revenue growth for the second consecutive year. Thank you very much, Alfonso. Thank you very much, Alfonso."
}