{
    "symbol": "MRVL",
    "quarter": 2,
    "year": 2022,
    "date": "2021-08-26 23:55:41",
    "content": " In today's call, Matt will comment briefly on our revenue performance by product group for the second quarter before transitioning most of his discussion to our results and expectations for each of our five end markets. We expect a sustained period of strong revenue growth from this end market driven by an increase in 5G deployments, which are still on the early stage of worldwide adoption and the ramp of our full platform of 5G products and multiple customers in their current generation of base station. Our automotive business is in its early stages of growth, given our design win traction and the growth expected in the adoption of Ethernet technology in cars, we expect the revenue contribution from this end market will become a larger portion of our total revenue over time. In our data center end market, revenue for the second quarter was $434 million, growing 57% sequentially and 62% year-over-year. On a year-over-year basis for our carrier end market, we project strong revenue growth to continue above 20% in the third quarter. Revenue for the second quarter was $223 million, growing 27% sequentially and 41% year-over-year with the majority of the growth coming from standalone Marvell products. Revenue for the second quarter was $57 million, growing 24% sequentially and 125% year-over-year, driven by the ongoing ramps in our auto business. As Ashish mentioned earlier, starting with the third quarter, we will only report revenue by our five end market to provide a more transparency about the key growth drivers of our business. So that's why I said earlier in one of the prior questions, there's blocking and tackling in Q3 and Q4, but we've been really working for the last six months in detail, even longer on how do we line up continued strong growth in calendar 2022, 2023, 2024 because this is going to be multi-year and many of these engagements by the way are also multi-generational."
}