{
    "symbol": "MRVL",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-07 23:49:10",
    "content": " And that's why we're continuing to be very bullish about the outlook for our overall networking business because the demand is clearly there, and we've now got supply coming online in the back half as well as into next year. As it relates to 5G in China, maybe just to kind of frame it in the bigger picture, I think, first, our own team internally, I want to give them credit, they did a good job for - in the first half, telling us last year that the mapping out the digestion phase, which is what's happened, so that's actually been in line with our plan. And we are trying to really manage it through the supply chain challenge, but we do think the combined company with the Inphi margin higher than 65%, we're going to trend higher going forward when we combine both companies, drive the top line revenue growth. So yes, overall, just I think you've heard in my remarks, I mean, we're just - it's been a journey on the storage side, and I've just got to thank our entire team for fundamentally transforming a business, which, if you go back 5 years ago when I showed up, and this wasn't just me, the whole management team, this was a business that was highly concentrated, HDD controllers only, selling all into 2.5-inch notebooks, okay? But I think you're right to integrate it over maybe a few quarter period, first half, second half or even one-year period to get the full view just because the manufacturing cycle times of some of these products can be several quarters. And those are things that, as we noted in my remarks, would be designs we win now that would ramp up starting probably in calendar 2023, 2024 and then go beyond that and that's also you would - you should kind of tie it together with that was when our 5-nanometer platform will be really in full production across multiple end customers, end markets and end applications. But the roadmap, notwithstanding, we're extremely pleased with this high-end platform that we announced, it's done really well in the market, revenues ramping significantly, and it's going to have a very good year, next year and beyond. And this environment has created a dynamic where pretty much the CEO level at all of our major accounts, they're willing to engage in this type of discussion, activate their materials teams and get everybody together so that we can plan this thing as a combined team, a Marvell team and a customer team versus two independent entities doing their own thing and the era of customers being secretive about their volumes or hiding the ball or not one you're doing just in time, that's kind of all out the window at this point."
}