{
    "symbol": "MRVL",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-02 22:33:04",
    "content": " Higher revenue, coupled with stronger gross margin drove non-GAAP earnings per share to $0.43, 13% above the midpoint of guidance, growing 72% year-over-year, which represents phenomenal growth in earnings. In our data center end market, revenue for the third quarter was $500 million, growing 15% sequentially and 109% year-over-year, exceeding our guidance. It's exciting to see the step-up in our 5G business, and we expect significant additional growth over the next several years as 5G adoption continues to grow around the globe, combined with Marvell content gains from designs we have won, but not yet begun to ramp. Revenue for the third quarter was $247 million, growing 11% sequentially and 56% year-over-year, with the majority of the growth coming from standalone Marvell products. Looking ahead to the fourth quarter for our enterprise networking end market, we project revenue sequentially to be up in the low to mid-single digits on a percentage basis and year-over-year growth is expected to remain very strong at approximately 60%. Revenue for the third quarter was $67 million, growing 16% sequentially and 114% year-over-year, driven by ongoing ramps in our auto business. In the third quarter, the stand-alone Marvell business delivered strong year-over-year revenue growth close to 30%. From a base of approximately $4.4 billion in fiscal 2022, we expect the combined Marvell and Inphi business to continue growing in fiscal 2023 at the 30% year-on-year rate we are currently achieving. Over the same time frame, our auto Ethernet connectivity business is expected to make significant progress towards driving revenue over $500 million annually, and our electro-optics PAM, Coherent and ZR portfolio is also projected to remain on a high-growth trajectory. Revenue in the third quarter was $1.211 billion, exceeding the high end of our guidance range, growing 13% sequentially and 61% year-over-year. As Matt mentioned earlier, we see continued strong demand across our end markets and improvement in supply to drive our top line revenue growth above 30% in fiscal 2023. And I think the other point is we really want – and I really wanted to contextualize the growth that we're seeing in Q3 and Q4 on an organic basis with Marvell growing 30%, Inphi growing 30-ish and that effectively continuing so that the investment community understood that this wasn't a short-term bump, but rather part of a longer period of sustained growth, which we believe actually has legs even beyond next year."
}