{
    "symbol": "NCLH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 13:52:11",
    "content": "  Operator: Good morning, and welcome to the Norwegian Cruise Line Holdings Business Update and Second Quarter 2022 Earnings Conference Call. I'm joined today by Frank Del Rio, President and Chief Executive Officer of Norwegian Cruise Line Holdings; and Mark Kempa, Executive Vice President and Chief Financial Officer. After which, Mark will follow to discuss our financials before handing the call back to Frank for closing remarks. As a reminder, this conference call is being simultaneously webcast on the Company's Investor Relations website at www.nclhltd.com/investors. Thank you, Jessica, and good morning, everyone, and thank you for joining us today. Over the past several quarters, we have reached many pivotal milestones as we continue the steady march of our post-pandemic recovery. On our last call, we had just welcomed the last ship in our fleet back to service, becoming the first major cruise operator to be fully operational. This quarter, we are pleased to report that we have reached another key milestone with operating cash flow turning positive for the second quarter. While our focus is on our profitable future, when I take a moment to reflect on the tremendous progress we have made since launching our great cruise come back just over a year ago, I can't help but be immensely proud of the entire team in Norwegian for rising to the occasion time and again and delivering impressive results. Working well alongside us has been the travel agent community who more than anyone can appreciate the challenges that we as an industry have overcome, and more importantly, can also see the tremendous opportunities that lie ahead. Our guiding principle has been a focus on the long-term profitability of the Company, particularly for 2023 and beyond, by protecting our long-term brand equity and building on our industry-leading pricing. With this ethos at the forefront of our business plan, we also continue to be opportunistic, exploring all options to accelerate our recovery. First, since we last spoke, we have seen further improvement in the public health and regulatory environment, which has allowed us to relax COVID-related protocols and align us more to the rest of the hospitality industry. Last month, the CDC discontinued its voluntary COVID-19 program for cruise ships. We're committed by local regulations, bringing us not quite an equal footing with land-based vacation and leisure alternatives, but significantly closer. To put it simply, vaccinated individuals, including those embarking on NCLH ship from U.S. ports will no longer have any pre-cruise related protocols, and those who are unvaccinated or choose not to provide proof of vaccination will be required to test negative within 72 hours prior to embarkation. These modifications or protocols are meaningful and give us additional flexibility to reach a wider cruising population, reduce friction and travel-related hassles for our guests and bring greater variety to our itineraries. In fact, yesterday's announcement was an instant catalyst, resulting in one of our top three best booking days of the year. Across the globe, we continue to see the easing of travel restrictions and reopening of ports to cruise, bringing us closer to a normal operating environment. While the decision was too late to have a meaningful impact on ship sailing in a second, and to a lesser degree, third quarters of this year, the change resulted in an immediate and sustained boost in booking volumes for future periods in the weeks following the announcement. Second, and despite recession and economic slowdown fears abounding in the broad marketplace, we continue to see a strong upmarket consumer, with booking trends continuing to show steady improvement week-over-week, which I will touch on in more detail later in the call. But at a high level, to evaluate the extent and willingness of consumers to spend on cruise travel, we typically monitor two key indicators. First is the booking window, which provides a peek into the consumer psyche about the future, given that cruise is a long lead time and relatively high ticket purchase. Second is our onboard revenue generation, which is a real-time now indicator of how our guests are feeling about their financial situation right now and while onboard our ships. Onboard revenue generation has continued to be impressive, even as we continue to ramp up occupancy carrying more guests across all ships and cabin classes. In the second quarter, onboard revenue per passenger cruise day was approximately 30% higher than during the comparable 2019 period. We continue to focus on enhancing our market-leading bundled offerings and increasing quality touch points with our guests starting from the time of booking to capture even more revenue pre-cruise, allowing guests to arrive on board with an ever fresher wallet, which ultimately results in higher overall spend. In fact, our pre-cruise revenue on a per passenger day basis for second quarter '22 is up over 50% versus 2019 levels. At a high level, guests who make pre-cruise purchases tend to spend approximately double that of guests who do not pre-book onboard activities. And while the broader economy has experienced a pullback in consumer spending for physical goods, we continue to see strong propensity for spending on travel and experiences, particularly from the affluent consumer. While consumer appetite for experiences bodes well for the entire cruise industry, we believe our company in particular is best positioned to outperform in this environment. Our three brands focus on providing upscale experiences relative to their respective industry categories, and therefore, skewed towards the higher-end consumer, which while not immune have proven more resilient than other cohorts in previous downturns. The last and arguably most exciting catalyst I want to touch on is our attractive pipeline of new builds, outlined on slide 5, which will greatly enhance our already world-class fleet and drive significant contributions to the top and bottom line. I just came back from Italy last week where we took delivery of Norwegian Prima, the first of six next-generation Norwegian Cruise Line ships, bringing our total fleet to 29 vessels with approximately 62,000 berths. Last week, we also celebrated the float out of Norwegian Viva, the second vessel in this groundbreaking new class, which is expected to debut in summer of 2023, as seen on slide 6. In addition to the new Norwegian vessels, we are also gearing up for the delivery of Oceania Vista in spring of '23 and Regent Seven Seas Grandeur later that year. So, I will show you once again on slide 7 how we've proven our ability over the years to absorb capacity and deliver outsized revenue, adjusted EBITDA and operating cash flow contributions relative to our capacity growth, and we fully expect to continue this trend. Turning now to our booking, demand and pricing trends summarized on slide 8. In the second quarter, our load factor was approximately 65%, in line with our expectations and a significant improvement versus the prior quarter of 48%. We expect load factors to increase to the low 80% range in the third quarter, with July already coming in at 85%. In terms of pricing, as you can see on slide 9, our net per diem growth in the first half of 2022 over the first half of 2019 pricing was significant at 18%. These results are consistent with our strategy of holding firm on our go-to-market strategy, outlined on slide 10, of market-to-fill versus discount-to-fill and maintaining pricing integrity by emphasizing high value over low price. As expected, our second half 2022 book position remains below an extraordinarily strong 2019, driven primarily by the lasting impacts of Omicron and the Russia-Ukraine conflict. That said, pricing for the second half of 2022 continues to be higher when compared to 2019, even when taking into consideration the dilutive effect of future cruise credits and the impact of premium priced Baltic itineraries from the Ukraine conflict, which is primarily concentrated in the third quarter. As we move beyond this transition year and focus on 2023, our full year book position is in line with 2019's record performance. And while we typically would not provide this level of detail, our performance in this area is so extraordinary that I just had to share it with you this one time. And while pricing will naturally tend to level off as we continue to build our book for 2023, it is nevertheless a testament that our steadfast strategy of focusing on long-term price increases over short-term load factors is indeed working as intended. When compared to the same time in 2018 for 2019 sailings and taking into account capacity growth of approximately 20%, 2023 sales are a whopping 40% higher. In addition, the quality and stickiness of our ticket sales for '23 sailings is also expected to improve, as a significantly higher proportion of bookings, 4 times the level seen in 2019, include air travel booked through our own air programs, which in the past has proven to be indeed stickier. As you can see on slide 11, our advance ticket sales balance stood at $2.5 billion as of the end of the second quarter, up over $300 million versus the prior quarter, despite approximately $1 billion of revenue recognized. On a gross basis, advance ticket sales build increased by over 40% to $1.5 billion in the quarter, the highest level in three years. In addition, approximately $1.5 billion of the total ATS balance at quarter-end is associated with bookings that are already within the final payment window, and therefore, subject to cancellation penalties. We are striving to reach our goal of record net yields and record adjusted EBITDA in 2023, welcoming 8 additional ships to our fleet through 2027 after Prima this year and leveraging all opportunities to maximize value for our stakeholders. Before I begin my commentary on our financial results and outlook, I would be remiss if I did not take a moment to thank our team of nearly 35,000 team members across the globe for their continued dedication, passion and commitment to excellence. We have made tremendous progress to date, which has led to the significant financial inflection point of generating positive operating cash flow in the quarter for the first time since the start of the pandemic. During the quarter, we returned our full fleet back to service with the relaunch of Norwegian Spirit in early May. Our load factor for the quarter was 65%, in line with our prior guidance, which reflects our methodical approach to ramping up occupancy while maximizing pricing. Numerous sailings across key regions and markets achieved over 90% and 100% occupancy, with particular strength in recent months in the Caribbean and Bermuda markets. We continue to expect sequential quarterly increases in occupancies, with load factors returning to historical levels for the second quarter of 2023. As we look to the third quarter, we expect this metric to increase by high single digits compared to 2019 levels. This is impressive considering the impact in 2022 of the Russia-Ukraine conflict on premium-priced European, in particular, Baltic, itineraries, which are heavily weighted to the third quarter. As a reminder, three ships were redeployed entirely as a result of the conflict, including one for each brand, and a total of 60 sailings across our fleet were canceled or modified. Like every company across the globe, we continue to experience pressures from inflation and global supply chain constraints. We are also experiencing pressure on food costs, although we have recently seen green shoots of prices moderating for certain commodities, such as beef and pork. In addition, we are starting to see shipping and logistical costs moderating from their highs experienced in 2021 and early '22. Lastly, in the first half of 2022, we continued to incur additional costs associated with our COVID-19 health and safety protocols, primarily related to testing. As the industry continues to align its protocols with the broader travel and leisure space, we expect these costs to ramp down in the future. Taken together, we expect adjusted net cruise cost, excluding fuel per capacity day, to decrease approximately 10% in the second half of 2022 compared to the first half. Guided by our core market to fill strategy, we will continue to make disciplined demand-generating investments in marketing in the near term, with a focus on laying the foundation for a strong 2023. Looking ahead, while it is still too early to provide concrete guidance, we expect net cruise costs, excluding fuel per capacity day in 2023 to exceed 2019 levels. To help with modeling, we have also provided additional guidance on key metrics, like capacity days, revenue expectations depreciation and amortization, interest expense, fuel consumption and capital expenditures, all of which can be found on slide 13. As previously stated, we generated approximately $260 million of operating cash flow for the second quarter after first turning positive for the month of March. Given that just over a year ago we were just beginning the herculean task of returning our ships to service after 500 days on the sidelines, this is no small accomplishment. The next milestone we are aiming to achieve is slightly positive adjusted EBITDA for the second half of 2022, leading to positive adjusted free cash flow for the fourth quarter. All of these stepping stones are consistent with our return to service plan and position us extremely well for 2023, where a return to a more normal operating environment, along with our focus on pricing discipline, is expected to lead to record net yields and record adjusted EBITDA for the full year. Our overall liquidity position remains strong, totaling approximately $2.9 billion at quarter-end, which consisted of cash of approximately $1.9 billion and an undrawn $1 billion commitment. For the remainder of 2022 and for full year 2023, we have approximately $500 million and $900 million of debt payments coming due, respectively. While on the surface, 2024 maturities appear high, approximately $2.4 billion is related to our operating credit facility, consisting of our revolver and Term Loan A. For additional detail on the breakdown of our upcoming debt payments through 2027, we also provide a detailed schedule on our Investor Relations website. After taking delivery of Prima less than two weeks ago, with fixed rate financing that was secured back in 2017, our debt portfolio is approximately 75% fixed rate today. This fixed rate -- fixed ratio is expected to increase to approximately 80% by year-end 2023, with the addition of three new builds next year, positioning us well in a rising rate environment. We took out, as a reminder, all of the high-cost double-digit debt we incurred during the pandemic at an opportune time prior to the current dislocation we are seeing in the markets by completing balance sheet optimization transactions in November '21 and February 2022. As I've said this before and will repeat it today, we believe the transformational growth we have in the pipeline over the next few years, representing 50% growth in capacity by 2027 as compared to 2019, is an underappreciated component of our company's investment thesis. For all new builds on order, our financing is committed at fixed rates averaging approximately 2.5% over the portfolio. To help you better understand the mechanics of the cash inflows and outflows associated with the new ship, slide 17 lays out an illustrative scenario demonstrating the typical time line. In general, approximately 20% of the ships cost is due in four installments tied to various milestones preconstruction beginning at contract signing. Typically, 80% of the cost is then due upon taking delivery of the ship. However, while this looks like a large capital expenditure outlay in the financial statements, we also received very efficient export credit agency-backed financing at the same time. This ECA-backed financing covers approximately 80% of the ship cost, which, as I mentioned earlier, is committed prior to contract signing and at extremely attractive rates. An often overlooked but incredibly important facet in the cash flow mechanics of a new build time line is that well prior to a delivery of a vessel, we are already receiving significant cash inflows in the form of advanced ticket sales and onboard presales. Given that final payments from our guests are typically due 120 days prior to a sailing, this is when the cash engine begins to come to life. As a rough estimate, we typically receive in the range of $100 million to $150 million of cash inflow from future bookings prior to a vessel's first revenue sailing, resulting in a cash infusion into the business that continues to build over time as final payments for future voyages also become due. So, while we often hear concerns surrounding the industry's capacity growth, we welcome and are excited for new capacity we have coming online. We have a high degree of visibility into the supply chain, supply pipeline for the industry, with only four major shipyards globally who can build cruise ships of scale. This, coupled with the incredibly efficient cost and financing structure of the new builds are a unique differentiator for us and the industry at large. While there continue to be challenges facing our business and we are keeping a close eye on how the macroeconomic environment evolves, we also have significant tailwinds, including a continued post-pandemic return to normalcy and the industry-leading capacity growth that I just discussed, all of which bode well for our future prospects. And before we wrap up our prepared remarks, I'd like to provide an update on our global sustainability program, Sail & Sustain, which slide 18 outlines key accomplishments and milestones. As we strive to provide critical transparency to our stakeholders this year, we focused on expanding and improving the data disclosed in our report, including expanding Scope 3 greenhouse gas emissions reporting, providing climate risk and resiliency data through our TCFD assessment, and strengthening human capital disclosure, including with data related to diversity as well as training and development. Earlier this year, we also announced that we are pursuing net zero greenhouse gas emissions by 2050. As we have said previously, a key driver to achieve our net zero ambition is the development of alternative fuels along with the associated critical infrastructure at destinations globally to support the creation, distribution, storage and usage of these fuels. First, we continue to execute on our return-to-service plan and are achieving key milestones as a return-to-normalcy. Second, we are seeing a strong consumer with a healthy desire to spend on travel and experiences, particularly in the upscale demographics our brands target. This strength is demonstrated by our improving booking trends, robust pricing and strong onboard revenue generation. Lastly, we are excited for the transformational and highly profitable growth we have in store over the next five years as we welcome eight additional ships to our fleet after Norwegian Prima. We've covered a lot today, so I'll conclude our commentary here and open up the call for your questions. I think, Frank, you gave the first time -- the sales are pacing 40% higher than this time historically. I'm just trying to bridge to 2023 EBITDA, which you said is going to be a record. Look, I think it's everything. But if you believe the experts, and we are seeing, as Mark mentioned in his prepared remarks, some green shoots, where costs are already coming down, including fuel, including food costs, that's strong. And so today, we sit here telling you that we have record load, record pricing, record capacity days that we're absorbing very easily. And therefore, we strongly believe that we will have a record net yield in '23, which results in record EBITDA. And Dan, just to highlight, further to what Frank's saying, it's not only the top line growth and the profitability of the new ships we have coming on line. So when you look at it on a unit basis, yes, they are a little bit higher in the second half in -- for 2022. And we've stated very clearly, we are spending dollars on demand-generating initiatives, i.e., marketing, building a very strong 2023 book across the board. We are focused on a very profitable, high-yielding, lower cost 2023, which we believe will result in a record EBITDA year next year. For the third quarter, I know you guys have talked about pricing tracking up high single digits. Any additional color, or if you could unpack that, just given, obviously, Europe, I would assume is a headwind this year. So to the extent you've seen strength in other regions, just kind of a lay of the land would be helpful. We took a large vessel out of the Baltic very last minute reposition to Port Everglades, which she's doing very, very well. We are leaning more on European stores business, which typically underperforms in terms of both ticket price and onboard revenue. So, I think we're going through, like Mark mentioned, some lumpiness. Remember, one of the wonderful things about the cruise industry is you have great visibility because of the booking curve, people book way in advance. So, when these things occur, it impact the short term, which is why we simply don't want to chase short-term occupancy at the expense of long-term pricing. The occupancy, the load factor of any given sailing, once it's -- that sailing is finished, it's finished. So for us, it's incredibly important, especially since we target that high-quality, high-paying consumer to maintain pricing discipline, as you can see, across the board to be up in pricing, 20% for 2023 is truly extraordinary. So maybe just on the back of that, and apologies for the -- to the near-term question. But when I look in your deck now versus last quarter, it looks like the back half in terms of when you sort of were looking for positive adjusted EBITDA may have down shifted a little bit. And I think maybe you just covered it, Frank, in talking about not giving up occupancy for price. It's just the cumulative sustained lasting issues on -- related around Omicron, it's only been in the last weeks that, number one. Number two, the CDC dropping the cruise guidelines, which occurred about three weeks ago, and just yesterday, us announcing the relaxation of our own protocols. I think those three items, each one of them had a positive impact on bookings. So when you say that all this happened around midyear, whether it was late June, mid-July, now early August and you look seven months into the future, that's where you get, you get to 2023. We could, we could like others, chase short-term occupancy and sell cruises for crazy prices, but we don't want to do that. I remind you what happened back in '08 and '09, when -- the great recession, certain cruise companies did drop their prices to ridiculous levels. And it took them, in some cases, 10-plus years, and in some cases, they've not yet reached those pre great recession yields. I've managed cruise companies in good times and in bad times, and I am convinced beyond a shadow of a doubt that you don't sacrifice the long-term pricing power of your brand in order to achieve short-term load factor gains. And maybe just a quick modeling question on -- from -- in terms of gross revenue, you gave us a little bit of guidance for the 3Q. So yes, when you compare our gross in Q2 versus Q1, you will see -- gross to net, you will see a slightly elevated cost structure. I think Q1, given all the dynamics where we had many sailings, many cancellations, we had quite a bit of ancillary revenue coming through in the gross line, which may have bumped up the next, so to speak. But as we stated in our prepared remarks, we have now embarked on our air program that we've been working on for many years. And so, I think you're going to see these more -- these are going to be the more norm level, so to speak. And obviously, when you look at the net, and again, considering the fact that in Q3, we were heavily weighted, particularly in Europe, and we're still having very strong pricing, I think it's a pretty impressive result. So, one of the questions we've gotten a bunch this morning, and Frank, you've already talked a little bit about this, but it's the change in the '23 book position today versus kind of where you were back in May. And obviously, pricing has actually improved a good bit, but the level of bookings have potentially slowed a bit. And I would assume this is all going to stem from your go-to-market strategy, which you've already discussed a lot. And then, the second part of this question also, if you guys could -- I don't know if you will give this or not, but give us a sense of where you think you'll turn the calendar year in terms of being booked for '23 versus where you would be historically. You can't be ahead significantly forever, because at some point, the time lines converge. So, we're very, very pleased where we are today for 2023 in terms of cumulative book position. As the calendar goes forward and we get closer to '23, I would expect us to stay more or less where we are today. Because if you recall, back in 2018, I think it was this very call in early August, where I said we had now reached the optimal balance between advanced bookings and pricing. But we don't want to be ahead any more than we are today because we had reached that point in '18 where we thought we were optimum, and we want to maintain it. Not looking to push load factors, to accelerate load factors, although, again, I do believe that two or three tailwinds that we discussed this morning are going to have a natural tailwind to bookings. And then the second question actually is going to be probably for Mark here, and it's going to be a liquidity question, which I'm sure you're tired of talking about. But Mark, I fully understand your comments you made in your prepared remarks, that we've seen some -- but at this point, we've seen some of your competitors say their liquidity profile was fine. So, I just -- I want to be clear here that -- and I know we can never say that -- that we shouldn't expect any type of dilutive raise over the near term given I think you said your cash flows at this point should be able to take care of pretty much all your near-term maturities. So look, based on everything we see today, and I'll repeat it again, we believe we can meet all of our liquidity needs organically. And specifically, what I called out in my prepared remarks is that was something we were focused on over the course of the pandemic. So, as you look at our maturity power and if you put aside the -- our normal operating facilities, our revolver and our term loan A, which we plan to amend and extend by the end of this year, we have a very clean path during our recovery. With your pricing strategy, and I completely understand the rationale for that, but I wonder how much does the current staffing market play into perhaps giving up some occupancy but holding pricing. Look, the internationally sourced crew that make up the abundance of our staffing on board, it's pretty back to normal. We have challenges in that area that -- but it's not keeping us from filling the vessels, except for one, and that's Pride of America, which as you know is the only American flag vessel that requires us to have 75% of our crew to be American citizens. And that vessel, which unfortunately is also our highest yielding vessel with the Norwegian brand, we've purposely kept the load factor since she's returned to service at 40%. We believe we have a road which, by year-end, we should see that vessel return to full occupancy. It's disheartening every time we have to go and cancel and -- people who are booked and expect to go, and we have to keep that load factor in the 40% range. And like I said, we expect to be back at 100% occupancy on that vessel by year-end. Obviously, a lot of puts and takes here, with restart costs, maybe some pull forward of marketing, and you have elevated fuel prices to deal with as well. You go back pre-COVID, the business was pretty well dialed in, with EBITDA margins in the low-30s. While we are seeing some near-term headwinds with the cost pressures like every other business is seeing, longer term, we still believe that we have a very strong operating leverage. Obviously, it's very early to give any sort of concrete guidance around that. But apart from taking -- when we look at 2022, and internally, we try to normalize what the cost structure is, you have to remember that we have the full burden of cost today, yet we don't have the full complement of passengers on board. So when you look at the metrics, like I said earlier, it's lumpy. But, as you look into '23 and then beyond, that operating leverage is fully intact, setting aside fuel, which we think we've mitigated reasonably with our hedge program. But we think there's a very, very real near-term path to getting back to historical margins. We just have to be able to operate consistently, operate our vessels at historical load factors, which we said we expect to be doing for second quarter of 2023. And maybe separately, on the bookings commentary, it sounded really encouraging with sequential improvement, a record day yesterday, a strong morning, and just thinking about the occupancy guide for the third quarter. And I guess less short-term focus, but maybe more of an update on where the booking curve is at. Look, historically, the booking curve at the age level, knowing that each brand has a slightly different nuances, it's about 7 months. And today, it's slightly more elongated than that, I would say, closer to 9 months, primarily because of our focus on 2023 bookings versus 2022. If you gave me a choice of selling a cabin or a booking for a '22 departure versus a '23 departure, I'll take a '23 departure. But in terms of pedal to the metal focus, getting back to normal on margin, on yields, on EBITDA, on profitability, it's all about 2023 and beyond. So, while we're going to work -- continue to work closely with them, first and foremost, as I've said, we believe that we can meet all of our needs -- liquidity needs organically. We have 20% more capacity coming on line next year, which is driving significant growth. But -- and so as we'll look -- as we look forward, if there are any near-term significant headwinds, we're going to look at all the options that are available out there. I would not want to point specifically to the ECAs or any other lender, but we're going to look at all options. And as we've seen in the past, I think there's a strong tailwind, so to speak, to make sure that the industry is thriving. And a year later, over the course of time, we are now turning positive cash flow. You talked about onboard revenue being 30% higher, I think, it was compared to Q2 '19, which is a remarkable increase. Well, it's certainly generating from what we're seeing on today's consumer, what they're spending on board. We talked about the consumer who -- those consumers who have a stronger propensity for presales, they also spend more, about 30% or 40% more once they're on board. We're seeing a strong consumer today, spending today's dollars. I guess, my question primarily is around sourcing strategy and maybe how you guys have altered that given the weakness that we've been hearing in European consumers and how you're using that as a competitive advantage. In terms of sourcing, look, we prefer an American consumer onboard all our vessels regardless of where the itinerary is operating. Americans book earlier, book a higher cabin category, and as Mark mentioned, spend more money on board. But for European sailings, partly because of the hesitancy by many Americans to travel to Europe until the mandate to test negative to come back to the U.S. is lifted, we leaned a little heavier on our European sourcing. And in spite of that overall pricing suffering a bit, we still posted higher pricing in Q2, expect higher pricing in Q3 going forward. So, I think overall, the European consumer has improved a bit or we've done a better job of sourcing those high-quality consumers out of Europe like we do in the States. But make no mistake, we rely on the American consumer perhaps more so than others, because at the end of the day, we think they're the most resilient, certainly the wealthiest, understand our product best, and we'll continue to do that."
}