{
    "symbol": "EEFT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 15:12:05",
    "content": " During the quarter, we were able to close the acquisition of Piraeus Bank's merchant acquiring business, we repurchased $70 million worth of shares, we added more than $100 million of cash to our ATMs to support increasing transaction trends that we are seeing and we made an investment in a company called Marker Trax, who previously announced will utilize our REN technology to further grow their business. The Money Transfer results were generally similar to the trends we saw in the fourth quarter, with double-digit growth in our direct-to-consumer digital transactions and our U.S. and Europe outbound transactions, partially offset by declines in Asia from the lingering effects of the COVID restrictions, together with continued declines in domestic transfers and investments in our network and our new product expansion. This graph shows actual projected European flight data for this year versus '19, overlaid with our international cash withdrawals for the same period as well as our transaction recovery from non-EU cardholders, Ukrainians who left their country, resulted in a substantial increase in their international transactions, which we do not expect to continue long-term nor do they reflect what the travel recovery trends really look like. However, as we mentioned last quarter, and we have seen in the first quarter results, as we introduce more product to epay's portfolio, the epay business results will become more uneven through the quarters, ending the year with an annual growth rate, as I mentioned earlier, that we expect to be in the low double-digit range. With these improving travel trends, together with the investments we have made to grow the business and our new product developments, we would expect second quarter 2022 adjusted EBITDA to be in the $150 million to $160 million range. I would tell you that what I'm seeing, what I'm hearing, what's coming out every day in the press, I mean even some information early this morning, I read a headline where Google noted that one -- some of the most significant hits or searches were for travel-related things, I think more specifically, like islands and beaches and stuff like that. I mean you've got to remember that if we could hit our number that we hope for this year, which is 2019's number, that will be with a change in both epay and Money Transfer, adding they're probably going to be coming in $100 million in EBITDA more than they did in '19 this year. Now to the extent that those ATMs perform better than or at least equal to what we had seen previously, that -- and that was about a 15% shift, well, the -- and our EBITDA of -- and I should really use of op income, Darrin, instead of EBITDA, because that is where we have some dock, we had about $300 million of op income out of the EFT segment in 2019."
}