{
    "symbol": "ARCB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 15:55:05",
    "content": " Your line is open. I think we look at it, Dennis may talk a little bit more about the industry specific, but I think itâ\u0080\u0099s a reflection of our model more than anything is that we have an opportunity to serve our customers with how their demand is changing and we talked about some disruptions in supply chains and different things. Your line is open. And lastly it does the ignition to capital the comps available whenever you have those kind of results, as what we are doing  have been working on there some $45 million, $55 million worth of capital this year in a growth efficient mid-single-digit  And so, the deployment of capital in business thatâ\u0080\u0099s returning while the assets returning by now  to our customers. Your line is open. I would also add, when you think about, Danny talked about us being better positioned really at across any kind of cycle with all the capabilities that we have and I think about the conversations that we are having with customers and back to your question about top-line growth, another area that we are excited about is, is our managed solutions, as well. Your line is open. I mean, I think, we just kind of talked a little a little bit about this, but, the conversation with the customers is really about whatâ\u0080\u0099s going on in their supply chain strategically. Your line is open. Maybe, how you guys are thinking about the kind of competitive landscape capacity picture in \n Well, I think whatâ\u0080\u0099s interesting is, to look at that through the lens of a customer and if you think about the journey that weâ\u0080\u0099ve been on really that weâ\u0080\u0099ve acted on since 2012, since we bought Panther in 2012, what weâ\u0080\u0099ve been trying to do is build up a company that is responsive really kind of in any environment and with respect to a variety of different alternative needs of customers. Your line is open. Your line is open."
}