{
    "symbol": "ARCB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 16:28:05",
    "content": " On today's call, we will provide an update on our business, walk you through the details of our recent third quarter 2022 results and then answer some questions. Joining me on today's call is Judy McReynolds, Chairman, President and CEO of ArcBest; David Cobb, Chief Financial Officer of ArcBest; Danny Loe, ArcBest President of Asset-light Logistics & Chief Yield Officer; as well as Dennis Anderson, ArcBest Chief Customer Officer. To help you better understand ArcBest and its results, some forward-looking statements could be made during this call. For a more complete discussion of factors that could affect ArcBest's future results, please refer to the forward-looking statements section of our earnings press release and our most recent SEC public filings. To provide meaningful comparisons, certain information discussed in this call includes non-GAAP financial measures as outlined and described in the tables in our earnings press release. As a reminder, there is a conference call slide deck that can be found on the ArcBest website arcb.com, in Exhibit 99.3 of the 8-K that was filed earlier this morning, or you can follow along on the webcast. I want to start by recognizing the hard work and dedication of our leaders and entire team here at ArcBest, who work hard every day to keep the global supply chain moving. As we look back at the third quarter and forward to next year, our three point growth strategy remains our North Star and our grounding in an uncertain environment. Because of our sustained performance, our strong balance sheet and our disciplined approach to capital allocation, we are positioned better than ever to continue investing back into our people, solutions and facilities throughout changing market conditions. We are known for leading edge integrated solutions, providing our customers the flexibility they need in their supply chains. We bring our technology and innovative mindset to every partnership, building processes and digital capabilities that make it easier and more efficient to do business. As we approach our 100th anniversary, we remain focused on improving our facilities and equipment. This year we are on track to deliver $5 billion in revenue for the first time in our almost 100 year history, a nearly $1 billion increase from last year. We partnered with them to develop a pool distribution solution, including truckload that helped them get equipment capacity they needed. As a result, our total business with this customer across all solutions increased 6x over 2021 and our asset-based shipment volumes for this customer increased 3x. In addition to this growth, we are now exploring an expansion into more of this customer's business units. ArcBest has a rich history of innovation and we continue to see a tremendous opportunity to serve our employees, shippers and capacity providers more effectively and efficiently by leveraging technology. In fact, over half of our top tier technology projects are expected to drive additional business efficiencies. As we navigate a changing industry and economic backdrop, company leaders have access to advanced reporting tools that help them understand performance and costs better than ever before. And now I'll turn it over to David Cobb, who will take you through our financial results and provide an update on investments to facilitate long-term growth. We reported third quarter revenue of $1.4 billion, an increase of 33% over the prior year quarter reflecting business growth in all segments. On a non-GAAP basis versus last year's third quarter, consolidated operating income increased 33% to $131 million. Under the current laws, we expect our fourth quarter non-GAAP tax rate to be comparable to the rate in the third quarter, which may be impacted by discrete items. Last month we amended our existing credit revolver agreement extending the term of the facility through October 2027 and improving the terms including converting it from a secured facility to a senior unsecured facility, which reflects ArcBest strong credit profile. In our asset-based business, third quarter revenue was $792 million, an increase of 16% compared to the prior year quarter. We currently expect to receive all plan 2022 tractor purchases by the end of the fourth quarter, however delays in the timing of tractor deliveries earlier in the year and the accelerated sale of a portion of our tractor fleet resulted in elevated maintenance costs during the recent quarter, which are in the fuel supplies and expenses line on the asset-based income statement. However, in the current favorable equipment market, their disposition produced gains, but the timing of those sales was earlier than our normal trade cycle contributing to a short term slightly higher average fleet age. In addition, parts, repairs and maintenance have been impacted by supply constraints and inflationary costs. As new replacement equipment is onboarded in late 2022 and into 2023, we expect our equipment maintenance expense to be positively impacted over time. Our team is focused on optimizing cartage uses â\u0080\u0093 usage and reducing this expense, which impacts the rents and purchase transportation expense line. While the month just ended yesterday, our initial figures indicate that daily tonnage in October was running 4% below the same period last year while shipments have increased approximately 1% of the prior year period. Our LTL rated business drove the revenue and shipment growth, which was partially offset by fewer heavier weighted truckload rated shipments. On a sequential basis, the change from September to October 2022 in our core LTL-rated tonnage and shipments is in line with the historical average and weight per shipment is increasing. Moving to Asset-Light, third quarter revenue increased 63% versus the prior year period reflecting the addition of MoLo and more events and higher revenue per event in the FleetNet segment. Third quarter Asset-Light non-GAAP operating income increased 61% over last year, benefiting from demand for our truckload and managed solutions. As mentioned last quarter, and according to publicized industry information, market rates have softened, which are reflected in the lower sequential monthly year-over-year revenue growth rates. Third quarter Asset-Light EBITDA was $22 million, an increase of 53% versus the same period in 2021. We continue to see revenue growth moderate and some margin compression relative to earlier in the year, reflecting market conditions and business mix changes. Net capital expenditures totaled $119 million through September, and they should be in the range of $200 million to $210 million by the end of the year. As I mentioned earlier, we currently expect to receive all of our 2022 Class A tractor orders, and we continue to make further progress on upgrading and expanding our real estate, and we have a multi-year plan for future ABF network investments. As a result, we expect our 2023 capital allocation for solid return generating investments in the business will be at a higher level than 2022. Our cash resources and the strength of our balance sheet have allowed us to pursue multiple value enhancing capital allocation strategies, including investing in organic growth, evaluating M&A opportunities that could potentially enhance our service offerings and returning capital shareholders through our dividend and approximately $75 million of year-to-date share repurchases. We continue to pursue a balanced approach to capital allocation, which seeks to enhance shareholder value while targeting investment grade credit metrics. Overall, we are pleased to deliver another quarter of solid financial results and we are positioned to manage through economic cycles for the long-term growth. Over the last 12 months, we have been focused on a successful integration. As weâ\u0080\u0099ve mentioned before, the MoLo acquisition accelerate our pursuit of an increased mix of contractual business, which performs better and solved their industry conditions. Despite recent market changes, we are still seeing double-digit low growth over the prior years combined MoLo and Lexie  truckload shipments. Overall, we have continued to deliver double-digit growth in the Asset-Light segment with plenty of opportunity for acceleration based on our continued investments in this business and the market opportunity we see. Now that all of our truckload team members are working out of one system, the largest parts of the MoLo integration are behind us, and we are ready to run. On the asset-based side, the pricing environment has remained rational. Over the last few months, weâ\u0080\u0099ve seen a shift from customers focusing on securing scarce capacity to prioritizing supply chain efficiency. This echoes what we heard years ago, which led us to build our managed transportation solution, which provides complete freight transportation management services to help our customers continually optimize their supply chains. And as more customers focus on sustainability to reach their ESG objectives, we are glad to have solutions like this in place to help them. I was recently with one of our customers who uses our managed transportation solution, and our visit reminded me how great it is to be part of their growth story. A few years ago, they came to us needing LTL services as their business outgrew parcel. And after a few years of providing LTL service for this customer, it became clear their needs were expanding again, because our philosophy is that when our customer wins we win. Weâ\u0080\u0099re at a point now where weâ\u0080\u0099re auto tendering business and auto routing, which means no touch for us or the customer. Our customer forecast their business to double all without adding any head count, because weâ\u0080\u0099ve eliminated their need to do data entry. As their business grows, we can continually help them optimize modes and carriers while looking for ways to make their supply chain more efficient and flexible. Weâ\u0080\u0099re proud to have received one of their coveted vendor awards and even prouder that we were the only supply chain partner recognized, even though we are one of their youngest tenured suppliers. As a result of this partnership, our revenue with this customer has grown almost 50% over the last 12 months, and we expect business to double in the next year. Nothing we do is possible without our great people, and itâ\u0080\u0099s a testament to our culture that we hire for the long term. These awards are based on employee sentiment and feedback over the last year across more than 70,000 companies, and they affirm that weâ\u0080\u0099re focused on the right ways to reward and grow our people who in turn work to provide excellent customer experiences every day. We see and feel that every day, but itâ\u0080\u0099s especially rewarding when itâ\u0080\u0099s recognized by others. We have engaged a third-party advisory team to help guide further development of our ESG roadmap, which will detail our three to five-year strategy and specific initiatives around emissions reduction and more sustainable operations. Weâ\u0080\u0099re reviewing our recruiting, hiring, and onboarding procedures to identify ways we can make those processes more inclusive, and weâ\u0080\u0099ll be actively working to hire more neuro distinct talent. In closing, our growth strategy continues to serve stakeholders well. In turn, theyâ\u0080\u0099re able to support and empower our customers in both their day-to-day supply chain operations and in navigating uncertainty. While we are proud of what weâ\u0080\u0099ve accomplished in the last several years, we are not done. Weâ\u0080\u0099re committed to keeping the global supply chain moving, delivering on our goals and driving growth. Okay, Frank, I think weâ\u0080\u0099re ready to take some questions. So, I guess, I wanted to start on cost inflation and get a sense. We've heard from a couple of the competitors that cost inflation ex-fuels kind of running in the maybe 7% to 9%, let's call it, high single digit range. Certainly fuel is having an impact and that impacts not just direct diesel fuel costs, but other propane and then tires and then really across the board on some things. So we saw probably in the â\u0080\u0093 for those kinds of items, parts and maintenance kind of in that double-digit percent increase on a part kind of basis increase. And then you mentioned productivity, I think certainly that's a big impact for us. As I mentioned earlier, we had some new employees coming on and for instance in our dock operation we've got about a third of our employees now that because of the hiring and the retirements, we've got about a third that are â\u0080\u0093 have experience that's under 18 months. And so as we know that that's can be an opportunity to gain some improvement there in terms of efficiency, which can drive some cost out of the equation. Just on top of what David said, yes, we feel the pressure for cost inflation that there is things we can do. We see opportunities that for us to control that, but ultimately at the end of the day, we have to price our freight to cover the cost of inflation. And like I said, the environment is still rational and we continue to feel that we can do that that there's value in our services we're providing to our customers and that we can cover the cost of inflation. I think, as Judy mentioned, at the outset of the call, we have more tools and data available today, improve yield management strategies and technologies to manage our business better. I would just say, like I said, the evidence is pointing to a softer economic environment and our range is that in those declining economic environments in the past has been on the higher end of that range of OR that I stated. We have some areas that I pointed out in the third quarter that we've got to work on including cartage, including productivity, including the repairs and maintenance that some of those will take time to improve, but certainly on a path to improving that. If you go back, historically it's one of our better quarters with â\u0080\u0093 third quarters with 6.9%. So, there's still confidence that that customers recognize value. And so, again, if our model produces values for our customers and we'll continue to rely on that model. But the flip side of that as well too is when you â\u0080\u0093 if you take our integrated approach to logistics, if customers come to us and they're having supply chain cost increases, we're going to go back to manage solutions and talk to them about what we can to reduce that. And so that's the difference in the model that we have today is that regardless of the environment we're facing, we have an answer for our customers. And then on the asset-light side, I think you noted that the selling prices in the quarter dropped faster than the cost of transport, if I got that right. And Judy, I just want to echo the congratulations on the Arkansas Business Hall of Fame. So, guess, David, my first question â\u0080\u0093 David Cobb, my first question is for you. Yes, the cartage issue is really â\u0080\u0093 well, there's two issues there, two items. So when you look at that on a year-over-year basis, those were all inflated along with our local pickup and delivery cartage usage. And in the cartage line itself which is when you look sequentially the PT, the over the road has actually declined, but the cartage increased sequentially from second to third quarter. And so, that's an area that as we bring on drivers and as we've done really well in doing that, we have a lot of opportunity to reduce that. Our team is really focused to help bring in military veterans, who are good and disciplined, who are drivers as well, and developing our own drivers to do that. And I guess for my follow up question, Judy, I'm just curious on the â\u0080\u0093 on the technology investments, we've been sort of ramping those up over the last few years. And that's caused the things to go on a little bit longer than we like to in the pilot in Kansas City, but we should be riding that issue in the fourth quarter and then as we go in to next year really seeing the production of all that work come together. And we have seen signs of some of the, I think, key metrics being met that we wanted to early on that relate to some of the efficiencies. But as we go into next year early, we're opening up Salt Lake City, which is a warehouse, and it's another environment where this mobile platform equipment and technology is going to be used. And so it will take some time to get the pilot work done in Salt Lake City, but we're applying all the knowledge that we've gained from these other locations into that, so we should go faster. And I think that that will be beneficial, certainly internally, but it's also going to be beneficial to all of our investors and other stakeholders as well. I mean, yours are going up and typically what we see in a slowdown is weight per shipment fading on the LTL side. I think when we look through it, it goes back to optimization of our asset based network and making the right decisions. We're able to have daily, weekly decisions about what fits into the network. That's when we do â\u0080\u0093 when you talk through the optimization and you talk through the models that people that helped, it just happens because the market rates for truckload were dropping down and we're able to see that we could put more revenue into our trailers with some of these LTL shipments as compared to the heavy weighted truckload shipments. And then I wanted to follow up on â\u0080\u0093 Judy, something you mentioned, you talked about now you guys have much more tools at your fingertips to sort of provide the right freight and your network provide the right resources. Well, I think, Danny just talked about one of the main ones, but we are clearly focused in the asset-based network. On our published customers, our core LTL customers that we know, I think, 80% of our customers have been with us for 10 years. And that's just a great fact whenever you're trying to evaluate what business that you can have on a consistent level, but even those customers and this kind of environment can't predict specifics into their business. And so, as we mentioned, we have to be both â\u0080\u0093 we have to be nimble and flexible and informed in the asset based network in order to know what's coming. And then on a daily basis, we can supplement that with the business that we gain from some of our quote opportunities and knowing information that's related to that, which we have especially with some of the technology that we were just talking about earlier, we have the visibility on our workforce and some of these choices that we make and how long it takes to handle certain shipments and that sort of thing. And I think because of all that, you're going to see a more consistent level of business. And as we go into areas where we've grown some capacity, we can take that into account as well. And so it just comes together very well, but let me tell you this though we still have a lot of opportunity to improve. When we experience what we did during the pandemic and some of the lag on being able to hire as many people as we've needed to, we have a lot to improve on efficiency, communications, information for both internal needs and for our customers we have a lot to improve. Well, it sounds like with the improvements that you made you're in a better position now than you were sort of during the last downturn. Well, and the other thing Danny mentioned already was just our overall approach with customers. When you see the world through their eyes, you're going to be more successful. So maybe I don't know if you or David want to chime in on that, then your â\u0080\u0093 talk about the â\u0080\u0093 in face of that your thoughts on pricing given that pace of volume declines. And so certainly, we've seen that in our business, but as we've talked about earlier here, we've got a diversified customer base across retail, across manufacturing and supply chain challenges still exist. I just kind of add on to what Dennis is saying, what I think about that, what you're talking  about itâ\u0080\u0099s really about opportunities that we see. And so just one thing I want to go back and point to is our model just I was recently kind of looking our three most recent kind of managed wins that we had and each of those examples, freight went back to ABF. And so the more we talk with customers, the more we look at the opportunities that are out there, that's â\u0080\u0093 that to me is why the model is different than what you've seen in the past is it's not just an LTL asset story, it's a logistics story about talking to our customers. And that creates more opportunities both for Asset-Light, but also it produces opportunities for the asset part of the business. One thing that Iâ\u0080\u0099ll say that we were encouraged by is when we looked at October to September, we had relative stability in our LTL-rated shipments, which thatâ\u0080\u0099s an indication and when we also had some increase in that category of wafer shipment. And the other thing Iâ\u0080\u0099d say is when weâ\u0080\u0099re thinking about the future, weâ\u0080\u0099re not giving guidance. We donâ\u0080\u0099t give guidance, but we have strength in our pipeline that is really pretty encouraging whether itâ\u0080\u0099s in the managed side of things or just the capability set that weâ\u0080\u0099ve got with our truckload offering now. And then interestingly, I think MoLoâ\u0080\u0099s strength in food and beverage is something that you can point to that has strength in recessionary-type environments. And then also there are elements of our asset-based business, that are serve â\u0080\u0093 they serve service related businesses. But what we tell our team is despite the economic backdrop, we have a lot of opportunity and we need to go pursue it. What we donâ\u0080\u0099t want to do is end up on a call like this, talking about those one offs, which tends to happen if you leave them in there. But certainly, thatâ\u0080\u0099s a fair question related to some of our technology and innovations costs. Once we have those locations, what we characterize as operational, in other words, theyâ\u0080\u0099re not being piloted and weâ\u0080\u0099re not changing, the approach that weâ\u0080\u0099re using in those facilities, we feel like those need to go in. We expect in 2023 that the other one likely will be Kansas City is still going to be in pilot again, partly because of some of the equipment delays that we had related to that. But certainly Salt Lake City, if weâ\u0080\u0099re opening a new location there and weâ\u0080\u0099re using a different approach to pilot, that will be considered as a non-GAAP item. Thanks for the time. Maybe can you help us, hey, good morning. Well, I think more so than the labor category that what David mentioned earlier about how we will more â\u0080\u0093 I guess better manage our cartage and other rented equipment, purchase transportation. Thatâ\u0080\u0099s really kind of the main lever, because honestly it has been very difficult to get the right people hired. Iâ\u0080\u0099m sure that youâ\u0080\u0099re hearing other companies say that as well, but the setting that aside for a minute, we do have some great opportunities in these other areas to better manage costs, because weâ\u0080\u0099ve had to use those levers because of our suboptimal situation with hiring. But in 2022 or the last 12 months, weâ\u0080\u0099ve hired over a thousand people. And as David mentioned when you go back to that labor category, the big opportunity there is greater efficiency gain out of those people that we have hired. And so maybe one way to think about it is we might be less aggressive in hiring in some of these locations that we really donâ\u0080\u0099t need people and just by the natural course of things, you end up in the place that you need to be. But weâ\u0080\u0099ve been through lots of scenarios like this, I mean this one is no different than the others, but itâ\u0080\u0099s just the predictability of it is just not there. You mentioned the 4% to 6%, that is we still point to that as our long-term financial target for that. So I wonâ\u0080\u0099t get into 2023, Iâ\u0080\u0099ll just kind of leave you pointed to where the longer goal there. When you look at the spot and contractual business, I wonâ\u0080\u0099t talk specifically and the brokerage. And thatâ\u0080\u0099s actually kind of shifting as you go through the cycle that youâ\u0080\u0099re in now, is that I think the cycle that youâ\u0080\u0099re seeing now is that more and more shippers that have contractual rates are seeing the disparity between contract rates and spot rates right now. So you can see business, itâ\u0080\u0099s kind of a fluid that you see contract go to spot and maybe back to contract with the lower rate. And you havenâ\u0080\u0099t seen that completely in the numbers, but thatâ\u0080\u0099s kind of what youâ\u0080\u0099re seeing now. So I wonâ\u0080\u0099t get into the specifics of the contract to spot, but hopefully that gives you kind of a flavor of overall that thereâ\u0080\u0099s just some fluidity as the shippers are trying to find what is the best choices that they make in the current market as the rates are moving. Good morning, Judy, I want to go back to the sequential 3Q to 4Q commentary, because itâ\u0080\u0099s been â\u0080\u0093 I guess itâ\u0080\u0099s been a decade since the March the fourth quarterâ\u0080\u0099s been 500 basis points worse than 3Q. And I went back â\u0080\u0093 last year, you talked about it, the normal seasonality being 200 basis points worse. And so you changed the sort of the language and I just feel like, should we really, I want to get the model in a good place. Weâ\u0080\u0099ve got lots of opportunity, like I said, great strategy that weâ\u0080\u0099re executing on and so, but we do have to execute right to achieve that. I donâ\u0080\u0099t think we have to go back through that, but those are some of those things will take some time to improve from the third quarter as we move into the fourth quarter. And so you â\u0080\u0093 some of your fixed costs donâ\u0080\u0099t move obviously as well when you have a lower revenue, things like depreciation. So as weâ\u0080\u0099re taking on this depreciation â\u0080\u0093 this new equipment, our depreciation is a little heavier loaded in the back half of the year or in the fourth quarter in particular. The maintenance, like I said, that can be reduced as we bring on the equipment, but thatâ\u0080\u0099s again, some of thatâ\u0080\u0099s kind of a fixed element to it as well. Facility cost supervision, many of those things arenâ\u0080\u0099t going to move as quickly as the revenue might, lots of puts and takes in any given quarter. And then on the Asset-Light margin, I know the range is the targets 4% to 6% fell a little bit below that in Q3. And on one operating platform, weâ\u0080\u0099ve got â\u0080\u0093 what weâ\u0080\u0099ve invested through the year as you can see, and in our financials of what weâ\u0080\u0099ve â\u0080\u0093 weâ\u0080\u0099re positioned really to grow from here. And opportunity again, execution, weâ\u0080\u0099ve got the opportunity in front of us. But in the near term, again, weâ\u0080\u0099re looking at this from a long-term standpoint. But itâ\u0080\u0099s â\u0080\u0093 but and so in the near term, we may be pressured by that as market dynamics will play a part of it on the margins, on the gross margin side. So near term, the overall operating margins could be pressured as we head toward that growth and longer-term operating margins. But I agree with David, weâ\u0080\u0099re built for more business and weâ\u0080\u0099re looking toward those 2025 targets. Yes, just to echo what Judy said, we know our floor can be more productive than it is today. We have initiatives to make the formal productive, but the key is to grow, the best way to be more productive is to add more ship truckload shipments to the floor. And again, weâ\u0080\u0099re focused on the long-term goals when we point to 2025, maybe there is short-term pressure, but we, again, our confidence in our truckload model has never been as strong as it is today. One of the things that Iâ\u0080\u0099ve noticed, and maybe itâ\u0080\u0099s just because you guys put out press releases about this. Well, if you knew, what we know, which Iâ\u0080\u0099ll share with you is that weâ\u0080\u0099re doing those hiring initiatives in very targeted locations where we absolutely do need to add to that workforce because either we are already experiencing retirements or weâ\u0080\u0099re aware that thereâ\u0080\u0099s upcoming retirements in those areas, or weâ\u0080\u0099re â\u0080\u0093 weâ\u0080\u0099ve got an input into there regarding natural turnover rates. But the very important thing to keep in mind there is the hiring results in the most efficient cost, because youâ\u0080\u0099re able to work through some of these other issues. So, we want to give great service to our customers and we want to do it through trained efficient people, and we want to do that in overall most cost effective approach that we can. And again, a tool or tool set that we have that we really havenâ\u0080\u0099t had as much of in the last downturns that weâ\u0080\u0099ve experienced is the ability to add shipments in a targeted way to those locations or those trailers where we need it. What weâ\u0080\u0099ve seen, again, Iâ\u0080\u0099ve say that the environmentâ\u0080\u0099s been rational. I think if you think of the micro environment with the â\u0080\u0093 whether itâ\u0080\u0099s the cost of the inflationary cost, weâ\u0080\u0099re seeing the cost for employees in different pieces with that. From our standpoint, itâ\u0080\u0099s â\u0080\u0093 you have to have the price increases to cover these inflationary costs. And so for us, we think that is weâ\u0080\u0099ll continue to rely on the value weâ\u0080\u0099re providing to our customers. Again, the flip side is if we have customers that are pushing a price conversation that is not sustainable for our asset part of the business, we have a conversation about their whole supply chain. And really what turns out in that case is weâ\u0080\u0099ll go back and weâ\u0080\u0099ll work on lowering the cost of their supply chain and that usually results in a different type of business that comes into our asset network, but business that works at the price point that weâ\u0080\u0099re able to offer to them. Thanks for the time. Hey Frank, I think weâ\u0080\u0099ve got one more time for one more to get in. So I want to focus a little bit on Asset-Light, because we do anniversary in MoLo today. And you mentioned the rev per day was up 40% for this business, but that included an uneven comp with MoLo. Number one, what did that revenue per day growth look like, excluding the impact of MoLo in October. I did mention in there that weâ\u0080\u0099re seeing double-digit shipment growth when you consider the legacy business, both businesses in the past. I think on other inflationary piece that you talked about, other ordinary costs, I think when youâ\u0080\u0099re in an inflationary environment like this, itâ\u0080\u0099s tough and on your care management before because youâ\u0080\u0099re getting pressure of lowering rates at the same time trying to do that. I donâ\u0080\u0099t have the answer for you of when the trough is, but there are definitely some other inflationary kind of temporary costs in there just because of their current environment that youâ\u0080\u0099re in."
}