{
    "symbol": "AGCO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 17:00:05",
    "content": "  Weâ\u0080\u0099ll also make forward-looking statements this morning, including demand, product development and capital expenditure plans, production levels, engineering expense, exchange rates, pricing, share repurchases, dividends, future commodity prices, crop production, our supply chain, inflation, component deliveries, retail revenue, margins, earnings, cash flow, tax rates and other financial metrics. In South America, net sales grew approximately 77%, compared to the second quarter of 2021, excluding favorable currency translation, driven by significant pricing as well as volume and mix effects. For North America, with higher commodity prices and healthy farmer sentiment we continue to expect higher demand to replace an age fleet of larger equipment being partially offset by modestly softer demand for smaller equipment after the several years of strong growth. For the full year operating margins are expected to improve compared to 2021 as a result of higher sales and corresponding production, favorable pricing net of material cost and improved factory productivity, partially offset by increased engineering and digital investments, as well as inflationary cost pressures. So in terms of our second quarter margins, as you point out in South America, very strong first of all, production was up about 7% and that helped us we had favorability in terms of pricing in relation to material costs. Next caller, please state your name and company. Steve, if you look at what happened in the second quarter, some of that sales growth that you see, I would probably estimate it about 20% of that related to some channel fill that occurred it's industry wide, where the, if you look at the industry from a shipment standpoint, it was about 20% different than what happened at the retail level. Next caller, please state your name and company. Next caller, please state your name and company. Next caller, please state your name and company. Next caller, please state your name and company."
}