{
    "symbol": "AGCO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 14:44:02",
    "content": "  We will make forward-looking statements on the call this morning, including demand, product development and capital expenditure plans, production levels, engineering expense, exchange rate impacts, pricing, share repurchases, dividends, future commodity prices, crop production, our supply chain disruption, inflation, component deliveries, retail revenue, margins, earnings, cash flow, tax rates, and other financial metrics. Pricing in the quarter, which was around 13%, contributed to higher sales along with continued strong growth in high horsepower tractors combines and Precision Ag products. The strong year-over-year growth was driven by the success of our Fendt large tractor sales, significant increase in demand for our Precision Planting products, as well as overall solid pricing. In South America, net sales grew approximately 50% compared to the third quarter of 2021, excluding favorable currency translation driven by favorable market conditions, helping deliver significant pricing, as well as volume and positive mix effects from growth in Fendt products. By region, South America continued its very strong performance with operating margins reaching nearly 19% in the quarter and operating income improving over $63 million year-over-year. For the full year of 2022, although, we expect our raw material and work in process inventory to continue to remain elevated to help us manage through the continued difficult supply chain environment, we do expect to see a significant reduction in our work in process inventory in the fourth quarter and now expect to generate $400 million to $500 million of free cash flow for the full year, which is up from 2021. For the full year, we expect an operating margin of approximately 9.9%, which is above the 2021 operating margin, as a result of higher sales and corresponding production, and improved factory productivity, partially offset by increased engineering and digital investments. I think, Jamie, for us, if we think about the orders by region, all of them were up double digits, with the caveat for North America, that I would tell you, small ag was down, large ag was up significantly, so net North America was down orders year-over-year, but EME we were up over 20% plus, South America we were up double -- low-double digits and Asia-Pacific up into the teens as well. And then I think to your question on South America, again, credit to the team, as part of the South American fixed plan that we happen to put in place several years ago, you are seeing very good strong demand as we grow the Fendt and high margin products there."
}