{
    "symbol": "ZFOX",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-06 18:40:04",
    "content": "  Operator: Thank you for standing by, and welcome to the ZeroFox Fiscal Third Quarter 2023 Results Conference Call. After the speaker's presentation, there will be a question-and-answer session and as a reminder, today's call is being recorded. I would now like to turn the conference call over to Marc Griffin, Senior Vice President of Investor Relations for ICR. Good afternoon, and thank you for joining us today to review ZeroFox's fiscal third quarter 2023 financial results. With me on the call today are James C. Foster, or as many of you know him, Foster. Foster is the Founder, Chief Executive Officer and Chairman of ZeroFox. Also with me on the call is ZeroFox's CFO, Tim Bender. After prepared remarks, we'll open up the call for questions. During this call, we may make statements related to our business that are forward-looking statements under federal securities laws. Forward-looking statements made today speak only to our expectations as of today, and we undertake no obligation to publicly update or revise them. For a discussion of the material risks and other important factors that could affect our actual results, please refer to the Risk Factors section of our SEC filings available on the EDGAR -- the SEC's EDGAR system and our website as well as the risks and other important factors discussed in today's earnings release. Additionally, non-GAAP financial measures will be discussed in this call. With that, I'd like to turn the call over to ZeroFox's Chief Executive Officer, Foster. And given this is our first call as a public company, I wanted to start off with a pledge, a pledge to be passionate and transparent with you on our business. In August, we were able to raise new growth capital, complete our strategic acquisition of IDX and finalized our business combination with the public entity, L&F Acquisition Corp. We are proud of the fact that we navigated these volatile equity markets, and even though it took a little longer than we had hoped, we emerged as the newly public ZeroFox. And as history has shown, the overall cybersecurity market is large, growing and evolving, we saw the emergence of significant market opportunities in areas like edge and endpoint security. Furthermore, one of the fundamental truths I have learned over the course of my career is that customers and the market reward cybersecurity category leaders. External cybersecurity enables customers to expose, disrupt and respond to threats outside the perimeter. Traditionally, the focus of cybersecurity has been on protecting the assets that are owned and controlled by the organization. Owned assets include things like laptops, networks, systems, any of the cloud workloads. However, with digital transformation continuing to accelerate, the primary ways that companies interact and transact is now through digital channels and mediums, which require a different approach to cybersecurity. These platforms include things like the surface web, deep and dark web, social media sites, collaboration platforms, code-sharing sites and even mobile app stores. And the result is that the public attack surface for every organization continues to grow, increasing their financial and reputational risk for these organizations. This is reflected an increased targeted phishing attacks, account takeovers, credential theft, data leakage, domain spoofing and impersonations. Today, organizations have limited visibility to assets and systems they don't know they own nor control. Furthermore, continuous monitoring and protection of this external environment is difficult, given its size and dynamic unstructured nature. We believe the solution to the external cybersecurity challenge requires a platform-based approach, and this is exactly what we have built at ZeroFox. We combine AI and full spectrum threat intelligence, adversary disruption capabilities and response services into an integrated solution that provides continuous protection and continuous response. Historically, ZeroFox's capabilities were pre-breach with our 3 strategic pillars focused on protection, intelligence and disruption. And the IDX acquisition expanded our platform to include now an important fourth strategic pillar, post-breach response. First, IDX accelerates our multi-pillar platform roadmap. While IDX provided us with core capabilities around response, it also enhances capabilities across all of our other strategic pillars. Today, nearly 100% of IDX's business is in the U.S. We see an opportunity to leverage ZeroFox's international go-to-market capability to globalize the full solution. And last but not least, we see an opportunity to accelerate revenue by cross-selling and upselling our traditional capabilities to the new combined customer base. While we are still in early stages of integrating ZeroFox and IDX, we are excited about the progress we are making and the pace of our combined innovation. Even though we operated in a partial quarter, I'm very pleased with our results and our execution. Other cybersecurity category leaders have reported signs of increased scrutiny on deals, lengthening of sales cycles and softness in Europe. However, given our smaller size and emerging market, we are seeing consistent demand in North America and the rest of the world, of course, excluding Europe. Looking forward, I'd like to outline our 3 main priorities for the remainder of the fiscal year. As a new public company, we'll continue to optimize our infrastructure to support our near-term growth while also laying the foundation to efficiently scale the business over the next several years in anticipation of driving operational efficiencies, leverage and free cash flow. However, with the continued energy, passion and commitment of all of our Foxes around the world, I'm confident that we will continue to set the gold standard in external cybersecurity. With that, I'd like to turn the call over to our CFO, Tim Bender, who will provide more color on our financial performance, nuances of the transaction and Q4 guidance. Before we take a closer look at our third quarter results, there are a few important points I would like to be sure to level set so you can better understand our story and measure our future progress. First, as Foster mentioned earlier, Q3 represents a partial period. The transaction closed on August 3, and accordingly, our Q3 results reflect the combined operations of ZeroFox and IDX from August 4 through October 31. Second, due to the accounting requirements of the transaction, the SPAC, L&F was deemed the accounting acquirer. However, ZeroFox, Inc. is the predecessor entity for reporting purposes. To assist investors with this lack of comparability, we have provided supplemental financial information that includes historical stand-alone financial statements for ZeroFox and IDX. With the exception of revenue and unless otherwise stated, all financial results we will discuss today are non-GAAP financial measures. For Q3, ZeroFox reported $43 million in revenue. As of October 31, our annual recurring revenue was $153 million. We ended the quarter with 1,138 subscription customers. For the third quarter, non-GAAP subscription gross margin was 72%, and non-GAAP total gross margin was 40%. We see opportunities to improve our overall gross margin as we scale our business, drive greater cost efficiencies and our higher-margin subscription revenue becomes a greater portion of our overall revenue mix. Regarding sales and marketing, we expect to spend more in absolute dollars to increase our go-to-market capabilities since we see a lot of white space in external cybersecurity. Taking a deeper look at G&A expenses, they were impacted by increased costs directly attributable to the transaction. However, after that, we expect to see a more normalized run rate in fiscal 2024. Looking at the balance sheet, we ended the quarter with $53 million in cash, $29 million in accounts receivable and $53 million in total deferred revenue. Our total outstanding debt was $171 million, including $150 million in convertible debt that was raised as part of the transaction. Provisions of the convertible debt provides ZeroFox the option to pay the interest in cash or to pay it in kind, thereby adding to the convertible note balance. We reported $4.4 million of interest expense in the income statement, which reflects the PIK rate on the convertible debt and rising rates on our senior bank note which has a variable interest rate. In our financial statements, you will see a $699 million goodwill impairment charge. The August 3 closing day market valuation was used to determine the initial goodwill, and the subsequent decline in our stock price as of October 31 led to the impairment charge. Again, the cash flow presentation reflects the aforementioned accounting treatment for the SPAC. The cash used in operations includes approximately $14 million in advisory, legal and other transaction costs associated with the capital release. As indicated earlier, we expect some additional impact from transaction costs in the fourth quarter and similar to our G&A expense, we'd expect these to moderate and normalize in fiscal 2024. However, based on what we are currently seeing, we remain confident in achieving our Q4 outlook. Based on our Q3 achievements, we are raising the low end of our previous guidance for the second half of fiscal year '23 by $2 million, so we now expect revenue to be in the range of $84 million to $86 million. During our Q4 earnings call, we anticipate providing you with full year guidance for next year. So as we think about the guide for 4Q and some of the commentary around optimization, obviously, you didn't provide an op income range. Listen, I think from an OpEx standpoint, listen, we talked about we're going to continue to make investments. But as we think about our OpEx, first of all, a partial quarter, albeit a few days will have an impact on Q4 so we'll see a little bit more there. And then as it relates to kind of the mix, I think G&A will tick slight away from the transaction as some of those costs start to trickle away. But again, Q4 is generally a strong quarter for us from a sales standpoint, so you might see a tick-up in sales and marketing. And then Foster, over the years, you very effectively have used M&A to help augment your product set, obviously IDX being the biggest but some other smaller ones historically. When we get through integration, we find new opportunities, we'll kind of evaluate and address them as we see them. Foster, Tim, congrats on the results and getting the combined company out the door and publicly reporting. We get feedback from our customers that -- I mean, we're part of the critical modern security tech stack. I firmly believe in what we tell our customers, what we tell Wall Street and more importantly, where we see threats arising. And then I would also say, at any time when an economic situation looks like it's less certain in the future than the past, people look for consolidation plays. We're no longer a product company, and we've got the opportunities to help our customers consolidate on a single pane of glass with a combined expanded vision of being that unified External Cybersecurity Platform. And then if you could maybe just provide some guardrails on how to think about profit inflection in the future, and what kind of underpins that forward leverage in what's going to be a tougher environment. I heard a couple of several questions, so I'll take them in kind of the order I have them in my head. I guess first is a macro environment, we talked about that and how it kind of maybe kind of affects our guidance. But as we sit here today, our demand remains steady, and so we're going to be prudent in how we think about our growth. And I think how that dovetails into profitability, again, we're going to invest in growth but we're going to do so prudently. And as we get into providing you fiscal '24 guidance, we'll update you at that time. Just in general, as it relates to our guidance, we're going to -- we have our internal plans, where again, we're stretching for growth. We know that's important for a security, a software company of our size and scale. But again, I want to do that, like you said, in the full macro where we're being conservative, where we're taking an approach that sees what's happening in the larger macroeconomic conditions. And maybe if I can just squeeze in a clarification, but -- so you gave $153 million of ARR. $83 million of that, I believe, is OPM. You could probably subtract out a handful of millions, low single digits for the rest of IDX. And then I would imagine that implies that, that's an acceleration versus the 24% last quarter. Yes, you're thinking about it correctly, so the different individual components are fairly . But again, we're seeing real nice demand, especially in our enterprise customer base and so that's what drove the higher ARR. One, I would think about ZeroFox revenue as all revenue and that 1 federal government contract that looks very different and put all of that in a core security bucket and evaluate the growth rate there. And then two, in general, our philosophy, as the new kid on the block here is to make sure that we are using conservatism as a part of our guidance methodology and as a part of our planning in the future, allowing us to do exactly what we did here this quarter, which was beat our Q3 inferred guidance and raise for Q4. And I think you'll be able to judge us on our performance in quarters to go, and that's the kind of framework we want to put forth, being raised. For those investors that are looking for even more information, tomorrow morning, we will be presenting at the Raymond James Technology Conference, and you can access that webcast via our Investor Relations site."
}