{
    "symbol": "LUNA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 21:49:20",
    "content": " On earnings calls earlier this year, you may remember that I mentioned we still have some work to do in our project-based business  OptaSense and LIOS, which in prior quarters had experienced delays in several large customers taking delivery of products. For the third quarter of 2022, total revenues were up 43% to $29.2 million compared to the prior year's quarter. We achieved very strong double-digit growth in revenue versus Q3 last year, driven both by a full quarter of LIOS as well as strong demand for legacy Luna products. And finally, within comms test, we also had solid double digit sales growth in Q3 2022 for Lunaâ\u0080\u0099s polarization modules driven by strong sales associated with the intuitive surgical contract that I just mentioned, as well as strong sales of our gyroscope coils for military navigation applications. So with only two months of the year left and three quarters behind us, we feel comfortable reaffirming our outlook of total revenues of $109 million to $115 million and adjusted EBITDA of $10 million to $12 million. As Scott mentioned, our revenues for Q3 2022 were 29.2 million compared to revenues of 20.3 million for Q3 2021, representing a 43% year over year increase. Within sensing year over year revenue growth of 80% was driven by our project-based businesses, Optisense and LIOS and strong performance from Luna legacy products. Gross profit was 16.9 million for Q3 2022 compared to 12.6 million for the same quarter last year, representing a gross margin of 58% in Q3 2022 compared to 62% in Q3 2021. And finally, adjusted EBITDA was 4.5 million for Q3 2022 versus 2.1 million for Q3 2021 and adjusted EPS was $0.09 per share for Q3 2022 versus $0.03 for the prior year quarter. We talked about last year, if you take out the LIOS OpEx out of that, we talked about, we felt like we had the OpEx level that could sustain additional growth that we didn't need maybe the OpEx was a little bit ahead of the revenue that we saw coming, and I think you see that come to fruition here in Q3."
}