{
    "symbol": "LUNA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 15:47:01",
    "content": " For the first quarter of 2022, total revenues were up 7% to $22.5 million compared to the prior year's quarter. Your line is open. And historically, they've actually been running over the last several years in those growth rates mid-teens kind of growth rates and everybody's kind of had a little impact from COVID, so it doesn't necessarily account for the last 18 months, but we expect to get them back on a growth path that's similar to Luna's and we've seen – even in the early days here, as I've mentioned, we've seen the capability to do that. Your line is open. Your line is open. As long as I can recall, certainly the last five years and really that has – obviously with COVID and some other things going on, it has crept up, but we're now seeing more of a 1.2 where a lot of demand for our business and just not able to get it necessarily off the dock with some larger orders shifting from just a box seller to solution seller and needing to get out into the field and things like that. And we've got – we got everyone working together to go, as I mentioned, previously to go after those low hanging fruits, if you will, the synergies and we've identified right out of the gate within the first couple weeks, we've identified over a dozen opportunities where we can bring a combined solution, so that part's going really well. Your line is open. Your line is open. And I think, what you're seeing, and I know you've followed this for a long time and I think the hard work and dedication that was put in, all through the years by folks like Steve Williamson, who really is the inventor and brains behind a lot of this, what he did early on with guys, we have the Gregs that are out there that have done phenomenal work, the works that Rob supported for years, you can't underestimate the many hours that Irl Duling put into this. But right now there's a lot of – and I think, again, setting that strategy was the best thing that we've done five years ago to be able to really stay the course through this and put the processes in place, look, I mean, we've done, what is it, five or six acquisitions and three divestitures over the last five years."
}