{
    "symbol": "KRT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 18:11:03",
    "content": " We are currently targeting net sales for the 2022 second quarter to be in the range of $116 million to $118 million, up about 24% at the midpoint of the range over the same period last year. Accordingly, for the full 2022 year, we are increasing our guidance with net sales expected to be in the range of $445 million to $449 million versus $360 million in the year 2021 and up from last quarter forecast of full year growth guidance of 17% to 19% or $426 million to $433 million. While some of our higher first quarter ocean freight costs will be absorbed in the second and possibly the third quarter of 2022, we reiterate the full year average gross margin goal of 31% to 32%. We reported record quarterly net sales in the 2022 first quarter, rising 39% to $105.4 million from $75.7 million in the same period last year, reflecting strong growth from existing and new customers. Although some of the higher first quarter freight costs will not be absorbed in cost of goods sold until the second or possibly the third quarter of 2022, overall, freight costs as a percentage of net sales increased from 8.6% in Q1 2021 to 14.4% in Q1 2022. Operating expenses for the 2022 first quarter were $24.8 million, or 24% of net sales compared with $17.9 million, also 24% of net sales in the prior year quarter. As we mentioned in our remarks, even with the $6 million in benefit in our cost of goods sold in the first quarter, overall, ocean freight cost remains, as a percentage of sales, much higher year-over-year. So we are seeing quite a few positive factors that are trending towards basically offsetting the negative -- the expected negative impact in Q2, and that's the reason why we reiterated that for the full year 2022, we still expect to deliver on the gross margin goal of 31% to 32% on average. So in terms of the pricing, the additional color I'll add here is, as you're aware, we implemented multiple price increases in the second half -- primarily in the second half of 2021, also a little bit in the first quarter of this year. In the past 2 years, we -- operational expense has been higher than I would say this year, is that we spend more money on the technology, warehouse management system within the last 2 years as well as our online upgrades that we mentioned in our past quarter earnings calls, and we spend millions of dollars on the upgrading of our online system. I mentioned previously I just wanted to provide a little bit more color on sort of the expectation for the second quarter gross margin, even with the expected hit, if you will, from the ocean freight capitalization, we still reiterated the full year gross margin goal of 31% to 32% on average. And maybe just also to add on to Alan's point, as we think about the impact from the pricing increase for the full year 2022, I would agree with Alan that it's probably going to be roughly half of the total revenue growth or maybe just a little bit less because obviously, when we're comparing year-over-year, last -- the first quarter last year, we -- I mean this is -- we're comparing the year-over-year a lot -- because a lot of the -- most of the price increases we implemented last year was from the second half of 2021. And over 50% of that was already paid for last year and moving forward this year that will be seen in the products such as the automated robots, and as you mentioned, the JV, the investment, I would say that's part of the CapEx that we're looking to spend in terms of no more than 5% of our revenue."
}