{
    "symbol": "KRT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 09:39:04",
    "content": " We continue to see solid gross margin improvement into the fourth quarters from normalized ocean freight rates, continue shift to higher margin products and foreign currency gains, which already allow us to implement some price reduction to proactively pass on savings to our customers. Although ocean freight rates dropped significantly towards the end of the third quarter, total freight and duty costs remained elevated at 14.8% of net sales during the third quarter of 2022 compared with 14.1% of net sales in the prior year quarter. Operating expenses in the 2022 third quarter were $26.3 million or 24% of net sales, compared with $24.4 million, also about 24% of net sales in the same period last year. Consolidated adjusted EBITDA margin was 10.7% in the third quarter versus 8.8% for the same quarter last year, adjusted diluted earnings per common share increased 50% to $0.33 from $0.22 in the prior year quarter. That's what we're seeing that fourth quarter gross margin will be significantly higher than the our second and third quarters, so that we're confident comfortable that our entire annual gross margin goal of 31% to 32% will be achieved by the fourth quarter. And actually, and also on top of that, we're actually, as we mentioned earlier, we're actually gaining some new accounts, in the Midwest market and southeast market region, that region that we haven't really been tapping into, now that we're able to start going out on sales car, people can fly to customers and start presenting our product, we're seeing more and more new customer coming in to our way that basically, that needed the product didn't realize, didn't really have an opportunity to go out or look for new vendors and suppliers. I believe that gross margin will be -- we're looking at actually a 31% to 32% gross margin in 2023 or even higher, because the product that we're now, we're looking to bring in are more eco-friendly products, ESG items."
}