{
    "symbol": "KRT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 18:06:12",
    "content": " Despite the significant increase in total freight and duty capitalization costs in the 2022 second quarter, we've achieved gross margin of 29.6% consistent with the 29.7% in the same period last year. We reported record quarterly net sales for the 2022 second quarter rising 22% to $114.9 million from $94.5 million in the same period last year, reflecting strong growth from existing and new customers. Overall, freight costs as a percentage of net sales increased to 18% in the second quarter of 2022 from 10.3% in the second quarter of 2021. Other income net was $1.1 million for the 2022 second quarter including a gain on foreign currency transactions of $850,000 compared with $4 million in the same period last year. Adjusted EBITDA for the second quarter was $11.8 million, an increase of 15% from $10.3 million a year ago. Net cash provided by operating activities was $3.7 million for the three months ended June 30, 2022 compared with net cash used in operating activities of $7.2 million for the same quarter last year. So in last year fourth quarter when we had the -- our earnings conference call, we were mentioning that everyone is saying that there's going to be a headwind because ocean freight is growing. And that's where we see a -- we had -- in the first quarter earnings, we had a favorable capitalization freight duty capitalization in the first quarter because we brought in a lot of products using the higher freight rate. Jake, just to add on to Alan's comments to answer your question, during the second quarter, we did have an unfavorable impact from the freight and duty capitalization of about $2.3 million. Right now, I still see majority of the many company chain accounts in the market that are behind these -- using these bagasse products are mainly, I would say, 80% are from China and that's where we want to reduce our reliance from Chinese manufacturer into other parts of the world, especially, if we can manufacture domestically, I would think that -- I've already spoken to a lot of chain and we are gaining a lot of support that, if the price is not too much more, they would actually support the domestic manufacturer like us. And basically, right now, I would -- the reason I said that, our inventory is going to drop significantly, especially by the end of the third quarter is that we have already seen, a reduction in terms of ocean freight coming in. If you look at the second quarter, the total ocean freight represented about 18% of net sales, which as I said included the unfavorable impact of a little over $2 million already from this capitalization. Domestically, the raw material did drop about 10% in terms of raw material, but most -- all of the manufacturing out there are seeing a higher operating cost in terms of warehouse, storage feed, the labor cost has increased, the operational cost, the transportation of the movement of the raw materials; so that we haven't seen the softness in terms of demand for plastics."
}