{
    "symbol": "OTTR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 20:26:08",
    "content": " Our electric segment increased earnings by $3.4 million or 22% over Q2 2021, driven by increased commercial and industrial sales and the finalization of the Minnesota Rate Case interim rate refunds. Our plastics segment quarterly earnings increased $41.4 million over Q2 2021, which was primarily due to an 86% increase in the price per pound of PVC pipe sold. The increase in earnings was primarily driven by increased retail sales volumes from commercial and industrial customers, primarily due to a new commercial customer in North Dakota, a revision in the interim rate revenue calculation, which was approved by the Minnesota PUC in the second quarter of 2022. Net earnings for the manufacturing segment increased $1.85 million from the same quarter a year ago, driven by an 8% increase in sales volumes at BTD as end market demand remains strong and our customers' supply chains have begun to improve. Net earnings from the plastics segment increased $41.4 million, compared to the second quarter of 2021. As we went through our strategic planning process and we're able to obtain some good outside independent market data that looked at longer-term trends in PVC industry, not only for the resin suppliers, but for the PVC pipe converters, we now believe that range is going to be in the $36 million to $41 million level of earnings beginning in that 2024 time frame. As we've now come through the first six months and have visibility into the third quarter and where we think the fourth quarter is, there's been, kind of a real reset that's occurred in terms of the view of resin â\u0080\u0093 or sales prices for PVC pipe and the related spreads for that as well. And what are they going to â\u0080\u0093 what would they be willing to pay for a business that today is generating certainly stronger than normal earnings and cash flows, but the current view of the industry is that over long-term, next five, six years, it's going to revert back to more like it was historically. And then just the fact that in 2021 and 2022, this whole supply versus demand challenge we've been experiencing, I think there's a general view that there's a reset that's occurred in PVC profitability on a go-forward basis that leads us to believe that we're going to see a higher level of earnings going forward in that $36 million to $41 million range I mentioned. Based on our strong second quarter performance and our updated view for the remainder of the year, we are raising our 2022 diluted earnings per share guidance range to $6.83 to $7.13 from our previous guidance range of $5.15 to $5.45."
}