{
    "symbol": "NGL",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-09 21:27:10",
    "content": " Hi, and welcome to NGL's second quarter fiscal 2023 earnings call. In accordance with the Act, I would also like to direct your attention to the Management's Discussion and Analysis section and the risk factors discussed in the Partnership's annual report on Form 10-K for the year ended March 31, 2022, and in other SEC filings made by the Partnership, which are available on our website and on the SEC's website. Adjusted EBITDA for the quarter totaled $104.8 million with year-to-date adjusted EBITDA totaling $209.9 million, representing a 24% increase compared to the first half of fiscal 2022. Produced water volume processed totaled approximately 2.3 million barrels per day, growing nearly 29% from the comparable quarter last year and over 5% from the previous fiscal quarter. The Liquids Logistics segment reported adjusted EBITDA of $16.5 million for the second quarter of fiscal 2023 and $29.4 million year-to-date compared to $18.5 million and $24 million for the respective periods last year. While physical volumes on Grand Mesa decreased during the quarter as a result of declining volumes in the DJ Basin, in part due to producer permitting issues, these volume decreases were offset by strong physical margins related to higher contracted rates with certain producers as we realize the full price adder on certain contracts whose rates increased with crude oil  as well as increased differentials on certain other sales contracts. Additionally, as we move into our third fiscal quarter, we are seeing some increase in volume as producers are working through their permitting delays, and we're eager to see how the recent increase in DJ Basin rig count impacts the second half of our fiscal year. We expect -- we continue to expect the Liquids Logistics and Crude Oil Logistics segment to contribute adjusted EBITDA net of all corporate expenses, that will bring us to a $600 million plus of total adjusted EBITDA guidance for fiscal 2023. From a balance sheet perspective, we reported total liquidity of $175 million on September 30th, with total borrowings on our ABL facility of $287 million. A reminder, we are deep into the inventory build season for our butane and propane businesses and expected -- and we did expect borrowings on our ABL facility to increase during our second fiscal quarter as a result of this inventory build. As inventory is liquidated over the next six months, we expect to see corresponding decreases in borrowings on the ABL facility with the low point of borrowings being near the end of our fiscal year. As you have heard, we are confirming our fiscal 2023 guidance of over $600 million EBITDA for all of NGL, and in excess of $410 million for Water Solutions. With respect to Water Solutions, we have achieved EBITDA of approximately $210 million in the first six months of this fiscal year. Obviously, repeating this performance in the second half of the fiscal year results in $420 million of EBITDA. In the first 40 days of this current third quarter, which is October and November month to date, we are averaging water volumes processed about 5% above the second quarter. Colder than normal weather in the back half of November and much of December will benefit this segment if it occurs, and is a welcome change compared to the much above temperatures we had last year for the same time period. As we have mentioned in previous calls, we continue to focus on the balance sheet and have repurchased approximately $76 million of our 2023 unsecured notes year-to-date, bringing the balance to $399 million as of September 30, 2022. Additionally, as previously discussed, we are still working on certain corporate initiatives that if successful, would allow us to repay the 2023 notes by our fiscal year-end. I think I can address what I think the question was, which really was -- I think he -- Will had referenced the liquidity drop of $111 million. Our ABL facility will naturally increase in borrowings, meaning capacity or excess capacity will decrease on the ABL facility as we build inventory into the fall -- during the fall period. So,  would be expected to build back up as we use proceeds from the liquidation of inventory to repay those borrowings on our ABL facility."
}