{
    "symbol": "AB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 16:12:08",
    "content": " Gross sales were $19.8 billion, down $12.5 billion or 39% from the year ago, reflecting much lower global retail demand as risk aversion prevailed in the face of volatile markets. Now, I will review our clients, beginning with Retail on Slide 7, gross sales of $13.8 billion in our Retail channel declined by $11.8 billion over last yearâ\u0080\u0099s record levels and $3.5 billion sequentially, reflecting buoyant active equity sales last year and third quarterâ\u0080\u0099s torpid market sentiment across both fixed income and equities. Including year-to-date 2022, retail active equity has posted 6 consecutive years of positive net flows, generating $45 billion in net AUM or 9.4% average annual growth over this period. Starting with Slide 13, we had a wide global platform responsible for over $0.5 trillion of AUM across six continents, split relatively evenly between Institutional and Retail with local presence in all major asset management geographies across APAC, EMEA and Latin America in addition to the U.S. We have regional expertise and local coverage, key elements that enable us to deliver complete solutions to clients. With over 10 consecutive years of organic growth, our Muni SMA business has grown to over $16 billion of AUM, led by Muni Tax Aware and including high-quality Muni Income and Custom Muni. We have grown this business organically by 15% annualized since 2011, to one which we now manage over $60 billion AUM for 29 custom target date and lifetime income clients across the U.S. and UK. Having grown fourfold to $13 billion AUM over the 8 years since acquisition, Global Core is now diversified across geographies with exposure in both APAC and EMEA in addition to U.S. and channels have grown across Institutional, Retail and Private Wealth. As a reminder, this was the first quarter, including CarVal, which added $12 billion of AUM at approximately a 1% fee rate and margins consistent with our mature private alternatives businesses. G&A expenses increased 7% in the third quarter versus the prior year period, reflecting the negative impact of a higher U.S. dollar, the addition of CarVal and continued strategic investments in growth and efficiency technology projects. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}