{
    "symbol": "AB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 14:07:13",
    "content": " Firm-wide active net inflows of $12.2 billion, a 6% annualized organic growth rate, quarter end assets under management of $735 billion rose 5% year-over-year, while declining 6% from the prior quarter and average AUM of $751 billion increased 9% year-over-year and declined 1% sequentially. Firm-wide, first quarter net inflows of $11.4 billion represented a 6% annualized organic growth. In Private Wealth, gross sales increased 12% over the prior year period, with net inflows of $2.2 billion or 7% annualized, as growth accelerated with ultrahigh net worth clients. A few words on the growth of our defined contribution business, which we met -- where we manage more than 70 billion in custom target-date AUM for nearly 2,000 of the largest and most sophisticated DC plans in the U.S. We are proud to be an early innovator in delivering an in-plan guaranteed income solution with our lifetime income strategy, celebrating its 10th anniversary, managing $10.4 billion in assets, including $4.2 billion in secured income benefits. Net inflows accelerated to $2.2 billion, a 7% annualized organic growth rate positive for six quarters of the last seven quarters. Private Wealth alternative’s AUM has accelerated, with the first quarter 2022 commitments more than doubling versus the prior year period and our ESG AUM stands at $6.5 billion, up 26% year-over-year. Operating income of $248 million decreased 5% and operating margin of 24.7% decreased by 120 basis points, GAAP EPU of $0.87 in the quarter increased by 7% year-over-year. On slide 28, beginning with revenues, net revenues of $904 million increased 10% versus the prior year period and were down 12% sequentially. Base fees increased 10% versus the prior year period, reflecting higher average AUM across all three distribution channels, driven by both higher markets and year-over-year net inflows. Moving to adjusted expenses, all in, our total first quarter operating expenses of $619 million increased 10% year-over-year and we are down 2% sequentially. Total compensation and benefits expense increased 9% in the first quarter versus the prior year period, reflecting higher AUM driven revenues and performance fees. The remaining 12% year-over-year increase was split relatively evenly between inflationary pressures, including market data and related as we lapped last year’s first quarter when inflationary pressures had not yet fully emerged, return earnings, growth related technology efficiency and other projects, and core G&A necessary to support the organic growth of our business."
}