{
    "symbol": "DTM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 11:53:02",
    "content": " At this time, I would like to welcome everyone to the DT Midstream Fourth Quarter 2022 Earnings Conference Call. Before we get started, I would like to remind you to read the safe harbor statement on page two of the presentation, including the reference to forward-looking statements. During today's call, I'll recap our major accomplishments in 2022, highlight our new disclosures and provide an update on our major development projects that we are currently executing on. So with that, we had a very successful year in 2022, and I'd like to thank all of our employees for their exceptional performance throughout the year. We delivered full year adjusted EBITDA of $830 million, which exceeded our revised guidance range, and represents 14% growth from our 2021 original guidance. Commercially, we executed on numerous organic growth opportunities that will deliver long-term growth and value creation. Foremost, among these are expanding our LEAP asset in the Haynesville by 90% to 1.9 Bcf a day, expanding our Appalachia gathering system by 20% terming out contracts on NEXUS and our Washington 10 Storage complex at attractive rates and filing our Class VI well permit for our Louisiana CCS project. We also closed on the Millennium pipeline acquisition, which makes us a majority owner in the asset. On the construction front, we successfully executed our Stonewall and Appalachia gathering expansions, the Michigan Gathering Conversion Project, and a portion of our Blue Union expansion. Finally, we published our inaugural sustainability report, and we're recognized for our exceptional customer service, receiving the top ranking in the MASTIO Customer Service Study for midstream companies. Looking ahead to 2023 and beyond, I'm highly confident in our future growth and financial strength. Jeff will provide the details on our new financial disclosures, including our increased 2023 adjusted EBITDA guidance and a strong early outlook for 2024, our increased quarterly dividend and our updated five-year capital outlook. Our portfolio is well contracted with long-term take-or-pay agreements, our gathering assets serve Tier 1 resource areas that are well-positioned on the drilling cost curve, and we have no direct commodity exposure. Our assets provide outlook capacity to premium demand markets, which are expected to grow significantly between now and the end of the decade. Over our 20 plus year history, we have a proven track record of strong performance and downward price cycles and are highly confident in the durability of our business even in this lower commodity price environment. In the fourth quarter of 2022, we delivered adjusted EBITDA of $227 million, which is a $20 million increase from the third quarter. Pipeline segment results were driven by the fourth quarter benefit of the Millennium Pipeline acquisition, higher short-term revenues at the pipeline joint ventures and Washington 10 Storage and continued high levels of short-term optimization at LEAP. In total, the Pipeline segment results included approximately $7 million of favorable optimization and short-term revenue that resulted from the wide basis differentials across many of our assets. Gathering segment results were driven by higher revenue at Appalachia gathering system, offset by lower revenues at Susquehanna gathering and the impact of a planned maintenance outage at one of our Blue Union treating facilities. Operationally, we hit an all-time high this quarter in total gathered volumes, which averaged approximately 3.1 billion cubic feet a day, driven by the in-service of expansion projects in both regions and partially offset by lower volumes at Susquehanna. We are increasing our 2023 adjusted EBITDA guidance to $880 million to $920 million, which reflects the strength and durability in our base business, as well as the expected contribution from our organic growth projects. Similar to 2022, our plan for 2023 is built on the expectation that volumes and EBITDA will be stronger in the back half of the year as we execute on our expansion projects. Due to our confidence in our portfolio, we are also providing an early outlook for 2024 adjusted EBITDA of $920 million to $970 million, which represents a 9% annual growth rate from our 2022 original guidance. We remain committed to a growing and durable dividend and have declared a quarterly dividend increase to $0.69 per share, which represents an 8% increase from our prior quarterly dividend. Our updated five-year capital outlook can be fully self-funded with no incremental debt or equity issuances, and we expect to naturally delever as the business grows, which will provide additional balance sheet capacity and further value creation optionality. We remain committed to our long-term leverage ratio ceiling of four times and possess strategic options to delever further via project financing at our pipeline joint ventures, which are currently under leveraged. And as of year-end, we had nearly $700 million of available liquidity and no debt maturities until 2027. Our decision framework for deploying distributable cash flow is designed to maximize shareholder value with our option, including deploying capital to accretive organic growth projects that fit our investment criteria, return of capital to shareholders through dividends or buybacks or paying down debt. Active discussions continue for further expansions of LEAP, and we recently executed a five-year term extension on 500 million per day of existing capacity. We have an exciting year in front of us as we execute on our growth projects, which will enable strong EBITDA growth through 2024 and beyond. Your line is open. So, this year, we'll be ahead of CapEx year as many of our projects are executing sort of at the same time this year. Just as you may recall, we reduced our organic capital guidance in previous years, and this is around the timing of when we're actually spending the capital for the construction of these new assets. So, this year is going to be a lumpy year for us. And you can see that this year, the bulk of that $800 million is being deployed. In terms of looking forward, we continue to focus on organic opportunities. As we look to sanction any of those projects, we're always looking for accretive multiples and accretive to the equity holders when we sanction and deploy that capital for organic opportunities. We're well aware that we have two primary businesses here, the Pipeline gathering in each one of those segments sort of have a different value thresholds around the capital deployment. So, we're constantly looking at that and make sure that we maintain a disciplined capital allocation regime here. The way I think of M&A, M&A is option value for us, has to compete with organic capital allocation and we have to ensure accretion -- shareholder per unit accretion for any M&A transaction. The market presents these opportunities from time-to-time, and we can't really predict when they're going to come. For us, it's really just maintain that discipline of capital allocation, if it makes sense and if it fits strategically, it's consistent with our investment thesis, and it creates a clear line of sight to shareholder value accretion. Your line is open. And then, you had a helpful slide there where you show the breakeven on your gathering acreage, and then obviously, you have the indirect contractual support on LEAP. So, I'm just going to step back a second and maybe address just the high level fundamentals with sort of the current commodity price environment that we're seeing. So, I'll say it this way, our guidance reflects the most current information that we have from all of our customers. So, when I look at sort of the current rig activity, which is still sitting around that 80-rig level, you've heard what some of the public producers have said recently. Even though that producer is lowering rigs, they are still projecting a healthy growth -- volume growth in the basin. So, I'm highly confident in the quality of the resource and the resource that we serve, we expect to see growth. Marc, you alluded to the LEAP contracts, and as most investors know, our gathering expansions that were in flight on marry into our LEAP expansions that we're in flight on. As we said previously, our LEAP contracts are all demand based contracts. So, there's a significant economic incentive for our shippers to fill those contracts, and that's exactly what we expect, and that's all been reflected in our 2023 and 2024 guidance. EBITDA was down a little, and you referenced some planned treating capacity made in 4Q. In terms of Q4, we -- one of the reasons why I think we won the number one midstream company in North America is because of the reliability of our assets. There is a cost component to that planned maintenance, and there's a revenue impact of that planned maintenance, but it's very important for us to do that to retain reliability for our customers. In terms of looking forward, yes, we will be bringing gathering and treating facilities on -- in 2023 and 2024 and volumes will ramp as those facilities come online. Your line is open. Like if we're looking at 2023 and thinking about kind of free cash flow and then the dividend on top of that, it's a fair amount of outspend this year. So, I guess, is the message that we'll see a fair amount of outspend this year, but for 2024 plus that should reverse pretty materially. I'll start, and then I'm going to pass it over to Jeff to maybe provide a little more color. But John, I think the best way to understand this is just the lumpiness of the way the business and the timing of the CapEx spend. And I think in previous years, we've backed down our CapEx guidance as we were shifting spend and actually delaying spend to help it actually improves the returns of the projects when we do that. If you look at our deck, and I'm going to refer you to slide 13 and slide -- actually, it's slide 12 and slide 13. You can see that $800 million of existing committed organic investment, the vast majority of that is getting spent this year. So, when you look at the difference between those two numbers, that's what contracts the committed for future years. So, again, this is in line with -- just follow on what David said, this is in line with our plan that our ceiling is four times on our leverage, and we're very comfortable with that. And then as we move into 2024 and beyond, we continue to see, as we've been communicating before, that deleveraging down into the mid to low three as you get into the later part of 2024. Also, things that we have available to us, some of them are very strong contracted cash flow and the like, but we've also got under leverage at our JVs. And so that's something that again we're looking at all the various tools that we have available to us because again, those are -- would be investment grade sort of potential vehicles that we could also utilize as we think about our balance sheet and maintaining the strong posture that we have. And my sense is, the market has sort of moved on from there and NEXUS had a phenomenal year in 2022. And I'm sure as you guys put through all the details, the financial details, you'll see that as well. So, we're very happy with how that asset has been sort of -- how we had it positioned and how we've repositioned it contractually in this new market structure that's in front of us right now. So, as I said in my opening remarks, we continue to see this very strong desire where pathways out of Appalachia to the strong market centers that all of our assets serve. But I'll just say this, John, what we've talked about in the past, we are continuing to work on and execute around, which is how can we creates more capacity on NEXUS without going through a FERC process. Your line is open. And I just wanted to know if you could give us any sense for a little bit more detail as far as what bucket where the CapEx is going, be it gathering versus interstate versus energy transition or Haynesville or Appalachia or even specific project kind of scoping size, just trying to dig in a little bit more. So, what we contractually have committed today and the vast majority of that is currently focused on the Haynesville. So, it's LEAP and it's the gathering expansions that were in flight on that are going to feed LEAP. And I'd say probably the weighting is heavier towards the Pipeline segment than it is towards the Gathering segment in terms of the capital deployment, and I'll leave it at that. If we look at that five-year forward look, so the -- I call it the $2 billion, the midpoint there of the guidance. In terms of how I think about where that will get deployed, I fully expect a chunk of that's going to go into the energy transition. And in the opening comments, we sort of -- we're putting that towards the back end of our five-year plan, but the CCS project is maturing in Louisiana. When we FID it, we'll provide the investors more color around the CapEx and some more of the details, but feeling very good about that project, very optimistic. There's lots of interesting things happening in our Northern region, especially in and around Appalachia with various hydrogen hub applications that we're participating in. So, again, I think those are still early cycle projects, but I do expect a chunk that we'll deploy into that segment. With regards to the total addressable market or even more specifically as it relates to the Haynesville, it seems like economies of scale could really help economics here. And so, there's a number of other treaters in the Haynesville. And we provided some color around this project that we're targeting 1 million metric tons a year in terms of the, what I'll call, the storage or the sequestration capacity of the formation. And you're right, there are other neighbors in our neighborhood that have similar plans, but they may not have the concentration that we have of CO2, and you're very accurate in your statement that scale is important here. That will be like a Phase 2 opportunity for us as once we take care of our own needs, look at potentially offering to third parties. I think it's premature to foresee how that third-party business would evolve, whether it would be a fee-for-service, whether it would be a potential JV partner. But the other exciting part around CCS that we see, it's transportable to other geographic areas and footprint, particularly up here in the Northern part of our footprint. Any opportunities for CCS, we have lots of early stage conversations going with clients where this would be probably the most economical way for them to mitigate their carbon emissions. So, again, our goal established the , get this project FID, take care of our own needs and then replicate and export that to other jurisdictions where you have high concentrations of customers, where this is an economic solution for them to decarbonize and you have the right geology in the region to accommodate it. It's both internal in terms of sector, but there's a lot heavy industry up here -- and that's a lot of CO2. And again, when you look at the current tax regime and the capital investments that some of these industries have, this is a very viable and economical pathway for them to materially decarbonize their operations. So, there's lots of conversations in all sectors of the economy, the power sector, the industrial sector, the chem sector, the ag sector where this is very applicable. So, what I'll call from New York right through to the Midwest where all of our assets are. Your line is open. Well, maybe I'll just start with just kind of going back to what I said on the earlier remarks, for one of our anchor shippers, we extended 0.5 Bcf a day of their contract for five additional years, and that makes that contract be a 15-year term contract. So, I think that really spoke volumes to us of the importance of this asset is connectivity, where it's connecting the basin to the LNG corridor and the -- just the strength in the LNG market here North America period that, that customer wanted to do that with us. In terms of the next wave of expansion on LEAP, as I said in my opening remarks, we're in active conversations with a number of clients around that. As you would expect, these are big commitments with customers that typically match up with commitments downstream of our assets. I think we just give that the time that it takes for a good rational business to transact, and we're confident that there's going to be more to come. And the way we're doing the expansion, we have a runway out to 3 Bcf a day with this asset. And we can continue to expand in right-size increments, which I think is very distinctive in the basin versus some of the other projects that are out there that require large scale commitments before they can FID. So, we feel really good about where we're sitting with LEAP right now, and like I said, I do expect more."
}