{
    "symbol": "ALSN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 22:07:08",
    "content": " Net sales accelerated to $677 million in the first quarter, returning to pre-pandemic levels and producing the third strongest revenue quarter in Allison's history. This program leverages Allison's existing and proven 4000 Series fully automatic transmission, and represents more than $50 million annually in incremental revenue potential for the Outside North America On-Highway end market. Year-over-year net sales increased 15% to $677 million from the same period in 2021, resulting in the third strongest revenue quarter in Allison's history, as production continues to accelerate to meet resilient customer demand. The increase in year-over-year results was led by an 8% increase in the North American On-Highway end market, principally driven by continued strength in customer demand for last mile delivery, regional haul, and vocational trucks. Year-over-year results were further led by a 30% increase in net sales and record quarterly revenue in Outside North America On-Highway end market, driven by improving demand across all regions and the continued execution of growth initiatives. A 14% increase in net sales in the Service Parts, Support Equipment and other end market, principally driven by increased demand for North American Service Parts and Global Support Equipment and a $30 million increase in net sales in the Global Off-Highway end markets, driven by improving demand for hydraulic fracturing applications in the Energy sector, as well as higher demand in the mining and construction sector. Consistent with Allison's prudent and well-defined approach to capital allocation, we settled $81 million of share repurchases during the first quarter or over 2% of outstanding shares. We view this as relatively early days for those markets when you look at how undersupply, they've been, as well as just broader demand conditions in terms of the last peak that we had, I think we were well on the other side of -- on an annual basis, including parts in excess of $300 million or $400 million as a total run rate to give you a measure there. The sales guide by end markets, given Fred's comments, and you can see in the press release affirming the full year guide, if you -- to your question, if you talk about puts and takes, I would not say they're really dramatically different."
}