{
    "symbol": "NSC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 13:00:35",
    "content": "  Operator: Greetings, and welcome to the Norfolk Southern Corporation Fourth Quarter Fiscal Year 2022 Earnings Call. Thank you, and good morning, everyone. Please note that during today's call, we will make certain forward-looking statements within the meaning of the safe harbor provision of the Private Securities Litigation Reform Act of 1995. These statements relate to future events or future performance of Norfolk Southern, which are subject to risks and uncertainties and may differ materially from actual results. It's now my pleasure to introduce Norfolk Southern's President and Chief Executive Officer, Alan Shaw. Here with me today are Ed Elkins, our Chief Marketing Officer; and Mark George, our Chief Financial Officer. I'm also pleased to welcome Paul Duncan, who moved into the role of Chief Operating Officer on January 1. At our Investor Day last month, we shared our strategy to create long-term shareholder value through a balanced approach of reliable and resilient service, continuous productivity improvement and smart and sustainable growth. I was at the Midwest Association of Rail shippers winter meeting last week, talking with customers about our new strategy. With performance, we made great strides to close the year and are encouraged by our progress. Service is at the best it's been in more than 2 years, and customers are noticing. Volumes in December were at 52-week highs, outperforming typical seasonality as Ed and Paul's teams work collaboratively with our customers to attract business to Norfolk Southern, overcoming headwinds associated with a slower network in the first 3 quarters that constricted our capacity. For both the fourth quarter and full year 2022, we were able to achieve double-digit growth in both revenue and EPS. We established new records for full year revenue, operating income, and other metrics that the team will detail later this morning. Also this quarter, we finalized national contracts with the unions representing our craft colleagues. With national bargaining now complete, we started discussions at the local level to address important quality of life issues. We recognize that the macroeconomic environment in which we operate is uncertain, and you'll hear more about the impact of that from Ed and Mark. As you heard at our Investor Day, we believe Norfolk Southern is uniquely positioned to deliver long-term shareholder value through top-tier revenue and earnings growth, industry competitive margins and balanced capital deployment. We will get there by being a customer-centric operations-driven service organization, and we look forward to sharing our progress with you. When we talk about growth, our people hear stability and opportunity. One 40-year Norfolk Southern veteran in Birmingham told me last week, he has never been more optimistic about the direction and culture of the company. Since we spoke last at our Investor Day, our service is the best it has been in more than 2 years. Our leadership, the implementation of our simpler, more executable operating plan top SPG and our continued resource adds have contributed to significant improvements in service for all of our customers. For premium intermodal, we safely delivered a perfect peak season for our largest parcel customer. Average container transit times have been reduced by 12 hours between Chicago and the Northeast, our largest corridor, with consistency also now meeting expectations. Merchandise performance is consistent, and this is another segment where our improved velocity is creating capacity. Our service product has turned the corner, and we are focused on building further reliability and resiliency into our network that our customers expect moving forward. We are committed to our balanced approach to service, productivity and growth. At Investor Day, I referenced the flywheel effect that speeding up the network will produce. This is the start of that flywheel, which produced a 6% improvement last quarter and has improved 12% so far in January. Next, we have grown our workforce, and that has been a critical element to our service improvement. Our GTMs were flat versus last year while our training pipeline has remained above steady state levels, pressuring workforce productivity. Lastly, we have set another quarterly record for fuel efficiency. Improving productivity is key to our balanced plan, and we are going to continue driving sustainable efficiency gains to provide value for our shareholders and our customers. On Slide 8, I will recap the industry-leading progress that we have made on hiring in 2022 and talk about what we see ahead. We entered the year in the very early stages of priming the conductor training pipeline and ramped up in record time, which was no easy task given the tightness in the labor market. We increased training wages, drove efficiencies into our onboarding process Jump started a grassroots campaign leveraging referral incentives and more. We are now focused on shoring up the remaining crew bases that are short, and we are determined to do so in 2023. As we make progress, we are deploying go teams more effectively and are executing the resiliency vision laid out at Investor Day by cross-qualifying crews and expanding training efforts. First, let's talk about the culture of continuous improvement we are building. With Intermodal, we are using the initial rollout and learnings from our high-frequency operating plan discussed at Investor Day, along with our perfect peak season to improve capacity and reliability across our intermodal franchise. On the merchandise side, we are applying continuous improvement principles identifying and implementing those next levers that will drive even greater resiliency and resource productivity to move cars faster and more consistently. Next, we are slated to modernize another 115 locomotives this year, converting them from DC to AC traction technology and giving them a full rejuvenation. These 115 rebuilds will reduce locomotive hauling capability equivalent to 150 DC locomotives, providing additional capacity for growth with fewer assets. Our DC to AC conversion strategy will provide further opportunities to grow train size and increased train productivity, which we discussed at Investor Day. And just this month, we increased train size 53% in 1 of our 2 highest volume export cholines which will provide greater capacity and resiliency in our customer supply chain. Next up, let's talk about our capital investments. Our best-in-class engineering team safely delivered a productive year with more than 520 track miles of rail replaced, the most NS has done in 3 decades. We're primed to execute on our capital plan in support of safety, resiliency, growth and productivity -- this will include a longer siding between Cincinnati and Fort Wayne, which will incorporate additional resilience into our train network. Lastly, we are intensely focused on converting the capacity gains that we have made with top SPG and our disciplined execution of the plan into additional volume moving over the railroad in 2023. Our intermodal, merchandise and bulk service are all now consistently performing at high levels of service across our network. It's great to have you with us, and good morning to everyone. Let's review our results for the fourth quarter, starting on Slide 11. Overall, revenue grew 13% year-over-year to $3.2 billion, with higher revenue from fuel surcharge and price improvements more than offsetting a 1% decline in volume. Speaking of merchandise, Volumes recovered to prior year levels as service improved in the fourth quarter, enhancing our ability to drive value for our customers. As Paul highlighted earlier, we are making meaningful progress on improving car velocity in our merchandise fleets, and we started to see the results of that increased velocity toward the end of the quarter. Merchandise revenue increased 12% year-over-year to $1.9 billion and revenue per unit, excluding fuel, reached a record level from price gains and positive mix. Conversely, our international lines of business grew in the fourth quarter. Total intermodal revenue per unit and revenue per unit, excluding fuel, were up year-over-year on higher fuel revenue and price gains. If we turn to coal, our results for the quarter reflect both our success in capturing upside revenue potential from the market dynamics as well as our ability to create capacity for growth through improved service. Coal revenue for the quarter increased 28%, driven by price gains, volume growth, higher revenue from fuel surcharge and liquidated damages from prior volume shortfalls. Both revenue per unit and revenue per unit, excluding fuel, reached record levels, reflecting the value of our market-based pricing approach in these volatile energy markets. We were able to leverage increased equipment availability from improved cycle times to capture more utility coal business, which led to 9% volume gain in utility coal in the fourth quarter. Overall, coal volumes increased 8% in the quarter, and this volume growth was partially offset by year-over-year declines in coke shipments resulting from facility closures. Total revenue for the year reached $12.7 billion, a 14% increase from 2021 driven by higher revenue from fuel surcharge and price gains, partially offset by volume declines. We delivered record level total revenue and revenue less fuel, revenue per unit and revenue per unit, excluding fuel, despite 3% decline in total volume. Volume headwinds were strongest in our intermodal franchise, where a weakening truck market and supply chain congestion led to declines in annual volume. Lastly, if you will join me on Slide 13, our outlook for 2023 is cautiously optimistic amid uncertainty in the macroeconomic environment and some signals of a slowdown in activity. At least in the near term, while lower fuel prices and accessorial revenues will temper our revenue per unit. Within merchandise, we anticipate that macroeconomic conditions will pressure a variety of the markets that we participate in. We're mindful of recent weakness in industrial production, particularly with respect to manufacturing, and that drives many of our markets. Additionally, the weak housing market will be a headwind to many of our industrial businesses and we expect this weakness to persist in 2023 as the housing market adjusts to higher interest rates. Looking at intermodal, volume growth will be dependent on the macroeconomic environment, although our improving service levels will create capacity for growth. And so long as the U.S. consumer remains resilient, we would expect supportive demand for intermodal. Weakness in the truck market at the start of the year, along with housing will be a headwind but we anticipate the truck market to rebalance supply and demand later this year. Our international business will continue to benefit from lower ocean rates and improving supply chain fluidity at inland points, prompting a return of our customers to Inland Point Intermodal. While overall utility demand is likely to remain flat, our capacity to handle more of that demand will increase with efficiency and productivity improvements on our network. For export, Norfolk Southern will benefit from additional coal supply coming online despite softening seaborne prices. We will experience tough coal pricing comps in the first half of the year, which will pressure export met ARPUs on a year-over-year basis. Overall, we are energized by our recent momentum heading into '23, and we are focused on leveraging that momentum to drive value for our customers and grow our business. Uncertainty and downside risks are certainly still present, but we're going to continue to focus on the things that we can control to successfully execute our strategic plan and results for our customers and for our shareholders. And lastly, I'd like once again to recognize our customers for their partnership throughout 2022 and thank them for their business. Thank you, and good morning, everyone. As you heard from Ed, we had another quarter of strong revenue performance, up 13%. Operating expenses in the quarter were up $333 million or 19% year-on-year, driven primarily by elevated fuel prices and some significant adverse accrual adjustments that I will describe shortly which had an outsized impact on the operating ratio. EPS was $3.42, up double digits year-over-year. Let's reconcile the drivers of the changes in operating income, operating ratio and earnings per share. Talking specifically to operating income, the $52 million improvement was aided by the first row in the bottom section, a favorable wage accrual true-up related to our commitment to getting retroactive wages distributed to our employees before the end of the year. It was not only the right thing to do, but the acceleration created the added benefit of saving payroll taxes for employees as well as for the company. That adjustment provided a $16 million expense savings, which equates to 50 basis point tailwind to the OR and a nickel boost to EPS. Accrual adjustments related to personal injury reserves based on actuarial studies, adjustments to environmental reserves based on activity and costs associated with derailments that occurred during the quarter. Combined, these adverse items versus a smaller positive adjustment last Q4 results in $57 million of year-over-year headwind in the fourth quarter, which equates to 180 basis points OR drag and $0.19 of EPS. Absent those 2 reconciling items I just detailed, core operating income growth was actually $93 million, and that translates to EPS growth of $0.44. Fuel was again a primary expense driver this quarter, up $141 million or 62% due to elevated fuel prices. Materials & Other was up $78 million, which included the $71 million increase in claims that was heavily impacted by the items we just discussed. Compensation and benefits were up $55 million or 9%, driven by elevated wages from the new labor contracts as well as higher employment levels. Purchased services were up $48 million or 10% in the quarter, driven primarily from continued inflationary pressures, costs related to our service environment as well as technology-related costs as we progress our digital transformation. Depreciation was up $11 million year-over-year, consistent with prior quarters. You can expect in 2023 that the quarterly year-over-year growth will be around double what you see here, meaning that the full year impact will be a step-up in the $40 million to $50 million range. After spending much of the year as a net expense, other income flipped back to a more normal profile and amounted to $34 million, an increase of $13 million over last year. EPS was $13.88, an increase of $1.77 or 15% relative to 2021 and driven by record revenues of $12.7 billion, which was up 14% compared to 2021. As you look at the full year OpEx and operating ratio headwinds versus prior year, Recall the adverse impact of the wage settlement. We had another strong year for shareholder distributions with over $4 billion returned again in 2022, with over 12.6 million shares repurchased. Dividend distributions were up 14%, and you will have read about our Board just approving a 9% or $0.11 increase to our quarterly dividend here in the first quarter. At this time, we see full year revenue level with 2022 performance. ARPU will be down to flat as we deal with pressure from softening coal pricing, lower fuel surcharge revenue and the eventual unwinding of accessorial revenues as supply chains unlock. But in a flat revenue environment, it will be difficult to grow operating income in 2023. As you heard from Mark at Investor Day, we're expecting CapEx in to be roughly $2.1 billion for 2023. Despite the uncertainty, we entered 2023 with great confidence and momentum. We have the right strategy, balancing service, productivity and growth. We have the right team of talented, dedicated railroads, and we are just getting started. Wanted to see if you could offer some more, I don't know, some more detail some additional perspective on the yields, revenue per car in intermodal and also in coal. And then I guess on coal, just a little more detail on the kind of how we ought to model things given some of the puts and takes. Tom, I'm going to turn it over to Ed and let him address your questions on our yield and RPU. You listen to some of our customers on their earnings calls, and you've heard their outlook, it's no doubt of the loose truck market right now. But we see some, what I would call, green shoots out there in terms of bottoming perhaps in the spot market, it's reached what we think is a sustained bottom for the last few weeks. So as we go forward, I think that we reached a point of stability and the market is going to rebalance, we feel okay about RPU going into -- and our opportunities for RPU going into '23 in the market space for truck. On the coal side, fourth quarter, we had a liquidated damage claim, which beefed up that RPU in the fourth quarter. Looking forward, as you can see the forward curves just as well we do, we're going to have a tough comp and a tough road ahead, particularly in the second quarter, in terms of comparisons. But there's still support out there for export met coal in the market, and we're going to handle more utility coal than we did last year. I think without the LD, you would have seen a slight downward RPU sequentially. I think you mentioned on the call at the end that the macro backdrop, it might be tough from a full year perspective to grow EBIT dollars. I'm just sort of curious, as you think about your big picture outlook. There's some tailwinds for us, but also we've got a number of headwinds and Ed just articulated a couple of those rate pressures. Yes, really, it's going to depend a lot on the way the top line evolves. But as we think about -- we've got a lot of tailwinds in the year, including really strong core pricing that we anticipate as well as fuel efficiency. However, that would probably start to manifest more in the back half. And then, of course, we'll have the absence of some of the wage adjustment that we booked in the third quarter related to prior years. And this quarter, I would expect that big claims impact that we had in the fourth quarter was truly anomalous, and I wouldn't expect it to be of repeating nature at all. As we talked about on the call, we do have meaningful inflation to absorb, including the wage increases. And we've got some level of diminishing coal RPU and accessorial revenues as we go through the year, again, mainly in the back half. And then the depreciation step-up that I mentioned, which will be more evenly spaced throughout the year. So in terms of the volume, I know you expect to be able to get some share recapture here. And I guess, Mark have been helpful in terms of laying out the OR expectations, particularly a little bit more close in. So certainly, I would love to understand sort of your view on the potential for OR improvement or maybe holding the line in 2023. But if not, sort of first quarter, first half sort of how do we think about how things are trending out, just given some of the puts and takes you just outlined. So yes, I think we're going to be able to claw back some volume effect as I'm certain of it. The question I think that we're all trying to answer is, can we claw back enough to overcome the demand instruction that's present or might be present in the market in '23. I know I don't have to, but just to give you a flavor for what we look at -- you start with inflation, you go to interest rates and what that is doing to many markets, including housing, which is very important for our business. We're building the capacity as soon as the opportunity manifests itself, we're going to be able to deliver. And when I think about what are the positives, the tailwinds for us, service recovery starts right there, which leads to network fluidity and capacity improvement, there's some chance that there might be a soft landing. The customer that we talk to our customers, they're poised for growth, and they want to grow. And we're going to look at all those factors, and we'll be ready. And Chris, we don't really want to get into quarterly guidance because there are a lot of variables. Right now here in the first quarter, we're going to have probably a pretty good compare given where volumes were last year. So I think that's -- that will be -- that will probably represent one of our better year-over-year quarters, but we're really looking at a very uncertain outlook here in the second and third quarter. So one, the flat operating income translates to EPS growth this year. I also think you said in the past, there's like $40 million a quarter of inefficiencies that you endured last year. I think if you go back to our financial framework, we would expect that if we have kind of flattish earnings that EPS growth should exceed that and be positive, for sure. The $40 million ex -- sorry, the $40 million of service-related costs will start to unwind here. I mean, right now, we've got much improved service, although we are spending money to compensate for the fact that many of our locations are still below minimum staffing levels. But as the head count starts to increase in many of those core locations, I do expect toward the back half, especially that these costs will start to unwind from the $40 million per quarter significantly lower, like I said, more into the back half. And then we've got inflation in a lot of the other P&L line items, but we're working to mitigate a lot of those costs through more stringent control. I think equipment rents, as an example, that's one area where higher network speed, that should help us try to keep a lid on the growth on equipment rents. Allison, we had talked about in the fourth quarter a number that was about 1/4 of our crew base is below minimum staffing levels. And frankly, as we move forward, it's going to be highly dependent upon where we see markets headed in overall demand. Pardon me, our conductor training pipeline remains very robust. And certainly, you've seen the improvements in our service product as we've addressed both resources leadership and plan, and our service is now the best it's been in over 2 years. Paul, why don't you talk a little bit more specificity on what we're doing with respect to our craft colleagues. As you stated, we remain on pace to continue and hit our hiring targets. And as Ed alluded to, we're going to continue to match that towards the forecast as we go. As we've come out of the contract negotiations, now it's a matter of focusing on what the future looks like as far as conductive redeployment, predictive work schedules as well as quality of life and those discussions are taking place as we speak. Thanks for the question. When we look globally, we see that the congestion at the ports that both coasts has really alleviated itself. But you look at good spending in the U.S., which has plateaued for the consumer, but it's plateaued at a level that essentially is where we should be in like 2025 or 2026. So there's still a tremendous number of goods being brought into the country, trying to fit through a pipeline that was designed for arguably 2023. And so that congestion still exists in some places, really around the warehousing on the Hinterland and Inland locations. Yes, Justin, probably more like the back half, and it won't be necessarily precipitous the way we're assuming. I mean we'll lose asset  revenue will gain in freight revenue because our customer supply chains will be more fluid, and we'll be able to move more business. So it sounds like flattish revenue, not growing operating income, but not really declining a lot. So sort of flattish revenue, flattish operating income, flattish OR, plus or minus a little bit, but no big growth or declines. Thanks for the question. I think Mark talked a little bit about some of the cross currents that we have, both on the top line and on the expense category. Scott, as of this morning, we're north of 7,500 T&E. And our target right now for May is to be in the 76-plus -- 7,600-plus range. And as stated earlier, we'll continue to adjust that target as we see the markets play out. So I guess, Alan or Mark, I mean, we just had your Investor Day a month ago where you guys talked about resiliency, and I don't think anyone's faulting you here for a week macro. But is this the environment where you want to build in the resiliency into the network, maybe kind of piggybacking off that view on headcount. We need to because in some locations, as we talked about, were short of cruise. Resiliency is also about investing consistently in our assets, which includes our technology, it includes locomotives, track, intermodal terminals. And we're looking a couple of years out, how do we position ourselves so that our customers can compete and grow and we can compete and grow with them. And second question is, there has been some chatter on regulatory scrutiny on train length obviously, is a big part of top SPG and also for some of your peers. For volume, we are going to -- we are producing a service that's allowing us to take back share that should be on Norfolk Southern. And over the past couple of years, our customers have to make difficult decisions. And we're confident sure there's going to be lots of macro headwinds, but we're seeing it now, we can earn back some of that freight even in a down environment. Ravi, let me talk about the regulatory environment, if you will, for just a second. And now, they're seeing us start to grow a little bit. And so we're aligned with them, and we're delivering on our promises for service and our promises to help our customers compete and grow. And I know at least 2 of your competitors have started acquiring trucking companies, OR CN but H&R and TransX, and then Coaster Home, your TSX by quality. Walter, let me address the second question first, then I'll turn it over to Ed on how we compete with truck. Look, we got a franchise built for growth. And there are a lot of unique strengths about Norfolk Southern's franchise, the markets we serve and the customers with whom we are aligned. Well, first of all, we have a fantastic partnership with our key customers. And I think when you look out past '23, it's clear that rail intermodal, specifically on Norfolk Southern is going to be a very compelling place to be for customers. We talk all the time internally about the -- all the innovation that's going into reducing the carbon footprint for transportation But if you want to reduce your carbon footprint by about 70% to 90%, just put it on a train on Norfolk Southern. And even in the short term, we think we are very well positioned to compete with our customers. It sounds like you think the core can still offset a lot of that, which has been really Norfolk's bread and butter for the last several years. But in this loosening truckload market, weaker economic backdrop, are you finding that there's any areas where your pricing power it's coming under pressure a little bit due to customers' unwillingness especially in the loosening truckload market as we think to intermodal. Right now, we're producing a service that is very valuable to our customers we're supplying capacity that allows them to move that freight from the highway back to the railroad. And you know what, we're going to continue to develop and enhance that value just like just like Alan talked about. We're really looking at the 3-, 5-, 7-year horizon on how we can deliver value for our customers, that's how we're going to continue to produce the results that we have so far, and we're confident in that. I think when I look across the markets that we serve, I think we've got potential to continue to produce -- leaving coal out of this for the time being because of the year-over-year headwind -- we've got a great track record. Obviously, this quarter, you got the accrual, the incentive comp tailwind. And then for Paul, I know we're talking a lot about grounded conductors in the headlines, and this is a big thing that's starting in the industry. Brian, we ended pretty much where we had signaled we'd be on a per employee basis, excluding the adjustment there that deflated it a little bit. I would expect in '23, you'll see that number step up in Q1, like we talked about due to the payroll tax resets, and it will probably be in that 35 and change range. So I would expect kind of flat in that 35,000 and change territory throughout the year. From the fact of the time line we're in negotiations, but there's certainly a regulatory piece of this. But as we have the discussions and we think about the long-term future of where we want to be, there are benefits from a predictive work standpoint. And certainly, back to what Ed was talking about. We've invested in new cars for that fleet, and our fluidity has improved significantly. Going forward, I think it takes a while to work that off. We've seen a tremendous amount of investment in new capability for whether it's EVs, construction, whether it's battery construction, whether it's battery recycling, there's a tremendous amount of interest out there and some investment going forward that we are working to make sure that we can support. Now that we're done with national negotiations, we can turn to local negotiations in which we are collaborating with our craft colleagues to modernize our labor agreements to improve their quality of life, enhance operational flexibility and provide more predictable work schedules. And we're seeing that as we get out into the field and talk to our employees about the future of Norfolk Southern, a balanced approach on service, productivity and growth. In respect to what would happen were we to enter into a downturn, that is factored into our thinking. Yes, Alan, I mean, you touched very well on the very first level the lever would certainly be investing in our workforce, cross qualification, extended training board consolidations, et cetera, where we have opportunities there. And we've seen what has taken place in the industry with furloughs, we just have not seen for those come back. It's very expensive in the long term, and we do not see that as certainly one, if any lever that we want to pull. We want to ensure, again, if there is a volume downturn, we are in a position as that volume comes back to handle it and handle it well. If you look at the senior management incentives, they've recently been very much in the short term tied to OR and operating income with the long term tied to returns on capital with the TSR multiplier. At the Investor Day a few weeks ago, Andy Adam said that she was working with the Board to really redo the incentives both for senior management and for some other employees subject to the incentive program to really align with this new strategy that you guys laid out for us a few weeks back. We are, as Andy noted, we're in discussions with our Board to make sure that our compensation plan is aligned with our strategic goals. And as we noted at Investor Day, our strategic goal is to deliver top-tier revenue and earnings growth through industry competitive margins and a balanced capital deployment. There were a lot of odd issues that occurred this year, and I think you hit some of them in terms of accessorials and in terms of liquidated damages. I'm kind of curious, with the big shift that we saw with West Coast to East Coast shipments from customers and now we're dealing with this inventory overhang. And that evolution has occurred because of economics over time as manufacturing has shifted south and west from Japan to Korea to China and now towards Vietnam and Myanmar, et cetera. We want to be able to handle those shipments effectively, whether they come in through the West Coast,  quite a few to will or whether it comes through the East Coast. At the same time, we've invested a lot of money to make sure that we're a compelling partner for our ports and for our steamship lines as they come through the East Coast. We've invested a lot of money in some of our largest lanes are those shorter lengths of all that emanate from whether it's Savanna, Charles or Norfolk or from New York, et cetera, that allow us to add value to those shipments. And it really comes down to having the right product, not necessarily the right number of any given product, but the right type. And as we move into '23, again, guarded in terms of economic outlook, but poised for opportunity as soon as they manifest themselves. So one sort of detailed question and then I had a question for you, Ed, on sort of rail share. And then as you think about the last couple of quarters, have noticed the carload traffic, particularly chemicals in ag, you guys have been outperforming CSX. I mean we're talking on a GAAP basis and -- go ahead, Ed. Railroads are, in some ways, defined by geography, but we are defined by our customer base, and that's what we're focused on. Ladies and gentlemen, our last question today comes from the line of Ken Hoexter with Bank of America. And then I guess, the total employees, you ended with about 19,250, up about 1,200 from a year ago. Ken, for now, based on the economic outlook of 7,600 target that we had still exists. We're going to continue to hire in locations where we're tight And going forward, as you look here into 2024, obviously, there's a lot of uncertainty out there. I will tell you that right now, the conductor training pipeline is elevated, but it will remain so until we get to target and feel like we're recruiting, hiring and training at a steady state. And certainly, volume growth profile will mean that, that number is constantly moving. And Specific to your question on where the service costs reside, Ken, I'd say roughly half of those sit in comp and ben between overtime, recrews, incentive expenses, as well as recruiting and training. That's really where, I'd say, half of it said. So it's battered throughout the rest of the P&L, but half of it sits in component. Well, what we indicated was it's roughly $40 million a quarter that we're dealing with. And I would expect that, that number to come back down closer to, but not all the way to 0, by the time you get to the end of the year. Paul, you noted 202 locomotive miles per day. So we described at Investor Day the flywheel effect that is going to take place, fully expect as we continue to resource up to the group piece that we spoke to and the service gains that we have made that we're going to continue to see that improve throughout the year."
}