{
    "symbol": "NEXA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 15:08:04",
    "content": " However, compared to the first quarter of this year, zinc production of 79,000 tons increased by 19%, mainly driven by higher treated ore volume and higher zinc grade. Following higher treated ore volume copper, lead and silver production in the second quarter increased by 39%, 14% and 16% from the first quarter of this year. In Slide 5, run of mine mining cost in the second quarter was $43 per ton compared to $38 per ton in the second quarter of last year, reflecting inflationary pressures on costs and lower ore throughput. Compared to the first quarter of this year, run of mine mining cash costs decreased by 5% with improved volumes due to the Vazante resumption, returned to operational stability at Cerro Lindo and our cost control initiatives. Mining cash cost in the quarter decreased by 14% compared to the prior quarter, which was mainly explained by higher zinc volume and by-products credits and lower operating costs, which were partially offset by higher TCs and the Brazilian real appreciation against the U.S. dollar. In Slide 6, in the second quarter, metal sales totaled 152,000 tons, down 3% year-over-year, but up 13% quarter-over-quarter following higher production in Peru and in Brazil. Our smelting cash cost in the second quarter increased by 35% compared to the same period of last year, mainly driven by higher zinc prices. Compared to the first quarter of this year, a smelting cash cost increased by 8%, and this factor was due to higher operating and maintenance costs, lower by product prices following the market trend and the Brazilian real appreciation. Full year mining cash costs have increased to $0.28 per pound, given year-to-date performance and forecasts for lower by-product metal prices. Full year smelting cash costs have been revised to $1.37 per pound from $1.15 per pound, primarily driven by higher zinc prices, higher energy costs as well as higher fuel and consumable prices. In the second quarter, we invested $27 million in Aripuana, totaling $54 million in the first half of this year, which include a negative effect of the Brazilian real appreciation against the U.S. dollar of $5 million. Beginning with the chart on your upper left, total consolidated net revenues for the second quarter increased by 21% year-over-year, and this was mainly driven by higher LME prices. In the mining segment, net revenue totaled $370 million in the second quarter, a 19% increase versus the second quarter of last year. In the smelting segment, net revenue in the second quarter totaled $683 million, an increase of 31% versus the second quarter of last year, also supported by higher LME prices, which offset the decrease in volumes. In the same period, adjusted EBITDA totaled $140 million, an increase of 52% that was explained by the positive net price effect of $58 million and higher by-products contribution, which offset the increase in operating costs, lower volumes and the Brazilian real appreciation. In the first half of this year, net revenue for the smelting segment totaled $1.2 billion compared to the $989 million in the first half of last year, while adjusted EBITDA totaled $223 million compared to $176 million. This free cash flow was also affected by $27 million invested in Aripuana, the investment in Tinka of $7 million included in loan and investments, dividend payments to noncontrolling shareholders of $9 million related to Pollarix, our company, which manages our energy assets, foreign exchange effects on cash and cash equivalents of $16 million, an increase in working capital of $23 million. Our free cash flow for the period was negative $139 million, also explained by, $54 million invested in Aripuana, $60 million explained by the early redemption of our 2023 notes in the first quarter of this year, dividends of $59 million, which included Pollarix and working capital changes of $179 million. And we said that we had almost $43 this year in the second quarter, that's what was $45 in the first quarter and last year it was $38 or $39."
}