{
    "symbol": "SLGC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 21:08:07",
    "content": " I'd like to turn now to our second quarter revenue of $14.1 million, and provide additional color on the factors that have impacted revenue, for the most recent quarter and thus far in 2022. Second, as we've discussed previously while we are in the process of evolving our technology to a more distributed model, over 75% of our business currently relies on contracted in-house service revenues, derived from sample delivery from customers. As you can see on slide 15 in our online investor deck, we have doubled new customers over the past year and added 20 new customers in this most recent second quarter alone, which actually represents our largest quarter-to-quarter increase of customers over the past 12 months. As the larger revenue opportunity for our life sciences business requires, we encourage large existing customers who come onto the platform to do increasing amounts of business with us, often moving from pilots or small studies to much larger ones, our significant and ongoing new customer growth should pay real dividends over the next year and beyond. In consideration of our current service business orientation and its impact on month-to-month and quarter-to-quarter variability, we are successfully putting the foundational elements in place to substantially grow our distributed business over time with a three-part plan; increase the deployment of our existing array-based SomaScan kits, launch NGS-based distributed solutions with Illumina, and create and launch chip based products with recently acquired Palamedrix. Your line is open. And as we mentioned there were several million dollars in business that was in contracting in the second quarter that got pushed into next quarter, because of this apparent slowing of contracting with our customers. Your line is open. One is that, I would say due to a combination of factors both the macroeconomic and frankly the small size of our team and our focus thus far on new customer acquisition, rather than same-store sales that that combination has had an impact on active customers spending more on our platform. Your line is open. Your line is open."
}