{
    "symbol": "SLGC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 21:45:04",
    "content": " Over the course of the year ahead, we intend to continue sharing our progress regarding our revenue growth and supporting initiatives including expansion, and diversification of our customer base, ongoing additions to our commercial team, completion of the development of the reagents needed for our 10,000 Plex product, development of new SomaSignal tests, and clinical diagnostics, licensing or co-development deals In SomaLogic, our decades of experience and track record of continual innovation places on the leading edge of the rapidly evolving proteomics industry. I would add Brandon that this is the first in a planned number of many data products that we have in development to place alongside SomaScan to give -- again to give our customers and collaborators more information about their sample, both in terms of sample quality, but also as I mentioned earlier, things like, what biologic pathways are activated, what drug targets may be present and so forth. I think what I -- the only thing I would add is to this is it's a little bit more expounding non-expectations going forward, is that -- I might even want to just like, put the takeaway here, that going back to the end of 2020, we had well like around 10, right, Roy, people in the commercial team. So, I think that bodes well, right, for future quarters in a way that again, I'm not suggesting there's upside to our guide -- our guide is our guide, but these are things that could be potential growth accelerants that we aren't considering, because I think the as you do see a lot of our sales team members, which were added in the latter half of 2021, really start hitting the stride of efficiency, you're going to see that effects, I think, most impactfully in Q3 and Q4. So from the population health management standpoint, if you're a Medicare Advantage plan it would be great to know in your population, who you need to bring in this year to have a more involved look at their cardiovascular risk, because we've identified a risk that again, might not otherwise be identified until an event happens and we are at some of those conversations, I mentioned earlier with potential customers, not only in licensing and co-development but also in actual use of this test and LTD CLIA fashion."
}