{
    "symbol": "AZTA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-09 18:01:09",
    "content": " Revenue for the quarter was $146 million, up 12% year-over-year and up 20% when normalized for the estimated COVID-19 impact in both periods. Our services business reported revenue of $92 million up 19% year-over-year, driven by double-digit growth in both genomics and Sample Repository Services. The products business delivered revenue of $54 million for the quarter, representing 2% growth year-over-year on a difficult COVID compare. Q2 was another strong quarter, delivering revenue of $146 million, up 12% year-over-year and up 20% when you exclude the estimated impact of COVID in both periods. Non-GAAP earnings per share for the quarter from continuing operations was $0.12, flat sequentially, supported by revenue growth but with a bit more expense this quarter as we invested in the business and had higher stock compensation expenses with our recent changes in executive leadership and our annual Board grant. Within the expense lines, we experienced higher stock compensation quarter-to-quarter of $2 million and the remaining increase was primarily due to business investment in the areas of direct sales, R&D and G&A to support growth. The products business generated $54 million of revenue, up 7% from the first quarter and up 2% year-over-year. The Life Science products Q2 gross margin was 49.5%, a 310 basis point improvement year-over-year and a 360 basis point improvement sequentially reflecting favorable product mix in our consumables and instruments business as well as stronger margins in large automated stores. The services business delivered revenue of $92 million, up 19% year-over-year. The genomic services business generated revenue of $65 million, up 18% year-over-year with next-generation sequencing delivering over 25% growth on a reported basis. Sample Repository Solutions reported revenue of $27 million, another robust quarter of over 20% growth year-over-year and up 4% sequentially driven by growth in our core storage offering. We expect product revenue to be in the range of $48 million to $54 million, supporting a growth rate of approximately 5% at the midpoint year-over-year and services being in the range of $91 million to $97 million supporting a growth rate of approximately 17% year-over-year, again at the midpoint. So at the midpoint, $145 million of revenues, that's about 12% -- represents a 12% growth year-on-year. And that was approximately $9 million in products and about $3 million benefit -- both benefits to revenue a year ago because we had really strong genomics performance without COVID impacts either way, but we had a ramp in the SRS contracts from vaccine management."
}