{
    "symbol": "AZTA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-09 22:33:05",
    "content": " In addition, although we had anticipated in forecasted a meaningful decrease in our consumables and instruments revenue for Q3, we were taken by surprise at the magnitude of the sequential drop, which turned out to be approximately $3 million more than the original $6 million decrease we had contemplated in our guidance and although we believe the genomics performance is recovering in Q4, based on the order patterns to date at present, we forecast yet another drop in consumables and instruments in the fourth quarter. As we have discussed previously, the C&I business has experienced the largest benefit from COVID-related demand and in the quarter, this benefit fell to $3 million primarily from China customers. Our services business reported revenue of $85 million up 6% year-over-year, driven by growth and sample repository services and more muted growth in genomics. The third quarter's COVID impact positive and negative is comprised of delivering a total of $4 million of COVID revenue in the quarter; $3 million of this COVID demand was in the consumables and instruments business, and approximately $1 million of services in our Sample Repository Solutions business for managing vaccines. Next, please turn to Page 6 for a review of our Life Sciences services segment results, the services business delivered revenue of $85 million up 6% year-over-year, excluding $2 million in foreign exchange headwinds, services was up 8% year-over-year. As you can see in the graphic on Slide 6, this business contribute $5 million of top line growth year-over-year at constant currency, significantly driven by the global enterprise partnerships we have one in the biological sample storage space. All in, we estimate revenue to be $84 million to 90 $million providing approximately flat to 8% year-over-year growth and is inclusive of a three point headwind from foreign exchange. We expect products revenue to be in the range of $47 million to $51 million, supporting a decline of approximately 8% at the midpoint and services being in the range of $84 million to $90 million, supporting a growth rate of approximately 4% at the midpoint. The $2 million this quarter reflects the lower level of ni-based COVID revenue, continued vaccine management and sample repository solutions and some relief in the China headwinds in genomics. On its own B Medical is a great business with a strong growth profile in a vibrant market but just as we did, when we acquired Bio Storage Technologies to launch ourselves into the outsource sample bio repository business and when we acquired gene with in the genomic space for the interrogation of samples in B Medical, we see the same type of potential to drive tremendous incremental value from investments that we'll make to leverage the combined B Medical and Azenta capabilities into new market opportunities with new high value products and services."
}