{
    "symbol": "COOP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 14:37:06",
    "content": " I'm going to start with the highlights as we always do, but then we'll pull up and talk about the recent interest rate shock and more broadly, the macro backdrop where a number of indicators are now signaling higher risk. In summary, we had a very solid quarter with positive earnings and cash flow and strong capital generation, while continuing to grow our customer base. Net income was $113 million, which was a function of both operating earnings and a positive MSR mark. As a result, tangible book value per share rose to $56.35, which is up 36% year-over-year and our capital ratio increased to a new record high of 31.3%. Servicing income more than doubled to $81 million in the quarter, up from $30 million in the second quarter. And most of this increase is the predictable impact of higher rates on amortization and interest income, which we guided you to expect. Looking ahead, we project servicing income reaching $125 million or more in the fourth quarter with strong results continuing into 2023, especially if the Fed continues on its current path. Turning to the portfolio, the UPB reached $854 billion or 4.1 million customers, which is 28% year-over-year growth. In sub-servicing, we believe we are the market leader with a platform that's scalable, efficient, compliant with unparalleled recapture capabilities. Historically, we grew this business with a small number of very large clients, but today we are actively calling on a much broader segment of the marketplace. We generated $45 million in EBT, which was in line with our guidance and reflects fantastic execution on the part of our originations team. However, with the recent move-in rates, there's going to be significant pressure here, more on that in a second. Finally, in terms of capital management during the quarter, we repurchased 1.1 million shares for $50 million, which I would describe as a measured pace and appropriate for the current macro backdrop. Okay, now let's pull up and talk more strategically about how we're positioning the company for an environment of heightened risk. Of concern right now, we see very elevated levels of volatility in both equity and fixed income markets, which tells us to prepare for a wide range of potential scenarios. We're obviously watching the deterioration in the leading economic indicators which point to a growing risk of recession as well as a housing correction, which is already begun and the go little  backdrop looks quite fragile. But net-net, it's our mission to serve customers in both good times and difficult times, which means we need to be prepared for adverse scenarios. So let's talk about how Mr. Cooper is positioned for heightened risk, including where we're pivoting and where we're staying the course. To put this in some perspective, year-to-date, mortgage rates have more than doubled, which we believe is the most extreme shock the industry is experienced in its history. As a result, the rate and term refinance opportunity is basically nonexistent and now we are seeing the cash out market coming under pressure too. As always, we're reacting quickly and decisively to market changes while ensuring we continue to make smart investments in the business. On this point, longer term we believe our origination business has enormous potential, especially our DTC platform where we have initiatives underway to expand in the new products and channels and where we're continuing to invest in automation. We have terrific momentum, we've got the best technology in the industry and we're making great strides with our process discipline, the result of which is the operating leverage you can see in our results. Also, as you know, last quarter we acquired Right Path, which is a special servicer with a sophisticated data driven approach. In summary, I'd emphasize that we have the scale, technology, people and experience to play a leadership role if the mortgage market comes under stress and I'd remind you that is exactly what we did during the last downturn. Now turning to zone, we feel that the platform is in great shape from an operating and competitive standpoint and of course, a recession if one happens is only going to create more demand for the exchange. There's no change to our strategy, but we will need to be patient a little bit longer to see EBT ramp, which is the key to monetization. Finally, let's focus on the balance sheet, which I know everyone on this call would agree is the most important aspect of any company strategy when facing a risky macro situation. And in this environment, you should expect us to continue operating with a significant amount of excess capital and liquidity. Part of the reason for this posture is that we do expect to see more pain in the mortgage industry, as the current players grapple with challenges that many of them have never faced. For now, when it comes to capital deployment, you should expect us to remain very thoughtful and disciplined and also very patient. We have the best technology and significant scale, a conservative high quality portfolio, robust capital and liquidity, and a team that pivots quickly when conditions warrant. We don't know how the macro scenario will develop from here, but we're positioning ourselves to navigate the risk and emerge on the other side of this cycle in an even stronger position. And I'll start with servicing income, which is ramping very nicely just as we guided you to expect. During the quarter, servicing generated $81 million in pretax income, more than doubling the second quarter level of $30 million. Looking forward, we expect to generate at least $125 million in the fourth quarter as a function of a better mix, lower amortization and higher interest income. Meanwhile, since our last fall, consensus is now projecting the Fed funds rate reaching nearly 5% in 2023, which is almost 150 basis points higher than where expectations were last quarter. Now let's spend a minute on operating expenses, which you can see are benefiting from scale as well as process enhancements. On a year-over-year basis, expenses are up 9% while UPB has grown by 28%, which I hope you agree is a very compelling demonstration of positive operating leverage. Our strategy is to drive down unit costs to levels that no one else in the industry can match, and then to keep driving them down further by continuously optimizing our processes. Second, we're currently operating with excess capacity for non-performing loans, which by the way, we don't think is the case for many of our peers. And since we've used technology to automate many of the tasks involved with managing non-performing loans, our average cost will decline as we leverage fixed costs with higher volumes. But bear in mind, if recession strikes in mid-2023 as most of us think is possible, we probably wouldn't see any impact on our costs until 2024. The portfolio is up 6% sequentially and 28% year-over-year, largely from strong growth in sub-servicing where we won business from new accounts and expanded wallet share with existing clients. Now as you've probably heard, we do have a client which has decided to take their portfolio in-house following acquisition of a servicing platform. We planted the Board $20 billion in the fourth quarter and another $50 billion to $60 billion in 2023, which could potentially flatten out our UPB growth for a couple of quarters depending on what goes on with other opportunities. However, in our view, the prevailing trend in the servicing sector is going to be consolidation and we expect over the next couple of years to see many more firms exiting and very few entering the business. In fact, as we speak, weâ\u0080\u0099re due diligence seeing a $20 billion pull with attractive collateral and pricing. Given the macro backdrop, we believe there is unfortunately more pain in store for the industry, which is going to put pressure on MSR sellers. And while I canâ\u0080\u0099t speak for other buyers, weâ\u0080\u0099ve been focusing on pools that were comfortable we can manage through the credit cycle and weâ\u0080\u0099re looking for yields that compensate us for the risk of deploying capital in an uncertain environment. Looking ahead, we continue to think 50-50 is a good long-term target, although we may deviate to some degree as youâ\u0080\u0099re seeing right now based on where we see the best risk adjusted returns. Some of our peers have been quite aggressive about moving into Ginnie loans and other potentially higher risk segments of the market, but weâ\u0080\u0099ve grown our portfolio in a defensive matter and consistently maintained our overall diversification. Accordingly, during a credit cycle, weâ\u0080\u0099d expect that our sub-servicing margins would be stable or potentially expand. On an overall basis, the weighted average FICO score of our portfolio has increased from 720 a year ago to 727 today, and the weighted average LTV has decreased from 60% to 53%. With respect to Ginnie Mae loans, whereas other servicers have focused primarily on this segment during the past couple of years, we took a more balanced approach and grew our agency servicing far faster than our Ginnie book. Furthermore, the majority of our growth in the Ginnie portfolio came as a result of purchasing a seasoned very high quality book of VA loans from a client whose portfolio we sub-serviced for many years. And as you can see, the majority of our customers have substantial equity built up and also enjoy very low note rates, which bodes very well for credit performance. In fact, while we still have over 40,000 customers in active COVID forbearance plans who are behind on their mortgage payments, even when including that volume, our delinquency levels are very low. As you would expect, we pay special attention to FHA delinquency rates as these customers tend to have higher debt to equity ratios, lower reserves and lower FICO scores than agency bars. Thereâ\u0080\u0099s a slight increase in delinquency rates, which rose from 2.8% in the second quarter to 3% in the third, which we would attribute to seizing of older vintages. However, as you know, rates were moving up towards the end of the quarter, so youâ\u0080\u0099re not seeing the full impact in these results. For some perspective where rates now stand, weâ\u0080\u0099re facing the single most severe affordability shock in the history of the mortgage industry, which has eliminated rate and term refi and is now putting a great deal of pressure on cash outs as well. So as Jay mentioned, weâ\u0080\u0099re now moving forward with the plans to realign capacity to a smaller market. Weâ\u0080\u0099ll continue to serve our customers for whom the financial benefits of refinancing make sense, but now that is a much smaller number than it was just three months ago, let alone a year ago. For now, I guide you to expect fourth quarter EBT for our origination segment to be roughly breakeven. Now, if youâ\u0080\u0099ll turn to Slide 10, Iâ\u0080\u0099d like to share our latest thoughts on Xome where the platform is in excellent shape, but the market continues to go through transition. Our market share was up to 32% in the quarter and based on discussions with clients, we continue to expect to hit 40% by year end. Thatâ\u0080\u0099s the point when weâ\u0080\u0099d expect to see investors stepping up to pay a fair price for the platform and to the extent that recession impacts employment on top of the housing correction already underway, then thereâ\u0080\u0099s potentially significant upside at Xome. Net income was $113 million, which comprised of $56 million in pretax operating earnings, a positive MSR mark of $122 million and adjustments totalling $23 million. Between net income and the reduction in our share count, we saw strong growth in our tangible book value per share, which increased by 36% last year reaching $56.35 per share. During the quarter, the MSR value increased by 5% or 7 basis points to 162 basis points, reflecting the recent rise in mortgage rates and the corresponding decrease in the lifetime CPR assumption of 7.7% to 7.4%. And additionally, swap rates increased by 127 basis points with a corresponding higher expectation for service interest income. During the quarter, we expanded our capacity by another $400 million and we also extended maturities. During the quarter, we drew down an additional $90 million from our MSR lines, which brings our outstanding balance to just over $1 billion. But relative to the total debt outstanding, we remain at an extremely conservative level of 27%, which we think is very appropriate given our considerable excess capital. And weâ\u0080\u0099ll continue to use MSR lines for working capital needs and opportunistic MSR acquisition, but we will be very judicious in doing so as these clients do not represent a permanent form of financing. Now obviously this could change if the credit cycle turns, but with over $1 billion in capacity, we believe weâ\u0080\u0099re in excellent shape. Now excluding deferred tax assets and EBOs, our capital ratio rose to 31.4% from 29.7% last quarter, reflecting both strong capital generation in the quarter and the utilization of the DTI. In this environment, you should expect us to remain extremely disciplined and patient when it comes to capital deployment and as you would expect us to continue operating with a sizeable buffer in excess capital and liquidity. This posture will allow us to sustain a measured pace of growth, navigate the macro environment and continue to deliver on our mission to serve our customers. Our capital liquidity will also allow us to take advantage of special growth opportunities, which sometimes surface during stress periods. Your line is open. Kevin, Iâ\u0080\u0099d say we will â\u0080\u0093 that number does not include a charge that we will undoubtedly take in the quarter and weâ\u0080\u0099ll announce that and disclose that. The reason weâ\u0080\u0099re not giving you more guidance at this point is changes in rates and volatility have been so heightened that we want to make sure when we give you guidance, itâ\u0080\u0099s stuff we know we can deliver. So fourth quarter, weâ\u0080\u0099re going to have to make a lot of changes and there will be a charge that will be taking, itâ\u0080\u0099s not a dramatic number, but a material number. You cite the Ba3 corporate rating threshold in your slides, but generally bought back 1.1 million shares of stock despite trading at roughly 80% of book value today. I think, well, first of all, weâ\u0080\u0099re well aware of the amount of equity we have on the balance sheet and the amount of flexibility we have. Now, at the same time, we have been consistently buying back shares roughly a $50 million a quarter pace. In fact, our Board yesterday gave us a new authorization of an additional $200 million to â\u0080\u0093 thatâ\u0080\u0099s on top of the â\u0080\u0093 I think we have $60 million of remaining authorization, so you should expect us to continue to act prudently with capital. I think Kevin, if you look at the bulk market itâ\u0080\u0099s just gotten better and better, and we see fantastic opportunities there, and we think itâ\u0080\u0099s going to continue. So I think we want to be disciplined, and to your point, weâ\u0080\u0099re obviously in a very volatile environment, so we want to be prudent as well. Well, I think weâ\u0080\u0099ve talked about this a little bit and we made some comments on this call that, recently weâ\u0080\u0099re seeing â\u0080\u0093 depending on the quality of collateral type, et cetera, weâ\u0080\u0099re adding small pools and more diligence in large pools with say, returns between 13% and 18% on an unlevered basis. And with some even larger pools coming to market, we would expect those returns could even be wider. One moment for our next question. Your line is open. Actually first I just wanted to ask the 221 basis points valuation of your capitalized servicing, thatâ\u0080\u0099s on Slide 20 â\u0080\u0093 on Slide 25. Just given the volatility to market, given what weâ\u0080\u0099re seeing from the agencies, we are keeping almost all the excess. And on volumes, weâ\u0080\u0099re soliciting less of our customers to â\u0080\u0093 weâ\u0080\u0099ve shifted mainly to cash out financing. But the offset that, as you know, servicing profitability is going to continue to improve, as we talked about, and frankly benefit from that in a considerable way. Just given your commentary, what are your thoughts on, I think you discussed earlier that the EBIT run rate there could be $120 million going into 2023. So weâ\u0080\u0099ll have to give you better guidance for 2023, but that number will certainly come down because weâ\u0080\u0099ve probably moved back at least two quarters in terms of sales recovering. I mean, having said that, Bose, once you get back to historical levels we did â\u0080\u0093 we still think thatâ\u0080\u0099s going to be achievable. Thatâ\u0080\u0099s just going to â\u0080\u0093 I mean, the $120 million is going to be achievable, but itâ\u0080\u0099s too early to put a time period on that. One moment for our next question. Your line is open. In terms of rationalized expenses, I think itâ\u0080\u0099s hard to talk about the industry. We can just talk about what weâ\u0080\u0099re doing, and that is to move quickly and decisively to resize the business so that weâ\u0080\u0099re in a position to optimize profitability in 2023. And then turning to the MSR market, it sounds like youâ\u0080\u0099re optimistic on the supply that youâ\u0080\u0099re going to see there. Well, we did that in a big way in the second quarter, I think where we bought a $50 billion portfolio that we had sub-servicer for six years. Yes, Iâ\u0080\u0099d say there are more opportunities with other servicers either scaling down their operations or even exiting and thatâ\u0080\u0099s where weâ\u0080\u0099re focusing a lot of our attention. One moment for our next question. Your line is open. And what we hadnâ\u0080\u0099t anticipated, because we didnâ\u0080\u0099t expect rates to move this quickly, is that there â\u0080\u0093 as I just said, other servicers are either exiting the market or theyâ\u0080\u0099re being forced to sell MSR. If we had opportunities to buy things at the right price, we would use our leverage judiciously with the only â\u0080\u0093 not only with a plan to be able to pay it back to conservative levels over a short period of time. Our MSR lines are although they are â\u0080\u0093 weâ\u0080\u0099ve recently gone through extending and expanding them for this opportunity theyâ\u0080\u0099re two year facilities, so we donâ\u0080\u0099t want to be overly dependent on MSR lines. In the last crisis, it was largely taking borrowers from a higher rate to a lower one, which obviously makes sense, but here we could be looking at folks that already have a really low rate and need a mod in a higher rate environment. I think the â\u0080\u0093 some of the government agencies are spending a lot of time right now, trying to come up with new solutions for the â\u0080\u0093 to deal with the situation you're referring to right now. People that are still exiting forbearance are facing rates that are far higher for the FHA/VA customers, for example. I would make one comment, one big change for modifications in the past, not so much the type as how we're going to handle them. So that's what we're talking about, we do expect there will be high volumes of those, but we're fortunate to have developed a state-of-the-art digital solution to do so. And I think if you look at the GSE portfolio, I think you have more flexibility there to have the borrower remain, if you will, in their current coupon versus the FHA. So I think, there will be solutions for customers across the board, but certainly in GSE land, I think there's solutions today that can keep them in their kind of existing coupon territory. One moment for our next question. Your line is open. Correspondent margins are thin right now and on a historical basis, so I would say at this moment, it's less attractive than some of the other channels. That's why some of our comments, if you want back in the call, we're continuing to invest in Project Flash, which has says dramatically improve the efficiency of our originations platform and some other some other key initiatives that we think are going to provide new channels and possibly some new products for the DTC channel. We run a balanced business and just like two years ago when servicing was barely making any money, we continue to invest in it, we're going to benefit from it now. So you're seeing exactly what we told you that servicing income was going to double quarter-over-quarter and double again, and we think it'll be even stronger in 2023. Originations is going to drop back, but these are long-term parts of the company and we are not going to do anything that would impact their ability to react quickly when rates are more favorable. One moment for our next question. Your line is open. I guess from a starting point, one thing I was curious about taking your brain about was looking at the servicing segment. You guys are calling for $125 million plus of EBT, next quarter and that's roughly about $44 million at $125 million versus the $81 million this quarter. If I look at the slide, what you guys are calling for roughly a $9 million benefit in amortization quarter-over-quarter. Obviously, short-term rates are up and interest income is going to benefit from that significantly. And they're in a number of areas, we introduce a state-of-the-art omnichannel communication system, we've seen tremendous efficiency from our new IVR chat features. So expenses are still coming out of servicing even though, volumes are up and we expect that to continue next year. So there's not one area, Giuliano, but we'll see at least $125 million in the fourth quarter and you'll see that improve as we get into 2023. And then going back to one of the comments that you're making earlier about Xome or maybe you or Jay making comments, but one of the comments says that there's been roughly few months away. I'm curious when you just kind of dialing back the clock to last quarter, like last quarter you guys were saying it was roughly called a one month kind of push-out. I'm not sure I can recall the exact comments because I think last quarter we were saying things were moving out a quarter, but I'll have to go back and look at the comments. I think right now, we expected to be at a full run rate at this point. And the good news, bad news with Xome is and go back to Jay's comment about when we get to a normalized run rate for foreclosures and there's no reason that won't occur, it's just a matter of timing. If we get to a normalized run rate and those levels rise because we go into recession, which I think is becoming a very strong consensus in the country, those levels are going to be higher and earnings are going to be higher. The thing that's right in front of us now is individual buyers seeing their financing costs up, home prices falling. These homes are going to sell and these foreclosure levels, there's no reason that foreclosure levels will not rise again from essentially zero. So overall that was still pretty low foreclosure levels, but that's what we're kind of basing our long-term thoughts on around what the EBT will be for Xome. When I look at where you're trading from a book value perspective, you're kind of like training a little bit towards like below 75% of tangible. When you think about capital allocation on a go-forward basis, you obviously have the potential monetization of Xome, which timing is obviously you can't put exact timing on that today, which could be make, push your book value significantly higher and significantly reduce that discount to kind an implied fair value in the future. When you think about the combination of that versus buying MSRs at, let's say mid-teens unlevered yield, in some ways buying your stock back at 30% discount or a 30% plus discount on an applied forward book value. So we are going to deploy our capital in the â\u0080\u0093 and only the way that we think and have lots of confidence in is going to produce the best long-term return for our shareholders, including us who are large shareholders. So we're being patient and that might not sound sexy this morning, but we are going to take advantage of the changes in the cycle in the absolute best way that builds shareholder value long-term. One moment for our next question. Your line is open. I think the first one we had and I think it's on Slide 4, the deck where you put on there that you're managing it for 2023 monetization. No, it's always been the plan that we would monetize in 2023. It may be a quarter or two later in 2023, but we are spending a lot of time with our bankers now, just beginning conversations with potential interested parties, but we don't think that will sell until some point next year. No, I think it's just that, I mean when you see interest rates, there are lot of individual buyers out there seeing their financing costs that have doubled while they were looking at homes. And at the same time, if you looked at month-over-month change in housing prices starting to come down, it's understandable, you'd see people pause a little bit, but as prices reset, as appraisals start to reflect real value, those guys are going to jump back in and buy. No, I'm not going to forecast that, but I think we're seeing a trend. So if rates go from three and a half to seven and a half, you got to assume home prices are going to come down. Home price affordability, which I think was at 102 on the index last June, I don't know where that's going to end up, but I wouldn't be surprised. So I don't know if that's long enough to say a trend, but I fully expect home prices to come down. I wouldn't put a number on it, butâ\u0080¦\n Yeah, I think our B is consistent with the overall market, which is in that 15% range."
}