{
    "symbol": "SMCI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-02 00:17:02",
    "content": " Please note that some of the information you’ll hear during our discussion today will consist of forward-looking statements, including without limitation those regarding revenue, gross margin, operating expenses, other income and expenses, taxes, capital allocation and future business outlook, including guidance for the third quarter of fiscal year 2022 and the full fiscal year 2022, and the potential impact of COVID-19 on the company’s business and results of operations. Today, I am pleased to announce our quarterly revenue of $1.17 billion for fiscal Q2 2022, which was 41% year-over-year growth, and our sequential growth was 14%. First, again, our fiscal second quarter net revenue totaled $1.17 billion, up 41% year-on-year and up 14% quarter-on-quarter, at the higher end of our guidance range of $1.1 billion to $1.2 billion. Our fiscal second quarter non-GAAP earnings per share was $0.88, compared to $0.63 in the same quarter last year, which was 40% growth and at the higher end of our guidance range of $0.70 to $0.90. We are seeing continued strength across all geographies and strong demand for our products and services, resulting in fiscal second quarter revenue of $1.17 billion, a 41% year-on-year increase and up 14% quarter-on-quarter. Super Micro’s Q2 FY 2022 recorded revenue growth across all three of our market verticals, achieving $756 million in the Organic Enterprise and Channel and AI/ML vertical, $274 million in OEM appliance and large data center vertical and $142 million in the 5G/telco and Edge/IoT vertical. Turning to operating expenses, Q2 OpEx on a GAAP basis increased 3% quarter-on-quarter and 14% year-on-year to $113 million. On a non-GAAP basis, operating expenses increased 2% quarter-on-quarter and increased 15% year-on-year to $103 million. We expect net sales in the range of $1.1 billion to $1.2 billion, GAAP diluted net income per share of $0.58 to $0.81 and non-GAAP diluted net income per share of $0.70 to $0.90 for the third quarter of fiscal year 2022 ending March 31, 2022. The company’s projections for GAAP and non-GAAP diluted net income per common share assume a GAAP tax rate of 15%, a non-GAAP tax rate of 16.5% and a fully diluted share count of 54.5 million for GAAP and 56 million shares for non-GAAP. The outlook for Q3 of fiscal year 2022 GAAP diluted net income per common share includes approximately $8.5 million in expected stock-based compensation and $1.7 million in other expenses, net of tax effects, that are excluded from our non-GAAP diluted net income per common share. We are maintaining our revenue guidance range of $4.2 billion to $4.6 billion for the fiscal year 2022 ending June 30, 2022, and our GAAP diluted net income per share outlook of at least $2.77 and non-GAAP diluted net income per share of at least $3.20. The outlook for fiscal year 2022 fully diluted GAAP earnings per share includes approximately $37 million in expected stock-based compensation and other expenses, net of tax effects that are excluded from non-GAAP diluted net income per common share. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}