{
    "symbol": "SMCI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-03 23:56:04",
    "content": " Please note that some of the information you’ll hear during our discussion today will consist of forward-looking statements, including without limitation those regarding revenue, gross margin, operating expenses, other income and expenses, taxes, capital allocation and future business outlook, including guidance for the fourth quarter of fiscal year 2022 and the full fiscal year 2022, our long-term revenue goal and the potential impact of COVID-19 on the company’s business and results of operations. Today, I am pleased to announce our quarterly revenue of $1 billion – $1.36 billion for fiscal year Q3 2022, which was 51% year-over-year growth and 16% quarter-on-quarter growth sequentially. First, again, our fiscal third quarter net revenue totaled $1.36 billion, up 51% year-on-year and up 16% quarter-on-quarter. This 210% growth was well above with the higher end of our guidance range of $0.17 to $0.19, demonstrating strong operating leverages and the customers accepting the value of our total IT solutions. Based on our current demand and capacity, we are forecasting at least $1.45 billion revenue for the coming June quarter to end the fiscal 2022 on a strong note at above $5 billion yearly revenue. In closing, our 51% year-over-year revenue growth and $1.55 quarterly EPS proved that our total IT solution strategy has been gaining customers' preference and trust in this growing pen. I'm pleased to report solid fiscal third quarter revenue of $1.36 billion, 51% year-on-year increase and 16% quarter-on-quarter increase. Revenues for the trailing four quarters of Q4 '21 through Q3 of fiscal year '22, totaled $4.63 billion. We achieved $846 million in organic enterprise channel and AI and revenues, representing 62% of Q3 revenues versus 64% last quarter. Our OEM clients and large data center segment achieved $423 million in revenues, representing 31% of Q3 revenues, versus 23% last quarter, which was up 54% year-over-year and up 54% quarter-over-quarter, with strong growth driven by our large, new and existing data center customers and OEM appliance customers. Our 5G/telco, Edge and IoT segment achieved $86 million in revenues, representing 7% of Q3 revenues versus 12% last quarter. On a non-GAAP basis, operating expenses increased 6% quarter-on-quarter and increased 15% year-on-year to $110 million. Cash flow used in operations for Q3 was $228 million compared to cash flow used in operations of $53 in Q2, as accounts receivable and inventories grew due to increasing demand from our customers and to mitigate the continued impact of supply chain disruptions, including CapEx of $11 million, Q3 negative free cash flow totaled $239 million. For the fourth quarter of fiscal 2022, ending June 30, 2022, we expect net sales in the range of $1.4 billion to $1.48 billion, GAAP diluted net income per share of $1.45 to $1.64 and non-GAAP diluted net income per share of $1.51 to $1.69. The company's projections for GAAP and non-GAAP diluted net income per common share assume a GAAP tax rate of 17.4%, a non-GAAP tax rate of 19.4%, and a fully diluted share count of $54.3 million for GAAP and 55.79% shares for non-GAAP. For the fiscal year ending June 30, 2022, we are raising our revenue guidance range from $4.2 billion, $4.6 billion to a new range of $4.96 billion to $5.04 billion and raising our GAAP diluted net income per share outlook from at least $2.77 to a range of $4.16 to $4.35, and our non-GAAP diluted net income per share from lease 320 to a range of $4.53 to $4.71."
}