{
    "symbol": "SMCI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-09 23:37:09",
    "content": " Please note that some of the information you'll hear during our discussion today will consist of forward-looking statements, including without limitation those regarding revenue, gross margin, operating expenses, other income and expenses, taxes, capital allocation and future business outlook, including guidance for the first quarter of fiscal year 2023 and the full year of 2023 and the potential impact of COVID-19 on the companyâ\u0080\u0099s business and results of operations. We ended the year with another great quarter with fiscal Q4 2022 revenues of 1.64 billion growing 53% year-over-year, and 21% quarter-on-quarter, surpassing both top and bottom-line estimates. We achieved 835 million in organic enterprise and channel and AI and revenues representing 51% of Q4 revenues versus 62% last quarter, up 24% year-over-year and flat quarter-over-quarter. Our OEM appliance and large data center segments achieved 717 million in revenues representing 44% of Q4 revenues versus 32% last year, up 95% year-over-year and up 67% quarter-over-quarter with strong growth driven by large new and existing data center customers and OEM appliance customers. On a year-on-year basis, U.S. revenues increased 65% as the gained market share with our advanced Rack-scale total IT solutions for emerging high growth server workloads. In Q4 non-GAAP gross margin was 17.6% up 200 basis points quarter-over-quarter from Q3 and up 390 basis points year-on-year due to price discipline, lower freight costs, leverage from higher factor utilization, operating efficiencies and our continually improving product customer mix. Our non-GAAP operating margin increased significantly to 10.7% for the quarter versus 7.5% last quarter and 4.4% a year ago, demonstrating both improvements in gross margin driven by new product and customer mix and operating leverage driven by higher revenue along with disciplined expense control. For the full fiscal year 2022, we reported non GAAP diluted EPS of $5.65 which was up 128% year-over-year versus fiscal 2021 non-GAAP diluted EPS of 248 and higher than our initial guidance of 471."
}