{
    "symbol": "ZM",
    "quarter": 3,
    "year": 2022,
    "date": "2021-11-22 22:57:04",
    "content": " 00:49 During this call we will make forward-looking statements, including statements regarding our financial outlook for the fourth quarter and full fiscal year twenty twenty two; Zoom’s expectations regarding financial and business trends; Zoom’s growth strategy and business aspirations to help customers embrace change, enable hybrid workforces, and grow their businesses; product features and the expected benefits of such features; and Zoom continuing to fortify its position as a leading brand in its industry. 07:25 Thanks to our customers, investors and the hard work of our approximately six thousand three hundred employees, we’ve grown over the past decade from a video conferencing solution to a communications platform that encompasses unified communications, as well as developer and event solutions. 12:40 Sales and marketing expense grew by sixty eight percent year over year to two thirty seven million dollars or approximately twenty two point six percent of total revenue, primarily driven by increased marketing programs and sales headcount to drive future growth. For the full year of FY twenty twenty two, we expect revenue to be in the range of four point zero seven nine to four point zero eight one billion dollars, which would represent approximately fifty four percent year-over-year growth, up from our previous guidance of fifty one percent issued in August. So it's exactly the strategy that we've been planning for and thinking about Meta when you think about Zoom Phone, for example, and Zoom Rooms, the strategy is to sell the existing install base, which by definition just means these customers are going to grow larger and larger and contribute more over time. 31:48 I mean, Zoom Phone continues to be a really strong growth driver in general, especially as organizations are thinking about what's going to be their future of work strategy and enabling their employees to work from anywhere over time. And overall, this is a part of our overall platform vision because some customer I think do a good job to mission that and promote data because customer -- some customer even do not know that, right, before, But however, if we look at our chat usage, sorry, we did not publish that number yet, it’s pretty healthy not only for SMB individual users, but also enterprise customer  video and phone and also Zoom Chat is one platform. But in terms of the deal, actually nobody knows that and let's see, we do not know, but also as I mentioned earlier, right and we have a full stack to support unified communication  customer deployed the Zoom Video already, they may do have deploy in Zoom phone, we also ask  strategy about the content center solution. And then we do have the ability and we have seen customers that want to start to sell and start with Zoom Phone first and that has been a great opportunity, it’s a small percentage of our customers that are starting that way but it’s a great opportunity for them if that's what they're interested in to get them in and get them used to Zoom and then expand over time in terms of understanding the full platform offering that we have. The reason why we have a confidence is not only only Zoom, but also some of our customers like my greater friend  they also hosted earnings cast on Zoom platform because of very reliable greater video, audio quality, a lot of other -- video features like early next year we are going announce  Patrick, you can show up as your digital  if you want to."
}