{
    "symbol": "SNEX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-07 17:59:04",
    "content": " On the expense side transaction based clearing expenses were up 11% to 74.7 million in the current period primarily due to the increase in securities ADV, an increase in listed derivative contract volumes as well as higher costs and our global payments business. Introducing broker commissions declined 1% to 41.2 million in the current period, as increases in our institutional listed derivative and global payment businesses were more than offset by a decline in IB commissions in our commercial listed during this interest expense related to trading activities increased 13.6 million versus the prior year primarily due to increases in short-term interest rates as well as higher average borrowings in our physical commodity business. Variable compensation increased 21.5 million versus the prior year due to the increase in net operating revenues and represented 33% of net operating revenues in the current period, compared to 30% of net operating revenues in the prior year periods. This compensation increased 3.4 million versus the prior year with the growth principally related to salary and benefit costs have increased headcount, which increased 11% as compared to the prior year period, which is partially offset by an increase in deferred compensation. OTC derivative operating revenues were 50.2 million for the quarter which was up 500,000 versus the prior year quarter as a result of an 8% increase in the average rate per contract which was partially offset by a 5% decline in OTC derivative contract volumes. Operating revenues from physical transactions increased 13.6 million compared to the prior year period, primarily as a result of a 13.1 million increase in precious metals operating revenues. Finally, in our interest earned on client balances increased 7.2 million versus the prior year as a result of a 45% increase in average client equity, as well as an increase in short-term following Fed actions. Segment income was 72.5 million for the period and increased over the prior year and preceding quarter of 20% and 3%, respectively. Moving on to Slide number 10, operating revenues and our institutional segment increased 36.1 million versus the prior year, primarily driven by an $18.6 million increase in securities operating revenues compared to the prior year period as the result of 128% increase in the average daily volume of security transactions partially offset by a 48% decline in securities rate per million. Finally, interest earned on client balances increased 6.9 million versus the prior year as a result of a 63% increase in average client equity, as well as an increase in short-term interest rates following recent Fed actions. Segment income increased 3% to 47.7 million in the current period as a result of the 15.3 million increase in net operating revenues, which were partially offset by a $10.5 million increase in variable compensation and a $3.6 million increase in non-variable direct expenses versus the prior year. Moving on to the next slide, operating revenues in our retail segment added 30.8 million versus the prior year, which is primarily driven by a $30.8 million increase in FX and CFD revenues as a result of a 12% and 47% increase in ADV and RPM as compared to the prior year as a result of heightened volatility FX markets. The increase was partially offset by $9.5 million increase in non-variable direct expenses compared to the prior year, primarily driven by a $5 million increase in selling and marketing a 1.3 million increase in depreciation and amortization, a $700,000 increase in professional fees and a $600,000 increase in travel and business development. Closing up the segment discussion on the next slide operating rental payments added 9.3 million versus the prior year, driven by a 20% increase in average daily volume and 9% increase in the rate per million as compared to the prior year."
}