{
    "symbol": "SNEX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-08 15:29:03",
    "content": " Transaction based clearing expenses were up 8% to $70.9 million in the current period, primarily due to higher clearing and ADR conversion fees within the equity capital markets resulting from the increase in average daily volumes in that business. Interest expense increased $5.8 million versus the prior year, primarily due to an increase in activity in our institutional fixed income dealer, higher average borrowings on short term financing facilities of our subsidiaries, and an increase in securities lending activities. Net income for the first quarter of fiscal 2022 was $41.7 million and represented 114% increase over the prior year, and a 471% increase over the immediately preceding quarter. Within the segment listed derivative operating revenues increased $6 million versus the prior year as a result of a 17% increase in average rate per contract as a result of improved performance and LME metals. OTC derivative operating revenues were $46.7 million for the quarter, which was up $22.6 million versus the prior year primarily as a result of a 54% increase in OTC derivative volumes, and a 27% increase in the average rate per contract driven by strong performance in energy and renewable fuel markets. Finally, interest earned on client balances increased $2.9 million versus the prior year, principally due to a 36% increase in the average client equity, as well as an increase in interest charged to customers uncertain margin balances. Segment income was $65.5 million for the period, an increase over the prior year period and preceding quarter of 104% and 49%, respectively. Moving on to Slide number 10, operating revenues and our institutional segment declined $4.2 million versus the prior year primarily driven by a $6.9 million increase in securities revenues as a 25% increase in the average daily volume of securities transaction was more than offset by 26% decline in securities RPM. Institutional segment operating revenues increased $23 million versus the immediately preceding quarter, primarily as a result of $11.5 million and $6.9 million increases in securities and listed derivative operating revenues respectively. Segment income declined 29% to $31.9 million in the current period as a result of decline in operating revenues and increase in volume related transaction based clearing fees I mentioned earlier, as well as an increase in interest expense. Moving on to the next slide, operating revenues in our retail segment added $14.7 million versus the prior year, which was primarily driven by a $12.1 million increase in FX and CFD revenues as a result of a 17% increase in the rate per million. Segment income increased $5.5 million versus the prior year, primarily as a result of the increase in operating revenues, which was partially offset by a $5.9 million increase in non-variable direct expenses, primarily driven by a $2.7 million increase in non-variable compensation, $1.1 million increase in professional fees and a $1.7 million increase in selling and marketing. Segment income increased $11.5 million versus the immediately preceding quarter, primarily as a result of the increase in operating revenues. Closing out the segment discussion on the next slide, operating revenues and global payments added $8 million versus the prior year, driven by a 15% increase in the average daily volume and a 7% increase in the rate per million as compared to the prior year. Overall operating segment revenues were $450.5 million in the current period, up $70.4 million or 19% over the prior year."
}