{
    "symbol": "VOXX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-17 15:30:02",
    "content": " During fiscal 2023 first quarter, I am pleased to announce a new multi-year award from Osh Kosh Defense estimated to be approximately $45 million to start and with a potential value of over $140 million. The new programs cover, various model years for the Aviator; Explorer; Navigator and Expedition and now brings the total expected value of four awards to over $200 million dollars. As for Stellantis, we've previously announced awards for approximately $400 million covering the Pacifica; Wagoneer; Cherokee and Dodge Ram vehicles ranging for model years 2022 through 2026. Lastly, our aftermarket business continues to grow, from $65 million in sales in fiscal 2020, nearly doubling to $118 million in fiscal 2021 and $136 million this past fiscal year, our brands, products and distributors continue to drive this group. The Consumer segment sales grew from $280 million in fiscal 2020 to $398 million in fiscal 2021 and this past fiscal year to $434 million, due largely to the growth in Premium Audio. During the year-over-year, sales increase was driving the year-over-year sales increase was approximately $20 million of higher sales to 11 TC, which includes the Onkyo acquisition and revised distribution and license agreement with Pioneer and higher sales in Germany. We incurred higher engineering and technical support expenses of $1.7 million related primarily to the Onkyo acquisition and a $900,000 increase in general and administrative expenses, which were driven by higher depreciation and amortization expenses and office expenses. Also in last year's fiscal fourth quarter, we incurred a $1.3 million intangible asset impairment charge related to a trademark in our CE segment. The bigger drivers of the increase were higher engineering and technical support expenses of $10.6 million and which were primarily related to direct labor and related expenses, related to headcount and higher R&D expenses in support of some new OEM programs and new products. Lastly, we reported adjusted EBITDA of $9.3 million in fiscal 2022 fourth quarter, compared to $11.9 million in the comparable fiscal 2021 period. Total long-term debt issuance costs stood at $9.8 million as of fiscal 2022, compared to $6 million for fiscal 2021 comparable period. And as I've said repeatedly, we expect that the Onkyo business for us could exceed $200 million in sales, as we ramp up, as we're able to procure more parts and everything else."
}