{
    "symbol": "SSYS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 12:49:10",
    "content": " We delivered our highest third quarter revenue in seven years as well as five consecutive quarters of positive earnings, demonstrating our unique capabilities to generate profitable growth, and we believe we can continue generating sustained operating profitability for the foreseeable future, assuming no further material deterioration of the broader economic environment. For the third quarter, consolidated revenue of $162.2 million, was up 2% and revenue adjusted for divestitures and at constant currency, was up 7.8% from the prior year period. Product revenue in the third quarter rose by 3% and to $112.1 million compared to the same period last year or by 10.5%, excluding divestitures and on a constant currency basis. Within product revenue, system revenue grew by 7.7% to $56.3 million compared to the same period last year, an increase by 18.9%, excluding divestitures and on a constant currency basis. Consumable revenue declined by 1.4% to $55.8 million compared to the same period last year, but grew by 3.4%, excluding divestitures and on a constant currency basis. We believe that we have created the right infrastructure to get to the over 50% gross margin and double-digit operating profit in the mid to long-term, doubling our addressable market that we've discussed in previous calls by the addition of the new technologies and everything else that we've discussed and we'll discuss today, that puts us -- gives us a lot of confidence on the ability to get to that result with respect to profitability. In the short-term, we have challenges because of the slowdown and because of, as I shared the impact on prototyping, most of the main reasons for the results of the consumable in Q3, where the which has an impact of around â\u0082¬5.1 million only in this quarter, some supply chain rollbacks, challenges, both in production and supply chain and the make divestiture, but we are coming back to growth in Q4, and that's the short-term. So with respect to the quarter, this quarter, we paid for certain M&A, for certain transactions, MakerBot is the largest in this quarter we paid, and that's something that was announced in the last few quarters in certain press releases as part of the investment in the new business with Ultimaker, both companies invested, strategic invested in this newer company roughly $47 million."
}