{
    "symbol": "SSYS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 13:53:11",
    "content": " This resulted in headwinds in the second half of 2022 that we still see today with longer sales cycles and occasional defers of order continuing to impact our results and while these challenges are causing near-term headwinds, the benefits of 3D printing such as improved production efficiency, better performing parts, reduced logistic costs, and faster time to market become even more apparent in times like this, our engagement with customers around all our technologies remains strong and the results in our service business were the best in eight quarters. For the fourth quarter, consolidated revenue of $159.3 million was down 4.6% and revenue adjusted for a constant currency was down 2.8% from the prior year period. Product revenue in the fourth quarter fell by 5.8% to $111.2 million compared to the same period last year, but grew 1.6% in the fourth quarter excluding divestitures and on a constant currency basis. For the full-year 2022, consolidated revenue was up 7.3%, up 9.6% on a constant currency basis and up 11.4% at constant currency after backing out MakerBot and for our core OEM business taking out MakerBot and FDM, growth was 12.5% at constant currency. From a gross margin perspective, full-year 2023 is expected to improve modestly to a range of 48% to 49% with the second half stronger than the first half, based primarily on higher revenue, we expect gross margins to exceed 50% in the next few years. As we have stated, time and again, the challenges our customers and our business face today in many ways highlight the benefits of additive manufacturing going forward, resulting in confidence for the years ahead, even as we navigate the current environment, we have the balance sheet strength to continue investing in an expanding portfolio of hardware, materials, and software solutions to broaden our market presence. Your line is now live. Hi, thanks for taking my questions. Your line is now live. Your line is now live. Hi, thanks for taking my questions. Your line is now live. Your line is now live. So when you look for the full-year of 2022, we increased revenue by $44 million with an incremental OpEx of only $6.5 million, which reflects 15% of OpEx as a percentage of revenue for the full-year of 2022, that's something that is part of our scale. Your line is now live. Your line is now live. Your line is now live."
}