{
    "symbol": "SSYS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 10:26:04",
    "content": " Revenues were driven by a 29.2% growth in our system sales compared to the second quarter of 2021, continuing the strong trend that is expected to increase sales of recurring consumables and services in the future. Within product revenue, system revenue grew by 29.2% to $58.9 million compared to the same period last year and increased by 33.5% on a constant currency basis. Service revenue was $50.9 million, an increase of 9% compared to the same period last year and up by 10.9% on a constant currency basis. Non-GAAP operating expenses were 46.4% of revenue for the quarter, compared to 49.3% for the same period last year, as we continue to focus on operational efficiency improvement. Since our last update, currency exchange rates have continued to decline across a number of our key foreign currencies, impacted our outlook for revenues for the second half of the year by $10 million. Revenue growth for the second half of the year is expected to be approximately 6% to 7% higher than the second half of 2021, with the fourth quarter anticipated to grow at a higher rate than the third. From a gross margin perspective, we continue to expect full year 2022 to be flat to slightly higher as compared to 2021, with the second half stronger than the first half based primarily on higher revenue. In 2022, we now expect our operating expenses to be approximately $18 million to $23 million higher than 2021, primarily due to the impact of owning a 3D for the full year, highest costs that results from higher sales and investment in new growth drivers such as Origin 1 and Healthcare. Your line is now live. Your line is now live. We're trying to leverage our strong cash position with no debt to -- and even if it means a couple of quarters of a negative operating cash flow in order to meet our demand, in order, by the way, also to improve our gross margin in the future because that will enable us to shift more to sea versus air shipment in the future, being having the right scale of inventory. First, I would like to start with the revenues, we are quite confident that we will pass the $700 million and more because we created a growth engine, and we put them in place in the last two years. Your line is now live. But I can tell you that I think I answered earlier, we really believe that our organic business today, like the platform that we created, the technology, the value proposition, those by themselves, as we grow as we -- as revenue continue to increase double digits in the next year will bring significant incremental operating profit and will get us closer to the double digit. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}