{
    "symbol": "XELA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 23:09:11",
    "content": " That aside, the total negative impact in Q3 was $26.6 million, which was offset by revenue growth in Q3 of $7.2 million and $4.6 million of cleared backlog from Q2. On a reported basis, revenue was $264 million, down 5.4% year-over-year and $271 million on a constant currency basis, down 2.9% year-over-year. On a consolidated basis, revenue for the quarter was adversely impacted by $7 million from the currency translation change, $15.1 million from transition revenue and contract losses and $4.5 million impact from network outage on contracted revenue and was positively offset by revenue growth of $7.2 million and $4.1 million of cleared backlog these were the details of these are on Slide 5. Additionally, we were not able to capture approximately $4.6 million of revenue during the quarter due to continued staffing shortage. Revenue for our ITPS segment was $185.3 million, a decrease of 11% from $208.3 million in the third quarter of 2021. Our Healthcare Solutions segment revenue totaled $61 million, a 13% increase on a year-over-year basis from $54 million in the year ago period. Our Legal and Loss Prevention Service segment revenue was $17.8 million, a 5.2% increase on a year-over-year basis from $16.9 million, driven by steady project-based business. Gross profit for the third quarter was $46.2 million, down $21.3 million or 31.6% year-over-year. SG&A for the third quarter totaled $44.4 million, up $1.1 million year-over-year and lower by $5.8 million sequentially and representing 16.8% of sales. Adjusted EBITDA was $31.8 million, down 12.5% from the $36.4 million in the prior year period and down by 12.7% sequentially. Number two, 3 months ended September 30, 2021, which is last year, it benefited from a gain on early extinguishment of debt of $28.1 million in connection with the repurchase with the repurchase of notes and senior secured term loan. I would add with the 98% recurring revenue, as we look into Q4, in $7 million that we converted as new business that's approximately 2%."
}