{
    "symbol": "AFYA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-21 21:40:24",
    "content": " Net income followed the same positive trend of last quarter and reached BRL321.4 million, a growth of 66.3% year-over-year, with an EPS of BRL3.39, more than 77% higher than last year, even considering a higher net debt level and the market interest rate level. Moving to the second row to our operational updates of the quarter, we have now reached 2,709 (ph) medical seats with the beginning of the four Mais Medicos operations along with JiParana campus, an increase of almost 15% year-over-year. Once again, Afya reported great results on the Digital Health Services revenue, which ended the quarter with an increase of more than 59% year-over-year, and more than 30% excluding acquisitions, reaching almost BRL45 million in the three-month period. Moving now to Slide number 5, the successful concluded acceptances of new medical students for the second half, ensuring a 100% occupancy in all of its medical schools, added to the positive trend on the Continuing Education recovery, and the growth in Digital Services, enable us to reaffirm our previously issued guidance for the entire year of 2022. Adjusted net revenue for the quarter was up 25% year-over-year to BRL580 million, reflecting the maturations of medical seats and the beginning of the four Mais Medicos and Ji Parana operations, higher tickets in Medicine courses, and the Continuing Education recovery, mainly due to the interruption of the effects of the COVID-19 pandemic, the opening of six new campuses in important capitals of the country, and new courses launching. As said before, we saw another quarterly great recovery in our Continuing Education segment, with an increase of more than 42% in the number of students, compared to last year, reaching 4,036 students, getting closer to the 2020 figures again. Finally, on our last graph, we can see our Digital Services net revenue for the quarter, which increased more than 59% year-over-year, and more than 30% excluding acquisitions. As we approach the end of the year, even considering the challenging economic and political scenario, we can gladly see Afya delivering strong results, with a quarter marked by significantly increases in net revenue in our three segments, positive EBITDA, cash generations and EPS growth, and a consistent business expansion."
}