{
    "symbol": "HEI",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-28 13:25:24",
    "content": " HEICO's actual results may differ materially from those expressed in or implied by those forward-looking statements as a result of factors including, but not limited to, the severity, magnitude and duration of public health threats such as the COVID-19 pandemic or health emergencies; HEICO's liquidity and the amount of and timing of cash generation, lower commercial air travel caused by health emergencies and their aftermath, airline fleet changes or airline purchasing decisions, which could cause lower demand for our goods and services, product specification costs and requirements, which could cause an increase to our cost to complete contracts, governmental and regulatory demands, export policies and restrictions, reductions in defense, space or Homeland Security spending by U.S. and/or foreign customers, or competition from existing and new competitors, which could reduce our sales, our ability to introduce new products and services at profitable pricing levels, which could reduce our sales or sales growth, product development or manufacturing difficulties, which could increase our product development and manufacturing costs and delay sales, our ability to make acquisitions and achieve operating synergies from acquired businesses, customer credit risk, interest, foreign currency exchange and income tax rates, economic conditions including the effects of inflation within and outside of the aviation, defense, space, medical, telecommunications, and electronics industries, which could negatively impact our cost and revenues, and defense spending or budget cuts, which could reduce our defense-related revenue. Consolidated first quarter fiscal 2023 net sales represent record results for HEICO, driven principally by record net sales within the Flight Support Group, mainly arising from continued rebound in the demand for our commercial aerospace products and services. Consolidated operating income and net sales in the first quarter of fiscal 2023 improved 31% and 27%, respectively, as compared to the first quarter of fiscal 2022. Consolidated net income increased 7% to $93 million or $0.67 per diluted share in the first quarter of fiscal 2023, and that was up from $86.9 million, or $0.63 per diluted share, in the first quarter of fiscal 2022. The benefit in the first quarter of fiscal 2023, net of control â\u0080\u0093 non-controlling interest was $6.1 million, or $0.04 per diluted share, down from $17.5 million, or $0.13 per diluted share, in the first quarter of fiscal 2022. Our net debt, which is total debt less cash and cash equivalents of $640.2 million as of January 31, 2023 compared to shareholders' equity, was 23.3% as of January 31, 2023 and that compared to â\u0080\u0093 sorry, 5.7% as of October 31, 2022. Cash flow provided by operating activities remained strong, totaling $76.7 million in the first quarter of fiscal 2023 and that compared to $78 million in the first quarter of fiscal 2022. The cash flow provided by operating activities in the first quarter of fiscal 2023, reflects an increase in working capital, principally driven by an increase in inventories to support our increased consolidated backlog we continue to forecast strong cash flow from operations for fiscal 2023. At this time, I would like to introduce Eric Mendelson, Co-President of HEICO and President of HEICO's Flight Support Group, and he will discuss the first quarter results of the Flight Support Group. The Flight Support Group's net sales increased 36% to a record $371.3 million in the first quarter of fiscal 2023, up from $272.7 million in the first quarter of fiscal 2022. The Flight Support Group's operating income increased 60% to a record $83.6 million in the first quarter of fiscal 2023, up from $52.4 million in the first quarter of fiscal 2022. The operating income increase in the first quarter of fiscal 2023, principally reflects the previously mentioned net sales growth, improved gross profit margin and efficiencies realized from the higher net sales volume. The operating margin increase in the first quarter of fiscal 2023 principally reflects the previously mentioned improved gross profit margin and decreased SG&A expenses as a percentage of net sales, mainly reflecting the previously mentioned efficiencies. The Electronic Technologies Group's net sales increased 15% to $255.1 million in the first quarter of fiscal 2023, up from $222.3 million in the first quarter of fiscal 2022. The Electronic Technologies Group's organic net sales in the first quarter of fiscal 2023 were consistent with the prior year and principally reflected increased other electronics, commercial aviation and medical products net sales offset by decreased defense products net sales. The Electronic Technologies Group's operating income increased 2% to $56.5 million in the first quarter of fiscal 2023, up from $55.6 million in the first quarter of fiscal 2022. The lower gross profit margin in the first quarter of fiscal 2023 principally reflects decreased net sales of defense products, partially offset by increased net sales of our other electronics and commercial aviation products. By the way, in the first quarter, we roughly estimate that somewhere around a little shy of $30 million of shipments were delayed mostly into our second quarter versus over $40 million of delays during fiscal 2022's fourth quarter."
}