{
    "symbol": "OCN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 13:34:07",
    "content": " We reported fourth quarter adjusted pre-tax loss of $3 million, a 57% improvement from the third quarter as our cost actions and servicing segment earnings offset the impact of volume and margin pressures in correspondent and co-issue. Throughout 2022, the originations team continuously adjusted to market conditions addressing our cost structure, integrating the forward and reverse originations platforms where possible, growing our total client base by 21% and growing high margin product clients by 41%. Last year, we opportunistically and prudently sold as well as invested in MSRs, keeping our MSR UPB flat at roughly $135 billion, while growing our total servicing portfolio through sub-servicing additions. Starting in the right data column for full year 2022, we recognized GAAP net income of $26 million for a full year earnings per share amount of $2.97, which led to book value per share of $61 or an increase of 17% year-over-year. Servicing had a strong fourth quarter and generated an $18 million adjusted pre-tax income, which was an $11 million improvement over the prior quarter. Cost reductions played a big part across the company as Glen has previously mentioned, with reductions here captured in both servicing and origination data, as well as a $5 million improvement over the prior quarter in the corporate overhead areas. The fourth quarter notables, which are detailed in the appendix consist primarily of a $61 million decline in MSR fair value adjustments net of hedge and a $14 million loss in other notables, primarily $6 million due to severance and $6 million impact on the long-term incentive plan, which creates more cost on a cash settled basis as our stock price rises. Despite the notable reductions in the fourth quarter, we still generated a better ROE in full year 2022 than the prior year coming in at 6% and we believe we remain on track to achieve GAAP and adjusted pre-tax income profitability in the first half of 2023, assuming no adverse changes to our business or the industry. This is offset with a higher cost of debt due to rise in short-term rates, and the total result was a positive $18 million adjusted pre-tax income or an increase of $11 million from last quarter."
}