{
    "symbol": "EVTC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 15:33:03",
    "content": " Adjusted EBITDA was $52 million, a decrease of approximately 25% and adjusted earnings per share was $0.40, a decrease of approximately 35% from the prior year. Excluding the impact from FX remeasurement, adjusted EBITDA and adjusted EPS would have been $60 million and $0.53, a decrease of 14% and 15% respectively. I think it's important to briefly explain how EVERTEC is impacted by fluctuations in foreign currency, given that as Mac mentioned we have a $7.8 million non-cash remeasurement loss impacting our results this quarter. Adjusted EBITDA for the quarter was $52.4 million, a decrease of 25% from $69.8 million in the prior year and excludes the $135.6 million gain from the Popular transaction. The decline in adjusted EBITDA margin includes the expected impact from the Popular transaction I just mentioned, as well as the impact from the non-cash foreign currency remeasurement loss of approximately $7.8 million. Normalizing for these one-time effects, specifically, the one-time credit to Popular and the franc currency remeasurement loss, our adjusted EBITDA would have been approximately $67 million, a 4% decrease versus the prior-year quarter on a margin would have been approximately 44%, and approximately 400 basis point decrease versus the prior year and in line with our expectations. Adjusted net income for the quarter was $27.1 million, a decrease of 40% as compared to the prior year, primarily reflecting the lower adjusted EBITDA on a higher adjusted tax rate. Our adjusted effective tax rate in the quarter was 24.8% higher than expected and also negatively impacted by the foreign currency remeasurement loss, if we were to normalize for the remeasurement loss, our adjusted effective tax rate would have been approximately 18%. In the third quarter, Merchant Acquiring net revenue decreased 2% year-over-year to approximately $36.9 million as the prior year presents a tough comparable period, given the benefits from COVID-related federal stimulus and the normalization of spending patterns this year toward pre-pandemic levels in terms of our mix of sales, domestic versus international transactions, and average ticket. Revenue for the segment in the third quarter was $44.6 million, up approximately 15% driven by increased transaction volumes for POS processing of 4% year-over-year, continued growth of digital payments mainly ATH mobile business, and continued benefit from increases in transaction processing and monitoring revenue from services provided to the LatAm segment. Revenue for the segment in the third quarter was $33.7 million, up approximately 26% as compared to last year. The year-over-year decrease was mainly driven by the $7.8 million non-cash foreign currency remeasurement loss previously discussed, which represented approximately 23% points of margin decline as well as the recognition of a low margin hardware sales in the quarter. For the quarter, adjusted EBITDA was $16.3 million and adjusted EBITDA margin was 33%, down approximately 12% points as compared to last year. Our third-quarter adjusted EBITDA was approximately negative $6 million, a decrease of 18% compared to prior year. That's an additional $6.4 million or $6.3 million to the Business Solutions segment, Jamie, so you have to Mac's point the $30 million annual run rate which your calculation is right based on that, and then incrementally for this quarter, specifically that $6.3 million impact from the one-time credit."
}