{
    "symbol": "EVTC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 23:10:18",
    "content": " Total revenue was $161 million for the second quarter, an increase of approximately 8% compared to the second quarter of 2021. Adjusted EBITDA was $73 million, a decrease of approximately 9%; and adjusted earnings per share was $0.65, a decrease of approximately 17% from the prior year quarter. During the quarter, we returned approximately $18 million to our shareholders through dividends and share repurchases, an increase of $14 million when compared with the prior year. Payments - Puerto Rico benefited from increased POS transaction volumes, up 6% year-over-year as well as continued strong growth from ATH Movil and ATH Business and an increase in issuing services for Medicare health care providers in Puerto Rico. Total revenue for the second quarter was $160.6 million, up approximately 8% compared to $149.1 million in the prior year. Adjusted EBITDA for the quarter was $73.4 million, a decrease of approximately 9% from $80.3 million in the prior year. The decline in margin is driven by the $4.1 million impairment loss recorded in the quarter for a multiyear software development, foreign currency exchange losses of approximately $200,000 in the quarter compared with gains of approximately $1.4 million in the prior year quarter, increased provisions for expected losses as well as changes in the mix of business and higher operating expenses in part due to inflationary impacts. Adjusted net income for the quarter was $47 million, a decrease of approximately 18% as compared to the prior year, primarily reflecting the lower adjusted EBITDA as well as a higher tax rate and higher operating depreciation and amortization. Adjusted EPS was $0.65 for the quarter, a decrease of approximately 17% compared to the prior year. In the second quarter, Merchant Acquiring net revenue increased slightly year-over-year to approximately $38.5 million as the prior year presented a tough comparable period given the benefits from COVID-related stimulus that positively impacted last year results. Adjusted EBITDA margin was 45.5%, down approximately 810 basis points as compared to last year, reflecting higher operating expenses, mainly processing costs driven by higher volume of transactions. Revenue for the segment in the second quarter was $46.1 million, up approximately 19%, driven primarily by increased transaction volumes for POS processing, which grew 6% year-over-year and ATH Movil, which grew 16%, mainly driven by ATH Business as sales volumes continue to grow. Adjusted EBITDA margin was 51.8%, down approximately 950 basis points as compared to last year, primarily due to the software impairment charge I referred to earlier as well as higher operating expenses. Revenue for the segment in the second quarter was $30.8 million, up approximately 19% as compared to last year. Adjusted EBITDA for the segment was $9.6 million, and adjusted EBITDA margin was 31.1%, down approximately 11 percentage points as compared to last year. Business Solutions revenue for the second quarter was up approximately 7% to $64.7 million as we benefited from the 5% CPI escalator in our MSA with Popular, increased volumes in core banking services, the printing contract that began in June last year, and we also benefited from one bank software sales in the Dominican Republic, amounting to approximately $1 million. For the quarter, adjusted EBITDA was $29.8 million and adjusted EBITDA margin was 46.1%, down approximately 430 basis points as compared to last year. Our second quarter adjusted EBITDA was approximately negative $7.4 million, and our adjusted EBITDA as a percentage of total revenue was 4.6%, higher than prior year but in line with our expectations for 2022. We recognize the customer relationship cost of approximately $10.6 million in connection with the Puerto Rico acquisition previously mentioned and purchased certificates of deposit for approximately $7.3 million, which were part of a contractual requirement to close the BBR transaction. As part of the extension, we have conceded the 5% CPI for the 2021-2022 period that commenced on October 1, 2021, and will be retroactively crediting the cumulative impact of CPI now in Q3, which amounts to approximately $7 million, mostly impacting the Business Solutions segment."
}