{
    "symbol": "EVTC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 14:46:04",
    "content": " Beginning on Slide 4, total revenue was $150 million for the first quarter, an increase of 8% compared to the first quarter of 2021. Adjusted EBITDA was $75 million, an increase of 9%; and adjusted earnings per share was $0.70, an increase of 13% from the prior year quarter. First quarter results in Puerto Rico reflect a strong payment revenue growth of our Merchant Acquiring segment benefited from 14% sales volume growth, and our Payment Puerto Rico segment benefited from 9% growth in transaction process and the continuous growth of our digital payment channels, ATH Movil and ATH Business. As Marc noted, we also benefited from a full quarter of revenue from the treating contract won last year in Business Solutions as well as the 5% CPI increase under our MSA with Popular. Adjusted EBITDA for the quarter was $75.4 million, an increase of approximately 9% from $68.9 million in the prior year. Adjusted net income for the quarter was $50.8 million, an increase of approximately 13% as compared to the prior year primarily reflecting the higher adjusted EBITDA and lower cash interest rate partially offset by higher operating depreciation and amortization. Adjusted EPS was $0.70 for the quarter, an increase of approximately 13% compared to the prior year. In the first quarter, Merchant Acquiring net revenue increased approximately 15% year-over-year to $35.6 million, driven by an increase in sales volume of 14%, a higher average ticket of prior year and a slightly higher spread per transaction. Adjusted EBITDA margin was 47.9% down approximately 230 basis points as compared to last year, reflecting higher operating costs from the full quarter from the FirstBank expanded relationship and other operating expenses. Revenue for the segment in the first quarter was $40 million, up approximately 10% and driven by strong POS processing and continued digital payments growth from ATH Movil and ATH Business. Adjusted EBITDA per segment was $23.8 million, up approximately 14% as compared to last year. Adjusted EBITDA margin was 59.4% up approximately 210 basis points as compared to last year primarily due to the higher transactional revenue, which is highly scalable, partially offset by higher operating expenses, including costs related to POS equipment maintenance. Adjusted EBITDA for the segment was $12.4 million, and adjusted EBITDA margin was 43.2%, up approximately 310 basis points as compared to last year. The revenue increase in the quarter benefited from the 5% CPI escalator in our current MSA with Popular and incremental volume resulting from the printing contract signed last year and went production in the second half of 2021, partially offsetting this increase on the hardware sale recognized in the prior year quarter of $1 million and services provided to the Puerto Rico deployment of elevation in the prior year that did not recur. For the quarter, adjusted EBITDA was $29.6 million, and adjusted EBITDA margin was approximately 47% down approximately 160 basis points as compared to last year. Our first quarter adjusted EBITDA was a negative $7.5 million, a decrease of approximately 6% compared to the prior year."
}