{
    "symbol": "CRMD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 11:11:04",
    "content": " These statements are subject to certain risks and uncertainties and include but are not limited to any of the following: any statements, other than statements of historical fact regarding managementâ\u0080\u0099s expectations, beliefs, goals, and plans about the companyâ\u0080\u0099s prospects, including its clinical development program, manufacturing activities, and NDA approval for DefenCath in the U.S. or other product candidates, future financial position, future revenues and projected costs, and potential market acceptance of DefenCath or other product candidates. Over the last three months, the company has continued to make excellent progress on all fronts, working diligently in support of our CMO as they implement corrective actions to the deficiencies received during a June FDA inspection, as well as undertaking multiple steps to build out the team, processes and systems to be ready for commercialization as quickly as possible following a potential FDA approval. That said, we believe the average stay is likely closer to 13 days, where patients are dialyzed--some are dialyzed daily, some every other day, some every three days, and we took a weighted average based on the data that weâ\u0080\u0099ve seen and we came up with a calculation of 9.75 vials, so what that means is if the hospital is utilizing DefenCath in the treatment of a patient in an inpatient setting, had the original NTAP calculation been in place, if a patient was in the hospital for three weeks, the maximum reimbursement to the facility would have been the approximately $4,400. I do want to actually make sure that weâ\u0080\u0099re clear that Alchemy is going to be a part of our ongoing supply chain regardless of whether or not we utilize them as the primary filing in terms of gaining or hopefully gaining FDA approval, as we talked about in our third scenario, or if we ultimately utilize them as an alternate manufacturer to mitigate supply chain risk from having our product come only from one site, so weâ\u0080\u0099re really looking at them as well as a long-term partner as we would with our alternate supplier of heparin API."
}