{
    "symbol": "BWEN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 16:38:02",
    "content": " During the second quarter, we delivered $50 million of revenue, an 8% increase year-over-year, led by growth in our Gearing and Industrial Solutions segments which posted gains of 37% and 43%, respectively. On a consolidated basis, our Q2 orders were $26 million, a 1% decrease year-over-year, reflecting a softness in tower demand, partially offset by stronger orders within the Gearing and Industrial Solutions segments as well as for the industrial fabrication product line within heavy fabrications. Our Heavy Fabrications segment saw orders of $13 million, a 12% decrease year-over-year with stronger industrial fabrication orders offsetting the timing of tower orders. Our Gearing segment booked $9 million of orders, a 14% increase year-over-year as we continue to see strength in our energy and industrial markets. Within Gearing, revenue was $10 million, a 37% increase year-over-year as customer activity continues to accelerate within the energy sector, given elevated commodity pricing. Revenue for our Industrial Solutions segment increased 43% to $5 million, driven by increased demand for natural gas turbine content, including stronger demand for components used in the aftermarket maintenance and upgrading of these units. It should be noted that the prior year second quarter results include a $9.2 million benefit related to the PPP loan forgiveness, together with a $3.6 million benefit attributable to the ERC as outlined in the provisions of the CARES Act. Second quarter orders were $12.9 million, a 12% decrease from the prior year period. Excluding the impact of the PPP loan forgiveness and the ERC, adjusted EBITDA decreased by $0.5 million when compared to the second quarter of 2021, reflective of the cost to transition our workforce and plant capacity to industrial fabrication work. Gearing orders totalled $8.9 million in Q2, down sequentially but up 14% from what was booked in the prior year quarter. However, excluding the impacts of the PPP loan forgiveness and the ERC recorded in the prior year, adjusted EBITDA increased by $0.5 million when compared to the second quarter 2021. Industrial Solutions recorded $4.1 million of new orders in Q2, up $300,000 from the prior year quarter."
}