{
    "symbol": "ALCO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-09 21:23:10",
    "content": " Total operating revenue for the quarter ended March 31, 2022, was $49.6 million compared to $55.9 million for the quarter ended March 31, 2021. Our citrus revenue was $49 million and $55.3 million for the quarters ended March 31, 2022 and 2021, respectively. The decrease in revenue for the three months ended March 31, 2022, compared to the three months ended March 31, 2021, was primarily due to a decrease in the Early and Mid-Season and Valencia fruit harvested and, to a lesser extent, a decrease in revenue generated from Grove Management Services. Total operating expenses were $45.5 million for the three months ended March 31, 2022 and March 31, 2021. We did incur a slight increase in the cost of sales due to us harvesting a greater percentage of boxes in relations to the estimated total boxes to be harvested for the full season during the three months ended March 31, 2022, as compared to the same period in the prior year, leading to a larger percentage of costs being allocated to cost of sales in the current quarter. Offsetting this increase was a reduction in our harvesting and hauling expenses directly related to the decrease in boxes harvested in the three months ended March 31, 2022, as compared to the same period in the prior year. General and administrative expenses for the three months ended March 31, 2022, were approximately $2.5 million compared to approximately $2.7 million for the three months ended March 31, 2021. The decrease was attributable in large part to reduced payroll expenses of approximately $100,000, primarily relating to the reduction in administrative personnel made during the latter half of fiscal year ended September 30, 2021, and during the six months ended March 31, 2022, and a reduction in consulting expense resulting from the Company incurring approximately $200,000 in corporate advisory fees in the three months ended March 31, 2021. Other income, net of other expense for the three months ended March 31, 2022, was approximately $25.7 million as compared to other expense, net of other income of approximately $1.1 million. Additionally, a decrease in interest expense of approximately $200,000 for the three months ended March 31, 2022, as compared to the three months ended March 31, 2021, was realized primarily because of the reduction of its long-term debt attributable to making its mandatory principal payments and certain prepayments. For the quarter ended March 31, 2022 and March 31, 2021, we reported net income attributable to Alico common stockholders of approximately $20.7 million and approximately $4.9 million, respectively."
}