{
    "symbol": "ALCO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-03 13:17:10",
    "content": " The increase in revenue for the 3 months ended December 31, 2021 compared to the 3 months ended December 31, 2020 was primarily due to an increase in revenue generated from our early and mid season harvest. Additionally, we saw a slight increase in the early and mid season boxes harvested for the 3 months ended December 31, 2021 compared to the 3 months ended December 31, 2020. Partially offsetting this increase in revenues was a decrease in pound solids per box during the 3 months ended December 31, 2021 as compared to the 3 months ended December 31, 2020 mainly because the internal quality of the fruit was not as strong as it was in the previous year. Total operating expenses were $13.5 million and $8.3 million for the 3 months ended December 31, 2021 and 2020 respectively. The increase in operating expenses for the 3 months ended December 31, 2021 as compared to the 3 months ended December 31, 2020 primarily relates to Alico receiving less proceeds under the Citrus Recovery Block Grant program during the 3 months ended December 31, 2021 when compared to the 3 months ended December 31, 2020. The increase in operating expenses is also in part attributable to us harvesting a greater percentage of boxes in relation to the estimated total boxes to be harvested for the full season during the 3 months ended December 31, 2021 as compared to the same period in the prior year, leading to a larger percentage of cost being allocated to cost of sales in the current period. General and administrative expenses for the 3 months ended December 31, 2021 totaled $2.6 million compared to approximately $2.5 million for the 3 months ended December 31, 2020. Partially offsetting these increases were decreases related to payroll and payroll associated expenses of approximately $140,000 primarily relating to the reduction and administrative personnel made during the fiscal year ended September 30, 2021 and a reduction in legal expenses of approximately $70,000, which is mainly the result of us having incurred additional legal expenses in the 3 months ended December 31, 2020 relating to the acquisition of a citrus grove in October 2020. Other income net for the 3 months ended December 31, 2021 and 2020 was approximately $7.6 million and approximately $2.2 million respectively. For the 3 months ended December 31, 2020, we recognized gains of approximately $3.4 million relating to the sale of real estate, property and equipment and assets held-for-sale. Additionally, the improvement was in part due to a decrease in interest expense of approximately $300,000 for the 3 months ended December 31, 2021 as compared to the 3 months ended December 31, 2020, which resulted from the reduction of our long-term debt attributable to making mandatory principal payments and certain prepayments. For the fiscal quarter ended December 31, 2021 and December 31, 2020, we reported net income attributable to Alico common stockholders of approximately $10.1 million and approximately $3.8 million, respectively."
}