{
    "symbol": "ALCO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-16 10:51:06",
    "content": " For the fiscal year ended September 30, 2022, the company reported net income attributable to Alico common stockholders of approximately $12.5 million compared to net income attributable to Alico common stockholders of approximately $34.9 million for the fiscal year ended September 30, 2021. Our adjusted EBITDA which excludes non-recurring items, was approximately $13.4 million for the fiscal year ended September 30, 2022 as compared to approximately $25.3 million for fiscal year ended 2021. For the fiscal year ended September 30, 2022, total operating revenue was $91.9 million compared to $108.6 million for the fiscal year ended September 30, 2021. Citrus revenue was $89.7 million and $105.8 million for the fiscal years ended September 30, 2022 and 2021, respectively. The decrease in revenue for the fiscal year ended September 30, 2022, compared to the fiscal year ended September 30, 2021, was primarily due to a decrease in the revenue from lower box production particularly our Valencia fruit and a reduction in our Grove Management Services. For the fiscal year ended September 30, 2022, we recorded approximately $11.9 million worth of operating revenue from Grove Management Services as compared to $17 million in the fiscal year ended September 30, 2021. For the fiscal year ended 2022, we recorded approximately $10.5 million of operating expenses from Grove Management Services, as compared to approximately $15.1 million in the fiscal year ended September 30, 2021. General and administrative expenses for the fiscal year ended September 30, 2022, were approximately $10.1 million compared to approximately $9.5 million for the fiscal year ended September 30, 2021. Other income net for the fiscal years ended September 30, 2022 and 2021 was approximately $37.8 million and approximately $31.9 million, respectively. For the fiscal year ended September 30, 2022, we recorded gains on sale of real estate property and equipment and assets held for sale of approximately $41.1 million relating to the sale of approximately 9,400 acres from the Alico Ranch to several third parties. By comparison, for the fiscal year ended September 30, 2021, we recognized gains on sale of real estate, property and equipment and assets held for sale of approximately $35.9 million. Additionally, a decrease in interest expense of approximately $0.7 million for the fiscal year ended September 30, 2022 as compared to the fiscal year ended September 30, 2021, was realized due to the reduction of our long-term debt and making of mandatory principal payments along with other prepayments. During the fiscal year ended September 30, 2022, we received approximately $1.1 million of additional proceeds under the Florida Citrus Recovery Block Grant program relating to Hurricane Irma damage sustained in September 2017. For the fiscal years ended September 30, 2022 and September 30, 2021, we reported net income attributable to Alico common stockholders of approximately $12.5 million and approximately $34.9 million, respectively. Our adjusted EBITDA was approximately $13.4 million for the fiscal year ended September 30, 2022 as compared to approximately $25.3 million for the fiscal year ended September 30, 2021."
}