{
    "symbol": "ALCO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-03 20:25:02",
    "content": " The decrease in revenue for the three months ended June 30 2022 compared to the three months ended June 30 2021 was primarily due to a decrease in the Valencia fruit harvested and to a lesser extent, a decrease in revenue generated from Grove management services. The process box production for the three months ended June 30 2022 decreased by 19.9% as compared to the same period in the prior fiscal year, mainly due to greater fruit drop, which is attributable to disease and weather conditions including the freeze event, which occurred in late January 2022. Total operating expenses were $24.5 million and $26.2 million for the three months ended June 30, 2022 and June 30, 2021 respectively. The decrease in operating expenses for the three months ended June 30, 2022 as compared to the three months ended June 30, 2021 was primarily due to the reduction in caretaking management services expense. As previously mentioned, our primary third-party grove owner decided to exit the citrus business and exit the property management agreement with us during the third quarter ended June 30, 2022, resulting in a decrease of expenses. To a lesser extent, the company recognized a decrease in harvest and hauling expenses for the quarter ended June 30, 2022 when compared with the same period in the prior year, due to a smaller number of plenty of boxes being harvested as compared to the same period in the prior year. General and administrative expenses for the three months ended June 30, 2022 were approximately $2.6 million, compared to approximately $1.9 million for the three months ended June 30, 2021. The increase in legal expense was due to a decrease legal expenses in the nine months ended June 30, 2021 when compared to the nine months ended June 30, 2022, which was related to a reimbursement of approximately $700,000 from insurers for a corporate legal matter from 2018 that was received during the nine months ended June 30, 2021. Other income net for the three months ended June 30, 2022 and for June 30, 2021 was approximately $4.9 million and approximately $29.4 million respectively. The decrease in other income net is primarily due to us recognizing a significant gain on sales of real estate, property and equipment and assets held for sale of approximately $30.3 million for the three months ended June 30, 2021. When compared to the gains recognized on sales of real estate property, plant and equipment and assets held for sale of approximately $5.8 million for the three months ended June 30, 2022. For the fiscal quarter ended June 30, 2022 and June 30, 2021 we reported net income attributable to Alico common stockholders of approximately $2.7 million and approximately $27.1 million respectively."
}