{
    "symbol": "TSCO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 12:47:01",
    "content": " Good morning, everyone, and thanks for joining us. After our prepared remarks, we'll open the call up for your questions. This call may contain certain forward-looking statements that are subject to significant risks and uncertainties, including the future operating and financial performance of the company. Although, the company believes the expectations reflected in its forward-looking statements are reasonable, it can give no assurance that such expectations or any of its forward-looking statements will prove to be correct, and actual results may differ materially from expectations. Thanks, Mary Winn, and good morning, everyone, and thank you for joining our call this morning. Year-end is when we reflect on our accomplishments, and I'm pleased to share the results from the team in 2022. We had solid market share gains across all our product categories, and these gains continue to contribute materially to our sales growth. And my sincere thanks and appreciation goes out to the more than 50,000 team members of Tractor Supply who work diligently every day to live our mission and values. Regardless of the operating challenges throughout the year and really over the last three years since we entered the pandemic, the team has delivered impressive results while also making significant progress on our Life Out Here strategy. With this year's results, we've now posted three consecutive years of exceptional sales growth. Including new stores in the 53rd week, our revenue on a three-year basis has increased about 70%, with a three-year comp stack of 46.5%. Over the same period of time, we've invested nearly $1.7 billion in our stores, distribution centers, technology and other strategic initiatives as part of our Life Out Here strategy. We also have significantly improved our operating capabilities, including relaunching our Neighbor's Club program, creating our field activity support team, expanding our mobile footprint, and delivering on the increased volume of our consumable, usable and edible products. We've remained focused on introducing new capabilities, improving the shopping journey and ensuring we have scalable platforms. As a company, we hit several significant billion dollar milestones in 2022. We grew our sales to a record $14.2 billion, increased net income to over $1 billion, achieved $1 billion in private label credit card sales and returned more than $1 billion in capital to shareholders for the second consecutive year. Our business continues to be incredibly resilient, and the quarter unfolded much like we anticipated. Albeit, comp sales performance was stronger than forecast as the late December winter storm provided a comp sales lift of approximately two percentage points. Excluding the impact of the winter storm, importantly, our underlying results were in line with the high end of our expectations for the quarter. For the fourth quarter, our comparable store sales growth was 8.6%, and it was driven by strong ticket growth of 6.3% and transaction count increase of plus 2.3%. And importantly, even without the winter storm benefit, our comp transactions would have been positive for the quarter. October, December were our strongest comp sales months. On e-commerce, it achieved mid single-digit positive sales growth, and we continue to build out our ONETractor capabilities. As of year-end, the Tractor Supply app has had over 4.4 million downloads since it was launched mid-2020. For the seventh consecutive quarter, we continued to see our consumable, usable and edible products outperform our overall comp sales results. This strong performance was driven by dry dog food as well as feed for poultry, equine and wild birds. And we continue to gain share across our categories, both online and in-store. During the quarter, we reached a new record in the number of high-value customers. Overall, our best customers are shopping with us more frequently and spending more money per transaction. On Petsense, the rebranding of Petsense, the Petsense by Tractor Supply along with our expansion of our Neighbor's Club program to Petsense by Tractor Supply is really resonating with our customers. Our customersâ\u0080\u0099 response to these initiatives is very encouraging, with Neighborâ\u0080\u0099s Club membership already representing nearly 50% of sales at Petsense. During the quarter, we launched Tractor Supply, Visa Credit Card. This new co-brand credit card allows our customers to earn more on their everyday purchases, both in-store and anywhere Visa is accepted. This marks exciting progress on our journey to drive sales, build loyalty and reduce tender expense through our credit offerings. And as I mentioned earlier, this past year, we crossed over $1 billion in private label credit card sales. For the fourth consecutive quarter, our overall customer satisfaction score hit a new all-time high as we continue to invest in our team to provide best-in-class customer service. During the quarter, we also broke ground on our tenth distribution center in Maumelle, Arkansas to support for the higher volumes of our existing stores, the continued build-out of our new stores as well as the acquisition of Orscheln. In 2022, we moved more than 8 billion pounds of consumable, usable and edible products through our supply chain as we are the worldâ\u0080\u0099s largest seller of back feed and food for livestock in campaign and animals. Additionally, in 2022 of April, we announced an ambitious three-year water conservation goal to conserve 25 million gallons of water by 2025. These commitments to the climate and society reinforce our vision that a healthy environment, properly managed resources and vibrant communities are key to secure and prosperous future for Life Out Here. As a result, our efforts to enhance our sustainable business practices have been recognized by various third parties. With nearly 1,800 team members, our field activity support team has made powerful contributions to our in-stock performance and execution of our sales-driving initiatives. And building on our performance for 2022, our outlook for 2023 is right in line with our long-term guidance. As we planned for the year, we anticipate continuing to operate in an ever-challenging and changing macro environment. We expect consumers will continue to be judicious in their spend, but resilient, while prioritizing needs over discretionary. The effects of secondary markets on our consumer spending in areas such as housing, agriculture and oil markets are expected to be collectively neutral and individually modest. Whatever economic environment plays out this year or any year for that matter, weâ\u0080\u0099re confident that our business will remain resilient and build on our strong track record of consistent and stable growth across all economic environments. Our customers have a passion for the Out Here lifestyle and over-indexes homeowners, landowners, pet owners and animal owners. As we start out the year, we anticipated that our business would continue to exhibit consistent performance as we have a proven business model that has stood the test of time. To recap, the 53rd week added about $225 million to our net sales in the fourth quarter representing 6.8 points of our net sales growth. On a full year basis, it represented 1.8 points of the 11.6% growth year-over-year. For the fourth quarter, all regions of the country once again delivered positive sales comp. As for the cadence of the quarter, our comp store sales were performing at the high end of our outlook as we move into mid-December. Then as Winter Storm Elliott moved across the country, our sales accelerated given the stormâ\u0080\u0099s impact on our customersâ\u0080\u0099 needs for heat, insulated outerwear, livestock feed and forage and some load up of other C.U.E. As Hal shared, we estimate the storm provided about 2 percentage point benefit to our comp sales. Much like any emergency response events such as hurricanes, the profitability of these sales from winter storm events of this magnitude is lower due to the mix of products and higher incremental operating costs. Looking back, when excluding the December winter storm comparable store sales have been remarkably consistent across all four quarters of the year. Similar to trends through the year, retail price inflation contributed about 11 points to our comparable store sales in Q4 as the team continues to navigate the ongoing cost pressures across the supply chain. The comparable average ticket growth of 6.3% benefited from inflation, partially offset by a shift in sales mix to needs-based consumables versus the larger ticket items. categories was nearly 3 times the chain average, while big ticket sales performance was down mid-single digits. For the fourth quarter, our gross margin improved by 28 basis points to an even 34% of sales. Our price management actions and other margin-driving initiatives were able to offset the pressures from year-over-year product cost inflation, higher transportation costs and product mix due to the strength of C.U.E. During the quarter, we experienced a significant moderation in the rate of price increases from our vendors, but by no means are we seeing deflation. Of note, itâ\u0080\u0099s our belief that transportation costs most likely peaked in the fourth quarter. As a percent of net sales, SG&A expenses, including depreciation and amortization, increased 14 basis points year-over-year to 25.1%. As we indicated in Q3, this increase was primarily attributable to three factors: one, the impact of transaction expenses and early integration costs associated with our acquisition of Orscheln Farm and Home; two, our strategic growth initiatives, including depreciation and amortization; and three, our investments in team member compensation and benefits. Diluted EPS was $2.43, an increase of 25.9% from the fourth quarter of last year. At the end of the quarter, merchandise inventories were $2.7 billion, representing an 18% increase year-over-year in average inventory per store. Today, we believe we are better positioned to drive sustainable long-term growth than we were before the pandemic. Our structural tailwinds such as rural revitalization, home setting, self-reliance and pet ownership continue to benefit us. Adjusting for the impact of the 53rd week, our outlook for 2023 is right in line with our long-term targets as we continue to see the power of compounding from our compelling top line growth, operating margin outlook and consistent capital return to shareholders through the dividends and share repurchases. For fiscal 2023, we are forecasting net sales of $15 billion to $15.3 billion, including at least $300 million in sales from Orscheln. As a reminder, the operating cost for the new DC are reflected in SG&A, while the supply chain benefits are reflected in gross margin. And lastly, the integration of Orscheln Farm and Home is expected to impact SG&A by approximately 5 basis points. And for the year, we forecast an operating margin of 10.1% to 10.3%. We continue to believe the best way to look at our business is not by the quarter, but by the half of the year. As you model 2023, I want to point out a few things that will impact comparability. From a sales perspective, we are planning for all four quarters to have comp sales performance generally within our guidance range. As to earnings, we expect our EPS growth to be fairly balanced between first half and second half. Start-up costs for the new distribution center will pressure the first quarter, while the supply chain benefits will not begin to be realized until the second quarter. Additionally, transportation costs are expected to continue to be higher year-over-year in Q1 and then begin to moderate through the remainder of the year with the second half expected to see favorable comparisons. Also keep in mind, the discrete items that impact our earnings comparability in 2023 are the lapping of the 53rd week benefit, partially offset by the accretion from the Orscheln acquisition. And when adjusting for the 2022 benefit from the 53rd week and the 2023 accretion from the Orscheln acquisition, our outlook for 2023 is consistent with our long-term EPS guidance of 8% to 11%. Capital expenditures are forecasted to be $700 million to $775 million, with about 80% for growth initiatives. For 2023, we anticipate share purchases in a range of $575 million to $675 million, which is estimated to have a benefit of a net reduction in weighted average shares outstanding of approximately 2%. While we are closely monitoring consumer behavior and the impact of economic growth on consumer demand, we believe that we are well positioned for any consumer and economic environment. To wrap up, we are continuing to separate Tractor Supply from the competition. As we celebrate our 85th anniversary this year, Tractor Supply is a business that continues to have significant opportunities for growth ahead of us. Our position in our customer spending is for stable, needs based and demand driven product categories. As a company, three words that really summarize Tractor Supplyâ\u0080\u0099s performance are: one consistent, two, reliable, and three, sustainable. For instance, our queue product categories are driven by livestock feed for cattle, equine and poultry and companion animal food. In addition to categories like heating fuel, wildlife feed, pest control and lubricants, weâ\u0080\u0099re entering new product categories through our Garden Center transformations then open up new queue categories that provide a halo to the store as new and existing customers shop our expanded lawn and garden categories. In just over two years since we started our Life Out Here strategy, we have gained significant scale in our Fusion remodels and the transformation of our sidewalks to Garden Centers. We have a substantial runway for growth ahead of us as we still have 70% of the chain to convert to the Fusion layout and the opportunity for another 1,000 plus Garden Center transformations. When we execute a combination Fusion remodel and a Garden Center transformation of our sidelight, we have a comp lift in the high single digits. We are a need space, demand-driven business, and these product categories differentiate Tractor Supply from the bulk of retail. Since relaunching our Neighborâ\u0080\u0099s Club program in April of 2021, we have increased our high value customers by nearly 50%. Additionally, our high value customers are shopping us more frequently and spending more money. Once our customers in the flywheel of Neighborâ\u0080\u0099s Club, their spending becomes much more reliable. This group will make out nearly a quarter of the U.S. population by 2032, just 10 years from now. Our sales comps for millennials have outpaced non-millennials at Tractor Supply for five consecutive years, millennials over index and sales per customer, units per customer and average ticket. We view this strength that our millennial customer, not as a pull board, but rather as a catch up, as this group delayed family formation and the pandemic really shifted their behaviors to be much like prior generations. Today, 50% of millennials own homes versus 30% just a decade ago. So while they may have started a little bit later, we see an inflection point in the pace of home ownership and household formation for millennials. And if they continue shopping with us for five years, we experience a threefold increase in transactions and sales per customer within five years of their initial purchase. Tractor Supply enables passions and hobbies pursued by millennials, whether it is a pursuit as simple as making memories with family and friends or caring for pets and animals, or getting outside to hunt fish or camp, or being more self-sufficient and sustainable. These three words, consistent, reliable and sustainable allow us to be an earnings growth compounder on both the top line and bottom line. As I started my remarks this morning, year-end is when we reflect on our accomplishments, but more importantly, this is a key moment to look ahead and to focus on the opportunities ahead of us. With our Life Out Here strategy, we have ignited Tractor Supplyâ\u0080\u0099s next horizon of strong and sustainable growth. And with that operator, we now like to open the line for questions. Weâ\u0080\u0099re very pleased with the guidance we provided on our comp sales for 2023 to be between 3.5% and 5.5%, very much in line with our long-term guidance range as well. As Kurt said in his prepared remarks, we expect itâ\u0080\u0099ll be a blend of transacts â\u0080\u0093 positive comp transactions and ticket. We do expect inflation will be stronger in the first half, but moderate in the second half. And what Iâ\u0080\u0099d say more broadly is, our market that we participate in continues to run reasonably in line with GDP kind of flat to low single digit growth. As weâ\u0080\u0099ve said several times over the last three years, our sales growth, half of that can be attributable to share gain. And the share gain is really a composition of the competitive advantages that we have as well as the investments weâ\u0080\u0099re making in our Life Out Here strategy and the fact that weâ\u0080\u0099re reaching scale on a number of those now, particularly our Fusion and Garden Centers. But again, weâ\u0080\u0099re very positive on our outlook for 2023 and expect the momentum that we exited 2022 to continue into the year. So, just looking at your algorithm, obviously youâ\u0080\u0099re looking for sales growth just on a one year basis to be lower than EBIT growth. And I guess I would argue thatâ\u0080\u0099s probably â\u0080\u0093 sorry, sales growth to be higher than EBIT growth. And then the second question I just wanted to lump in there, when you look at your mix by category, obviously I kind of look at it at about 26% is discretionary. On the sales growth, as you said, we are in an investment cycle in our business and the thing that weâ\u0080\u0099re excited about is that weâ\u0080\u0099re able to grow earnings as we did last year double digits, and weâ\u0080\u0099re able to grow our sales as we did last year double digits even in the context of an earning cycle. And we anticipate to continue to grow sales at a significant rate next year as well as our earnings at a significant rate next year, even inclusive of all the capital expenditure and kind of underlying DNA that comes along with that, as well as all the other investments weâ\u0080\u0099re making in the business. On the nix by category, weâ\u0080\u0099ve roughly talked about discretionary being more like 15% of our business. And an example of that is what Kurt articulated in his prepared remarks saying that, our big ticket sales were kind of mid-single digit negative comps. The kind of discretionary non-seasonal related ones were kind of negative double digits, but then you had ones that were seasonally relevant and there was a demand around those say like log splitters and snow throwers that are also big ticket and could be viewed as discretionary or in our kind of math for discretionary and those blended together to drive a negative single digit â\u0080\u0093 mid single digit comp. As an example, as we get into the end of Q1 and early Q2 when we had the drought last year that disproportionately affected as we commented last year, things like riders. So the guidance you gave for 2023 and in terms of the operating margin, I guess, it sounds like the investments in new DCs and in store transformations and sidewalks are probably the factors that would keep that margin towards the lower end at the long-term guidance. As we've said several times, last year and this year are two biggest peaks in investments. And as we talked about in our enhanced earnings call a couple of years ago, the first part of this five-year cycle that we're in for our Life Out Here strategy would be towards more the bottom end of our â\u0080\u0093 middle end of our range. And then as we move towards the out years, call it, 2024, 2025, 2026, we see opportunities to increment up on our op margin towards that higher end and kind of get back to a nice leverage across our P&L, let's say, 5 or 10 basis points a year. And really, the biggest determinant of the 10.1% to 10.3% this year would just be the sales range. And if we're up more towards the 5.5, we would expect to leverage more on some of our fixed costs and be more towards that 10.3%. If we're down more towards the 3.5%, we think we'll be more in that 10.1% to 10.2% range as there's a little less leverage on some of our fixed costs. But certainly, as we look out towards the back half of this five-year investment cycle, we see opportunities for our margin rate to increment up. This year, as we shared in our opening remarks, it's kind of 70 to 80-ish new stores that will open this year. And that's in line with what we did this year, kind of in that 200 to 250 range. And then the second question I have, Kurt, you mentioned in your script, that you're seeing, I guess, price increases moderate and that's from your suppliers. And we see it â\u0080\u0093 dominantly, it's just incremental in Q4. I'd go back to some of the comments we made, say, in our Q3 earnings call and our Q2 earnings call, where we said, our business has been very consistent in that 5% to 6% comp range all last year. And as Kurt said in his prepared remarks, and I think I did as well, we were trending towards the high end of our comp guidance for Q4 when the storm hit and then that put us well over. If we'd had a better spring season, we think we would have been over our guidance for those quarters. I just get back to the point, our business is very consistent, very stable, very reliable right now in that kind of mid single-digits. And then if we get some good weather on top of that, that benefits us, we get that benefit. But otherwise, we continue to run very reliably and consistently in that mid single-digit comps. The exciting thing though is, with those types of events, consistent with this storm is it introduces Tractor Supply as a needs-based business to other new customers. And that's what we do as we capitalize on that, we see it as part of our opportunity in 2023 as new footsteps into the business. So we do very well at managing whether that be the product cost or the transportation to be able to manage as those flow through and balance between the competitive retail price that we have, gaining market share and how much we actually take to the bottom line. Specifically, the biggest item in the gross margin benefit in 2023 is the easing of the transportation cost. And as you look back even over the last two years, on our gross margin, we've been very specific as we've been able to find offsets or pass through some of those the transportation cost has been the primary one where we've absorbed some of that. And so we will â\u0080\u0093 as those prices abate and ease through, it's a key contributor to how we expect to see gross margin expansion throughout 2023. If you could speak to â\u0080\u0093 if you can, maybe the price benefit there or what's happening with the basket and the market share seems to be staggering because I don't think some of the items in that category are growing that fast. So kind of high single-digits, generally speaking, across food and speed, but our market share is on a dollar basis, weâ\u0080\u0099re running 2x the market. And on a pound basis, weâ\u0080\u0099re running 3x the market in growth. And so itâ\u0080\u0099s â\u0080\u0093 the majority of our growth there well over half is transactions-based, unit-based and share gain. And I would say it is pulling through to the rest of our business, in terms of driving positive footsteps and transactions into our store. In fact, this was the lowest year-over-year in our UPT decline in 2022. And when you look at the customer â\u0080\u0093 underlying customer cohorts in our Neighborâ\u0080\u0099s Club program, what youâ\u0080\u0099re seeing and as was mentioned in the prepared remarks is that the millennials have moved out to kind of rural America and kind of that Sunbelt migration, they start in poultry and pet food with us and then very quickly are migrating into four to five other categories in terms of us being their destination. And so Iâ\u0080\u0099d say weâ\u0080\u0099re seeing strong growth, its market share gains in C.U.E. We are the lowest cost to serve in the market, the fastest supply chain, the lowest price is the best customer service. And when they get in there, should they shop the whole lifestyle, and weâ\u0080\u0099re seeing that in our average ticket and also in our on customer data. The first question in regards to cadence throughout the quarter, as I mentioned in my prepared remarks, the â\u0080\u0093 all four quarters really would expect to be in line with our overall guidance. I would encourage you, as you reflect back on last year, as we talked about some of the headwinds we saw in the middle parts of the year, with the late start to the spring, the drought that impacted Q2 and Q3. We talked about how in those quarters, there were some headwinds that took some of the top side off of the comps in those quarters. Well, of course, we always prioritize market share gains competitive in pricing. As thereâ\u0080\u0099s opportunities as prices decline, we will take some opportunity modest as we see it in our plan, opportunity to invest in the gross margin. And Kurt, just to clarify, the calendar shift wonâ\u0080\u0099t be as pronounced as 2016 is what it sounds like. As you think about what you saw in the fourth quarter, youâ\u0080\u0099re hearing a lot of retailers talk about a very late Christmas season. And then similarly, if you look at the data around pet inflation thatâ\u0080\u0099s been very strong, but it does seem like thereâ\u0080\u0099s some unit degradation and some sort of sacrifice same streets and the accessory business. As I said and Kurt, absent the storm, we were still at the high end of our comp expectations and we would have still had positive comp transactions for the quarter regardless of the storm. And then in the last week of right before Christmas, for us, when we have a winter storm like that, it drives more footsteps into our stores, and they end up shopping the entire lifestyle when theyâ\u0080\u0099re in there. It was a solid, very solid close to the year for us on both, as I said, not only just on demand-driven store-related items. And then on pet, we are seeing unit growth and double-digit comps across all categories in pet, whether itâ\u0080\u0099s dog, whether itâ\u0080\u0099s cat, whether itâ\u0080\u0099s hard goods, whether itâ\u0080\u0099s consumables, whether itâ\u0080\u0099s food, whether itâ\u0080\u0099s sundries or accessories. Certainly, the food is outpacing the other categories, but all categories in our pet business are seeing very strong growth. So weâ\u0080\u0099ve hit the top of the hour, but weâ\u0080\u0099ll let the call go just a few minutes longer because our prepared remarks were longer. So you mentioned, I think, during the prepared remarks, retention rates right among the high-value customers. I was curious if you could expand on retention, repeat behavior sort of in aggregate across the member cohorts as a whole and whether youâ\u0080\u0099re seeing a difference in behaviors right, between those members acquired over the past three years versus those members acquired 2019 earlier. What weâ\u0080\u0099ve seen is the customers, as you mentioned, I said in my prepared remarks, that weâ\u0080\u0099ve had tens of millions of new customers shop us in the last three years. That cohort is basically shopping us, and weâ\u0080\u0099re seeing purchase frequency, average ticket, number of categories shop total spend in the year, very much in line with our kind of long-time core customers. And thatâ\u0080\u0099s why when we say things like our Neighborâ\u0080\u0099s Club is outperforming our overall comp, our total company comp, even at 75% penetration. And even with the growth weâ\u0080\u0099ve had, thatâ\u0080\u0099s why I think itâ\u0080\u0099s so exceptional because historically, in my past, as you see your membership program becomes such a large portion of your sales is a tendency revert to the mean, right, revert your overall comp. Peter, your line is now open. One thing that weâ\u0080\u0099re hearing in the channel right now, and itâ\u0080\u0099s kind of a funny dynamic for Farm and Ranch, but that the chicken category is on fire. Yes, when we look ahead to this next year, we are incredibly excited about our poultry business. And just to go back to some of Halâ\u0080\u0099s comments earlier, I would just say even in Q4 for us, poultry was a primary driver. We have â\u0080\u0093 unlike some maybe commentary youâ\u0080\u0099ve heard elsewhere, we have not seen the entire year over the course of the last three years, any slowdown in our poultry business. And when we look ahead to this year, we think it could be another record year for us. And when you couple those things with our pet business, you couple those with our live goods business, all the sustainability things that customers are looking for right now is theyâ\u0080\u0099re looking to find value, to grow those things on their own. So we definitely agree with the commentary youâ\u0080\u0099re hearing out there, and we think weâ\u0080\u0099re in a position to continue to take market share in this category. Peter, your line is now open. I just wanted to ask a question around CapEx, came in above the forecast this past year. And then as you step back, CapEx is running around 5% of sales in the last couple of years. Historically, you guys used to run around 3% of sales. In regards to CapEx and your two questions, the growth in CapEx in 2022 at the high end of our expectations reflected a couple of things. Certainly, thereâ\u0080\u0099s inflation in the cost of building a distribution center, the new stores, et cetera, that was a piece of it. But also in this environment, the team has done an excellent job of ramping up and ensuring that all of the pieces that go into these fusion remodels that weâ\u0080\u0099ve got the fixtures and all of the equipment ready to go. Weâ\u0080\u0099ve got a construction of a complete new distribution center in Maumelle, Arkansas. So for both years, they absorbed the $150 million-ish cost of some of our largest distribution centers in those years. And that leads to the second question that you had going forward, we really believe that as we said, these would be the two peak years that the biggest investment over the other years is really on the supply chain side. And itâ\u0080\u0099s reverting back more to that over the next few years, $600 million, $650 million in capital going forward. And itâ\u0080\u0099s a very planned, purposeful five-year growth to convert the supply chain and the stores into the new Life Out Here strategy, look and shopping experience for our customers. Thanks, everyone, for joining us, and we look forward to speaking to you on our first quarter earnings call in April."
}