{
    "symbol": "IMOS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 21:49:05",
    "content": " Q4 gross margin came in at 14.5%, decreased 100 basis points compared to Q3 and decreased 560 basis points for 2022 to 20.9% compared to 2021 with net earnings of TWD 0.22 in Q4 or TWD 4.64 for 2022. 4Q '22 gross profit was TWD 680 million, with gross margin at 14.5% compared to 15.5% in 3Q '22. Our operating expenses in 4Q '22 were TWD 417 million or 8.9% of total revenue, which is about 8.6% lower compared to 3Q '22. Operating profit for 4Q '22 was TWD 310 million, with operating profit margin at 6.6%, which is about a 1.0 ppt decrease compared to 3Q '22. The difference is mainly due to an increase of net non-operating expenses of TWD 533 million, a lower operating profit of TWD 87 million and partially offset by the decrease of income tax expense of TWD 103 million. Net non-operating expenses of TWD 130 million in 4Q '22 compared to net non-operating income of TWD 319 million in 4Q '21, which increased TWD 449 million. The difference is mainly due to a lower share of profit of associates accounted for using equity method of TWD 291 million, an increase of the foreign exchange losses of TWD 206 million and partially offset by the increase of interest income of TWD 35 million and gain on valuation of financial assets at fair value through profit or loss of TWD 14 million. The difference is mainly due to a decrease of operating profit of TWD 1,025 million, an increase of the net non-operating expenses of TWD 449 million and partially offset by the decrease of income tax expense of TWD 212 million. Total revenue for 2022 was TWD 23,517 million, which decreased 14.2% compared to 2021. Our operating expenses in 2022 were TWD 1,825 million, which was up 0.4% compared to 2021. The difference mainly due to an increase of the foreign exchange gains of TWD 537 million and interest income of TWD 47 million and partially offset by the decrease of share of profit of associates accounted for using equity method of TWD 172 million, an increase of loss on valuation of financial assets at fair value through profit or loss of TWD 85 million. Net profit in 2022 was TWD 3,372 million, which decreased 33.3% compared to 2021. The difference due to a decrease of the operating profit of TWD 2,346 million and partially offset by the increase of net non-operating income of TWD 338 million and a decrease of income tax expense of TWD 321 million. The difference is mainly due to a decrease of operating profit of TWD 2,346 million, and the increase of cash dividend paid of TWD 1,527 million and partially offset by the decrease of CapEx of TWD 1,634 million."
}