{
    "symbol": "OZK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-21 16:50:05",
    "content": " I guess maybe if we could start with the repayments seen this quarter, obviously, down about $1 billion quarter-over-quarter and I know that can be somewhat episodic and hard to predict but I took the commentary in the management comments is somewhat of a positive that you donâ\u0080\u0099t think it will necessarily be the highest year on record. I think our view is that deposit cost as Cindy said, will rise faster in the current quarter and may ultimately rise faster than loan yields toward the end of the Fed tightening cycle, all as we've said for a couple of quarters in the comments. And this quarter was a strong growth quarter on top of 3 previous strong growth quarters in that unfunded number with a little abatement and paydowns, we're beginning to see that translate into funded balance growth and prospects for meaningful loan growth in '23 and '24 look very good and we're -- I think that was the highlight of the quarter. And so while -- and honestly, week-to-week in these pipeline calls -- 1 week, I'll be like, wow, it's just going to keep dropping off and then the next pipeline call we have, we've -- the guys have pulled in more attractive opportunities that have just sort of reached that stage where they're ready to move forward. Now I'm talking 3 and 4 years out and, Tim, gets nervous when I talked 3 and 4 years out because lots of things can change but that is our strategic plan on how we're going to handle that next wave of RESG repayments as have these other diversified business units continue to grow as they have done this year and contribute more and more to growth going forward. If you really went back to our comments back in our January call, we've been saying that all year that we thought depending on the pace of hiring that we would continue to increase our noninterest expense several million dollars a quarter for the near term. And then just lastly, as we think about the allowance level for the funded RESG balances to start kind of growing in the next couple of years, it looks at the reserve on the unfunded loans is a little bit lower than what the total reserve is on kind of a reported basis."
}