{
    "symbol": "SEAS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 15:40:07",
    "content": " Overall, we are proud to report record net income for fiscal 2022 of $291.2 million and record adjusted EBITDA of $728.2 million, which was achieved with attendance of 21.9 million guests which, as I mentioned, is still below our 2019 attendance and well below our historical high of over 25 million guests we achieved in 2008. During the fourth quarter, we generated record total revenue of $390.5 million, an increase of $19.7 million or 5.3% when compared to the fourth quarter of 2021. Our pricing and product strategies continue to drive higher realized pricing, resulting in record total revenue per capita in the quarter of $79.10 compared to $74.87 in the fourth quarter of 2021. The increase in operating expenses is primarily due to increased labor-related and other operating costs driven by increased operating days and expanded and/or enhanced events, along with unusually high inflationary pressures partially offset by structural cost savings initiatives when compared to the fourth quarter of 2021. We believe that approximately $10 million to $15 million of cost in the fourth quarter compared to 2019 are temporary, unusual inflation-driven costs that we expect to moderate in the coming quarters. We generated net income of $49 million for the fourth quarter, the second highest ever for the fourth quarter compared to a net income of $71.5 million in the fourth quarter of 2021, which included a favorable tax benefit and we generated record adjusted EBITDA of $153.7 million, an increase of $0.9 million when compared to the fourth quarter of 2021. The improvement in adjusted EBITDA for the fourth quarter of 2022 was primarily driven by an increase in total revenue per capita, partially offset by an increase in expenses when compared to the fourth quarter of 2021. Fiscal 2022 total revenue per capita was a record $78.91 compared to $74.43 in 2021, a 6.0% increase driven by an increase in admissions per capita and in-park per capita spending. Operating expenses increased by $113.3 million or 18.2% when compared to 2021, primarily from an increase in labor-related costs and other operating costs due to a return to more normalized operations and an increase in attendance. Selling, general and administrative expenses increased by $15.2 million or 8.2% when compared to 2021, primarily due to increased market-related costs and increased third-party consulting costs partially offset by a decrease in noncash equity compensation expense and the impact of cost savings and efficiency initiatives. Our current deferred revenue balance at the end of the fourth quarter was $169.5 million, an increase of approximately 9.5% when compared to December of 2021, which included the impact of some COVID-19-related product extensions and onetime items. In light of our significant free cash flow generation over the past several months as we went through our planning process for 2023, we spent considerable time reviewing opportunities to deploy in  high-confidence ROI capital across our parks that would drive increased revenue, decreased costs and our meaningfully improved guest experience. In 2019 and 2022, we averaged approximately $150 million per year on core CapEx and that includes investing meaningfully in new rides, attractions, events and venues to have something new and compelling in our parks each year. And I guess, just based on your current per cap levels, is the right way to think about this was the -- that impact was probably somewhere between, let's call it, $7 million and $8 million hit to EBITDA."
}