{
    "symbol": "CLSD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 16:41:04",
    "content": " Of course in previously treated patients we don't expect improvement, so I think having a stable BCVA, having stable CST is very meaningful and you know that has been a primary endpoint for some durability trials for new agents or new delivery system that FDA has approved. Now comes the fact that, how can we help them with this new MOA and suprachoroidal delivery, and seeing that effect after aflibercept at screening and then seeing the effect after CLS-AX is clearly convincing to me as a physician that we are seeing biological activity, and you know there's no question that this molecule is helping patients. So in terms of the question from Andreas about patient population, where this will be utilized, I think as Tom you said, we are still learning about the durability and gathering data, but I think looking at it, clearly the stable patients on current treatment can go longer with you know this molecule. So I think taking these patients to longer treatment interval, Tom you have done a lot of work about real world data and published extensively that even if patients are getting injections you know every two months or so, if they don't come to our clinic and their vision is worse over time. And if you look actually on their prescribing information, you can see the Visual Acuity curves and what you'll notice is that, the Visual Acuity improves rapidly in treatment naive patients who undergo this initial induction phase and the Visual Acuity improvement is somewhere in the order of you know depending on the trial and the therapy, but somewhere in the order of eight to 10 letters on average. In fact for the BCVA curve when we exclude data after additional therapy that month six time point really only consists of three patients and I think, you can look at the subject level curves yourself, but I think it's driven by one patient. I think most retina specials will extend by two weeks at a time, and then you know in subsequent visits if a fluid starts to recur or the vision starts to drop, they'll then contract by two weeks and there are patients who have kind of a - almost a personalized integral where they can go and it's very hard to get patients beyond two months with current agents. I think these are high need patients as we discuss and what happens is if you are in an early stage study and you give the treatment and the patient still has fluid, your expectation was, well, maybe the treatment is not working and then you try to give him an off protocol treatment just nervous that it's going to get worse. So you know as I said, I always am conservative in terms of looking at things and I always thought that TKIs are probably best fit for very stable patients receiving injections every two or three months and maybe if we can go to six months, that would be meaningful."
}