{
    "symbol": "CLSD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 14:47:05",
    "content": " Good morning, everyone, and thank you for joining us on the call today. Before we begin, I would like to remind you that during today's call, we will be making certain forward-looking statements. Various remarks that we make during this call about the company's future expectations, plans and prospects constitute forward-looking statements for purposes of the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in the Risk Factors section of our annual report on Form 10-K for the year ended December 31, 2021, and our other SEC filings available on our website. In addition, any forward-looking statements represent our views as of today and should not be relied upon as representing our views as of any subsequent date. While we may elect to update these forward-looking statements in the future, we specifically disclaim any obligation to do so even if our views change. On today's call, we have George Lasezkay, our Chief Executive Officer; Dr. Thomas Ciulla, our Chief Medical Officer and Chief Development Officer; and Charlie Deignan, our Chief Financial Officer. Over the last 3 months, we've made significant progress on multiple fronts. With the approval of XIPERE, the advancement of CLS-AX and broader use of our SCS Microinjector with select partners, we've created a new paradigm in retinal drug delivery. On the clinical operations side, we achieved a significant milestone by successfully completing dosing in OASIS, our CLS-AX Phase I/IIa clinical trial. CLS-AX combines the pan-VEGF inhibition from the highly potent TKI, axitinib, with targeted delivery to the affected chorioretinal tissues, utilizing our proprietary SCS Microinjector. In May, we announced that we were able to accelerate initiation of Cohort 4 as a result of the positive safety data reviewed by the Safety Monitoring Committee. To further assist our planned clinical activities for CLS-AX, we announced in June the appointment of Susan Coultas as our Chief Clinical Officer. Tom, as Chief Medical Officer and Chief Development Officer, continues to have overall management responsibility for the Clearside product pipeline and clinical development strategy, including all clinical trial design. Yesterday, we announced that we entered into a royalty interest purchase and sale agreement with HealthCare Royalty Partners primarily to support the funding of our planned CLS-AX Phase II clinical trial. This transaction was achievable because of the successful U.S. FDA approval of our first commercial product, XIPERE, and the subsequent commercial launch of the product by our partner, Bausch + Lomb. If it is, this will position us to initiate activities by the end of this year for our Phase II trial and enable us to begin enrolling patients soon thereafter. Starting with our lead program, CLS-AX, I'm thrilled to discuss the tremendous progress we made over the last 3 months as we completed enrollment in OASIS. With the growing awareness of suprachoroidal delivery and increased interest in our trial, we were able to complete enrollment of OASIS with a total of 27 patients. Last month, we completed dosing in Cohorts 3 and 4 of OASIS with 8 patients in each arm. I'm extremely grateful to the investors -- to the investigators, patients and our team whose time and commitment made this possible. As a reminder, OASIS is the first-in-human safety study. There is also an ongoing extension study to follow patients in Cohorts 2, 3 and 4 for up to 3 additional months after completion of OASIS. We look forward to presenting the individual patient safety and tolerability data from both Cohort 3 and 4 as well as the complete analysis from all 4 dosing cohorts in November, as this will facilitate our selection of the most appropriate dosing protocol for our Phase II trial. Arctic Vision, our XIPERE commercialization partner in Asia has 2 clinical programs ongoing. In June, Aura Biosciences delivered a presentation at the International Society of Ocular Oncology on their Phase II trial investigating AU-011, a virus-like drug conjugate delivered via our SCS Microinjector for the treatment of choroidal melanoma. REGENXBIO has also progressed RGX-314, an investigational onetime gene therapy that utilizes REGENXBIO's proprietary NAV AAVIATE vector to deliver a gene encoding a therapeutic antibody fragment to inhibit VEGF. Last month, at the Annual Meeting for the American Society of Retina Specialists, it was quite humbling to realize all that we have accomplished with our novel suprachoroidal delivery approach. Our commercial partner, Bausch + Lomb, has a strong presence, featuring their commercial launch of XIPERE, which recently received its permanent J Code. At ASRS, their team provided valuable clinical insights on the product as well as on its novel use of the suprachoroidal space to help treat patients with macular edema associated with uveitis. With 4 agents in 6 clinical trials, the conversation around delivery of drugs into the suprachoroidal space was absolutely extraordinary. In addition to ASRS, we also had a strong presence at the OIS Retina Innovation Summit and at ARVO 2022 in ASCRS Annual Meetings. Also, awareness of suprachoroidal delivery is expanding in Asia with support from Arctic Vision, our partner. Arctic Vision will have presentations at the triple meeting of the World Ophthalmology Congress, the Chinese Ophthalmological Society and the Asia-Pacific Academy of Ophthalmology as well as the Congress of the Asia-Pacific Vitreo-Retina Society. To support our outreach and education to the physician community, 3 papers were published last quarter in peer-reviewed MEDLINE-indexed journals to support XIPERE in the attributes of suprachoroidal delivery. We're also pleased that the well-known comprehensive retinal care journal, Retinal Physician, published a special edition entitled Suprachoroidal Drug Delivery Technology. There are 6 articles that cover a summary of SCS delivery, biomechanics of SCS injector, flow mechanics of the injectate, the clinical trials leading to the approval of XIPERE to treat uveitic macular edema and potential uses in gene therapy in ocular oncology. With that, I'll now turn the call over to our CFO, Charlie Deignan, to review our financial results. As George mentioned, yesterday, we announced that we entered into a royalty financing agreement with HealthCare Royalty Partners. In total, we may receive up to $65 million, all of which is non-dilutive funding to Clearside. We will receive an upfront cash payment this month of $32.5 million, less certain expenses. An additional $12.5 million will also be deposited in an escrow account this month to be released to us upon attainment of a prespecified sales milestone for XIPERE by March 31, 2024. In exchange, HealthCare Royalty will receive royalties and milestone payments due to Clearside from XIPERE from certain SCS Microinjector license agreements. This includes payments from our current partnerships with Bausch + Lomb, Arctic Vision, REGENXBIO and Aura Biosciences. Importantly, the arrangement with HealthCare Royalty specifically excludes all of our internally developed assets and programs, including CLS-AX as well as any future in-licensed assets. If certain parameters are not met by the end of 2024, this cap will be increased to 3.4x the total payments made by HealthCare Royalty. Due to confidentiality agreements with our existing partners, we will not be publicly disclosing the sales milestones or other thresholds considered in this agreement. Our cash and cash equivalents as of June 30, 2022, totaled $29 million. Once we determine our Phase II clinical trial plans for CLS-AX, we will be able to fine-tune our runway guidance. We are building significant momentum, leveraging our proprietary suprachoroidal space platform technology, featuring our SCS Microinjector. As a result, we were able to improve our financial resources, expand our management team, and we have multiple anticipated catalysts related to both our internal CLS-AX clinical trial and the clinical programs from our development and commercialization partners. We remain focused on both developing our own internal pipeline and partnering with other companies with strong interest in retinal diseases, where it makes strategic sense for Clearside. As I conclude our formal remarks, I'd like to reiterate what Tom said and express my appreciation to our staff, our investigators and especially to the patients who participated in our OASIS trial. And then secondly, for CLS-AX, some of the KOLs that have commented on competing next-gen products that are extended duration envision using these 10 VEGF as maintenance therapy after the patient has been stabilized on VEGF. Tom -- between Tom and Charlie, do you want to address the Bausch activities with XIPERE. All I could say is Bausch, although they didn't give sales numbers on XIPERE, CEO, Joe Papa, was very positive about his KOL interactions at conferences and it appears to be a lot of excitement around the product. As we discussed earlier, Bausch + Lomb plans to train all the U.S. retina physicians as well as all U.S. uveitis physicians. I've received so many unsolicited e-mails from retina specialists around the country congratulating Clearside, complimenting the training program, and I think it's gone really well. You might want to address the second part of that question, which was a pan-VEGF activity of the tyrosine kinase inhibitors and use in maintenance and our view on duration and use and maintenance. In terms of the small molecule tyrosine kinase inhibitors, as I think the retina community is becoming more and more aware, even for newly approved therapies, especially for the office-based therapies, durability remains limited. And what we found is that small molecule suspensions in the suprachoroidal space have prolonged durability, and we've noted that in our preclinical studies. I think the question mentioned that we're shooting for 3-month durability, but that's not necessarily the case. Our trial is a 3-month trial, but we also have an extension trial for a total of 6 months of follow up. In terms of these therapies, what we feel is potentially very important is safety because as we've seen with biologics and gene therapies, safety has been a concern. There were no study suspension stopping rules, no signs of inflammation, no signs of intravitreal dispersion of the drug or any intraocular pressure safety signals. And as we escalate these higher doses in Cohorts 3 and 4, we think that the pan-VEGF inhibitory attributes of axitinib, coupled with its high potency, coupled with the suprachoroidal targeted delivery to effective chorioretinal tissues has potential for not only durability, but significant efficacy. So we'll be looking at all the data very holistically in terms of retreatment, visual acuity and anatomic signs. So they're not unreasonable milestones, but I can't really comment or place guarantees on it. And our focus is really moving that into the clinic, if the OASIS data is supportive, moving that further into the clinic in Phase II. As to the other opportunities we have, we have several opportunities to add to our pipeline, and we're currently looking at a prioritization of those opportunities to see what makes the most sense where it makes -- where we can create the most value. For us as an internal pipeline, and that doesn't count the interest that we have from several companies to use our suprachoroidal injection platform with their technology. So we have a number of conversations and projects ongoing that we will, over the next several months, prioritize and make some decisions on what we can move forward and where it creates the most value. So as I mentioned earlier, our first priority in this initial first-in-man OASIS study remains safety. And as I mentioned earlier, safety is really important these days in retina because we've seen some other therapies have problems with inflammation. So number one, it's a safety study. So we're looking at stability based on best  visual acuity on some anatomic parameters, including  geography and OCT as well as need for retreatment. And as I mentioned earlier, that was borne out in Cohorts 1 and 2. We can couple that with the ability to target very high levels  suprachoroidal delivery, and we think that further leverage the benefits of pan-VEGF inhibition. And then finally, we're looking for durability, and we've seen some impressive durability in our preclinical studies. We published a paper last year, showing in our rabbit pharmacokinetic model that there are levels in the retina and in the RPE and choroid out to 6 months that were several log orders higher than the IC50 for the VEGF receptor 2. So in summary, we're looking for safety primarily, but we're also hoping to see holistic signs of efficacy based on BCVA, anatomic parameters and retreatment as well as durability. We -- in the current trial, as in many first-in-man trials, oftentimes, you'll have treatment experience applications. But these are highly treatment-experienced patients, and we set a high bar for ourselves because we're requiring that have active disease at screening, and that's confirmed by an independent reading center. So we're setting a high bar, but again, the study is geared towards safety. Going forward, as we learn more and more about suprachoroidal axitinib, we don't feel compelled to follow that exact set of eligibility criteria. But at least for this study by requiring patients to have active disease, we have a better potential to assess for biologic effect than if we had patients in the trial with inactive disease. I was just curious if you could give us maybe share your experience of repeated dosing in  animals, maybe providing a little extra color on the PK profile local immune response, et cetera. Well, Tom, that would be your question, but I think in the past, we've been somewhat careful about what we say in terms of our internal preclinical safety and repeat safety dosing. Obviously, as we move forward, we'll study repeat dosing. And we have preclinical studies, including GLP tox studies that will support the repeat dosing we plan to use. So in summary, the safety profile in humans with the single dose has been robust and pristine. And we expect and hope that it will continue to be safe because as I said, it's a small molecule with less propensity of inflammation. You've got -- you're obviously reading out Cohort 3, Cohort 4 later this year in November. Our preclinical study suggested that we would have different levels, but we decided not to do the extension study for Cohort 1. We did include the extension studies for Cohorts 2, 3 and 4. We'll report out extension data from Cohort 2 in November, along with the 3-month data from Cohorts 3 and 4. No, I believe just general color on what we may be expecting in November. On average, in Cohorts 1 and 2, patients had in the mid-20s of prior injections, I believe, the mean number of injections in the year prior was 9. We'll be looking at anatomic effects based on OCT and angiography, we'll be looking at visual acuity. And we think that by starting with this higher bar of active patients at screening, we have potential to assess for a biologic effect. We'll include best corrected visual acuity, central subfield thickness, retreatment, and we'll also -- because we'll be analyzing all 4 cohorts, may provide some additional color with respect to the OCT parameters as well as angiographic parameters."
}