{
    "symbol": "CLSD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 21:11:06",
    "content": " Before we begin, I would like to remind you that during today's call, we will be making certain forward-looking statements. Various remarks that we make during this call about the Company's future expectations, plans and prospects, constitute forward-looking statements for purposes of the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in the Risk Factors section of our annual report on Form 10-K for the year ended December 31, 2021, and our other SEC filings available on our website. While we may elect to update these forward-looking statements in the future, we specifically disclaim any obligation to do so even if our views change. On today's call, we have George Lasezkay, our Chief Executive Officer; Dr. Thomas Ciulla, our Chief Medical Officer and Chief Development Officer; and Charlie Deignan, our Chief Financial Officer. In March we were pleased that Bausch + Lomb announced their U.S. launch of XIPERE in the United States as the first therapy approved for macular edema associated with uveitis, a potentially blinding. Ahead of the official launch, Bausch worked closely with 100s of retinal specialists throughout the country, to train them on the use of our SCS Microinjector and to build interest in using XIPERE to treat the uvitic macular edema patients. Our China based development and commercialization partner, Arctic Vision also continues to progress in its development of XIPERE, which they refer to as ARVN001 and the brand name Arcadis. They are currently enrolling two trials in China, a confirmatory Phase 3 trial in macular edema associated with uveitis and a Phase 1 clinical trial for the treatment of diabetic macular edema. The approval of XIPERE in the U.S. validates delivery into the suprachoroidal space by our proprietary SCS Microinjector, and supports our strategy to focus on small molecule suspensions. Our lead internal suprachoroidal pipeline product candidate, CLS-AX combines our proprietary small molecule suspension of the tyrosine kinase inhibitor axitinib with delivery by our SCS Microinjector. As Tom will discuss in more detail, we continue to make progress on our Phase 1/2a OASIS clinical trial targeting patients with wet AMD. OASIS is a single-dose escalating study to explore the safety and tolerability from 30 micrograms to 1 milligram, which is an over 30-fold range of doses. Our Safety Monitoring Committee reviewed one month initial safety data from cohort 3, and we are pleased to report that there were no dose limiting toxicities observed at the 0.5 milligram dose. As a result, we are now enrolling patients in cohort 4 at a higher dose of 1 milligram, while simultaneously continuing our cohort 3 enrollment. This expanded enrollment of cohort 3, and the addition of cohort 4 will allow us to collect more CLS-AX patient data in order to help guide our selection of the most appropriate dosing Protocol for our planned Phase 2b clinical trial. This will allow us to report a more comprehensive set of patient data, as we will be able to include the complete analysis from all four dosing cohorts of the OASIS trial, in addition to the detailed individual patient data from the final two cohorts. I will now turn the call over to Dr. Tom Ciulla Tula, our Chief Medical Officer and Chief Development Officer to discuss our research and development update. For my segment of today's call, I'm going to focus primarily on our progress with CLS-AX and on our OASIS clinical trial, and highlight the programs by our development partners. As a reminder, CLS-AX is our proprietary suspension of axitinib for suprachoroidal injection, and is currently being studied for the treatment of patients with wet AMD. First, axitinib is a tyrosine kinase inhibitor with broad VEGF blockade that we believe may have efficacy advantages over existing VEGF focused therapies due to its high potency and pan VEGF inhibition. Second, delivery via our office based SCS Microinjector expands the suprachoroidal space circumferentially and posteriorly to deliver drugs directly to the macula. In a way since the primary endpoints were met in cohorts 1 and 2, CLS-AX was well tolerated with no serious adverse events. There were no treatment emergent adverse events related to aflibercept, CLS-AX with a suprachoroidal injection procedure, and there was no dispersion of drug into the vitreous. As George mentioned, we announced today that our Safety Monitoring Committee reviewed one month initial safety data from cohort 3. As a result, we are now enrolling patients in cohort 4 at the higher dose of 1 milligram, which is double the cohort 3 dose simultaneously, we're continuing our cohort 3 enrollment, and we are targeting up to 25 patients in total, from all four OASIS cohorts. This will allow us to report a more comprehensive set of patient data, as we'll be able to include the complete analysis from all four dosing cohorts of the OASIS trial in addition to the detailed individual patient data from the final two cohorts. Unlike similar trials ongoing in the wet AMD space, particularly those assessing TKIs, we are only enrolling highly treatment experienced patients with active disease, verified by the independent rating center. Although these persistently active cases represent more difficult to treat patients, we believe that by including only patients with persistent active disc disease, despite prior anti-VEGF therapy, we can better assess biologic effect of CLS-AX. Importantly, this will facilitate dosing selection, and help de-risk our latest stage clinical trials for CLS-AX. Now the OASIS progresses, we are simultaneously in the initial planning stages for our Phase 2b clinical trial. As a reminder, last msonth REGENXBIO presented positive interim data from the ALTITUDE trial. As the patient's dose of RGX-314 in cohort 1 47% demonstrated a two-step or greater improvement from baseline on the ETDRS diabetic retinopathy severity scale at six months, compared to 0% in the observational control group. The continued progress by REGENXBIO was very encouraging, and we look forward to their ongoing clinical trial results. Over the past two months, we've been very active at medical meetings, including presentations at Sonoma Eye, the Buckle Society, the wet AMD and DME drug development summit, ASCRS, and of course, ARVO last week. Viral Kansara presented an overview of our preclinical data, highlighting the targeting compartmentalization and durability of suprachoroidal injected small molecule suspensions, demonstrating the versatility of our technology platform. As George mentioned, Bausch + Lomb is also very active at these meetings with several data presentations on XIPERE. And at the upcoming Retina World Congress, their presentations will focus on specifics around the XIPERE Phase 3 PEACHTREE trial. Tomorrow, I look forward to joining several of my retina physicians colleagues, to speak on a panel entitled New Pathways in Retinal Diseases at the Retina World Congress. We reported in March, XIPERE's approval provided significant non-diluted funding for Clearside. As a reminder, for our room without us we do not receive any revenue for the first $45 million in product sales. Our cash and cash equivalents as of March 31, 2022, were approximately $34 million. We continue to be involved within the investment community, and we look forward to participating in the upcoming GMP Healthcare Conference next month and keeping abreast of our progress. With the FDA approval of XIPERE last year, and the use of our SCS injection technology platform in six ongoing suprachoroidal clinical trials. This will position us to gear up the Phase 2b trial by the end of this year, and enable us to begin enrolling patients soon thereafter. Tom, I think that's directed to you. Well, as you know, our first priority in this Phase 1/2a study remains safety. As you know, axitinib is a well established small molecule and we don't expect inflammation based on our preclinical studies, as well as the fact that it's not a biologic. And so far, as we reported in cohorts 1 and 2, there's been a very robust safety profile. And this allows us to continue to escalate, as we've announced up to 1 milligram in cohort 4. As we've discussed in prior calls, it certainly has already been shown by independent labs to successfully inhibit corneal, retinal and choroidal angiogenesis in a variety of animal models, all published from a variety of labs. And so basically, leveraging its highly potent pan VEGF  effect, with our Microinjector to achieve very high immediate target level in the chorioretinal tissues while minimizing exposure to the front of the eye. So in essence, we are enrolling those difficult to treat refractory cases and this sets a little bit of a higher bar, but also allows us to assess for these biologic signals and make a better informed choice of dose in our upcoming Phase 2b trial. I know you guys are doing a lot of things simultaneously, you're presenting at conferences, Bausch is training folks all across the country. So I suppose, you can just comment on the plethora of activities that you think are kind of driving this growing interest in the CLS-AX program. So with respect to your first question, whether this is primarily going to be used in treatment naive patients who aren’t treatment experienced patients, we're still working that out. It has potential to be used in both populations, but we're going to, we're still working out the best approach. However, it also could potentially be used as primary monotherapy in the future and again we're working that out. Also REGENXBIO has reported some very encouraging results in both of their Phase 2 studies which has attracted a further interest especially because it's a gene therapy, which always attracts interest. Aura  has gone public, and there's a lot of interest in their Phase 2 trial using our SCS Microinjector to treat choroidal melanoma which is a most common intraocular malignancy in adults and that historically has had not very good treatment with radiation therapy. And then finally, as you mentioned, we've been very active at a variety of retina congresses, and also in publications, which has furthered the interest. Just wondering about what data we're going to get in the fourth quarter, I'm guessing it might be six-month follow up from cohort 3 and three months from cohort 4. As we discussed in our prepared remarks, we are enrolling cohorts, 3 and 4 simultaneously. At the same time, along with the totality of the data, including cohorts, 1 and 2. In terms of informing our Phase 2b study, we will have the three-month data from each of the cohorts which will help inform and we'll have some of the extension data. And basically, you can think of the suprachoroidal space as nature's drug depot. And so it should provide more durability, and then also has potential to provide more efficacy, although it's not an efficacy study, we have a higher likelihood of seeing a biologic effect. And then with respect to safety, and of course this is a safety study, so the primary goal here, as I mentioned, we've had a very robust safety profile so far. Our preclinical studies support this dose and again, since this is a small molecule and not a biologic, and a small molecule that's been well characterized. That's been, they've been doing a slow rollout on this, so we think that their approach, it makes perfect sense. They've got this multi step approach to training and rolling it out, getting people used to the product, getting people used to using the product. What we don't know is we have no insight into their forecasts, so it's very hard to answer the question that you asked about the $45 million cumulative sales. So we're still working through the accounting of that, but it mostly likely we'll receive what we will receive reports 60 days after the end of the quarter. So the question is, do we put an estimate in or use a quarter in arrears, but we're still working through that accounting. And then secondly, there's been a change here in how you intend to report the data. And since we are, since they assessed only the one month safety data, we decided to continue to advance and progress the program as fast as possible. And so, since there's only a small gap between the end of cohort 3 and cohort 4, we thought it was prudent to report all the data at once. I had mentioned on other calls that while partnering is not the lead concept in our strategy, we do have chats with a number of companies that are interested in potentially collaborating and that really focuses on the approach of gene therapy into the -- delivering gene therapy into the suprachoroidal space in areas not otherwise covered by the REGENXBIO agreement. It has sparked additional interest now that they've seen the injector system that's part of XIPERE is approved and that physicians, a wide variety of physicians are being trained. And I realized that that's how often people go in to see their retinal specialists, but the development market is pushing for six months or longer now. So, you know, as we continue to escalate the dose, we would naturally expect additional durability. I think that there is interest in much longer duration, six months and longer. I think for the vast majority of what's approved and what's in development, that's a bit aspirational. And so, it's possible that we may see more than that, and certainly, we're going to assess for that in our extension study. And with respect to efficacy, as you touched upon with the pan VEGF effect, we may actually have additional efficacy over a focused VEGF inhibitory strategy, and certainly, with the suprachoroidal injection platform, we can achieve very high levels in the targeted chorioretinal tissues very rapidly, and that may further leverage the sandwich effect to enhance efficacy. These patients, as I mentioned, are all patients who have been treated in the past and they have persistent active disease based on independent reading center. And I just want to be cautious about putting guidance out there that we're going to see better efficacy in this in very small, first in man, single dose escalating trial, but certainly we're going to assess for all this and look for those signals. I think when it comes to suprachoroidal delivery, obviously the first in class, best in class, we've been very, very active in all of the retina congresses for the last four years. I think last year we had over 35 presentations at retina congresses, very active in publications and speaking and I think we are building up a very good brand recognition and certainly the approval of XIPERE and training along the U.S. retina and uveitis specialists enhances that. As I mentioned earlier, there's always a lot of interest in gene therapy. So I think the brand recognition continues to develop, as George mentioned, we receive an increasing number of inbound calls and inquiries about, potentially working with other companies. And I guess the last thing I want to say before turning over to George is right now, if you include Arctic Vision, which is assessing the USGA  or were designed here. In China, we currently have a clinical trials, a cortical steroid being assessed with our SCS Microinjector, tyrosine kinase inhibitor being assessed their SCS Microinjector gene therapy and a virus led drug conjugate. And it's really, I think, a very exciting time for supercoiled delivery. I wish I could add something to that time, but I can't I think that's I think that's the perfect answer to that. And that brand recognition will continue to grow, especially as those trials progress and especially as Bausch continues its training program to train. The vast majority of retinal specialists in the United States, were going to have, will ended up with hundreds and hundreds, and if not, into over 1000 physicians, at least in the United States that have been exposed to it, they've been exposed to the training on it. So and again, just emphasize what Tom said on the versatility, we've got four different therapeutic modalities and six different clinical trials right now. So we're very excited about the growing awareness of the system and the approach, so it's very exciting for us, and very rewarding. As always, we appreciate your continued interest in Clearside Biomedical and we look forward to updating you on our progress in the future."
}