{
    "symbol": "ORA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 11:10:03",
    "content": " Since the end of the first quarter, we commenced the commercial operation of 5 projects and added 73 megawatts to our portfolio with the addition of the Tungsten 2 and CD4 geothermal power plants, the Wister and Steamboat solar power plants and the Tierra Buena storage facility. Total revenue for the second quarter was $169.1 million, up 15.1% year-over-year, reflecting substantial growth across Electricity, Product and Energy Storage segments. Breaking the revenue down at the segment level, Electricity segment revenue increased 12.9% to $151.2 million, supported by contribution from new assets gained through the Terra-Gen acquisition, the expansion of our Tungsten 2 power plant and increased operation and higher rates at Puna, which has benefited from elevated oil prices. Energy Storage segment revenue increased 32% â\u0080\u0093 33%, Iâ\u0080\u0099m sorry, to $7.5 million when compared to the second quarter of 2021. Our total expected capital for the last 2 quarters of 2022 includes approximately $254 million of capital expenditures, as detailed on Slide 30 in the appendix. As noted in the previous quarter, adjusted EBITDA guidance for 2022 includes $15 million in business interruption insurance proceeds, of which $5.2 million were already recorded in the six months ended June 30, 2022. With a growing pipeline and numerous projects under development, we remain confident in our long-term plans to increase our combined geothermal, energy storage and solar generating portfolio to approximately 1.5 gigawatts by 2023 and to deliver an annual adjusted EBITDA of $500 million on a run rate basis towards the end of 2022. And I think that when you look at Ormat and the fact that in this quarter alone we have added 73 megawatts of new operating power plants demonstrates in reality how we deal with supply chain issues and if I need to maybe drill down into the three segments that you related to, on the geothermal and storage and solar part, so I would say that on the geothermal part, we are the leading geothermal company."
}