{
    "symbol": "LPI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 11:28:11",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the Laredo Petroleum Incorporated, First Quarter 2022, Earnings Conference Call. During today's call, we will be making forward-looking statements. In addition, we will be making reference to non-GAAP financial measures, reconciliations to GAAP financial measures are included in the press release and presentation we issued yesterday that detail our financial and operating results for first quarter 2022. We performed extremely well in the first quarter, continuing the momentum we generated in 2021. First, total oil and total production and capital were in line with guidance as our teams continue to execute our investments in Howard and Western Glasscock Counties. Second, we generated free cash flow of $23 million and consolidated EBITDA tax of $222 million. Third, we reduced leverage from 2.1 times debt-to-EBITDA at the end of the year, to 1.9 times at the end of the first quarter. In addition to delivering on our projections in the first quarter, we have positioned ourselves to further deliver on our value creation strategy for the remainder of 2022. We worked with our service partners to lock in 85% of expected drilling, completions, equipment, and facility spend for the remainder of the year. These successes support the objectives of our near-term strategy to utilize free cash flow to pay down $300 million of debt in 2022, equivalent to approximately $17 per share on our current outstanding share count. Work of the team has enabled us to maintain our projection of greater than $300 million of free cash flow in 2022, despite increasing our capital budget to approximately $550 million and seeing our operating cost increased by approximately $1 per BOE. Our production, capital expenditures and number of wells completed and turned in line are all in-line with guidance. We are especially encouraged with the production from the two middle Spraberry appraisal wells, completed late last year in the North Howard area. Based on the strong performance of these two wells and their strong economics, we've included eight Middle Spraberry wells into our 2022 development plan. These wells will be incorporated into our current activity levels of two rigs and one frac crew, and are not being added as additional activity. During the first quarter, LOE was higher than we anticipated, reflecting both inflation and additional costs associated with integration of our recently acquired properties. This is reflected in our second quarter, 2022 LOE guidance of $5.35 for BOE, flat to first-quarter. Capital expenditures for the first quarter were $171 million in-line with guidance, reflecting the work the supply chain team has done to lock in as much pricing and supply require goods and services as possible. As we continue to mitigate inflationary pressures impacting the industry, we have locked in second half pricing for about 85% of our operated capital expenditures for the remainder of the year, including completion services, tubulars, and sand. Importantly, with the strength of commodity prices and our strong margins, even with the 6% increase in our capital budget, our cash flow forecast for the year remains unchanged. During the first quarter, we continued to make progress on our overarching financial goal of generating free cash flow, reducing leverage, and ultimately positioning the company to return cash to shareholders in early 2023. As Karen described, inflationary pressures have been impacting the industry and have pushed our operating expenses and capital expenditures above our original expectations for 2022. We are fortunate that commodity price strength and efficiencies at the field level have fully offset these inflationary pressures, as our free cash flow outlook for the year remains unchanged, at greater than $300 million in the current price environment. Our investments this year by design, were front-end loaded so we expect our free cash flow to increase significantly throughout the remainder of the year as quarterly capital investment levels moderate. And at current commodity prices, we expect that ratio to decrease rapidly and to be at one-times by the end of the first quarter of 2023. Besides increasing our borrowing base to $1.25 billion and our elected commitment to 1 billion, they built in additional flexibility for us to determine how we pay down debt. Through the end of this year, as long as our net debt to EBITDA x-ratio is below 2.5 times, we have the flexibility to utilize $250 million of our elected commitment to purchase or call term debt. As we achieve our debt repayment and leverage goals, we expect to be in a position to return capital to shareholders in early 2023. The remainder of 2022 will further accelerate this trend as we pursue our goals of $300 million in debt reduction, and leverage at or below 1.0 times by the first quarter of 2023. We believe paying down debt throughout 2020, deliver substantial value for our shareholders and positions us to begin substantially returning capital to shareholders in early 2023. Your line is now open. With my first question, I wanted to focus on your 2022 plan and your confidence in executing against it. I think we -- again, feel really confident with locking in the capital where we did right now. We've got our first 15,000 foot wells coming online. Those wells are just really early in their flowback, so we look forward to talk more about it and -- probably the next quarter. But I feel really good about where the company is right now, and I think the steps we took on the capital front mitigate a lot of the risks that we would face for the remainder of the year. Your line is now open. So it's clearly as the commodity price has moved around, we keep a really close eye on what we're doing from a workover standpoint on all of our operations. We really look at it on an ongoing basis in any environment to make sure that what we talk about is no well left behind, that we're looking at each individual well and making the right economic decision for that well. As commodity prices have moved around, it really hasn't impacted our workover activity as much as you might expect, just because we had that ongoing program in place. When you look at like the new well completion designs today versus maybe four to five years ago, just doing that out. In general, we had done very little work over activity in recent horizontal wells, so -- I mean recent in the last four -- wells that have been drilled in the last four or five years. So as we've talked about long -- As we were talking about in the last call locking in second half, I really think it's a call on a service-by-service basis. What we've been doing is in a very rigorous way, the supply chain team has been evaluating both the industry and us specifically, as far as services and what our expectations are with cost trends, and then also availability of services. I mean, Jason pointed out that locking in second half, we believe really gives us a lot more certainty, really reduces risk on cost, but it also gives us more certainty and reduces risk around service availability. So on a case-by-case basis depending on services, our goal was definitely to get 2022 as locked up as possible to give us certainty around the capital budget that we're executing on. There are services that we've started to talk about 2023, but I think it's just a case-by-case basis as we see those services and expectations change. So I think we'll just, as we get closer to next year, won't be bad. Obviously with the moving gas prices we'd assume these continue to look more and more attractive, but just any more color you guys could provide on that inventory. So our economic priority is the Howard County Western Glasscock, and then the -- the core assets. But they again, they do look better with higher gas prices, Western Gas -- Glasscock is also a little bit gas here than Howard is -- it's supported as well. And right now, that's Howard County and we're I'd say we're -- we're drilling some really good wells out there right now. And then maybe just in terms of M&A, just curious, the opportunity set that's out there. If you guys are kind of continuing to explore additional opportunities, obviously, the bid-ask is kind of wide according to others, but just curious to get more color on that front. A lot of the packages that are out there that we've looked at have been a little bit more PDP heavy, so those don't really fit. What we're looking at as a company, we want to continue to build up robust inventory of wells with kind of lower break evens that can survive downturns. But anything that we do would -- it would be financed in a way that we would still achieve our debt, our leverage reduction goals, materially on the same timeline that we've laid out here today. As Jason said, debt reductions are primary, and then you get to return the capital at some point, and the wildcard is when you find an opportunity on the acquisition side to do, it needs to not derail those goals. It sounds like you guys have done a great job walking in your budget for the second half of the year, even though there's this, I guess 15% variable. So, what's remaining -- the 85% is activity forward for the year. So, with the activity that's been completed today, we're over 90% kind of locked in on the service side. So areas that even though we haven't fully locked in, that we think that we believe directionally where market may go we've incorporated that into the budget, so we feel really good about this budget. So if we see continued performance improvement, activity being pulled into the year, there may be a little bit of that as we continue through the year and really work on getting our performance improvement into the drilling completions program. One of the 2 rigs, we're working on contract for second half of the year. And that's in the 15%, but we do feel like we had a very clear line of sight overall on what pricing would be and have that incorporated. Your line is now open. So in terms of well performance in Howard County, we are still really encouraged by what we're seeing from our Howard County North acreage. Both of Wolfcamp at lower Spraberry really are performing well for us up there and we've been especially encouraged by our to Middle Spraberry wells, which we've highlighted in the deck. And as a result, we've added eight of those wells to our development program in 2020. And hurricane central, we're still seeing consistent behavior in terms of the wider spacing packages outperforming. Your line is now open. You're focusing on your -- you mentioned that 15,000 foot laterals, it's going to be coming soon. Yeah, I've talked a little bit about cost and performance. So, we are drilling the first 15,000-foot laterals  that we've done in some timeline, but as a company, we've actually drove the number wells at those lateral links. As we transition to more the North Howard area, we're integrating in more 15,000 foot laterals into the program. One of the well packages that we brought on this quarter, we -- well, first quarter, included the first 16,000 foot lateral. We're just finishing up operations, completion operations on the second set, 15,000 foot laterals for the year. There's certainly cost savings on a per foot basis, so that's really the driver for drilling the longer laterals, and we're seeing that work into our overall program on a cost basis based on the capital numbers that are -- that have been provided. Then from a production standpoint, we're assuming that we'll see comparable performance on a per foot basis and getting the first initially  on the first 15,000-foot laterals. We do not think that the technical limit, overall, it's really dependent on how the acreage position lays out as much as anything. I will give an example there in Central Howard, we went into operations with primarily conducted the laterals because the acreage is laid out perfectly for that. As we move to North Howard, it's a little bit blockier and it's given us opportunities to extend those lateral links, and so 15 again is a good layout for the development from that standpoint. Additionally, could you talk about -- I think the fourth quarter you guys had a handful of wells in Glasscock County. Obviously, it's not -- it's not the focus this year, the drilling program. As you get more data on the Wolfcamp D and some of these newer formations that you're targeting, where do you think that sits kind of in the hierarchy of wells of kind of the total company. It's again, it's got the -- the best economics in the company. And as we mentioned, we're even that for one in some of these Middle Spraberry wells because they performed so well. Sometimes we've got some lease obligations and we may need to go down and -- and put a few wells down here and there and this causes us to move around, but the priority is drill Northern Howard then go to Western Glasscock. We have updated in our slide deck, so those wells are performing as expected, excited about the Wolfcamp D. It's just the economics in Northern Howard are so good that it's hard to do anything else but those. Your line is now open. I think the approach that we're taking is, this is the right thing to do to meet our 2025 emissions reductions targets that we've put out there. So understanding the emissions on locations, mitigating those emissions events in line with trying to reduce our overall emissions, that's just the right thing to do and we're focused on that in particular. You're seeing certain industries, certain countries be more interested in acquiring certified responsibly sourced gas. From the oil side, that market -- we're seeing that emerge."
}