{
    "symbol": "LPI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 13:58:14",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to the Q3 2022 Laredo Petroleum, Inc. Earnings Conference Call. I would now like to turn the call over to Ron Hagood, Vice President of Investor Relations. Joining me today are Jason Pigott, President and Chief Executive Officer; Bryan Lemmerman, Senior Vice President and Chief Financial Officer; as well as additional members of our management team. During today's call, we will be making forward-looking statements. These statements, including those describing our beliefs, goals, expectations, forecasts and assumptions, are intended to be covered by the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Reconciliations to GAAP financial measures are included in the press release and presentation we issued yesterday, detailing our financial and operating results for third quarter 2022. Financially, the third quarter was another good one for Laredo as we continued to execute our proven plan to add long-term value. First, we generated $51 million of free cash flow in the third quarter. Second, we used this cash flow and cash on hand to repurchase a combined $170 million of debt and equity, strengthening our balance sheet to a leverage ratio of 1.25x. And finally, capital investments in the quarter were similar to last quarter with a consistent pace, 2 drilling rigs and 1 completions crew. Total production was within our previous range, oil volumes came in below expectations. We coordinate the management of producing wells with offset operators, but the recent impacts were greater than modeled. The strong returns industry is seeing in Howard County, we have no reason to believe that activity levels will decrease in the near future. demonstrates that following a frac impact, wells returned to their pre-frac impacted production curve. These duties were immediately assumed by Kyle Coldiron, VP of Subsurface and Business Development,  a new team member, Katie Hill, VP of Operations. While we've had some challenges this quarter, I would like to reiterate some of the progress we've made on our journey over the last couple of years,  of our investor deck. First, we increased our liquidity 61% to $1.050 billion, grew oil production 28% and we reduced our leverage ratio 38% to 1.25x. Before I turn the call over to Bryan, I would like to cover a few items concerning 2023. Our focus on capital discipline remained unchanged in 2023, and we expect that we will again deliver free cash flow, reduce debt, strengthen our balance sheet and methodically return cash to shareholders through our buyback program. For activity levels in 2023, we expect to continue to run our current 2-rig drilling program for the full year. In addition, we are monitoring commodity markets and will continue to utilize derivative markets to ensure we lock in returns and have high certainty in our cash flows. Consistent with past practice, we plan to issue 2023 guidance early next year following our internal reviews and Board approval. Third quarter, we continued to strengthen our balance sheet and return cash to shareholders. During the quarter, we repurchased $152.5 million base value of term debt at 98% of par. Through Tuesday, November 2, we have repurchased a total of $245 million face value of term debt at 99.2% of par. Of the repurchases, $90.9 million base value have been of our 2025 notes, increasing our flexibility as these notes need to be refinanced or redeemed in the next year or so. These repurchases have been funded through cash on hand and free cash flow, enabling us to reduce annual interest expense by approximately $21 million. During the quarter, we reduced total net debt to $1.14 billion. As of November 2, we had paid our revolver balance to 0 and hold cash of approximately $54 million. As part of this process, our borrowing base was increased to $1.3 billion from $1.25 billion and our elected commitments were maintained at $1 billion. During the quarter, we returned $17.5 million of cash to shareholders through our equity repurchase program. From November 2, we have repurchased a total of $34 million of equity, were approximately 442,000 shares at an average price of $77. For my first question, I wanted to focus on Slide 5 and specifically the frac impact period you saw in Howard County. So ultimately, the way that we did this analysis and what we're communicating here is that we went back and looked at all of our wells in Howard County that have experienced a frac impact over the last 4 years. And what you can see here is that the wells ultimately return to their prior production rates, and we're not seeing a long-term impact as a result of that frac hit. So ultimately, this well set has both wells that are older that have been online for a number of years and wells that are newer and have only been online for a few months. And so you can see across that type of well set, we're not seeing a big impact. And really, what we're seeing is a deferral of production, not a loss of production due to well productivity. So ultimately, what we think we found is the right mix of completion size and well spacing. If you look at our development in North Howard, there on Slide 5, you can see our North Howard well performance is very strong. Our original 2 packages in Central Howard, which are the orange lines, you can see those were a little bit tightly spaced relative to what weâ\u0080\u0099re doing today, and you can see the result of that on that plot. Other operators sometimes can space tighter with smaller fracs, some go a little bit wider with bigger fracs. As we've said, what we plan to do is pay these down pretty much in line with cash flow. We have $1 billion of liquidity, which puts us in a good space for acquisitions. With the RBL redetermination process completed earlier this week, we have the flexibility to basically call those bonds whenever we want and bring them on to the revolver. Jason, you talked a little bit about your production expectations for 2023 in your prepared comments. Right now, best estimates are around 10% inflation would be a good factor to put in there. We will have, again, a few more completions, but we'll also have less wells being drilled because we've built some kind of DUCs as we've gone into the end of this year. So that's kind of the plan, I think where we'll be but we're still going through the process of finalizing our budget, and we'll come out with those details early next year. Zach, to clarify, when Jason said $590 million for the year, he's referring to 2022 and the 10% is relative to '23 relative to '22. I think as we've seen price come back, slowing it down as a ratio to total cash going to both the bond and the equity repurchase programs. As we move into next year, we will definitely use commodity price and free cash flow as a determining factor of how much and what ratio. That would still not put us at using the whole thing, paying -- or using the whole $200 million by the end of next year. We appreciate your interest in Laredo, and this concludes today's call."
}