{
    "symbol": "USNA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 12:46:05",
    "content": "  Operator: Hello, and welcome to USANA Health Sciences Third Quarter Earnings Call. I will now hand you over to your host, Andrew Masuda, to begin today's conference. As a reminder, during the course of this conference call, management will make forward-looking statements regarding future events or the future financial performance of our company. Examples of these statements include those regarding our strategies and outlook for fiscal year 2022 as well as uncertainty related to the magnitude, scope and duration of the impact of the COVID-19 pandemic to our business, operations and financial results. We caution you that these statements should be considered in conjunction with disclosures, including specific risk factors and financial data contained in our most recent filings with the SEC. I'm joined by our CEO and Chairman of the Board, Kevin Guest; our President, Jim Brown; our Chief Financial Officer, Doug Hekking; as well as other executives. Yesterday, after market closed, we announced our third quarter results and posted our management commentary document on the company's website. As we look ahead, we anticipate continued COVID-related inflationary and economic challenges in many of our markets, which is reflected in our adjusted fiscal 2022 outlook. Despite the challenging environment, USANA remains a very healthy business. We have the means, ability and determination to put USANA back on growth trajectory towards the full monty. We must always remember that we are in the people business, and the opportunity to build connectivity with our customers, after several years of disruption, will be invaluable to creating engagement and excitement in our business. Although we are committed to addressing the short-term challenges we are currently facing, the long-term health and growth of USANA remains our primary focus. First of all, I guess, actually Mainland China, the performance was actually a little better than what we had projected and it was like the other parts of China â\u0080\u0093 I'm sorry, the other parts of Asia that were kind of very weak versus our projection. I think probably the largest thing is, in specific, our Southeast Asia region has relied much more on in-person type activity than what we've seen in the other markets. And some of the challenges were really highlighted by Malaysia and Philippines, which are both great markets, but it's definitely been a challenging environment. And just as a follow-on, just to go back to China, again it wasn't as bad as kind of what we had projected. I know it's hard to kind of foresee, but do you actually think in China that the constant currency sales growth can be up possibly in the fourth quarter or still down you think in China? I think the environment in China right now is â\u0080\u0093 and I think you've seen in the number of some of the peer companies out there, it's been very tough and I think we fared fairly well. But the zero COVID policy and just the limitations with the able to go back and do in-person activities, we can do them, but it's limited. But I think short-term, I think you'll continue to see us â\u0080\u0093 continue to battle and fight, but I think you'll see probably similar numbers in the short-term. We haven't seen costs come down and I'm talking about raw materials definitely in the Salt Lake City, where we produce the majority of our products, we do produce in China as well. Linda, maybe another element to go back and just consider, I think the group has done a good job in the environment. But exchange rates right now, we produce out of the U.S. for every market with the exception of Mainland China. And when you do that, you see the strength of the dollar that creates some gross margin compression as well and we also see that in our SG&A line from an operating leverage perspective. We had a reclassification that we're making in the third quarter to put part of that in the long-term, but that includes both the short-term and long-term inventory, and it continues to be managed. We were obviously pretty aggressive at Jim's direction, to go back and make sure that we're not disrupting the customer experience and making sure we had inventory to sell. I know it's really hard to gauge this, but I think that investors are kind of seeking a â\u0080\u0093 some visibility on when you might return to organic or constant currency sales growth. Because you are posting declines against double-digit decline, so it's a little bit hard even when comparisons are easy, it's hard to gauge when you might start growing. I think we are seeing some stabilization, I think, particularly in customer counts. And so I think I'd probably defer until February, we'll give you some visibility at that point."
}