{
    "symbol": "ARBK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-18 18:18:06",
    "content": " This money margin is a drop from the 84% mining margin that we saw for the full year of 2021 and that's primarily due to higher global hash rate and the associated increase in difficulty and that's not surprising, we knew that if Bitcoin -- if the price of bitcoin didn't come up and network difficulty continue to rise that money margins would likely come down a little bit for the first quarter of this year. So we were at $125, minus $70.71 need roughly $50 million of additional capital to build -- fully build out Phase 1 and that includes infrastructure, machines everything the whole kit and caboodle, All right, our machine financing agreement with NYDIG, so feedback from shareholders large and small is they given where we're at right now, non-dilutive growth, non-dilutive capital is our best factor for growth. The interest rate is 12% on this loan to the average consumer obviously that's very high, if you come from a traditional finance background or if your mortgage in your house, you're like wow, that's a big number, but this is actually a very competitive rate for machine financing. Just wanted to echo what Pete said about seeing the facility, first time -- it's the first time that I've seen a facility, couple of weeks ago and really hats off to the ops teams and tech team for -- we've invested a great deal of money there and we're now -- we're about see the rewards from that investment. In terms of selling Bitcoin, again, we have a strategy around selling our Bitcoin and when is -- when there is obviously a good time when it's about time and we look at that and we could pull back and accelerate that as these be, we're in a very healthy position at the moment in terms of our HODL. So, and I think it's still probably a couple years away, but I know that they are looking at, they've got skunk-works happening, there is projects happening, but in terms of really ramping up, I think we're probably into the next bull cycle before we see that happening in a big way. I think it would be nice if the price of Bitcoin could help us along a little bit, but ultimately for us, it's really about head down, executing, under-promising over delivering and I think if we do that, we're going to be successful in the long term."
}