{
    "symbol": "MDLZ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 21:50:05",
    "content": "  Operator: Good day, and welcome to the Mondelez International Second Quarter 2022 Earnings Conference Call. Today's call is scheduled to last about 1 hour, including remarks by Mondelez management and the question-and-answer session. During this call, we'll make forward-looking statements about the company's performance. Please refer to the cautionary statements and risk factors contained in our 10-K, Q and 8-K filings for more details on our forward-looking statements. As we discuss our results today, unless noted as reported, we'll be referencing our non-GAAP financial measures, which adjust for items included in our GAAP results. In addition, we provide our year-over-year growth on a constant currency basis unless otherwise noted. Today's call, Dirk will provide a business and strategy update, then Luca will take you through our financial results and our outlook. And although we may see a more mixed consumer sentiment in the near term, given the macro environment, we expect the consumers to consume more at home and be more selective in the brands they buy, which we believe to be a net positive for. And although we may see commodity inflation beginning to ease, we expect other costs like wages to show significant inflation. At the same time, our consistent results enable us to maintain our course in driving a virtuous cycle where strong net revenue and gross profit or to continuous investment in our brands, distribution capabilities and acquisitions. A great example of that is our agreement to acquire Clif Bar, which will improve our position in the attractive and fast-growing snack bar category. Along with the Clif acquisition, we announced plans to divest our developed market Gum & Halls businesses, allowing us to focus our portfolio and further invest in our faster-growing businesses of chocolate and biscuits. We remain confident that the strength of our brands, our proven strategy and our increasing investments position us well to deliver attractive sustainable growth for the remainder of 2022 and beyond. Above all, I'm extremely confident in our people, who continue to demonstrate exceptional passion and dedication to serving our consumers despite ongoing challenges with inflation, supply and periodic in COVID conditions. We respect and honor our colleagues around the world, and we truly believe that team Mondelez is a very theme in the consumer packaged goods industry. The strength of our brands, increasing investments, volume growth and significant pricing actions are sustaining top line momentum and solid profitability despite substantial inflation. And last, we increased operating income by 8.5% for the quarter and 11.2% in the first half while delivering great free cash flow results. As you can see on Slide 6, we delivered 10 points growth during the first half of the year. In late 2018, we launched a new growth plan focused on gross profit dollar growth, local first commercial execution, a virtuous cycle of increasing investment and a new approach to incentives. Importantly, we are also delivering strong volume, which is important to Mondelez. Like many companies, as shown on Slide 7, we are experiencing a dynamic operating environment driven by global cost inflation, supply chain volatility and currency headwinds. First, we continue to elevated input cost inflation especially in the areas of energy, transportation, packaging, wheat, dairy and edible oils. To offset these challenges, we recently announced further pricing actions across key markets, and continue to do appropriate action to hedge our commodity costs along with ongoing productivity and cost reduction initiatives. Second, we continue to manage through volatility in the supply chain, especially in the United States due to labor shortages at third parties as well as the continuing gap in demand and supply of trucking capacity containers. Although we do have more work to do, we are making progress against our plans to unlock manufacturing warehouse capacity, improve service levels and implement new measures to support employee retention. Third, we are working through the impact of the strengthening U.S. dollar particularly against the euro and the British pound by focusing on what we can control. And though we may see some significant currency trends in the short term, we have delivered robust real dollar earnings growth over the past several years. And because snacking plays such an important role in consumers' lives, our core categories of chocolate and biscuits historically have resilience to economic downturns and pricing actions. While developed consumers express growing frustration with rising prices for a broad range of goods and services, they continue to perceive chocolate and biscuits as affordable indulgences and an important pick-me-up. In fact, almost 40% of U.K. shoppers said that chocolate is a necessity and remains one of the best valued snack products. Due to enduring consumer loyalty, category volume growth and penetration is holding up well in most of our key developments. Private label is either flat or down in the vast majority of our markets, and shoppers say they are much less likely to switch to private label in chocolate and biscuits compared to other categories. Meantime, in emerging markets, consumer confidence remains relatively strong, recovering to almost pre-COVID levels. Compared to developed markets, emerging market consumers are less likely to reduce overall consumption of our categories or switch when faced with price increases. Overall, we remain confident that the strength of our beloved and trusted brands will continue to help us navigate inflationary periods like the one we have today. Clif is a leader in growth, well-being snackbars. The company's own-trend brands including Clif, Luna and Clif Kids, a greater to our global snacking portfolio, and they are differentiated this page. We look forward to working with the passionate, dedicated Clif team to advance our shares. On Slide 10, you can see that we have moved from a small bar business in 2018 to about $300 million last year with the addition of perfect Snacks in Grenade and to a $1 billion-plus global snack bar platform factoring Clif. As a significant 700 million-plus presence in the U.S., protein and energy space, which is expected to continue to grow well over the coming years as a diverse range of consumers increasingly count snack bars as meal replacements, energy or a better way of snacking. Slide 11 shows that the Clif Bar acquisition offers an opportunity for us to do business to our marketing expertise, operational excellence and financial discipline to create significant value. There are clear and substantial cost synergies, which include leveraging our experience with logistics and warehousing, reducing waste in existing and ties in marketing and advertising to optimize A&C spend. In terms of growth, we see substantial opportunities to increase household penetration and distribution in alternative and e-commerce as well as existing outlets. And beyond the U.S., there are clear opportunities to drive international growth. Since we announced our growth strategy in 2018, we have completed or announced 9 acquisitions that strengthen and complement our portfolio and fill key gaps adding more than $2.8 billion in annual revenues and averaging growth in the high single digits. So 2022, in addition to announcing the Clif transaction, we have closed and integrated our acquisition of Chipita, a high-growth European leader in croissants and baked goods. These strategic acquisitions will complement and build on our substantial M&A progress in 2021, which brought us a leading U.K. performance nutrition company, Gourmet Fola leading Australian premium biscuit and cracker company and Hu, a well-being snacking company in -- These acquisitions have been regional in nature, we can largely be managed by local teams. We are confident that executing our strong patient playbook will allow us to drive sustained growth, accretive to our algorithm across the portfolio. Our second quarter performance was once again strong with above expectations, outcomes across all P&L line cash. We delivered revenue growth of plus 19% with 5 points coming from volume mix, showing the term approach to supporting our brands and investing in capabilities exploit our long runway of opportunities is paying off. Emerging market to show significant strength, posting an increase of more than 22% with great momentum across all our major business units. Volume mix was also positive in developed market, with approximately 4 points of volume in Europe. Additionally, Gum & Candy continue to improve as global mobility increases coming out of the pandemic. Biscuits grew 10.4% for the quarter, with nearly 2 points coming from volume mix. Emerging markets grew strong double digits, while developed markets increased high single digits. -- delivered strong increases include Oreo, Chips Ahoy, redBus. Chocolate grew more than 30%, with increases in both developed and emerging markets including digit growth in Europe. Chocolate was driven by robust volume growth of plus 9% as consumers continue to our brands as an affordable indulgence, both global and local product well, including Cadbury Dairy Milk, overall lands. Our biscuits category had a gain share in 40% of our revenue, close 40 points of headwinds from supply chain constraints in North America. We are already seeing some improvements in service and share, but we expect this improvement visible as the year progresses. Now on Page 17, we delivered high single-digit growth, both in terms of gross and operating profits. Importantly, the overall gross profit dollars delivery allowed us to reinvest in A&C by double digits in the quarter and obtained EBIT gains versus last year. Europe grew 10.8% during the quarter, supported by great execution and strong growth across mass grocery as well as convenience away from home and travel detailed channels. North America grew 9.2% in Q2, driven by higher pricing in biscuits as well as double-digit Gum & Candy growth. AMEA grew 13.2% for the quarter, with strong volume mix growth of 8.7 points showing continued momentum in the period. India grew almost 30% in the quarter, driven by chocolate and biscuit. AMEA increased oil dollars by 7.9% for the quarter as volume-driven profit was partially offset by commodities, transportation inflation and reinvestment in A&C. Latin America grew 33%, with double-digit volume mix growth. Brazil, Mexico and our Western Andean business unit all posted very strong double-digit increases similar to last quarter. We remain focused on driving attractive top and bottom line performance, including real dollar earnings growth. Clearly, this is a challenging year in terms of exceptional currency headwinds for us and for our industry. By executing against our strategy and focusing on what we can control, our performance over the past 3 years has been quite strong, both on an absolute and relative basis. Going forward, we will continue to take actions to drive strong profit dollar growth in constant and real dollars. Over the past 3 years, we have increased our dividend by more than 35%. Before I cover our outlook, I wanted to make a comment on our focus now and going forward as it relates to the current environment. How we remain true to our strategy and making the right decisions to drive attractive, profitable and sustainable growth for the long term. That means we remain committed to significantly investing behind our brands, driving volumes, generating healthy profit dollar growth and improving our market share. We believe this disciplined approach will create lasting and differentiated value for our consumers, customers and shareholders. Although this year is shaping up to be more challenging, we believe we are well positioned to attract real dollar earnings in the years to come. Given our strong first half results, we now expect 8% plus top line growth. This revised top line outlook factors in a number of considerations, including the negative full year impact anticipated from the Ukraine war including revenue losses related to products that previously were manufactured in the country and exported into Europe. Second, some elements of customer disruption in Europe as a result of the second wave of price increases. While we have already been able to agree on most of the planned price increases in Europe, there are still some customers and countries where negotiations are underway. The size of customer disruption is difficult to predict, but we have factored into our guidance a certain impact, which is expected to be more pronounced in the third quarter. Finally, although elasticities have been at low levels to have, we are planning for them to return closer to historical levels in the second half as consumers continue to navigate inflationary trends and increased pricing across most markets. And risk adjusted for additional inflation resulting from the Ukraine war, some customer disruption with respect to pricing and higher levels of elasticity. However, driven the strength of our first half results and depending on the outcome of our pricing negotiations in Europe, we might finish in the upper part of this range. As far as cost inflation goes, our expectations for low double-digit cost inflation for full year 2022 are confirmed. Additionally, this outlook reflects our ongoing commitment investing in our brands. in media, not only during this period of elevated pricing, but importantly, to drive long-term growth. Well, I would say, overall, we feel good about how '22 is panning out for us. And so overall, year-to-date, our profit dollar growth is good, double-digit. If I then look to the second half, we feel good about the second half. If I go a little bit about what's going to happen here, I think we will see some softening of consumer confidence, particularly in developed markets, I would say. But I do expect our categories to remain solid, probably flat to small growth in volume. And I think within that, our brands are very strong and have a good connection to the consumer. We will have ongoing conversations with our customers about price increases, and we will try to drive a value equation there. I think together, we can probably find a way to keep our categories going at a very good rate and create the necessary value. And then from a pricing perspective, I can, of course, not comment on the specifics, but more pricing has to happen, and it's -- we execute very carefully by market. Elasticity, as you saw, is slow, but we expect an uptick, and we've planned, in fact, for the second half of the year, normal elasticity that might pan out that way or not. And then from a cost perspective, yes, some commodities are pulling back, but we do expect the near-term inflation to remain high. But overall, I think what's unique about us is that we are clearly in a virtuous cycle here. We are investing quite strongly, as you could see. Our gross profit growth is good, which allows us to make those investments. We think that virtuous cycle will continue, but there might be here and there more difficulties than we've had in the first half. And Luca, if you could add, the margins were pretty soft in Europe in the quarter. Again, Europe, I'll comment first on what we see with our business in the consumer in Europe and then Luca can talk about the margins. So, so far, so good, I would say, nothing major happening from a consumer perspective. Going forward, yes, we are probably a little bit more concerned about Europe because we still have some pricing to implement of the second pricing round in Europe, about 65% is now agreed, still 35% under discussion. But then the consumer will be confronted with that extra pricing, and we will see what the reaction is going to be there. So I would say we are feeling good so far, but we are -- of all the regions around the world, probably more concerned about what's going to happen in the second half in Europe. When actually I look at the GP dollar line for Europe, it goes up year-over-year even if marginally. And that is because quite honestly, we have been a little bit delayed in terms of implementing pricing as compared to when commodity costs kicked in. But as of -- as we look back and as these things will be behind us, margins in Europe will be restored. And importantly, we continue investing, and that is one of the reasons why actually despite gross profit dollar being up year-on-year, OI margin -- OI dollars was down in the quarter. It certainly seems that way from some of your previous comments, but I just want to make sure there's nothing else or discrete that's preventing that flow through that I'm not aware of. We continue and I personally continue to feel very confident about 2022 being a very strong year, and that is not only in terms of top line, but also in terms of bottom line and particularly cash flow. And as I said, while we kept on investing in the business, you see that our bottom line and cash flow continue to be strong. And when you consider that it includes 1 point for the Ukraine prices, a potential and quite frankly as I said, difficult to estimate impact from customer reaction and as well as a more normal level of elasticities. You understand really that the business has an underlying momentum that is quite good, and we are confident in the combination of those trends. On the profit side, look, I said it the last time we talked, I said we might be cautious and we continue to be cautious. But quite frankly, we are now in a much better position than we were in the last quarter to really see line of sight to high single-digit EPS at this point. I just wanted to be a little bit conservative because clearly, customer disruption is difficult to predict and then elasticities that are above what we see today can play a role as well. So I would like to say that in case of elasticities that are more benign and more benign customer reaction than the one we have planned certainly, we're going to be within the high single-digit limit. I also would like to make a point, which might be overlooking all these numbers is, and it is the fact that we continue to observe very good cost discipline in the company. But realities, overheads are held under control and the line that is increasing by more than 13% is our A&C support to the business. Some investors certainly still question the greater foray into the bar category, and as recently announced with Clif is it's perceived as a fairly crowded space and one maybe where it can be tougher to sort of differentiate. And it had a slowdown as it relates to the COVID because it's very heavily linked to mobility, but clearly, the category is coming back in the recent months. When we look at the details, we believe that there is a big opportunity to expand distribution in existing and alternative channels, but also improve the quality of the distribution of where Clif is present. As I said, we have a significant opportunity to optimize overheads, implement an RGM strategy, they've been experiencing supply chain disruption. And we're already seeing in the first 2 quarters of this year, a much improved profitability for the business. So we feel that the business is completely coming back to normal, and then we can add on the many synergies that we see from our side. I just had a question for you, if I could, on -- around this quarter with this accelerating rate of volume growth in relation to accelerating pricing, which is obviously very encouraging. But then also with that stronger volume growth should come better fixed cost leverage and with the gross margin being down a little bit sequentially, I realize that pricing did not quite keep up with inflation. Look, we are very happy with the volume growth and the revenue progression. The point is, particularly in the case of Europe, as you look at the profitability number, there is a lag between commodities hitting the P&L and pricing being implemented. Having said that, I still would like to get a couple of points out there. You look at the profit dollar growth, I think on a year-to-date, we are 11%. So when you step back, I think the question would be if we had priced earlier in Europe, how good of a P&L group we have, and it would be clearly much, much better. And that, I think, is what is going to happen going forward if we continue to invest in the business and execute pricing well because I think there is still, obviously, as we've said, a few situations where lies pricing needs to be implemented, particularly in Europe. The point, as I said, if there is a lag between pricing and commodity going into the P&L of Europe. If I think about the second half outlook and a little more cautious view on margins, at least at this point as you've taken revenue up and kept EPS in place. The inflationary pressure, I would say, is going a little bit up because obviously, in Q1, we had a more favorable pipeline of commodities. But besides elasticities, as I said, there is this element of what is the impact of customer disruption. But look, as I said, even in presence of may be a customer disruption but with more benign elasticities than those that we have planned that are in line with historical norms, I think we still have a shot at getting to high single-digit EPS. Can we ask to begin with, there wasn't much commentary in the prepared remarks about market share trends, which I know were very strong a couple of years ago and probably down year-on-year against some tough comps. But I wondered whether you could just make some commentary on that, particularly given what we're seeing in North America, where I think it's down, but maybe because of supply chain constraints. In Europe, we are gaining share, mainly driven by France biscuits and U.K. biscuits. Latin America is flat yesterday, but they had a major increase last year, but also their biscuits are gaining share. So the share that we're losing there is purely because of supply chain constraints and it's on 4 local brands: Nilla, Nutter Butter, Premium and belVita. And overall, I would say, longer term, we feel very good about continued share gains because of the amount of brand investments we're doing, the ROI we're getting on those. We are also driving share because of distribution gains in places like China, India, Southeast Asia, and we also have good gains coming from our innovation. So if you would be able to discard the U.S. situation, I think you would be able to see a very good situation in the rest of the world. We have released, I think, a couple of weeks back an 8-K where we have secured a little bit of additional term loan. And clearly, that has to function as a bridge to the divestiture of gumin developed market and holds worldwide to be able to deploy those funds for the acquisition of Clif. I think at this point in time, though, I still believe that the $2 billion of share buybacks is secured for the year. On Europe, you mentioned that organic sales and volume trends are remaining strong, and you showed that pretty lousy consumer confidence numbers over there, though. Well, first, I would say that our categories, biscuits and chocolates are normally quite resilient in these circumstances. We've seen it during COVID, but we have also seen it in 2008 and in previous recessions because it's a small indulgence that consumers find difficult to forget or to leave behind. So that might be -- at the start of it, that might be one of the reasons why our categories and our performance continues to look fairly strong. If you then look at consumer confidence, I think we do see a softening and consumers clearly talk about the inflation, the interest rates, the threat of recession. We don't see that in emerging markets, but the question, of course, was about developed. So you, for instance, see a very strong French biscuit market, but you see chocolate in Germany and U.K. affected. But overall, I would say, from the consumer consumption perspective, it's a mixed bag. We do expect higher levels, as I explained in years ago, but it's still nothing that is as high as it used to be before. So for instance, if I look at U.K. chocolate, that's probably where we see the highest elasticity so far. But it's declining the elasticity, and we are now about 10% below the '20 or '21 levels as it relates to elasticity. Now again, we have to see higher price increases in Europe for the second half. We don't see anything that is of a major concern, but that doesn't mean it's going to remain like that. Well, the one region where we are not spending more than last year is in North America so far because of our supply chain disruption, and it didn't make sense. But then in the rest of the world, I would say it's about equally split. But overall, I would say it's across the board that we are investing in biscuits and chocolates, mainly. But you referenced an outlook for your categories to kind of maintain maybe flat, modest volume growth and then price on top of it through the back half of the year. In terms of the guidance, as I said, when you strip out the impact of the Ukrainian war, which is 1 point that it is more pronounced in the second half. When you strip out the higher elasticities, we are planning or which arguably might be on the cautious side. And third, when you strip out the impact of the customer disruption pretty much the underlying trends of the first half are the same as of the second half. So I want to reassure you that in terms of slowdown, as you look at some of the numbers for chocolate and biscuits, as you look at emerging markets growing in the quarter, 22%, we are not assuming a material slowdown into the second part of the year. Look, the 8 plus, the plus is there for one reason, which is I would might end up doing better than that. From the category perspective, it was correct, what you was saying we thought that -- what we expect to see is relatively high pricing for probably in the 8% to 10% range, maybe even double-digit pricing. Now you have to keep into account that in previous years, the category growth was around -- in volume, was around 2%. So we would not be that far away from the volume growth that we've been seeing in the past, maybe slightly down. Obviously, more to come, but thank you for your interest in the company and looking forward to talk to you in the coming weeks."
}