{
    "symbol": "MDLZ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 19:01:05",
    "content": "  Operator: Good day, and welcome to the Mondelez International First Quarter 2022 Earnings Conference Call. Today's call is scheduled to last about one hour, including remarks by the Mondelez management and the question-and-answer session. Good afternoon, and thanks for joining us. During this call, we'll make forward-looking statements about the company's performance. Please refer to the cautionary statements and risk factors contained in our 10-K, Q and 8-K filings for more details on our forward-looking statements. As we discuss our results today, unless noted as reported, we'll be referencing our non-GAAP financial measures, which adjust for certain items included in our GAAP results. In addition, we provide our year-over-year growth on a constant currency basis, unless otherwise noted. In today's call, Dirk will provide a business and strategy update, then Luca will take you through our financial results and outlook. Before turning it over to Dirk, a reminder that we have an investor update on May 10 and that will begin 9 Eastern, 8 Central where Dirk, Luca and other senior leaders will talk more about the evolution of our strategy. Thank you Shep, and thanks to everyone for joining the call today. I am pleased to share that we have delivered an excellent start to the year with robust volume growth, solid pricing, strong growth profit dollar growth and high cash delivery. Strong demand for snacks fueled broad-based growth all around the world, with the chocolate and biscuit categories continuing to demonstrate resilience and price elasticity remaining below historical levels. We also continue to effectively navigate a dynamic environment characterized by global input cost inflation, as well as lingering disruptions in the supply chain, labor and transportation. Throughout the quarter, we succeeded in mitigating these challenges through ongoing cost discipline and strategic pricing actions. We remain confident that the strength of our brands, our proven strategy and our continued investments position us well to deliver attractive, sustainable growth for the remainder of 2022 and beyond. It is especially important to note that we remain extremely confident in our people, the very best in the CPG industry. Each and every day, our makers and bakers around the world remain focused on delivering high-quality, great tasting snacks to enrich the lives of consumers. No matter how the external environment shifts from one quarter to the next, our diverse and dedicated teams continue to deliver the brands our consumers love. The strength of our brands are continuously increasing investments and significant pricing actions, our sustaining top line momentum and solid profitability and position us well for another strong year in 2022. Our A&C investments have increased high single digits, and we gained our health share across half of our revenue base. As you can see on slide 6, we are now averaging a 4.7% quarterly revenue growth rate since 2019. In the second half of 2018, we shifted our paradigm on how to generate elevated growth by focusing on gross profit dollar growth, local first commercial execution, a virtuous cycle of always increasing investments and a new approach to incentives. We also believe this performance demonstrates not only the strength of our execution, but the attractiveness and durability of our core categories of chocolate and biscuit. We are excited to provide some additional details on our recently announced acquisition of Ricolino, the number one sugar confectionery and number four chocolate player in our priority markets of Mexico. This strategic acquisition will enable us to double our size in Mexico, a key priority market for us and Latin America's second largest market after Brazil. Ricolino has a broad portfolio of iconic widely loved chocolate and candy brands include Ricolino, Vero, La Corona and Coronado. In addition to the taste of the nation brands, the organization's robust route-to-market infrastructure, which has more than 2,100 DSD routes that serve more than 440,000 traditional trade outlets will enable us to rapidly expand our share in biscuits and chocolate. Like other companies, as shown on slide 8, we are experiencing a dynamic operating environment driven by global cost inflation and supply chain volatility. We condemn the war in Ukraine, which is not only causing great human suffering, but adds to an already very difficult cost and supply chain environment. First, we continue to face elevated input cost inflation, especially in the areas of energy, transportation, packaging, wheat, dairy and edible oils. To offset these challenges, we recently announced further pricing actions across key markets. Additionally, our commodity costs are about 85% hedged for the year and near fully hedged in key areas. Second, we continue to manage through volatility in the supply chain, especially in the US, due to labor shortages at third parties, as well as a continuing gap between demand and supply of trucking capacity and containers. To offset these challenges, we are continuing to improve our manufacturing and warehouse capacity, prioritizing key SKUs and implementing new measures to support employee retention. And third, we are working through numerous challenges related to the ongoing war in Ukraine. I would now like to spend a few minutes addressing our actions to care for and protect our people, as well as our operations in the region. First and foremost, our thoughts are with the people of Ukraine and all those around the world with family, friends and loved ones who have been impacted. We have taken a number of important steps to protect our colleagues, including strong financial support, border crossing assistance and help with finding housing. This includes donations to international and local aid organization focused on supporting all people in Ukraine, but also with a specific focus on the communities where we have plans. For instance, we have helped transfer more than 100 children from Ukraine to Turkey, secured diesel generators to help provide power to critical public facilities and we are making food available in Ukraine, including product donations and working with distributors. It is too early to provide you with potential next steps for the facilities, but we will work to make these facilities operational when the local situation allows. In terms of our business in Russia, as a food company, we have scaled back all nonessential activities, including stopping all new capital investments, any planned product launches and line extensions, commercial sponsorships and advertising. We delivered revenue growth of 8.6%, with nearly four points of that growth coming from volume mix. Emerging markets continue to show great strength, posting an increase of more than 16%, with strengths across all our major business units. Importantly, volume mix dropped nearly 10 points of this growth, with notable performances from Brazil India, China and Mexico. Developed markets grew 4.2% for the first quarter, with strength in both Europe and North America as demand remains strong. As for emerging markets, also, our developed market volume mix was positive, but pricing drove a good portion of that growth. Biscuits grew 6.7% for the quarter, with more than two points coming from volume mix. Similarly to Q4, emerging markets were a significant engine of growth in this category. Brazil, Mexico, India, Southeast Asia all grew double digit, while China posted high single-digit growth. Oreo, Chips Ahoy!, HU and Tae  are among those brands that deliver double-digit increases. Chocolate grew more than 8% for the quarter, with increases in both developed and emerging markets. Both global and local brands grew well, including Cadbury, Dairy Milk, Milka, Tobleron, Lacta and Riz . China, Brazil and Mexico were among some of the larger gum businesses posting strong performances. We held or gained share in approximately 50% of our revenue base during the quarter, with approximately 25 points of high win due to the inventory situation in the US and related out of stock. Our chocolate category continued to do well, with 70% of our revenue base holding or gaining share. While our biscuit category held or gained share in 40% of our revenue base, the impact driven by lower inventory levels in North America following the Q3 strike and continued labor shortages at third-party manufacturers is worth 40 points of headwind. A few of the more notable areas of share gains in Q1 include China, India, Brazil, Mexico, UK and France Biscuit; UK, Brazil and South Africa chocolate; and China gum. As we move into Q2, we expect our chocolate share to improve in several key markets in Europe and EMEA due to Easter timing where our portfolio is especially strong. For the quarter, profitability was strong due to higher pricing, strong volume leverage and the benefit of hedges related to currency and commodities. Europe grew 4.9% during the quarter, supported by great execution, a strong Easter performance and continued recovery in the convenience away-from-home and travel retail channels. Our results were driven by 3.4 points of volume growth with strong increases in many markets, including the UK, as well as Central and Eastern Europe. In chocolate, we delivered our best Easter ever with strong sell-in and sellout for the UK and Germany. OI dollar growth for the quarter was more than 10%, driven by continued volume leverage, pricing and strong cost control as well as favorable commodity ForEx hedges. North America grew 7.7% in Q1, driven by higher pricing in biscuits as well as double-digit gum and candy growth. Volume mix was slightly positive, despite lower service levels related to third-party labor constraints. EMEA grew 8.9% for the quarter with strong volume growth of 6.4%, showing continued strength across much of the region. We continue to extend our leadership position in chocolate, while the growth of our biscuit business continues to outpace larger competitors in the region. China grew high single digits for the quarter, driven by continued share and gains in both biscuits and gum, despite several challenges due to COVID restrictions. Southeast Asia delivered high single-digit growth, with strength in biscuit, chocolate and beverages. EMEA increased OI dollars by 5.8% for the quarter, volume-driven profit was partially offset by commodities and transportation inflation. Latin America grew more than 25% for the quarter, with strong growth across all categories, driven by both strong pricing and volume mix gains. Brazil, Mexico and our Western Andean business unit all posted double-digit increases this quarter. These increases were driven by broad-based volume growth across core snacking categories, effective pricing through RGM actions and the mix impact of higher gum and candy sales. We delivered Q1 free cash flow of €1 billion, driven by strong operating results and further improvements in our cash conversion cycle. We stopped all business in Ukraine as the war began, including our two plants in the country that produce products for both Ukraine and broader Europe. In total, this represents about $320 million in revenues on a yearly basis. As a result of this business stoppage, we expect asset write-offs and one-time costs of approximately $143 million, which will be excluded from our adjusted results. For the remainder of 2022, we expect about $200 million in revenue headwinds from the loss of revenue in Ukraine as well as losses related to finished goods that our Ukraine plant produce for other countries within Europe, where we do not have supply alternative yet. We continue to expect pricing to be a larger driver of top line growth, given its impact in Q1 and we are also announcing price increases across a number of markets for the rest of the year tied to inflation. We now expect input cost inflation in the low double-digit range for 2022 versus our prior view of approximately 8%, despite our coverage is approaching 90% for the year. The revise view of inflation reflects the war in the Ukraine and the related step-up in cost pressure to our commodity basket, including energy, wheat, oil and packaging. As I said, we also expect additional pricing in a number of markets connected to this inflation, and these actions could cause an increase in elasticity versus what we are seeing today. And given these dynamics, we believe it is prudent to call a range of EPS growth between mid-single to high single digit. This also factors in ongoing investment to support our brands and work in media increases that, in some cases, might be increased, given good business momentum to protect versus elasticity driven by incremental price increases. With respect to free cash flow, our view is unchanged as we continue to expect another year of €3 billion plus. With that, let's open the line for questions. Well, I would say if I would phrase in one -- phrase, it's a fast-changing and complex environment that our demand is strong, and our momentum is sustained. There's still some pockets of COVID, particularly in China at the moment, but also Southeast Asia. And if you look at the quarter, for instance, in chocolate, we grew our revenues by 8.1%, and that was accompanied also by very strong volume growth, which was 5.8%. And then in biscuits, our biggest category, we grew revenue by 6.7% and volume was 2.2%. And despite all that, we are delivering very good dollar profit growth. We have double digit -- strong double-digit OI growth, and that was driven by pricing RGM and the volume growth. If I look to emerging markets and developed markets, emerging markets continue to be a very strong growth engine for us, double-digit revenue growth, strong double-digit revenue growth in Q1 and also last year, accompanied by 10% volume growth. And as you know, we believe we still have plenty of opportunity in these markets as it relates to distribution and white space. Developed markets are solid, although we still have constraints in our US supply chain, but we see it gradually improving. So we had strong growth, a step-up in pricing. And as I said, we're making good progress on supply chain and inventory, but there's still a lot of work to do there. Europe for us was also very good, volume-led growth of 5%. We had record Easter results, which you cannot yet see in our market share result because Easter is later this year, but we know it's a very strong Easter. The consumer in Europe, there's a lot of questions about it, is still solid, fully aware about inflationary pressures and so on, the underlying data show that the consumer is still buying our products very strongly. We will have to work through this near-term inflation, which got worse due to the Ukraine situation and the supply chain headwinds we still have to go through. So we remain focused on what we can control, our pricing, in-store execution and very strong cost discipline. And just as a follow-up, in terms of the Ricolino acquisition, you touched on it in your remarks a bit, but could you elaborate on the synergy opportunities. Well, for us, we consider it as a very high strategic fit for us to become a full snacking player. Roughly comparing to our other emerging markets, Mexico has potential for us, and we are very interested into the chocolate market also. Our biscuit business is developing, but could use some acceleration. So Ricolino offers us a strong route to market, combined with an already very strong presence in the market, particularly in confectionery and in chocolate. And starting from their already strong position and combining that with our existing business, the two businesses are about the same size. This will mean for us that we are now 75% a snacking player, which is also very important for us. So there's a significant opportunity because of that full integration, for revenue and cost synergies, which would be accretive to our growth and margin in Mexico and Latin America. So maybe quickly a bit of the numbers on Ricolino, so about $500 million in net revenue. In the sugar confectionery and chocolate categories, they have about a 15% share in the combined categories, the number one in confection, number four in chocolate. The two categories together are about $3 billion in Mexico, and the growth of those categories are expected to be 7% for the next five years. And Ricolino, we expect because of their iconic local brands, we expect them to be above that, about 8%. You probably will not know any of the brands, but they're very known locally. But then second, as I already mentioned, the route to market, 2,100 plus DSD routes reaching 440,000 mom-and-pop stores. And, of course, we have a very strong modern trade presence ourselves where we can help Ricolino become stronger. We're also getting four excellent manufacturing facilities, which will help us produce the necessary products for the growth. And just last one for Luca, if I could. Looking at the guide for 2022, stronger top line despite Ukraine, wider range for EPS. As I said in the prepared remarks, I think it is fair to say that we feel quite confident about 2022 being another good year, both in terms of top and bottom lines, despite the numerous challenges that are thrown at us. And I think when you look at volume mix and the pricing that is kicking in, that is the testament really of the big investments we have been making over the last few years and the fact that our franchises are very strong. And just to give you a reference, inflation is now expected to be double digit versus the high single digits we had originally estimated. And that will result in additional and multiple pricing waves across the board, across all our categories, quite frankly, since energy particularly has repercussions around a vast number of commodity classes. As we price away unprecedented inflation, clearly, the watch out is elasticity. And so I wanted to be a little bit cautious in our forecast since at this point in time, we are not seeing that level elasticity. And I also want to make sure that we'll realize that by having invested materially in the last three years, our brands are as strong as they have ever been. But again, quite frankly, if you slip out the Ukrainian impact, you realize that we are two points ahead of the original guidance on net revenue that we gave you at the beginning of the year. On the profit side, as we guided to high single-digit EPS, we had built into some cushion in our forecast. But this situation is tighter than before because of the inflation and the Ukrainian related business losses, and those accounts for around about $0.13 of EPS. And in the case of cost not worsening materially versus the double-digit inflation that I mentioned, high single-digit EPS is within reach. Obviously, we want to get to high single-digit EPS. And that's why, for instance, we are doubling down on cost initiatives. And there are streams within the company to ensure that on the productivity and cost control side, we do even better than we have been doing in the last few years. And so hopefully, if the situation doesn't worse and the elasticity’s are better high single digit would be within reach. And I would back up what John was getting at, it does feel very low, 4% seems almost punitively low given 1Q strength. The point here though is; A, we have one point of headwind related to the Ukrainian business stoppage. You might imagine that in places like Russian, for instance, there are restrictions, both in terms of importing. And on top of that, as we have multiple pricing waves, as I said, we have planned for higher elasticity than what we are seeing at the moment. If we get better elasticity’s and we implement pricing policy as we have done in the last few rounds, there is obviously an opportunity to go higher in terms of revenue. But I wanted to be cautious because, clearly, the situation is quite fluid. You might imagine that in some places, we are getting to price increases that are more than double digit, I would say -- not double digit, but in the 15-plus percent, that's the number we are talking about. And so elasticity remains to be seen at these levels, and I wanted to be cautious. And just to clarify, though, that when you say that elasticity is being baked in at a higher level than today and back-to-normal levels, and you talk about Ukraine and Russia, and I understand there's some uncertainty in there, too. Look, the only one thing you have to bear in mind is that last year, in Q3, we had the strike impact in the US, which obviously affected some of the revenue phasing in the US. But besides that, the only one thing that you had to think is about sequential pricing being higher throughout the quarters. Well, Andrew, we do have a number of businesses in North America, our ventures, which are not followed by Nielsen. You will also imagine that, we came out of the strike, and we had subsequent high demand that our inventory levels in the trade were not as high as we would like them to be. And then, Luca, maybe if we look at the difference between, let's say, high single-digit constant currency EPS growth in mid to high single digit, if that's how it turns out. Maybe could you just break out the -- I guess, there were three key buckets there. I think you said, $0.03 was due to Russia-Ukraine. It sounded like another maybe dime, if I'm hearing you right, on supply chain. Thank you very much. It is another $0.10 of cost headwind as we -- as I said in -- to the reply to John, between the Ukrainian business laws and the revenue that came out of the plant last year in the Ukraine and the additional cost pressure driven by the Ukraine war I see another $0.10. Now, as I said, the high single digits, quite frankly, at this point, is predicated on elasticity. The elasticity’s are better than what we have baked into the forecast, it will be high single-digit EPS, if elasticity’s are more in line with historical levels of one plus, then I think we will have a little bit lower than high single-digit EPS growth. And the supply chain piece, I didn't know if that was included in the $0.13 because you have those three buckets on that slide? I think on slide 19, there's a comment in there that says you're expecting year-over-year profit dollar growth throughout 2022. Obviously, we are expecting OI dollar growth throughout the quarters. We have to see how cost evolves throughout the quarters because as I said, we have baked into the forecast, the current cost levels. So at this point, I would say, yes, that's the idea, depending, as I said a few times, on elasticity there might be some bumps in the road, but that's the plan at the moment. And then the second one is just, Luca, how do we think about -- or how are you preparing for the potential for maybe like the inavailability of maybe some input costs or other resource -- inputs ingredients or other inputs. I guess, given there's going to be certainly scarcity of wheat, it looks like -- and maybe some other raw materials. Clearly, we are facing some shortages, but they have no been a material impact yet to the business. In terms of wheat, the wheat coming out of the Ukraine is mostly going into the Middle East and North Africa for us. As I said in the last call, the total wheat we procure for the company is $600 million, $700 million. So in the big scheme of things, we believe that in total, wheat is not going to be a material problem in terms of supply. It hasn't been yet, but we have to see how the crop evolves and what can still be sourced out of the Ukraine, particularly for our Middle East and North African business. If we're looking at maybe some of the petrochemical related, like, packaging, especially in Europe, given just all of the disruption in energy there. Paper and -- particularly in places like Asia, it is under a lot of pressure at this point. But again, in terms of supply, we have some issues here and there, but nothing that racks up to a material number for the company yet. I just had two questions for you, if I could, please. So the first one, I'm just curious about just to dig a little bit more into the pricing, Europe was an area where I think you've talked before about some pricing coming into place after Easter, like in April. We took pricing across all our markets in Q1, including Europe. That probably is reflected on our forecast, and we're trying to be prudent there because that is not happening a lot in Europe that you have to do a second pricing. And so we will have to see what the reaction is, and we've taken a cautious approach on any potential effects that we could have from that. So, that leads to what Luca was saying, a very significant pricing increases around the world. As we also were saying so far so good, elasticity has been quite low. For instance, I believe that at the end -- sorry, at the beginning of 2023, the basket for the US consumer will be up compared to the beginning of 2021 more than 20%. So, despite this high inflation, despite the high pricing, we know that our categories are pretty good. One of the things we're seeing, for instance, is that this -- the fact that everything is going up, not just food, consumers continue to prioritize grocery spending. So, that also gives us confidence implement the pricing and continue with the volumes. But again, we're trying to be careful and cautious, and we will have to see how it goes. The level of inflation, it is higher in Q1 for obvious reasons because you know that last year, the inflation picked up materially towards the second part of the year. And it caught us a little bit by surprise, the level that we saw in the second part of the year. And obviously, the level of gross margin in Q1 is reflective of three key elements. One, it is the additional pricing. When you look, for instance, at the US business, you clearly see a level of revenue that is 8% with a modest volume mix impact, which means there is 8% pricing kicking in, in there. So, as you think about inflation going down in the remainder part of the year, it will go down year-on-year, but the level is still going to be higher in terms of absolute dollars, and we will have to price accordingly. First, to follow-up on the next wave of pricing in Europe. Because I believe this is close to sort of on-charter territory to be pushing through multiple rounds, at least in Continental Europe in the course of one year. Yeah, it's just brand new, so I cannot give you any feeling yet of where that stands. So one of the things we will have to do is to carve out and create a little bit of additional infrastructure on our side, but nothing at this point, I would say that is worrisome. I feel quite good about the reach that Ricolino is going to have with 2,100 DSD route achieving 440,000 moms-and-pops, which is really where when you look at our biscuit business in Mexico, being at 5% share of total market, the opportunity lies. And on the other side, our Mexico sales complement, the strong model trade presence with our some modern trade presence what Ricolino has. And we feel like between revenue and cost synergies, this is going to be a material enhancement to the value of Mondelez. On top of that, the brands are very strong. And as Dirk said, particularly in the US, we see tremendous opportunities in pushing this brand through what is a cohort that is growing and has tremendous potential. Obviously, the elasticities have held up really well so far. Look, in total for the company, the mix component is very, very neutral. And as we address the question of Andrew Lazar, Dirk said that the new businesses that we acquired are up, while our biscuit business in terms of volume is still below last year. And one of the reasons why that this is, A, we are lapping, clearly, tremendous growth last year in terms of volume. But also, as I look closely to the numbers, the supply-related issues that we have are causing still quite a bit of volume track compared to what it could be otherwise. On the flip side, as you saw, gum is growing very, very healthily as a category gum can be, I think, 27%, and that number obviously is mix accretive. The other one that is mix accretive, it is about world travel retail, which is picking up nicely quarter-after-quarter, albeit it is not still at the level it is not yet at the level before the pandemic. So, these are the three key mix components, North America volume being down because of supply chain issues, gum being up and world travel retail being up all the rest in terms of mix, I would say, fairly neutral in its totality, and these three elements offset each other. But even with the Ricolino deal, you're still expecting about $2 billion for this year. The -- at this point, I feel that we have what it takes to be able to fund the $2 billion of buybacks. Firstly, on the emerging markets, the biggest pushbacks that I get at the moment is people concerned that as food prices escalate around the world, and the cost of basic food becomes a higher proportion of people's income in a lot of these low-income countries, that could choke off sales of more discretionary items like packaged snack food. I think as I was saying before, what we're seeing at the moment, we see that in developed and in emerging markets, the shift that the consumer is making as they are being confronted with inflationary pressure are more into their discretionary spending into eating out, travel and so on. And we see that also in emerging markets where at this moment, there is food inflation, of course, but that we don't see a reduction in the basket of what they're buying. The second thing I would say is that the discretionary part of snacking is, I would argue, that, it's not so discretionary anymore with the modern consumers. And for instance, in China, as people are going into lockdowns, we see an increase in salt biscuits happening because they considered it as a staple of their diet. And then three, I would say we also work very carefully and particularly in places like India or in Brazil, our RGM approach is very developed. So because of those three elements, I think you continue to see very strong performance in our emerging markets. And in fact, as I was saying, the volume increase has been 10%. So obviously, you can never say never, but so far so good. Thank you very much. And then just finally, any quick preview comments about the Investor Day next month. A few things, I mean, look, I think this is more evolutionary in terms of the strategy and what you're going to hear, certainly going to get a deep dive especially with respect to biscuit and chocolate. As well, I would expect to hear from some other folks on the team just in terms of our efforts around marketing, what we're doing with the sales organization and supply chain. But to give you an idea, just in terms of where our heads are at as we look to accelerate going forward and give you some proof points to leverage off. Thank you very much. Obviously, looking forward to see all of you during our Investor Day on 10th of May, and see you then."
}