{
    "symbol": "ZGN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-26 15:48:06",
    "content": " I say that the Made in Italy platform was, as you know, affected by the COVID problem, in particularly, Gildo did explained, but we came out very, very strong and we see tremendous growth in the first half of 2022, with Textile up 55% and Third-Party brands up 44% and hence the later all those going forward. On slide eight, I would say that, mid-term highlights some of the key points in the first half and these happen despite some disruption of the global environment, and I must say that, our global revenue excluding Mainland China shows restoration, also in second quarter 2022 with a growth rate of 59% from 48% in first quarter 2022. This â\u0082¬28 million this year, which is both in the financial expenses compared with a favorable 2021 financial income report that in the first half of last year when we purchased the 5% of Thom Browne at the value was -- which was lower than the liability that was in the books. So letâ\u0080\u0099s go to page 11 and here we see a snapshot of first half revenues and itâ\u0080\u0099s like a few key points that Zegna and Thom Browne enjoyed continue growth in U.S., Europe, rest of the world, more affecting the COVID new measures in Greater China. And those segments continues to contribute strongly to the growth plus 30% in the first half, now close to â\u0082¬185 million with a growth at 360 degrees in all the lines, when we are running fast, the lines of e-commerce through Tmall, which was launched last year in the second half. Thom Browne 30% growth in first half and 41% in second quarter, driven by strong demand for both seasonal and classical products and we also hear you are retail impacted by GCR. Those -- these all more than offset two things; one, the unfavorable time permits, because of course, China is a positive addition to our margin and going down was a detriment and we anticipated, not the surprise, step up in central costs related to listing and the marketing dollars that we are very happy to spend in order to amplify the new direction of Zegna brand and increase the awareness of the Thom Browne brand on the other side."
}