{
    "symbol": "VAPO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 18:15:05",
    "content": " We also restructured the SLR debt facility to reset our 2023 financial covenants, reduce our minimum cash covenant and add the ability at our election to pick a portion of our 2023 interest expense, saving cash expenditures of potentially up to $9 million. Between the additional cash from our recent equity raise, the conversion of inventory to cash, the ability to pick our interest payments, our reductions in operating expenses and the gross margin improvements we expect from our relocation of manufacturing to Mexico, we believe we have the necessary capital to get us to adjusted EBITDA positive by the end of this year. During 2022, we also focused heavily on reducing cash operating expenses to pre-COVID levels or $63 million in 2019. Cash operating expenses decreased by approximately $17.2 million in 2022 versus 2021, with the stage set to deliver pre-COVID level of cash operating expenses in 2023 of $60 million to $62 million. Non-GAAP cash operating expenses were $18 million in the fourth quarter, at the high end of our guidance range, due to higher commission expense related to higher revenue. Net cash burn in the quarter after adjusting for $1.2 million of ATM proceeds was approximately $13 million, which is approximately 50% less than the average from the previous three quarters. With the recent amendment we signed, this PIK feature allows us to elect to add up to $9 million in annual interest payments to the debt balance and reduced our cash burn in 2023. For the full year 2023, we continue to expect revenue of $77 million to $79 million, a growth rate of 15% to 18%. In terms of seasonality, as we think about the business from a quarterly cadence perspective, we think, generally, it will probably revert back to the sort of 17 to 19 pre-COVID years experience in that particular timeframe, our quarterly cadence is sort of in the 25%-ish contribution in Q1 kind of in the 23%, 22% range for Q2 and 3, and then wrapping up in the year with the high 20%s to round out the full year to get back to 100%."
}