{
    "symbol": "BRCC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 22:18:06",
    "content": " Fast forward to today, Black Rifle has established itself not only as a mainstream brand but also as an omnichannel CPG business, less than six months into our launch at Walmart, we have risen to the number four 4 brand in bagged coffee and within that, the number one selling branded 12-ounce bagged coffee, the largest dollar volume package size within Walmart's bagged coffee segment. As a P13 Nielsen data, less than four months into our initial launch, we represented 3.5% of Walmart's total coffee business, and this share continues to accelerate, growing to 3.8% through the end of February. Given the number of market variables we don't fully control, we've concluded that we are overly ambitious with our initial 2023 revenue target due to the timing of various load-in cycles and customer onboardings within the wholesale channel for coffee and RTD and our more disciplined approach to outpost, we're pushing some of our forecasted revenue from 2023 to 2024. Today, we are resetting our 2023 revenue target to a range of $400 million to $440 million or approximately 33% to 46% growth over 2022's revenue of $301 million. For the fourth quarter, total revenue increased 30% to $93.6 million compared to $71.8 million in Q4 of last year. First, our direct-to-consumer revenue decreased 8% in the fourth quarter to $45.6 million compared to $49.6 million last year. For the full year 2022, our direct-to-consumer revenue decreased by $6.3 million or 3.8% to $159 million due to a decrease in our new customer acquisition for non-subscription customers. For the full year 2022, our wholesale revenue increased $63.6 million or 114%, bringing our total wholesale revenue to $119.4 million. Next, revenue and outpost increased 34.3% to $6.8 million in Q4 compared to $5.1 million last year. For full year 2022, our marketing expense increased 5% to $38.2 million compared to $36.4 million in 2021. Importantly, for the full year 2022, marketing expense as a percentage of revenue decreased from 15.6% to 12.7%, a decline of 290 basis points as we're beginning to see the leverage on our branding investments as our business scales and we focus our investments in our wholesale channel. For the full year, G&A increased 146.5% to $64.5 million compared to $26.2 million for the same period in 2021."
}