{
    "symbol": "BHC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 11:39:04",
    "content": " We are encouraged with the progress we made this quarter, with consolidated third quarter revenues of $2 billion, up 2% on an organic basis over the same quarter last year. At Bausch Pharma and Solta, third quarter revenues were $1.1 billion, improving from the 4% decline through the first half of the year to a minus 1% on an organic basis this quarter. Salix revenues were $544 million, an increase of 3% versus the third quarter last year, an improvement from the 2% decline in the first half of this year. International revenues were $250 million, an increase of 10% on an organic basis compared with the third quarter of last year, driven by strong performance in Canada and Europe and double-digit growth in a number of key brands. Diversified Products revenues were $238 million, down 17% on an organic basis compared with the third quarter of last year. Lastly, on Slide 12, Bausch + Lomb revenues were $942 million, up 5% organically compared with the third quarter of 2021, with organic growth across all B&L segments led by the Surgical segment. Third quarter consolidated adjusted EBITDA attributable to Bausch Health was $766 million, a decrease of 13% versus last year. For Bausch Pharma and Solta, segment profit was $660 million, a decrease of 5% versus last year, driven by the decline in revenue, which includes $25 million primarily from the Amoun divestiture and $27 million from the impact of foreign exchange. Excluding legacy legal settlements, separation costs, cash provided by Amoun and third-party fees related to our recently completed debt exchange, adjusted cash flow from operations on a consolidated basis was $9 million versus $382 million last year primarily due to operating results and the timing of working capital movements. A total of $5.6 billion of previously issued senior unsecured notes were exchanged for $2.1 billion of new secured â\u0080\u0093 senior secured notes of Bausch Health and $1 billion of new senior secured notes of a wholly-owned, unrestricted subsidiary that holds approximately 38.6% of outstanding shares of Bausch + Lomb. Our guidance for Bausch Pharma and Solta remains unchanged, with full year revenues of $4.3 billion to $4.42 billion, which is down 3% to flat on an organic basis. As you heard yesterday, Bausch + Lomb has reduced its full year revenue outlook by $50 million to $3.7 billion to $3.75 billion driven by FX, and full year adjusted EBITDA by $25 million to $715 million to $755 million. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live."
}