{
    "symbol": "BHC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 09:56:04",
    "content": " I would like to take a moment to remind you that the first quarter results are the fully consolidated results of Bausch Health, covering the quarter ended March 31st, before the IPO of Bausch + Lomb, which is scheduled to close this morning, subject to customary closing conditions. With the initial public offering of Bausch + Lomb’s scheduled to close today, Bausch Health begins the journey towards the separation of its global pharmaceutical and eye health business, an important step that we expect will help unlock the value in each of our established franchises. Before I start, I would like to thank the 20,000 Bausch Health employees around the world for their ongoing contributions to simultaneously move forward with our strategic alternatives process, advance our R&D projects and drive business performance that helps to improve people's lives around the world. Tom's extensive experience in pharmaceuticals includes more than two decades at Schering-Plough and 12 years in Bausch Health, where the B&L International business delivered significant top line and bottom line growth under his leadership as President and Co-Head. We launched the initial public offering of 35 million shares of Bausch + Lomb last week equivalent to 10% of shares outstanding, generating gross proceeds of approximately $630 million, which will go towards the repayment of Bausch Health debt upon closing. Adjusted EBITDA for the quarter was $732 million, down 13% versus Q1 last year on a constant currency basis, driven by higher investments in sales and marketing and R&D, which we believe will strengthen our business for the future. First quarter revenues for Bausch Pharma and Solta were $1 billion, down 3% on an organic basis versus last year. Bausch + Lomb's revenues of $889 million were up 5% organically, which is in line with our 4% to 5% organic growth guidance for the full year 2022. Adjusted EBITDA was $170 million for the quarter, which includes approximately 9% of sales for R&D expense and reflects our commitment to continue to invest in the business and launch new products. Adjusted operating expenses for the first quarter were $705 million, an increase of 6% on a constant currency basis versus last year, driven by higher selling expenses to invest in the business and support product launches and R&D spending as we continue to invest in the business. Concurrent with the IPO, Bausch + Lomb also expects to close on its new debt issuance today, raising $2.5 billion of new term loans. Operator, next question please. It seems like you need to monetize the remaining 10% of P&L IPO Solta and then you'd still need some ongoing cash flow from the core business, if I'm thinking about the math right. The second one, obviously, as the B+L business performs, Bausch Health will have the ability to monetize the remaining 10% of the B+L shares and utilize that to pay down debt. Operator, next question please. I'd like to -- as I said at the end was really we're going to reach out and endeavor to reach out to many of you in the coming months as a part of a comprehensive IR effort, really looking forward to having discussions about the Bausch Health business and what we can provide and do for patients and shareholders."
}