{
    "symbol": "BHC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 10:32:06",
    "content": " First, we met guidance for the full year 2022, delivering the revenue of $4.36 billion and EBITDA of $2.32 billion for Bausch Health, excluding B&L. I am pleased with the momentum we saw in the fourth quarter with revenue for Bausch Health, excluding B&L, up 2% on an organic basis, driven by growth in our Salix, Solta and International businesses. Debt principal, net of unrestricted cash for Bausch Health, excluding B&L, has now been reduced by $3.2 billion since the IPO of Bausch + Lomb in May of 2022. We closed the quarter with consolidated fourth quarter revenues for Bosch Health of $2.2 billion, up 4% on an organic basis over the same quarter last year and up 2% for the full year. Fourth quarter revenues for Bausch Health, excluding B&L, were $1.2 billion and up 2% on an organic basis, with growth in our Salix, Solta and International businesses. We're also pleased with the sales performance of TRULANCE, RELISTOR and PLENVU, increased 17%, 6% and 60%, respectively, in Q4 2022 versus Q4 of 2021. International revenues were $261 million, an increase of 2% on an organic basis during the fourth quarter and an increase of 5% for the full year. Solta Medical revenues of $99 million increased 20% on an organic basis in the fourth quarter, and revenues for the full year were up 2%. Diversified revenues were $256 million, down 6% on an organic basis in the fourth quarter and down 13% for the full year. Bausch + Lomb revenues were $996 million, up 5% on an organic basis this quarter and up 5% for the full year, driven by organic growth across all B + L segments. I will first refer to results on a consolidated basis and also provide some additional color for the performance of Bausch Health, excluding B + L. Fourth quarter consolidated adjusted gross margin was 70.3%, 120 basis points lower than in Q4 of 2021, driven by continued pressure from inflation, along with, for the B + L businesses, pockets of limited supply availability that drove up costs and incremental production costs related to its daily SiHy lenses. At Bosch Health, excluding B + L, adjusted gross margin for the fourth quarter was approximately 80.5%, 80 basis points lower versus Q4 of 2021, due to FX headwinds, which offset underlying gross margin expansion. Fourth quarter consolidated adjusted EBITDA attributable to Bausch Health was $823 million, a decrease of 9% and a decrease of 1% on a constant currency basis versus last year. For Bausch Health, excluding B + L, segment profit was $713 million, a decrease of 4% versus last year, driven by the decline in revenue, which includes $24 million from the impact of foreign exchange. Contractual interest costs for the quarter based on principal balances was approximately $365 million on a consolidated basis and $320 million for Bausch Health, excluding B + L, compared with approximately $340 million on a consolidated basis last year. Excluding separation costs, adjusted cash flow from operations on a consolidated basis in the fourth quarter was $507 million versus $279 million last year, which in large part reflects the favorable working capital impact of timing of certain payments, including interest in 2022 compared to 2021. As you can see on Slide 24, total debt for Bausch Health, excluding Bausch + Lomb at year-end was $16.6 billion, which consisted of $15.6 billion of restricted debt issued by Bausch Health, excluding B + L, and $1 billion of senior secured notes issued by the unrestricted subsidiary created in the third quarter. In 2023, we expect revenues of $4.45 billion to $4.6 billion, growth of 2% to 5% on an organic basis, reflecting the momentum we started to see in the back half of 2022. Full year adjusted EBITDA for Bausch Health, excluding B + L, is expected to be $2.3 billion to $2.4 billion. Let me spend a few minutes diving further into our margin expectations for Bausch Health, excluding B + L. From a gross margin perspective, we continue to mitigate the impact of inflation on our cost of goods sold and we expect our gross margin to remain comparable to last year at approximately 80%. Our EBITDA expectations also reflect increased investments in sales and marketing, as well as a full year of the dis-synergies from the separation from B + L. First, investments we continue to invest in sales and marketing activities to drive growth in our key brands in our Salix, International and Solta Medical segments, which Tom addressed earlier. Moving below EBITDA, our full year effective non-GAAP tax rate is expected to be 18%, and interest expense reported in the P&L is expected to be approximately $1 billion, including the impact of the accounting treatment I covered last quarter, resulting from our September debt exchange."
}