{
    "symbol": "TGI",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-04 01:09:13",
    "content": " We retired obligations of over $100 million from our Legacy Structures business, improved cash use from a year ago and expect to be cash flow positive over the balance of the fiscal year. Bottom line, our first quarter results keep us on track with our goal of doubling profitability over fiscal years 2022 to 2025 driven by improved OEM production rates, expanded MRO volumes, enhanced pricing from recent contract extensions and lower cost structure as a result of our transformation. That said, Triumph's military end market was off 20% for the quarter, driven by prior year orders on C-130 and E2-D though these declines were offset by commercial end market improvements. While our suppliers are not achieving the 100% on-time performance we expect, we were able to meet our sales targets in Q1 and anticipate recovery quarter-over-quarter with over $40 million of past due backlog expected to be retired by the end of fiscal '23. For the full year, excluding the impacts of the Actions and structures, we expect to generate $30 million to $45 million of cash from operations with approximately $30 million in capital expenditures resulting in core free cash flow of breakeven to $15 million in fiscal '23. We are on track with our plan to double our continuing FY '22 EBITDAP to approximately $310 million by fiscal '25, was fueled by increasing demand, pricing opportunities, cost efficiencies and improved mix of business from our portfolio actions. But going forward, what the continuing business is Interiors, it's around $120 million run rate business, but it's increasing faster than most of the businesses as narrow-body business comes back. The -- when we think about the EBITDAP going from Q1 to Q2, there's probably something like a $15 million headwind sequentially quarter-on-quarter from the Stuart going away as well as $5 million or so from the AMJP. In the first quarter, we spent $21 million, $17 million of that was cash used in the Stuart business, which has gone with this divestiture. We're going to be a modest user in the tens of millions, just roughly, let's say, $20 million to $30 million of cash use maybe in Q2 would be better."
}