{
    "symbol": "RHI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 21:19:02",
    "content": " Companywide revenues were $1.833 billion in the third quarter of 2022, up 7% from last year's third quarter on a reported basis, and up 10% on an as adjusted basis. On an as adjusted basis, third quarter talent solutions revenues were up 12% year-over-year. U.S. talent solutions revenues were $1.049 billion, up 13% from the prior year. Non-U.S. talent solutions revenues were $273 million, up 10% year-over-year on an as adjusted basis. Currency exchange rate movements during the third quarter had the effect of decreasing reported year-over-year total revenues by $45 million, $32 million for talent solutions and $13 million for Protiviti. Contract talent solutions bill rates for the quarter increased 9% compared to one year-ago, adjusted for changes in mix of revenues by functional specialization, currency and country. On an as adjusted basis, global third quarter Protiviti revenues were up 5% versus the year-ago period, with U.S. Protiviti revenues up 4%. Companywide third quarter public sector revenues were $89 million, of which $63 million were reported by Protiviti and the balance reported by talent solutions. We expect fourth quarter 2022 public sector revenues to be $80 million to $90 million, which will result in full-year revenues being down approximately 6% or 2% adjusted for currency. Turning now to gross margin: In contract talent solutions, third quarter gross margin was 39.4% of applicable revenues compared to 40% of applicable revenues in the third quarter one year-ago. When combined with contract talent solutions gross margin, overall talent solutions gross margin was 47.8% compared to 47.7% of applicable revenues in the third quarter one year-ago. Adjusted for deferred-compensation-related classification impacts, gross margin for Protiviti was 30% for the quarter just ended compared to 29.4% one year-ago. Adjusted for deferred-compensation-related classification impacts, enterprise SG&A costs were 30.6% for the quarter just ended compared to 29% one year-ago. Adjusted for deferred-compensation-related classification impacts, talent solutions SG&A were 36.3% for the quarter just ended compared to 36% one year-ago. Third quarter segment income from our talent solutions divisions was $152 million, with a segment margin of 11.5%. Segment income for Protiviti in the third quarter was $72 million, with a segment margin of 14%. Revenue growth, year-over-year, on an as adjusted basis: talent solutions, down 1% to up 4%; Protiviti, up 1% to up 4%; overall, flat to up 4%. Gross margin percentages: contract talent, 38% to 40%; Protiviti, 27% to 29%; overall, 41% to 43%. SG&A as a percent of revenues, excluding deferred compensation classification impacts: talent solutions, 36% to 38%; Protiviti, 14% to 16%; overall, 30% to 32%. Segment income: for talent solutions, 10% to 12%; for Protiviti, 13% to 15%; and overall, 11% to 13%. Protiviti has successfully overcome the combined headwinds of much larger comparables, 55% growth in the same quarter a year-ago, the wind-down of a very large financial services project and a shift in public sector client demand over to talent solutions, and still achieved record revenues for the quarter. Keith, I wanted to ask you about the talent solutions fourth quarter guide for revenues to be down 1% to up 4%."
}