{
    "symbol": "RHI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 19:41:05",
    "content": " Our contract talent solutions and Protiviti also continued to post very strong results, growing year-over-year revenues by 30% and 19%, respectively. Company-wide revenues were $1.815 billion in the first quarter of 2022, up 30% from last year's first quarter on a reported basis and up 31% on an adjusted basis. Net income per share in the first quarter was $1.52, increasing 55% compared to $0.98 in the first quarter one year ago. On an as adjusted basis, first quarter talent solutions revenue were up 35% year-over-year. Non-U.S. talent solutions revenue were $297 million, up 28% year-over-year on an as-adjusted basis. Contract talent solutions bill rates for the quarter increased 9.1% compared to one year ago, adjusted for changes in the mix of revenue by functional specialization, currency and country. On an as-adjusted basis, global first quarter Protiviti revenues were up 20% versus the year ago period, with U.S. Protiviti revenues up 17%. In contract talent solutions, first quarter gross margin was 40% of applicable revenues compared to 38.8% of applicable revenues in the first quarter one year ago. Gross margins were positively impacted by expanding pay bill spreads and higher conversion revenues or contract to hire, which were 4% of revenues in the quarter as compared to 3.1% of revenues in the same quarter one year ago. When combined with contract talent solutions gross margin, overall talent solutions gross margin was 48.3%, an increase of 2.7 percentage points compared to the year ago first quarter. For Protiviti, gross margin was 26.2% of Protiviti revenues compared to 26.5% of Protiviti revenues one year ago. Adjusted for deferred compensation related classification impacts, gross margin for Protiviti was 25.3% for the quarter just ended compared to 26.9% one year ago. Enterprise selling, general and administrative costs were 28.3% of global revenues in the first quarter compared to 30.3% in the same quarter one year ago. Adjusted for deferred compensation related classification impacts, enterprise SG&A costs were 29.8% for the quarter just ended compared to 29.5% one year ago. Adjusted for deferred compensation-related classification impacts, talent solutions SG&A costs were 35.6% for the quarter just ended compared to 36.3% one year ago. The major financial assumptions underlying the midpoint of these estimates are as follows: revenue growth on a year-over-year basis, talent solutions, up 25% to 27%; Protiviti, up 9% to 11%; overall, up 21% to 23%. SG& percentage of revenues, excluding deferred compensation classification impacts, talent solutions, 36% to 37%; Protiviti, 14% to 15%; overall, 30% to 31%. Our permanent placement and contract talent solutions segments, included blended solutions with Protiviti, have achieved cumulative sequential growth of 163% and 64%, respectively, during the seven quarters, since the pandemic trough, similar numbers for the financial crisis and dot-com recovers were 83% and 30% and 87% and 41%, respectively. First quarter public sector revenues exceeded expectations, grew 34% year-over-year to a total of $90 million, of which $72 million was reported by Protiviti and the balance reported by talent solutions. So Andrew, the fact that we started up 20% on even with some of the short-term challenges we talked about for the second quarter we're projecting up 10%, we would expect for the full year that Protiviti for 2022 would grow double digits up to mid-double digits. And by the way, on a sequential basis, Protiviti's revenues are up 4%, 5%, which is pretty much on trend if you look back for several years notwithstanding the large project that I just talked about. And so during the quarter, we had $11 million in revenues on the contract side, not talent solutions, where when people rolled off those public sector assignments, we almost immediately put them on, redeployed them on commercial talent solutions engagements."
}