{
    "symbol": "LCII",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 23:32:04",
    "content": " We ended the quarter with $1.5 billion in revenues, up 40% year over year with strong demand across the markets we serve to support double digit revenue growth in each of our core markets. RV OEM sales increased 52% during the second quarter of 2022, compared to 2021 reaching $906 million driven by elevated wholesale shipments in market share gains. Our consolidated net sales for the second quarter increased 40% to $1.5 billion compared to the prior year period, supported by continued execution to meet strong market demand. While we have seen retail demand across many of our markets temper from the historical levels of 2021, July sales were up 5% to $368 million versus July, 2021, demonstrating positive trends, as we move into the second half of 2022, a Testament to our diversification efforts, which are helping to offset the deceleration we are experiencing in North American RV production. Q2 2022 sales to RV OEMs increase 52% compared to the prior year period, driven by strong wholesale shipments and market share gains stemming from content expansion in towables and motor homes. In all, sales to adjacent industries grew 37% versus the prior year period, supported by strong growth in marine sales, as well as meaningful growth in our manufactured housing business, which has remained elevated as the broader housing markets has slowed recently. That's going to continue to grow at probably a 30% to 50% clip and that's $400 million piece of our business, just the RV aftermarket and marine aftermarket piece. Some of the big water boats and fiberglass boats, those power boats, they're retail, they're dealer inventory, seem maybe like it's going to be more toward the end of the year, but we still feel we've got a lot of runway and still a lot of content and market share taking opportunity with, especially the Pontoon business out there that's growing in a pretty nice clip. Hey, good morning guys. Hey, good morning guys."
}