{
    "symbol": "LCII",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 13:24:04",
    "content": " Our consolidated net sales for the fourth quarter decreased 26% to $894 million compared to the prior year period, impacted by a reduction in RV production, partially offset by growth in our other end markets. And then, couple that with, like you just mentioned, consuming some of the high-cost steel layers in a lot of those hitch products, we've certainly seen -- very consistent with what we've seen across the entire business where it's quite a bit of a headwind through the back half of 2022 and into this first quarter or so of 2023. I do think that, obviously, from a percentage of sales perspective here in the fourth quarter and first quarter to see our SG&A costs slightly elevated, it's certainly the expectation, and then resume or head back to the more normalized levels when we get the volume in the second quarter. And I think that at least the way we're seeing unit production play out today, which there's a lot of uncertainty in that, Q2 would be, I would call it, 8% to 10% type margin, and then that improving throughout the remainder of the year with as volume increases. As you fast forward into the next quarter or two, I would expect those acquired revenues to probably not vary too much, and I think that we're going to -- we've won enough business and expect to continue gaining share during 2023 that I would expect that double-digit type organic growth rate for us to continue at least here in the near term, which is far greater than our historical 3% to 5% average. We've had to make as you've watched the RV industry production rates decline really ever since the first quarter of 2022, we've been taken cost out of the business ever since that point, whether it's labor or adjusting our fixed cost structure to the best of our abilities. Yes, I mean from a full year aftermarket perspective, Dan, I would say after we work through these first -- the first quarter, we would -- like I mentioned, towards the back half of the year, we'd get into the double-digit percentage growth rates."
}