{
    "symbol": "GCO",
    "quarter": 1,
    "year": 2023,
    "date": "2022-05-26 14:50:38",
    "content": " A few key highlights of the quarter include compared with pre-pandemic Q1 fiscal ’20, revenue up 5%, despite having 90 fewer stores, and adjusted operating income up 14% versus pre-pandemic digital sales up almost 75% now representing 19% of total retail sales, versus 11%, while branded wholesale sales increased almost 70% over the same time, helped by our Togast to acquisition. Gross margins continue to show strength versus last year due to continued full-price selling and limited markdown activity, which combined with expense leverage compared with pre-pandemic levels, yield adjusted EPS of $0.44, and nicely positive operating income, which historically has been more challenging in low volume quarters. Additionally, our business accelerated through the quarter with sequential improvement in retail sales in April and May to date versus last year, as inventory levels improved, and stimulus compares began to ease. And like we saw with Journeys throughout last year, the strength of our brands continue to draw enthusiastic shoppers back to stores, as the UK economy reopened more fully this quarter, and the Johnston & Murphy customer eagerly returned to shopping. Q1 was highlighted by record first quarter revenues, up 35% on a constant currency basis, compared to last year, and up 14% over pre-pandemic levels. Stores which were open for the entire quarter this year, versus about 20% of the time last year, were a big contributor to Schuh’s success. However, this was not at the expense of online as Schuh’s advanced digital capabilities allowed it to hold on to more than 60% of last year's outsize gains to drive digital sales up over 110% compared to pre-pandemic levels. Spread across digital, retail and wholesale fuel top line revenue up more than 45% year-over-year well above expectations, with sales almost on par with Q1 fiscal ’20 despite inventory levels, ending roughly 30% below the comparable period. Rounding out our divisional discussion, Licensed Brands posted an excellent quarter with sales surpassing expectations and operating margins increasing more than 200 basis points over last year. Journeys which was the biggest beneficiary of that stimulus last year, and was impacted by inventory delays this year was down 16%, partially offset by Schuh, up 28%, J&M, up 46% and Licensed Brands, up 5%. In summary, first quarter adjusted operating income was $9 million, a 2% operating margin compared to $19 million, or 3% last year and 2% pre-pandemic."
}