{
    "symbol": "GCO",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-01 11:34:04",
    "content": " Following a stimulus induced spending environment, in which consumers had ample disposable income to drive strong sales gains that significantly benefited the first half of last year, we are pleased we continue to drive our business forward and maintain the large majority of those gains. Although markdown and promotional actions have increased from essentially none last year, clean inventory and more full price selling delivered both better-than-expected and higher Journeys gross margins, compared with pre-pandemic times. Constant currency revenue hit a Q2 record, up 9%, compared to last year and up 14% over pre-pandemic sales as strong demand fueled consumer spending, despite historic levels of inflation. Our efforts to reimagine J&M for a more casual, more comfortable, post-pandemic environment is delivering outstanding results with Q2 sales up 22%, compared to last year and operating income more than double pre-pandemic levels. Good way to measure the benefits of our efforts to restate our P&L is to compare Q2 adjusted SG&A to pre-pandemic fiscal year '20 versus fiscal year '20, we leverage total adjusted SG&A by 200 basis points, driven by store occupancy leverage of approximately 300 basis points, which enabled investment to drive our digital business. In summary, first quarter adjusted operating income was $10 million, a 1.9% operating margin, compared to $21.1 million or 3.8% last year and 1% pre-pandemic. While net inventories are up $150 million year-over-year, we believe it's more meaningful to compare this year's inventory levels to pre-pandemic Q2 fiscal year '20 since outsized stimulus demand and supply chain limitations resulted in unusually low inventories last year. Going into this year, while we knew we had some difficult comparisons to last year, particularly during the first half due to stimulus, we felt that the back half provided good opportunity for growth, mainly due to the replenishment of inventories and having what consumers needed at the key selling periods of back to school and holiday. Our gross margin guidance remains unchanged and we continue to expect gross margins to be down versus last year by 60 basis points to 80 basis points, mainly due to increased markdown activity, especially in the quarters in which markdowns typically occur, as compared to essentially no markdown in promotional activity last year. Regarding Q3 gross margin, we expect lower gross margins, compared to last year, but at about half the levels of Q2's reduction, due to higher freight and logistics costs and another difficult inventory reserve comparison last year for J&M. So I wanted to start talking about Johnston & Murphy given, I think, what's very clear is that you've done a tremendous job turning this business around from the start of COVID when everything was locked down and people weren't going to the office and now you've pivoted the business to be more casual, driving what I believe was a record second quarter revenue for the segment in spite of having fewer stores than prior years, which is incredibly impressive."
}