{
    "symbol": "GCO",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-02 11:44:04",
    "content": " Against last year's record third quarter, we grew revenue 4% on a constant currency basis, achieving significant improvement over the first half of the year, and comps were up 3% with every business posting positive gains. The progress made with our footwear-focused strategy to increase digital penetration, strengthen consumer connections, grow our footwear brands and reshape our retail cost structure has put the Company in a better position to both outperform and favorable economic backdrop like we experienced last year and effectively navigate the more difficult consumer and market conditions we're facing today. Adjusted EPS of $1.65 compares to last year's level of $2.36, but represents a 24% increase over pre-pandemic levels, and while at the same time investing in our business, we returned capital to shareholders, repurchasing about 3.5% of shares outstanding during the quarter. Overall, Schuh is benefiting from better access to higher-tiered products from several key brands, effective marketing strategies like the introduction of its loyalty program, high levels of customer engagement, such as its student events and Schuh's brand purpose pillars which are resonating with its youth consumer, all of which are helping Schuh perform well on a year-over-year basis despite the economic turbulence exchange rate pressure and lapping significant one-time gains. Our efforts to re-imagine J&M for a more casual, more comfortable post-pandemic environment are delivering strong results with Q3 sales up nearly 20% and operating income that doubled compared to last year. On a comp basis, Journeys' total comps were up 1%, Schuh total comps increased 3% driven by stores and J&M continued its strength versus last year in both stores and digital, with total comps up 20%. Without last year's one-time credits, total SG&A deleveraged 150 basis points, driven by marketing, selling and other salary costs and surface freight expense, while occupancy cost declined and leveraged 80 basis points. In summary, third quarter adjusted operating income was $26.3 million, a 4.4% operating margin compared to $45.2 million or 7.5% last year and 5% pre-pandemic. While net inventories are up $200 million year-over-year, we believe it's more meaningful to compare this year's inventory levels to pre-pandemic Q3 fiscal '20, since outsized stimulus demand and supply chain limitations resulted in unusually low inventories last year. Finally, the takedown in our Q4 sales projection will cause us to deleverage SG&A expenses slightly more than we expected, resulting in deleverage on a full year basis in the range of 100 to 120 basis points versus last year, but still showing improvement over pre-pandemic levels."
}