{
    "symbol": "SYK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 22:12:05",
    "content": " For the quarter, organic sales growth was 6% with high single-digit growth from our MedSurg and Neurotechnology businesses, led by endoscopy, instruments and neurocranial. With half of the year behind us and a very strong order book, we now expect full year organic sales growth of 8% to 9% and due largely to foreign currency exchange, we now expect adjusted earnings per share to be in the range of $9.30 to $9.50 per share. While we experienced solid customer order performance from our capital businesses, the sales growth was restricted because of ongoing headwinds, which included raw material shortages, primarily related to electronic components and installation delays in parts of our business due to hospital staffing challenges. Our sales growth has been somewhat constrained by the continued supply chain challenges and electronic component shortages, especially impacting the capital products in our MedSurg businesses, primarily in our medical business. Endoscopy had U.S. organic sales growth of 15.4%, reflecting very strong performances across all of their portfolio, including video products and double-digit growth of our communications and sports medicine businesses. Medical, which includes our recently acquired Vocera business, had a U.S. organic sales decline of 2.4% driven by the aforementioned supply chain challenges primarily impacting our emergency care products. Our U.S. Neurovascular business posted an organic decline of 1.8% driven by a strong double-digit comparable in 2021 as well as competitive pressures, disruptions due to hospital staffing shortages and softer market conditions in part because of supply shortages of contrast use in procedures. Internationally, MedSurg and Neurotechnology had organic sales growth of 9.9%, reflecting double-digit growth in the endoscopy, neurovascular and neurocranial businesses, somewhat offset by medical. Considering our second quarter results, the strong order book for capital equipment and the sales momentum in our implant businesses, we now expect full year 2022 organic sales growth to be in the range of 8% to 9%. Based on our performance in the second quarter, including consideration of the continued supply chain challenges and the inflationary environment, together with our increased sales guidance and continued financial discipline, and most significantly, the anticipated future impact related to foreign currency, we now expect adjusted earnings per share to be in the range of $9.30 to $9.50. Thanks for taking the questions. Thanks for taking the questions. Product pipeline, I think I mentioned before that we are really entering a pretty exciting period going into next year with System 9 and next-generation power tools, 78 camera, the next-generation camera life pack defibrillator, which is the big sort of the big, large complex defibrillator and then the Neptune AS , which is a smaller version of Neptune that will get us into procedure areas that not currently in today, especially GI, which is a very, very high volume procedure. Thanks for taking the questions. Thanks for taking the questions. Thanks for taking the questions. Thanks for taking the questions. Thanks for taking the questions."
}