{
    "symbol": "SYK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 21:03:05",
    "content": " With one quarter behind us, a very strong order book and these macroeconomic dynamics, we now expect full year organic sales growth towards the high end of our guidance range of 6% to 8% and expect adjusted earnings per share at the lower end of our guidance range of $9.60 to $10 a share. While we experienced solid growth from our capital businesses in the quarter, the growth was limited as a result of ongoing headwinds, including raw material shortages, primarily related to electronic components and installation delays because of hospital staffing challenges. For the quarter, U.S. organic sales increased by 10.5%, reflecting strong double-digit growth in many of our businesses. Endoscopy had U.S. organic sales growth of 17.7%, reflecting strong performances across their portfolio, including video products and double-digit growth of their communications and Sports Medicine businesses. The Medical business, which includes our recently acquired Vocera business, which closed in February, had U.S. organic sales growth of 6.2%, reflecting solid performances in their stage and acute care businesses, somewhat offset by the aforementioned supply chain challenges primarily impacting our emergency care products. Orthopaedics & Spine had constant currency and organic sales growth of 7.2%, which included 8.2% of organic growth in the U.S. Our Hips business grew 8.5% organically in the U.S., reflecting strong primary hip growth fueled by the launch of our Insignia Hip Stem and improved underlying market dynamics. Adjusted R&D spending was 7.2% of sales, which represents a 35 basis point increase versus first quarter of 2021, and this reflects our continued commitment to innovation funding and the related future growth it will provide. Given the dynamic supply chain pressures, COVID uncertainty, strong order book for capital equipment and considering our first quarter results, we now expect full year 2022 organic sales growth towards the high end of our previously guided range of 6% to 8%."
}