{
    "symbol": "SYK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 21:02:03",
    "content": " In the fourth quarter, we delivered organic sales growth of 13.2%, which brought our full year organic sales growth to 9.7%. We remain confident in the outlook of our business and expect to continue to deliver sales growth at the high end of med tech, which is reflected in our full year 2023 guidance of organic sales growth of 7% to 8.5%. Our adjusted EPS of $3 in the quarter was up 10.7% from 2021, driven by higher sales and strict cost discipline, partially offset by inflationary pressures and the impact of foreign currency exchange translation, which was unfavorable $0.16. Our full year adjusted EPS was $9.34, which represents growth of 2.8% from full year 2021, reflecting the favorable impact of sales growth, lower net interest costs and a lower effective tax rate, partially offset by inflationary pressures and the unfavorable impact of foreign currency exchange translation of $0.31. Our U.S. hip business grew 11.3% organically, reflecting strong primary hip growth fueled by the recent launch of our Insignia Hip Stem, the ongoing success of the Mako THA 4.1 software upgrade and continued procedural growth. Our adjusted gross margin of 62.7% was unfavorable, approximately 310 basis points from the fourth quarter of 2021 and in line with Q3 2022, reflecting the impact of the purchases of electronic components at premium prices and other inflationary pressures primarily related to labor, steel and transportation costs, and unfavorable business mix. Given the above, we expect organic sales growth to be in the range of 7% to 8.5% for the full year 2023 when compared to 2022. First of all, just picking up where Kevin left off, if you think about the topline, entering the year with such a strong order book, itâ\u0080\u0099s really going to kind of bode well for growth of our big capital businesses. But if you look at a full year kind of organic growth rate, Instruments 10%, Endoscopy 15%, Medical 11%, kind of on a rolling four-quarter basis. We actually feel pretty good about our access to supply, we are seeing a reduced volume of spot buys, which are those really high cost items and we are also beginning to work with our original set of vendors and also going up the food chain and actually working with chip suppliers so that we feel like we have a good handle on whatâ\u0080\u0099s going to happen with supply chain, but it should become better quarter-to-quarter-to-quarter with good improvement and visible improvement in the back half of the year. If I look at within Instruments, Instruments had 10% organic growth in 2022 and thatâ\u0080\u0099s because we decided to split orthopedic instruments and circular technologies a few years ago and they are both growing extremely well."
}