{
    "symbol": "HUM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 11:42:04",
    "content": " Medicare Advantage membership growth and revenue remain in line with expectations, total medical costs and our individual Medicare advantage business were lower than initial expectations for the quarter with the favorable inpatient trends seen throughout the year continuing with some moderation. As Bruce shared, while it's still early in the AEP, we remain confident that the investments we made to support 2023 growth have positioned us well and we are pleased to share our individual MA membership growth expectations today of 325,000 to 400,000 members, which is in line with our expectation of high-single digit market growth. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open. One moment for our next question. Your line is open. Your line is open. In terms of your question about how we think about the MA space in Home Health, Andy mentioned at Investor Day the work that his team is doing, both on implementing a full value-based model, which is inclusive of utilization management, network management, clinical advancement to take full capitated risk on Medicare patients and as we've mentioned in my commentary, we expect to have 15% of our members covered by that model by the end of the year. Your line is open. Your line is open. Your line is open. Your line is open. Hi, Michael, so in terms of your first question, in terms of how our thinking has developed since sort of before all the data was released, I would say, as the data came out and we commented investor, we are pleased to see that our positioning is relatively speaking, generally where we expected it to be going into 2023, and that the â\u0080\u0093 certainly the positive rate notice and then in addition, the additional value that our value creation initiative opened up for us in terms of capacity to reinvest into our Medicare product was sufficient to get us back to a really strong value proposition. Your line is open. Your line is open. Your line is open."
}