{
    "symbol": "HUM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 14:37:06",
    "content": " The lower utilization trends and lack of COVID headwinds seen to-date give us confidence in raising our full year adjusted EPS guide by $0.25 to approximately $24.75, while still maintaining a $0.50 EPS COVID headwind for the back half of the year. Despite the increase in expected Medicaid membership for the year, which carries a higher benefit ratio as well as the higher-than-anticipated non-inpatient cost in group Medicare, we have maintained our original full year retail benefit ratio guidance as outperformance in our individual Medicare Advantage business is providing an offset in the segment. We have updated our full year guidance ranges to reflect this anticipated transaction, resulting in a reduction in Healthcare Services segment revenue of approximately $400 million at the midpoint, which reflects the hospice divestiture, partially offset by the increased pharmacy expectations discussed in the first quarter. Before closing, I would again reiterate that we are pleased with our performance to-date, fueled by broad-based strength across the enterprise, supporting our full year guidance raise and providing capacity to make additional investments in marketing and distribution in the back half of 2022 to further support our improved 2023 Medicare Advantage product offerings. We are well positioned to achieve our $1 billion value creation goal, which has allowed further investment in our Medicare Advantage offerings for 2023 and expansion of our healthcare services capabilities, while remaining on track to generate earnings growth in 2023 within our long-term target range. As we completed all of the planning work by the Medicare organization, as they thought through their product strategy, I would say the Medicare team was really pleased with the capacity that, that $1 billion value creation effort created for them, and they feel really good about the investments it allowed them to make and are feeling confident that we will be able to demonstrate significant improvement in our Medicare growth in 2023. So when you think about our bids, we would not have anticipated any of the favorability weâ\u0080\u0099ve seen this year to signal sort of sustained below baseline utilization or medical costs and would have assumed in 2023 a more steady state sort of normal course level of medical cost trend. In terms of MRA for 2023, certainly, as I mentioned, to the degree we continue to see lower utilization in 2022 relative to the expectations, we will certainly do the assessment to understand whether there would be any implications to â\u0080\u009823 risk adjustment, but I would expect net-net for that still to be positive even after considering MRA. I would say though, given how the trends we have seen in the last number of years, and I think we have been really smart about the investments we have made in 2023, we werenâ\u0080\u0099t trying to position ourselves to be in the number one sort of product value position everywhere that would result in outsized growth or anything that I can think of from an anti-selection perspective."
}