{
    "symbol": "CDMO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-29 22:00:23",
    "content": " Revenues for the fourth quarter of fiscal 2022 were $31.2 million, representing a 13% increase compared to $27.6 million recorded in the prior year period. For the 2022 full fiscal year, revenues were $119.6 million, a 25% increase compared to $95.9 million in the prior year period. The increase in revenues for the 2022 full fiscal year as compared to the prior year period can primarily be attributed to an increase in the number and scope of in-process and completed manufacturing runs, unutilized reserve capacity fees and process development revenues. Total SG&A expenses for the fourth quarter of fiscal 2022 were $5.9 million, an increase of 17% compared to $5.1 million recorded in the fourth quarter of fiscal 2021. During the fourth quarter of fiscal 2022, we recorded a non-cash income tax benefit of $115 million or $1.63 per diluted share due to the release of our valuation allowance recorded against the companyâ\u0080\u0099s deferred tax assets. For the fourth quarter of fiscal 2022, the company recorded net income attributable to common stockholders of $115.6 million or $1.87 per basic and $1.65 per diluted share as compared to a net loss attributable to common stockholders of $2.7 million or $0.04 per basic and diluted share for the fourth quarter of fiscal 2021. For the 2022 full fiscal year, the company recorded net income attributable to common stockholders of $127.7 million or $2.08 per basic and $1.84 per diluted share as compared to net income attributable to common stockholders of $3.3 million or $0.06 per basic and diluted share for the 2021 full fiscal year. For the fourth quarter, the company achieved an adjusted EBITDA of $5.9 million and $30.4 million for the 2022 full fiscal year. These represent increases of 13% and 53%, respectively, when compared to adjusted EBITDA of $5.2 million for the fourth quarter of 2021 and $19.9 million for the 2021 full fiscal year. Our cash and cash equivalents on April 30, 2022 were $126.2 million compared to our third quarter balance of $150 million and the prior fiscal year-end balance of $169.9 million. The fiscal years 2021 and 2022 have clearly demonstrated the effectiveness of the business model, which we will enable these margins to recover and be further enhanced in the years to come, as we endeavor to fill what will be close to $400 million of capacity by this time next year. Given the growth momentum achieved during fiscal â\u0080\u009822, our year-end backlog and the increase in demand anticipated during fiscal â\u0080\u009823, we are pleased to announce revenue guidance for fiscal 2023 of between $140 million and $145 million, representing a projected increase of 17% to 21% as compared to the fiscal 2022 revenue."
}