{
    "symbol": "HD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 12:46:10",
    "content": "  Operator: Greetings, and welcome to The Home Depot Third Quarter 2022 Earnings Conference Call. Joining us on our call today are Ted Decker, Chair, President and CEO; Jeff Kinnaird, Executive Vice President of Merchandising; and Richard McPhail, Executive Vice President and Chief Financial Officer. Following our prepared remarks, the call will be open for questions. And as a reminder, please limit yourself to one question and one follow-up. If we are unable to get your questions during the call, please call our Investor Relations department at 770-384-2387. Before I turn the call over to Ted, let me remind you that todayâ\u0080\u0099s press release and the presentations made by our executives include forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. Sales for the third quarter were $38.9 billion, up 5.6% from the same period last year. Comp sales were up 4.3% from the same period last year, and our U.S. stores had positive comps of 4.5%. From a geographical perspective, each of our 19 U.S. regions delivered positive comps versus last year, while Mexico posted comps above the Company average and Canada below the Company average, both in local currency. The team has done a fantastic job serving our customers while continuing to navigate global supply chain disruptions, inflation and a tight labor market. As they always do, our associates and suppliers did an incredible job supporting those in the path of both Hurricanes Fiona and Ian and our thoughts continue to be with those impacted by these storms. While we did see some deceleration in certain products and categories, as Jeff will detail, the project business remains strong across most of our departments. We also saw year-over-year growth with both, our Pro and DIY customers in the quarter. While the business performed very well and our consumer remains resilient, we are navigating a unique environment. However, we continue to closely monitor elasticities and trends across our business and believe we have the tools, team and the experience to effectively manage in any environment. Despite near-term uncertainties, we believe the long-term underpinnings of demand for home improvement remains strong, and we are well positioned to leverage our distinct competitive advantages to capitalize on compelling growth opportunities in our space. We are pleased with the traction we are seeing in our interconnected business as we continue to build on our momentum with both, our Pro and DIY customers. For example, as we have better functionality and capabilities in our Home Depot app, we see greater engagement. In fact, throughout the year, we have seen strong double-digit growth in monthly active users versus last year. The growth is attributable to several enhancements we have made, including an improved online experience for our Pro loyalty program, the seamless connectivity weâ\u0080\u0099ve provided for a military program and the launch of our new store mode feature, which makes navigating the store and interacting with products much easier. We are currently launching a new application on our in-store mobile devices called Sidekick, which is an in-aisle tasking tool designed to direct associates to the highest value tasks in real time. By simplifying our operations, we can generate productivity to enhance both, the customer and associate experience. For the Pro customer, we remain focused on investing in an ecosystem of capabilities, including enhanced fulfillment, a more personalized online experience as well as other business management tools to drive deeper engagement with these customers. While we are focused on removing friction from the shopping experience, we are also onboarding capabilities to help our Pros run their businesses more efficiently. To that end, we recently announced our Path to Pro platform, connecting skilled trades people with hiring trades professionals. Our team remains focused on what is most important, our associates and customers, our merchants, store and MET teams, supplier partners and supply chain teams did an outstanding job delivering value and service to our customers throughout the quarter. Thank you, Ted, and good morning, everyone. As you heard from Ted, during the third quarter, we continued to see solid demand for home improvement projects and strong execution from our teams and supplier partners. Build materials, plumbing, lumber, millwork, paint and hardware had comps above the company average. All other departments with the exception of appliances, flooring and indoor garden were positive, but below the Company average. During the third quarter, our comp average ticket increased 8.8% and comp transactions decreased 4.4%. Inflation from core commodity categories positively impacted our average ticket growth by approximately 200 basis points during the third quarter, driven by inflation in build materials, lumber and copper. Big ticket comp transactions or those over $1,000 were up 10.1% compared to the third quarter of last year. We saw a big ticket strength across many Pro-heavy categories like fasteners, pipe and fittings and gypsum. During the third quarter, both Pro and DIY sales growth were positive, with Pro outpacing DIY. In addition, our Pros tell us their backlogs remain strong. During the quarter, our project business remained healthy. This can be seen in the double-digit comp performance of our build materials, plumbing, lumber and millwork departments as well as in other categories like fencing, siding, conduit boxes and fittings, hubs and showers and cabinets. To serve the Pro, itâ\u0080\u0099s about removing friction through a multitude of enhanced product offerings and capabilities. As you know, weâ\u0080\u0099ve been on a journey to remove friction from our interconnected shopping experience. And in the third quarter, we achieved an important milestone. This was driven by our continued investments, which are resonating with our customers. For example, during the quarter, lead times improved across different fulfillment capabilities, which drove greater conversion. For those customers that chose to transact with us online during the third quarter, approximately 50% of our online orders were fulfilled through our stores, a testament to the power of our interconnected retail strategy. During the third quarter, we hosted our Halloween event and could not be happier with the results. 2022 was a record sales year for our Halloween program, both in-store and online, as our customers continue to add to their collection with our unique and exclusive assortment. As we turn our attention to the fourth quarter, we intend to continue this momentum with our annual holiday, Black Friday and gift center events. Our teams have sourced the most compelling artificial tree assortment we have ever had, which makes it easier for our customers to find the perfect tree for their holiday. In terms of our decorative holiday program, we couldnâ\u0080\u0099t be happier with our industry-leading assortment with extraordinary features and functionality that looks great and also reflects exceptional value. In our gift center, we continue to lean into brands that matter most for our customers with our assortment of Milwaukee, RYOBI, Makita, DEWALT, RIDGID, Husky and more. Earlier this fall, we launched the next generation of the Milwaukee drill and Drive M18 fuel lineup, offering more power, run time and increased safety for our customers. And we have our exclusive RIDGID 4 tool, 18-volt brushless combination kit with 2 free tools, all backed by our lifetime service agreement. We have multiple exclusive offers, including the LG side-by-side refrigerator with craft ice, a great innovation and ice-making. As with prior years, weâ\u0080\u0099ve extended these events over several weeks, and we believe we are well positioned with the right brands, the right inventory and a great customer experience. With that, Iâ\u0080\u0099d like to turn the call over to Richard. In the third quarter, total sales were $38.9 billion, an increase of $2.1 billion or 5.6% from last year. During the third quarter, our total company comps were positive 4.3%, with positive comps of 7.1% in August, 4.4% in September and 2.1% in October. Comps in the U.S. were positive 4.5% for the quarter, with positive comps of 7.2% in August, 4.2% in September and 2.5% in October. On a three-year basis, monthly comps were consistent across the quarter. In the third quarter, our gross margin was approximately 34%, a decrease of approximately 10 basis points from last year, primarily driven by supply chain investments. During the third quarter, operating expense as a percent of sales decreased 18 basis points to 18.2%. Our operating expense performance was in line with our expectations, which reflected continued wage investments as well as planned investments designed to drive efficiency in our store environment. In the third quarter, our effective tax rate was 24.4%, down from 24.5% in the third quarter of fiscal 2021. Our diluted earnings per share for the third quarter were $4.24, an increase of 8.2% compared to the third quarter of 2021. During the third quarter, we opened three new stores, one in the U.S. and two in Mexico, bringing our total store count to 2,319. At the end of the third quarter, inventories were $25.7 billion, up $5.1 billion compared to the third quarter of 2021. Inventory turns were 4.3 times, down from 5.4 times last year. After investing in our business and paying our dividend, it is our intent to return excess cash to shareholders in the form of share repurchases. During the third quarter, we invested $770 million back into our business in the form of capital expenditures. And during the quarter, we paid approximately $1.9 billion in dividends to our shareholders and we returned approximately $1.2 billion to shareholders in the form of share repurchases. Computed on the average of beginning and ending long-term debt and equity for the trailing 12 months, return on invested capital was approximately 43.3%, down from 43.9% in the third quarter of fiscal 2021. As you heard from Ted, we are very pleased with the solid performance we saw during the third quarter. As weâ\u0080\u0099ve said throughout the year, we find ourselves in a unique environment with many cross-currents. We are operating in a broad-based inflationary environment, not seen in four decades while managing through constrained global supply chain conditions, all against the backdrop of monetary policy shifts intended to moderate demand. To date, our customer has proven resilient. Before opening the call for questions, we are pleased to announce that we will be holding an investor conference on June 13, 2023 in New York City. The sentiment and narrative around your stock is so heavily focused right now on factors that are out of the Home Depotâ\u0080\u0099s control, like the state of the housing market and its ultimate impact on home improvement demand. And if your comps were only down 3%, given the flexibility that you have with your cost structure coupled with your current capitalization that affords you to buy back a lot of stock, you could actually grow earnings in that sort of scenario. And youâ\u0080\u0099ve heard some of this before, but if I can just step back a minute and lay out the environment the way we see it. I mean, we still feel very good, Michael, about our business. And remember, weâ\u0080\u0099ve grown this business $47 billion in the last two and three quarters a year. From our core customer, we think our customer is still healthy. I mean, our customer tends to have a good job, growing wages, strong balance sheets. However, as Richard said in his prepared notes, I mean it is a unique environment, lots of cross-currents, inflation and rising interest rates, et cetera. But given all that, our customer has remained resilient and engaged. As we said, both our Pro and DIY customers grew again in this past quarter. Project demand, in particular, is very strong. Now, Iâ\u0080\u0099m sure weâ\u0080\u0099ll get into some housing questions and housing values may go down a bit, but weâ\u0080\u0099re still going to be up meaningfully on a two-year basis. And again, thatâ\u0080\u0099s difficult to get at a root cause. I mean, thatâ\u0080\u0099s why we have raised guidance throughout the year is that the price sensitivity wasnâ\u0080\u0099t as strong as we thought it would be. However, our guidance implies that fourth quarter comps will be the lowest for the year, albeit positive and we have tougher comps from Q4 last year. So, with all of that as a backdrop, I mean, as I said in my comments, we believe we have the team, the strategy, the initiatives with each of our consumer and Pro that weâ\u0080\u0099ll continue to take share in any operating environment. And while there may be some of these cross-currents in the next quarters in housing, we still feel the backdrop of housing, the fundamental shortage of housing in this country and the aging of homes is incredibly strong for our space in the medium to long term. But in light of some of the deceleration that youâ\u0080\u0099re seeing, one might assume that that might be a prelude to what could be a more pronounced deceleration into â\u0080\u009823, especially as some of the material benefit from inflation that the Home Depot has experienced this year fades. Well, weâ\u0080\u0099ll talk about â\u0080\u009823 after our fourth quarter earnings call in February. But weâ\u0080\u0099re focused on what we can control, rolling out our strategies, delighting our customers and taking share in any environment. I donâ\u0080\u0099t know if this lag is longer than other lags or -- and Ted, you just made the case that maybe sales decouple from these metrics. Just to maybe sort of put some further points on Tedâ\u0080\u0099s backdrop, a lot is made of home prices and -- home price appreciation change and home price appreciation, we think, has always driven home improvement demand, and weâ\u0080\u0099ve talked that to you for a long time. But what we also really ran into even, Iâ\u0080\u0099d call it, the middle part of the last decade was that as home prices begin to -- call it, become more steady, price discovery, in our view, became a little bit harder. And I think we are all somewhat anchored to what we observed in 2008 and â\u0080\u009809, and many of the folks on this call, in fact, almost all of us were here during 2008, 2009. So, it wasnâ\u0080\u0099t -- we were not in a period of home price depreciation that youâ\u0080\u0099re talking about single digits. When I look at the situation now, as Ted said, we have home price appreciation of essentially 40% year-over-year -- sorry, over the last three years. In fact, year-over-year home prices are up 13%. Since December, home prices are up 8%. But I think if you ask -- or you listen to most observers, and I think most people are calling for, if there is a correction, a modest one. Because as Ted said, if youâ\u0080\u0099re a homeowner, youâ\u0080\u0099ve done quite well from a balance sheet perspective. And then, weâ\u0080\u0099re seeing another just interesting dynamic where with mortgage rates increasing, our customer is becoming more and more likely to stay in place and begin a project, so improved in place. And so just sort of going back to the health of the homeowner back in over a decade ago, 25% of mortgages were underwater back then. Of owner-occupied households, 40% are owned outright, no mortgage. Of the 60% that do have a mortgage, 90% of those mortgages are fixed rate, 73% of those mortgages are fixed rate below 4%. So, we are now seeing a dynamic of stay in place and improve your home. And thatâ\u0080\u0099s what our customers are telling us, and thatâ\u0080\u0099s what the Pros are telling us their customers are telling them. We have seen some deceleration in inflation in the recent months, which is good for our consumers. But broadly, we are still experiencing some inflation in some specific categories. In fact, weâ\u0080\u0099ve seen a lot of stabilization in that industry versus the prior two years. And again, weâ\u0080\u0099re managing it very closely. Thatâ\u0080\u0099s -- yes, I think thatâ\u0080\u0099s a fair representation, Chris. Well, I would say that the healthiest thing we see -- and as you can imagine, we look at every data set and by geography and category, et cetera. And we look at it with both our Pro customers, household Pros versus consumers, and that project demand remains strong with each of the Pro and the consumer. And again, as everyone has purchased in the last three years, a lot of those categories, and theyâ\u0080\u0099ve moved into more project and home improvement, or is there a reaction to inflation. You look at our indoor garden business, two big categories, you might say, are more discretionary grills and patio. But patio, we had one of the strongest patio quarters that I can remember. Itâ\u0080\u0099s definitely got our attention, and thatâ\u0080\u0099s why weâ\u0080\u0099re cautious. And I guess just following up, you talked about consistent three-year trends over the month. Obviously, October was an incredibly strong month last year. Look, we see some normalization back to 2019 in terms of the consumer trend. In the last couple of years, weâ\u0080\u0099ve seen pull forward in concerns of supply chain-driven shortages across retail. So, we do see potentially just the return back to more normal holiday spend by the consumer. As I commented in our prepared remarks, we feel very good about our Black Friday, our gift center, our decorative holiday assortments, and weâ\u0080\u0099re excited about the overall Black Friday season. And just in case you donâ\u0080\u0099t have the numbers in front of you, Chris, you called out monthly cadence. So really, our comps were consistent across the months, so not just a 3-year but also a 2-year basis. Just keeping in mind that last yearâ\u0080\u0099s comps in August, September and October were 3 1, 4 5 and 9, 9 sequentially. So, if you look at a 2- or 3-year basis, maybe smoothing some of that out, the 1-year months donâ\u0080\u0099t tell you quite as much. So, we think we had about $120 million impact from hurricanes this quarter. But keep in mind, we were overlapping a similar amount from last year. So, these hurricanes and storm impacts extend across quarters. A lot of discussion around the top line outlook given the housing uncertainty, but I wanted to focus on margin. Weâ\u0080\u0099re managing margin closely, Steven. We -- look, Iâ\u0080\u0099d just add that we think we have the tools and the experience and the people to manage pricing costs as well above than anyone else here. Over the last three years, thereâ\u0080\u0099s been a mix disruption, right, in our value chain. And yes, I think the proof is in the pudding when you look back at our history. So, I think everyone here kind of understands thereâ\u0080\u0099s some uncertainty around the broader home improvement environment given whatâ\u0080\u0099s happening with interest rates. Iâ\u0080\u0099ve been here, as you may know, over 22 years, and weâ\u0080\u0099ve always known what we needed to do to capture or share of wallet with that Pro. And as we build out these capabilities, introduce them to the customers, weâ\u0080\u0099re seeing the engagement and the incrementality of sales growth take off. And Hector, could give us a little more insight of what your building would be great. Scot, just -- we continue to be super excited about the response from our Pros as we continue to enable capabilities to remove friction from our ecosystem. Weâ\u0080\u0099re seeing those customers grow, not just with direct sales with our outsized sales associates, but theyâ\u0080\u0099re also engaging more on our digital platform and engaging more in our stores for that unplanned purchase. And as we continue to grow around other capabilities, whether itâ\u0080\u0099s in the B2B, digital platform, or in-store platform, we just continue to be super excited about the response of our Pros. We are removing friction from all the different channels, and our customers continue to engage with us more and more. As Ted said, weâ\u0080\u0099re excited. One of the reasons weâ\u0080\u0099re so excited because itâ\u0080\u0099s such a fragmented market, such a fragmented market of suppliers. And so, we just think the opportunity is exciting and tremendous and part of the excitement is itâ\u0080\u0099s hard to size. But I can say, I mean, we donâ\u0080\u0099t break out these numbers, but each of Pro and consumer grew again this quarter, and the Pro yet again grew meaningfully faster than the consumer. And our large Pro, the ones who are engaging with what Hector and team are developing, are growing the fastest yet. I donâ\u0080\u0099t know if we break that out, but the strongest, again, was the large Pro. Look, Iâ\u0080\u0099d say -- I mean, maybe the way to put it, too, is our Pros shop across our assortment. So youâ\u0080\u0099re going to sort of see similar dynamics, ticket transaction across the business, generally speaking. We are the customerâ\u0080\u0099s advocate for value, and we watch the market and our competitors very closely. But -- and on the cost side, Chuck, itâ\u0080\u0099s definitely easing. Lumber is obviously way down from peaking at nearly $1,500 to now under $500 from peak to current during these last three years. However, we still see inflation across the store. So while some will be coming down in certain categories with costs and retails, our forecast at this point is that net inflationary cost pressures continue into 2023. So, my first question, I think I want to ask that -- Chuckâ\u0080\u0099s question, maybe a little bit differently. But I mean, with regard to inflation, what weâ\u0080\u0099ve seen now for a while as Home Depot has done a remarkable job kind of strategically passing along inflation. So Ted, youâ\u0080\u0099ve mentioned a few times now youâ\u0080\u0099re starting to see some inflationary pressures ease. Well, itâ\u0080\u0099s a great question, and you could say, hey, if elasticities werenâ\u0080\u0099t as sensitive on the up, would they also likely not be on the moderation, if you will. I think broadly, the price sensitivity wasnâ\u0080\u0099t as sharp as we expected the last two years. On certain commodities, lumber, copper wire, where weâ\u0080\u0099re pricing to market weekly, you see a much more classic reaction to price and unit productivity. And when we saw those grills get up over $600, we saw a more dramatic drop off in engagement. And when Jeff and the team work those prices down even to the low-400s or high-400s, low-500s, you saw a response with unit productivity. Across the board, though, there has been -- and Jeff mentioned this, there has been so much innovation across our categories. If you think of the dramatic shift of outdoor power equipment in power tools, in appliances and what the features and benefits of these products are, the technology embedded in these products. Iâ\u0080\u0099m not sure itâ\u0080\u0099s quite an iPhone, but weâ\u0080\u0099re getting close to power tools being in that genre. And people love the newness and the innovation and theyâ\u0080\u0099re albeit higher prices, but people are responding in buying. So, I think itâ\u0080\u0099s a mix, Brian, across the categories, and thatâ\u0080\u0099s what Jeff and our merchant teams do such a great job managing every day. And as we said, we expect comps to be positive in the quarter. Zack, I may have to get you to repeat the second part of the question. On the first part of the question, look, weâ\u0080\u0099re really pleased with our consumer business through the year. And so, we had a seasonal impact to consumer in Q1 of this year. Q2 and Q3 have both been positive, and weâ\u0080\u0099re very happy with that business. Well, I donâ\u0080\u0099t think that thereâ\u0080\u0099s any way to conjecture that. And what weâ\u0080\u0099ve seen through cycles is that, number one, we do very well with both. But really, what we have going right now is what weâ\u0080\u0099re observing, which is the Pro business is leading the Company that shows us that the demand for large projects is very healthy right now. And we -- someone asked this question before, Iâ\u0080\u0099m not sure we answered it. If you take my grill or appliance example, itâ\u0080\u0099s not that people ultimately bought and they traded down. I think, itâ\u0080\u0099s that people have already purchased in the past few years. Our traeger business, for example, is incredibly strong as they bring out innovation, customers respond. Well, thatâ\u0080\u0099s such a great question, and itâ\u0080\u0099s something we observe and build our theories of the case. When you go back now, what are we -- weâ\u0080\u0099re 11 quarters of this pandemic. And then, the last six quarters, we start to lap that tremendous activity but also saw for all the reasons we know, supply chain, commodities, global cost pressures, we saw significant cost in our business, and comps were driven as they were this past quarter with ticket over transactions. What we see now as you step back approaching three years is our transaction run rate, our sort of three-year CAGR at this point, is more or less pre-pandemic rates. And you could look at that at one hand and say, \"Wow, hereâ\u0080\u0099s the slowdown.\" On the other hand, Richard used the term holding serve, you can look and say, oh my gosh, this industry erupted with demand for 1.5 years. Then it cycled significant cost increases, the customer hung in there and was resilient and your net over this three-year period up in transactions and units despite what we believe youâ\u0080\u0099ll hold on to these price levels. But when you digest and look back on whatâ\u0080\u0099s happened in the last three years, youâ\u0080\u0099d say, wow, thatâ\u0080\u0099s a pretty incredible market segment. In fact, in 10 of the last 13 years, your fourth quarter comp has been better than your third quarter comp. Yes, weâ\u0080\u0099ve had an exceptional fourth quarter. Weâ\u0080\u0099ve -- in the past years, weâ\u0080\u0099ve built the business on the backs of decorative holiday. And we are the customerâ\u0080\u0099s advocate for value in that category, and we have great involution and again great value for our customers. Second, weâ\u0080\u0099ve built the business of gifting in our gift centers. And you look at the innovation that weâ\u0080\u0099re delivering to our Pro and to our consumer, itâ\u0080\u0099s exceptional. I spoke earlier about the M18 Milwaukee drill/driver combo kit, the innovation is just exceptional, as Ted talked to earlier. Weâ\u0080\u0099re investing in capabilities like I spoke earlier, in terms of delivery. Weâ\u0080\u0099re investing in dot-com capabilities, in terms of our customersâ\u0080\u0099 willingness to review and purchase online. Then, Iâ\u0080\u0099d also say weâ\u0080\u0099re building a great project and business in the fourth quarter. We see a lot of consumers eating, doing smaller projects around their home and getting ready for the holidays. And then finally, weâ\u0080\u0099ve built an incredible dot-com business. Weâ\u0080\u0099re expecting a great Q4 with Cyber Monday and a big part of that is our digital performance, our app performance. I mean Ted called out at the front, the experience is what itâ\u0080\u0099s all about. I mean, we love the ratings in the App Store, 4.8 with Apple, 4.7 with Google, but we see it in our numbers as well, strong double-digit performance and growth in downloads and MAUs, monthly average users, in our traffic. We donâ\u0080\u0099t ascribe to necessarily a smooth cadence of buybacks, and that will typically reflect just sort of how we think about working capital investment through the year and a cash buffer throughout the year. I know last quarter, you mentioned some of those higher ticket $300, $400 Halloween items being pretty much as discretionary as it gets and performing pretty well. David, we had -- as I commented earlier, we had record sales, both in-store and online in Halloween that included the infamous Skelly, which has been one of our best sellers in terms of the innovation and value we offer our customers is really unmatched in the marketplace. If I turn to the fourth quarter, weâ\u0080\u0099re really excited about our decor holiday assortment. Weâ\u0080\u0099ve got great innovation and great value for our customers across the assortment, if itâ\u0080\u0099s trees, if itâ\u0080\u0099s lights, if itâ\u0080\u0099s decorations, we feel very good about the category. Just help us unpack the 25% inventory growth number and just get us comfortable that you arenâ\u0080\u0099t sitting on too much at this point, especially with some of the deceleration youâ\u0080\u0099re now seeing. Well, so look, investment in inventory and our One Supply Chain facility is certainly one of the factors in inventory growth year-over-year. And then, we made strategic decisions to land inventory earlier in the year than we have prior. And really, just to give you some numbers around that and to reflect the fact, we feel fantastic about our inventory position. In Q2, we grew our inventory 38% year-over-year. In Q3, that number dropped to 27% year-over-year. And actually, if you look throughout our history, we actually typically build inventory from Q2 to Q3. In this case, our inventory actually came down by $400 million from Q2 to Q3. Our inventory is healthy, and weâ\u0080\u0099re happy with our position. Christine, we have time for one more question. If I look at the press release, the selected sales data, obviously excludes HD Supply. So curious, Ted, if you can expand on the performance of that asset in todayâ\u0080\u0099s backdrop as it looks like it may be driving some upside to the overall performance of the business. Yes, another great quarter for HD Supply. Shane Oâ\u0080\u0099Kelly and his team are running the largest and the best focused MRO business for multifamily housing and hospitality, extended living, et cetera. We are -- remain well ahead of all our financial projections, and we made the acquisition. Their integration is tracking, theyâ\u0080\u0099re integrating sales forces, customer records and now starting the work or on their way in the work of integrating the supply chain. So, that one has just been a terrific acquisition that weâ\u0080\u0099re super happy about. But as Ted said, weâ\u0080\u0099re so happy with it. On the difference between sales and comp, weâ\u0080\u0099ve always seen a gap there. It just comp reflect sales from the POS, sales reflects sales as theyâ\u0080\u0099re actually delivered or installed. Weâ\u0080\u0099ll probably -- through the year, sales will be a little higher than comp guide, but the important guide here is comp because thatâ\u0080\u0099s our activity-based metric around sales. Ms. Janci, I would now like to turn the floor back over to you for closing comments."
}