{
    "symbol": "TCBI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 15:37:03",
    "content": " Over the last year, we established foundational principles to cover markets in a smart and disciplined way, resulting in improved client engagement and sustained market share gains, which again this quarter showed up in the form of loan growth, with C&I loans increasing 34% year-over-year. Total revenue was up $27.9 million or 14% linked quarter and increased $4.7 million when compared to Q2 2021, marking the first year-over-year quarterly improvement in the last year. Salaries and benefits increased again this quarter and are now up 20% year-over-year, while total noninterest expense increased only 10%, marking continued success in self-funding talent acquisition in deploying technology-enabled capabilities necessary to deliver the critical early stages of our transformation. Taken together, PPNR increased 33% linked quarter to $67.5 million, reflecting notable progress relative to our previously published guidance of achieving year-over-year quarterly PPNR growth by late this year or early next. Credit trends remained stable and excluding the 1 mortgage finance credit Rob mentioned that was downgraded at quarter end, criticized loans decreased $17.1 million quarter-over-quarter to 1.91% of LHI. Ending period C&I loans increased again this quarter, up $1.5 billion or 14%, signifying continued benefit of expanded coverage, improving calling discipline and focused execution on our defined strategy. This observed continuation in loan growth over the past several quarters has driven C&I balances, excluding PPP, $3.2 billion or 34% higher year-over-year. Consistent with our expectations, period-end real estate balances grew again this quarter by $176 million or 4% and are now up in excess 300 million year-to-date, reflecting modestly increasing production levels and more normalized, although again, increasing levels of pay off. Consistent with our expectations, total noninterest expense increased $11.2 million or 7% quarter-over-quarter and grew $15.2 million from the second quarter of last year."
}