{
    "symbol": "TCBI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 15:13:08",
    "content": " I would also note that ingested second quarter of operation, mortgage sales and trading assisted our clients this quarter in navigating a historically complex interest rate environment, generating over $1 million in fee-based revenue and further substantiating our ability to deliver considerable value to this important client segment. Salaries and benefits excluding transaction related expenses increased this quarter and are now up over 30% year-over-year, while total noninterest expense excluding transaction related expenses increased 18% marking continued success and repositioning the expense base towards expanded coverage and broadening capabilities needed to structurally improve earnings generation over time. Taken together, PPNR excluding transaction expenses increased 25% linked quarter to $84.1 million, marking a milestone in our transformation by achieving year-over-year quarterly PPNR growth one quarter earlier than previously guided. Turning to Slide 9, ending period C&I loans increased again this quarter, up $569 million or 6%, signifying focused execution on our defined strategy. Moving to real estate, as expected period-end real estate balances declined by $100 million or 2% in the quarter as payoffs remained elevated and the pace of new origination moderated. Average mortgage-finance loans declined by 10% in the quarter, comparing favorably to estimated levels, a broader industry contraction, as the breadth of our segment specific offerings prove increasingly compelling and what is and is likely to continue to be a historically challenging market environment. Turning to NII sensitivity on Page 11, shown in the middle on the slide is the results of our asset sensitivity modeling, which declined this quarter to 7.3% or $77 million and a plus 100 basis point shock scenario on a static balance sheet. Consistent with our guidance, total noninterest expense when including transaction expenses increased $16 million or 10% quarter-over-quarter and $27.3 million from the third quarter of last year. Your line is open. But those relationships may begin with credit and the process of onboarding those clients and overtime, earning the right speed operating bank is what ultimately is going to transition our funding base from current to target state and that we measure success this quarter, I'm sorry, this cycle not solely by plus or minus or beta relative to the last cycle, but by our ability to really drive those core operating deposits. Your line is open. Your line is open. So if you look at just the total expense base, remove the transaction related expense, we're up $16 million or 9.8% quarter-over-quarter, 11.5% of that is salaries and benefits, about $3 million is tech-related expense that primarily focuses on better equipping the front line as well as moving some of our storage to the cloud in away from on-prem. Your line is open. Your line is open. Your line is open."
}