{
    "symbol": "DEO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-27 08:25:22",
    "content": " But having said that, our U.S. business in North America grew 3% volume in half one, by kind of look back at pre COVID levels, volume growth on this business was somewhere between 1% and 2% at the top end. So I do believe we will be able to sustain kind of disciplined and pricing as we -- and as I said, surgically applied, and we really want to keep the momentum of growth and make sure we're recruiting more consumers to our brands and investment levels in the brands and equity is very high. Morning Ivan, morning Lavanya. And then from a margin -- going back to looking at margin, I mean revenue growth management has enabled us to take smart pricing, manage trade spend, manage mix in a way that allows us to grow our margins. Thank you very much. Thank you very much. And we've been able to execute it while continuing to grow the business, strong -- very strong double digit, 60% growth on that business and growing share of spirits as well as growing our share of tequilas. Thank you very much. Morning Ivan, morning Lavanya. It's obviously not going to grow at the kind of rates we're seeing right now forever, but we don't -- we do see it for the next 5 to 10 years growing faster than the spirits industry, so taking a bigger share of total spirits. And as conditions have improved and the on-trades come back, we're seeing really strong growth, and we're gaining market share right across other than Mexico, where we're slightly behind. Thank you very much. On Latin America, as the deluxe similar dynamic and small, the mix when we were at the height of COVID, Scotch whisky business, deluxe volumes dropped, that had -- it's a very high-margin businesses, and now they're coming back very strongly. And so that's one of the drivers that we're seeing to the growth of our spirits RTD business is coming from people who may have been drinking other products in a can now moving up to really a much better experience with Crown Royal in a can or Tanqueray, soda Tanqueray in a can or Ketel Botanical or spirits in a can. Thank you very much. And we are seeing -- I mean, we've had fast growth in the recovery as you see travel pick up, so I would say, to get back to where we were, it's probably another two years, maybe a bit longer, but we will just focus on gaining market share through that recovery because it's very much going to depend on passenger numbers."
}