{
    "symbol": "VRNT",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-29 22:50:09",
    "content": " SaaS revenue, which is our key growth driver, increased 38% in fiscal '23, on a non-GAAP constant currency basis. This SaaS momentum drove strong recurring revenue growth, and our total non-GAAP revenue came in $5 million ahead of guidance. Since becoming a pure-play customer engagement company two years ago, we've delivered steady quarterly revenue growth with annual SaaS revenue nearly doubling and sustain. Last year, we reported that we have crossed the midpoint of our SaaS transition, and for the full year, we delivered 86% of our non-GAAP software revenue as recurring, up from 81%, two years ago. Driving our recurring revenue growth was our strong SaaS revenue growth, up 38% for the year on a non-GAAP constant currency basis. In fiscal '23, SaaS revenue grew 23% year-over-year as a result of new deals on a constant currency basis. In fiscal '23, SaaS revenue grew 15% on a constant currency basis as a result of converting deals from our perpetual customers migrating to SaaS. For the year, we are adjusting our revenue guidance to $935 million, plus or minus 2%, to reflect the overachievement in Q4 from deals that we originally expected in Q1 but closed before year-end as well as the trends we've discussed today. For recurring revenue, we expect about $170 million in Q1, with sequential growth of about $10 million in Q2, another sequential increase in Q3, and to finish the year with our typically strong Q4. These assumptions drive approximately $215 million of total revenue for Q1, consisting of $170 million of recurring revenue, reflecting 6% year-over-year growth and $45 million of non-recurring revenue compared to $59 million in Q1 of last year. Over the last 2 years, our SaaS solutions have been deployed by some of the leading brands in the world, and we delivered more than 30% SaaS ARR growth, achieving scale in our SaaS operations with approximately $0.5 billion of SaaS ARR. Your line is open. Your line is open. So first, we're guiding for 25% to 30% SaaS revenue growth and that's compared to 38% last year. And we're targeting $750 million of recurring revenue for the year, which is 10% growth, but Verint is a tale of two cities. And finally, we introduced a new metric, $500 million of SaaS ARR metric, that's up 25% year-over-year, and we expect to complete our SaaS transition next year. Your line is open. Your line is open. Your line is open."
}