{
    "symbol": "VRNT",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-07 21:54:04",
    "content": " On a constant currency basis, non-GAAP revenue came in at $229 million, reflecting 6% year-over-year growth. Looking at the full year, we are pleased with our first half growth, which is on track with our expectations for around 7% revenue growth for the full year, also on a constant currency basis. New PLE bookings increased 10% on a reported basis and 12% on a constant currency basis, in line with our target of 10% to 12% growth for the year. In Q2, constant currency cloud revenue increased 30% on a GAAP basis and 29% on a non-GAAP basis. In Q2, non-GAAP revenue increased 6% year-over-year on a constant currency basis and diluted EPS came in at $0.56, ahead of our EPS guidance. For H1, non-GAAP revenue increased 8% year-over-year on a constant currency basis and diluted EPS came in at $1.07. We're pleased with our Q2 and first half results, and I believe we are well positioned to meet our annual targets for both revenue growth on a constant currency basis and for EPS. In H1, cloud revenue increased 34% year-over-year on a constant currency basis, in line with our outlook for the year. Today, we are adjusting our prior revenue guidance to reflect the strengthening dollar while maintaining the same guidance of a 7% revenue growth rate on a constant currency basis. On a reported basis, our new revenue guidance is $920 million, plus or minus 2%, which corresponds to $940 million, our most recent guidance on a constant currency basis adjusted for recent FX rates. And we expect diluted EPS of $2.50, reflecting 10% year-over-year growth at the midpoint of our revenue guidance. Looking at next year, we expect our revenue growth to accelerate again to around 9% on a reporting basis and around 10% on a constant currency basis. And we were watching this very closely because obviously, we heard from other companies that they did experience -- again, I think, first, the results, $229 million on a constant currency basis and 12% PLE growth -- new booking growth suggests that we actually achieved our plan."
}