{
    "symbol": "VRNT",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-07 19:45:04",
    "content": " Our SaaS revenue has consistently increased over the last few years, and this year, we expect over 35% growth on a constant currency basis. In Q4, as SaaS revenue continues to grow, we expect perpetual revenue to decline faster than we previously expected and are adjusting our annual revenue outlook accordingly to 5% growth on a constant currency basis. We expect another year of strong sales momentum with 30% SaaS revenue growth on a constant currency basis, while potential revenue declines to approximately $100 million. Overall, this drives our total revenue growth to 6% on a constant currency basis, up from 5% we now expect for this year. Revenue came in at $232 million on both a GAAP and non-GAAP basis, in line with our prior guidance, reflecting 2% year-over-year growth on a non-GAAP currency basis. Recurring revenue came in at $175 million on both the GAAP and non-GAAP basis, reflecting 12% year-over-year growth on a non-GAAP constant currency basis. Cloud revenue on a constant currency basis increased 37% on a GAAP basis and 35% on a non-GAAP basis year-over-year in Q3, slightly faster growth than the first half of the year. In Q3, new SaaS ACV was up strong at 51% year-over-year on a constant currency basis, as we continue to see strong demand across industries and geographies as well as new and existing customers for the Verint Cloud platform. As Dan discussed earlier, in Q3, perpetual revenue declined more than expected, which resulted in new PLE bookings being down 4% year-over-year on a constant currency basis. We expect another quarter of SaaS growth in Q4, driving more than 35% SaaS revenue growth and 10% recurring revenue growth for the year, both on a constant currency basis. Third, our recurring mix of revenue continues to increase and we expect around 86% of our software revenue to come from recurring sources this year, driven by new SaaS ACV bookings and strong renewal rates. For total revenue, we expect 6% year-over-year growth on a constant currency basis, resulting in $945 million of reported revenue, plus or minus 2%. So now bridging into next year, on the recurring revenue side, we do expect to see 10% growth on a constant currency basis, so recurring revenue will grow nicely to $750 million. And that, coupled with expense management, we are able to continue to grow earnings much faster than we're growing the top line this year, and that's also our plan for next year, as we guided for $2.70, which is 8% growth. So in summary, we think next year is two objectives: Accelerate the cloud transition and have a very strong SaaS growth, 30% SaaS revenue growth and also manage the bottom line."
}