{
    "symbol": "STWD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 13:12:02",
    "content": " Company-wide inclusive of floating rate assets and liabilities in all of our business lines, a further 50 basis point increase in base rates would increase annual earnings by $19 million or $0.06 per share. On the CECL front, we increased our general reserve by $27 million in the quarter to a balance of $94 million or just over 0.5% of our commercial lending portfolio. However, we downgraded 4 office loans totaling $724 million from a 3 to a 4 in the quarter, which Jeff will discuss and won $42 million retail loan from a 4 to 5 million bringing our total 4-rated loans to $872 million and 5-rated loans to $287 million. During the quarter, we foreclosed on a 5-rated $245 million first mortgage loan related to an office building in L.A., which Jeff will discuss in more detail. In our Residential business, we acquired $745 million of loans, including $713 million of agency investor loans that we discussed last quarter, bringing our on-balance sheet portfolio to $2.8 billion. And on the segmentâ\u0080\u0099s property portfolio, this quarter, we sold 1 asset for proceeds of $37 million, resulting in a net GAAP gain of $25 million and a net DE gain of $23 million, once again demonstrating the embedded value of this portfolio, which has been a source of consistent and recurring gains across cycles. Funding totaled $68 million with repayments and sales totaling $75 million, keeping the balance of the portfolio consistent with last quarter at $2.4 billion, which was 97% floating rate. This is in addition to our ATM capital raises early in the quarter where we issued 750,000 shares of common stock for gross proceeds of $16 million at an average share price of $21.17, bringing our full year ATM issuance to 2.2 million shares or $49 million at an average share price of $22.72. Rina said, we have reduced our exposure to office loans from 38% to 23% of our CRE lending portfolio since COVID, but since we have other investment cylinders on our balance sheet, Lending segment loans on office make up only 13.6% of our assets, which is by far the smallest percentage of our peers and a fraction of most of them. So short and long-term, youâ\u0080\u0099re going to see rents â\u0080\u0093 they are actually â\u0080\u0093 headline rents are going down, but in-place rents are going up because itâ\u0080\u0099s the gap in these buildings in our portfolio alone on the loan book, Jeff tells me our rents have increased more than 20% since we started making those loans. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}