{
    "symbol": "KRNT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 13:24:08",
    "content": " Turning to our results, as reported this morning, fourth quarter revenues were $63.3 million net of approximately $4.3 million of non-cash flow impact related to a global strategic accounts and in line with the revenue guidance range provided in November, which as a reminder assumes zero impact from the fair value of the issued warrant. The lower year-over-year gross margin was driven primarily by reduced sales volumes compared with the same period last year, as well as approximately $6 million of inventory write-offs associated with older generation systems and spare parts as customers continue to move to our newer generation systems. I'd like to remind everyone that the first quarter guidance reflects the typical seasonality we see in our business, with the first quarter typically being the lowest quarter for higher margin consumable sales, and also factors in a difficult year-over-year comparison for system sales volumes. I will note, given the decisive actions we have taken over the past several quarters to adjust our operations, we see breakeven on an adjusted EBITDA and operating margin basis at a quarterly revenue run rate of approximately $70 million with gross margins in the mid 40% range, obviously, depending upon mix and OpEx in the mid 30s. Now with the MAX technology, which is the new standard and it's much better than the screen quality, with all the market trends that I spoke about 4 years and now it's really happening and brands are moving into many SKUs and retail needs to move to on demand production onshore, now is the time for Kornit really to go big time on to the replacement market, and we will start to see it in 2023 mainly in the H2, but definitely into '24 and beyond that. Next question, Bernard, please. We see massive opportunity of growth with this global strategic customers, not only by selling new system in 2024, and the relative new systems that we are going to release in 2023 like the Apollo, we see a major opportunity of upgrade the existing Atlas portfolio into the Atlas MAX trade in the old technology with  technology and potentially with the Apollo in the future and getting to new businesses with this account as well. Next question, Bernard, please."
}