{
    "symbol": "CFG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-17 12:31:03",
    "content": " Overall, we see solid NII growth as NIM gradually rises to 3.4% over the year, a roughly 8% growth in fees to kind of rebound in capital markets fees over the course of the year, solid expense discipline with core expense growth ex acquisition and FDIC impacts of 3.5% to 4%. With Fed funds increasing 425 basis points since the end of 2021, our cumulative interest-bearing deposit beta has been well controlled at 29% through the end of the fourth quarter. On Slide 9, average and period-end loans were broadly stable linked quarter but up 1% ex auto runoff with 1% growth in commercial, reflecting demand in asset-backed financing and growth in CRE, primarily reflecting line draws and slower paydowns. I mean I think more broadly, it's two overall comments, really the -- just given the pace and speed of rate changes and the impact on the migration of the deposit mix that we expect as you get into 2023 is really most and the majority of what we're looking at. So from that perspective, just kind of marking that to market with respect to what we're seeing in the trends in the fourth quarter and the rate and curve outlook that we see going throughout the rest of '23, I would hasten to add the -- what's embedded in there nevertheless, is a transformed deposit platform that back -- prior to the pandemic, we would have had DDA percentages that would be in the low 20s compared with a majority of the portfolio being outside of DDA, of course. But back to -- I think John said it in comments, we've really transformed our deposit base really off the back of our treasury services business, so both specialty deposit offerings, we've got two that we're now in the market with around ESG, green deposits and carbon offsets and then just the strengthening of our DDA deposits with our treasury services business gives us more stability than we would have had in prior years. So we've got to stay disciplined and manage it well, but it's been driven by a lot of health improvements, household growth, improvements in primacy, mix shift to Bruce's point, we were 45% mass affluent and above five years ago, we're now 60% of our customer base is mass affluent and above. So as and when we continue to look at ways to lock in protection against down rates, you could see that 3.20% move around based on hedging activities as well as updated views on what the mix of the balance sheet is likely to be in the context of what's the Fed... And you can be assured, I think we played our hand quite well so far, and we'll continue to stay really focused on."
}