{
    "symbol": "DISH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 13:37:05",
    "content": " That's going to be a good investment for us because in the future, we'll be able to upgrade customers to our network and obviously get M&O economics at that point in time. We would expect as a gross utilization with four players with national networks, 25% of the enterprise business wouldn't be unreasonable for us to get, as opposed to the retail business where we're starting decades behind people and maybe getting to low single -- low double-digits would be a reasonable expectation for us. That's not to say the -- I believe, personally, the enterprise business will be equally or more lucrative for us, but the postpaid side has been a long time coming for us even -- we started with Ting on a small scale, but now we're able to -- with 30 million, you start to -- it starts to be something you can market. So, we will have capital needs in the future, but we're going to start -- our network is going to start generate a lot of cash, and we just got to make those two marry up in a timely manner and relate that to the Street in a way that you guys can understand it. You'll start seeing some numbers, but you won't see -- you're going to see a material ramp when you have scale, which I define as 70% with voice coverage. And so I guess maybe the Street looked at that as a negative at least as far -- I don't know the exact deal, but I think the more the merrier when it comes to private networks because I think you need -- that's something that you need competition between companies to make sure it scales. And I think the thing is, ultimately, regardless of who signs private network deals, it's going to be a positive because if your competition does it -- if Uber signs a deal, then Lyft has to sign a deal or just going to be out of business as an example. In other words, what -- at that point, there's -- I think Dave's focus -- I shouldn't talk for him, but since I'm talking, his focus will be to optimize the network within the markets that we are There'll be some small sales. On satellite to handset or device, obviously, it's going to -- it might be a really good question to ask EchoStar on their conference call. But we're unique in that, obviously, the common ownership between the two companies, we're -- when you look at the two companies together, we understand satellites really well, we understand video really well, and now we understand the future of telco really well, all within the same sister company. So I think you're just going to see more people -- I just think you could -- and every time they lose a customer, they used to come back to them."
}