{
    "symbol": "DISH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 10:40:06",
    "content": " But the -- I think it would -- the SPAC did have high redemption but is still intact and still a public company and still capable of doing â\u0080\u0093 nothing has really changed strategically there because in the SPAC world today, you're going to have to have a pipe and no matter what you do, you're going to have to other secured funding. No, that -- I guess the press kind of got that one wrong that there's some preliminary discussions between a SPAC and DISH retail wireless that would be -- potentially would be a sale of a very small portion of the retail wireless business. And so there's just a bigger opportunity there and we -- I wish we could have started six months ago, but we're excited to get going and we're going to have a great product and with great network partners in our own network. So we -- obviously, we can do some things there to make sure we're providing a great customer experience, and it's also a good setup for us to be competitive. We're doing what we can there, certainly have a lot of focus on continuing to get the right handsets into our customers' hands, and we're now in the business of doing that with Band 70 devices as we start to pre-load Band 70 VoNR-capable devices into our base, and that's going to be a big effort as we head into '23. So -- and I think on the political side in terms of a legal objection to a merger, that's been diminished by time, and obviously, the degradation of the linear TV business and competition from dozens of companies in the OTT business and the proliferation of broadband today. And I know it's a bit frustrating because it's a kind of a new concept for private networks, and it's really -- everybody has a different definition about it, but -- and obviously, take -- the sales cycle is a little bit longer, but it's a long-term customer, you're going to have virtually no churn in it and it's big contracts. Our business was designed to be an open wholesale network where if you could -- if you're in the private enterprise business and you can think of a need that you have because we're software-based, and we're in the cloud, you can write an API, you can write code that can do that for you, and it's a big differentiator between legacy networks. But obviously, the DOJ, there's a consent decree but everything is -- everything -- you would go to everything as whether it was competitive or not competitive, and the well-financed retail business would be more competitive, people will probably look at that. But your question is a good one, and it's one that we look at where customers that have a need to transition kind of away from more traditional linear service into an OTT service, we're obviously opportunistic with that customer relationship that we have with DISH. Because we're building 600 megahertz at the same time, it also gets you -- and because we are more urban-based -- and we actually go into the 80s and 90% coverage in urban areas to meet the 70% population, in fact, as part of that, we go a long way, not all the way, but we go a long way to the 75% 2025 milestone for 600 megahertz. And of course, a great example might be that I think Dave who's traveling today gave as a stadium where you might have 100 customers in the stands, they're using it 6 times a year or 8 times a year doesn't make sense to spend tens of millions of dollars to deploy capital in that stadium when the customers can run. And of course, that shows up in ability to pass along some of those savings to the customers, which gets you more competitive, which when you look around the world, and you see people who have not been in as good a position as we have, they typically get low double-digit kind of market share, which is why we've publicly stated that our goal is to hit 30 million subscribers in retail wireless, which would obviously well above breakeven on our CapEx than our OpEx and everything else that we do in our network. It's not all bad news for the incumbents because obviously, when we ride on their network, they're getting free money for an investment they've already made. I'd like to sort of draw an analogy like adding an extension to the house and calling it sort of a 5G network, but it's really -- you're still stuck with the rest of the house."
}