{
    "symbol": "DISH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 16:42:08",
    "content": " And I think that that's a place that that as people â\u0080\u0093 as inflation and people look and start thinking about raising prices, which we've seen a little bit in the industry, that's a place that probably could be a bit more profitable than it is and I think people will look at that. And so, there are â\u0080\u0093 when we have a customer the first place we're going to want to put them is our in our network, but then depending on the customer, there may be â\u0080\u0093 we have a little bit of machine learning that says, let's put this person on T-Mobile or AT&T that's the right place for them. How long has the enterprise sales cycle and when you anticipate maybe having some kind of, I donâ\u0080\u0099t know what the term is, maybe flagship customers to demonstrate why the flexibility of your network might offer something unique compared to what's in the market today. You have a contractor you're going to go build it out because they want more density, but many â\u0080\u0093 cut many of the and what they really want is something that our competition has a tougher time with, which is they want a slice of a network that they control and our architecture allows them to do it. But the customer doesn't have a â\u0080\u0093 the customer's going to get the best at T-Mobile or AT&T in that case, sometimes T-Mobile's not in the arena, but AT&T is or vice versa, or both of them are in there. I think that as weâ\u0080\u0099ve discussed in the past, both on the DISH TV and the SLING TV business, I mean, we really are heads down and you can see it and our slowing growth, but also some of the profitability that weâ\u0080\u0099re focused on really still trying to acquire and retain customers that meet our targets for long term and profitable growth. The only thing I would say is that that a 5G O-RAN cloud-native network is where Telco is going and perhaps 10% of the people thought that a couple years ago, maybe 50% of the people think that today, but it'll be a â\u0080\u0093 this time next year it'll be 100% of the people that that realize what I just said is true. And it's a wonderful opportunity particularly for our partners to grow their business in a way that they probably didn't have, and their strategic plan a couple years ago, because that they are in our network, they work in our network, they work with our team and they can see where this goes around the world. So there's really only two things that I see customers when I talk to customers it's price and coverage and they don't â\u0080\u0093 it weighed, I'd say it's price 1, 2, 3 coverage 4, 5, 6, and maybe speed, they get is speed or some or something else."
}