{
    "symbol": "CLW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 13:03:06",
    "content": " As a result of our strong first quarter performance and our improved outlook for the year, we’re now anticipating achieving our debt leverage target sooner than anticipated and are resuming our previously authorized share buyback program. If our previously announced paperboard and tissue prices remain at current levels throughout 2022, we would expect a full year benefit of $200 million to $230 million with $170 million to $190 million in paperboard and $30 million to $40 million in tissue. In total, our outlook for price realization from previously announced increases, net of inflation is $45 million at the midpoint and reflects a $20 million improvement relative to our prior estimates for the year. For the full year 2022, we’re also anticipating the following: interest expense between 35 and $37 million, depreciation and amortization between 101 and $104 million, capital expenditures of approximately $60 million to $70 million, in line with our historical average, excluding extraordinary projects and some projects that have moved out of 2021 to 2022 due to some timing issues. So on part one of the question, yes, the price less cost improvement, we’re expecting $20 million for the year. We also undertook some desheeting activities that are starting to impact us here in the second quarter through the rest of the year and then on April 1, we took action again in terms of an additional price increase and that’s going to take us a little bit of time to implement. No Mark, if you look at tissue, we’re expecting year-over-year $30 million, $40 million impact from pricing as well as desheeting. If you look at the capacity that’s been added over the last number of years, outpacing demand growth, I think we are perhaps a bit more optimistic as we look out over the next several years in terms of the supply and demand balance with private branded share growing and maybe the capacity additions slowing and even potentially some slowdown of imports due to some of the supply chain issues that are taking place."
}