{
    "symbol": "CLW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-31 19:22:09",
    "content": " And finally, we repurchased $1 million of shares during the quarter for a total of $5 million in the first nine-months of the year. In the third quarter 2022, our net income was $20.6 million. In the third quarter, we effectively settled an open IRS product, which resulted in the reversal of certain net tax credits related to our Lewiston pulp investment from five years ago and increasing our taxes by approximately $8 million in the quarter. You'll recall in the third quarter of 2021, we took a major maintenance outage that impacted adjusted EBITDA by $5 million. This increases the total repurchased under our existing stock repurchase program in 2022 to approximately $5 million, with 150,000 shares purchased at an average price just above $33 per share. We updated our target capital expenditures to $60 million to $70 million per year, absent major projects to reflect the impacts of inflation. Our net debt to adjusted EBITDA at the end of the third quarter of 2022 was 2.0 times, and net debt was $494 million. As a reminder, we had no major maintenance outages in paperboard in the third quarter and expect that the fourth quarter outage will impact adjusted EBITDA by $21 million to $25 million. We experienced production issues at our paperboard mills in October, reducing both our pulp and paperboard production and impacting EBITDA by approximately $5 million. Our adjusted EBITDA for the first three quarters of 2022 was $199 million and when combined with our fourth quarter guidance, we expect the full year adjusted EBITDA to be $237 million to $247 million, significantly higher than our adjusted EBITDA of $175 million in 2021. Commodity cost inflation, including pulp, fiber freight, chemicals and energy is expected to be $187 million to $191 million, which is at the low end of our previous expectations. Over the last three years, we've cumulatively underspent our target by over $60 million. We expect to update you during the fourth quarter earnings call on the timing of the Lewiston recovery boiler tube replacement project, which is expected to require a capital once approaching $40 million and an estimated adjusted EBITDA impact of $30 million. Our first priority is to sustain our asset base, which we believe requires an average of $60 million to $70 millions of capital expenditures annually, excluding large projects. I assume that was mostly or entirely related to higher paperboard prices and demand and I assume the same goes for the implied full year guidance going up by, call it, $10-ish million. So $5 million is an impact that we expect across the quarter, although we think the majority of that impact happened in the month of October, we're working through them. So we've called out one that's in the fourth quarter, that's about a $5 million outage. The -- on Slide number 11, you've got major maintenance outage at Lewiston listed is $19 million to $23 million. Mike, in terms of the CapEx, you mentioned that in the next few years, you'll be spending above that $60 million to $70 million, just given the degree to which you've underspent in recent years. And just one last point of clarification on the price/mix guidance for the year, the increase of -- I think it went up by $11 million."
}