{
    "symbol": "CLW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 21:52:08",
    "content": " Additionally, we restarted our share buyback program in the second quarter, using approximately $4 million to repurchase around 120,000 shares at an average price of $32.96 per share. Our net debt to adjusted EBITDA at the end of the second quarter 2022 was 2.2x, and net debt was $500 million, which meets our previously discussed leverage target. The midpoint of the range for the third quarter is $5 million higher than the second quarter adjusted EBITDA of $63 million, but the expectation that previously announced price increases will outpace the freight inflation. If you previously -- if our previously announced paperboard and tissue prices remain at current levels throughout 2022, we expect a full year benefit of $255 million to $275 million. Cost inflation, including pulp, fiber, freight, chemicals and energy is expected to be $185 million to $205 million, which is also higher than previous expectations. In total, our outlook for price realization of previously announced price increases, net of inflation is expected to be approximately $60 million higher in 2022 versus '21. For the full year 2022, we're also anticipating the following: interest expense between $35 million and $37 million, depreciation and amortization between $101 million and $104 million, capital expenditures of around $45 million to $55 million. Mike, forgive me if I missed, I wasn't able to listen to all of your prepared comments, but it looks like your price cost expectation for the year has improved by $15 million at the midpoint of the price mix and inflation ranges you gave, I don't think your labor inflation expectations change, but please correct me, if I'm wrong. Adam, you have it correct that our labor expectations still $10 million higher year-over-year, and that was what we commented on last quarter. And relative to that price, call it, cost inflation differential that improved by $15 million versus the last time we spoke in the first quarter. I think one of the comments that I made is -- if you look at our pricing actions on a year-to-date basis, if you take a full annual run rate, it's approaching $70 million."
}