{
    "symbol": "SLM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 11:21:02",
    "content": " However, when we look at vintage curves and the expected remaining credit performance of our assets over time, we think that life of loan losses will be within the estimated range, anticipated at underwriting and will continue to drive attractive returns and profitability going forward, generating life of loan return on equities in the 20% range despite recent credit performance. Your line is open. The fact that prepayments have slowed significantly, I think we saw consolidations down something like 50% year-over-year extends the life of these loans and generates additional residual cash flows, that is a very big positive. Your line is open. Your line is open. And basically what I've done is, applied charge off rates informed by the charge off rates that we disclosed occur in the principal and interest repayment cohorts and I essentially normalized the current charge offs that we are seeing excluding things like our best estimates of the defaults from the continuous enrollment program that was the gap year population that we talked about and also normalizing for the issues that we've seen in our collection centers, as well as the issues that we have seen with the forbearance changes trying to estimate what was acceleration and what was a continuation of an increase in life of loan default rates. Getting that kind of ability to look and start to understand on a year-over-year basis is really, really useful for us in disentangling sort of the credit administration impacts versus seasonality, and quite frankly just the normalization of life you have post COVID, where I think everyone saw a delinquency and sort of charge off performance sort of behave differently than historic norms. What I think we started to see partway through the third quarter, but really into the fourth quarter of last year was growing stress on what I would call sort of smaller kind of layered risk segments of the portfolio. Your line is open. Your line is open. Your line is open. So buyers always stress their default expectations when they're pricing up a loan portfolio, I think it is the case that an increase in life of loan losses of 1% or 2% does not have a meaningful issue on the IRR on that portfolio and our loan buyers are very serious students of the historical performance of our assets, and I'm pretty confident that they will be able to assess the issues that we're having with the portfolio at this point in time and draw the appropriate conclusions. Your line is open. Your line is open."
}