{
    "symbol": "OMC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-19 19:33:02",
    "content": " Even with this backdrop, we are continuing to see strong demand for our services, and based on our first half results, are increasing our organic revenue growth forecast to between 6.5% to 7% for the full year in 2022. As you can see at the bottom of the slide, the net effects of these items resulted in strong EPS of $1.68 versus $1.46 from Q1 of 2021 as adjusted, representing EPS growth of 15.1% in the second quarter. Based on deals completed to date, we expect the impact from net acquisitions and dispositions will result in a reduction of our revenue by approximately 1% in the third quarter, primarily resulting from the disposition of our businesses in Russia, and by approximately 4.5% for the full year. Third-party service costs were 21.4% of revenue compared to 20.1% last year, also after adjusting for amounts related to acquisitions and dispositions with the increase reflecting growth in our businesses. Our second quarter operating profit was $541.6 million, a 4.6% increase from last year and our operating profit margin of 15.2% on total revenues was well above the comparable amount for last year of 14.5% as adjusted. I do think that -- although I'm waiting for it to come through, that people on potential targets are adjusting their expectations, albeit not quick enough for us in terms of the cost of capital and what that's going to do to the fantasy land that occurred for -- if I get back 24 or 30 months, we're coming back into more normalcy as the Fed increases rates, and then other areas in the world to defend their currencies and markets also could increase rates. And for those that have followed us for a long time, not for the third quarter, but in terms of the fourth quarter, there's -- for the last, God knows how many years, always caution about the amount of project business that happens at the end of the year. So, we go from -- on a three-year basis, we're up 10% first quarter versus three years ago, 6.5% in the second quarter to up 1%, 1.5% in the back half of the year."
}