{
    "symbol": "PI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 21:05:05",
    "content": " Third quarter endpoint IC revenue exceeded our expectations, and for the fourth consecutive quarter set a new quarterly record. For reader ICs, although third quarter supply mostly caught up to demand, we see strong orders heading into fourth quarter, particularly for our E-family products. In aggregate, we entered fourth quarter with significant systems backlog, yet with product supply still constraining systems revenue growth into 2023. Comprising a new endpoint IC, the Impinj M775, which pairs an ISO standardized cryptographic engine with a unique key in each IC; new firmware in our reader ICs and readers that enables a challenge response dialog with those endpoint ICs; a new cloud-based Impinj Authentication Service that can verify an ICâ\u0080\u0099s authenticity in milliseconds; and easy-to-use APIs that enable partner or end-user product databases that pair each item with its authenticated endpoint IC; Impinj Authenticity will inhibit counterfeits, improve product safety and secure the supply chain. Only available from the Impinj platform, Impinj Authenticity is also our first product offering focused on expanding our recurring revenue opportunity from endpoint ICs to include cloud services. Third quarter revenue was $68.3 million, up 14% sequentially compared with $59.8 million in second quarter 2022 and up 51% year-over-year from $45.2 million in third quarter 2021. Third quarter endpoint IC revenue was $51.2 million, up 19% sequentially compared with $42.9 million in second quarter 2022 and up 60% year-over-year from $32.0 million in third quarter 2021. And although that specialty and industrial mix will normalize in fourth quarter, we still expect sequential endpoint IC revenue growth with our improving wafer supply. Third quarter systems revenue was $17.1 million, up 1% sequentially compared with $16.9 million in second quarter 2022 and up 29% year-over-year from $13.2 million in third quarter 2021. Finally, as wafer upsides from our foundry partner continue layering in, we foresee increasing endpoint IC shipments driving mid-to-high single-digit sequential endpoint IC revenue growth in fourth quarter 2022 and again in first quarter 2023. In the timeframe that weâ\u0080\u0099re talking about here over the next couple of quarters, our supply opportunity is to work closely with our foundry partner to generate additional supply as it frees up and as theyâ\u0080\u0099re able to deliver more wafers, they deliver more wafers both from their fabs exceeding their capacity plans, as well as from any demand shortfalls from other customers and other industries. And we are prioritized for that upside, even with our current supply visibility â\u0080\u0093 that visibility supports endpoint IC unit volume growth in fourth quarter 2022 and in 2023. Yeah, Troy as I mentioned a little bit earlier, at least in the timeframe weâ\u0080\u0099re talking about over the next couple of quarters, our opportunity is to work closely with our existing foundry partner, with the new products that we had spent so much time developing with them and launching with them, and to focus on working with them to get wafer upside to basically drive our position, our supply into the market."
}