{
    "symbol": "PI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 21:49:01",
    "content": " From the project front, the second large North American supply chain and logistics customer advanced their reader deployment and contributed their largest quarterly revenue to date. First quarter revenue was $53.1 million, up 1% sequentially compared with $52.6 million in fourth quarter 2021 and up 17% year-over-year from $45.2 million in first quarter 2021. First quarter endpoint IC revenue was $38.8 million, up 1% sequentially compared with $38.4 million in fourth quarter 2021, and up 2% year-over-year from $38.1 million in first quarter 2021. First quarter systems revenue was $14.3 million, up 1% sequentially compared with $14.2 million in fourth quarter 2021 and up 100% year-over-year from $7.2 million in first quarter 2021. In addition to the margin-rich specialty industrial endpoint ICs, a higher mix of Impinj M700 also provided a first quarter gross margin tailwind. First, a stronger-than-expected mix of margin-rich specialty industrial endpoint ICs drove first quarter gross margin strength. Second, first quarter inventory increased sequentially across both endpoint ICs and systems, driven primarily by a $3 million increase in raw material and a $4.8 million increase in WIP. We expect second quarter revenue to be between $54 million and $56 million, a 16% year-over-year increase at the midpoint of the range compared with $47.3 million in second quarter 2021. So I prefer not to speculate out to fourth quarter or beyond, just to say that we're working very closely with our foundry partner to get upside wafer supply, and we are preparing ourselves as best we can so that when those upside wafers become available, our post processing is primed and ready to be able to handle them and to get ICs into our partners' hands as quickly as possible. Based on our current supply mix, I anticipate a somewhat similar range in Q3, and really near-term movement from that dictated by – first by supply, and then second by mix of revenue between endpoint ICs and systems. So, we did say that second large North American supply chain and logistics customers, advanced their reader deployment and contributed the largest quarterly revenue to date. But to get back to the first part of your question, what we see and feel from the second large North American supply chain and logistics customer is they are at the point where we believe next year, they will have the opportunity to do a significant turn on of the capacity they have already deployed."
}