{
    "symbol": "PI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 19:58:07",
    "content": " Fourth-quarter revenue was $76.6 million, up 12% sequentially compared with $68.3 million in third-quarter 2022 and up 46% year-over-year from $52.6 million in fourth-quarter 2021. Fourth-quarter endpoint IC revenue was $58.7 million, up 15% sequentially compared with $51.2 million in third-quarter 2022 and up 53% year-over-year from $38.4 million in fourth-quarter 2021. Looking forward to first-quarter 2023, we expect low-double-digit sequential endpoint IC revenue growth, driven by increasing volumes as wafer supply continues to improve. Fourth-quarter systems revenue was $17.9 million, up 4% sequentially compared with $17.1 million in the third quarter 2022, and up 26% year-over-year from $14.2 million in fourth-quarter 2021. Full-year 2022 gross margin set an annual record at 55.5%, compared with 54.2% in 2021, with the increase due primarily to endpoint IC product margins, specifically the specialty and industrial mix, partially offset by less sales of fully reserved inventory. First, we currently anticipate first-quarter 2023 gross margins between 52% and 53%, with the sequential reduction due to a lighter mix of E-family reader ICs and unanticipated costs in both 300 millimeter endpoint IC post-processing and reader components. Nonetheless, we anticipate growing endpoint IC shipment volumes to drive low-double-digit sequential endpoint IC revenue growth in first-quarter 2023, and mid to high single-digit sequential endpoint IC revenue growth in second-quarter 2023. Turning to our outlook, we expect first-quarter revenue between $82 million and $85 million, compared with $53.1 million in first-quarter 2022, a 57% year-over-year increase at the midpoint. The growth opportunities that we're seeing both in retail and supply chain and logistics and more broadly, and I'll just add a little anecdote here, back when we first started at RAIN RFID 15 years ago, I remember a lot of programs that were potentially going to ramp at that time, including everything from magazines, to pharmaceuticals, to building supplies and so many -- just so many areas."
}