{
    "symbol": "SITE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 13:55:26",
    "content": " We were pleased to continue our positive momentum during the second quarter with solid growth in sales and profits, despite strong comparable growth from last year and spring weather headwinds in our northern markets. As we enter the second half of the year, we expect prices to contribute less to organic daily sales growth and volume to improve versus the first half of the year against weaker comparisons. Taken all together, with our strong teams, improved capabilities and robust acquisition pipeline, we expect to continue gaining market share and achieve another very good year of performance and growth in 2022, while building our company for the future. The combination of good organic sales growth, gross margin improvement and solid contribution from acquisitions allowed us to deliver adjusted EBITDA growth of 16% for the quarter and expand adjusted EBITDA margin by 60 basis points to 18.2%. Organic daily sales increased by 8% in the quarter, driven by price inflation in response to rising product costs, partially offset by dampened volumes resulting from higher prices, moderating economic conditions and unfavorable weather in our northern markets. Organic daily sales for agronomic products, which includes fertilizer, control products, ice melt and equipment, increased 7% for the second quarter due to strong price inflation resulting from rising product costs, partially offset by reduced volumes from unfavorable weather and higher prices. Organic daily sales for landscaping products, which includes irrigation, nursery, hardscapes, outdoor lighting and landscape accessories, increased 9% for the second quarter due primarily to price inflation as prices for products like PVC pipes and drainage remain elevated compared to the prior year. We continue to expect a gross margin decline in the second half of 2022, as our gross margin improvement initiatives such as private label and small customer growth are more than offset by the loss of the price realization benefit that we experienced last year."
}