{
    "symbol": "THR",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-02 16:51:03",
    "content": " While these represent just a couple of examples through three quarters, we have booked over $22 million in energy transition and decarbonization opportunities this year, up roughly 50% from the full year in FY '22 with another quarter to go. Finally, in the food and beverage market, we won a $2.4 million opportunity in a seed oil plant in North Carolina, and we expect revenues in our food and beverage end market to more than double in fiscal 2023 versus the prior year. Adjusted EBITDA increased over 45% year-over-year to $29.8 million with a margin of 24.4%, an increase of 390 basis points. This quarter, we achieved record incoming orders of $126 million, up 40% year-over-year, while bookings grew 22% on a trailing 12-month basis. Revenue in the third quarter was $122 million, up 21% versus prior year and exceeding internal expectations. As a reminder, we believe large overtime project revenues are aligned with customer capital spending budgets and more volatile in nature, while small projects and point-in-time product revenues, which were up 12% and 36% in the quarter, respectively, and 15% and 32% on a TTM basis, a representative of maintenance, repair and small upgrades on our installed base that help our customers maximize production, up time and efficiency. In the quarter, SG&A was $28.6 million or 23% of revenues versus the prior year of $19.3 million or 19% of revenue. Adjusted EBITDA increased over 45%, up over $9 million from the prior year, along with margin expansion of 390 basis points. On a trailing 12-month basis, adjusted EBITDA is now up to $86.6 million, along with margins of 20.6%, an expansion of 650 basis points, a really great result for the team. We ended the quarter with cash of $35 million that was unchanged year-over-year after accounting for the Powerblanket acquisition and adjusted EBITDA growth resulted in a net debt to adjusted EBITDA ratio of 1.1 times, an improvement versus 2.2 times in the prior year. We continue to place a high priority on diversifying our end market exposure, specifically targeting industrial markets outside of the oil and gas sector to represent 65% to 70% of revenues by the end of fiscal year '26. We are raising fiscal '23 revenue to a range of $429 million to $437 million, which represents a 22% growth over the prior year at the midpoint of the range. We are also raising adjusted EPS guidance to $1.55 to $1.59 a share for the full year, an increase of 89% over our fiscal year '22 in addition to the 150% growth delivered in fiscal year '21."
}