{
    "symbol": "THR",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-06 14:09:04",
    "content": " We're seeing strength in North America and a recovery in oil and gas maintenance spending driving $95.4 million in revenue, a first quarter record, growing by 34% over the prior year quarter. More importantly, we saw the team deliver strong operating leverage as compared to the prior year quarter with adjusted EBITDA more than doubling to $16.6 million and more than 3x the rate of our revenue growth. We continue to see strong growth on record Q1 orders of $103 million, with bookings growing 43% in the quarter and 44% over the trailing 12-month period. Revenue in the first quarter was $95 million, up 34% versus prior year and exceeding internal expectations. Revenue is significantly higher in both the U.S., Latin America and Canada regions this year versus last, with both regions seeing elevated materials demand from our installed base where we realized the combined $14 million of incremental material sales in North America. In the first quarter fiscal 2023, the onetime contract had revenue of $7 million and was dilutive to margins by 260 basis points, giving us a comparable figure of 41.6% gross margin in FY '23 versus a reported Q1 in fiscal '22 of 37.3%, yielding an expansion of over 400 basis points. In the quarter, SG&A was $21.8 million or 23% of revenue versus the prior year of $18.3 million or 26% of revenue. On a trailing 12-month basis, SG&A was slightly above $85 million or 22% of revenue, up from $78 million or 27% of revenue in the prior year. Fiscal '23 revenue is being raised to $380 million to $405 million, which represents 10% growth over the prior year at the midpoint of the range. We are also initiating adjusted EPS guidance of $1.07 a share to $1.19 a share for the full year, an increase of 37% over our fiscal year '22 on top of the 150% growth delivered in the prior year. I think we did roughly $3 million in revenue in the first quarter, and we would expect somewhere in maybe $8 million to $10 million in revenue in the fiscal year as we execute on those contracts."
}