{
    "symbol": "THR",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-05 14:39:04",
    "content": " In fiscal year '23, we're currently seeing a strong recovery in the oil and gas sector outpacing other end markets that is largely focused upon maintenance combined with efforts to increase throughput and reliability on the installed base. However, we are also seeing continued success in our efforts to diversify and will diligently work toward our long-term goal of targeting 65% to 70% non-oil and gas revenue by the end of our fiscal year 2026. Adjusted EBITDA nearly doubled year-over-year to $22 million, with a margin of 21.8%, an increase of 770 basis points. While global macroeconomic turbulence is ongoing, we're raising revenue and EPS guidance for the full fiscal year, given our robust performance in the first half and a continued strong backlog in the business. Revenue in the second quarter was $101 million, up 24% versus prior year and exceeding internal expectations. On a trailing 12-month basis, SG&A was almost $90 million or 23% of revenue, up from $77 million and compared to 25% of revenue in the prior year, demonstrating our ability to increase efficiency as we grow the business. Given the strong performance in the first half of the year, we are now projecting a 300 to 400 basis point expansion in adjusted EBITDA margins from fiscal '22's 16.4%. GAAP EPS in the second quarter was $0.33 per share, a significant increase compared to $0.01 per share in the prior year, and adjusted EPS was $0.38 per share versus last year's $0.12 per share. With our strong performance in the first half of this fiscal year, we've revised our fiscal year '23 revenue estimate to $405 million to $420 million, which will put Thermon in line with our peak revenues established in fiscal year '19, and we believe puts us on track to achieve our fiscal year '26 growth objectives. We continue to place a high priority on diversifying our end market exposure, specifically targeting industrial markets outside of the oil and gas sectors to represent 65% to 70% of revenues by the end of our fiscal year '26. We're raising fiscal year '23 revenue to $405 million to $420 million, which represents roughly 16% growth over the prior year at the midpoint of the range. We are also raising adjusted EPS guidance to $1.30 to $1.39 a share for the full year, an increase of 62% over our fiscal year '22 on top of the 150% growth delivered in the prior fiscal year."
}