{
    "symbol": "ACCO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 14:41:07",
    "content": " Kensington, our computer accessories brand grew 10% in North America during the fourth quarter and was up over 13% globally for the full year, as we continue to bring new products to market and expand our enterprise sales. Our International segment had an exceptional year, posting 19% comparable sales growth for the full year and delivered over 40% improvement in adjusted operating profit. In the fourth quarter, adjusted operating income was $52 million compared with $79 million last year. Fourth quarter adjusted SG&A expenses were $93 million compared with $99 million in 2021, primarily as a result of lower incentive compensation, cost savings initiatives and the positive benefit of FX, partially offset by continued investment in our go-to-market programs, and increased bad debt expense. North America adjusted operating income margin in the fourth quarter decreased due to negative fixed cost leverage from the volume declines, higher cost of finished goods and specific commodity materials, and higher inbound freight and outbound transportation costs that were not offset by price increases. In the fourth quarter, EMEA posted lower adjusted operating income and a margin rate that was 150 basis points behind the prior year. For the full year, we generated $78 million in adjusted free cash flow, below our outlook of $90 million to $100 million, with the shortfall due to lower EBITDA and a greater proportion of paid inventory given the timing of our inventory receipts. For the first quarter of 2023, we expect comparable sales to decline 7% to 10%, primarily due to the later shipments for North America back-to-school and due to demand related to the economic environment. First quarter adjusted EPS is expected to be $0.05 to $0.07 with lower operating income, reflecting fixed cost deleveraging along with higher interest and non-cash non-operating pension expenses. Full year adjusted EPS is projected to increase 4% to 8% to $1.08 to $1.12, approaching low double-digit growth in adjusted operating income, partially offset by higher interest costs of $6 million and higher non-cash non-operating pension expenses of $5 million."
}