{
    "symbol": "EXLS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-25 19:34:04",
    "content": " Our fourth quarter revenue was $375 million, an increase of 27% year-over-year and 29% on a constant currency basis. In analytics, we delivered revenue of $171 million for the quarter, up 3% sequentially and 35% year-over-year. We delivered a strong fourth quarter with revenue of $374.7 million, up 26.8% year-over-year on a reported basis. Revenue from our digital operations and solutions businesses as defined by 3 reportable segments, excluding Analytics, was $204 million, which represents year-over-year growth of 23%. In the Insurance segment, we generated revenue of $120.7 million, an increase of 24.6% year-over-year, driven by expansion and existing client relationships and new client wins in 2022. Healthcare reported revenue of $25.3 million down 4.4% year-over-year, driven by lower volume in the clinical services business. In the Analytics segment, we generated revenue of $170.7 million, up 25.6% year-over-year on an organic constant currency basis. Our adjusted operating margin for the quarter was 18.0%, up 100 basis points year-over-year, driven by operating leverage and partially offset by investments to support the ramp-up of new client wins. We grew full year revenue to $1.41 billion, an increase of 27.3% year-over-year on a constant currency basis and 23.1% on an organic constant currency basis. Revenue from our digital operations and solutions businesses was $764.7 million, growing 17.4% year-over-year on a constant currency basis. Our analytics business generated $647.4 million of revenue, an increase of 41.6% year-over-year on a constant currency basis. Our adjusted operating margin for the year was 18.3%, down 30 basis points year-over-year driven by investments to support the ramp-up of new business and higher operating expenses associated with a return to the office. We anticipate revenue in the range of $1.56 billion to $1.6 billion, representing year-over-year growth of 11% to 13% on a reported basis and 11% to 14% on a constant currency basis. Number one is we are seeing more and more clients come to us and say that they'd like to see an integration of analytics and our digital operations and digital solutions business because that provides them with much greater value, much higher certainty of that value and much easier accountability of us as their partner to deliver that value."
}