{
    "symbol": "EXLS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 11:12:03",
    "content": " Our third quarter revenue was $361.4 million, up 4.2% from Q2 and up 24.5% year-over-year. Our Analytics business continues to drive revenue growth, generating $166.3 million in revenue for the quarter, up 3.1% sequentially and 38% year-over-year. Our Digital Operations and Solutions business also had strong growth, growing at 14.8% in the third quarter to $195.1 million on a reported basis. We had a solid third quarter with revenue of $361.4 million, up 24.5% year-over-year on a reported basis. Revenue from our Digital Operations and Solutions businesses, as defined by three reportable segments, excluding Analytics, was $195.1 million, up 17.2% year-over-year. Insurance generated revenue of $116.2 million, up 20.3% year-over-year, driven by expansion in existing client relationships in life and annuities, property and casualty and new client wins in 2021 and 2022. The insurance vertical, consisting of both our Digital Operations and Solutions and Analytics businesses, grew 16.6% year-over-year. The Emerging vertical, consisting of both our Digital Operations and Solutions and Analytics businesses, grew 38.3% year-over-year. Healthcare reported revenue of $22.8 million, down 16.4% year-over-year, driven by lower volumes in our clinical services business. The healthcare vertical, consisting of our Digital Operations and Solutions and Analytics businesses, grew 9.3% year-over-year. Analytics generated revenue of $166.3 million, up 29% year-over-year on a constant currency basis. Our adjusted operating margin for the quarter was 18.5%, down 90 basis points year-over-year, driven by investments in the ramp-up of new client wins and higher operating expenses as we return to the office. In line with our expectations, adjusted operating margin for the first nine months was 18.4%, down 80 basis points year-over-year, driven by investments needed for the ramp-up of new client wins, digital capabilities and higher operating expenses as we return to the office."
}