{
    "symbol": "EXLS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 13:56:14",
    "content": " Our Digital Operations and Solutions business also saw strong growth this quarter with revenue of $180.2 million up 6.6% quarter-over-quarter, and up 13.2% year-over-year. Revenue from our Digital Operations and Solutions businesses as defined by three reportable segments, excluding Analytics was $180.2 million up 14% year-over-year. Insurance generated revenue of $103.3 million, up 13.9% year-over-year, driven by expansion in existing client relationships in life and annuities, higher volumes in audit and survey business lines, and new client wins in 2021. Our adjusted operating margin for the quarter was 18.2%, down 200 basis points year-over-year due to investments needed in ramping up new client wins in 2021 and investments in front end sales and digital capabilities. In terms of capital allocation, we continue to look at reasonably priced tuck-in acquisitions with revenue growth rates similar to our current business in the areas of analytics, digital capabilities, and solutions in insurance and healthcare. Your line is open. So your first question on the 2% one-time revenue, we did get some unexpected higher volumes in the first quarter in both our Digital Operations and Solutions and Analytics businesses that we did not anticipate or expect. We've added a significant amount of employees in the first quarter of 2022, and that's largely being driven by the growth that we're seeing from our existing clients and the new clients that we've had. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. You might see the sales cycle increase in timeline, but I think in terms of existing clients wanting to do more business, that's probably going to continue and it's probably going to accelerate the right time. Your line is open. Your line is open. Your line is open. They're seeing a need for changing their business models, enabling digital transformation, leveraging data, and getting into new areas, and therefore, partnering with clients -- with providers like EXL becomes a necessity for them."
}