{
    "symbol": "FLEX",
    "quarter": 1,
    "year": 2022,
    "date": "2021-07-29 15:08:11",
    "content": " And as you mentioned, and I think very important, very important point to our owners here, that's still up year-on-year and, and continues to be outstanding performance for Flex particularly compared to last several years,\n And, Matt, I'll remind you at that midpoint, Q2 will still be the highest record for us in terms of operating margin for the guide they've given you. Every business is going organically, our growth rates are strong, our pipeline and bookings have done the best ever, and you can see that in terms of not only the quality of the bookings coming through but the segments that we're growing in is consistent and I've always said that, I want every segment to be doing well on its own, whether it's top line our bottom line and that's kind of what we're seeing, right. So, obviously, those are going to go away and we're going to continue to improve margins, if you look at our guidance for the year right now at a midpoint at 4.6%, that's a pretty significant guide, right, in terms of how we see the full-year come through. But what's even better than all that will be I would say, if you look at our growth and the mix of our growth, right, we're very focused on the right kind of growth, and making sure that the mix is flowing through, through our pipeline. So I'd say, Mark I have nothing to point to that you have to be thinking about in terms of that, goes down from here if anything I'd say it's, what we have to focus on is, I'd say our journey has just started, it has still only get better from here, you can see that right from where we were, like I said couple years ago at 3.4% to 4.6% gross margin and operating margin. Some like medical and auto, I'd say kind of gets better quicker, one is because their volumes are much lower compared to tech and industrial, and as Paul pointed out in his comments, right, CC had constraints this quarter and we think tech and industrial will have kind of a longer tail, but that's more because of the scale of those segments right and how the end markets in terms of the supply chain and the chip companies have volume associated with those end markets. I think Revathi was even mentioned a couple minutes ago as well, but at the midpoint of the guide and 4.3% op margin in Q2 That would be the best Q2 we've seen and up 20 basis points, year-on-year, despite the challenges that we're seeing in the supply chain. And that's kind of what we're seeing, right with the Health Solutions business and what we delivered last year with customers in terms of ramping up for COVID care in such a short time really tremendously also changed our credibility and the industry in a big way and we're already such a significant player in terms of medical devices. So I think, as Revathi had pointed out, probably the trough, in terms of supply chain challenges, and that would include cost headwinds is – it's probably at its worst in Q2, and it gradually improves as we move into Q3 and Q4, and the challenge with this supply chain environment is it does create stops and start within our – stops and starts within our facilities and that just – that leads to inefficiencies. Just a quick…\n And then we've got – Adam I'll just point out that in the second half, we've got CC is going to be stronger because we'll have better components availability we've had tremendous new wins in that business that's going to help the whole return to work is going to help that, also – we've also said that auto winds are, we'll see more some of that coming up in our next fiscal year cycle. We're – we're putting some supply chain issues behind us, but we also see mix, being a good thing but we – our midpoint of our guidance is pretty strong, I'd say, it'll be a record year for us again."
}