{
    "symbol": "MYOV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-07-27 20:51:05",
    "content": " And despite the challenging macroeconomic environment, we ended the quarter in a strong financial position with cash and committed financing of $400 million, enabling us to fully support for ORGOVYX and MYFEMBREE commercialization activities, while also seeking to expand our pipeline. ORGOVYX delivered $36 million of net product revenues in Q1, and we're proud to report that this quarter, we also drove 26% sequential commercial demand volume growth, demonstrating the expansion of our ORGOVYX utilization. ORGOVYX's new patient starts grew this quarter with an additional 3,500 men initiating ORGOVYX in Q1, representing a 24% increase compared to last quarter, and bringing the total estimated patients treated since launch to 18,000. MYFEMBREE net revenue was $4 million for the first quarter, reflecting 54% quarterly sequential commercial demand volume growth. Collaboration expense for the first quarter was $18 million, reflecting Pfizer's 50% share of net profits from sales of ORGOVYX and MYFEMBREE in the U.S. R&D expense in the first quarter was $23.9 billion, compared to $30.9 million for the comparable prior year period. SG&A expenses in future quarters of fiscal 2022 are expected to be higher than the first quarter driven largely by marketing and promotional expenses to support the ongoing commercialization of ORGOVYX and MYFEMBREE in the U.S., including annualization of the MYFEMBREE marketing and promotional spend, and targeted patient activation primarily for MYFEMBREE. Our current liquidity position coupled with additional potential future milestone payments, from our collaboration and commercialization partners, sharing of certain relugolix-related development and commercial expenses, with Pfizer, as well as the anticipated increase in ORGOVYX and MYFEMBREE revenues, puts Myovant in an excellent financial position to successfully deliver on our key growth drivers. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}