{
    "symbol": "ENVX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 20:13:05",
    "content": " As a reminder, from a guidance perspective, we're guiding around midpoint of the range $110 million of CapEx for this year, and going back we are reiterating spending capital on building our Fab-1, investing into Fab-2 Gen2 line and then also putting capital to work for our agility line that helps us to move customer quicker to the funnel. Just to add add to what you've said, I think the feedback from customers is universally positive and I would say that amongst the different categories where we're active, the larger the battery pack or the larger the batteries, the more important they believe that BrakeFlow technology is. The focus initially we'll be getting those lines up in Fab-2 working and then once we're at a point where we're satisfied with the performance, I think we're going to want to move forward with Fab-3 as quickly as we can. We're actually doing some of that searching now, right, so that we know where that would be, but I think we'll -- we want to just make sure we're not cutting any corners on the learning on the Gen2 equipment before we start trying to expand into two locations, before we get the first one running right. Maybe as a reminder, these services revenue, they're milestone base, right, so they're more lumpy and we -- at the end of the day, make delivery from the production line, but because of those milestones, it's to be seen how it's going to unfold over the year, and as Howard alluded to from the product revenue we're anticipating to ship first this quarter. When you think about the engineering challenge there, what you're really trying to do is take all the functionality of a smartphone and make it small enough that you can wear it on your face without significant weight and bulk to it and that's a massive engineering challenge, and probably, and at least in our opinion, one of the largest challenges of that is dealing with the power budget."
}