{
    "symbol": "ENVX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 22:20:06",
    "content": " Thanks for all the prepared remarks guys, just, I know maybe what you do in revenue next year isn't really all that important in the grand scheme of things, but could you maybe just talk a little bit about the Gen-2 equipment and just kind of elongating that, that design process and I guess expecting that equipment to arrive now in the second half of next year. And for the longest time there hasn't really been a way to compete on battery, and we think it's an exciting time for us because this is really to our knowledge kind of the first real breakthrough battery to, to make it to market. That's helpful color sounds more, I don't know, blocking and tackling versus discovery or development, so that that's encouraging, I guess the second part is, if we look at the next sort of call a year and a half will be relying on, on Fab-1 to know to support these strategic customers of which, obviously it sounds like there's strong demand, I guess. So we've always sort of thought about how the business grows going from wearable cells to mobile communication, to laptops, that's kind of the logical progression in terms of our product development and launch and I think that's how we'll see it roll out. So we're seeing a lot of activity there, but as we think about, and as I think about the strategies that the strategics are taking with us they really all are kind of taking the similar approach where they start with one product category to essentially prove not so much the technology, but our ability to it and, and produce it with quality. It's really, I think look, battery technology is always very difficult to understand all the little nuances and caveats and details of, of how does it work and whether it works and when you actually get commercial units out the door to real customers, you've essentially answered all of those questions and so it's a big deal and that's absolutely how our, many of our customers view the achievement of those. And, and so I guess, would it be based on what you guys have experienced internally in conversation sort of in the context of that call, like acceleration and urgency, would it be also your opinion that there's a possibility that they sort of like, I don't know what the right, the right description is here, but like move at a faster pace now, given that urgency to complete some of these some of these production qualifications. And before we're in full scale production, because there's a lot of work that goes into the field trailing and there's some volume associated with that now that that all said it's not necessarily normal times, I would say with respect to this type of a program, a part of the reason why they're really excited about what we're doing is the product. When can we expect to see something on that you think, yeah,\n That one's harder to say just because there's lots of different things that go into our ability to say something publicly, but just rest assured that we're having very interesting discussions now that we hope will play out and finally, and finally, to the sell side out there, you guys don't have an easy job, but some of you can't even see the forest through the trees and you're so myopic and focused."
}