{
    "symbol": "ULTA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-25 21:22:08",
    "content": " From a category perspective, fragrance and bath, skincare, hair care and makeup, all exceeded expectations delivering double-digit comp growth against the second quarter last year. Hair care, our second largest category, delivered another quarter of double-digit growth driven by newness and strong engagement in our semiannual Gorgeous Hair Event, a strategic event designed to acquire new guests, increase existing member spend and drive salon penetration. Strong sales growth due to several factors, including the resilience of the beauty category, stronger-than-expected sales growth from stores and the impact of new brands drove better-than-expected performance in gross margin and SG&A leverage, resulting in an operating margin of 17%. Net sales for the quarter increased 16.8%, driven by 14.4% growth in comp sales, a $19 million increase in other revenue and strong new store performance. Strong top line growth enabled us to mitigate the gross margin impact this quarter but as sales growth moderates, we continue to expect that higher supply chain costs, including fuel costs, which are expected to remain above last year, will be a larger headwind to gross margin in the second half of the year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Within skincare, we are seeing the strong growth thatâ\u0080\u0099s driven by a combination of new behaviors that were strengthened or developed during COVID around skin health and skincare, new brands that we have launched that continue to drive our business, Drunk Elephant, Fresh Supergoop!, Vacation, new innovation, great innovation across moisturizers, serums, eye creams, acne, by brands like PEACH & LILY, Hero, so many others, Clinique across the entire assortment. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}