{
    "symbol": "ULTA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-26 18:07:07",
    "content": " and Good Molecules, as well as new products from Tula, StriVectin and First Aid Beauty, contributing to the category growth during the quarter and established brands, including Peter Thomas Roth and La Roche-Posay continue to benefit from engaging social media content. Robust top line growth due to several factors, including the continued resilience of the beauty category, stronger-than-expected store performance and the impact of new brand launches drove better-than-expected leverage in both gross margin and SG&A, resulted in record operating margin of 18.7%. We continue to expect SG&A expense will deleverage for the year, driven primarily by $70 million to $75 million of expenses related to our strategic priorities, including investments to support UB Media, Ulta Beauty at Target, Project SOAR, and other IT capabilities as well as higher wage rate growth across the enterprise, partially offset by lower marketing expense and incentive compensation. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Channel performance, again, strong results in both, driven by our stores and traffic and engagement and the desire to get back in shopping in-person, but to have our e-commerce business essentially flat after all the growth we've seen in that business over the last couple of years was in line with our expectation and salon coming back very strong. Please proceed with your question. We've been on a journey for a while to reduce nonstrategic broad-scale discounts and promotions to focus our efforts on personalization, CRM-enabled, highly relevant, strategic efforts that drive not just short-term but long-term results through higher engagement, higher loyalty, higher connection to Ulta Beauty over time, and that's what we are able to do in the first quarter. Please proceed with your question. Please proceed with your question."
}