{
    "symbol": "DT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-02 15:09:04",
    "content": " At the same time, we continue to see healthy bottom line performance in Q3 with 25% non-GAAP operating margins and non-GAAP EPS of $0.18 per diluted share, reflecting our commitment to running a balanced business even as we invest for future growth. On a constant currency basis, total ARR was $951 million, an increase of $229 million, representing 32% growth over the last year. Backing up the $34 million of perpetual license headwind to ARR which negatively impacted year-over-year growth rate by about 450 basis points, our constant currency adjusted ARR growth rate was 36% year-over-year. Expanding on this further, when looking at ARR, excluding the impacts of the perpetual license headwind, we added $263 million of new ARR over the last 12 months compared to $176 million for the prior 12 months, an increase of nearly 50%. Total revenue for the third quarter was $241 million, up 33% year-over-year in constant currency and exceeding the high end of our guidance range by $6 million. The last financial measure that I would like to discuss is our remaining performance obligation, RPO was approximately $1.4 billion at the end of the quarter, an increase of 37% on a constant currency basis over Q3 of last year. The current portion of RPO which we expect to recognize as revenue over the next four quarters, was $804 million, an increase of 35% year-over-year on a constant currency basis. With that in mind, we are once again raising our FY '22 ARR guidance to 30% to 31% growth year-over-year on a constant currency basis, up 100 basis points from our prior guidance. We now expect total revenue to be between $922 million to $924 million, representing 31% year-over-year growth or 30% to 31% year-over-year growth on a constant currency basis. Looking at Q4, we expect total revenue to be between $245 million and $247 million, up 25% to 26% year-over-year or 27% to 28% in constant currency. In addition, subscription revenue is expected to be between $230.5 million and $232 million, up 26% to 27% year-over-year or 29% to 30% in constant currency. Please proceed with your question. I will also say it's important to look at our growth rate on a constant currency basis over the last four quarters, our ARR, excluding the perp license headwind, has been north of 35%. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. If you do new logo growth and you grow 20% and your average land is $100,000, $125,000, that's another $80 million-ish of ARR. Please proceed with your question. And the fact that we've delivered it now for 15 straight quarters at north of 120%, I think, is demonstrable of just the power of the platform that our customers see and the fact that they are leaning in aggressively to things like multi-module deployments, increased host units, full stack spend, infrastructure and new modules."
}