{
    "symbol": "DT",
    "quarter": 1,
    "year": 2022,
    "date": "2021-07-28 14:27:05",
    "content": " Your line is now live. John, I’m curious to get your thoughts on high level as you kind of scale the business to its true potential where it should be multiple to , how do you think about the broader commercialization of the Dynatrace whereby today you guided business model that relatively high age fees relative to where the industry is operating at what point do we start to see pending out of you will of deal, landing points you are able to target a multiple of the 3000 customers that you have said  very successful at scale have a customer base of tens of thousands. Your line is now live. But I think the sales management would say that the biggest change over the last 12 months for us is the quality of the talent that we're attracting as a high growth, very successful company one that's focused on customers and one that's focused on sales success. Your line is now live. The very large customers have more sort of fragmentation between teams of who does what, and so to move from the application layer to the cloud platform where more of the infrastructure play as that's just moving to a different group that's adjacent to the first landing zone, but a little bit different characteristics, different care abouts and so that's one but what we're seeing most of the time, honestly is that we're landing with multiple modules. Your line is now live. Your line is now live. So over the next couple of years as we scale our customer base as we get them on to three year agreements, and as they grow, it's just going to continue to create some variability in those different metrics which is why if you really want to cut through all the noise around everything, we think ARR is the best metric. Your line is now live. And I think just with the visibility we see ahead of us, we think that the momentum we've saw this quarter, and maybe it's not a 50% quarter-over-quarter, I'm sorry, year-over-year uptick, but we do see as good, steady, strong new logo flow throughout this year. Right, and just one follow up, as you think about your kind of mix of expansion and new deals in TAM that are tied to obviously application modernization, like, how is that mixed between public cloud kind of public cloud native applications versus maybe hybrid cloud or private cloud just kind of obviously you talked about some really nice momentum with the hyper scalars. Your line is now live."
}