{
    "symbol": "PM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 15:21:04",
    "content": " In combustibles, we delivered a robust performance with a 3.7% growth in organic net revenues and 0.3 percentage points higher share of segment excluding Russia and Ukraine despite the impact of adult smokers moving to smoke-free products. Our full-year net revenues grew organically by plus 7.7% excluding Russia and Ukraine and by plus 7.1% for total PMI, despite the impact of hyper-inflationary accounting in Turkey. Despite margin pressures, our excellent top-line growth and diligent cost management enabled us to deliver currency-neutral adjusted diluted EPS growth of plus 11.9% to $5.34, excluding Russia and Ukraine. Now turning to the 2023 outlook, we expect to deliver very strong organic net revenue growth of plus 7% to plus 8.5%, supported by a step-up in combustible pricing and another year of rapid progress from IQOS. Including Swedish Match and at constant-currency, we expect to deliver around $13.5 billion in smoke-free net revenue compared to $10 billion in 2022 and to approach 40% of total PMI net revenues this year. Given our leadership in smoke-free product and the growth of the category, we expect to gain share and target total PMI shipment volume to be flat to plus 1%, which would represent the third consecutive year of growth. Importantly, while cost inflation is also headwind for IQOS, the 2023 margin impact of our heat-not-burn business is expected to be favorable due to the positive impact of increased HTU volume at higher net revenue per unit, planned ILUMA efficiencies and a more measured increase in device volumes. In Japan the heat-not-burn category now represents close to 35% of total tobacco with IQOS increasingly driving its growth In Q4, the adjusted total tobacco share for our HTU brands increased by plus 2.6 points to 24.5% with offtake share in Tokyo surpassing 30%. With an excellent performance over the past two years and our strong 2023 outlook, we expect to comfortably exceed our three year minimum CAGR targets of more than 5% organic net revenue growth, more than 9% in currency-neutral adjusted diluted EPS growth and broadly stable shipment volumes."
}