{
    "symbol": "PM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-25 10:58:09",
    "content": " We delivered a very strong performance in Q1, with double-digit organic net revenue and currency-neutral adjusted diluted EPS growth on a pro forma basis, excluding Russia and Ukraine from both the current and prior year quarter. Our total organic net revenue per unit grew 5.3% and by plus 4.9% on a pro forma basis, driven by the increasing proportion of IQOS HTUs in our sales mix, higher device volumes, and pricing. Importantly, we expect to deliver organic net revenue growth of plus 4.5% to plus 6.5% compared to 2021 pro forma adjusted net revenues of $29.2 billion. Despite these added headwinds, and a further expected COGS increase of around $300 million compared to our initial expectations we remain confident that we will achieve organic pro forma margin expansion as our strong revenue growth, favorable product mix and cost savings initiatives deliver sustainable accretion. We forecast pro forma currency-neutral adjusted diluted EPS growth of plus 9% to plus 11%, also above our prior total PMI full year guidance. On a pro forma basis, we expect to deliver between 88 billion and 92 billion HTU shipment volumes, representing plus 20% to plus 25% growth over the pro forma prior year of 73.5 billion units. Our strong 2022 outlook places us firmly on track to deliver our 2021, 2023 CAGR targets on a pro forma basis of more than 5% in organic net revenue growth, and more than 9% in currency-neutral adjusted diluted EPS growth. IQOS devices accounted for approximately 6% of the $2.1 billion of Q1 RRP pro forma net revenues, reflecting higher year-over-year device volumes as supply constraints ease and ILUMA performs strongly. Our 2022 fundamentals are strong, with a pro forma expectation of 4.5% to 6.5% organic net revenue growth and 9% to 11% currency-neutral adjusted diluted EPS growth. And honestly, that kind of brings me to my second question, as I think about your new pro forma HTU volume guidance of 88 billion to 92 billion units for this year, which is assuming 22% growth at the midpoint."
}