{
    "symbol": "MOD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-03 13:30:13",
    "content": " :\n 0:10 Good morning, ladies and gentlemen, and welcome to Modine Manufacturing Company's Third Quarter Fiscal 2022 Earnings Conference Call. 0:36 I would now like to turn the conference over to your host Ms. Kathy Powers, Vice President, Treasurer, Corporate Communications, Investor Relations. I'm joined on this call by Neil Brinker, our President and Chief Executive Officer; and Mick Lucareli, our Executive Vice President and Chief Financial Officer. We will be using slides for today's presentation, which can be accessed either through the webcast link or by accessing the PDF file posted on the Investor Relations section of our website modine.com. This call will contain forward-looking statements as outlined in our earnings release, as well as in our company's filings with the Securities and Exchange Commission. 1:27 With that, it's my pleasure to turn the call over to Neil. As I mentioned last quarter, we are undergoing a great deal of change of Modine, we have transformed our organizational structure, and it's significantly strengthened our management team. Over the past few quarters, we have begun employing (ph) 80/20 to guide our decisions as we actively manage our portfolio businesses. As previously discussed, we are thinking about our vehicular businesses differently, focusing more on technology rather than end markets. 2:43 Along those lines, our new EV organization is focused on providing smart thermal system technologies to specialty and commercial vehicle customers. Our strategy for this business is to leverage our thermal and mechanical expertise to provide a turnkey solution, the fast growing niche markets. By controlling the temperature of the vehicles key components, we can improve the battery's range and life. As we increase our investment in products and technologies that will feel profitable revenue growth, we're also taking actions to improve the profitability of other parts of our business. 3:50 Our objective is to optimize profit margins and cash flows, while focusing resources on the products where we have technical competitive position, and what we can provide value to our key customers. In order to meet our return targets, we will reduce SG&A expense and limit capital expenditures and low margin areas where we do not have a competitive position. 4:12 As I mentioned last quarter, we're working on restructuring plans to improve profit margins across all business units, particularly within our automotive business. For the full company, we are targeting approximately $20 million in annual savings with these actions. While we're too early in the process to precisely estimate the associated costs, we expect to record approximately $20 million to $25 million of restructuring expenses for these plans. We will finalize our plans in the fourth quarter, and we'll provide more details in terms of timing, levels of cost savings and related charges at that time. Now, I'd like to provide some business highlights for the quarter. We're currently seeing these numbers decline, but that could change as new variants emergence spread. However, creative recruiting solutions, enhance benefit offerings, modifications to our wage structures, and hiring incentives have allowed us to make significant progress and filling our open positions. 6:32 Now moving on to the segments and building HVAC, demand remained strong for our Heating, Indoor Air Quality and Data Center businesses. That said, as of the third quarter, we were not able to fully offset inflationary pressures with price increases, causing our margins to decline year-over-year. In December, our heating plan in Virginia produced 20% more units than previous single-month record. This was possible, in part due to employees that travelled to Virginia from our Racine, Wisconsin headquarters and our Lawrenceburg, Tennessee plant, so that we would have sufficient labor resources to meet demand. 8:01 Moving to our CIS segment, our focus during the quarter was primarily on pricing and supply chain management, this included expediting raw material purchases, which impacted our freight costs. That being said, we had less overtime during the quarter, as the labor situation improved. This allowed us to reduce our order backlog, while market demand has held steady. We saw a significant improvement in the margins this quarter versus the prior, due to higher sales volume despite the supply chain challenges. In addition, we're using 80/20 in our coils business to take targeted-pricing actions, simplify our product offering and improve operations efficiency by maximizing setups to eliminate bottlenecks on the plant floor. 8:44 In our HD and automotive segments, our focus has shifted to improving profitability, utilizing 80/20 deep within our processes. 9:14 As we think about our business, there's a common thread. We do this by reducing water and energy consumption and data centers, improving air quality in schools and businesses as we continue to battle global pandemic. 9:59 Now, I'd like to turn the call over to Mick who will review our results for the quarter and provide segment financial updates. I'm pleased to report good sequential performance from the previous quarter as we continue to work through the supply chain challenges, rising input costs and labor shortages. A portion of the decline was due to the lower volumes, but that was offset with higher plant productivity. The main driver of the earnings decline relates to the current inflationary environment, especially around material costs. 11:42 During the quarter, we experienced approximately $39 million in commodity metals, freight and packaging increases. However, we were able to recover $29 million of the cost increases, which resulted in a net negative EBITDA impact of $10 million. Like many companies, we've been battling significant cost increases throughout 2021 and now into 2022. 12:10 As previously discussed, we expect the cost recovery gap to narrow with time and I'm pleased to report that the negative materials impact was reduced by 50% as compared to the prior quarter. Last we are closely managing SG&A cost, which favorably impacted adjusted EBITDA by $3 million. Although adjusted EBITDA margin was below the prior year, we're seeing positive momentum from our recovery actions, which resulted in sequential margin improvement from Q2. 12:44 Adjusted earnings per share of $0.31, was $0.03 above the prior year. The balance of smaller adjustments can be found in a press release and appendix, which includes additional information, US GAAP result and complete reconciliations. This includes approximately $5 million related to pricing actions, mainly in our heating business. Heating product sales were up 9% over the prior year, while indoor air quality finished 8% higher. 13:58 As anticipated, we experienced strong sequential margin improvement, but our EBITDA margin remains below prior year levels due to several factors. First results were negatively impacted by the higher material and freight costs, as it's taking us a little longer than anticipated to fully offset the rising costs. Second, our heating products carry shorter lead times in the extremely tight labor market resulted in higher labor costs. Finally, we've made some temporary investments in SG&A to support aggressive growth plans. 14:48 Before I move on, I'd like to point out that we're excited about the growth opportunities with building HVAC. Despite the recent headwinds, our gross margin was over 30% which is the large improvement from the first half of the year. Third quarter sales for CIS were up 19% or $24 million, with $13 million of the increase coming from pricing. Revenue was up double digits in most markets, including 30% of commercial HVAC, 14% on refrigeration, and 10% in coatings. Most importantly, the adjusted EBITDA margin improved 250 basis points. The earnings and margin increases were driven by several factors, including increased volume, realization of key pricing initiatives and a focus on operational improvements. Given the steady market demand, the reduced backlog and our 80/20 work, we anticipate finishing the fiscal year with further margin improvement in Q4. Similar to building HVAC and CIS, the sales increase is partially driven by increased pricing. Pricing and foreign exchange resulted in a $9 million increase, while sales volume was up $6 million or 3%. With regards to our markets, we experienced strong revenue growth in the box and specialty vehicle market, particularly in the Americas region. 16:41 In addition, the off highway market experienced double digit increases. As is typical for this segment, commodity costs have a large impact on bottom line results. 17:18 As I mentioned last quarter, we implemented additional pricing adjustments in January, which should result in further margin improvements. The supply chain remains highly uncertain, including the metals markets, but we are benefiting from market demand and new program launches. Given all these activities, were pleased to deliver the sequential margin improvement in Q3 and expect a further increase in Q4. As expected, our auto segment was heavily impacted by volume declines tied to semiconductor shortages and other supply chain issues within the auto industry. In addition, we sold our Austrian business earlier this year. Adjusted EBITDA was significantly lower, largely from the sales decline. Lower volume accounted for nearly all of the $13 million EBITDA decline, along with some material cost increases. 18:30 SG&A was up with general inflationary pressures, we are moving swiftly to improve the automotive business through pricing initiatives, restructuring activities, and optimizing our plants. As Neil previously discussed, we've begun taking aggressive profit improvement actions through commercial negotiation, and SG&A cost reductions. Based on the 2022 market outlook, in our restructuring plans, we anticipate further improvements in Q4, and even larger steps in the new fiscal year. As anticipated, our Q3 free cash flow was a positive $16 million. As I mentioned earlier this year, the first half of fiscal ‘22 would be challenged in terms of cash flow, with improvements in the second half. Over the last three months, we've focused on improving our working capital. Our net debt of $330 million is slightly lower than the prior quarter and our leverage ratio is 2.5 times, which is within our targeted range, and we expect a further decline by fiscal year end. I'm pleased to report that after analyzing the current economic conditions and the actions we're taking as a company, we're maintaining the fiscal 2022 outlook. Material costs continue to be our largest headwind, and volatility over the last several weeks has made the outlook even more uncertain. While year-over-year comparisons have been challenging to the economic climate, I'm very encouraged by the sequential improvement and trends heading into our new fiscal year. Your line is open. I'm trying to think of, you're talking about $20 million of cost cuts in the future. It will be a heavy, heavy piece in the automotive segment and then a smaller portion in HDE and a little bit across some other areas of the company. From short-term nature, long-term nature of it, it was gonna take us probably the next quarter to finalize all of those plans and then still a little early, but I think it's a fair target to capture about half at least half of that in the new year. Then when I think about, how we should think about pricing, clearly, it was CIS, you seem to have an easier time of  necessarily building HVAC and trying to get a sense of, is that based on the products, you're selling the customers. You're selling to the contractual terms, why it was that much easier to get the margins back up on CIS and then also whether we would see greater pass throughs just contractually with HD and automotive in this current quarter, although you got quite a bit this quarter. Regarding the difference, there's, CIS had implemented those price increases pretty early on a backlog that wasn't as strong or robust as on the HVAC side. So we've done more incremental price increases on the HVAC side, while we're burning through a larger backlog than on the CIS, on the CIS backlog. 24:31 Yeah, I think last year was a little bit of a dip, Steve. These are all generally big orders and sometimes they are – they can be lumpy, depending on just the timing of the actual shipment or when the customers ready to receive it. Well, we're on track this year, still, too, we're still targeting that $100 million range of data center revenue on a full year basis. Your line is open. First with the guide, that's kind of, that’s pretty wide range with two months to go. We decided and typically, we won't adjust guidance with a quarter to go, even though we could have thought about maybe narrowing that band a little bit. But as we went through the, the segment by segment results, Matt, I think we're clearly feel really good about where we sit in that range. So I would say, as I went through it, we expect sequential improvement in earnings and in margins in Q4 and if you just take that from the $102 million, we've done year-to-date. But we feel secure within that range and we probably, the math would simply say we'd have to go backwards to get at the low end. How much of that was structural versus formulate pass through, and how we should be thinking about structural pricing looking forward. 27:15 Yeah, and you when you talk about structural I think, it's really margin improvement. 27:31Yeah, so maybe I'll go through segment by segment a little bit and Neil can add up now let Neil add color over the top, clearly across the total company in the quarter, this was same as last quarter. It tends to have longer lags, the auto side, frankly, is more tied to quarterly. So we have a lot of work to do, commercially, strategically using 80/20, to not only recoup those costs increases on the vehicular side, but then think about even different ways to manage that business going forward to get structural improvements. On the CIS and HVAC side as you can imagine a lot, I think, cleaner, I won't say easier. And Neil was just talking about CIS, they were able to jump out in front of that very quickly and you could see that in the numbers. The first three quarters of this year, there was a, they did a series of price increases, two or three to catch up on material pass through level, what we see beginning in Q4, and beyond will be more pricing on a structural level and building HVAC. And then just as a follow up, if you look at the data center piece of the business $100 million platform for you guys this year. 30:33 Yeah, Matt, I think that's a good question. We're in the process of developing our strategic plan, we should expect to see some of the outputs relative to our, our outlook relative to hyperscale, as well as colocation. 30:55 And then the only thing I would add is, yeah, I think the target for us is to continue to go greater than the market, I think it'd be hard to have another continue, obviously, at a 50% clip, that if the markets are going to be up another 15% or 20%, next year, our goal is to outpace that market growth. Your line is open. I wasn't able to get to the first time around, really about the automotive and plans on restructuring. I think you've touched on a couple of the points in your presentation, but I'm trying to think about in terms of and we certainly know some of the larger automakers over the last one or two weeks is the assumption with the chip shortage could be alleviated significantly this year more, but more back end loaded. So as we think about automotive, we're looking at it in terms of technologies where we have a competitive position where we see evolution in the market towards EV products, where we have good strong customer relations. Those are the areas that we're going to continue to rally around other areas where we don't have a competitive advantage, regardless of the vehicle recovery. If there's margin compression and margin issues and challenges, those are going to be areas that we're going to continue to have conversations commercially, as well as looking at the other options. 33:29 Yes, back to the restructuring plans and the savings Neil targeted by first. So first and foremost, those numbers are nearly all tied to SG&A cost reductions, really refocusing on the areas that Neil said that we think, drive value for us, so not plant restructurings in there. So the last couple of years, we – it's – we've shrunk it, we executed the sale in Austria. We think A, already today has good margin or margin potential, and B, leads to the EV transformation."
}