{
    "symbol": "MOD",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-26 13:29:08",
    "content": "  Operator: Good morning, ladies and gentlemen, and welcome to Modine Manufacturing Company's Fourth Quarter Fiscal 2022 Earnings Conference Call At this time, all participants are in a listen-only mode. Good morning, and thank you for joining our conference call to discuss Modine's fourth quarter fiscal 2022 results. Before covering our quarterly results, I would like to go over some changes that we've made to our segment structure at the beginning of our new fiscal year. Our first segment is Performance Technologies, which is comprised of our heavy-duty equipment, automotive, EV, and coatings businesses. We are now managing this business by technology and product groups, and will report revenue based on three sub-segments. The second sub-segment focuses on liquid-cooled applications, including components such as oil coolers and exhaust gas recirculation coolers sold to these same end markets. This segment also has three sub-segments, heat transfer products, HVAC and refrigeration, and data centers. Heat transfer products is our coils business, which primarily sells into HVAC and refrigeration end markets. The final sub-segment is our data center business, including data center systems and services. I'm pleased to report that we have had strong earnings growth, driven by higher revenues in key markets, and also due to the actions taken earlier this year to improve our business, including implementation of 80/20 actions. We have spent much of this past year strengthening our commercial organization, and we definitely saw the positive impacts of those changes this quarter, particularly in our building HVAC and CIS segments. We have implemented multiple pricing adjustments, and have improved our commercial agreements with our customers, using 80/20 as a guide to ensure that we are focusing on the most impactful areas. By simplifying our processes and working to grow and resource our best performing businesses, we expect to continue to see margin improvements into fiscal 2023 and beyond. However, we've been able to take advantage of this situation through superior product availability and shorter lead times, allowing us to continue growing our market share and creating a competitive advantage for our products. I would now like to take a moment to give an update on our school ventilation products, which has been a small business for us historically, but one where we are now dedicating additional resources and project strong future growth. So, it's critically important that we capture our share of this major infrastructure spend over the next several years. And given that market demand, we believe this business is likely to double over the next three years. We continue to increase market share by converting distributors and strengthening our marketing activities, with targeted campaigns and development for both residential garage heaters and for our high efficiency products to go into greenhouses and warehouses. In our data centers business, we are still seeing strong demand from key accounts as the data center market continues to expand. This has created a production backlog, which we’ll continue to work through, but that could negatively impact our first quarter, particularly after our strong Q4. Progress continues in our new production facility in Virginia, and we are developing a strong pipeline of orders that will start shipping by the end of this calendar year. Our CIS segment had a very strong quarter, with significant growth in both revenue and earnings. We continue to see the benefit of commercial actions taken earlier in the year, with our revenue growth driven by both volume gains and pricing improvements. This segment is an early indicator of the potential benefits of 80/20, as we have the most flexibility to make rapid business decisions and see the benefits. We have implemented several price increases in our coils business, which is seeing pockets of growth, particularly in European heat pumps and North America pool heaters. We have also targeted certain areas of the business to exit, as we focus more on margin improvement and less on topline growth in this area of the business. In our coolers businesses, we are dedicating more capacity for the production of CO2 coolers, as we expect this market to continue to grow. As we mentioned last quarter, we are implementing restructuring actions intended to reduce SG&A and operational expenses, particularly within our European automotive business. Although demand remains strong for our heavy-duty products, we're still dealing with issues on multiple fronts, including cost inflation and supply chain disruption. We continue to work with our customers to better offset cost increases with pricing, and have had some successes in our HDE business. The automotive business remains challenged, with ongoing volume pressures due to supply chain issues. As you know, we separated out this business in fiscal ’22, and have built a strong, energized EV team. Last week, we launched the marketing campaign for our EVantage brand of thermal management systems, which are designed to improve battery performance range and life on the wide range of electric vehicles, including commercial, specialty, and purpose-built products. I'm pleased to report solid revenue growth this quarter, which was driven by a combination of pricing and volume increases. Fourth quarter sales were up 12% or $60 million, as building HVAC, CIS, and HDE, experienced significant gains. $41 million of the increase was driven by higher volume, which is a significant improvement over the last few quarters. Pricing and material pass-throughs accounted for $33 million of the increase, while FX was negative, offsetting these gains by $14 million. Through the hard work of our various teams, we're recovering material cost inflation, and addressing the lowest margin areas of our businesses. During the quarter, commodity metals, freight, and packaging, increased $32 million from the prior year. Last, we’re closely managing our SG&A costs, which favorably impacted adjusted EBITDA by $2 million. Clearly, we're seeing momentum from our various actions, which resulted in both sequential margin improvement from Q3, and a year-over-year improvement of 170 basis points. Adjusted earnings per share of $0.57, was $0.06 above the prior year. Before moving on, I'd like to point out that we had $21.7 million of Q4 earnings adjustments. The main driver of the volume growth was a strong increase in data center sales, which more than doubled compared to the prior year. Heating and ventilation product sales also contributed, both up over 30% from the prior year. Adjusted EBITDA increased 58% from the prior year, resulting in a 70-basis point improvement to 17.1%. We're pleased with the further margin improvement as the team works through the impact of higher material costs, along with overall supply chain inflation and disruption. SG&A was slightly higher than the prior year, partly due to higher commissions, but significantly lower as a percentage of sales. CIS also reported an exceptional quarter, with solid revenue growth and outstanding earnings improvement. With regards to 80/20, CIS represents an early indicator regarding the results that the 80/20 process can bring across all of our businesses. Revenue was up significantly in most markets, including 27% in commercial HVAC, 21% in refrigeration, and 20% in coatings. Adjusted EBITDA increased $12 million to $24 million, nearly double the prior year. The earnings and margin increases were driven by several factors, including higher volumes, commercial pricing initiatives, improved mix, and a focus on operational improvements. With regards to our markets, we experienced strong revenue growth in the off-highway and the bus and specialty vehicle markets, especially in the Americas region. Adjusted EBITDA declined by $5 million, driven by a reduction in gross profit and slightly higher SG&A. While it's difficult to quickly offset cost increases in this environment, we believe that we'll be able to recover a majority of the higher costs. In addition, we're further encouraged by the recent downward trend in the metals markets, which should have an additional positive impact in the coming quarters. The HDE team is laser-focused on margin improvement, and we expect all of these actions will have a positive earnings and margin impact in the new fiscal year. Similar to HDE, the auto segment has been impacted by supply chain issues, plus volume declines tied to the semiconductor shortages and other disruptions to the overall auto industry. In addition, we have a difficult year-over-year comparison due to the sale of our Austrian business early in fiscal 2022. Collectively, these factors contributed to a fourth quarter sales decline of $23 million, including an $18 million impact from our Austrian sale. Adjusted EBITDA was $2 million lower than the prior year, due to the lower sales volume, partially offset by operational efficiencies and lower SG&A. As part of our plan to optimize this business, we're implementing cost savings initiatives across the organization, moving swiftly to improve our automotive business through pricing initiatives, restructuring activities, and plant optimization. The team is well on track with our targeted $20 million of SG&A savings, with the first portion beginning later this year. This has been a difficult year from a cash flow perspective, partly due to COVID-related savings last year, along with the supply chain challenges that have been impacting our inventory levels. We're anticipating positive free cash flow in fiscal ‘23, driven by earnings improvements, working capital management, and ongoing cost controls. This includes approximately $20 million of anticipated cash restructuring payments, mostly tied to our cost reduction plans in Europe. I'm happy to report that due to the anticipated positive cash flows for the next year, we plan to restart our share repurchase plan in the next quarter. We finished the fiscal year with a leverage ratio of 2.3, which is within our targeted range and improved from the prior quarter. As we look forward to the new fiscal year, we're encouraged by the positive trends in our markets and the early benefits from the actions taken this past year to improve our business. That said, it remains an extremely volatile environment, with many factors to consider, including ongoing inflationary pressure and material, labor, and overhead costs, plus supply chain shortages, COVID shutdowns in China, and the Ukrainian conflict. Considering all these factors in our current market outlook, we anticipate revenues to be up 6% to 12% in fiscal ’23, with sales increasing in most end markets. The EBITDA improvement will be driven by pricing and volume gains and favorable sales mix, partially offset by anticipated cost inflation and higher SG&A, including higher labor and incentive compensation. First, I'll point out that over the last few years, we've seen a somewhat seasonal pattern, with quarters three and four representing the high-water mark, and then a dip in Q1. In addition, we're experiencing some temporary headwinds in our vehicular businesses that we expect to improve over the next few months. Therefore, we anticipate that our first quarter will represent a difficult comparison to prior year, then improve sequentially and year-over-year in the next three quarters. Beyond this, we're very encouraged by the revenue and margin outlook for our building HVAC and CIS businesses. In addition, we expect full year margin improvement in the vehicular businesses, as we eventually recover the significant material cost increases experienced in fiscal ’22. First, just with CIS and where you're at with the 80/20 process there, maybe talk in baseball analogy with where you're at with implementation. So, short answer is, I would expect that we won't be able temporarily to keep that level of margin, but certainly well above where we've been, I think running that more in the 10$ to 12% in the short run, and then certainly, Neil and I, would like to see it get to a 14$ or 15$ more long-term. So, about - probably think of that as about a 20% revenue impact in Q4 and Q1 on the Asia business. My expectation would be, we'd love to get half of it, but I think somewhere, maybe a third to half of it would be the goal this year, just based on the timing of how those processes work. We're - I'd say, we're pleased with how it's working and now we're into the heavy lifting of it, the hard work, but it's absolutely side by side with the works council. I know how challenging that is in this kind of environment, particularly to put out full year numbers, and given the various end markets you operate in. We’ve - through 80/20 and our segmentation process, we've targeted growth areas for the business. We're going to provide the capital, and those are the areas where we think we can continue to grow, and that's a major driver in terms of how we've forecasted our guidance. When I think about the sales guidance, can you give any sense, I know it's kind of hard to break out pricing versus volume versus mix when you're thinking about that. I was just - yes, Steve, I was going to - that was the one point I would add to what Neil said was, based on our guidance, I won't give you the specifics, but we have a heavy mix, I call it mix, of price recovery that's contractually owed to us and another component of price negotiations with customers, whether we attribute that to 80/20 or recovery, and then volume. And then, if you spread the volume across the areas Neil walked you through, I would say a lot of our growth businesses have a very strong order book, which is good. When I think about that increase in CapEx expected, I'm assuming - you've talked a lot about the investment in the growth segments. For the first time in my years at Modine, we're going to have a bigger portion of our capital spending in our growth businesses, specifically in that Climate Solutions area, to support data center growth, ventilation, indoor air quality, heating. So, I think from a guidance and a modeling, the only material impact we would see in that, and I'll just leave it with a flat to modestly down in CIS. I'll let Neil comment, because I know there's a lot going on, even on the building HVAC side with product rationalization. Sometimes we're working through the SKU reductions, and you'll see some volume decline. And as we shift our energy from Climate Solutions, because we've got - we're in motion and we're happy with the progress that we've made, we can now start to really focus on that peak - on the Performance Technologies segment. And I would expect as we go through the same process as we did in Climate Solutions, that we're going to see some of that. We're starting to do sub-segmentation in that business, and then we're really going to start to get into the data. And then, I would assume as you let that business attrite in CIS, that that's going to have a natural margin benefit to that as that unfolds."
}