{
    "symbol": "BAND",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 18:17:06",
    "content": " Spin the dial on the DeLorean dashboard from 2017 to 2026, and when we land, you will see we provide service in over 60 countries, serve billions of messages and voice calls, expect 60% non-GAAP gross margins, 20% EBITDA margins, and approximately $125 million in total free cash flow from the prior three years, all while growing annual revenue 15% to 20% on average. Whether it's iconic hyperscalers like Microsoft, Google, or Zoom for hybrid work, customer experience pioneers like Genesis and Five9 for cloud contact centers, the many innovative SaaS companies building text messaging into everything from healthcare to conversational e-commerce, bandwidth is their communications cloud. Our long-term ambition includes growing annual revenue at an average 15% to 20%, and with continued operating discipline, we expect to deliver greater than 60% gross margin, greater than 20% EBITDA margin and a greater than 15% free cash flow margin over the next three years. Our core business model has repeated and grown over the years weâ\u0080\u0099ve been in business with each wave we have benefited more and more from Bandwidth operated network economics, which have expanded our margins from 48% in 2019 to over 55% in 2022. Turning to KPIs, our dollar-based net retention rate or DBNR grew sequentially to 112% for customers greater than a $100,000 annual recurring revenue, our DBNR grew to 115%, 3 percentage points higher than the total customer metric and clearly demonstrating the benefits from focusing on direct to enterprise and larger customer opportunities. The strong results you see here on revenue growth, non-GAAP gross margin expansion and customer additions are the direct result of progress the business has made, adding product offers, expanding services globally and establishing Bandwidth as the critical enabler of cloud communications. Based on the expected top line revenue growth Iâ\u0080\u0099ve described, we expect a favorable combination of non-GAAP gross margin and operating leverage to produce adjusted EBITDA of approximately $45 million at the midpoint, an increase of 30% year-over-year. Weâ\u0080\u0099re going to keep driving cross-sell adoption of our North American customers into the international markets, and we expect greater than 20% of our revenue to come from outside North America within three years, representing a CAGR of 15% to 20%. At the growth rates we're expecting and at the through 2026 into 2027 and 2028 with modest revenue assumptions and our greater than 20% EBITDA margins and greater than 15% free cash flow margins, we think in 2026 and 2027, it will give us plenty of capability to retire the 28 notes when they come due."
}