{
    "symbol": "DXYN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 16:02:05",
    "content": "  Operator: Good day, and welcome to The Dixie Group, Inc. 2022 First Quarter Earnings Conference Call. Net sales for the quarter were $77.6 million or 6.6% above the net sales of $72.7 million in the first quarter of 2021 as adjusted for the divestiture of the commercial business. The net loss for the quarter was $3.3 million compared to $2 million a year ago, including discontinued operations. But ocean freight costs have risen dramatically, which impacted our first quarter results. Fortunately, we have experienced a reduction -- some reduction in freight costs, which started to improve margins late in the quarter. As Dan noted, our first quarter results were negatively impacted by price increases imposed by our primary raw material provider, exceptionally high freight costs on our imported goods and other increased costs driven by inflation. Primarily as a result of these factors, our gross profit as a percent of net sales for the quarter was 19.6% compared to 23.2% in the first quarter of 2021. Interest expense on the quarter was $1.1 million, which was down from the previous year at $1.3 million. Net inventory increased by $3.2 million during the quarter, primarily as a result of the increased raw material costs. Our debt increased by $3.8 million during the quarter, driven by the higher costs and timing of payments on accruals. During the quarter, we closed on an $11 million loan secured by our facility in Adairsville, Georgia. This long-term low interest loan allowed us to pay off existing mortgages on the facility at a total of $5.5 million, which were at higher interest rates and avoided future billing payments. Our capital expenditures during the quarter were $345,000 and depreciation was just over $2 million. As we have stated, our residential business in the first quarter of 2022 grew 6.6%. Overall, we continue to outpace the market in the specialty retail segment with 9% growth for the quarter. We successfully launched our new decorative segment offering during the first quarter at trade shows, including surfaces, other regional markets and our national sales meeting. We're introducing 30 new styles with fresh looks and on-trend colors, and the new offering will include hand tufted, hand loomed, wire wilton and face-to-face woven products. We also launched several new hard surface programs during the first quarter, including TRUCOR Tymbr, a 9.5-inch wide by 72-foot long laminate product with excellent water resistance up to 72 hours, stunning visuals and an AC6 scratch-resistant rating, as I mentioned, 72 inches long. Another new program is Dwellings by home -- Dixie Home, an engineered wood program, which hits mainstream price points and offers beautiful colors and finishes in oak and hickory. The movement to several other suppliers should be completed in the second quarter, and our costs for the second quarter will begin to reflect this transition with these changes. In the last year, the average price of residential carpet for the industry has risen 10% and over the last 2 years, 20%. However, we're still cautiously optimistic for the year due to the structural deficit of housing availability today, and remodeling should continue as homeowners continue customizing their homes. Going forward, we feel our new raw material sourcing plan allows us to have more control over our product offering over a broader array of price points. In conclusion, comparing the first 6 weeks of the second quarter to last year is complicated by the fact that we had a ransomware attack during that same period a year ago. We also are exiting our business with a large mass merchant this quarter, which will negatively impact our top line. Despite these factors, our orders and sales to our residential retail customers are up, and we believe our initiatives described above will help us be a more important supplier to the specialty retail segment in the future. The question is on the divestiture of the commercial business, there was some inventory that was retained on behalf of Dixie that you guys commented we're going to dispose of with the next couple of quarters. We are looking forward to our conference call at the end of the second quarter, at which time we think we will be virtually complete with the conversion from our Invista fiber, which 3 years ago was 90% of what we purchased to 4 or 5 other suppliers, and we feel like it will put us in a much stronger position going forward."
}