{
    "symbol": "PRPO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 20:24:13",
    "content": " You should not place undue reliance on forward-looking statements as these statements are based upon our current expectations, forecasts and assumptions, and are subject to significant risks and uncertainties. These statements may be identified by words such as may, will, should, could, expect, intend, plan, anticipate, believe, estimate, predict, potential, forecast, continue or the negative of these terms or other words or terms of similar meaning. Risks and uncertainties that could cause our actual results to differ materially from those set forth in any forward-looking statements include, but are not limited to, the matters listed under Risk Factors in our annual report on Form 10-K for the year ended December 31, 2020, which is filed with the Securities and Exchange Commission as well as other risks detailed in our subsequent filings with the Securities and Exchange Commission. Statements and information, including forward-looking statements, speak only to the date they are provided, unless earlier date is indicated. And we do not undertake any obligation to publicly update any statements or information, including forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. Now let me hand the call over to Ilan Danieli, Precipio's CEO. Hello and good afternoon, everyone, and thanks for joining our 2022 second quarter shareholder update call. Hopefully, we'll be able to address them in today's call. I realize this is an August summer afternoon, and if you are not , in the Northeast, it's a beautiful one. Today, I'd like to expand on a few of the recent news items we released over the past few months and give you a little more color into what we've been working on and our plans going forward. As you can see from the recent activity, as our pathology services division continues to grow, management's focus is on the product division. As we said all along, our intent is not to build our own sales force to sell HemeScreen and other products, rather to leverage distributors who have already -- who already have existing sales teams. The challenges of finding and hiring a team, the time line until they become productive, and of course, the costs simply don't align with our company goals. Particularly post COVID where access to customers and recovery is harder, partnering with teams with preexisting relationships is critical to knowing who the right decision makers are within that (inaudible) organization, gaining quick access to them and ultimately making the sale. We began our partnership with AON Solutions as distributor of (inaudible), which help us obtain our very first customers. Over the next few weeks, we will be training additional members of their team in creating a program to focus on key strategic accounts who would most benefit from HemeScreen. As we recently announced, we signed a distribution agreement with Thermo Fisher. Second, Thermo sales team is second to none. Not only in their size of their team, the team that has passed with selling HemeScreen boasts more than 200 sales managers nationwide. Initial interactions with their teams have already served to validate that reputation, and they quickly grasp the value proposition of HemeScreen and the potential benefits to their customers. And lastly, the Thermo team is well entrenched with their customers. They, too, are a major industry player, and we believe they will have a substantial impact on our market growth. In other words, there is no money in the world that can buy such a sales team, and we've successfully lined up the right partners to execute on our distribution strategy. With them, we will have access to all market segments that are targeted for HemeScreen, physician office labs, hospital or acute laboratories and independent reference laboratories. While there may be some overlap between segments, for the most part, each distributor has its own market share of the industry, which will translate into market potential for HemeScreen. (inaudible) set high bars for success, and we will be managing these partnerships closely and providing support to them on a daily basis. Over the next 6 to 9 months, we are tasked with training of the 250 sales reps and ensuring that they have the necessary knowledge, tools and support to generate revenue. And as our company's product line develops, the need for further training and development will always be there. This is a daunting task for even a large company, and we intend to do it right, which is why we recently announced the hiring of Toni-Ann Mills to lead this path. I feel like the bicycle we've been driving so far just got a powerful set of engines stepped onto it, and we are about to take off. Second, I'd like to discuss our product portfolio. Our BCR-ABL panel is gaining great traction, and we expect to have several sites up and running this quarter. The same goes for our anemia panel, which, due to market feedback, we will be rebranding as a panel. Our AML, or acute leukemia, panel is actually gaining interest not only with our HemeScreen customers, but also with pharma companies due to the unparalleled rapid turnaround time it provides. With each panel that we add, the market potential for HemeScreen grows. Lastly, we've been working on several new and exciting features with HemeScreen, ones that will further simplify the workflow, improve economics for the customer and, most importantly, provide better clinical value to the treating physician and to their patients. We are seeing for ourselves the benefit of our model, the combination of a product division that developed their technologies and a clinical laboratory division where we can identify laboratory needs, test new concepts and validate and run them clinically in our lab. Of course, none of this would be -- would work without building a strong team, and that has been one of my main focuses over the last period. Under his leadership, Keith has assembled an all-star team that provides all the necessary components to achieving success. Sales, marketing, training and development, customer and technical support, all those are crucial elements we are only going to because that's what it takes to succeed. With that, in summary, I feel like we have all the elements we need in order to really make an impact over the next 6 to 12 months. We're all working hard to ensure that the investment in people and products, coupled with our distribution partnerships, translates into revenue of margin dollars for the company, which will then translate into shareholder value for the year."
}