{
    "symbol": "PRPO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 18:37:05",
    "content": " You should not place undue reliance on forward-looking statements as these statements are based upon our current expectations, forecasts, and assumptions, and are subject to significant risks and uncertainties. These statements may be identified by words such as may, will, should, could, expect, intend, plan, anticipate, believe, estimate, predict, potential, forecast, continue, or the negative of these terms or other words or terms of similar meaning. Risks and uncertainties that could cause our actual results to differ materially from those set forth in any forward-looking statements include, but are not limited to the matters listed under Risk Factors in our annual report on Form 10-K for the year ended December 31, 2021, which is on file with the Securities and Exchange Commission, as well as other risks detailed in our subsequent filings with the Securities and Exchange Commission. Statements and information, including forward-looking statements, speak only to the date they are provided unless an earlier date is indicated, and we do not undertake any obligation to publicly update any statements or information, including forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. As we come to a close in 2022, I'd like to address some of the goals we've set out at the start of the year and did not reach, like to discuss some of the achievements. And most importantly, the steps we're taking and the changes we're making to make sure the company aggressively pursues and achieves its goals that we set out. Earlier in the year, we set out various goals for the company, which included both revenue growth targets, as well as financial. Running a business is a process of continuous learning, particularly in a situation where we are essentially launching a new line of business within the company. Realizing the results of those changes take some time and determination, and this is what we're focused on ensuring that the impact of those changes is rapid and substantial. Furthermore, our management team has also held accountable, and we've all been working hard to analyze the internal reasons within our company for where we are and put together an action plan to ensure that we meet those goals. This too is disappointing reality we are space, and myself and management as well, and each of the company's employees are aware of this, and the responsibility we have towards you, our shareholders. Anyone who haven't been part of our managed business knows that this key ingredient is not the technology, the product or market it's the team that is able to take all those components and execute. We have a capable R&D team that's created product and market wants, at our commercial team did not deliver the targeted results and therefore, sales and revenue growth did not follow as expected. In mid-year 2022, we evaluated where we were and decided to try to bring in additional high-caliber experienced people from the outside in order to strengthen the product's commercial team. This was not an easy decision to make, because it requires investing in hiring talent and good talent and cheap, while knowing that there is a certain lag until the company sees revenue results. But going back to the principal as very management knows, followed by the team, we set out to hire ourselves a solid commercial team. We're extremely fortunate to be able to bring in the pie that we did with senior executive experience in molecular product sales such as Sharon Robins, who headed up molecular sales for Qiagen, a $10 billion company focused specifically on molecular diagnostic products and a company we directly compete with. And Keith Meadors, who headed up sales and distribution for a multibillion dollar health care company. One of the things, I'm most proud of is that, we're able to attract these talented people, who left their jobs to come and work for our company. They did that for a few reasons, because they knew they'd be part of something meaningful and key members of a strong team and because they would have a major impact on our business. With this team in place, we are already seeing a change in how our product and commercial team functions, our level of interaction with our partners and our customers, and I have no doubt this will yield the results we all expected. While our technology and products are solid, like any product in a competitive market, they need proper marketing support, and we didn't have that in our company. In this relatively short tenure, Greg and the team have created important content required to support the sales of our products. This includes product spec sheets, operating manuals, videos and other supporting materials that any serious company must have. In addition, we have a new website that is better organized and more reflective of the company's value proposition and our goals. We have a system and a plan to manage all these leads and the team to follow-up in an organized manner, and convert them into customers in a rapid manner. As we stated in the past, our strategy has always been to rely on distribution partners rather than trying to build our own direct sales force; issues of cost, return on investment and reach into those customers were just some of the key factors that helped us arrive at that decision, and I still think it's the right strategy. A second distribution partnership was signed a month later and announced in September with a similar probable name whose name I unfortunately cannot disclose, but it's a name you all know. To-date, these partnerships have collectively yielded over 50 qualified leads and a potential sales funnel of over $10 million annually. And our team, it's all hands on deck to get them done. Our goals remain the same, revenue growth of our pathology services division as well as our product division. I do believe, we have taken the steps necessary to move the company towards those goals. And while I realize that our financial statements from the last quarter don't yet reflect that; the operations, the team, the commercial efforts are all pointing to that direction."
}