{
    "symbol": "ARLP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-31 14:57:02",
    "content": " In addition to these records, ARLP also posted increases to coal sales and production volumes, oil and gas and coal royalty volumes, and consolidated net income and EBITDA, all as compared to the 2021 quarter. As previously mentioned, coal sales price per ton increased during the 2022 quarter, jumping 40.5% to a record $59.94 per ton. Increased sales volumes and record price realizations led coal sales revenues higher to $550.6 million, an increase of 52% compared to the 2021 quarter. Despite these higher expenses, margins at our coal operation rose on the strength of record coal sales prices to drive segment adjusted EBITDA higher to $224.6 million, an increase of 77.8% over the 2021 quarter. Turning now to ARLPâ\u0080\u0099s royalty segments, compared to the 2021 quarter, royalty sales volumes for oil and gas rose 33.1% and price realizations jumped 31.6%, leading oil and gas royalties revenue to increase 75.6% to $35.3 million. Our Coal royalty segment also performed well during the 2022 quarter with royalty tons sold increasing 5.8% and royalty revenue per ton climbing 17.5%, both as compared to the 2021 quarter. Total royalty segment adjusted EBITDA increased 66% and 7.3% compared to the 2021 and sequential quarters, respectively, jumping to a record $46.9 million. On the strength of strong performance by our coal operations and royalty segments, ARLPâ\u0080\u0099s consolidated total revenues for the 2022 quarter increased 51.3% to a record $628.4 million as compared to the 2021 quarter. Coal sales and production volumes increased 13.4% and 15.2%, respectively, while our royalty sales volumes for oil and gas and coal rose 29% and 13.1%, respectively, all as compared to the 2021 period. As we close out 2022, ARLP is currently planning for its strongest coal shipping quarter this year, but with low water levels and lock outages impacting barge movements and with the potential for a rail strike back on the table, we recognize the possibility that some shipments may shift into 2023 and we have adjusted our current expectations for 2022 coal sales volumes, prices and costs accordingly. The range for anticipated income tax expense was increased to reflect the current full year performance expectations for our oil and gas royalty segment, and the range for planned capital expenditures in 2022 was also increased to reflect ARLPâ\u0080\u0099s acquisition of the reserves adjacent to our Tunnel Ridge mine and initial work this year to begin accessing a lower cost reserve area adjacent to the Riverview mine. We also remain focused on growing our oil and gas and coal royalty segments, the recent acquisition of an additional 4,322 acres in the Permian increases ARLPâ\u0080\u0099s total mineral position to approximately 62,008 net royalty acres and provides line of sight growth in future oil and gas royalty volumes. Our visibility into the cash flow generation sustainability of our core coal and oil and gas businesses gave our Board confidence to accelerate our previously targeted 10% to 15% per quarter unitholder distribution increase by bumping the distribution for the 22 quarter to $0.50 per unit, a 25% increase over the sequential quarter. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Most -- the things that we are looking at as far as when we are going to start seeing numbers of vehicles that are actually being sold in the market growing, itâ\u0080\u0099s probably two years away, 2025 -- 2024, 2025 and then you start looking at these plants that talk about converting as such basically 100% of their production to EVs by 2030, 2035."
}