{
    "symbol": "ARLP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-01 14:54:02",
    "content": " Price realizations also increased across the board during the 2022 quarter with coal sales price per ton, increasing 43.3%, oil and gas prices jumping 64.7% per BOE and coal royalty revenue climbing 11.3% per ton. Driven by increased sales volumes and higher prices, ARLPâ\u0080\u0099s total revenues for the 2022 quarter increased 70.1% to a record $616.5 million, as compared to the 2021 quarter. At our coal operations, the previously mentioned increases to coal sales volumes and pricing led coal sales revenue higher to $531.8 million, an increase of 63.1% and 36.9% compared to the 2021 and sequential quarter, respectively. Higher coal sales revenues more than offset increased segment adjusted EBITDA expenses to drive segment adjusted EBITDA from our coal operations higher to $222.6 million, an increase of 95.4% and 68.6% over the 2021 and sequential quarter, respectively. Benefiting from increased royalty sales volumes and sharply higher commodity prices, segment adjusted EBITDA from royalties rose to a record $43.7 million for the 2022 quarter, an increase of 97.4% and 12.4% compared to the 2021 and sequential quarter, respectively. Reflecting ARLPâ\u0080\u0099s strong year-to-date performance and managementâ\u0080\u0099s expectations for the future, our targeted quarterly distribution increase remains intact through the end of this year, and is expected to result in approximately 30% of our annual free cash flow being returned to unitholders as we previously communicated. Our recent estimate, I donâ\u0080\u0099t know, if this holds true, Iâ\u0080\u0099m having a meeting Wednesday, but we think that there is probably 30 million tons that could have been bought in our region, just in our buying area that could have been bought this year to run at full capacity in those coal plants that were not bought, because of the utilities deciding to buy uneconomic gas, instead of buying coal at a price that would be better for the rate payers."
}