{
    "symbol": "VIA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 15:15:23",
    "content": " Welcome to Via Renewables, Inc.'s Second Quarter 2022 Earnings Conference Call. In the second quarter, we reported an adjusted EBITDA of $13.3 million compared to $14.4 million in the second quarter of 2021. The decrease in year-over-year is attributed to the rising commodity prices and the higher customer acquisition spend, offset by a $4.4 million add-back related to Winter Storm Uri. Via's total RCE count increased compared to the second quarter of 2021 mainly due to several customer book acquisitions in the second half of 2021, along with the lower attrition this year in 2022. We're pleased to announce that, at the tail end of the second quarter, Via was able to close on a new $195 million credit facility. In the second quarter, we achieved $13.3 million in adjusted EBITDA compared to last year's second quarter of $14.4 million. In our retail electricity segment, gross margin was $16.7 million compared to $21.7 million in the second quarter last year. In our retail natural gas segment, gross margin was $7 million compared to $4.8 million in the second quarter last year. G&A expenses of $13.6 million were higher compared to $10.7 million in the second quarter of last year primarily due to a $2.2 million payroll tax credit we received in 2021, an increase in bad debt and increases in our sales and marketing costs. Our net income for the quarter was $12.5 million or income of $0.18 per fully diluted share compared to net income of $24.8 million or income of $0.58 per fully diluted share for the second quarter of 2021. The decrease is related to additional G&A expenses, reduced gross margin offset by $9.6 million from ERCOT related to the PURA Subchapter N securitization financing, along with a $16 million decrease in our mark-to-market gains. Lastly, income tax expense decreased to $2.7 million in the second quarter of 2022 compared with an expense of $3.7 million in 2021. On July 20, we announced second quarter dividends of $0.18125 per share on our common stock, to be paid on September 15; and $0.568125 per share of preferred stock, to be paid on October 17."
}