{
    "symbol": "VIA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 18:42:07",
    "content": "  Stephen Rabalais: Good morning, and welcome to Via Renewables Fourth Quarter and Full Year 2022 Earnings Call. We spent approximately $4.5 million more on customer acquisitions than the prior year to grow our customer base and added approximately 67,000 RCEs through our various organic sales channels. For the full year of 2022, we reported adjusted EBITDA of $51.8 million, down from $80.7 million in 2021. G&A also increased in 2022 mainly due to nonrecurring expenses reductions that occurred in 2021, pertaining to employee costs and legal expenses, along with an increase of bad debt. In the fourth quarter of 2022, we achieved $12.6 million in adjusted EBITDA compared to last year's fourth quarter of $11.6 million. Retail gross margin for the quarter was $31.9 million compared with $25.2 million last year. The increase in retail gross margin is mainly due to higher unit margins on our electric load, coupled with increased volumes for natural gas, partially offset by decreased volumes for electricity and decreased margins for natural gas. Full year adjusted EBITDA ended at $51.8 million compared to $80.7 million for 2021, while full year retail gross margin ended at $114.8 million for 2022 compared to $132.5 million in 2021. We ended the year with 331,000 RCEs down from 408,000 RCEs at the end of 2021, which was due to rising attrition caused by a spike in commodity prices and proactive nonrenewal of less profitable C&I customers. For the year, we spent $5.9 million in customer acquisition costs compared to $1.4 million in the prior year. Interest expense for the year rose from $4.9 million in 2021 to $7.2 million in 2022 primarily because of increases in benchmark rates. Income tax expense increased to $6.5 million in 2022 from $5.3 million in 2021 driven by winter storm Uri's impact to our bottom line in 2021. Our net income for the year was $11.2 million with $18 million mark-to-market loss compared to a net loss of $5.4 million in 2021, which included a $5.5 million mark-to-market gain. Looking at our balance sheet, we had a net debt of $86.3 million and total liquidity of $76.9 million at year-end 2022. On January 18, we announced our fourth quarter dividend of $0.18125 per share on our common stock and $0.71298 per share of preferred stock to be paid on March 15 and April 17, respectively."
}