{
    "symbol": "VIA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 12:47:07",
    "content": "  Operator: Good morning, ladies and gentlemen, and welcome to Via Renewables Inc., Third Quarter 2022 Earnings Conference Call. Good morning, and welcome to Via Renewables Third Quarter 2022 Earnings Call. In the third quarter, we reported an adjusted EBITDA of $15.1 million compared to $22 million in the third quarter of 2021. The largest factors were legal accrual reductions and a $1.1 million payroll tax credit taken in the third quarter of 2021. Additionally, we had a $0.5 million add back from the winter storm Yuri in the third quarter of 2021. Via spent $1.7 million in customer acquisition spend compared to $0.3 million in the third quarter of 2021. In the third quarter, we achieved $15.1 million in adjusted EBITDA compared to last year's third quarter of $22 million. Retail gross margin for the quarter was $30.5 million compared with $30.9 million last year. In our retail electricity segment, gross margin was $28.5 million compared to $28.2 million in the third quarter of last year. In our retail natural gas segment, gross margin was $1.9 million compared to $2.7 million in the third quarter last year. G&A expenses of $16.3 million were higher compared to $9.7 million in the third quarter last year, primarily due to a reduction in legal accruals and a $1.1 million payroll tax credit, both occurring in 2021. Our net loss for the quarter was $4.9 million or a loss of $0.18 per fully diluted share compared to net income of $34.7 million or income of $0.82 per share -- per fully diluted share for the third quarter of 2021. We had a mark-to-market loss this quarter of $15.5 million compared to a mark-to-market gain of $26.6 million a year ago. Interest expense increased to $2.0 million compared to $1.3 million in the third quarter of 2021. We had a benefit of $48,000 in 2022 compared with the expense of $7 million in the third quarter of 2021 and a decrease in depreciation and amortization expense to $3.3 million compared to $5 million in the third quarter of 2021. On October 20, we announced the third quarter dividend of $0.18125 per share on our common stock to be paid on December 15 and $0.666107 per share of preferred stock to be paid on January 17."
}