{
    "symbol": "SLDB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 17:25:19",
    "content": " Before we get started, I would like to remind everyone that during today’s conference call, we may make forward-looking statements, including statements about the company’s financial results, financial guidance, future business strategies and operations and product development and regulatory progress, including statements about the company’s IGNITE DMD clinical trial. First, following a thorough assessment of currently available alternatives for the manufacturing the SGT-001, where they decide a process that we believe will produce high-quality drug products while narrowing the organization’s focus to a single production platform and streamlining our operating structure to a more efficient model. As a result of the focused approach on these programs and Solid’s cash runway through Q2 2024, the company will be able to progress through important clinical milestones for both gene therapy programs. Importantly, activities to transition to the new manufacturing process have already begun, with products expected to be available in early 2023, aligning well with our regulatory and clinical activities to support dosing patients. As part of our strategy, we have decided to conclude enrollment in IGNITE DMD and moving forward, patients will be dosed using material from the new process, and we have already begun conversations with the FDA to determine the design of a future clinical study. There are a number of milestones over the next 12 months that we aim to communicate such as updates on our discussions with the FDA and additional data coming out of IGNITE DMD, including 1-year biopsy and functional analysis of all patients dosing the program as well as 3-year follow-up on functional data from patients 4 to 6. And so it’s really a notion of recognizing the incredible work that our internal teams have done to scale and optimize the HSV process, but recognizing that we can now relieve some of those bandwidth constraints by working with external parties, leveraging their proprietary manufacturing platforms, and really focus on bringing our therapy to patients."
}