{
    "symbol": "OTRK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 18:42:08",
    "content": " These forward-looking statements are not guarantees of future performance but may involve and are subject to certain risks and uncertainties, other factors that may affect Ontrakâ\u0080\u0099s business, financial condition and other operating results, which include, but are not limited to, the risk factors described in the Risk Factors section of the Form 10-K and Form 10-Q as filed with the SEC. Itâ\u0080\u0099s a responsibility I accept with enthusiasm, integrity, conviction and confidence in the mission of our company, the dedication of our employees to our members and the support of our customers and business partners. What we can say is that our customers appreciated our proactive outreach to update them and recognized our continued focus on caring for their members, delivering best-in-class service and business as usual. During our last earnings call, I outlined in some detail the progress in our pipeline, which has continued to evolve as we conduct meetings and refined proposals across our base of health plans, value based providers and self-insured employer prospects. First, regarding care coaching, while prospects are interested in our clinical focus on the 2% to 4% highest acuity, they are consistently asking us to expand our reach to a larger broader population that includes our evidence based care coaching model for lower acuity risk. Second, regarding behavioral health network development, our prospects consistently tell us they need support with network development, including contracting net new behavioral health providers for their plan networks and enhancing their current networks in key geographic areas for timely access and availability within seven days to 10 days versus the two months to three months they are currently experiencing. I believe with our track record of successfully delivering positive outcomes for members coupled with our latest AI enabled program enhancements, we are uniquely positioned to support health plans, providers and self-insured employer groups, with their goals and needs to improve health outcomes, achieve high quality measures and reduce avoidable emergency room and inpatient utilization. We continue to market our traditional Wholehealth+ solution, which focuses on the 2% to 4% of members who are lost to care, have high cost thresholds and chronic physical conditions with un or under addressed behavioral health needs, which our coaching and therapy model has been proven to address. But we believe we can help health plan payers, value based providers and self-insured employers in their support and care for their members and they continue to ask us for this help. First is Ontrak identify, which provides the market with their proprietary AI enabled predictive algorithms and imputed diagnosis to find those members who are hardest to reach for our prospect base, whether these members remain in the Ontrak program or are referred back to our customers for their follow-up in treatment, we believe there is value in tailoring solutions to meet the particular needs of each customer. Next is Ontrak outreach, which leverages our best-in-class member enrollment specialists and evidence based outreach approaches to reach and enroll new members into a planâ\u0080\u0099s existing offerings. Ontrak has developed superior enrollment expertise through years of successful refinement, whether we enroll members in Ontrakâ\u0080\u0099s own coaching program or use our expertise to enroll members in our customerâ\u0080\u0099s existing non-Ontrak programs, there is value in tailoring solutions to meet the particular needs of each customer. Our recently announced partnership with a leading AI natural language processing platform now enhances our coachâ\u0080\u0099s effectiveness through real-time insights on how they engage with members, whether we provide coaching alone or marry it with access to our top-notch provider network, thereâ\u0080\u0099s value in tailoring solutions to meet the particular needs of each customer. And last is Ontrak access, which gives customers the opportunity to build out their behavioral health networks and improve access and availability, whether or not paired with Ontrak engage or other components of our program. I am confident these customized solutions, each with their own pricing model, give us and our potential prospects the flexibility to design the most relevant and effective programs for their members. Based upon our initial data analysis, we believe this enhanced approach will allow us to expand the number of members we serve from the historical 2% to 4% to approximately 20% to 30%, which we believe puts us in the best position to accelerate our return to growth. Once again, I want to express my thanks to our customers and everyone at Ontrak as we embark on the next chapter, all in the service of helping to improve the health and save the lives of as many people as possible. During the fourth quarter, we recorded revenue of $2.5 million, a 76% year-over-year decrease due primarily to the loss of two large customers we previously discussed. At the beginning of the quarter, we had 1,365 enrolled members and ended with 1,333 at the end of the quarter or a simple average of 1,349. That equates to revenue of about $552 per health plan enrolled member per month for the quarter, compared to $506 per health plan enrolled member per month in Q4 of 2021 and $515 per health plan enrolled member per month in Q3 of 2022. To go a bit deeper into Q4 enrollment, we enrolled a total of 754 members during the quarter, compared to 1,014 in Q4 of last year and 533 in Q3 of 2022. Dividing Q4 gross enrollments by our outreach pool, which averaged 4,538 for the quarter, it annualizes to a 66% enrollment rate, compared to a 51% enrollment rate in Q4 of 2021 and 53% in Q3 of 2022. Our average monthly disenrollment rate was 11% in the current quarter, compared to 8% in Q3 of 2022. This equates to about 26% of the enrolled members in the program at the beginning of the quarter, which has been steadily increasing from prior quarters. Our gross margin in the fourth quarter was 61.2%, which increased sequentially from 49.5% and also increased from 60.4% in the fourth quarter of last year. We ended the quarter with 30 team members included in cost of revenue, payments at the end of Q3, reflecting no material change in our net enrolled members at the end of the quarter. Turning to the balance sheet and cash flow, our cash flow from operations in the fourth quarter was negative $1.4 million, compared to negative $15 million in the fourth quarter of last year. We ended the quarter with cash and cash equivalents of $5 million, down from $7.3 million at the end of the third quarter in 2022. During the quarter, we completed an amendment of our Keep Well Agreement, which extended the maturity date from September 1, 2023 through June 30, 2024, increased the remaining available amount for borrowing from $10.7 million to $14 million as of December 31, 2022 and the ability to add accrued interest into principal rather than pay cash for the interest monthly. With the initiative that we have just completed and a few other near completion, we expect our cash burn rate to be closer to $1.5 million per month with the current customer base. Regarding our outlook, we are providing revenue guidance of $12 million to $14 million for revenues from our current customer base for the year."
}