{
    "symbol": "RYAM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 14:45:05",
    "content": " Regarding our cellulose specialty products, we negotiated significant price and volume increases for 2022 and as we saw inflation accelerate, we implemented a $146 per metric ton cost surcharge effective April 1 and have maintained the surcharge as inflationary pressures continued. Our revenues increased 25% from prior year to $466 million as a result, a price increases in strong demand across all segments, reflecting a 25% increase for our cellulose specialty products, inclusive of our cost surcharge, and a 34% increase for our paperboard products. Adjusted EBITDA for the quarter was $68 million, up 106% from the prior year, as the price and volume increases more than offset cost inflation. The increases from prior year were led by our high purity cellulose segment, which delivers $53 million of adjusted EBITDA in the third quarter, an improvement of $21 million or 66% from prior year. Paperboard delivered $15 million of adjusted EBITDA, which was $9 million or 150% favorable to prior year results, driven by strong demand and higher prices. With these strong financial results in the third quarter and a solid outlook for the fourth quarter, we are increasing our full year 2022 guidance to now exceed $175 million of adjusted EBITDA, an increase of $15 million from prior guidance. Third quarter sales increased $81 million or 28% to $369 million, driven by a 21% increase in total sales prices, which includes a 25% increase in CS prices from prior year. EBITDA for the segment improved $21 million to $53 million driven by higher prices and volumes, which were partially offset by the impact of significant cost inflation. Turning to Slide 8, our Paperboard segment sales grew $14 million, driven by a 34% increase in sales prices, partially offset by a 7% decline in sales volumes. EBITDA for the segment grew by $9 million to $15 million as higher pricing more than offset increased costs for purchase pulp, chemicals and logistics, as well as the impact of lower sales volumes. Sales declined by $2 million from prior year, driven by an 18% decrease in sales volume, as a result of productivity challenges in the quarter and supply chain congestion. EBITDA for the segment declined $3 million to $6 million for the quarter, as the higher prices only partially offset lower volumes and cost increases for chemicals and logistics due to inflation. Please go ahead, George. Please go ahead, George."
}