{
    "symbol": "LOVE",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-09 13:02:03",
    "content": " Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. So the historical ways, if you looked at the business are as efficient as they’ve ever been, but that’s just, we’re getting more and more away from that, and getting to more of a trade area valuation of the businesses as we go forward, which is much closer to I think a lot of the commentary that that Shawn has alluded to about CTC being closer to the customer. Please proceed with your questions. the first question is, Shawn, I feel like we’re in the middle of a home super cycle meaning that if you think about calendar 2020, 2021, 2022, 2023, you’re going to have a period of very strong sales growth in the home category, not just because of the pandemic, but also because of economic stimulus. And so, I think we have the right product at the right time and we can call it luck, but we’ve been building the company to get to this point for a lot of years and we’re going to hopefully be able to enjoy that ride and continue to drive growth. Please proceed with your questions. And what I would do, I think is the best way to look at it is, and I think you saw it as we quoted a lot of our numbers, we look at two-year comps to even out things, because the dynamics of the pandemic and I think if you look at a two-year comp basis, other than some dramatic changes during the immediate post-pandemic period, you’ll start to see trends that are more easily trackable across the different segments of our business. Please proceed with your questions. And so I think in terms of the service improvements, delivery improvements, quality of the way we package the product, the products themselves, we’re seeing a higher customer that expects and is getting a lot more value for the product they pay. So we’re seeing great trends, we’re seeing things happening that really show traction on the brand, as we’ve discussed, not only increasing ROIs and advertising, increasing word of mouth, but increasing value relative to a product that’s actually being discounted less All good signs and we intend to operate the brand as a premium brand, and really win through stickiness of the brand and surprise and delight to the customer."
}