{
    "symbol": "LOVE",
    "quarter": 2,
    "year": 2022,
    "date": "2021-09-09 13:27:07",
    "content": " Our strong second quarter and fiscal year first half '22 results continued to reflect a combination of a strong demand environment along with our execution against our key strategic initiatives including product innovation, efficient marketing and merchandising strategies, creative utilization of our showrooms and other channels to expand customer touchpoints and making disciplined infrastructure investments. These tactics combined with a strengthening of the brand proposition and advantaged inventory position have enabled us to shorten as well as reduce promotional campaigns and discounting by approximately 900 basis points year-over-year in the second quarter, which is a key driver in helping us mitigate the supply chain headwind impacts. Other net sales, which includes pop-up shop and shop-in-shop net sales increased 7.4 million, or 243.4% to $10.4 million in the second quarter of fiscal 2022 as compared to $3 million in the prior year period. Internet net sales, sales made directly to customers through our ecommerce channel decreased 16.6 million or 36% to 29.5 million in the second quarter of fiscal 2022 as compared to 46.1 million in the prior year period, with the year-over-year decrease driven by the comparisons against elevated digital sales in the prior year period and the channel shift back to our showrooms, which were all open during the second quarter of fiscal 2022. The 749 basis point increase over the prior year period was driven by a 506 basis point improvement due to a reduction in promotional discounts, higher overall sactional product category net sales and premium covers mix impact and also lower product costs related to vendor negotiated tariffs mitigation initiatives due to higher volume. The increased gross margin percent in the second quarter of fiscal 2022 as compared to our second quarter guidance and prior fiscal year period was the result of continued supply chain headwinds mitigation efforts, such as reductions in promotional discounting issued during the first half of the fiscal year, which was done to help soften the projected gross margin impact of the increase in cost of inbound freight on the second half of fiscal 2022 that most if not all importers are experiencing. Advertising and marketing expenses increased $5.9 million, or 81.9% to $13 million in the second quarter of fiscal 2022 as compared to $7.2 million in the prior year period, due to the reinstatement of marketing spend to support sales growth, as showroom locations were fully open. In the second quarter of fiscal 2022, operating income was $9 million, compared to an operating loss of $1 million in the second quarter of last year with the increase driven by the net sales in gross margin increase as well as the SG&A leverage just discussed. With the additional showroom openings and strong year-to-date performance, in a scenario where sales growth is in the mid 40% range, we would expect adjusted EBITDA margins in the 6% to 7% range with the year-over-year adjusted EBITDA margin decline driven by both gross margin pressure of approximately 150 basis points as compared to the prior fiscal year, as we, like others in the industry are facing intensifying freight headwinds, as well as the expense in infrastructure dynamics I just discussed. For our fiscal third quarter, we expect sales growth of approximately 50% with negative adjusted EBITDA dollars in the $3 million to $4 million range compared to positive adjusted EBITDA in the same quarter last year. Please proceed with your questions. Please proceed with your questions. And I think on an overall, given the 85% container increase, the impact, and the way that we've been able to mitigate in the first half of the year, seeing these costs come down the line to only have we're seeing 150 basis points impact on our gross margin year-over-year has been very strategic for us. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions."
}