{
    "symbol": "LOVE",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-08 14:14:06",
    "content": " Net sales increased $42 million or 56.1% to $116.7 million in the third quarter of fiscal 2022, as compared to $74.7 million in the prior year period. The year-over-year net sales increase was driven by growth across all channels with overall comparable sales increasing 47.1%, due to the success of our Labor Day campaign, 28th year-on-year increase in ending showroom count, and higher productivity of our temporary online pop up shops on costco.com. Showroom net sales increased $28.2 million or 67.8% to $69.7 million in the third quarter of fiscal 2022, as compared to $41.5 million in the prior year period. This increase was due primarily to a $19.5 million increase in comparable showroom point of sales transactions to $56.1 million in the third quarter of fiscal 2022, as compared to $36.6 million in the prior year period. Internet net sales, sales made directly to customers through our e-commerce channel increased $9.8 million or 38.2% to $35.5 million in the third quarter of fiscal 2022, as compared to $25.7 million in the prior year period, principally driven by the performance of our Labor Day campaign this fiscal year. Other net sales, which principally includes pop up shop and shop-in-shop net sales increased $3.9 million or 52.7% to $11.9 million in the third quarter of fiscal 2022, as compared to $7.5 million in the prior year period, with the increase primarily related to higher productivity of our temporary online pop up shops on costco.com. Advertising and marketing expenses increased $4.8 million or 44.3% to $15.8 million in the third quarter of fiscal 2022, as compared to $11 million in the prior year period, resulting from continued investments in marketing expense to support our sales growth. Advertising and marketing expenses were 13.6% of net sales in the third quarter of fiscal 2022, as compared to 14.7% of net sales in the prior year period. Net income was $2.8 million or $0.17 per diluted share in the third quarter of fiscal 2022, compared to net income of $2.5 million or $16 per diluted share in the prior year period. We generated adjusted EBITDA of $5.8 million in the third quarter of fiscal 2022, as compared to adjusted EBITDA of $6 million in the prior year period. For our fourth quarter, we expect sales growth of approximately 35% with adjusted EBITDA dollars in a $12 million to $13 million range, compared to positive adjusted EBITDA of $25.9 million in the same quarter last year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}