{
    "symbol": "ITUB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 15:51:03",
    "content": " Now let’s talk about our credit portfolio, the consolidated, we had a growth of 0.5% getting to R$1032 billion and a credit portfolio in Brazil R$830 billion. Let’s talk about the portfolio, credit portfolio, a few very relevant information, the natural person portfolio it’s growing 4.4% and when we look at the portfolio of micro, medium size companies, we had a small drop. We had the hedging active, whether if it’s a banking portfolio or the trading portfolio, of course now, given having said that we have had a great result above what we expected in the quarter composed by R$1 billion in Brazil, R$500 million in Latin America that are aligned with the records, historical records, it’s R$1 billion of results here are above our expectations. When we look at year-on-year 18.6%, a very important highlight for the checking account, the administrative, resources and in the investment bank, we’ve had a quarter that is slower with the market volatility. So wholesale, we’ve had great results, incredible results and pulled by the investment bank and in the concept, not only variable income, but also fixed income, we’ve had important growth we had in the first quarter of this year. So lower demand but also we work very active to adjust our policies to guarantee that we won’t have any diverse selection, but I would say that the most impact stays on the corporate clients in general, they feel more pressure, but as we see a much lower level of leverage of those companies, the marginal impact is of course, much reduced when compared to the past, but it’s still something that we have to keep an eye on. So, I mean, we see the change in number of reis, so I would say that it is actually 10%, 15% of the results of the bank, and it’s something that has changed in terms of profitability. But despite that, we’re not going to – we’re not having a great market share, we’re trying to defend market share actually right now, it is something that has grown a lot in the market, but we have a great portfolio, 30% of the portfolio in the – or 30% of market share in cards."
}