{
    "symbol": "OCGN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 13:09:14",
    "content": " I will now turn the call over to Tiffany Hamilton, Ocugenâ\u0080\u0099s Head of Corporate Communications. Joining me today are Ocugenâ\u0080\u0099s Chairman and CEO and Co-Founder, Dr. Shankar Musunuri, who will provide a business update and our Chief Accounting Officer and Senior Vice President of Finance, Jessica Crespo, who will provide more on our financial results. Earlier this morning, we issued a press release detailing business activity for Q2 2022. We encourage listeners to review the press release, which is available on our website at ocugen.com. We may in some cases use terms such as predict, believe, potential, proposed, continue, estimate, anticipate, expect, plans, intend, may, could, might, will, should, or other words that convey uncertainty of future events or outcomes to identify these forward-looking statements. Such forward-looking statements include, but are not limited to statements about the potential for NeoCart, chondrocyte-derived neocartilage, if approved to provide an innovative new option for the repair of full-thickness lesions of the knee cartilage in adults as well as Ocugenâ\u0080\u0099s intention to begin dosing in Cohort 2 of the OCU400 clinical trial this month. Such statements are subject to numerous important risks â\u0080\u0093 excuse me factors, risks and uncertainties and may cause actual events or results to differ materially from our current expectations. These and other risks and uncertainties are most fully described in our periodic filings with the Securities and Exchange Commission, SEC, including the risk factors described in the section entitled Risk Factors and the quarterly and annual reports that we file with the SEC. Except as required by law, we assume no obligation to update forward-looking statements contained in this presentation, whether as a result of new information, future events or otherwise after the date of this presentation. Finally, Ocugenâ\u0080\u0099s second quarter 10-Q will be filed soon after todayâ\u0080\u0099s call. Good morning, everyone and thank you for joining. Developing great science requires harnessing the passion, persistence, patience, and intellectual progress of our entire Ocugen team. Using this mindset of courageous innovation, we are strengthening our dedication to eye care, pursuing broader commercialization of our vaccines program and we have expanded our pipeline into the orthopedic space, which we will discuss later. And over the course of this past quarter, we saw great progress in establishing ourselves as a differentiated biotech company. As we continue to meet our regulatory milestones and engage with patients in a clinical setting, I am especially confident that the team is well poised to advance our efforts. Today, we are going to provide updates on our vaccines, gene and cell therapy programs. Starting with vaccines, as we enter the third year of the COVID pandemic, we are facing new challenges as COVID-19 variants continue to emerge. At the World Vaccine Congress in late April, speakers all agreed that public health strategies need to expand and vaccine options beyond what is available in the current mRNA dominant landscape, but necessary to contain the pandemic. Additionally, consumers want effective options for vaccinating themselves and their children, including vaccines built on a traditional platform. We are up to this challenge as we advance the Covaxin program with our partner, Bharat Biotech. The Phase 2/3 immuno-bridging and broadening clinical trial, OCU002 for Covaxin is progressing well and we are in the planning stages for starting the adult safety clinical trial this year, pending FDA discussions. Additionally, it showed that the booster dose is safe and ensures persistent immunity to minimize breakthrough infections of COVID-19. Now, moving on to our gene therapy programs and our founding focus retinal diseases is becoming clearer, especially at our vital work in Retinitis Pigmentosa, a disease for which there is no cure, no medicines to block disease progression, and limited treatments to help manage the patientâ\u0080\u0099s tragic journey that ultimately leads to blindness. Ocugen has a deep commitment to its research and development programs for inherited retinal diseases, for which there are no treatment options only one gene therapy modality exists. Our modified gene therapy unlike traditional gene therapy, as shown in preclinical models, to effect the regulation of genes or nuclear hormone receptors or NHRs. When gene networks are not functioning properly, this unbalanced state can lead to disease, including a family of inherited retinal diseases that cause blindness. This is a significant accomplishment in an innovative therapeutic category, because for the first time, we are evaluating this modifier gene therapy concept that adopts invitation and ophthalmology disease space. By the end of this study, we will collect data from 18 patients, which will constitute three cohorts of three different doses before moving on to a Phase 3 clinical trial. If successful, this therapy has the potential to treat many mutations under RP. Currently, RP has about 150 mutations, affecting approximately 2 million people globally. Our sense of urgency for rescuing one site is critical and for us, itâ\u0080\u0099s personal. Ocugen is currently executing pre-IND studies, consistent with FDA discussions to support a Phase 1/2 clinical trial, which the company intends to initiate next year. Itâ\u0080\u0099s also worth noting that we expanded our patent portfolio in June, then the United States Patent and Trademark Office issued the company an additional patent directed to methods for preventing or treating an ocular disease or disorder associated with retinal degenerative disease. Finally, we are expected to initiate a Phase 1/2a clinical trial next year for OCU200, our novel biologic that has the potential to help those with diabetic macular edema, diabetic retinopathy, and with age-related macular degeneration. Now moving on to our regenerative cell therapies, with the expansion of our pipeline into cell therapy in orthopedics, NeoCart marks an experimental therapy with the potential to accelerate healing and reduce pain, the rebuilding damaged knee cartilage and limiting the progression of osteoarthritis. NeoCart is a tissue engineer disc of new cartilage that is manufactured by growing 100 sites, the cells responsible for maintaining cartilage health, which are derived from the patient. Recently, Ocugen entered into a collaborative research agreement with Brigham and Womenâ\u0080\u0099s Hospital, a teaching hospital of Harvard Medical School to support NeoCart development and explore expansion of the pipeline. Earlier this year, the FDA granted a regenerative medicine advanced therapy or RMAT designation to NeoCart for the repair of full-thickness lesions of the knee cartilage in adults. In summary, we have ambitious clinical agenda and the rigor in our clinical development process to advance our pipeline in constant pursuit of our long-term vision. Thank you, Shankar and good morning everyone. Our research and development expenses for the quarter ended June 30, 2022 were $9 million compared to $18.9 million for the quarter ended June 30, 2021. General and administrative expenses for the quarter ended June 30, 2022 were $10.6 million compared to $6.8 million for the second quarter of 2021. Our net loss was approximately $19.5 million or $0.09 net loss per share for the quarter ended June 30, 2022 compared to a net loss of approximately $26 million or $0.13 net loss per share for the quarter ended June 30, 2021. Our cash, cash equivalents and restricted cash totaled $115 million as of June 30, 2022 compared to $95.1 million as of year end December 31, 2021. We are exploring opportunities to increase our working capital, which may include the use of our current at-the-market program for the sale of our common stock. With that, we will open the call for questions. Yes, the current study immuno-bridging and broadening study that is required that bridges clinical data from U.S. demographic to data generated by our partners elsewhere. The second one, which is required we believe is safety trial in the U.S. demographic and we are still awaiting feedback from FDA. As soon as they provide that information, we are going to initiate the clinical trial. So, we believe those two are needed to give the primary series an indication of the BLA as we planned. So if this is the strategy, we are going to go into the future with the bivalent variants and we will be working towards that. However, we will be getting some data from our clinical trial and we will do sub-analysis of those â\u0080\u0093 subjects of patients, who have received currently mRNA vaccines and how our vaccine is performing. So, we have to see how those factors play out. And if we have to develop a bivalent vaccine, our partners are working on that and they are standby. My second question is on the OCU400 program, you mentioned that you are going to start dosing in Cohort 2 this month and you are going to get periodic updates. So, these periodic updates â\u0080\u0093 so the primary objective of Phase 1/2 clinical trial is safety and we are monitoring multiple efficacy endpoints, we call them observational endpoints. Depending on the mutation, every mutation may have a different primary endpoint before we move on to the Phase 3. So currently, the primary objective on a 3-month periodic basis subjected to our protocol and what we agreed with FDA will be monitoring this patient safety outcomes will come out. And again, they get reviewed by DSMB on a periodic basis. And that data typically, I donâ\u0080\u0099t think we are going to get anything before 6 months visit for our patients. And from 6 months to 1 year visits, when these patients go through that transition we maybe able to see some observations and we see them, obviously, we will go through the internal process and controls, then we will be able to share that information to the markets. So does that mean I guess with your â\u0080\u0093 the first patient Cohort 1, I think they were dosed in March, we could see it like 6 to 12 months from there as well. Yes, thatâ\u0080\u0099s a good question. So, NeoCart obviously was sitting in our back came through the reverse merger. And now, we have very strong R&D and other teams in the organization with a solid biotech footprint. And so we started looking at it and obviously, it looks very, very promising. And obviously, we believe we have a strong biotech team that can support it for now. And obviously, this is a tip of the iceberg as you can look into the regenerative space and the cartilage there is only one product available in the marketplace. Obviously, through our research and development, including the collaboration with Harvard Medical School, if any future pipeline expansion opportunities come up, we will try to explore them. But our goal for now in the next couple of years is really focused on this, work with the FDA and work on the manufacturing, work on the clinical program and take it to the clinic sooner than later. Okay, thatâ\u0080\u0099s very helpful. Yes, I mean, again the differentiation with Covaxin compared to three or four authorized vaccines in the U.S., they are all spike based. So, that makes it feel that broad immune response that means you get antibody responses beyond spike, which maybe needed. And also there is a major publication which talked about, which actually followed the patient up to 12 months and showed a T-cell and B-cell memory responses, which are important for durability. So, when you have a broadened immune response, when you have durability, when you go into the future, itâ\u0080\u0099s not practical to get booster shots every 3 months. So for that, what you are looking for is an ideal vaccine, which has a durability and which also has potential with a broadening immune response. I think this is very distinct and the unique vaccine in the North American market, including â\u0080\u0093 and but one other thing I would like to make is in Mexico, we are working on emergency use authorization for pediatric population. I mean, obviously, we will be looking into that going into the future when you go into these annual boosters, the reason is the data our partners have generated in India on pediatric population is really strong. And not only it showed very good immune responses, it also showed solid safety. I mean, they had a surveillance data after 36 million kids, teenage group got first dosed with the vaccine and they collected surveillance data and the surveillance data clearly showed no cases of myocarditis, pericarditis or thrombosis, which are associated with current vaccines here in North America. So, those are the distinct features of this vaccine. Yes, thatâ\u0080\u0099s going on. Obviously, we are also working with the Canadian government to get support on that, as we mentioned before. And obviously, itâ\u0080\u0099s progressing. And as soon as we have any something concrete and it takes time to work with governments, but they are very supportive. Thank you very much, guys. Just wondering when you do report data for the efficacy endpoint, just curious like how would you kind of define success and which of those metrics that are listed in clinicaltrials.gov are more important to you or more important, I guess, to clinicians in terms of how it would sort of help define success for this program? Andâ\u0080¦\n I think theâ\u0080¦\n No, go on. So, I will start with the OCU400 efficacy endpoints. As I mentioned, we are exploring multiple observational endpoints for efficacy. So, the way we monitor them is when the patient comes in, when get into the study that we establish a baseline based on multiple endpoints. So, every endpoint gets monitored when they have this periodic payment visits. And so if there is no decline, stable, itâ\u0080\u0099s still good. And there is a, thatâ\u0080\u0099s what you want to look at it, no further degeneration and that is the baseline stable at steady state, thatâ\u0080\u0099s good news too. And once again, these are the â\u0080\u0093 some of the mutations we are getting into may not have a lot of data out there. So, again, thatâ\u0080\u0099s why we want it to be flexible. And we believe, we created a very good protocol, which allows us to monitor multiple endpoints. And so, depending on specific mutation type, we believe, based on the data we are going to collect will allow us to have a clear path going to Phase 3. Now, coming on to the second question on manufacturing at the Jubilant HollisterStier, there are contract manufacturing organizations supporting Covaxin drug product manufacturing. Whenever we get any orders from potential orders from Mexico or Canada and eventually when we get into the U.S., we will be ready to supply. Could you give us a quick overview of previous data and what gives you confidence in the program, because I believe Histogenics reported data in 2018. So, NeoCart, you are right  standpoint, I mean obviously, we took a deeper dive at the data. And typically, when you have larger lesions thatâ\u0080\u0099s where regenerative cell therapy truly helps. And so we are focusing our effort on that, and continuously having a dialogue with FDA to understand and finalize the protocol. So, I mean obviously, they generated significant amount of data. And I mean, obviously, you also learned when you have such data, where itâ\u0080\u0099s most useful and focus on that, that will be definitely improved protocol, much improved compared to what they have done. So, that should increase our probability of success. So, thatâ\u0080\u0099s where we are. So, there are two parts to starting the clinical trial. One is getting the input from FDA, from the â\u0080\u0093 so they are currently reviewing our protocol. And we are hopeful, sometime this year, we will be able to finalize our design with them. And we believe, that should be released sometime next year, too. So again, these two things have to be lined up. And in the interim, obviously, we did have a really good network of investigators and KOLs. And this year, we are putting all those pieces together. So, hopefully, we can provide a good roadmap for this program by the end of the year. The current vaccine demand, just as any other country currently, only the government is procuring there. In the pediatric population, obviously, there is only one company, which got authorization to-date, thatâ\u0080\u0099s Pfizer. And the government did procure a small amount of vaccines, not a large to vaccinate majority of those kids. So, thatâ\u0080\u0099s why we believe there is an opportunity there. So, if you look at their demographic and look at that cohort, there is a significant opportunity. Good morning, I had a question about NeoCart, and just the previous data in terms of what the patient entry criteria was and some of the endpoints in the trial, as well as how the â\u0080\u0093 how that information is going to be used to design Phase 3 in terms of the new entry criteria, and the potential markets. So, the data generated in the past, the endpoints, typically, for this regenerative therapy, what you are looking for is a function and pain. Thatâ\u0080\u0099s what is important, FDA also is directing towards that. However, the difference is, as I mentioned before, depending on the lesion size, thatâ\u0080\u0099s important. There may be other standard therapies available if the lesion size is too small, and you may not see much difference. So, those are the differentiating factors we are carefully looking at the data, what happened in the past and where itâ\u0080\u0099s more beneficial for the patient. And looking at the average lesion size, and where did it fit in, working with our KOLs and frontline orthopedic experts. Number two, this question is the underlying technology platform, yes, it is very unique. The underlying platform technology, we have our own scaffold we make and then we take the autologous cells from patient and chrondrocyte and then we grow these cells, right, into a 3D and thatâ\u0080\u0099s in a nutshell. And obviously, we are starting with knee cartilage repairs. And there a lot of needs in orthopedic space as you know, and they will continue to explore. So, I know you are still pursuing Covaxin in the U.S. So, RK the indication doesnâ\u0080\u0099t change because the current vaccines are indicated for primary or booster cities. Obviously, as a scientist, evaluating consumers or customers, they are getting more scientific information. As I mentioned before, I mean if you look at the White House Meet like last two weeks ago, and what they are looking into, and what the public is looking for is a differentiated vaccine. I think now, I mean the hospitalization, thank god, has gone down and so compared to 2 years ago. So, now people have a time to reflect and see what else is available. And as the market goes into this booster space, eventually, it may turn into private, like flu vaccines. And the consumers are going to ask, they will work with their primary care physicians, they will work with their pediatricians. And they are going to have a thoughtful process, what is available, what is the science and what is appropriate for me and my family and thatâ\u0080\u0099s what is going to happen. So, our goal, the indication may not change indications say this vaccine can be given for booster cities, right. So, thatâ\u0080\u0099s really important. So, what we have to do is get the data out there, just like our partners have published, about 14 journal articles in peer reviewed journal. As the data comes out, we will share with the public and the peer review journal, so people can review it, and they can make data driven decisions, what is appropriate for their families. Maybe I didnâ\u0080\u0099t ask the question, but I was wondering about coverage. Again, the data from our current clinical trial, I mean in the booster and I mean itâ\u0080\u0099s not a booster study designed for, but itâ\u0080\u0099s immuno bridging and broadening. That means some of the patient population, they must have taken prior mRNA vaccines will have that subgroup. And if the data is showing, indirectly we are going to get some booster data. I mean as I mentioned before, is that sufficient, is that providing a good coverage for current variants and potential for future variants. And you are right, so all those things can be negotiated with the FDA how we put forth. As I mentioned before, itâ\u0080\u0099s not that agency is moving towards bivalent vaccines, thatâ\u0080\u0099s more good for coverage for the long-term. And also the most important factor, as I mentioned before, I want to emphasize is durability. And I think in the publication and nature reports, which came out a few weeks ago, I mean that really substantiates that up to 12 months showing the memory responses is very important. Mexico, the current focus is again, as I mentioned before, itâ\u0080\u0099s on kids. There is only one company, they got some procurement. I believe it was probably not providing the entire population, just a fraction. So, thatâ\u0080\u0099s what currently they procured for kids. I donâ\u0080\u0099t want to give any specific numbers, but we believe if you have the second company in line to get the pediatric authorization, we will have a good opportunity in Mexico. No, I think one of the things I think RK, I just wanted to mention to emphasize our vaccine, I didnâ\u0080\u0099t address before, is this vaccine is stored at a refrigerated condition, I just wanted to emphasize. And so with the potential shelf life of 2 years, and it has a good shelf life, even room temperature at 25 degrees up to six months. So, that makes a big difference for distribution, supply, as well as a stockpile for future use in any country in North America, including Mexico. And we submitted all the questions they had, all the responses to them. Ladies and gentlemen, this concludes todayâ\u0080\u0099s conference call."
}