{
    "symbol": "OCGN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 10:33:06",
    "content": " I will now turn the call over to Tiffany Hamilton, Ocugenâ\u0080\u0099s Head of Corporate Communications. Joining me today are Ocugenâ\u0080\u0099s Chairman and CEO and Co-Founder, Dr. Shankar Musunuri, who will provide a business update and our Chief Accounting Officer and Senior Vice President of Finance, Jessica Crespo, who will provide more on our financial results. Earlier this morning, we issued a press release detailing business activity for Q3 2022. We encourage listeners to review the press release, which is available on our website at ocugen.com. This presentation contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, which are based on the beliefs and assumptions of the Ocugen Inc. and on information currently available to management. We may in some cases use terms such as predict, believe, potential, proposed, continue, estimate, anticipate, expect, plans, intend, may, could, might, will, should, or other words that convey uncertainty of future events or outcomes to identify these forward-looking statements. Such statements are subject to numerous important factors, risks and uncertainties and may cause actual events or results to differ materially from our current expectations. These and other risks and uncertainties are most fully described in our periodic filings with the Securities and Exchange Commission, SEC, including the risk factors described in the section entitled Risk Factors and the quarterly and annual reports that we file with the SEC. Except as required by law, we assume no obligation to update forward-looking statements contained in this presentation, whether as a result of new information, future events or otherwise after the date of this presentation. Finally, Ocugenâ\u0080\u0099s third quarter 10-Q will be filed soon after todayâ\u0080\u0099s call. I'm very proud of the important accomplishments we achieved in the third quarter with courageous renovation as a driving force behind everything we do, we're diligently progressing with our cell and gene therapies and pursuing broader development and expansion of our vaccine program, which now includes a unique mucosal vaccine OCU500 for COVID-19. As we meet our clinical and regulatory milestones, I'm especially confident that the team is well-poised to drive signed in new directions and break new ground for patients who have no effective therapeutic options and people who want choice in the fight again COVID-19. Today, we are going to provide updates on our vaccines, gene and cell therapy programs. COVID-19 remains persistent, and the world critically needs more effective and safe vaccine option. Up until now, much of the attention has been on reducing hospitalization rate, but we need to think much more broadly and consider what threats new variants will force and what is required to face the unique challenges that this next phase of COVID-19 will bring. As I alluded to earlier, in September, we announced our licensing agreement with Washington University to develop, manufacture and commercialize its proprietary mucosal vaccine in the United States, Japan and Europe. OCU500 has the potential to generate rapid local immunity in the nose, mouth, upper airways and lungs, where SARS-CoV-2 enters and infect the body. We believe that the mucosal vaccine can help reduce the transmission rate by generating neutralizing IgG, mucosal IgA and T cell responses. This approach represents a potential universal booster, regardless of previous COVID-19 vaccination. Additionally, we are addressing the public's need for a more durable immune response to COVID-19 with continued development of our candidate vaccine, COVAXIN. Ocugen is deeply committed to our core technology, focused on inherited retinal diseases along with other blindness diseases affecting larger patient populations. We are making progress in our vital work in Retinitis Pigmentosa, a disease for which there is no cure, no medicines to block disease progression, and limited treatments to help manage the patient's tragic journey that ultimately leads to blindness. By the end of the Phase 1/2 study, data will be collected and analyzed from dosed RP and LCA patients before initiating the Phase 3 efficacy trial. Currently, RP is associated with mutations in more than 100 genes, affecting approximately two million people globally. The current study will start enrolling patients with Leber Congenital Amaurosis, or LCA -- mutations. OCU410, also leveraging our modifier gene therapy platform, is being developed to utilize the nuclear hormone receptor gene, RORA for the treatment of dry age-related macular degeneration or Dry AMD, which affects approximately 9 to 10 million Americans alone. And this quarter, we are announcing the addition of OCU410ST to potentially treat Stargardt disease, an orphan disease that will be investigated along with Dry AMD. Ocugen is planning to file IND applications to initiate Phase 1/2 clinical trials for both these programs in Q2, 2023. OCU200 is designed to health threatening diseases such as diabetic macular edema, diabetic retinopathy and Wet AMD. Regarding our regenerative cell therapies, in May, we expanded our pipeline into cell therapy in orthopedics with NeoCart. NeoCart shows potential to accelerate healing and reduce pain, rebuilding damaged knee cartilage and limiting the progression of osteoarthritis. Earlier this year, the FDA granted a regenerative medicine advanced therapy, or RMAT designation, to NeoCart for the repair of full-thickness lesions of the knee cartilage in adults. Our ambitious clinical agenda and the rigor in clinical development advanced our pipeline is reflective of our culture of courageous innovation, we're relentless in our pursuit towards our long-term goals and reaching the patients who can potentially benefit from our diverse pipeline. Thank you, Shankar, and good morning, everyone. Our research and development expenses for the three months ended September 30, 2022, were $15.6 million compared to $6.3 million for the three months ended September 30, 2021. General and administrative expenses for the three months ended September 30, 2022, were $7.5 million, compared to $4.5 million for the third quarter of 2021. Our net loss was approximately $21.9 million or $0.10 net loss per share for the third quarter of 2022, compared to a net loss of approximately $10.8 million or $0.05 net loss per share for the third quarter of 2020. Our cash, cash equivalents and restricted cash totaled $101.6 million as of September 30, 2022, compared to $95.1 million as of year-end December 31, 2021. And with that, we'll open the call for questions. Your line is open. The first is, I think you mentioned that the R&D cost reflects the cost incurred for clinical trials. So the top line data, as we stated, we have completed enrollment, and we are currently going to do the data analysis after weâ\u0080\u0099re done with collecting all the samples from the patients after the second dose. Obviously, as we mentioned before, the data will also give some direction on dosing patients who have taken mRNA before. That means in addition to naive patients, we also had mRNA patients, because it's really difficult to enroll 100% net patients at this stage and although the pandemic case. And therefore, we are going to get data, bolster data and patients who took mRNA with our vaccine. And so based on that, once again, we're already working with FDA on the next safety protocol, which we believe may be needed for US study in the US demographic for BLA. But however, based on the Booster data, that will shed a lot of light into how we move forward because we believe Covaxin can make a good booster with a broad immune response for people who took a mRNA shot, which is only based on spike. No, that's a good question. So yes, that's the plan just like you stated. Your line is open. Currently, Robert, we're still -- there are two steps to it. The second step, most important step, I think that -- I think we know we'll get that squared off in the next few months. It's very complex science, where we can manage with good control. So, that's why Ocugen has committed to build our own facilities in our R&D expansion. So, that's the rate limiting. Your line is open. So OCU500, obviously, mucosal vaccine is really needed in respect of what you vaccinate . I mean, that's really important. All the experts in the field believe you really need something mucosal vaccine, where you can stop the entry of virus. So, I think that's going to be good for the long-term. I mean, ideally, if everyone gets COVAXIN and establishing a broad immune response. And then you take mucosal vaccine as a booster which is inhaled or intranasal, which will be very convenient even for kids in the long-term. So, as the new variants come in on an annual basis, it's easy to produce this vaccine compared to our inoculated viral vaccine. So, that's the whole virus vaccine. So, obviously, it's really needed -- I mean this mucosal vaccine is a great need right now where the pandemic is going. And as we mentioned before, the Phase 1/2 clinical trial, the primary endpoint is safety. So that's the reason there are multiple observation endpoints looking at and broadly a functional as well as structural endpoints, structural means under OCU, you'll be looking at the structure of the retina. Your line is open. To what extent or actually, I'm sorry, it's on OCU500. I think when you give mucosal vaccines, typically, if your system is primed, it's really important -- with most of Americans are primed with mRNA. And people who are vaccinated before, I mean, it's really important to have primed before they get the mucosal vaccine. Your line is open. Just curious with the -- with vaccination essentially, I guess, moving from government pay to commercial pay. So I think you have seen some of our competitors vaccine players have announced the pricing, some of them want to price it or $100 a dose. However, so the COVAXIN follows the traditional path somebody wants to take it as a primary cities, which would be a very good primary site vaccine as well as a booster. However, with the mucosal vaccine, there is a lot of emphasis from all the way from governmental agencies to the experts in the field, they're supporting it. They're really worried about significant mutations coming up, if you don't control the transmission. Therefore, there is a great need for it, and we're working with government agencies. We believe something novel like that or something to control the transmission because the largest democracies, I mean the countries out there, including India and China, they launched mucosal vaccine and we are way behind it. I think it's time, we're hoping, our government will step up for the elections and support, development of mucosal vaccine which is OCU500. And we believe for that, something like that to control the transmission, where everyone agrees, they should have government support. But at least in the short term, we believe government should really support mucosal vaccine. In India, I mean the data is public. I mean, obviously, in India, they just launched it, and the Phase III data looks good compared to COVAXIN head-to-head, and they showed a good not only IgGs, also mucosal myogenic response. And from the other vaccine in China, which is inhalation vaccine, it's widely rolled out. In fact, there's some public information out there as of last week, they rolled it out for many, many large cities in China. So, we don't know how the data is, but there -- at least publicly available data looks good. So, both of them are pointing out mucosal vaccine may be very beneficial. I will now turn the call back over to Chairman, CEO and Co-Founder; Dr. Shankar Musunuri. We pointed this out last week during our R&D day that between 2023 and 2027, we're targeting BLA filing and product launches in each of the next five years, reflecting what we mean by credits innovation. We have to prioritize our resources on gene therapies, while seeking partnership with the government agencies for vaccines to support public health in the short term. Once we start getting data rates next year on gene therapies, it will allow Ocugen to potentially form partnerships outside of the US to support our growth. In the long term, we will continue to strengthen our pipeline to become leaders in disease areas we represent and continue to offer hope for patients across the globe."
}