{
    "symbol": "ACEL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 10:53:02",
    "content": "  Operator: Ladies and gentlemen, thank you for your patience, and thank you for attending today's, Accel Entertainment Third Quarter 2022 Earnings Call. My name is Amber, and I will be your moderator for today's call. Participating on the call today are Andy Rubenstein, Accel's Chief Executive Officer; and Matt Ellis, Accel's Chief Financial Officer. Actual results may differ materially from those discussed today, and the company undertakes no obligation to update these statements unless required by law. For a more detailed discussion of these and other risk factors, investors should review the Forward-Looking Statements section of the earnings press release available on our website, as well as other risk factor disclosures in our filings with the SEC. For reconciliations of the non-GAAP measures, as well as other information regarding these measures, please refer to our earnings release and other materials in the Investor Relations section of our website. We reported revenue of $267 million, a year-over-year increase of 38% and adjusted EBITDA of $41 million a year-over increase of 9%. Adjusted EBITDA had a lower growth rate than revenue, due to Century's negotiated splits. Despite the current inflationary environment, our performance continues to demonstrate the strength and resilience of our business model. We believe, businesses will continue to see the upside of local gaming in their establishments, that they will continue to invest in their gaming, due to the incremental profits they receive and that players will continue to choose our local, high-quality offering, due to its convenience and appeal. On the expense side, we continue to invest in new market opportunities and also face higher-than-expected costs from macroeconomic-related impacts, such as increased labor, parts and fuel expenses. It's what sets us apart from the competition today and we will continue to refine, how we win in an environment of increased cost pressures. Our asset-light business model and highly variable cost structure, allows us to quickly adjust. With Century on board, we're starting to explore new growth opportunities and implementing some cost savings initiatives. We believe that Century's technological capabilities will provide us with a competitive advantage in some of the developing markets, where we currently operate or plan to operate in the near future. While Nebraska's play is significantly lower than our more established markets, we remain optimistic about the potential of the market. We aim to continue growing Nebraska, both organically and through acquisition. Overall, our M&A pipeline remains active and we are evaluating multiple opportunities across the country. In May, the lottery announced that it would be expanding its gift card pilot program by making it available to all locations. This program allows players to load their winnings onto a prepaid value card, which substantially reduces one of the biggest barriers players face in the Georgia market. Overall, Accel continues to execute its growth playbook. We remain excited about the opportunities in the markets where we currently operate, as well as the new markets we're looking to enter. Our local business model, low capital requirements and highly visible growth, offers one of the best returns in gaming. For the third quarter, we had total revenue of $267 million, a year-over-year increase of 38% and adjusted EBITDA of $41 million, a year-over-year increase of 9%. As of September 30, we had 22,429 terminals and 3,517 locations, year-over-year increases of 68% and 38% respectively. At the end of the third quarter, we had approximately $309 million of bad debt and $567 million of liquidity, consisting of $212 million of cash on our balance sheet and $355 million of availability on our current credit facility. I'd now like to provide an update on our efforts to return capital to shareholders, specifically our share repurchase program. As you're all aware, we announced a $200 million share repurchase program in November of 2021, as we find the opportunity to return capital to shareholders in the form of buybacks, an attractive use of our significant free cash flow. During the quarter, we purchased $22 million of Accel stock at an average purchase price of $10.01 a share. Since the program started, we have repurchased nearly $80 million of Accel stock through the end of October. Given our relatively underlevered balance sheet and strong free cash flow, we are in a position to make exciting investments like Nebraska, while continuing to appropriately return capital to shareholders. To wrap things up, I'm pleased to report that we are reaffirming our previously disclosed guidance for locations, gaming terminals, revenue and adjusted EBITDA. As a reminder, we expect to end 2022 with 22,700 to 23,200 terminals and 3,550 to 3,600 locations. We're pleased with another strong quarter and remain focused on executing our growth strategy, leveraging the strong foundation we have built and our proven playbook. We're confident our locally-focused business model, creates a platform to outperform in difficult times and thrive under normal circumstances. We aim to leverage our proven asset-light business model and strong financial position, to continue our expansion and to continue to return capital to shareholders. On the 2Q call, you talked about the backlog in Illinois being mid-teens or still year-to-date. When you look at this backlog and compare it to the historical pace of licenses awarded, your historical or normalized call it 100, 150 net locations added maybe 200 or so -- 250 gross or so. We continue to work to get as many locations live, as quickly as possible. But the good news is, we continue building those logs. And again, we don't just look at the rock counts, but we look at the quality of those locations and it continues to be consistent with what we've previously signed. As we look, at how the backlog builds, it will always continue to build, because the Darwinism that occurs where locations fail and then new people open up their establishments or their business in those old locations. Also, there's always a continual kind of new business opening. Now using that assumption, let's assume, that there's no other additional sales opportunities. The current backlog would continue without any -- would continue to provide new locations without any break in licensing, because it takes nearly nine months from a time a location, applies to where it goes live. So, there's a time period where, yes, if there was no more licensing then there would be a decline, but it would take about nine months to feel it. I believe kind of to get to the midpoint, it's around 5% or 6% sequential growth. Hi, Steve, it's Matt. Thanks for the question. As we sort of saw, the summer is a slower period of time, we saw a nice ramp up in September, October even looked better. So what's going to get us there is again, as we get into the colder weather and just the general seasonality, we do well around the holidays we should have a nice pickup as compared to sort of those slower summer months that you see in Q3. And then, I think locations grew about four or five quarter-over-quarter. As we've begun working with the Century team, we've seen a lot of opportunities to grow the business. They have really identified areas within Montana, a few within Nevada where their -- where they hadn't pursued new locations in the past due to capital constraints that we can really look at. And I think you'll see a slow ramp-up, over the next six to 12 months where there'll be a growth that they haven't seen in the past and we're excited for what Century brings to the overall Accel portfolio. And as we implement some of our strategies that we've been successful in Illinois, I see -- I think they'll benefit from that in both the Montana and Nevada markets. Thanks for the question. On the Century side as Andy talked about, we're starting to see some opportunities to grow sort of revenue there and we should naturally see a slight pickup in margins. But if you think back in the short-term, again we're still grasping everything but as we slowly implement some new initiatives you should see a very modest pickup in margins there. On the Illinois side, you've got two things going. They're also â\u0080\u0093 excuse me, we talked about growth in Nebraska. So overall on the Illinois market at this point, we should start seeing some nice operating leverage as adding Illinois locations to our base requires minimal expense. On the other side, we're still heavily invested in growth to support the new sort of developing markets that we're looking at Georgia, Nebraska and hopefully some other ones in the near future. And as we see overall trends that are going on in the macro economy, they really haven't affected our business yet today. As far as other markets, it is a constant focus of ours to explore some of these opportunities. I think if legislation passes in the spring, obviously that would be a major focus of ours. So obviously, it's different with everything. But if you think back to some of the 8-Ks we put out earlier, somewhere in the neighborhood of 75% to 80% of the revenue is going to the locations and the remainder to Century."
}