{
    "symbol": "KELYA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 13:50:03",
    "content": "  Operator: Good morning, and welcome to the Kelly Services' Fourth Quarter Full Year 2022 Earnings Conference Call. Hello, everyone, and welcome to Kelly's fourth quarter conference call. Let me remind you that any comments made during this call, including the Q&A, may include forward-looking statements about our expectations for future performance. In addition, during the call, certain data will be discussed on a reported and on an adjusted basis. References to organic growth in our discussion today exclude the results of our 2022 acquisitions, RocketPower and PTS, as well as the impact of the sale of our Russian operations. In the high-tech sector, layoffs continued as more firms move to bring costs in line with slowing growth following a long period of expansion and aggressive hiring. In other sectors not broadly impacted by layoffs, a growing number of employers, scale back or slowed hiring in anticipation of greater headwinds in 2023. The economy continued to add jobs in the fourth quarter, albeit at a slightly slower pace to end the year. Even as economic headwinds emerged in the second half of the year, Kelly remained laser-focused on executing our specialty strategy, achieving solid growth in 2022. We increased revenue year-over-year, driven by top line gains in our SET, Education and OCG businesses and rapid growth in our outcome-based solutions. Every business unit expanded its gross profit margin, lifting Kelly's gross profit margin above 20% for the first time in more than 25 years, a significant milestone in our pursuit of higher margin, higher value business. And we improved adjusted earnings from operations by 30% year-over-year, demonstrating our ability to effectively translate gross margin expansion to earnings growth. 2022 also marked a year of bold action as we accelerated our strategic transformation, streamlined our portfolio and created additional value for all our stakeholders. We ended the cross ownership arrangement between Kelly and Persol and reduced our ownership interest in our Persol and Kelly joint venture, unlocking $235 million of liquidity while repurchasing our common shares held by Persol for $27 million in the process. We redeployed a portion of the net proceeds from those transactions to advance our inorganic growth strategy while preserving the remaining capital to pursue additional high-margin, high-growth acquisitions in the future. And finally, we increased our dividend to its pre-pandemic level and authorized a $50 million repurchase of outstanding Class A common shares. These moves are indicative of a new Kelly, a Kelly that acts with urgency in pursuit of profitable growth. The impact of heightened economic uncertainty, I mentioned earlier, became more visible in parts of Kelly's portfolio, especially in the fourth quarter. This contrasts with growth in our higher-margin outcome-based solutions in these segments, which demonstrated greater resilience and performed well. Among other areas of resilience is our Education segment, which continued to grow at a fast pace across all specialties on a year-over-year basis. In OCG, ongoing headwinds in the high-tech sector continued to impact demand for the services of RocketPower, our recent acquisition in the RPO space. This resulted in a goodwill impairment charge in the fourth quarter, about which Olivier will provide more details. We're diversifying RocketPower's customer base, winning new business outside the high-tech sector. And to help mitigate top line declines in the near term, we're taking steps to adjust SG&A. Beyond RocketPower, we're stepping up our focus on SG&A management across Kelly. In response to a decrease in leverage that we experienced in the fourth quarter, we took swift action to manage costs in the near term, temporarily pausing hiring and reducing travel. As the macroeconomic situation evolves in 2023, we're committed to ensuring our cost base reflects our operating environment, our strategic priorities and our performance. Longer term, we're reviewing our growth and efficiency objectives as we approach the 3-year anniversary of our operating model. This includes continuing our work to assign expenses as precisely as possible to each of our 5 business segments, providing us with the visibility necessary to convert more gross profit into earnings. For more details on Kelly's Q4 performance and our full year results, I'll turn the call over to Olivier. Before I dig deeper into our Q4 results, which as Peter mentioned, have been impacted by economic headwinds, some comments on our full year performance first. SET, OCG and International, excluding Russia, also delivered solid constant currency revenue growth. Consistent with actions taken in alignment with our specialty strategy, GP rate improved 170 basis points on a year-over-year basis. The higher GP rate, combined with increasing revenue, resulted in a 12.1% increase in gross margin dollars in constant currency, and our GP rate improved in all BUs. As Peter mentioned, adjusted earnings from operations were up 30%, and adjusted EBITDA margin was 2.1%, up 40 basis points from a year ago. Revenue totaled $1.2 billion, down 1.3% from the prior year, including 200 basis points of unfavorable currency impact. Included in that increase are a 150 basis points favorable impact from our acquisitions of RocketPower and PTS, as well as a 270 basis points unfavorable impact resulting from the sale of our Russian operations. As we look at revenue in the first quarter by segments, in the SET segment revenue was up 1.7%. In our Education segment, year-over-year revenue growth continues to be strong, up 53% as reported and 43% on an organic basis, or excluding the impact of our May acquisition of PTS. Placement fees, primarily higher education and executive search with Greenwood/Asher were up 67%. Our OCG segment delivered another quarter of year-over-year revenue growth, with revenue up 3.5% over last year. Revenue from our staffing product declined 17% in the quarter, a deceleration from Q3 as economic headwinds has historically more impact on this segment early in the cycle. And even with continued contraction in the year-over-year demand from our call center specialty, growth in other outcome-based specialties was strong. Excluding the impact of the sale of our Russian operations, revenue improved by 5% on an organic constant currency basis. Overall gross profit was up 1.7% as reported, or up 3.7% on a constant currency basis. Our gross profit rate was 20.3%, compared to 19.7% in the fourth quarter of the prior year for a year-over-year improvement of 60 basis points. The primary driver continued to be favorable organic business mix, which contributed approximately 100 basis points for the quarter. Our SET, OCG and International businesses delivered the most significant year-over-year improvement in business mix and improved year-over-year GP rates. Included in our 2021 results are approximately $4 million in restructuring charges, and our 2022 results are impacted by the intangible amortization and other expenses of our recent acquisitions, as well as the favorable impact of the sale of our Russian operations. So on an organic constant currency basis, fourth quarter 2022 expenses grew by 4.3% year-over-year. This reduction in the SG&A growth trends from earlier this year, and it does reflect the continued focus on cost management. During the fourth quarter, we did report an additional $10.3 million goodwill impairment charge related to RocketPower. As we have discussed previously, RocketPower provides RPO services primarily to customers in the high-tech vertical. Beginning earlier this year and accelerating in Q4, there has been a reduction in hiring activity in this industry vertical, which we now believe will be deeper and will last through March of 2023. The impairment charge is a noncash item and does not impact our plans for RocketPower, including as Peter mentioned, a focus on customer diversification and opportunities for synergies, which will allow us to maximize the value of our investment in the future. So on an adjusted basis, Q4 2022 earnings from operation of $14 million declined 28% year-over-year. As Peter mentioned, we monetized our investment in Persol Holdings and most of the PersolKelly joint venture in the first quarter of 2022. So there will be no further P&L impact from both investments, but the comparable period year will include gains and losses related to those investments until we anniversary the transactions. In the fourth quarter of 2021, we recognized a $50 million pretax gain on our Persol Holdings common stock. Also reported below earnings from operations in the fourth quarter of 2021, we realized a $19 million onetime gain related to cash proceeds received from a settlement of a claim on the representation and warranties insurance policy purchased in connection with the acquisition of Softworld. And finally, reported loss per share for the fourth quarter of 2022 was $0.02 per share compared to earnings per share of $1.80 in 2021. Loss per share in 2022 included the impact of a goodwill impairment charge, net of tax, partially offset by a gain on sale of real estate property, net of tax. Earnings per share in 2021 were favorably impacted by gains on Persol shares and a gain on insurance settlement, and partially offset by a restructuring charge, all net of tax. So all in, on an adjusted basis, Q4 2022 EPS was $0.18 compared to $0.65 per share in Q4 of 2021. And when combining our strong balance sheet with our existing borrowing capacity, we still have and continue to have ample capital available to fund our organic and inorganic strategy, as well as navigating an uncertain macroeconomic environment. At year-end, accounts receivable was $1.5 billion and increased 5% year-over-year, reflecting our year-over-year increase in revenue as well as billings to MSP customers reported on a net basis. Free cash flows in 2022 include the final repayment of approximately $87 million of federal payroll tax balances, which were deferred in 2020 under the CARES Act as well as $48 million of income taxes due in Japan following the sales of our investment in Persol common stock. And during the fourth quarter, we have started executing against the $50 million share repurchase plan that we announced in November, buying approximately 475,000 shares for a value of $7.8 million. Through the execution of our specialty strategy, Kelly has continued to transform since the last significant economic disruption caused by the COVID-19 pandemic in 2020. We have remixed our portfolio towards higher-margin products and specialty, and we have demonstrated the ability to act with urgency to proactively manage costs, to protect the bottom line and preserve capital when necessary. We expect that our structural GP rate improvement will continue, but likely at a slower pace than in 2022. And finally, that will contain our SG&A to levels similar to Q4 of 2022 even while continuing to invest in our technology initiatives and in our people. If top line trends don't align with our current expectations, we are prepared to take action -- additional actions to align our cost structure as we move forward. In each of our chosen specialties, we'll continue to shift toward a business mix characterized not only by higher margins and value but greater resiliency amid market pressures. We'll drive inorganic growth using the ample capital available to us on our balance sheet to pursue additional high-quality acquisitions in Education, SET and OCG. And we'll continue to invest in technology and new products that will improve the talent and customer experience, enable organic growth and increase efficiency. With our team laser-focused on executing our specialty strategy and guided by our noble purpose, I look forward to building on the positive momentum we generated in 2022. Together, we'll create long-term value for all our stakeholders, helping our talent and customers thrive and rewarding our shareholders for their patience since we embarked on this transformation. If we -- on the P&I business, if we look at that, it looked like revenues kind of accelerated on a negative end in the quarter. Yes, Joe, I think it's a reflection of what's going on in the parts of the economy that we have exposure to. The P&I business has considerable exposure to manufacturing, like industrial distribution. And those businesses, in particular, were impacted by the headwinds that we saw, to some extent in Q3, but really accelerating in Q4. On the flip side, I would say, and we did mention -- I did mention, our BPO business is still growing, despite of the fact that our call center business is still a little bit on a kind of challenging comparables. But overall, we grew this business by about 9% in Q4, which I think is an improvement versus what we have seen even in Q3 where it was about 3.5%. So that I wouldn't say that it's offsetting the staffing, but it is something we assumed to be resilient for the near future. And of course, Russia until we anniversary basically the transaction that did happen early July of 2022. So if you put these 2 things on the side, we are still growing at about 5%. We still see a lot of growth in Portugal, and you can see it on our 8-K, 30% plus. We have seen that in Q1, Q2, Q3 as well as Q4 of 2022. We have seen some slowdown in Switzerland, in France and in Italy because of market conditions, but I would say it is more challenging than before, but I wouldn't call it as a complete change in trend. And pardon me, you mentioned on the last call talking about the tech layoffs, about how that might provide a better pipeline of candidates for some of the other verticals. The lag time between moving those people to other industries is measured by geography, by pressures that in all industries customers are making hiring decisions slower, taking a little bit more time. But clearly, the demand for those skill sets is evident, and we're seeing it. Again, your last call when you were talking about it, the firm, you mentioned about identifying synergies with the rest of Kelly, accelerating the integration, diversifying the portfolio. And we're encouraged by the ability not only to continue to use that for RocketPower customers, but also to take advantage of that for either legacy Kelly RPO customers and also use it as part of our sales efforts for new RPO customers. And we are seeing signs that, that part of the investment thesis is paying off, with customers we're talking to in terms of where they're looking to see a lower cost delivery and we're able to provide that through that Latin American delivery model that was part of RocketPower. You noted some continued good demand in the telecom area, although that you mentioned also that the other areas within the segment are being impacted by the economy. So as Olivier mentioned, just to call out the BPO or outcome-based business and SET continues to see nice growth. Telecom is enjoying very significant growth, both in terms of traditional staff as well as statement of work business. So we've seen some slowdown in hiring, taking -- customers taking longer. And we see when they -- economic conditions become more certain, we expect that to come back quite quickly. I know you referenced, there's still a good number of job openings and the labor market is still fairly tight. I would point out that our fill rates have improved in Education, which is likely a sign of people coming off the sidelines, could be retirees that are concerned about inflation. But we've seen across the regions improvement in fill rates, which is very encouraging because the demand continues to be very strong in Education. And our fill rates have improved in P&I, although the demand has softened considerably, as I mentioned to -- in response to Joe's question. We see as  SET is still elevated at around 8% to 9%, which is what we have seen for a long time now. Education is slightly down, but still very elevated at about 9% versus 14%, or 13% to 14% before. And specifically, what are you seeing with demand and your ability to leverage the Pediatric Therapeutic Services acquisition. Yes, very encouraged by the early signs of synergy between our traditional pre-K to 12 education business and PTS both ways, frankly. We're seeing growth in the traditional business, both in terms of existing customers as well as our existing school districts, as well as the pipeline continues to be very strong and school district struggle with frankly, a chronic teacher shortage. I would also add that the higher ed portion of the education system is very dynamic, which leads to a lot of turnover. So we're very encouraged by that because it's a very -- not a huge business, but a very, very profitable business. As you noted, you expect revenue will continue to be constrained by economic uncertainty. And also acknowledging that, as you mentioned, it's difficult to ascertain exactly how the macroeconomic situation will evolve. Probably what I'm going to do is to reflect a little bit on what we have seen so far, especially in terms of revenue, early in 2023 as we speak. So back to what Peter was talking about Education, we continue to trend very well in all practices, including PTS. Just for you to know that -- of course, we are going to deal with higher comparables because we are already growing at 40% to 50% in 2022, but a very solid start of the year. When I look at OCG, not seen any significant changes in trends so far versus what we have seen Q4 2022. I believe at some stage, we would expect some pressure on RPO because of the market, although we have not seen that yet. For SET, P&I and International, what I would say is staffing continued to slow down, especially in P&I. Difficult to know how it's going to trend in the future, I would say, high volatility. Outcome-based, so far, what we have seen is a confirmation of resilience, whether it's in P&I or in SET. I think we haven't seen a lot of, I would say, wholesale margin pressure coming from our principal competitors. But I would say on the whole, there's not a significant change in the competitive landscape. Well, we -- it's across all businesses subject to -- if we have a customer-facing revenue GP generating position, we're filling those roles. But all of the -- the other, I would call them, noncustomer-facing, non-revenue GP generating roles are -- we've put a hiring freeze on. The one exception, Jack, might be Education, where the demand is so significant that we've got to add people because the opportunity is so significant. So on the SG&A question, we've done a lot of work starting in the third quarter of last year to identify certain metrics that we're following very closely that will trigger additional cost moves, if necessary. We're investing not only in the ways to improve the productivity of our frontline teams, but we're also investing in the talent experience. We recently launched a new myKelly portal, which provides the talent that we deal with every day with a better user experience. And we think that's going to create some opportunities to maintain relationships with the great people that we put to work every day, and use that as a differentiator in terms of selling to our customers. And then on the inorganic side, I know it's something you always keep an eye on given the balance sheet you have, you can certainly be aggressive there. And that's, I think, just a reflection of not only the macroeconomic conditions, but also the interest rate environment. My expectation is that when the interest rate environment becomes a little bit clearer in terms of the ceiling, and companies have line of sight to more certainty in the economy, we're going to see a lot of companies that were on the sidelines being part of conversations. We're actively -- proactively pursuing and identifying high-quality, high-margin, high-growth assets that we would like to add to the portfolio. And with our level of liquidity, which is now over $450 million, I mean, we can really go fast and aggressive, especially in the second half of the year, not necessarily waiting for a much better economic environment. And ladies and gentlemen, today's conference will be available for replay beginning at 11:30 a.m. Eastern Time today, running through March 16 at midnight."
}