{
    "symbol": "LMNR",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-09 21:36:10",
    "content": " In the first quarter of fiscal year 2023, roughly 66% of our U.S. pack fresh lemon source volume came from grower partners and our goal is to have that number closer to 75%. For the first quarter of fiscal year 2023, total net revenue was $37.9 million compared to total net revenue of $39.3 million in the first quarter of the previous fiscal year. Agribusiness revenue for the first quarter of fiscal year 2023 includes $24.7 million in fresh lemon sales, similar to $24.7 million during the same period of fiscal year 2022. Approximately 1,308,000 cartons of fresh lemons were sold during the first quarter of fiscal year 2023 at an $18.88 average price per carton compared to approximately 1,207,000 cartons sold at a $20.48 average price per carton during the first quarter of fiscal year 2022. Of the 1,308,000 and 1,207,000 cartons of U.S. packed fresh lemons sold during the first quarters of fiscal year 2023 and 2022, respectively, 66% and 57%, respectively, were procured from outside growers. The company recognized $800,000 of avocado revenue in the first quarter of fiscal year 2022 on approximately 365,000 pounds at a $2.10 average price per pound. The company recognized $1.2 million of orange revenue in the first quarter of fiscal year 2023 compared to $900,000 in the first quarter of fiscal year 2022. Approximately 64,000 cartons of oranges were sold during the first quarter of fiscal year 2023 at an $18.00 average price per carton compared to approximately 53,000 cartons sold at a $16.47 average price per carton during the first quarter of fiscal year 2022. Specialty citrus and other crop revenues was $1.2 million in the first quarter of fiscal year 2023 compared to $900,000 in the first quarter of fiscal year 2022. During the first quarter of fiscal year 2023, the company made funding contributions of $2.6 million to fully fund and settle the company's retirement plan and recorded settlement charges of $2.7 million. In addition, a patronage dividend of $1.4 million will be recorded in the second quarter of fiscal year '23 compared to a patronage dividend of $1.6 million recorded in the first quarter of fiscal year 2022. Net income applicable to common stock after preferred dividends for the first quarter of fiscal year 2023 was $15.5 million compared to a net loss applicable to common stock of $6.6 million in the first quarter of fiscal year 2022. Adjusted net loss for diluted EPS for the first quarter of fiscal year 2023 was $9.3 million compared to a loss of $5.7 million in the same period of fiscal year 2022. Adjusted EBITDA was a loss of $7.9 million in the first quarter of fiscal year 2023 compared to a loss of $5.6 million in the same period of fiscal year 2022. Long-term debt as of January 31, 2023 was $40.9 million compared to $104.1 million at the end of fiscal year 2022. For the second quarter of fiscal year 2023, we expect to experience continued pricing pressure but believe the industry-wide lower production will lead to higher prices beginning in the second half of fiscal year 2023. Also, during the second quarter of fiscal year 2023, we received a patronage dividend from our primary lender AgWest, formerly Farm Credit West, of $1.4 million. In addition, we continue to expect to receive $115 million compared to the previous estimate of $95 million from Harvest at Limoneira and the addition of the Limoneira Lewis Community Builders II and East Area II spread out over seven fiscal years, with proceeds of $8 million already received in the fourth quarter of fiscal year 2022."
}