{
    "symbol": "DH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 16:12:05",
    "content": " During this call, we will make forward-looking statements, including, but not limited to, statements related to our market and future performance and growth opportunities, the benefits of our healthcare commercial intelligence solutions, our competitive position, customer behaviors, our financial guidance, our planned investments and the anticipated impacts of the COVID-19 pandemic and global macroeconomic conditions on our business results and clients and on the health care industry generally. Our total revenue was $57.4 million, which represents 33% year-over-year growth, and our adjusted EBITDA was $16.4 million, which translates into a 29% margin. Definitive Healthcare's ability to bring this data together with a full contextual view of how best to align their sales, marketing, business development, regional expansion and M&A, make our commercial health care intelligence a must have for companies as they begin reinvesting in growth. Despite the broader macroeconomic headwinds, we continue to invest across our entire platform because we know that Definitive Healthcare offers a growth engine for sales and marketing teams across all industries. Highlights include 33% revenue growth compared to Q3 2021, 29% adjusted EBITDA margin and a 32% unlevered free cash flow margin over the last 12 months. Assuming this is the case, in Q4, we would expect total revenue of $58 million to $59 million for a median growth rate of 26%, non-GAAP income from operations of $15 million to $16 million, adjusted EBITDA of $16 million to $17 million or a 28% median EBITDA margin and non-GAAP net income of $6 million to $7 million or $0.03 to $0.04 per diluted share on 156.5 million weighted average shares outstanding. It is too early to fully quantify projected 2023 results because they are also heavily informed by Q4 bookings, but if the conditions we saw in Q3 continued through the end of the year and through 2023, 2023 revenue growth would be in the mid-teens or approaching 20% with some improvements in conditions. So the one example I give is on our diversified segment, a lot of people use list vendors, things like ZoomInfo where they might do something like that across industry, but they'll still bring Definitive in to help with their health care focused sales and marketing efforts, because we're so much deeper in health care than anyone else out there."
}