{
    "symbol": "DH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 23:46:05",
    "content": " During this call, we will make forward-looking statements, including, but not limited to, statements related to our market and future performance and growth opportunities, the benefits of our health care commercial intelligence solutions, our competitive position, customer behaviors, our financial guidance, our planned investments, and the anticipated impacts of global macroeconomic conditions on our business results and clients and on the health care industry generally. On today's call, I will review our fourth quarter and full year results, offer some perspective on what we're seeing in the market, and highlight some of the key value drivers of Definitive Healthcare's differentiated data and platform, and then Jason will highlight some of our latest product innovations. Over the 12 years since I founded Definitive Healthcare, we've been recognized as a leader in Reference & Affiliations data, providing a complete view of the US health care ecosystem and have continued to build upon that foundation with our investment in new data types and data science, helping clients gain unique intelligence on health care entities. Combining multiple data sets on more than 15 million health care experts and professionals and 300,000 health care organizations, the Atlas Dataset has multiple components, including Atlas Reference & Affiliations, which provides clients with unique visibility into the operations of and connections between health care providers and health care organizations. When coupled with the broader Atlas Dataset, our claims products provide Definitive Healthcare customers with industry-leading intelligence on provider behavior, providers' affiliation and referral patterns, patient care, and the activities taking place within a facility. This is just one example of Definitive Healthcare's innovation flywheel, which allows us to quickly and continuously build out new data sets, new analytics, and new functionality to drive more value for our customers and continue to sell more use cases across our clients' organizations. Gross profit was $53.4 million, up 31% from Q4 2021 and gross margin of 88.2% increased 31 basis points from Q4 2021 as our prior year investments in Prescription Claims data scaled. So, I think, look, in three weeks, I'm not going to say all of a sudden, we have millions of dollars of sales just from the Atlas Dataset, but it's certainly been a conversation invigorator, and I think it will be something that's meaningful in terms of the value we deliver to clients across the year."
}