{
    "symbol": "DH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 19:01:09",
    "content": " During this call, we will make forward-looking statements, including, but not limited to, statements relating to our markets and future growth opportunities, the benefits of our health care commercial intelligence solutions, our competitive position, customer behaviors, our financial guidance, our planned investments and the anticipated impact from the COVID-19 pandemic on our business and results of operations as well as on our clients, the health care industry generally and the macroeconomic environment. Now I'd like to spend a few moments highlighting some of our key wins in the quarter, which are a great demonstration of the variety of ways new and existing customers are utilizing the Definitive Healthcare platform and continue to provide tangible evidence of our differentiation. It will use Definitive Healthcare claims data, affiliations data and analytics to search for specific HCPCS and CPT codes across all 3 product lines and then track the patient journey for its products across multiple facilities and providers. This customer signed a multiyear enterprise deal to use Definitive Healthcare data and analytics in its corporate strategy group, its nursing call and transportation team and its newly formed group purchasing organization. The suite can integrate internal sales and marketing data as well as third-party big data on claims, EMR, lab data, diagnostics data as well as data from Definitive Healthcare's proprietary platform including the Definitive ID and our industry-leading provider reference and affiliation data. The year-over-year change in margin is related to 3 key investments: first, 350 bps of continued investment in sales and marketing; second, 100 bps of innovation investments in prescription data and in development; and third, 550 bps of increased G&A costs required to operate as a public company. Nonetheless, reiterating and not raising our profitability guidance provides flexibility to respond to attractive opportunities to expand our vision on prescription drug data, drive product innovation for providers and continue to support sales and marketing while exiting the year with Q4 adjusted EBITDA margins of 30% or more."
}