{
    "symbol": "MMI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 15:16:04",
    "content": " The strength of the Marcus & Millichap platform, particularly at times of market dislocation is illustrated by the closing of over 3,000 transactions and $22.6 billion in volume in the quarter while outperforming the overall marketplace. Although this segment is not immune to the spike in the cost of debt and recession risk, transactions in the $1 million to $10 million price range accounted for 83% of total market sales and 74% of MMIâ\u0080\u0099s brokerage transactions during the quarter. Revenue from larger transactions valued at $10 million plus showed resilience for MMI with an increase of 10%, particularly in the middle market range, led by self-storage, hospitality and retail. Although larger transactions valued at $20 million-plus tend to be more variable amid market shifts, they were essentially flat with last yearâ\u0080\u0099s third quarter results for us. As noted, revenue for the third quarter was $324 million, a decrease of 2.6% as compared to last yearâ\u0080\u0099s record third quarter. Real estate brokerage revenue for the third quarter accounted for 90% of our total revenue or $293 million, a similar percentage to historical levels. Within brokerage, our core Private Client business accounted for 56.5% of revenue for the quarter or $166 million, which was a 9.6% decrease compared to the third quarter of 2021 due to the slowdown in transaction activity. Our middle market and larger transaction segments together accounted for 41% of total brokerage revenue or $120 million, an increase of approximately 10% over prior year. Shifting to our financing division, MMCC, revenue came in at $28 million in the third quarter, a decrease of 4.4% year-over-year. Total operating expense for the third quarter was $293 million, an increase of 2.3% year-over-year. Cost of services for the quarter was $217 million or 67.1% of total revenue, an increase of 117 basis points year-over-year. SG&A during the third quarter was up 12.9% year-over-year to $73 million, primarily due to increased sales support costs, the return of in-person events and normalization of staffing levels. For the nine months year-to-date, SG&A was up 27.6% to $227 million and decreased 35 basis points as a percentage of revenue."
}