{
    "symbol": "ATAX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 22:14:05",
    "content": " In terms of the Partnership's investment portfolio, we currently hold $1.08 billion of affordable multifamily investments in the form of mortgage revenue bonds, governmental issuer loans and property loans, $108 million in joint venture equity investments, $59 million in direct real estate investments, and $14 million in seniors and skilled nursing mortgage revenue bonds and property loan investments. The first is the execution of a $72 million commitment to fund mortgage revenue bonds and taxable mortgage revenue bonds, for the construction and permanent financing for the residency at the Entrepreneur a 200-unit affordable housing property in Los Angeles, California. During the second quarter, overall, we advanced funds totaling $22.3 million under our mortgage revenue bond and taxable mortgage revenue bond commitments, with remaining funding commitments totaling approximately $121 million as of June 30. In the second quarter, we closed one new governmental issuer loan and property loan commitment for total funding of $30.7 million for Magnolia Heights a 200-unit affordable multifamily property in Covington, Georgia. During the second quarter, we advanced funds totaling $62.5 million, for our governmental issuer loan and property loan commitments, with remaining funding commitments totaling approximately $154 million, as of June 30, which we expect to fund over the next 36 months. As of June 30, 2022, our net carrying value of the mortgage revenue bond was $4.6 million for GAAP purposes, inclusive of accrued interest, which is based on our expected proceeds upon final resolution of the bankruptcy case. We advanced additional equity under our current funding commitments, totaling $7.8 million, during the second quarter, and our remaining equity investment commitments totaled $11.5 million as of June 30. The analysis based on those assumptions shows an immediate 200 basis point increase in rates as of June 30, that if sustained for a 12-month period will result in a decrease of approximately $2.1 million in our net interest income and cash available for distribution, or approximately $0.10 per unit. This is down from $0.23 per unit as of December 31 2021, due primarily to the execution of two interest rate swaps for a total notional value of approximately $104 million during the first quarter of 2022. We have the limitation that 75% of the Partnership's assets must be invested in mortgage investments, which are our traditional mortgage revenue bonds and governmental issuer and property loan investments that currently make up 76% of our portfolio."
}