{
    "symbol": "MNTX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 12:24:10",
    "content": " Our team delivered strong fourth quarter results, highlighted by significant organic revenue growth across our lifting equipment and rental segments, sustained margin expansion and our fourth consecutive quarter of improved profitability. Excluding the revenue contribution from Rabern Rentals, the acquisition we completed in April of 2022, we generated organic revenue growth of 34% in the fourth quarter driven by the strength of our core lifting segment. Northern Texas has a strong backlog of infrastructure, commercial and industrial projects, which are bolstering demand for Rabern Rentals. Between yearend 2023 and 2025, we expect to deliver revenue between $325 million and $360 million or 25% growth at the midpoint range and total EBITDA between $35 million and $45 million or a growth of 65% to 110%, between 300 to 500 basis points of adjusted EBITDA margin. We will further establish our rental footprint optimize our manufacturing operations and reduce net leverage with 22% year-over-year backlog growth, solid end market fundamentals and improvements to our manufacturing throughput, we believe we are on track for low double-digit adjusted EBITDA percentage growth in 2023. Net revenue for the fourth quarter of â\u0080\u009822 was $78.8 million, up 47.6% compared to $53.4 million for the fourth quarter of â\u0080\u009821, driven by organic growth in lifting equipment and contributions from the Rabern Rentals acquisition, which we closed in April of â\u0080\u009822. Northern Texas has a strong backlog of infrastructure, commercial and industrial projects, which are bolstering demand for Rabern Rentals. As of December 31, 2022, total backlog was $230.2 million, up 22% from the end of â\u0080\u009821 and up 11% from the end of the third quarter of driven by continued favorable trends in key markets in both North America and international regions. Excluding one-time adjustments during the fourth quarter of â\u0080\u009821 related to the disposition of the Badger business, gross profit during the fourth quarter of â\u0080\u009822 increased 93% over the prior year period, owing to the strong revenue growth, benefits from the companyâ\u0080\u0099s operational improvement initiatives and improved mix due to the contribution from Rabern Rentals. Adjusted net income was $2 million or $0.10 per diluted share in the fourth quarter of â\u0080\u009822, a significant increase compared to a net loss of $1.7 million or $0.08 per diluted share for the same period last year."
}