{
    "symbol": "ESCA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 14:59:02",
    "content": "  Operator: Greetings, and welcome to Escalade Inc. Fourth Quarter and Full Year 2022 Earnings Results Conference Call. On behalf of the entire team at Escalade, I'd like to welcome you to our fourth quarter and full year 2022 results conference call. Actual results may vary -- differ significantly from those projected in today's forward-looking statements due to various risks and uncertainties, including the risks described in our periodic reports filed with the SEC. In 2022, Escalade continued to build leading market positions within our key indoor and outdoor recreation categories while navigating a challenging operating environment. Following 2 years of elevated pandemic-related consumer demand for sporting goods and recreational equipment, demand conditions for most of our categories began to return to more normalized levels in 2022 contributing to a 10% year-over-year decline in organic sales. From an operations perspective, supply chain-related congestion and elevated inventory levels led to higher logistics costs for our business throughout most of last year, negatively impacting our profitability. Fourth quarter sales declined year-over-year across most outdoor categories, including archery, basketball, outdoor games, water sports and playground, partially offset by continued strength in pickleball, indoor games, table tennis and billiards. Importantly, we delivered year-over-year growth in gross margin during the fourth quarter despite a seasonally promotional environment, which is an accomplishment for our entire team. As expected, our inventory declined during the fourth quarter due to planned reductions in inbound product flow, seasonal demand and selective promotional activities. We reduced our total inventory by more than $13 million during the fourth quarter, which enabled us to repay nearly $12 million in outstanding debt. Also during 2022, we continue to build leading positions within our growth categories guided by a continued focus on innovation and new product development. For example, within pickleball, our category-leading Onix and Dura brands have continued to garner rave reviews and gain additional distribution, capitalizing on rapid consumer adoption of America's fastest-growing sport. In more established categories such as billiards and indoor game room, we've worked to build a leading portfolio of brands serving every aspect of the consumer experience from tables and cues to a full suite of accessories. This past year, we successfully completed the integration of Brunswick, which was accretive to our full year earnings per share, consistent with our expectations for the acquisition. This year, we are capitalizing on the potential provided by Brunswick to leverage our larger presence in the billiard market and realize additional revenue opportunities as well as cost savings. During the first quarter of 2023, we are preparing to launch patented innovative paddle technology to further support our market leadership in the fast-growing pickleball category, a suite of American Cornhole League licensed products together with accessory and ancillary products in our other leading categories. In summary, while last year brought its fair share of challenges, adding temporary yet sizable cost burdens to our business, we continue to advance our strategic priorities, driving both market share gains in key categories, together with continued operational execution across our sourcing, manufacturing, product development, e-commerce, compliance and manufacturing centers of excellence. First, based on consumer discussions and recent economic trends, we anticipate difficult year-over-year comparisons in both the first and second quarters of 2023 as we work through our high-cost inventory, manage through continued excess inventory levels in the channel and adjust to softening consumer discretionary spending. Additionally, due to the change in our reporting calendar, our second quarter will span 91 days this year versus the 112 days in last year's 16-week Q2. Despite near-term demand softness and economic headwinds, we do expect our gross margins to improve in the second half of 2023, given lower ocean freight rates and reduced logistics expenses. Our capital allocation priority will continue to be debt reduction, consistent with our objective of achieving net leverage ratio in the range of 1.5 to 2.5x EBITDA while continuing to support internal growth initiatives and a stable quarterly cash dividend, the latter of which remains an important element of our focus on total shareholder return. At this time, we expect retail inventory levels in the system to return closer to historical levels in the back half of the year, creating the potential for improved channel inventory replenishment later in 2023. As Escalade completes the celebration of its 100th-year anniversary, we are grateful for the ongoing support of our customers, employees and our investors and remain steadfast in our focus on delivering exceptional memorable consumer experiences that build brand loyalty while driving long-term value creation for our shareholders. For the 3 months ended December 31, 2022, Escalade reported net income of $2.7 million or $0.20 per diluted share on net sales of $72.1 million. For the 12 months ended December 31, 2022, Escalade reported net income of $18 million or $1.31 per diluted share on net sales of $313.8 million. For the fourth quarter, the company reported gross margin of 22.4% compared to 22.2% in the prior year period. For the full year 2022, our total gross margin was 23.5% compared to 24.6% for the full year 2020, '21. For the fourth quarter, selling, general and administrative expense as a percentage of net sales increased to 15% compared to 12.9% in the prior year period due to the addition of Brunswick Billiards. For the full year 2022, our SG&A as a percentage of sales was 14.3% compared to 13.8% for the full year 2021. Earnings before interest, taxes, depreciation and amortization declined 21.5% to $5.8 million in the fourth quarter of 2022 versus $7.4 million in the prior year period. For the full year 2022, EBITDA decreased 12% to $32.5 million compared to $36.9 million in 2021. For the full year 2022, the company generated net cash from operations of $8.5 million compared to $0.9 million of net cash from operations during 2021 due to favorable changes in working capital. For 2022, our capital expenditures were more normalized at $2.1 million compared to $9.7 million during 2021 when we purchased a manufacturing facility in warehouse in Olney, Illinois, and completed improvements to our Evansville, Indiana facility. As of December 31, 2022, the company had total cash and equivalents of $4 million, together with $35 million of availability on our senior secured revolving credit facility maturing in 2027. At the end of the fourth quarter of 2022, net debt outstanding or total debt less cash was 2.8x trailing 12-month EBITDA. One last important thing to note as we enter 2023, effective this quarter, we are transitioning our fiscal calendar to a traditional 12-month reporting calendar year. But from a competitive standpoint, it sounds like you're obviously maintaining, if not continue to gain market share with some of the new products planned, it sounds pretty exciting. So first of all, yes, we do feel like we're gaining market share, and we believe that when times are more challenging, that's the time when you can do that if you're a strong company with a strong balance sheet and a great team."
}