{
    "symbol": "GHLD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 07:43:06",
    "content": " Consistent with broader industry trends; adjusted net income and earnings per share came in at $32 million and $0.53, respectively for the first quarter of this year. We have generated a 40.4% adjusted return on equity over the last five years, including a 12.5% adjusted return on equity and a 81.2% return on equity for the first quarter of 2022, even as origination volumes and gain on sale margins softened. While origination volumes and related revenue were down quarter-over-quarter GAAP income, net income was up 393%, largely a function of strong gains related to the MSR, fair value adjustments, and high unpaid principal balance and related servicing fees. Despite declining origination volumes, the UPB of our servicing portfolio, consisting primarily of MSRs sourced through our retail channel, was up 3% quarter-over-quarter to $73.3 billion driving strong growth in servicing fees and related earnings contribution. Turning to non-GAAP results, adjusted figures for the first quarter exclude a $209.5 million favorable change in fair value of MSRs due to higher interest rates, as well as a $28.9 million change in fair value of contingent liabilities due to acquisitions, which is again reflected as a benefit to G&A expense. Focusing on our Origination segment, our gain on sale margin came in at 400 basis points on $6.1 billion of total funded originations for the first quarter, up from 347 basis points on $8.8 billion of funded originations in the fourth quarter of 2021, was an increase primarily due to timing of loan sales versus originations. Pull-through adjusted loss volume totaled $7.3 billion in the first quarter, down 7% quarter-over-quarter due to rising rates through the quarter and unfavorable seasonality. For the first quarter of 2022, we recorded a $209.5 million gain related to MSR fair value adjustments compared to $16.8 million for the prior quarter."
}