{
    "symbol": "GHLD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 02:29:13",
    "content": " We generated compelling sequential quarter growth in GAAP net income, adjusted net income and earnings per share for the third quarter, while maintaining strong profitability despite quarter-over-quarter declines in originations and gain on sale margins, reflecting ongoing macro headwinds. Even after excluding fair value changes related to MSRs and contingent liabilities, adjusted net income and adjusted earnings per share came in at $24 million and $0.40 per share, respectively, for the third quarter of this year, both 74% higher compared to second quarter results. Because of our long-term expertise and experience across cycles, we've been able to manage successfully through recent market shifts and delivered adjusted return on equity of nearly 8% for the third quarter of this year and during the trailing 12 months ended September 30, 2022. For the third quarter of 2022, we generated $4.4 billion of total in-house loan originations, representing a 24% sequential decline from $5.7 billion in the second quarter. Net revenue totaled $261 million compared to $288 million in the prior quarter, while net income totaled $77 million or $1.26 per diluted share. In comparison, second quarter adjusted net income, adjusted earnings per share, and adjusted EBITDA were $14 million, $0.23 per share and $22 million, respectively. Pull-through adjusted locked volume totaled $4.4 billion in the third quarter compared to $5.8 billion in the prior quarter, consistent with declining origination volumes across the industry. For our servicing segment, we generated $97 million of net income in the third quarter, up from $64 million in the prior quarter with the increase primarily reflecting more favorable MSR valuation adjustments, higher servicing fees on continued growth in unpaid principal balances and lower operating expenses. The unpaid principal balance of our servicing portfolio, consisting primarily of MSRs sourced through our retail channel, was up 2.5% quarter-over-quarter to $77.7 billion, and we retained servicing rights for nearly 89% of total loans sold in the most recent quarter, boding well for ongoing growth in servicing fees, while reinforcing the synergies with our originations business."
}