{
    "symbol": "TTE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 13:36:02",
    "content": " LNG sales were 4 million-ton targets -- 4 million tonnes above targets because of intense LNG spot business in Europe, and we maximized the value of our regas capacities and, of course, renewable as well while, at the same time, meeting our Scope 1 plus 2 emission reductions, despite high utilization of CCGTs in Europe. All segments made stronger cash flow contribution in 2022; $26 million from E&P, up 39% on higher oil and gas prices and despite the U.K. windfall tax profit, which represents -- which has represented in 2022, $1 billion. So the capital investment of '23 will support the transition, $16 billion, $18 billion, at which -- out of which, $5 billion for low-carbon energies, let's say, quarter 4 for integrated power and more than before on the new molecules because we grow our ambition in the various segments. Having said that, we expect an increase of our integrated power cash flow from $1 billion to, let's say, plus 30%, 40%, we'll see. The year 2023, coming back on oil, and I think it's important to tell you that we have decided to mobilize most -- at least, most 50% of our exploration budget on Namibia. And we have some different options in the portfolio to buy and sell in -- and so we'll keep you aware, but this is, I would say -- and it's part why we keep the range because, of course, when we don't -- the range is, for me, sometimes you have divestments which are done, but you -- for example, Dunga, we're during 1 year, but we will receive the proceeds only in '23, not in '22. It's a business where most of the CMO -- we have some capital employed, of course, and productive because -- but the cycle is quicker than in oil and gas because, normally, to build an onshore solar plant or an onshore wind farm, it's more 2 years than 5 -- 4 years, I would say. And from this perspective, as Europe seems to be very serious about CO2 pricing, I think, on the long term, it's something which is maybe more sustainable, but fiscal incentive, which could -- which is sustainable for 10 years."
}