{
    "symbol": "DEI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 17:25:28",
    "content": " We're waiting -- we were waiting -- we thought we were actually going to get some guidance like this month or next in terms of how it's actually going to be executed, but then we heard we weren't going to get any guidance until June or July, sort of waiting to hear that. I mean, I'm not -- I'll tell you I'm not optimistic considering what's going on with the economy today when you talk about the economy two years from now, and I don't know what they will do or will want to do, they don't have any more options. I mean someone is less than a month to link with, we collect the money -- I mean we don't keep -- or if you're telling me raising rent on someone that's in their unit, more than 10%. I mean, I was really surprised going into the fourth quarter that things shifted so quickly as kind of attitudes went towards -- and I think you saw that in a lot of people, attitudes went towards we're going to go into a recession and how quickly the leasing shifted. And so it was a very hard number to put out, quite frankly, because there's still -- you're talking about something where there still is -- I mean even that rough fourth quarter, still a lot of activity, over 700,000 feet. But I think as we warned you guys going into the fourth quarter, during that call, we said, hey, while we're seeing a real change in the pipeline in terms of leasing -- it's never nothing. I mean like when we're in a world where hybrid office is sort of the thing, it's not a need based situation, but a want based in some cases, whereas residential is quite different, you have a very unique residential platform. So that's why right now apartments, which people still have a lot of confidence around apartments, so maybe they're not going to be discounted as much, but there's a lot less confidence around office. So maybe the very fact that it moves so quickly in one direction, is your confidence behind office, and I guess I'm kind of parodying what you just said, but so setting flat occupancy is the absolute probably worst case scenario and more likely, you probably see occupancy lift as the year goes on as long as we kind of get the macro right and we don't have like a really disruptive economic scenario from Fed activity and so on."
}