{
    "symbol": "DEI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 05:21:03",
    "content": " We have documents done to say to people that, \"Okay, here's what we're going to do, I'm going to buy this,\" which obviously we want a part of that, \"but I'm also going to put these other things in,\" which then they have to value those. I mean, we didn't really -- I'm not changing it from saying it's going to take 2 years to lease up the project, but all signs are that we'll make it in 2 years, and maybe we'll do a little better. He thinks management fee for…\n I'm just asking whether it's...\n You mean like -- right, a promoter or an asset management fee or something like that? We kept getting hit with new supply of office, and that's -- now we're seeing more than one deal, like multiple deals of shifts of companies out there, whether it be for studio space or taking big plus -- I mean, I don't think it's a secret that the ramps are put to in a practice field right -- literally right next to Warner Center. So as I said -- as I have said and I'll say right now, I don't think the rest of the collections are going to show up in any meaningful way in the numbers that we're showing you guys. One was obviously the loss of occupancy, the loss of lease rate, which we've been talking a lot about on this call, which we -- I mean, we for sure turned that corner and we're doing a lot of leasing, and we need to just retain that -- those tenants. And I think we'll capture the rest of that money as long as the economy keeps going the way it's going, in a reasonable good -- reasonable timeframe. And even the ones that didn't, are now paying and paying back rent on some kind of programs or we're making deals and we're down to a very -- we're not down to big numbers left of where we have to make deals with people or do something about with ALS. I think in the past you said... Of course, that number is -- that number tells you something, but I wouldn't grab it too tight because depending on what rolls in any particular quarter, that number can really jump around. Like I said in my opening, it's -- they're going to be choppy quarter-to-quarter. And the new number is also a good sign if you say what's going on in the economy, what's going on with people going back to work, okay, you're going to see all that in the new number, the new leasing. But we got to -- look, you can't ignore the fact that we're still down almost 600 basis points, and that's a lot of money. The place where there's a lot of transactions, where I think you're going to -- you're seeing the world already slow down as the cash homes, single-family homes."
}