{
    "symbol": "GMS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-09-02 12:26:04",
    "content": " We realized higher than expected gross margin of 32.2% as year-over-year increases in ceilings, steel framing and complimentary products, partially offset pressures on wallboard margins, principally due to the timing of our passthrough of supplier pricing actions. As a result, adjusted EBITDA margin improved to 12.3%, 200 basis points over last year's first quarter. in the U.S., for example, residential sales showed considerable strength up more than 30% on both higher volume and price, or commercial sales, which were also up double digits that continue to be sluggish from a volume perspective but we're up overall on higher pricing. Given recent supplier pricing actions, our average realized wallboard price has gone up sequentially each month since last September, with the first quarter fiscal 2022 average of $356 per 1000 square feet up 8.4% from the fourth quarter and up 14.5% from the first quarter of last year. Sales of complementary products in which we have placed increasing emphasis internally is one of our primary drivers of growth from 27.4% to $317.6 million for the first quarter, as we've benefited from positive contributions from acquisitions, continued strength in our Canadian business and strong pricing in certain product categories. Gross profit of $335.8 million increased to 28.9% over a year ago, as gross margin performed better than expected coming in at 32.2% or 30 basis points behind last year's level. All-in-all, first quarter adjusted EBITDA of $128.1 million was 54.2% higher than a year ago and adjusted EBITDA margin improved 200 basis points year-over-year to 12.3% for the quarter, representing an incremental margin of 18.8% several points higher than our earlier projection. Wondering if I could ask on the gross margin front, I think I believe last quarter you guys guided to gross margins being kind of stable sequentially, which I think was 31.5%, you were about two months into the quarter at that point, and you ended up -- you posted 32.2%, so came in well above expectations. So I wouldn't think that -- I don't want to give anybody any kind of indication of the long-term gross margins at the moment based upon what our product mix is and our strategies are is going to be much above 32.5%, I do think there's other parts of the business that we can continue to work on."
}