{
    "symbol": "BEEM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 00:37:03",
    "content": " As a percentage of sales, the gross loss is improving, primarily due to increased production levels which resulted in favorable fixed overhead absorption and improved labor efficiency in spite of an increase in material costs for steel and other components due to supply chain shortages and other inflationary pressures, and a $0.8 million increase of non-cash intangible amortization related to purchase assets from the All Cell acquisition. So, said another way, starting back in 2020, $6 million in revenue, $9 million in 2021, $22 million in 2022, and about 3 times that much in reported firm contracted purchase orders as of the beginning of the fourth quarter of last year. But when you realize that just about any government entity across the United States can now buy our products without going through any sort of competitive, time-consuming arduous processes, at a time when there's nothing but increasing urgency to the core EV charging infrastructure, you can perhaps grasp while we work so hard to put these types of contracts into place. In fact, in the fourth quarter of 2022, we produced 103 EV ARC systems, a 115% increase, more than we've -- over the prior year and more in fact than we've produced at any full year prior to 2021, and it wasn't even very far of that full year's production. Having produced 2.5 times more EV ARCs in 2022 than we did in 2021, we're now continuing to dramatically enhance our production capabilities, because, of course, as I've already mentioned, we have about 3 times more units currently under contract than we produce in all of 2022 and our sales team continues to be highly active. It's also important to note that about $839,000 reported in our cost of goods sold was actually depreciation and amortization of intangible assets related to our acquisition last year and not actually directly part of the variable costs associated with making our products. And again, I'm convinced that because the small amount of data that I do have to look at things like the pipeline returning to over $100 million after we took $76 million out of an $80 million pipeline, you think about what that actually means, that's pretty dramatic."
}