{
    "symbol": "BEEM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 23:12:07",
    "content": " Reading our filings, you will notice that of the $7.4 million of cash we used in Q2, $3.6 million was spent on inventory work-in-process products, largely partially completed EVRs, which were already sold and importantly, the strategic allocation of cash to secure vital battery cells, which are essential to our EV chartering product production and to our broader battery manufacturing business. I think what the astute listeners are going to figure out here is that the â\u0080\u0093 and I mentioned it in my comments that we have quite a significant accumulated WIP, work-in-progress group of essentially partially â\u0080\u0093 well, all but complete EV ARC systems that because we had that lack of smoothness in the transition from prior battery vendor who were unable to keep up with our demand and the new engineered packs that weâ\u0080\u0099re bringing over a year, those would otherwise have gone to customers. And I was very clear with the Chicago team when we acquired them that while itâ\u0080\u0099s important to me that they provide us with the best possible and least expensive and most scalable battery storage solution for the products that we were already making at Beam, that could not be at the expense of broadening revenues from the other aspects of their business because I want the revenue the margin, but also because I want the opportunity to get into all of those other businesses in a meaningful way. And itâ\u0080\u0099s â\u0080\u0093 I really hope that the way weâ\u0080\u0099re going to be able to add a great deal of margin and compete with very large, very well-funded organizations in this space is that we will be able to exceed the safety aspects, but at the same time, provide the kind of bespoke requirements for many of these other applications, which, as I said, I believe, are just at the very beginning of the growth curve. But just to keep for that, using that Norman Fletcher at the moment, I think what youâ\u0080\u0099ll see is a greater consistency in the product offerings in San Diego because we make a smaller number of products, and they all have very, very fixed prices sometimes minor discounts for large volume purchases for the Feds or State of California or something like that, where the battery products, there is going to be much more variability in the margin sets there. So, it was â\u0080\u0093 so itâ\u0080\u0099s good to hearâ\u0080¦\n By the way, one thing I want to make clear to you and to everybody else who is listening, and part of the other reason that it might take a little bit longer to get this done is because I want to continue down the path of not using cash or our capital to get these things done."
}