{
    "symbol": "JNPR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 20:50:02",
    "content": " With that said, we are particularly encouraged by the Q2 momentum in our enterprise business, which not only delivered a record revenue quarter, but also saw orders increased by 20% year-over-year. Annual recurring revenue or ARR who approximately 34% year-over-year and reviewing our top 10 customers for the quarter, six were cloud, three were service provider, and one was an enterprise. For the third quarter, we expect to see revenue growth of approximately 14% year-over-year driven by the strength of our backlog, strong demand and an improved supply outlook. Given the strong order momentum we have seen coupled with our current backlog, as well as an improved supply outlook, we are raising our revenue growth expectation for the year to approximately 10%. What the order momentum we are seeing our elevated backlog and current expectations for supply, we expect revenue growth of at least mid-single digits on a full year basis in 2023. Thank you, ladies and gentlemen. So needless to say, I'm incredibly proud of the team for the results that they're continuing to deliver in the enterprise segment all up, very strong growth, both in terms of revenue, but also in terms of orders that grew 20% year-over-year, diversity in terms of the technology offering. So I know when it comes to macro indicators, I think people are mostly concerned about what might happen to the enterprise, but you saw there, enterprise revenue double digit growth, enterprise orders growing at 20% year-over-year. So, the key point of the question was, can you, in fact, if you went through a stress test analysis like a bank, absorb 20% or 30% declines for three or four quarters, and still end up with that massive backlog given where you are exiting 2023, and which case the only real question then is the improvement in the supply chains, your ability to deliver on better than 5% growth and in the top line over that timeframe that you clearly have the orders. Thank you, ladies and gentlemen."
}