{
    "symbol": "COST",
    "quarter": 1,
    "year": 2023,
    "date": "2022-12-08 19:53:06",
    "content": " In terms of sales, net sales for the first quarter increased 8.1% or $53.44 billion versus $49.42 billion reported last year. On a comparable sales basis during the first quarter, reported U.S. sales increased over the 12 weeks 9.3%; and excluding gas inflation and FX, 6.5%; Canada, 2.4%; reported 8.3% increase, ex gas inflation and FX. Again, the relative weakness in foreign currencies relative to the U.S. dollar, excluding the impact of FX, we're assuming flat FX year-over-year, that $54 million number would have been increased by $32 million, and the membership on an adjusted basis would have been a little over 9% year-over-year on flat FX. And as I'll explain in a minute, the 93% pre-tax charge, excluding that 93% -- $93 million charge we took in the quarter, gross margin ex gas inflation would have been only down 3 basis points. Ancillary and other businesses, plus 23% on a reported basis and plus 30%; 2% reward, minus 2 and minus 5; LIFO plus 3 and plus 3; Other, that's the $93 million charge, minus 17 and minus 18. You recall last year, during the four quarters, we had LIFO charges in excess of $400 million pre-tax with a small amount that $14 million in the first quarter over $100 million in Q3 and over $200 million in Q4. During the first quarter, our core operations was lower or better by 8 basis points, plus 8 then; without gas inflation, minus 9; central zero and minus 3; stock compensation, plus 3 and plus 1; preopening zero and zero; Other, plus 24 and plus 24; for a total first column reported year-over-year reported SG&A plus 35 or lower by 35 basis points and ex gas inflation lower by 13. We have a -- it's a $30-plus billion -- on our $220-whatever-billion last year, we did in sales, I think a little over $30 billion was gas. I think if I recall, over the last two or three quarters, we've talked about like fresh being that way and probably exacerbated a little right now with the fact that we're trying to hold prices on some things that we think that, that's driving our sales. And frankly, if inflation is not rising again, even if it doesn't go down, but it doesn't rise again from its current levels, we're in pretty good stead of greatly improving the component of margin that relates to a LIFO charge, particularly in Q3 and 4 when we had a $100-plus million number and a $200-plus million number. And I think with the headline in the -- I probably mentioned in the last quarter call or even the quarter before that, with the headline being recession question mark and inflation exclamation point, there's no rush."
}