{
    "symbol": "BRDG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 17:00:06",
    "content": " Jonathan and Katie will give more detail in a moment, but my key takeaway from our first quarter is that Bridge continues to execute and scale our differentiated fundraising and investment approach focused on some of the most attractive sectors within real estate that aggregate to a large and growing total addressable market. While we are very pleased with our performance fees, I'm most proud of the continued track record of growth in our recurring fund management fees, which grew from 36.7 million to 44.3 million quarter-over-quarter and from 30.4 million a year ago, which represents a 41% compounded annual growth over the last five years. Since launching our logistics strategy in November 2021, we've been growing the business and are in a terrific position to invest at scale and through multiple deployment strategies focused on in-field U.S. Our regional organization structure is in place with boots on the ground in our key target locations and we have deployed or under agreement for approximately $1.5 billion in logistics assets, which equates to 8.3 million square feet of acquisition and development opportunities. Our total investment income for the first quarter increased 253% year-over-year, driven mostly by unrealized carried interest of 65.9 million and realized carried interest incentive fees of 9 million. Our total fund level fees for the quarter increased 106% over last year to 74.7 million, driven by strong growth in our contractually reoccurring fund management fees powered by the continued AUM growth. It's interesting, I think you heard in my prepared remarks that we're definitely seeing some things shipped in the wins and one of the things that we are seeing is, the – let's call it,   investment investors and market participants are starting to lose ground, and so sellers are no longer as focused on getting let’s call it the last dollar out of the investment and more focused on surety of close and execution when they're looking at transactions."
}