{
    "symbol": "RIDE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 11:18:01",
    "content": " Yesterday, we announced that Foxconn has agreed to make an additional investment in Lordstown Motors of approximately $170 million, subject to certain terms and conditions. Our loss from operations in the third quarter totaled almost $155 million, which included $121 million of charges for our inventory NRV, litigation accruals and a PP&E impairment. For 2Q, we reported a profit from operations of approximately $61 million that included $102 million of P&L benefit from the gain on the sale of the plant, a onetime reduction in R&D from OpEx reimbursement from Foxconn under the APA, less a smaller NRV charge and a smaller litigation affect. Removing these items, our adjusted operating loss in the third quarter was $33.8 million compared to $50.3 million in the second quarter of 2022, an improvement of almost 33% or $16.5 million. Focusing on the third quarter of 2022, SG&A totaled $60 million, which included $30 million litigation accrual and a $16.2 million NRV charge. Our second quarter SG&A was $29.9 million, inclusive of a $6.5 million NRV charge and a $2 million litigation accrual. So apples-to-apples, 3Q as adjusted SG&A was $13.9 million versus $21.4 million in the prior quarter, representing a 35% decrease, a large share of which was the timing of certain personnel-related accruals, and 1/4 of it was a decline in professional fees as we reduced our reliance on outside consultants. Again, the apples-to-apples way of looking at R&D is to compare the costs, excluding the impact of the plant sale, which on an as adjusted basis was $28.9 million in the second quarter. The remaining $18.9 million of 3Q R&D costs consisted of $9.4 million in personnel, an increase of $1.7 million over the second quarter, $4.8 million in engineering and testing services and $4.7 million in other costs, which were slightly lower versus Q2. Together with roughly $53 million to be provided from the first tranche of the Foxconn investment, we expect year-end cash of $150 million to $165 million, excluding any contingent liabilities or incremental capital raises."
}