{
    "symbol": "RIDE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 11:54:03",
    "content": " I would now like to turn the conference over to Carter Driscoll, Vice President of Corporate Development, Capital Markets and Investor Relations. The safe harbor provision identifies risk factors that may cause actual results to differ materially from the content of our forward-looking statements for the reasons that we cite in our Form 10-K and other SEC filings, including uncertainties posed by the difficulty in predicting future outcomes. Joining us today will be Lordstown Motors CEO, Dan Ninivaggi; President, Edward Hightower; and CFO, Adam Kroll. While we have experienced some delays in building our pre-production vehicles or PPVs, I am pleased to report that final engineering design validation and testing are underway, and we continue to target start-up commercial production beginning in the third quarter of 2022. In terms of customer demand, we continue to see strong interest in the commercial fleet market for electric vehicles of all types, including pickup trucks. We believe the market will be underserved for the foreseeable future and that demand will be particularly strong among commercial fleet customers, given their focus on total cost of ownership and specific work requirements. With this in-wheel hub motor design, the Endurance is truly unique and we believe will offer a superior combination of handling, traction control, torque and turning radius. With fewer moving parts than more conventional propulsion systems, we also believe the Endurance will have advantages and overall maintenance costs. As Edward and Adam will discuss later in the presentation, our bill of material costs at launch will be significantly higher than our anticipated selling price. We have a plan to reduce our BOM costs over time through investments in hard tooling, moving from prototype to production suppliers, VAVE initiatives, and realizing the benefits of the Foxconn transactions. However, at least for the time being, we plan to hold off on the larger hard tooling and other investments in order to manage our balance sheet and limit the amount of new capital needed to achieve or initial production targets. As a result, over the next 12 months or so, we'll be focused on selling vehicles to a relatively small number of strategic fleet partners who offer the best opportunities for long-term relationships. On our last call, we forecasted an initial production run of approximately 500 units in the back half of 2022. Following the closing of our transaction, we expect to jointly evaluate with Foxconn, the ramp up plan for the Endurance, the scope and timing of our BOM cost reduction actions, potential supply chain initiatives, and other opportunities to scale production including through strategic OEM partnerships. As Adam will discuss in more detail, ramping production will be capital dependent, but we will be prepared. Now turning to our long-term strategy, as I mentioned on our last call, the conversion to electrified power trains presents OEM startups like LMC with a very unusual opportunity to penetrate the automotive market and gain meaningful share particularly in certain under the serve segments. But success requires that we deliver scale, a differentiated commercial plan, an innovative product, a competitive cost structure, and a vehicle development platform that brings products quickly and efficiently to market. Foxconn has ambitions to capture a significant share of the global EV market, not just in contract manufacturing, but in key components as well. In addition to other strategic benefits, the Foxconn partnership would unlock the full potential of the Lordstown plant by getting it to scale faster. At 6.2 million square feet and 640 acres, the Lordstown complex is one of the largest internal combustion automotive plants in North America that is being converted to a state-of-the-art EV manufacturing facility. Foxconn has an excellent opportunity to fill the plant, LMC and all OEMs whose vehicles are built at the plant will benefit from the increased capacity utilization, use of common components and lower overhead costs. Scaling automotive manufacturing matters, use of shared space together with the mobility in harmony or MIH open source platform that Foxconn has developed, provide smaller and more specialized OEMs the opportunity to achieve the benefits of scale without being a large, fully integrated automaker. As the largest contract manufacturer in the world, Foxconn has significantly better purchasing power than we would on our own as well as a global integrated supply chain network and the logistics capabilities necessary to help us reduce vehicle production costs and minimize our supply chain risks. We also stand to benefit from Foxconn's expertise in hardware and software integration, critical to EVs, given their expertise as a multinational electronics manufacturer. Finally, a partnership with Foxconn would likely extend beyond a contract manufacturing agreement. When we announced the transaction, we stated that Foxconn and LMC would explore a joint venture arrangement for the development of new electric vehicles utilizing Foxconn MIH common platform. This was an important part of the deal, because in our view, LMC requires a scalable vehicle development platform for future vehicles that will allow us to compete with much larger vertically integrated OEMs. Since our last earnings call, we have made progress on the terms of a contract manufacturing agreement, and an agreement under which we would develop new vehicles in collaboration with Foxconn off of the MIH platform. While definitive agreements have not been reached and may not be reached, I believe we're close and our relationship with Foxconn remains very solid. This past weekend, Foxconn agreed to extend the down-payment repayment deadline under the APA from May 14 until May 18, the day before our annual shareholders meeting to provide a little more time to conclude our transaction. In closing, I'm pleased with the progress we've made on moving the Endurance towards launch readiness and building our relationship with Foxconn. As we discussed in February, our two immediate objectives at Lordstown Motors are to launch the Endurance in Q3 and to build a product development relationship with Foxconn. Over the last quarter, we have continued to make progress with our Endurance preproduction vehicles or PPV builds on the Lordstown production line. Under our Lordstown production system and launch governance structure, engineering readiness, quality and part availability are governing the speed of the Endurance launch. We experienced some supply chain disruptions over the quarter that impacted the rate and completion timing of our PPV builds, the commodities having the greatest impact, including steel and aluminum for our frames, body and battery enclosure, and chips for the various computing modules in the Endurance. Despite these disruptions, as planned, we have completed sufficient vehicles to begin our engineering and validation testing. Given our expected timeline for certification completion, we anticipate that commercial fleet customer deliveries will start in Q4. Post-launch our future plans for the Endurance will focus on reducing our bill of materials, BOM costs, as Dan previously explained, is significantly higher than our anticipated selling price. Following raising the necessary capital, we have a series of hard tooling investments and value analysis, value engineering projects planned with the intent to significantly reduce our BOM costs. Switching to our product development relationship with Foxconn, as Dan mentioned earlier, we have been working on an agreement with Foxconn to jointly design engineered, develop, industrialize and launch battery electric vehicle programs using Foxconn's MIH, Mobility-in-Harmony open platform. These new vehicles will be built for North America at the Lordstown, Ohio plant, and at other Foxconn contract manufacturing locations around the world. The objective is for OEM users of this flexible MIH platform, manufacturing footprint, and supply chain to achieve production scale at lower volumes with a shorter time to market. For LMC in particular, this agreement with Foxconn will provide a scalable vehicle development platform, reduce our product development costs, and increase the breadth of our product portfolio. As Dan stated, while our discussions with Foxconn have been constructive, at this stage a definitive agreement has not been reached. On our last call, I guided that our business plan required in the area of 250 million of new capital this year, of which a large share was needed in advance of starting commercial production in Q3. For now, we are pursuing a business plan that will give us the best opportunity to launch the Endurance and hit our initial production target. As a result, we believe that the new capital required this year is around 150 million, including our minimum year-end cash target. We will primarily hold-off on the hard tooling investments originally planned for this year, along with other investments in operating costs that we will defer until we raise sufficient capital. Late last year, and in Q1, we kicked off some of the tooling, but as we discussed on the last call, hard tooling generally has long lead times. Starting with cash, we ended the quarter with 203.6 million in cash representing a decrease of 40.5 million from 12/31. With respect to operating costs, we incurred a total of 87.9 million in the first quarter, a modest 3.2 million increase from Q4 and down from each of the first three quarters in 2021. To address many of your prior questions for the first time, we are breaking out costs in R&D associated with manufacturing in the Lordstown facility from engineering expenditures. Our plant costs which includes about two-thirds of our total headcount, along with facility, freight and manufacturing costs were 21.9 million in the quarter, just under half of that is personnel and about a quarter represents freight largely associated with obtaining parts. This compares to our Q4 plant costs of 18.6 million when our employee costs were about 26% higher due to some Q4 year-end accruals and higher stock comp, offset by significantly lower freight and utilities. Directionally, if we continue to own the plan, the operating costs it would be increasing as we get into production for more personnel and the indirect costs rising with activity levels. As I suggested last time, these costs are expected to increase through launch as we ramp up testing activities, particularly specialty outside engineering services along with other variable costs and decreased thereafter. For comparison, these costs were approximately 36 million, 29 million and 21 million in quarters two, three and four respectively last year. The last major category of R&D spend are the vehicle component costs, totaling 19.7 million in the first quarter, compared to 22 million in Q2 2021, 12.3 million in Q3, and 19.6 million in Q4. After launch, these costs should dramatically decrease to a normalized level for ongoing basic engineering and new vehicle options et cetera. With respect to cash flow, we invested 21.9 million in the business during the quarter, consisting primarily of 10.7 million in the plant to get ready for production, and 10.2 million on tooling for the Endurance. To-date since executing the initial agreement in principle last September, we have received a total of 250 million from Foxconn, consisting of the initial 50 million in common stock and purchase price down payments of 100 million in November, 50 million in January, followed by 50 million in April this year. So if the transaction closes, our pro forma cash balance as of 331, would have been over 300 million. With the Endurance on the verge of commercial production, we are all very excited. We have almost 700 Lordstown colleagues working tirelessly facing macro headwinds, and the daily challenges that come with designing and delivering an entirely new purpose-built vehicle. So, it's just that was the data which, again, the payments had to be repaid, but we've extended it. So, that means the 250 million that's been paid by them. Well, the delay, it's a complex deal we've been working on it hard with. So when we originally signed the deal, in November, that was the date that we had set to try to get everything done, and we just haven't gotten everything done. If you make the payment, that deal goes to me, if the deal goes through and you make the payments, then you have the 300 million. If the loan comes due or the down payments come due, because we haven't closed the deal, we wouldn't have the cash to fund it. And we expect, like I said, we've had constructive discussions with Foxconn. And I think the fact that Foxconn agreed to extend the repayment deadline, it's a good sign. And then if we think about the cost greater than the price of the BOM cost greater than the price at the initial point of sale, I mean, I guess that's, given everything's going on with cost inflation and the cost of ramping up, that's probably not too surprising. As we said, we have a plan to bring down the BOM costs through the heart tooling investments and our VAVE projects. We'll continue to work on those, but we have a plan to get there as we raise the capital to invest towards those our tools in those projects. Some of the longer lead items, as Dan was just saying, have a timeline of about 12 months, but 12 to 18 months, but there are some other projects that we could speed up again, it's capital dependent. And other than Foxconn, are you have any discussions directly with any other automakers on contract manufacturing, and obviously, it's been rumored that Fisker, not much more than rumor that Fisker would potentially be contract manufacturing with Foxconn at the Lordstown facility. I mean, the focus is getting the Endurance into launch and getting the deal done with Foxconn. And I'd also like to thank again, the LMC and Foxconn teams for all the hard work that has as to where we are today. I'm very proud of the fact that our core team, manufacturing, engineering and corporate has never let the challenges and distractions overwhelm us."
}