{
    "symbol": "RIDE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 11:05:08",
    "content": " During 2022, we significantly reduced our cash burn, fixed costs and operating complexity as well as raised $263 million in capital, of which $210 million was from Foxconn and the balance from common stock issuances into the market. The Foxconn funds included $157 million related to the plant sale that was received in 2022, plus another $53 million in November from the sale of common and preferred stock. Under the terms of the investment agreement we entered into with Foxconn in November and subject to regulatory approval, other conditions and satisfaction of EV program milestones, Foxconn is expected to purchase up to $117 million in additional common and preferred stock. In that quarter, our total operating costs were approximately $22 million and were budgeted to rise to support launch and increase production. Thus, we shed roughly $100 million in annual operating costs in exchange for a contract manufacturing fee per vehicle and $257 million in asset sale proceeds. The remaining $29.4 million of cost of sales included $8.3 million of depreciation on production equipment and tooling we continue to own and $21 million of charges in connection with inventory write-down, primarily related to our NRV adjustment for inventory acquired during the period and another charge we took for excess inventory on hand. SG&A expenses were $22.2 million for the quarter, including $7.6 million in non-cash items for the write-off of a prepaid royalty and accelerated stock comp and $1.2 million of litigation accruals. However, that includes $33.9 million in litigation accruals, $25.6 million in NRV charges for the first 9 months of 2022 before reporting cost of sales and $7.6 million for the write-off of the prepaid royalty and accelerated stock comp. The remaining $71.1 million of SG&A consisted of $40.5 million for personnel and professional fees; $11.4 million of legal expenses; $11.8 million of insurance premiums; and $7.2 million for other services, software and marketing expenditures. R&D expenses were $15.6 million in the quarter, including $1.8 million of accelerated stock comp; $10.6 million in personnel and consulting costs; and $3.2 million in software, other services and overhead. This compares to non-plant related personnel and consulting costs of $16.9 million in the fourth quarter of 2021 and $14.2 million in the third quarter of 2022, representing decreases of 38% and 26%, respectively, as Endurance development and testing expenditures trend down approaching the launch, as previously discussed in our outlooks. However, these amounts include plant-related costs of $33.3 million in 2022 incurred prior to the sale in May and $57.1 million in 2021. The change in cash consists of $42.7 million in cash used for operations, inclusive of a $21.1 million working capital investment; $2.9 million in capital expenditures, net of $1.1 million in asset sale proceeds; and $63.7 million in cash proceeds from the issuance of common and preferred stock, including the $52 million purchased by Foxconn. The $57 million cash beat I mentioned earlier was due to cost containment, which represented approximately $13 million, along with $12.4 million in stock sales under the ATM, $12 million in lower CapEx and $13 million in working capital, excluding inventory. And while we expect $100 million in preferred stock funding under the Foxconn investment agreement, we will cover the planned predevelopment work for the new vehicle program in 2023. We expect to end the first quarter of 2023 with $150 million to $170 million in cash and short-term investments, excluding any additional Foxconn funding, other equity sales or contingent liabilities. The remaining $117 million of Foxconn investments discussed earlier are broken down as follows: approximately $47 million from a second tranche of common stock, following satisfaction of conditions under the investment agreement, followed by tranches of $30 million and $40 million of preferred stock purchases that are each subject to achieving mutually agreed development milestones and satisfying other conditions. So, what we laid out is that approximately $100 million â\u0080\u0093 well, $100 million of the preferred investment that Foxconn is making that we announced back in November will go towards the predevelopment work for the future platform and new program."
}