{
    "symbol": "UL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 03:32:04",
    "content": " India reported another strong quarter of growth at 16.1%, led by price with positive volume, and this reflects the strength of our portfolio with brands that cover different price points as well as Hindustan Unilever's laser focus on operational execution and consistent marketing investment. Home Care growth was the highest of the business groups at 13.6% with price up 17.8% and volumes down only 3.6%, less than we were expecting given these levels of pricing, especially in Latin America. Comfort delivered positive price and volume growth on the back of good progress made with our global relaunch, and that's using a product which protects clothes from damage through superior pro-fibre clothes care technology as well as improved fragrance delivery. And Unilever Food Solutions, our professional foodservice business, delivered strong growth against a baseline that included COVID restrictions, although the business is now back to pre-COVID volumes despite the ongoing restrictions in China, and we saw particularly good growth in North America and Europe in the quarter. So coming to the outlook for 2022, we now expect full year underlying sales growth in '22 to be above 8%, driven by price and with a greater level of volume decline in the fourth quarter compared with the first nine months. But we're being realistic that if we follow our strategy of leading on price, which is our strategy to protect our ability to stay in that virtuous cycle of investing in our brands, increasing brand health and giving us a platform for taking price increases, then it's inevitable that in places where competitors are slow to make similar moves, we will tolerate short term dips in market share. Just to give you another couple of data points, at a brand level, both the Heartbrand, which is Wall's, Langnese, et cetera, Iglo, that brand around the world, Magnum, Cornetto, all of them delivered double-digit price increases with positive volume growth in the quarter. That's the segment that continues to do well, and that's why we're seeing double-digit growth in the latest quarter from that Health & Wellbeing business."
}