{
    "symbol": "GLP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 11:44:10",
    "content": " Specifically, an integrated network of supply storage marketing and retail assets, which enable us to quickly adapt to changing market conditions, a diverse portfolio of products and services relied on by our customers and guests every day, skilled and dedicated employees and continued emphasis on data analytics, which enables us to effectively manage inventory levels and product mix to respond to changes in the demand environment for both wholesale and retail. The gasoline distribution contribution to product margin was up $28.6 million to $129.9 million, reflecting higher fuel margins and an increase in volume due in part to our recent acquisitions. Station operations product margin which includes convenience store and prepared food sales, sundries, and rental income contributed $69 million, up $7.9 million from the second quarter of 2021, reflecting an increase in activity in our convenience stores due in part to our recent acquisitions. Looking at the Wholesale segment, second quarter 2022 product margin was $90.6 million, up $57.1 million from the same period in 2021, primarily reflecting more favorable market conditions largely in distillates and gasoline Product margin from other oils and related products, which include distillates and residual oil increased $38.6 million to $51.9 million. Product margin from crude oil was negative $2.3 million in the second quarter, up from negative $3.3 million in the same quarter a year ago, primarily due to the expiration of a pipeline connection agreement in August of 2021. Turning to the Commercial segment, product margin increased $9.8 million in the second quarter to $12.5 million, largely due to our bunkering business, which continued to see strong volumes and margins in the quarter. Operating expenses increased $20.3 million to $108.5 million in the quarter, primarily in our GDSO segment including our recent acquisitions, due in part to increased credit card fees related to the increases in volume and price, higher salary expense, and higher rent expense. SG&A expenses increased $6.8 million to $60.8 million in the second quarter, primarily due to increased incentive comp and wages and benefits offset by a $6.6 million expense incurred in the second quarter for compensation and benefits resulting from the passing of our General Counsel. For the full year, we continue to expect maintenance CapEx of approximately $45 million to $55 million and expansion CapEx excluding acquisitions of approximately $50 million to $60 million in 2022, relating primarily to investments in our gasoline distribution business."
}