{
    "symbol": "GLP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 12:16:04",
    "content": " The gasoline distribution contribution to product margin was up $36.2 million to $155.9 million, primarily due to higher fuel margin and an increase in volumes sold, partially due to our recent acquisitions. Station operations, including station operations product margin, which includes convenience store and prepared food sales, sundries and rental income, rose $9.9 million to $67.2 million from the fourth quarter of 2021. For the full year, GDSO product margin was up $209 million to $856.6 million, with fuel margins increasing $0.09 per gallon to $0.36 from $0.27 per gallon in the year-earlier period. Gasoline Distribution contributed $588.7 million of product margin for the full year, up $175 million from 2021. Station operations product margin was $267.9 million for the full year 2022, up $34 million from 2021. Looking at the Wholesale segment for the fourth quarter of 2022, product margin increased $38.1 million to $70.7 million. Product margin from other oils and related products, which include distillates and residual oil, was up $48.5 million to $59.4 million, primarily due to more favorable market conditions in distillates. Product margin from crude oil was negative $2.7 million for the fourth quarter, down $0.5 million from a year earlier. For the full year 2022, wholesale product margin increased $148.8 million to $287.7 million. Product margin from other oils and related products increased to $190.1 million for the full year, up $124.7 million from 2022 -- 2021, excuse me, primarily due to more favorable market conditions, largely in distillates. Gasoline and gasoline blendstock product margin increased $20.7 million to $107 million for the full year, primarily due to more favorable market conditions in gasoline during the second and third quarters of 2022. For the full year, Commercial segment product margin increased $25.4 million to $41 million. CapEx or the full year 2022 was $106.8 million, consisting of $54.4 million in maintenance CapEx, in line with our guidance of $45 million to $55 million; and expansion CapEx, excluding acquisitions of $52.4 million, in line with our guidance of $50 million to $60 million. For full year 2023, we expect maintenance capital expenditures in the range of $50 million to $60 million; and expansion capital expenditures, excluding acquisitions, in the range of $55 to $65 million, relating primarily to investments in our gasoline station business."
}