{
    "symbol": "GLP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 13:08:07",
    "content": "  Operator: Good day, everyone and welcome to the Global Partners First Quarter 2022 Financial Results Conference Call. Before we begin, let me remind everyone that today’s call will include forward-looking statements within the meaning of federal securities laws. These forward-looking statements are based on assumptions regarding market conditions, business cycles, demand for liquid LNG products and convenience store products, the utilization of our assets and facilities, the regulatory and permitting environment the forward looking product, pricing curve and other factors, which could influence our financial results. These statements involve significant risks and uncertainties, some of which are beyond the partnership’s control, including without limitation, the impact and duration of the COVID-19 pandemic, and its impact on our counterparties, our customers and our operations. Our recent acquisitions of Consumers Petroleum of Connecticut and Miller’s Neighborhood Market demonstrate our success in identifying, acquiring and integrating additional assets into our portfolio, generating synergies and adding to our scale. Please note that EBITDA, adjusted EBITDA and DCF include a $4.9 million net gain on the sale and disposition of assets for the first quarter of 2022. GDSO product margin, in Q1 2022 was $173 million up $42.6 million from the same period in 2021. NYMEX gasoline prices increased $0.96 per gallon during the three months ended March 31, 2022 versus an increase of $0.54 per gallon during the same period in 2021. Station operations product margin, which includes convenience store and prepared food sales, sundries, and rental income contribute $58.1 million up $7.9 million from the first quarter of 2021 an increased activity at our convenience stores. Looking at the Wholesale segment, first quarter 2022 product margin increased $16.6 million to $47.1 million, primarily reflecting more favorable market conditions in other oils and related products, offset by less favorable market conditions in gasoline and gasoline blendstocks. Product margins from other oils and related products, which include distillates and residual oil, increased $18.6 million to $53.1 million. Gasoline and gasoline blendstock product margin was negative $2.3 million in the first quarter, compared with positive $16.4 million in the same period last year. Product margin from crude oil was negative $3.7 million in the first quarter up 778,000 from a year earlier. We are pleased with the results of the Wholesale segment, which performed to our expectations despite the extreme commodity price volatility experience in the first quarter of 2022. We do expect that the current steep backwardation of the forward product pricing curve will increase the cost of carrying our hedged inventory and future periods, but should also contribute to continued strength and rack margins. Turning to the Commercial segment, product margin increased $3.9 million in the first quarter to $8.1 million led by our bunkering business, which had higher volumes and improved margins. Looking at expenses, operating expenses increased $18.7 million to $99.2 million for the first quarter driven by increases in our GDSO segment. Interest expense for the quarter was $21.5 million up from $20.4 million, partly due to higher average balances on our credit facilities from higher commodity prices and borrowings for our recent acquisitions. CapEx in the first quarter of 2021 was approximately $17.1 million consisting of $7.5 million of maintenance CapEx, and $9.6 million of expansion CapEx, the majority of which relates to our convenience stores. For full year 2022, we continue to expect maintenance CapEx in the range of $45 million to $55 million and expansion CapEx excluding acquisitions in the range of $50 million to $60 million. We continue to manage our balance sheet prudently, leverage which is defined in our credit agreement as funded debt-to-EBITDA was approximately 3.3 times at the end of the first quarter. As of March 31, 2022, total borrowings outstanding under the credit agreement were $606.6 million. We continue to identify new opportunities to further drive value through our integrated network and strategically located assets and enhanced efficiencies, increased returns to unitholders, and deliver an outstanding experience for our customers and guests. Yes, I mean, I think, we as on a whole, we haven’t been materially impacted by inflation as of yet. We’ve seen some obviously wage inflation and you’ll see that in our operating expenses line, that’s somewhat stabilized this quarter. It’s hard to find people in our retail side, our HR team is doing a good job on it, but it still continues to be a tough environment to find people. I mean, what I would say is demand, if we’re talking about gasoline demand is still off from 2019, but it is interesting. I think, this holds true for both topics that you’re identifying. When you look at how many people are going into the office still, it’s not you look at the studies, it’s still 40%, in the markets that we’re in, that’s all publicly available documents that you can see. So driving is different times are different where they’re going, where consumers are driving is different. Good morning Selman, it’s Mark. And that’s the, those are the two key things that are really driving the quarter in other oils. Just a question on the M&A environment, maybe you could talk a little bit about what you’re seeing. Hi Gregg it’s Eric, I do think information and scale is important. And because people were very unsure of volumes in market and what was going to come back, and I just think the opportunity that we’ve identified and that we have historically executed on continues to be available. And I think as a market as “settled down” from COVID certainly there are other issues here today, but I think, those opportunities are just going to present themselves and continue to be there. And just to add to Eric’s comments, I mean, I think what we’ve seen from sort of smaller players in the industry is, as we’ve seen operating expenses increase throughout, from equipment to insurance, to salaries everything, if you don’t have scale, you’re definitely have more effective those operating expense increased on your bottom line. But if you’re a smaller player, it definitely puts pressure on you. I think coming back to the question someone’s asking you about, you see any impact in your business from higher prices and you pointed out that’s, it’s pre-COVID levels. Or just, it’s more on the margin, like obviously prices have been going up since February, I mean down. I think he was talking about fuel volume by and large, but we are also, we are seeing sales are good, margins good in the store. We have, we’ve got a lot of talented resources that help run those stores or do run those stores every day. We’ve become, we’ve got some price optimization tools that are disposal that are helping, make those decisions more efficient and more quickly for us. And then we’ve added some, lines to the business. So, we have a lot of initiatives that are going on, that are contributing to the success that we’re seeing in the stores. And so while yeah, it’s been a tough environment, we’re certainly there are some supply chain issues. We’ve been very diligent around substituting items, when we have manufacture outages. So net-net, I think we’re in a pretty good spot. And then just last one, you touched on the wholesale outperformance and you said there’s good demand in our resilient bunker group. I didn’t hear the tail end of that, Gregg. So is 1Q repeatable for wholesale is really the question based on the dynamics with commodities that are…\n I don’t know we don’t, it’s hard to look at it that way because every day’s a little bit different, certainly every quarter’s a little bit different. These markets are just a little bit different than, what we – we’ve dealt with backward markets before we’ve dealt with tight markets before. I will say, we’ve not at least in my long time here; we haven’t dealt with this degree of backwardation. But you just manage a business a little bit differently, and I think we’ve done a good job with that. We’re looking at every deal we do, we’re looking to scrutinizing every deal we do. It gets a little painstaking, but that’s how you got to operate in this environment. And if you work hard enough and if you pay close enough attention, you will find opportunities that being said, it’s you have to be able to execute on those. And it’s not automatic, but it is, it does, I think if you have a team that is experienced and is looking at it the right way, you have a shot. And so I’m not sure if we can say, yes, I expect Q2 to look like Q1. I mean, they don’t look, alike anyway in normal time. So, it’s going to be, we’re going to have to just operate a little bit differently for the foreseeable future, whether that’s the balance of the year, if you think about two years ago, or yes two years ago we had super contango. So, we’re always trying to adjust according, based on the conditions. And I think, we’ll just continue to work as hard as we can to grab those opportunities and mitigate the risk. I know it’s a tough one to straight line in any direction, but appreciate it. Ladies and gentlemen, this does conclude today’s teleconference."
}