{
    "symbol": "BMO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-30 09:41:06",
    "content": " Robust loan growth and margin expansion drove record revenue and over 15% pre-provision pretax earnings growth in both Canadian and U.S. P&C more than offsetting lower revenue in capital markets, which was impacted by more challenging market conditions. The result can be seen in the consistently strong performance of our P&C businesses, with peer leading year-to-date PPPT growth of 15% in Canada and 11% in the US, fueling ongoing strategic investments and positive operating leverage. Investments in our high-return North American Wealth businesses delivered good underlying revenue growth despite market declines and a moderation of client trading activity with growth in net new client assets, loans and deposits. Adjusting items are shown on Slide 41 and include the impact of fair value management activities related to the acquisition of Bank of the West, which this quarter reduced net income by $694 million, due to changes in interest rates compared with the prior quarter end. Performance in our P&C businesses was very strong with adjusted year-over-year pre-provision, pre-tax earnings growth of 15% in Canada and 16% in the US, as continued strong loan growth and margin expansion helped grow revenues at double-digits. Net income was $446 million, down 1% from the prior year due to a higher provision for credit losses on performing loans. Traditional wealth net income was $264 million, with underlying revenue growth of 3% excluding the impact of divestitures, reflecting higher net interest income, partially offset by weaker global markets. Provision for credit losses on performing loans was $32 million this quarter, reflecting a deteriorating economic outlook relative to the prior quarter and strong portfolio growth. Our Capital Markets business had excellent impaired loan credit performance this quarter with a net recovery of $22 million, driven by zero new formations this quarter and some modest recoveries. Our percentage of investment-grade rated borrowers now stands at 62%, more than 10 percentage points higher than what we saw in fiscal 2017, highlighting that more recent origination has been of a higher average credit quality, notwithstanding our very good loan growth in both Canada and the US over that time period."
}