{
    "symbol": "BMO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-03-01 11:07:06",
    "content": " Results were driven by strong performance in Canadian and U.S. P&C, including double-digit commercial loan growth on both sides of the border, continued strength in BMO Capital Markets as well as good underlying performance in wealth management. We are executing well on our strategic plan and the targeted investments we are making across our businesses in sales capacity, in marketing and an award winning digital capabilities are contributing to our stronger revenue growth, up 12% this quarter. BMO Capital Markets had record PPPT of over $900 million, up 30% from a strong quarter last year, demonstrating the diversification and strength of our North American platform. Business and government loans increased 8% year-over-year and 6% quarter-over-quarter, excluding the impact of the continued wind down of our non-Canadian energy portfolio and deconsolidation of our customer securitization vehicle, reflecting strong commercial loan growth in our P&C businesses. Turning to Slide 16, net interest income was up 11% from last year and up 10% on an ex-trading basis, primarily driven by balanced growth in our P&C and wealth businesses. Quarter-over-quarter expense growth of 3% was driven by higher employee-related costs due to stock-based compensation for employees eligible to retire and seasonality of benefits that is recognized in the first quarter each year, which together added approximately $235 million this quarter. Combined with the expansion of sales roles, including mortgage specialists, financial planners and personal and commercial bankers, these investments are leading to market share gains across key relationship products, strong revenue growth, averaging 13% over the last four quarters and efficiency that is now below the peer average. Our capital position continued to strengthen with a common equity Tier 1 ratio of 14.1%, up 40 basis points from the prior quarter, reflecting strong internal capital generation, the sale of our EMEA asset management business and the impact of actions related to the management of fair value changes that I mentioned. Wealth Management net income was $316 million down from $344 million last year, reflecting the impact of divestitures, which reduced net income growth by 3% as well as lower insurance income. Traditional wealth net income was $262 million, with good underlying revenue growth of 12%, including strong organic growth in client assets, offset by the impact of divestitures."
}