{
    "symbol": "BMO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-01 10:03:03",
    "content": " Investments we've made in our flagship North American Personal and Commercial Business Banking businesses, together with the benefit from rising interest rates, drove strong revenue growth that more than offset lower results in our market-sensitive businesses. Adjusted EPS was $3.04, and net income was $2.1 billion, down from $2.2 billion last year, as pre-provision pretax earnings growth of 7% was more than offset by higher provision for credit losses, compared with a recovery in the fourth quarter of last year. Performance in our P&C businesses continued to be very strong with year-over-year pre-provision pretax earnings growth of 13% in Canada and 33% in the US, as continued strong loan growth and margin expansion helped grow revenues at double digits. Total revenue was up 7% year-over-year, reflecting strong growth in net interest income, partially offset by lower fee income and securities gains as well as the impact of divestitures. On a constant currency basis, business and government loans increased 17% from the prior year, with strong growth across all operating groups. Net interest income was up 18% and up 27% on an ex-trading basis from last year and up 7% quarter-over-quarter, driven by strong balance sheet growth and margin expansion. Net interest margin ex-trading was up 20 basis points from last year and 3 basis points from last quarter, due to higher rate environment, partly offset by growth in lower-yielding assets. A 100 basis point rate shock is expected to benefit net interest income by $499 million over the next 12 months, including the impact of higher capital base pre Bank of the West closing. Excluding the benefit from fair value changes related to the Bank of the West transaction, net of the legal provision, the CET1 ratio increased 37 basis points from the combined impact of strong internal capital generation and common shares issued under the DRIP, partially offset by growth in risk-weighted assets. BMO Capital Markets net income was $363 million, compared to $536 million in the prior year, reflecting the impact of the ongoing weakness in the market environment, but up 35% quarter-over-quarter. We expect loan and customer deposit growth in the mid- to high single-digits on a year-over-year basis, and total bank NIM ex trading to expand during the year as interest rates continue to rise. The provision for credit losses on performing loans was $34 million this quarter, reflecting the weaker economic outlook and portfolio growth, largely offset by continued reduction in pandemic uncertainty and portfolio credit improvement, including the benefit of risk transfer transactions this quarter. And I think that correspond would probably -- we had very strong loan growth this year, very strong in terms of client acquisition as well as large increases in some of our businesses that are revolving."
}