{
    "symbol": "HLLY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 01:07:08",
    "content": " On the call with me today are Tom Tomlinson, Chief Executive Officer; Dominic Bardos, Chief Financial Officer; and Vinny Nimmagadda, Executive Vice President of Corporate Development and New Ventures of Holley. After their prepared remarks, we will open the call for questions. This call may contain certain forward-looking statements that are subject to significant risks and uncertainties, including the future operating and financial performance of the company. Although the company believes the expectations reflected in its forward-looking statements are reasonable, they can give no assurance that such expectations or any of its forward-looking statements will prove to be correct, and actual results may differ materially. Important risk factors that could cause actual results to differ materially from those reflected in the forward-looking statements are included in the companyâ\u0080\u0099s recent 10-Q, S4 and S1 filings with the Securities and Exchange Commission. Additionally, we will be discussing certain non-GAAP financial measures A reconciliation of these items to U.S. GAAP are included in todayâ\u0080\u0099s press release, which is also posted on our Investor Relations website. At this time, Iâ\u0080\u0099d like to turn the call over to Tom Tomlinson, Holleyâ\u0080\u0099s Chief Executive Officer. Good morning, everyone, and thanks for joining us today. As we stated in our earlier pre-announcement and our press release this morning, our results for the second quarter fell short of expectations. Iâ\u0080\u0099d like to jump right into providing some color around the shortfall in the quarter, which was driven primarily by supply chain disruptions, reseller destocking and softer consumer demand in certain categories. Typically, we see the highest overall demand for our products in the second quarter, and we placed heavier orders from our suppliers in anticipation of receiving the necessary goods in time to fill this demand. In the second quarter of 2022, our receipt of goods from global suppliers fell well below our expectations, with many of these expected receipts having now shifted to the back half of the year. We believe this was driven by an overall slowdown in our supply chain, which began with COVID-related plant shutdowns and port closures in China, further exacerbated by slower-than-expected movement of goods throughout the balance of our supply chain. We have suppliers that have been reliable for many years, and we provide them with long-term forecasts and purchase orders within their quoted lead times. In previous quarters, we have successfully been able to source the chips we needed from these historically reliable suppliers. During periods where demand exceeded the forecasts and purchase orders we provided to these suppliers, we have been able to secure the additional chips needed in the secondary market. In the second quarter of this year, these suppliers progressively began decommitting on previously confirmed purchase order ship dates at a rate that affected our ability to continue regular production of these products. And while we were able to secure some needed chips in the secondary market, it became clear that demand had exceeded supply, and we were unable to ultimately secure enough usable chips to satisfy the demand we have for these products. We continue to work diligently to source these microchips, but we now believe that global constraints could continue to be challenging through 2023. As a result of these supply chain disruptions, we navigated our busiest sales period in the year with an inadequate supply of hundreds of our best-selling products. Given our policies and supply chain constraints that have existed over the last few years, we believe reseller inventory levels are currently low, and their ability to continue to reduce their inventory is limited. Finally, I would like to discuss electronic tuning, a category where we believe we are seeing some reduction in consumer demand. We believe this decline in demand is primarily the result of lower new vehicle production levels, which, in turn, has resulted in a reduction in used vehicle transactions as well. The above factors notwithstanding, we continue to believe that overall consumer demand for our products is solid. Looking to the balance of 2022, we expect our receipt of goods from global suppliers to accelerate, and the team is committed to managing our other supply chain challenges as effectively as possible. We are also very focused on opportunities to improve our short-term performance while continuing to pursue actions that will drive long-term growth, developing innovative and exciting new products for our enthusiast consumers and engaging with them through digital media and in-person at our events, where weâ\u0080\u0099ve seen double-digit growth and we are also continuing to execute our M&A strategy. As Tom mentioned in prior calls, we believe acquisitions are a key strategic pillar to drive growth at Holley. During the second quarter, we completed the acquisition of RaceQuip, a well-known brand in the safety equipment market. Although relatively small in size, this acquisition helps us expand into a broader base of entry level enthusiast consumers with products priced right for the value proposition that we deliver. As a part of our acquisition philosophy, we are focused on attractive companies that will allow Holley to expand share in current markets, enter new product categories, increase our DTC scale and ultimately drive shareholder value. Should the elevated economic uncertainties lead to additional attractive opportunities coming to market, our team stands ready to capitalize as well as engage with business owners seeking Holley as a disciplined steward for their business. Holley LS Fest Events is a brand, truly are a destination for enthusiasts and these events will continue to be a key pillar of our consumer engagement strategy. To add some specific color, in its first year, LS Fest Texas achieved attendance greater than our LS Fest East event had achieved in its sixth year. Not only do these events help us learn more about our customers, each event serves as an opportunity to understand and learn more about the products that are resonating with the broader enthusiast community. Holley held its second Holley High Voltage event this past quarter, enabling us to engage deeper with the EV enthusiast community. Lastly, as we discussed in the first quarterâ\u0080\u0099s call, we met our second quarter milestone for the Simpson integration and are meaningfully accelerating the integration of more recent acquisitions to realize value within the year. With that overview, Iâ\u0080\u0099d now like to hand the call over to Dominic, who will discuss our second quarter financial results in greater detail. Holley delivered net sales of $179.4 million in the second quarter, a decrease from $193 million, or a 7.1% decrease from the second quarter of 2021. While we typically donâ\u0080\u0099t disclose monthly pacing of results, we believe it is helpful color to illustrate how sales trends changed throughout the quarter. When we finished April, our year-to-date net sales growth was 15%, still on par with the higher end of our annual guidance. At the end of May, our year-to-date net sales growth had fallen to 11% over the prior year, but still within the range of annual guidance. But by the time we finished the quarter in June, our year to net sales growth compared to 2021 has fallen to 7.4%, as reported this morning. The decline in sales performance, particularly in our 5-week month of June, directly correlates to the factors Tom discussed earlier. Total selling, general and administrative expenses increased 38.5% in the second quarter. The large increase in SG&A is a continuation of increased costs related to equity compensation, public company expenses, acquisitions and investments for growth. Additional cost drivers include an increase in non-cash expense directly related to equity awards; increased administrative and sales personnel costs, reflecting company and additional requirements of becoming a public company; and an increase in outbound shipping costs related to domestic supply chain pressures. On an adjusted basis, net income was $13.2 million versus $23.1 million in the second quarter of 2021. Adjusted EBITDA decreased to $37.2 million in the second quarter, down from $54.1 million in the second quarter of 2021. As we stated in our pre-announcement and earnings press release this morning, we have lowered our guidance that we originally established at the beginning of the fiscal year. We also adjusted our interest expense expectations to be in the range of $33 million to $35 million, while we are maintaining our CapEx and depreciation and amortization guidance, which are between $14 million to $16 million and $24 million to $26 million, respectively. First, I would like to thank Tom, my leadership teammates and the Holley Board of Directors for the opportunity to serve and be a part of this exciting chapter of Holleyâ\u0080\u0099s corporate life. Second, I would like to emphasize that my decision to leave is purely for personal and family reasons. In the meantime, I will do everything I can to ensure a smooth transition during the next 2 months. As a reminder, we ask that you please limit yourself to one question, with one related follow-up as needed. I guess, first question just to kind of get it out of the way. In terms of demand dimensions on the tuning side, you are seeing a lack of new and used auto availability as being a big driver of that. Well, I mean, from our perspective, with new vehicle production being down, consumers are just buying fewer new vehicles. And again, as we talked about in the prepared remarks, consumers generally purchase tuning devices when they purchase a brand new vehicle or a new-to-them used vehicle. So based on the visibility we have today, we think that thatâ\u0080\u0099s the primary driver of what we are seeing there on the tuning side. I would have to say that we have shaped our policies around this over the years to minimize the impact and to minimize â\u0080\u0093 well, to minimize the impact on the business, to minimize their inventory. And I mean, when I look back to prior periods, I mean, think those strategies, those policies are working well. And I think while the impact was still significant to us in the quarter, it was much lower than we have seen historically. Please proceed with your question. It sounds like there were maybe four separate things that drove the shortfall relative to expectations, but broader supply chain issues, the availability of key inputs, the destocking and the softening demand. We are not prepared to give precise information in terms of the dollar magnitude of the miss, but we know that, as Tom mentioned in his prepared remarks, when we started the quarter and where we ended the quarter, we had hundreds of our most popular products out of stock. So supply chain, we believe was the most significant impact. And as we kind of went through the prepared remarks, itâ\u0080\u0099s in that descending order of magnitude. When you look at our past-due orders, as Dominic just mentioned and Iâ\u0080\u0099ve talked about, they are â\u0080\u0093 they have remained elevated. And at the end of the quarter, these past-due orders were more than 3x the net sales decline from the prior year. Just, to me, thatâ\u0080\u0099s kind of the somewhat responsive in a bit of a quantified way to your question. So, we â\u0080\u0093 I mean the channels do have some different dynamics and â\u0080\u0093 but they also tend to carry different inventory levels. Interestingly, kind of the traditional retailers had done some destocking last year in this quarter. And so their destocking was probably the lowest and I am going purely by memory here, but as I recall, our top channels, which would be e-tailers, including our DTC and then well, we can exclude DTC for this part of the discussion because we are talking about channel inventory, but â\u0080\u0093 so e-tailers and warehouse distributors was where we saw the largest destocking in the quarter. So, that makes the most sense that they are the ones that would have the highest level of destocking. Please proceed with your question. Like does that mean we have to kind of see a permanent reduction in sales for the next 1.5 years, or I guess, how should we think about that impacting you guys? I mean I guess the first thing I would say, if there was 1.5 years reduction, it wouldnâ\u0080\u0099t be permanent. And we have â\u0080\u0093 we are blessed with a very broad portfolio, and we have other products that we can focus on in the meantime and promote. And so â\u0080\u0093 but having said that, the team is working diligently, and if there is â\u0080\u0093 to secure these microchips, if there is a silver lining here, we do have now open dialogue with some of these top chip manufacturers. Historically, we have acquired these chips entirely through their resellers through their distributors. So, I mean I think we have to look at all these expected receipts that we have today as tentative, but it is hopeful. And we have actually been able to get some dates as a result of this dialogue directly with the chip manufacturers, and really, as a result of the teamâ\u0080\u0099s just tremendous efforts in this area. So, we have products in our electronic fuel injection product line that use automotive-grade microchips. Overall, that is a large category, but not all of the products in that category use those microchips. One other thing, if I may add, Tom, is we have talked about this in the recent quarters that, that category has been driving outpaced growth for us. Please proceed with your question. I want to go back to kind of the commentary around retailer destocking, totally understand the commentary that they are positioning for the macro that we are seeing. So, we look at it as fear-based or maybe an emotional reaction to the bad economic news. And what we saw on our DTC side, DTC charged right on through with high rates of growth, and resellers pulled back dramatically. So, I mean I am not suggesting that, thatâ\u0080\u0099s going to happen this time. But we do think that there is far more demand there than is visible in our numbers, hence my comment that we believe the demand for our products is solid. But another thing I would point, I mean we talked about DTC up 7%. So, far this year, our consumer events are well into the double-digit up category or range. And just one follow-up, going back to the performance by category, totally understand that trading is impacted by new vehicle availability. And so even though this is a category that shows up as being â\u0080\u0093 having lower demand at this point in time, it is the category that historically has had very, very high demand, and itâ\u0080\u0099s also one of our highest margin categories. Please proceed with your question. So, the change â\u0080\u0093 really, the issues that we talked about from a supply standpoint, the supply chain slowed down for the reasons we discussed, and we did not receive the goods we expected to receive in the quarter. In terms of the destock, sorry, the de-committing, we turned to the secondary market, which is something that we have historically done. We are just hoping, as we talked about earlier, that the effort that we have put into the dialogues with the chip manufacturers results in allocations and allows us to begin to resume production of these products. And then I just wanted to ask, follow-up a little bit on sort of how much of the sort of demand versus supply. Is the â\u0080\u0093 it seems like the slower demand is in electric tuning due to the vehicle availability, but also those are the ones that require chips. So, is it â\u0080\u0093 you are seeing slower demand, maybe give us another way to sort of characterize the demand you are seeing. We â\u0080\u0093 our backlog, sorry, I want to talk specifically about our past dues. And we need to see the container receipts for the goods that we ordered and expected to receive, but from our perspective, again, the demand is there. And I mean look, these supply chain issues are frustrating to all of us, and the team is just working diligently to do everything humanly possible to see those goods arrive. So, there will be time required to manufacture the products we sell to our consumers. In other cases, this would be a product that we have designed, that we sourced complete, and that goes on the shelf and is ready to ship to consumers upon arrival â\u0080\u0093 consumers and resellers upon arrival. Please proceed with your question. Tom, would you just talk about â\u0080\u0093 I believe in the first quarter and I donâ\u0080\u0099t know if you can give a little deeper dive here. Number one, I believe the electronic category was about $80 million out of $200 million in the first quarter. Well, I mean, from a qualitative standpoint, the impact on the tuning business from the potential demand issues we discussed is smaller than the impact of the microchips. And I would assume that â\u0080\u0093 and of that comp decline, I assume itâ\u0080\u0099s all one business now. So, one of the things I think we should probably clarify, John, is that automotive-grade chips that are engineered to withstand higher temperatures and the rigors of being under the hood, those impact products like our fuel injection system that has to have an ignition systems. Many of our tuning products need semiconductor chips, but they are not the same quality because they are actually in the car itself, and they are used to monitor or they can be used to tune. So, there are differences in the chips of electronic products that we have. So, we are monitoring, basically, the inflow of containers with these products. And then obviously, we see that again when they are â\u0080\u0093 when a receiving report has entered into the system. And I mean, frankly, if we do better than expected, it gives us some upside. If we donâ\u0080\u0099t do as well as expected, it gives us some downside. Please proceed with your question. So, we have historically, for the last several years, done a midyear price increase as our regular annual price increase. So, it was a little bit less in the quarter, but it was a positive contribution to the sales. We are not at 5x, our net debt is probably around $610 million to $615 million, with $30 million of cash on the balance sheet with our long-term debt. Right now, at the end of the quarter, it was below 4x. So, from a leverage standpoint, yes, we are certainly going to look at everything going forward from a capital allocation standpoint. There are other ways that we can look at being creative, and we are certainly going to look at accretive opportunities for long-term growth. We are focused on the long-term for driving shareholder value, and M&A is a part of that. As Vinny mentioned in his prepared remarks, our pipeline is very focused on things that fit our strategic bill of health, and we will find the right ways to do that. And then I would just add that we just all need to keep in mind here, our comp, the second quarter of 2021 here, was a 54% up quarter."
}