{
    "symbol": "IAG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 12:22:04",
    "content": " Following this on February 23rd we announced that certain inflationary and other cost pressures had been identified impacting Earthworks, electrical and instrumentation components, operation spare parts, key consumables, and other indirect costs resulting in projected remaining cost to completion at that time to trend upwards above the high-end of the previous estimate range of 710 million to 760 million and the timing of cost to potentially vary. Based on the ongoing analysis, assessment, and preliminary information available to date including provisions for certain commodities escalation and contingencies, the company currently estimates that the remaining project cost to completion at April 1, 2022 could be between approximately 1.2 billion to 1.3 billion net of leases and with a preliminary increase in project costs estimated at an FX rate of 1.25. As part of this work, a study by an independent capital project management service company estimated direct and indirect COVID related impacts to the project to be in the range of approximately $150 million to $300 million on a 70% basis at an exchange rate of 1.3. We do caution that potential further disruptions including caused by COVID-19, the Ukraine war, weather, potential labor disruptions, and the tight labor market could continue to impact the timing of activities, availability of workforce, productivity, and supply chain and logistics and consequently could further impact the timing of actual commercial production, and consequently project costs. We note that the results of the ongoing re-estimation work will also include a reanalysis of the project ramp up assumptions and other project metrics, including operating costs which we expect will increase based on headcount assumptions, and to better capture the current pricing environment for consumables and increased labor rates. Okay, thank you very much. Okay, thank you very much."
}