{
    "symbol": "HMC",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-05 20:08:09",
    "content": " Despite the impact of semiconductor supply shortage and increase in raw material costs due to positive effects of unit sales increase, cost reduction and currency, operating profit increased JPY 272.9 billion to JPY 442.1 billion. Sales revenues due to lower sales in Automobile operations declined from second quarter last year to JPY 3,404.3 billion. Operating profit was, due to reduce profit from a lower sales revenues and model mix, JPY 198.9 billion and our equity and earnings of affiliates was due to reduce profit in China, it was JPY 51.3 billion. Operating profit was, even though there was an increase due to currency effect due to decrease sales revenue and model mix leading to lower profit, it was JPY 198.9 billion, down by JPY 83.9 billion versus same period last year. Next going to operating profit from Automobile operations and operating profit related to Automobile sales included in financial services operations is expected at JPY 127.7 billion, added together. Operating profit was, due to sales change and model mix impact increased as well as currency effect JPY 442.1 billion, which was JPY 272.9 billion, up from the same period last year. Next, the free cash flow for the non-financial services operations for the first half of the fiscal year was minus JPY 18.7 billion, and the balance of cash and cash equivalents at the end of second quarter was JPY 2,310.6 billion. To explain the factors affecting the forecast, pre-tax profit is expected at JPY 860 billion, down JPY 54 billion compared to last fiscal year. For operating profit, there have been a positive effect from currency effects, sales revenues, and model mix but this was offset by surging raw material prices and differences from amount posted as provision for credit losses, and other SGA expenses increase so that the operating profit is expected to be flat as last fiscal year. Equity earnings of affiliates was, because in the previous fiscal year, we had posted a temporary one-off impact of JPY 56.8 billion due to  of three affiliates. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much."
}