{
    "symbol": "CNTY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 16:20:38",
    "content": " I would now like to introduce our host for today's call, Mr. Peter Hoetzinger. Good morning, everyone, and thank you for joining our earnings call. With me on the call are; my co-CEO and the Chairman of Century Casinos, Erwin Haitzmann; as well as our Chief Financial Officer, Margaret Stapleton. As always, before we begin, we would like to remind you that we will be discussing forward-looking information, which involves a number of risks and uncertainties that may cause actual results to differ materially from our forward-looking statements. The company undertakes no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise. We provide a detailed discussion of the various risk factors in our SEC filings, and we encourage you to review this filings. In addition, throughout our call, we refer to several non-GAAP financial measures, including, but not limited to, adjusted EBITDA. Revenues were up by more than 42% year-over-year, and EBITDA growing impressive 62% compared to the first quarter of last year. Earnings per share for the quarter were impacted by our loss on the sale of land and building in Calgary, as well as by costs related to the acquisition of the market in Nevada returned a combined impact of approximately $3.3 million or $0.11 per share. In addition, our effective income tax rate increased from 22.6% last year to 34.6% this year, due to the total earnings we project for this year. Our revenue growth was broad based, as each of our three operating segments posted new first quarter revenue records. Sequentially, we managed to keep the high margins the same in the first quarter. Compared to pre-COVID times, meaning the first quarter of 2019 we are well ahead, we actually increased the margin by 800 basis points. Marketing spend continues to remain significantly below pre-COVID levels, and is expected to continue at its current run rate moving forward. Reductions in advertising, direct mail and promotional expense appear to be sustainable, and have not had any negative impact on gaming volumes. I would call it disciplined and rational for the most part, not much has changed for the last several quarters. Other factors impacting margins include labor, food cost, and utilities. And while labor is tight in some markets, it's been able to maintain our high standards of guest experience. In spite of some macroeconomic chain challenges, we have not noticed any meaningful shift in consumer behavior as we look at April and even in May. Looking ahead, we had impact from stimulus payments in April, May of last year making second quarter year-over-year comparison challenging for the U.S. operations. Our business is largely gaming centric, only a minority of our revenue is coming from non-gaming amenities and will only open more non-gaming amenities by expanding the opening hours, as demand picks up further so that it grows in a profitable way. We have high confidence in the underlying trends of our consumers behavior, which has not changed since we reopened two years ago. Our U.S. operations in Colorado, Missouri, and West Virginia grew revenues by 1% on a combined basis. Market-by-market, we saw revenue and EBITDA growth in Colorado as well as in West Virginia. While Missouri was a bit softer in the year-over-year comparison, due to the impact of the government stimulus payments of last year. In February, business got much stronger, as the case counts went down and mass mandates came off. While Missouri couldn't quite achieve last year's results, again, which were driven by the stimulus payments. Win per customer has remained relatively flat to prior year, which has been a positive sign. The main difference is that we saw a significant increase in upgraded play during the prior year, as patrons were not our typical customers came to the property to spend stimulus checks. In Canada, we operated with the new restrictions for half of the first quarter. Our guests needed to provide proof of vaccination, everybody was required to wear a mask, and casinos were not allowed to serve liquor after 11:00 PM. These restrictions were lifted at the end of February, resulting in an overall reasonably strong quarter for Canada. Going forward, however, we can't expect more from Canada, we look forward to the next quarter without restrictions. Our results in Poland are consistently strong, and that is continuing into April and early May. It has its own corporate and operations staff in Poland, and also that does not need any CapEx from us. Quite the opposite, cash flowing from Poland to us. On April 1, we entered into a credit agreement with Goldman Sachs for a $350 million term loan and a $30 million revolving credit facility. So as of April 1, 2022 after giving effect to the Goldman Credit agreement, we had $372 million in outstanding debt, and approximately $88 million in cash and cash equivalents resulting in net debt of $284 million. But please note, net cash and cash equivalent amount does not include the $100 million were in escrow to fund the Nugget OpCo acquisition. Our strong cash flow generation is driven by our strong operational performance by our efficient CapEx spending programs at our properties and by favorable regulatory regimes in West Virginia, Alberta, Canada, where the state or province pays for us. In Missouri, we developed a 75 room hotel at our Great Cape Girardeau property that will transform that facility to a full resort destination with gaming, beverage, bars and dining venues, as well as conference, concert and event spaces. In Nevada, we already invested $95 million and now own half of the Nugget casinos real estate. That will cost another $100 million, which we've put in escrow already as mentioned. With the Nugget, we purchased an existing operation with long operating history. The Nugget is in a great location directly on I-80, the property gets an exposure that is unparalleled in the Reno Sparks market. With 110,000 square feet, the Nugget has one of the largest convention facilities in the market and with 1,382 rooms, it can support large conventions. The previous owner, the Marnell companies have invested more than $90 million since 2016. Upgrading all hotel rooms, most public areas aided a top notch steakhouse upgraded or replaced  were necessary and right size the operation. Therefore, we do not expect any extraordinary replacement CapEx in the next years. The Nugget gaming floor provides the most promising opportunity for improvement and growth, we can renew and improve the slot mix, further improve the traffic flow and increase the square footage of the gaming floor. Also, the acquisition offers great potential for synergy effects as we integrate that standalone property into our portfolio of 17 casinos. In terms of the broader market dynamics, there is substantial economic growth in the Reno Sparks region. The population growth is outpacing the National average and the personal income per capita is expected to grow further, with a CAGR of about 4%. The Nugget transaction will significantly increase our scale, our revenue is expected to grow by over 25%. With these opportunities for growth throughout next year and beyond, we're confident our company is very well positioned for continued long-term success. In conclusion, the first quarter was another great performance of our company and the entire team. Our diversified portfolio continues to generate robust EBITDA growth, and our operating strategy and tight focus on the right customer are producing strong and sustainable margins. The higher end of the database, the truly gaming centric customers continue to perform extremely well. Also, our older customers started to visit again in bigger numbers once the Omicron and COVID counts started to drop mid-quarter. With that discipline and our strong balance sheet, we're confident to find further opportunities to deploy capital in a manner that consistently build shareholder value. On behalf of the company's management and board, I'd like to thank our team members, our guests, and our stockholders for their continued loyalty and enthusiasm as we manage our businesses during these challenging times. You may proceed with your question. I don't think that we can discuss it at this point in time, right. So I guess my next would be, obviously the macro. We're seeing some of that, first of all, the M&A environment is more active than it was last year. And yes, I mean, it's all vary depending on the market and the circumstance, but I don't want to say prices are coming down at all. You may proceed with your question. I recall a couple years ago now when oil prices were falling, it had a pretty negative impact on some of your Canadian properties. First of all, we see as -- before that Canada is really on a very healthy recovery track and we're more or less back at pre-COVID levels. But and we think that will be the next in the coming quarters, which will show the full impact of the recovery. Now, In China in terms it can only be positive if the oil prices go up as far as Edmonton and Canadian oil operations are concerned. I think in the second quarter, we would be able to be more specific on that and have a better picture about that. You may proceed with your question. Hey, good morning, Peter, Erwin it's great to hear from you both. For my first question, I'd like to hang on, this macro theme that's been common throughout this earnings season. It sounds like on the whole, the consumer still feels pretty healthy into April and thus far into May. You talked about sequential improvement in the older demographic, you talked about continued healthy growth at the high end. Just moving to the third category, how's things trending kind of in that lower end of the database. So we've watched it very closely as well, same for the opposite interest, but we don't really see anything that would be deviant from what was said before. In the non-gaming sector, it is obviously really secondary. And in West Virginia as said in earlier times, post-COVID, we opened with significantly less SMP capacity. And it hasn't hurt us at all, on the customer side, that certainly has helped us a lot on the cost side. And what we have now is, is just right size and also as Peter mentioned before, we would expand the opening times for example on offer, we look very closely whether we think it's justified. Concerning the player base, I think you could say that in very general terms, we see that the upper end of our players tend to stay little longer, tend to come off and tend to spend a little more money. And maybe we have a few less customers on the lower end, something that we're not unhappy about because it really helps us on the staffing side and on the cost side for simple terms for less customers, we need less employees, and certainly helpful. If I can just squeeze in one more, I saw your commentary in the deck around upgrades to your marketing app. One upgrade that we did in West Virginia was that you can now open your hotel room with a mobile phone and you can also check in mobile and don't have to stand in line anymore, which is really helpful like on a Friday afternoon when all the people, or all our guests that are coming for the weekend in the past had to line up. You may proceed with your question. That syndication we have Yes, it's come back strongly and the bookings are good. And moving on, I want to touch on Poland for a second, it looks like demand remains strong. We had to increase salaries, because we hadn't done so in a long time. For a recording of the call, please visit the financial results section of our website at cnty.com."
}