{
    "symbol": "CNTY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 12:44:12",
    "content": "  Operator: Good day, everyone and welcome to today's Century Casinos' Third Quarter 2022 Earnings Call. Please note, today's call will be recorded. Good morning, everyone, and thank you for joining our earnings call. With me on the call are my Co-CEO and the Chairman of Century Casinos, Erwin Haitzmann; as well as our Chief Financial Officer, Margaret Stapleton. As always, before we begin, we would like to remind you that we will be discussing forward-looking information which involves several risks and uncertainties that may cause actual results to differ materially from our forward-looking statements. The company undertakes no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise. In addition, throughout our call, we refer to several non-GAAP financial measures, including, but not limited to, adjusted EBITDA. Reconciliations of our non-GAAP performance and liquidity measures to the appropriate GAAP measures can be found in our news release and SEC filing available in the Investors section of our website, at cnty.com. I will now provide an overview of the results of the third quarter, and after that there will be a Q&A session. Our third quarter results were up against the record performance of last year, which was sued by listed COVID restrictions and lots of pent-up demand. Compared to last year, revenue and adjusted EBITDA were down 4% and 15% respectively. Low water level issues at our Colorado, St. Missouri operation started in August and triggered additional expenses for  and caused serious issues for access the steepness of the access bridges and to transition from the barge to the old river boat. In addition, the dry weather kept farmers, which are a large part of our customer base, busy on the themes and farmland for much longer than usual. As a result, the  casinos revenues declined 14% compared to Q3 of last year, and that also was responsible for around half of the company-wide revenue decline during quarter. In addition, we incurred considerable costs in connection with preparing to integrate the soon to be our Nevada and Maryland operations. With the headwinds in the economy, we also saw some evidence of slight changes in our customer's behavior as the lower ADT  segment has cut down on the number of clips across all North American properties, but importantly spend portrayed from our mid and higher ADT segments head steady. That play from our core customers is the foundation of our success, and this segment in particular continues to grow. that also hates to offset year-over-year decline spent from retail customers, which was an elevated levels last year due to the stimulus payments. On the expense side of the business, our teams are effective in managing the overall cost structure while dealing with the inflationary pressures that exist today. Of our US operations, Colorado was leading the way with revenue growth of 8% and EBITDA growth of 6% compared to last year. However, we are affected on the expense side with higher costs for utilities, repair and maintenance, as well as operating supplies. This may be due to higher gas prices, however spend to trip has increased. The Cripple Creek market continues to remain flat year-over-year, but due to our consistency in marketing and continued emphasis on customer service, we continue to gain market share. Central City, average spent per trip remained flat and we are not seeing any inflationary effects on patron spending. In West Virginia, our Mountaineer Casino, Racetrack & Resort saw a slight revenue decline compared to Q3 of last year. The number of trips to the casino was down, especially for younger customers in the lower ADT  segment. Eventually however, looking at the last three quarters the trend is up, we grew from Q2 over Q1 and again Q3 over Q2 in both revenue and EBITDA. Moving to Missouri where volumes remained strong during July and early August, but began dropping off during the second half of the quarter. There it was especially to older demographics 70-plus and the lower ADT segment, which cut down on trips. Just last month in early October, we actually had to close the part of the casino that sits on the river boat and we operate with a limited number of slots and tables on the barge only. The good news for Caruthersville is the fact that we did receive approval from the Missouri Gaming Commission a couple of weeks ago to relocate the casino operation from the barge to an existing land-based pavilion, which is not affected by water levels and is protected by flood wall. We are allowed to operate the casino in that pavilion and build a new land-based hotel and casino development is complete, which we expect in the second half of 2024. We call it the Farmstead Hotel, which we bought last year and completely refurbished. In our global presentation of the results, you find a description as well as a site plan and pictures for better understanding, but a new land-based hotel and casino development in Caruthersville, construction began two weeks ago on the new 27,000 square feet casino and 30 room hotel. Once the new casino hotel will be completed, the temporary casino in the pavilion will move to the new casino and the new Century Casino Caruthersville we then have a total hotel room count of 74 rooms in two hotels, one directly connected to a casino, and the other one the standalone opposite the pavilion. At Century Casinos' Cape Girardeau, a large of our two Missouri casinos, we have started construction of a 69 room six story hotel building. This development will transform the property to a full destination, providing after reasons for individual and group multi day visits for many different purposes, such as gaming, dining, conferences, concerts and more. Moving north to Canada, the Central Casino Hotel in Edmonton had revenues declined by 7% due to construction works on the main road in front of the casino and due to lower slot hold. Results in Poland are consistently strong, which also helps the same process and has led to renewed interests from smaller European casino groups and private equity investors. Anyway, there's no time pressure on our side as we have an excellent management team in place at Casinos Poland, and there's no need for any CapEx or investment from us. Quick look at our balance sheet and liquidity shows that we have $100 million in cash and cash equivalent, plus the $100 million which we keep in escrow for the closing of the Nugget OpCo transaction once their license gets complete. Outstanding debt totalled $367 million, which includes $348 million under the Goldman Sachs Credit Agreement, of which a $100 million is escrow for the Nugget and $14 million related to a long term land lease for Century Downs in Canada. During the quarter, we were also very busy on the M&A front. In August, we announced the acquisition of the operations of Rocky Gap Casino Resort in Maryland for $56 million. Simultaneously, with simultaneously with the closing of that transaction, VICI Properties will require the real estate assets and will amend our masterpiece with VICI to add the Rocky Gap property. Rocky Gap is a full service resort, less than in a two hour drive from the Washington DC metro areas and includes an 18 hotel golf course designed by Jack Nicolas, a 5,000 square foot event center, several meeting spaces at spa and several outdoor activities. The property consists of about 25,000 square feet of gaming floor, 630 slot machines, 16 table games, 198 hotel rooms and five food and beverage venues. In Nevada, we already invested $95 million and now own half of the market casinos real estate. We will close on the purchase of a 100% of the operating company as soon as licensing is complete, but that'll cost another a $100 million. With the Nugget repurchase an existing operation with a long operating history, we do not expect any extraordinary replacement CapEx for the first year. With the pending Rocky Gap and market acquisitions, we will oversee the portfolio that reaches from East to West in North America and on a pro forma basis, after giving effect to the two acquisitions, we expect to generate approximately 95% of our EBITDA from our North American casinos. With these opportunities for growth throughout next year and beyond, we are confident our company is very well positioned for continued long-term success. We will continue to execute on our business plan by growing organically, by identifying and acquiring promising assets in stable drive to markets in the US. Now, M&A strategy, we will remain prudent with pricing and valuation, will continue to dedicate resources to capture synergies and provide time to digest the acquisitions and recognize value. On behalf of the company's management and board, I'd like to thank our team members, our guests, and our stockholders for continued loyalty and their enthusiasm. Your line is open. Good morning, Peter, Irwin, thanks for taking our questions. That softening started in the third quarter and in the meantime for the fourth quarter, we are already doing things to try to mitigate. We have customers, but we clearly see that they're worth comps also in that in the upper range of the lower bracket. And also we are doing a car giveaway, something that we haven't done before, and indications are that this is very well received from the -- what we see from the October numbers. We have agreements with our contractors and developers that in terms of return Cape Girardeau hotel return between the low teams and Girardeau around 15, that's where we are, where we see it coming. Peter, you gave some context for how to think about the impact to revenues at the property. Your line is open. Thanks for taking my question. Yes, we do have a very good part in VICI, but let me also say that other property or real estate investors are also knocking on our doors. So there is we believe for the next two, three, four years a great deal of M&A activity ahead of us. Whether it be once a year or two every year, we look at it a little bit on an opportunity basis, but that's plenty of opportunity out there. Thanks for taking my question. So in Poland, in local currency, it actually looked like your margin was one of the best and maybe the last six or so years. We think they are sustainable and everything points to us being able to keep those numbers, and we also see potential to increase them further. So really we're really happy with the team and as we said, we think this can continue and go further up. And then turning to Canada, kind of a similar question, coming out of COVID, I guess margins were choppy, just kind of given, COVID reopening and then re-closing and reopening again. Some color, I would say in very general terms, we should be able to sustain the current margins and in various properties for good reason, be able to increase them. For example, in Missouri as we talked about the changes there and the improvements to the properties that should improve and increase our margins relatives to '22 back to old levels. In Colorado, probably it's we'll so to speak, margined out. We are doing very well already there, but I think again, we consider this to be very sustainable again. And just to follow-up on that, just to confirm, you historically have done low 30% EBITDA margin. Yeah, I think that's not unrealistic to assume. In Canada, one thing that works for us is that energy worker oil prices are high and with a certain time delay that always is then reflected in for this economy. Your line is open. Thanks for taking my question. So far also across the board, I think our management has been very skilful in findings ways through this by trying to find even further ways to save in other areas. But again, this don't go on forever and we were able to operate well even on say higher sell rate, but slightly lower staffing levels. And for the one in Caruthersville, we have not made the final position, but it'll be several like cash on hand and financing sources. Your line is open. I'd like you to identify the one, two, three critical variables that we should monitor for corporate earnings modeling in the fourth quarter and then going into next year. Yeah, I would say that the progress in this Missouri is an important one to watch as you've seen in Q3 or kind of an impact that has, then continued success in Colorado is very important. There is secondly on a great path as we said, and we would like to see that continuum. We have a handful of excellent research reports that are out there on CNTY , and I would encourage you to get a hold of one or more and read through. For a recording of the call, please visit the financial results section of our website at cnty.com. And if you have any follow-up questions, please feel free to reach out to us."
}