{
    "symbol": "CNTY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 12:40:24",
    "content": "  Operator: Good day, everyone, and welcome to the Century Casinos Q4 2022 Earnings Call. Please note, today's call will be recorded. Good morning, everyone, and thank you for joining our earnings call. With me on the call are my co-CEO and the Chairman of Century Casinos, Erwin Haitzmann; as well as our Chief Financial Officer, Margaret Stapleton. As always, we would like to remind you that we will be discussing forward-looking information, which involves several risks and uncertainties that may cause actual results to differ materially from our forward-looking statements. The company undertakes no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise. In addition, throughout our call, we refer to several non-GAAP financial measures, including, but not limited to, adjusted EBITDA. After that, there will be a Q&A session. For the year 2022, we had an all-time record with net operating revenues up 11% and adjusted EBITDA up 6% over 2021. That did cost us about $2 million in EBITDA compared to Q4 of '21 The dangerously low water levels required us to become creative and act quickly, and we did. With the approval of the Missouri Gaming Commission just before the Christmas holidays, we moved all operations to a temporary land-based building. We typically do not like to call out weather, but in addition to the issues we had in Caruthersville, severe storms and freezing temperatures in mid-December, it has quite an impact at our other properties as well that negatively impacted Q4 results. However, as the weather broke, demand returns, and we ended the quarter on a high note with strong performances, not only at Caruthersville, but across the entire portfolio between Christmas and New Year's, and that has continued into January and February. The regional gaming customer is showing little sign of slowing down, and many macro indicators such as unemployment and wage growth growing to a rather healthy environment. Outside of weather, we see underlying demand trends remaining solid heading into Q2 and Q3 of this year. On the expense side of the business, our teams are managing the overall cost structure while dealing with inflationary pressures that still exist. Wage inflation has largely normalized, but utility situation remains elevated. It is pretty disciplined, and we continue to envision a very rational marketing approach for all of us. In Colorado, we finished the year with flat revenues in the fourth quarter. But it turned around in December, and that positive trend continues into Q1 of this year, especially from the higher ADT segment. Our Mountaineer Casino, Racetrack and Resort had a difficult start to the quarter. The number of trips to the casino was down, especially midweek. We are still experiencing staffing challenges at Mountaineer, resulting in limitations to hours of operation and availability of hotel rooms. In Missouri, we saw more trips and revenue from all age groups, distance ranges and ADT segments across the database. I mentioned the dangerously low water level situation at Caruthersville already, but we also had a significant winter weather impact in December, being what is typically one of the biggest times of the year. Right after that, business rebounded strongly with an all-time record for daily call-in at our Cape Girardeau property on New Year's Eve. Currently, we are up around 3% compared to Q1 of last year at both of our Missouri properties. The new property will have a total of 74 hotel rooms; 12 gaming tables at over 600 slot machines, which is a 20% increase in gaming positions compared to the old riverboat. Most importantly, it will provide significant operational efficiencies. It will be much more convenient for our customers, and it will increase our catchment area. At Central Casino Cape Girardeau, the larger of our 2 Missouri casinos, construction of the 69 room 6-story hotel building is well on track for opening around this time of next year. That development will transform the property to a full resort destination offering gaming, dining, conferences, concerts, events and more. All 4 properties showed nice gains in the quarter, and that continued into January and February. On top of that, we got very good news from the regulatory front last week. Effective April 1 of this year, the Alberta Gaming Commission is increasing the operators' portion from slot revenues by 2% to help promote overall growth in gaming proceeds by enabling operators to reinvest in their facilities. While this is a temporary measure value for 2 years for now, we do expect a significant increase in our results from next quarter on. As our results in Poland are consistently strong, it may as well wait for another license excited to kickstart the sales process. As you know, we have an excellent management team there in place, and there is no need for any investment or CapEx from our side. A quick look at our balance sheet and liquidity shows that we have $102 million in cash and cash equivalents, plus the $100 million, which we keep in escrow for the closing of the Market OpCo transaction once Nevada licensing is complete. Outstanding debt totaled $350 million, which includes $347 million under the Goldman Sachs credit agreement, of which $100 million is in escrow for the market. If approved, we plan to close the market acquisition in the first week of April, less than 4 weeks from today. We are finalizing our plans for initial investments and upgrades, and I'm more excited than ever about the potential for improvements. And that gives a full-service resort destination with over 1,300 hotel rooms and suites, a casino with 850 slots in 29 tables, 6 restaurants, several indoor and auto entertainment venues, as well as one of the largest mentioned areas in the market. Its location on IAD provides unmatched exposure in the Reno Sparks area, and we plan on taking full advantage of that with a new attractive facade and signage. In Maryland, we expect to close the Rocky Gap acquisition a couple of months after the market transaction, probably in June or July. Simultaneously, with the closing of the transaction, VICI properties will take over their real estate assets, and we will amend our existing master lease with VICI to add the Rocky Gap property. And includes an 18-hole golf course designed by Jack Nicklaus, 5,000 square feet event center, several meeting spaces, spa and several outdoor activities. Property consists of over 25,000 square feet of gaming floor, 630 slot machines, 16 table games, 198 hotel rooms and F&B venues. With the Nugget and Rocky Gap acquisitions, we will oversee a U.S. portfolio that reaches from East to West. On a pro forma basis, after giving effect to the 2 acquisitions, we expect to generate over 80% of our EBITDA in the U.S. What is also important to note is the fact that these 2 acquisitions will improve our leverage ratios. Our current total debt-to-EBITDA ratio is 4.8 times, and that will reduce to 3.5 times. With that, we feel very comfortable, and we'll continue working with real estate investors on a case-by-case basis to support our growth. As we move further into 2023, the economic uncertainty that persists today makes it difficult to predict where consumer trends are headed. and that has the biggest impact on our business volumes, which are the labor market and housing. In closing, as we look back on 2022, it was another transformative year for Century. Looking ahead, we are excited about the Nugget and Rocky Gap acquisitions as well as the regulatory positive change in Alberta this year about our 2 Missouri growth projects coming online next year. Further, we believe there are additional opportunities to drive organic growth in our land-based operation. On behalf of the company's management and Board, I'd like to thank our team members, our guests and our stockholders for their continued loyalty and enthusiasm I thank you for your attention. I was wondering if you could, in a similar way, quantify the impact of weather in the fourth quarter to your results. Then thinking about margins, those 2 impacts, weather and the disruption of Caruthersville clearly affected margins. But throughout the portfolio, it looks like they came in a little bit. If I may take -- if we look at the expense side, the main factors that we had as additional expense were high utility costs, high the property insurance. And here, there are also higher salary increases. And coupled with that, higher maintenance, higher cost of operating supplies. We would think that these costs will not go up and maybe ideally a little bit down, but nobody can predict the future. And so we don't think that we need any more salary increases of any significance and hopefully, insurance and utilities price will also not go up any higher. And -- but with regard to the margin, it really also then depends on how well we are able to further increase the net operating revenues. Your line is open. Peter, Erwin, I wanted to ask about the Missouri growth projects. We are on budget, within the budget, so that looks good. We have said that we expect a 10% to 15% return at Cape Girardeau and 15% to 20% at Caruthersville in Missouri, and that has not changed. We're also first-time visitors, which have not come back in the Caruthersville both for the first time will then come back. It's a big -- it will have a big impact, I believe. And then with respect to the Nugget, I guess a couple of questions on that. Obviously, we're all well aware of the weather impact there. But when you take control of the property, you talked about some upgrades, the gaming floor and synergies and the like. I don't think that -- we don't see any disruption, certainly not in Q2, I mean changes to the gaming floor with regards to the slot mix. But if and when we do that, we obviously the most important integral part of the planning would be to do it in such a fashion that the disruptions are the minimum, not even any disruption at all. Well, if we're taking the 2022 numbers, then we are a bit higher than 6. got some thickness in the eye, and then the other 2 gentlemen also or groups they were postponing into next year. And the other one, we don't know why they -- I mean that was really unfortunate, and all of these cancellations came just too short to be able for the market management to get a replacement. One has been one very unlucky year, and we don't think that this will repeat itself. Peter, you called out a pretty positive outlook into the second and third quarter of this year. That's what it looks like right now, and it's pretty much across the board, yes. Maybe to give you some flavor, last talking to our general manager there after we moved from the boat to the temporary facility in what we call Pavilion, he said he has not seen one single customer who has been unhappy about the boat not being there anymore. I mean it's a wonderful, nice, little -- you would say it's a wonderful interfacility. It's not such we're going to build, of course. That will be brand new, and then it takes much better. But what was possible, it has a very good feel for both the table games and the slot machine side and is very well accepted, and we're really happy that, I mean, the old circumstances are difficult growth that we, together with a lot of support from the lot authority. Your line is open. And yes, we want to become active again on the M&A front. Probably, once we close the Rocky Gap acquisition in the summertime, we may also want to give a little bit back to our shareholders. So it will be a combination of all those things, a little bit dependent on how busy the M&A situation will get come Q3 and Q4. Lease adjusted around 4 times, 4.5 times is where we feel very comfortable. Well, we appreciate everybody joining our call today. For a recording of the call, please visit the financial results section of our website at cnty.com. And if you have any follow-up questions, please feel free to reach out to us."
}