{
    "symbol": "WSM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-24 19:59:04",
    "content": " Felix is only three weeks into the role, but sees clear opportunities for the brand, particularly in key areas, including: one, leaning further into the brand's heritage of inspiring those who love to cook at home with relevant and useful storytelling across all channels; two, the importance of offering the best product and ensuring customers can rely on Williams-Sonoma to be in stock across the key essentials of a great home kitchen. Our confidence to achieve our revenue outlook is rooted in three tangible drivers: Our year-to-date trends, which continue to outpace the industry and reflect market share gains; our continued improvement in our inventory receipts expected through the back half, which will enable us to fill prior orders and lower our elevated back order levels; and our ongoing strength in our growth initiatives, which continue to build momentum. From a profitability perspective, we expect cost pressures to continue in the back half and into the beginning of 2023, particularly across our supply chain, from the incremental distribution centers and related costs to support our growth plus higher ocean freight and other freight-related costs resulting from the global supply chain disruption and our efforts to best serve our customers by delivering product to them as timely as possible. So this year, it should be a much easier celebration for people to come together, and we're really looking forward to being a part of that and giving our customers great experience and great products to celebrate the holidays with and Felix and his team are really working on holiday preparedness right now on the website. And we have, I think, up to 50 products now my favorite being the expandable storage organizer for your drawer, which if you check out, you'll see why it's great because there's versions of that online, but they really break and it makes your kitchen look like a custom kitchen and who doesn't want to be more organized."
}