{
    "symbol": "WSM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 13:57:04",
    "content": " With our relentless focus on compelling products, customer service and profitable growth and its inflation and costs, including shipping come down, we're confident that will drive operating margins of more than 14%, as Jeff will discuss in more detail. More specifically, full year 2022 net revenues grew in line with our guidance of mid- to high-single-digit growth, finishing at $8.674 billion, a 6.5% comp on top of the 22% comp in 2021 and a 17% comp in 2020. With our strong financial discipline and cost control, we were able to materially offset these headwinds in gross margin as SG&A at 24.9% of net revenue, leveraged 140 basis points from last year. Our SG&A rate continues to be at a historic low at 21.3%, leveraging 270 basis points over last year, showcasing our financial discipline and ability to control costs, employment leverage to last year as we manage variable employment costs in accordance with our top line trends and adjusted incentive compensation with business performance. Q4 operating income of $487 million and operating margin at 19.9%, which is only 110 basis points below last year, reflects the durability of our profitability, despite significant macroeconomic headwinds and inflationary cost pressures. As the world's largest digital-first, design-led sustainable home retailer, we're confident we'll continue to outperform our peers and deliver profitable growth for these reasons: our ability to gain market share in the fractured home furnishings industry, the strength of our in-house proprietary design, the competitive advantage of our digital first but not digital-only channel strategy, the strength of our growth initiatives, our ability to control costs, the durability of our profitability and the resiliency of our fortress balance sheet. And we'll also see headwinds on the bottom line as we continue to see gross margin pressure as we did in Q4 from the higher input costs, we've all talked about sitting on our balance sheet and as they amortize in our P&L as well as our ongoing incremental shipping costs to service our customer."
}