{
    "symbol": "NPCE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 20:55:39",
    "content": " Total revenue was $11.2 million, representing growth of 8% compared to the prior year period and 9% compared to the second quarter of 2022. We drove strong initial implant revenue of $9.2 million, representing growth of 18% compared to the prior year period and 15% sequentially. Previously noted second quarter improvements in the epilepsy monitoring unit, or EMU, operating environment contributed to an increased patient pipeline and strong RNS system influence in the third quarter, along with improved market conditions, awareness of the clinical benefits and differentiated features of RNS Therapy is growing and resonating with physicians. By leveraging the expansion of our field team and distribution agreement with DIXI Medical, we are better positioned to: one, take share in EMUs; two, increase the patient flow into EMUs through expanding referral networks and DTC marketing; and three, drive adoption of the RNS system at additional comprehensive epilepsy centers, or CECs. Revenue from replacement implants was $1.9 million in the third quarter of 2022, which was ahead of our expectations. NeuroPace's revenue for the third quarter of 2022 was $11.2 million, representing growth of 8% compared to $10.3 million for the third quarter of 2021 and 9% sequentially compared to $10.2 million in the second quarter of 2022. In the third quarter, revenue from initial implants grew 18% to $9.2 million compared to $7.8 million for the third quarter of 2021. We continue to expect 2022 total operating expenses will be in the range of $74 million to $75 million, of which approximately $1 million will be DIXI launch-related expenses in the fourth quarter and approximately $8 million to $9 million is noncash stock-based compensation expense. As I stated earlier, we've seen really stable EMU situation for the last 6 months through the third quarter and through the first month of the fourth quarter, that's really encouraging for us because that provides the pipeline, that's the pipeline of patients, prospective patients with the RNS system."
}