{
    "symbol": "CRVS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 20:21:13",
    "content": "  Operator: Good afternoon, and welcome to the Corvus Pharmaceutical Second Quarter 2022 Earnings Conference Call. On the call to discuss the business updates are Richard Miller, Chief Executive Officer; Leiv Lea, Chief Financial Officer; and James Rosenbaum, Senior President of Research. Forward-looking statements are based on estimates and assumptions as of today subject to risks and uncertainties that may cause actual results to differ materially from those expressed or implied by those statements, including the risks and uncertainties described in Corvusâ\u0080\u0099 quarterly report on Form 10-Q, which was filed today with the SEC and other filings the company makes with the SEC from time to time. At June 30, 2022, Corvus had cash, cash equivalents and marketable securities totaling $56.7 million as compared to $69.5 million at December 31, 2021. Importantly as Richard will discuss, we have amortized our clinical stage pipeline plans and extended our cash runway into early 2024. Research and development expenses in the second quarter of 2022 totaled $4.9 million, compared to $9.1 million for the same period in 2021. We are able to achieve this by the judicious utilization of experienced personnel, leveraging external resources and establishing collaborations that help support development of our products. The net loss for the second quarter of 2022 was $8.4 million, compared to a net loss of $11.8 million for the same period in 2021. Total stock compensation expense for the second quarter of 2022 was $0.7 million, compared to $1.2 million for the same period in 2021. In the first half of 2022, we made considerable progress with our three clinical stage programs, which are all well positioned to move into mid-stage trials. And in order to extend our cash runway, we are focusing on the development of our programs that provide the best opportunity to deliver value by generating meaningful near-term clinical data. Based on recent clinical data and preclinical research, we have made the strategic decision to focus greater resources on our CPI-818 ITK inhibitor program. We feel that this drug may have diverse opportunities across oncology, autoimmunity and allergic diseases. We will pause on initiating the previously planned randomized blinded Phase 2 trial in lung cancer for mupadolimab, given the timeline to data and the increasingly crowded CD73 landscape. To be clear, we still believe mupadolimab has great potential and look forward to advancing its development in the future. I will now provide an update on each of these programs, starting with CPI-818, our ITK inhibitor. In May, we hosted an R&D symposium in New York that provided a thorough background on the clinical and preclinical data that has us so excited about 818's potential to treat T cell lymphomas along with a variety of indications across autoimmunity and allergy. In our ongoing Phase 1 clinical trial in T cell lymphoma, we have been able to demonstrate that ITK also plays a vital role in differentiation of normal human T cells. With this strategy, we see many similarities to development of other immunologically active agents such as Rituxan and ibrutinib, which also started in lymphoma and then expanded into other diseases. As you may know, anti-CD20 antibodies like Rituxan and BTK inhibitors are now widely used in the treatment of B-cell lymphomas and members of the Corvus team played crucial roles in the discovery and development of these agents. Data from our global Phase I/Ib trial in T-cell lymphomas has led to the identification of 200 milligrams twice a day orally, as the optimal dose of CPI-818 for modulation of T cell differentiation and we are expanding enrollment in that dose cohort of the trial. The study is ongoing, together with our partner in China, Angel Pharmaceuticals. As reported in our press release today, 12 patients have been enrolled and eight are evaluable for response. There has been one complete response lasting 25 months, one novel complete response lasting 16 months, one partial response ongoing at two months follow-up. A significant importance are the correlative lab studies on the blood and on the tumors of responding patients which showed: One, evidence for Th1 skewing; two, an increase in T effector cells in blood and tumor; and three an increase in activation of T cells in the blood and tumor. In addition, we've made other observations in our ongoing Phase 1 study that are pertinent for allergy. It is known that Th2 cells are the culprits in diseases like asthma, atopic dermatitis, fibrotic diseases, such as idiopathic pulmonary fibrosis and others. The eosinophils, our white blood cells that play a role in allergic and autoimmune diseases and they are often elevated in patients with T-cell lymphomas. In our ongoing lymphoma study, we have seen 818 causes reductions in circulating eosinophils in several patients with high baseline pretreatment counts. As Richard noted, my career is focused on the study and treatment of inflammation and autoimmune disorders. Although the ITK target has been known for some time, Corvus is the first group to determine that this target could have valuable therapeutic possibilities in a range of diseases. While I am still early in my time at Corvus, there are several key reasons why I am optimistic about 818 and our broader pipeline. A key characteristic of CPI-818 is its exquisite specificity for ITK, which turns out to be crucial for affecting differentiation of T cells. Second, CPI-818 clinical and preclinical data are encouraging and speak to its broad potential. Together, the Corvus portfolio of product candidates creates exciting new opportunities to potentially impact several important areas of medicine. The Kidney Cancer Consortium is led by MD Anderson and includes several leading centers such as Vanderbilt, Beth Israel, Boston, Cleveland Clinic, UT Southwestern and others. As a reminder this is an open-label single-arm trial, so we anticipate that we will get a good feel for efficacy early in the trial. For mupadolimab, our B cell activating anti-CD73, while we are pausing initiation of our Phase 2 trial, we believe it is differentiated in the CD73 landscape as it binds to a unique epitope on the CD73 protein, which on B cells results in their activation and differentiation into antibody producing plasma cells and into memory B cells. I emphasize this point, because we think that the immunomodulatory properties provide a unique mechanism of action in immunotherapy. In closing, we believe Corvus is well positioned with several potential catalysts for our programs in the next 12 months combined with an extended cash runway that now runs into 2024. Second, CPI-818 development in autoimmune and allergy is ongoing with a goal of initiating clinical trials early next year, early 2023. Third, starting the ciforadenant and the Phase 2 trial for frontline renal cell cancer in partnership with the Kidney Cancer Consortium in the third quarter, with the potential for a read-on clinical activity relatively early in enrollment, since it is an open-label study. So as we're currently studying 818 in patients, who have had multiple recurrences. Then the next step, would be a Phase 2 trial, again in advanced recurrent patients. So we think that as a monotherapy, there's a potential pathway to approval with a single-arm study. Now concomitant with that, I would also -- and given the safety that we've seen with 818, I would also want to move that frontline probably in combination with the standard chemotherapy like CHOP or CHP that would need to be a randomized trial. So I think a single-arm trial, with monotherapy in advanced disease followed or concomitantly performing a randomized trial in early line peripheral T-cell lymphoma. And we believe that this represents, a very novel mechanism of action that's more active than some of the other agents have shown in early development. Now one other thing just to add on that -- one of the things, and I tried to emphasize this in our comments was that, when we're treating T-cell lymphoma patients, we're also studying their normal T cells and B cells and the rest of their immune function. And it's almost as if, we're getting multiple kinds of lines of information out of these T-cell lymphoma trials, that we think inform us for autoimmune trials. Now your question on Mupadoliumab, the lung cancer space has become crowded and many people are waiting for additional data with TIGIT combinations with anti-PD-1. We have -- it's a protocol that I've described before, which is chemo and pembro plus or minus mupa. We think given that it's a blinded randomized Phase 2 trial, one of the reasons that we've decided to pause on that, as I mentioned, was that we're not going to be able to look at data for that for some period of time for 12 or 18 months. Jim -- Dr. Rosenbaum, maybe, I'll let you take the first part of that question. Well, in addition to the data on acute GVHD, we have reported data on the MRL/lpr mouse, which has similarities to lupus. As well as some of the diseases that Dr. Miller mentioned, atopic dermatitis, pulmonary fibrosis and asthma. If I can just add to that, to specifically answer your question, graft-versus-host disease would not be my initial target, because we think that the diseases that Dr. Rosenbaum just mentioned, the atopic dermatitis, asthma, inflammatory bowel disease, fibrotic diseases are huge opportunities. And that's because what we really want to do -- really any autoimmune or allergic disease that involves Th2 cells -- so-called Th2 cells and you can look that up, there are a lot of those, would be a target -- potential target for this therapy. So what we expect to show at ASH would be data on well I would say 40 to 50 patients, efficacy data, safety data, any kind of immunologic data we have from blood work and biopsy data. And it includes work both from Angel in China, as well as the Corvus part of the study. Well, we still have some patients on follow-up from our Phase I study and Angel is very shortly going to be starting their Phase I study in lung cancer and head and neck, the same tumors that we were going after. We're pausing it here at Corvus, but the study is going forward with Angel in China and we're still going to get information out of that. So, I don't have the time line for new updates on mupa, but we're still enrolling and following patients together with Angel. I mean let me be clear we're not enrolling patients at Corvus, we're following patients that have been on our study."
}