{
    "symbol": "FNF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 15:47:06",
    "content": " Starting with our title business, commercial revenue was $381 million, a third quarter record compared with the year ago quarter of $366 million. Total revenue, excluding recognized gains and losses, was $2.3 billion, a 24% decrease compared with the third quarter of 2021. Since the merger over 2 years ago, F&G has far exceeded our original expectation for growth and contributed approximately $900 million of adjusted net earnings over the last 9 quarters on a cumulative basis. Our products are attractive in a rising rate environment as seen in our record $2.3 billion of retail total gross sales in the third quarter, up 45% from the prior year quarter and in our application submissions which are up nearly 60% from the prior year, providing a strong pipeline through year-end. Third quarter activity also included $621 million of pension risk transfer transactions including our first repeat client transaction compared with $371 million in the prior year, our first quarter in the PRT business. Total net sales were $2.2 billion in the third quarter, net of our flow reinsurance arrangement which increased from 50% to 75% of MYGA sales effective September 1. Assets under management for the quarter totaled $42 billion, reflecting an increase of $7 billion or 21% over the prior year, driven by net new business flows. On a pro forma basis, over the past 9 quarters since the FNF merger, ANE under the new definition, would have had a quarterly range of volatility of $93 million lower to $60 million higher than ANE, as previously reported under the former definition due to the short-term alternative investment mark-to-market movements. Despite the quarterly mark-to-market volatility, cumulative earnings over the past 9 quarters were $878 million under the former definition versus $963 million under the new definition, an $85 million increase. For the third quarter, F&G's adjusted net earnings were $12 million compared to $112 million reported in the second quarter of 2022, with both periods reflecting the new definition for comparability. Also, F&G's Board of Directors has approved the initiation of a dividend program under which the company intends to pay quarterly cash dividends on our common stock at an initial aggregate amount of $100 million per year commencing in early 2023. Third quarter net earnings were $289 million, including net recognized losses of $230 million versus net earnings of $732 million, including $154 million of net recognized losses in the third quarter of 2021. Our Title segment generated $2.3 billion in total revenue in the third quarter, excluding net recognized losses of $48 million, compared with $3.1 billion in the third quarter of 2021. Interest and investment income in the Title and Corporate segments of $71 million increased $44 million as compared with the prior year quarter, primarily due to increases in income from our 1031 Exchange business and short-term investments. Based on the current interest rate environment and expected near-term Fed actions, we expect an additional $15 million to $20 million increase in interest and investment income in the fourth quarter on our 1031 Exchange balances and our short-term investments. Looking to 2023, we expect quarterly interest and investment income to moderate in the $85 million range with declining 1031 Exchange balances and spreads and potentially declining cash and short-term investment balances. F&'s consolidated debt was $2.7 billion on September 30, down $400 million from the preceding quarter due to the payment of our 5.5% senior notes which matured in September. Following last week's announcement of the quarterly cash dividend increase to $0.45 per share, we view our current annual common dividend of approximately $500 million as sustainable."
}