{
    "symbol": "FNF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 15:04:19",
    "content": " Lastly, total commercial orders opened per day were down 8% from the second quarter of 2021 and lower by 11% for the month of July versus the prior year. Total revenue, excluding recognized gains and losses, was $2.8 billion, a 7% decrease compared with the second quarter of 2021. For the quarter, we delivered adjusted pretax Title earnings of $529 million and adjusted pretax Title margin of 18.9% which increased from 17.1% in the sequential quarter, although down from the record prior year. Of note, total commercial revenue was $436 million, a second quarter record compared with the year ago quarter of $347 million driven by the 34% increase in total commercial fee per file, partially offset by a 6% decrease in closed orders. Second quarter sales rose by 15% year-over-year to $3.1 billion, with assets under management ending the quarter at $40.3 billion which is significantly ahead of our original expectations when we completed the acquisition. With regard to earnings, F&G's adjusted net earnings for the second quarter were $128 million. Adjusted net earnings, excluding notable items, were $92 million in the second quarter, an increase of $22 million or 31% compared to $70 million in the prior year quarter. Second quarter net earnings were $382 million, including net recognized losses of $676 million versus net earnings of $552 million including $232 million of net recognized gains in the second quarter of 2021. Excluding net recognized gains and losses, our total revenue was $3.3 billion as compared with $3.6 billion in the second quarter of 2021. Our Title segment generated $2.8 billion in total revenue in the second quarter, excluding net recognized losses of $249 million compared with $3 billion in the second quarter of 2021. All in, the Title business generated an 18.9% adjusted pretax Title margin for the quarter, a decrease of 380 basis points versus the record 22.7% in the prior year quarter. Interest and investment income in the Title and Corporate segments of $38 million increased $11 million as compared with the prior year quarter, primarily due to increases in income from our 1031 Exchange business and short-term investments. To help put it in perspective, for the Title and Corporate portfolio, we would expect approximately $5 million in additional quarterly income for each 25 basis point increase in Fed funds with some moderation after about 200 basis points. During the second quarter, we repurchased 4.3 million shares for a total of $172 million at an average price of $39.76 per share."
}