{
    "symbol": "FNF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 12:53:12",
    "content": " Lastly, total commercial orders opened per day were higher by 6% over the first quarter of 2021 and lower by 2% for the month of April versus the prior year. For the quarter we delivered adjusted pre-tax Title earnings of $437 million a, 15% decrease from the prior year and an adjusted pretax Title margin of 17.1% as compared with 19.9% in the year ago quarter. Of note, total commercial revenue was $374 million compared with the year ago quarter of $257 million driven by the 7% increase in closed orders and 35% increase in total commercial fee per file. Last, but not least turning to F&G and which Chris will discuss in more detail in a moment, First quarter sales rose by 57% year-over-year to $2.6 billion with assets under management ending the quarter at $38.6 billion as we continue to take share, while gaining momentum in new distribution channels. With regard to earnings, F&G's adjusted net earnings for the first quarter were $82 million. Adjusted net earnings for the quarter included net unfavorable items of $16 million, primarily $38 million in tax expense for a valuation allowance recorded against deferred tax assets related to the past sale of discontinued operations, partially offset by $22 million of favorable items, primarily comprised of gains on collateralized loan obligation redemptions. Adjusted net earnings excluding those notable items were $98 million in the first quarter, an increase of $32 million or 48% compared to $66 million in the prior year quarter. Starting with our consolidated results, we generated $3.2 billion in total revenue in the first quarter, with the Title segment producing $2.4 billion, F&G producing $748 million and the Corporate segment generating $34 million. Our Title segment generated $2.6 billion in total revenue, excluding net recognized losses of $175 million in the first quarter compared with $2.6 billion in the first quarter of 2021. Interest and investment income in the Title and Corporate segments of $27 million, declined $2 million as compared with the prior year quarter primarily due to decreases in bond interest. During the first quarter, we repurchased 2.75 million shares for a total of $134 million at an average price of $48.68 per share. Please proceed with your question. Please proceed with your question. Please proceed with your question. Hey, Chris maybe starting off with you on the -- over the last year it looks like the F&G adjusted net earnings on a quarterly basis, it looks like you guys have averaged roughly $90 million. Please proceed with your question. Maybe to put it in perspective, I think we had about $110 million or so in investment income in Title and Corporate last year, and I could see that trending closer to maybe 180 if the Fed moves the way everyone has anticipated they will, which is maybe 10, 25 basis point increases or 250 basis points by first quarter of next year. Please proceed with your question. Please proceed with your question."
}