{
    "symbol": "AIR",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-22 21:47:02",
    "content": " Before we begin, I would like to remind you that the comments made during the call may include forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. These risks and uncertainties are discussed in the companyâ\u0080\u0099s earnings release and the Risk Factors section of the companyâ\u0080\u0099s Form 10-K for the fiscal year ended May 31, 2022. In providing the forward-looking statements, the company assumes no obligation to provide updates to reflect future circumstances or anticipated or unanticipated events. At this time, I would like to turn the call over to AARâ\u0080\u0099s President and CEO, John Holmes. In our Commercial business, we remain encouraged by the continued recovery in air travel. As we indicated last quarter, the recovery has been strongest domestically, while Europe and Asia have lagged behind, leading to global USMs that are still about 30% below 2019 levels. Regarding our parts activities, we continue to see broadening interest in used material, but the mediate demand for used parts continues to be impacted by the utilization of green time, as well as the lack of material availability for certain high-demand assets. However, our new parts distribution activities continued to deliver meaningful growth. While contracts signed prior to COVID still have not fully recovered, the overall growth is being driven by the series of distributorships that we have signed in the last two years. Finally, in MRO, our customers continue to signal strong demand for our services and we expect our hangers to remain largely full for the rest of the fiscal year. In our Government business, year-over-year, we saw the full impact of the exit from Afghanistan, as well as the completion of certain other programs. Sequentially, the decline was driven by reduced activity on certain short-term programs, as well as a more normal level of parts sales to the U.S. Government as compared to what we saw in Q4. As our recently awarded USAFE contract ramped up later this year and we win other contracts, we expect growth to resume in our Government business. Turning to margins, I am pleased to report that we delivered another strong quarter. Our operating margin was 6.9% on an adjusted basis, up from 5.5% last year. Regarding cash flow, we generated $7 million from operating activities from continuing operations. Even after the share repurchase, our net leverage was 0.4 times EBITDA and we continue to be exceptionally well positioned to fund our future growth. Turning to new wins, during the quarter, our Mobility Systems business was awarded $173.5 million firm fixed contract from the U.S. In addition, we were awarded a contract by the Norwegian Defence Logistics Organisation to provide parts for the Royal Norwegian Air Force P-8A fleet. With that, Iâ\u0080\u0099ll turn it over to our CFO, Sean Gillen, who will discuss the details of the results. Our Commercial sales were up 9.8%, while our Government sales were down 18.7% due to the completion of certain Government programs, including our Afghanistan contracts. Sequentially, our Commercial sales were approximately flat and our Government sales decreased 16.2%. In Government, recent contract modifications that result in higher recovery on indirect costs, as well as favorable cost performance on a contract drove the strong margin performance. This figure includes continuing investments in our digital initiatives, as well as $0.8 million related to investigation and remediation matters. Net interest expense for the quarter was $1 million, compared to $0.7 million last year, driven by higher interest rates, notwithstanding lower borrowings. As John indicated, we generated cash flow from our operating activities from continuing operations of $7 million. In addition, we funded $21.9 million of share repurchase. Consistent with the last three quarters, we expect to continue to execute on our plan to deploy the full $150 million share repurchase authorization over approximately two years from the time of announcement. Finally, we anticipate investing more significantly in inventory and rotable assets to support our growth. As you know, we are in a period of macro uncertainty regarding growth and inflation. That said, Commercial passenger traffic growth has historically been extremely resilient through economic cycles. For AAR, as I indicated earlier, in our hangers, we expect to remain largely full and even though the labor market remains tight, our partnerships with technical schools, as well as other labor pipeline initiatives continue to serve us well. In distribution, we are well positioned to continue to add new lines and to benefit from the eventual recovery in flying levels in Europe and Asia. And in trading, engine green time will ultimately dissipate and new aircraft deliveries will eventually lead to retirement as a source of supply for more used material. As we saw during the pandemic, our Government business has also proven to be resilient during macroeconomic weakness. In addition, our fundamental value proposition to deliver commercial best practices at a lower price point to resonate even more loudly with our Government customers during periods of budget tightening. As a result, we are confident in our ability to transition our Government pipeline, which remains very full into meaningful growth over time. With respect to the near-term outlook, we expect both sequential and year-over-year growth in Q2. Specifically, we expect sales to be in between the quarter we just finished and Q4 of last year, and we remain optimistic for continued sequential growth throughout the balance of this fiscal year. Over the long-term, we are uniquely positioned as the leading non-OEM non-airline provider of comprehensive aftermarket solutions globally. We are well balanced across Commercial and Government end markets, have the strong balance sheet to fuel market share growth and have a structurally improved margin profile that should translate into even greater value for our shareholders. Maybe, John, you kind of just gave some color on what you expect for the year with kind of the sequential growth throughout. Just and even, I guess, Sean, talking about investing in inventory to anticipate the growth. So, generally speaking, we -- if I think about the parts businesses in two areas, distribution, we expect to grow throughout the year. In terms of the aftermarket, the trading activities, I would say that, that inflection point, we need a couple of things to occur. So thatâ\u0080\u0099s pushing that inflection point out, but we still expect it to occur in the second half of the year. And then as it relates to margin, we -- youâ\u0080\u0099ve seen the full benefit of the structural changes that weâ\u0080\u0099ve made and thatâ\u0080\u0099s put us around the 7% operating -- adjusted operating margin ballpark. As the parts businesses recover both in distribution and in trading, and thatâ\u0080\u0099s the area where we still see the most opportunity for recovery and growth. Those businesses are margin accretive to where we are today and so as the mix shift in that direction, ultimately, that should improve margins further. But definitely in the distribution business, supply chain challenges are something that weâ\u0080\u0099re focusing on. So itâ\u0080\u0099s had somewhat of an impact on the results over the last few quarters in terms of delayed deliveries, et cetera, but -- and extended repair times. But, overall, I think weâ\u0080\u0099ve done a pretty good job managing through that. Any update, I know you called it out last quarter on the ADL drag is. What I will say and we pointed to this earlier in the year is that, weâ\u0080\u0099ve been able to change the relationship that we have with our customers to really drive a lot less seasonality in that business than we had seen before. We saw some, so there were some lines of maintenance that went away during the summer because aircraft are flying, theyâ\u0080\u0099ll come back in the fall. But it was much, much less significant than what we had seen in years past. And weâ\u0080\u0099re really pleased that our customers are working with us in this regard, because we want to keep consistent aircraft and consistent workloads throughout the year, so that we can maintain the labor force, but also drive efficiency and the improved margins that youâ\u0080\u0099ve seen. So that would be ADL owned by Boeing, Satair owned by Airbus and then a handful of smaller, but predominantly the larger players. Youâ\u0080\u0099ve talked about the extended green time on engines, I believe. I was just wanting if you could touch a little bit further on the parts business, kind of your expectations for retirement for the rest of this year. Generally speaking, the green time, I think, is -- the green time is lasting longer than we would have anticipated. And the pilot shortage is definitely contributing to that in as much as youâ\u0080\u0099ve got a number of aircraft that are on the ground, because airlines donâ\u0080\u0099t have pilots. Well, thatâ\u0080\u0099s 100 engines that they now have access to, to swap around and burn off screen time. As it relates to overall supply, I would say, nothing structural has changed. But we have, as we mentioned and you saw it, in terms of putting out some cash this quarter, we have found some unique opportunities and we were able to move very quickly and capture material. And thatâ\u0080\u0099s good for us, but I wouldnâ\u0080\u0099t say that, itâ\u0080\u0099s an indicator of anything larger going on in the market. And then just one more, if I may, the inventories and contract assets for USAFE about $40 million in cash in the quarter, and then going back to Q4, it looks like it was about an additional $20 million there as well. I think some of it on the contract assets, we had some activity on our longer term programs that werenâ\u0080\u0099t invoiced yet. I would expect those to get invoiced in the near-term, because I donâ\u0080\u0099t think youâ\u0080\u0099d see that trend continue. On inventory and rotable assets, generally, as we talked about, we see opportunities, specifically on parts supply, which would show up in inventory to procure USM material or to win new distribution business that would come with an upfront inventory buy. Sean, I know you went through this, I just wanted to make sure I had it, obviously, the year-over-year decline in Government Defense, Afghanistan, but I think you also mentioned the sequential it was down significantly, I guess, 17% or so. Sequentially was two-fold, which was some lower activity on some of the shorter term programs that weâ\u0080\u0099ve won over the last couple of quarters, as well as reduced parts activity sales to the U.S. Government. Presumably, thereâ\u0080\u0099s not much in the way of U.S. op tempo going on or any color you have there, I mean, just something that usually ebbs and flows? We want to thank everybody for your time and your interest, and we look forward to being back next quarter."
}