{
    "symbol": "AIR",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-21 19:02:01",
    "content": "  Operator: Good afternoon, everyone, and welcome to AAR's Fiscal 2023 Third Quarter Earnings Call. We're joined today by John Holmes, Chairman, President and Chief Executive Officer; and Sean Gillen, Chief Financial Officer. Before we begin, I would like to remind you that the comments made during the call may include forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. These risks and uncertainties are discussed in the company's earnings release and the Risk Factors section of the company's Form 10-K for the fiscal year ended May 31, 2022 and Form 10-Q for the fiscal quarter ended November 30, 2022. In providing the forward-looking statements, the company assumes no obligation to provide updates to reflect future circumstances or anticipated or unanticipated events. At this time, I would like to turn the call over to AAR's Chairman, President and CEO, John Holmes. Before I comment on the results, I would like to highlight the acquisition of Trax that we announced yesterday. It supports over 100 customers and approximately 5,000 aircraft, providing software for managing the entire spectrum of maintenance activities. These activities include many things such as inventory planning and purchasing, maintenance scheduling, engineering, work order processing, mobile task cards, electronic log books and personnel management. Additionally, Trax is a critical piece of software as it serves as a system of record required for airlines and MRO's by the FAA and other global regulators. For over 20 years, Trax has competed successfully against much larger players and has established itself as the leading independent provider of maintenance ERP software. For AAR this acquisition accelerates our digital strategy, adding a platform for bringing additional software tools and analytical solutions to our customers and creating a unique channel to offer AAR products and services. In addition, it squarely furthers our stated objective to add differentiated IP-based higher margin solutions to our aviation aftermarket offerings. Our sales to commercial customers increased 28% and our sales to government customers decreased 3%, reflecting the prior wind down of certain programs last fiscal year. New parts distribution benefited from the continued recovery in commercial flying as well as the recent contract wins, which were also contributing to the results. And as expected, the investments that we made in our USM activities last quarter have already generated early returns. In MRO, we continued the strong performance that we've seen for the past several quarters, remaining nearly at capacity. And I'm pleased to report that on our government business, we were able to identify short-term opportunities that drove sequential growth in the quarter. We also delivered another strong quarter with respect to profitability as our operating margin was 7.6% on an adjusted basis, up from 6.7% last year and consistent with the strong performance in Q2. With respect to cash, we generated cash flow from operating activities from continuing operations of $17.4 million during the quarter. Our net leverage at the end of Q3 was 0.8 times EBITDA, pro forma for the Trax acquisition, our net leverage was 1.35 times EBITDA. Our commercial sales were up 28.1%, driven by growth across our commercial activities. Sequentially, our commercial sales were up 8.9% and our government sales were up 14.9%. The margins in the quarter reflect continued strong performance in our parts supply and MRO activities, as well as favorable adjustments on the government contracts related to improved recovery on overhead costs and contract performance. Excluding these items, our SG&A decreased to 10.1% of sales in the quarter, which drove our adjusted operating margin performance of 7.6%. Net interest expense for the quarter was $3.5 million compared to $0.6 million last year, driven by higher interest rates and borrowings. Cash flow from operating activities from continuing operations was $17.4 million, including a $25 million reduction in inventory in the quarter. We ended the quarter with net debt of $135.3 million and net leverage of 0.75 times EBITDA, which is down from 0.88 times EBITDA at the end of our fiscal Q2 in November. With respect to the Trax acquisition, we announced and closed the transaction yesterday. The consideration was $120 million in cash upfront, plus up to $20 million earn-out based on calendar year 2023 and 2024 adjusted revenue performance. We expect the acquisition to be immediately accretive to adjusted EPS, which will exclude the non-cash amortization resulting from purchase accounting. Note that the $20 million earn-out consideration will be reflected in our SG&A over the two-year period, as there are retention conditions, where we were excluded from our adjusted results. Based on the closing date, Trax will contribute a little more than two months to fiscal Q4. We would expect it to contribute $3 million to $4 million in sales, with EBITDA margins around 35%. As mentioned, we expect Trax to be accretive to adjusted EPS in FY'24. On a pro forma basis, our net leverage at the end of Q3 was 1.35 times EBITDA and our liquidity from remaining cash on hand and availability under our revolver was over $340 million. As you have indicated previously, our priorities for capital deployment are in order, organic growth investments in our business, value accretive inorganic investments to add complementary capabilities and capital return to shareholders. Over the last couple of quarters, we've had attractive opportunities to deploy capital in the first two categories. Looking forward, although macroeconomic uncertainty and concerns about the global banking industry are watch item for all companies, we continue to be optimistic about the recovery in global flying and the resiliency of the aerospace aftermarket generally. We expect continued growth in new parts distribution, which is benefiting both from recovering and demand, and the ramp up of recent contract wins. And in USM, we are seeing a loosening in the availability of supply and as we mentioned last quarter, engine green time availability is decreasing, which should drive even more engine shop visits and associated USM demand. In MRO, demand for heavy maintenance continues to be strong and we expect to remain at near capacity for the foreseeable future. With respect to our government business, we continue to be well positioned to add additional short-term and long-term programmatic wins as a function of our best value, commercial best practices offerings. With respect to Q4, we expect continued growth in commercial, but expect a slight sequential decline in our government business. As such, overall in Q4, we expect similar to slightly better performance in total revenue and adjusted EPS relative to what we just delivered in Q3. Before opening it up to questions, I want to again express my excitement about the Trax acquisition. To reiterate what I said when I was with the Trax team yesterday in Miami, we see this as a unique opportunity to bring together AAR's hardware and Trax's software to support the global aerospace aftermarket in a way that has the potential to be extremely powerful over time. Your line is open. They're about the smallest, just in terms of size, but they have a very broad market reach and have been among the most successful in the last several years in terms of market penetration. They've got about the best product out there, and that's why they've been winning. What's worked against them is, just the fact that they've been a sole proprietorship essentially in Miami. And we believe that by combining with them, AAR as a much larger well-financed backer can help them open doors that they might not have otherwise been able to open. Furthermore, AAR, just given our presence in the globe, our reach around the industry, we also think that we can introduce Trax to more customers that they may not have otherwise been able to reach already. Again, we've been following the company for about 10 years and have seen their evolution in their platforms. They have a whole suite of new offerings, new apps, if you will, and they're moving their users in the next generations to the cloud, and it's a SaaS-based offering. In fact, that's exactly how we're thinking about it. Ultimately, Trax is the system used by thousands and thousands of buyers and planners at airlines around the world. From an MRO standpoint, we remain focused on our core offering around narrow body. From a parts standpoint though, particularly around engines, the power wide bodies, that's an area that we are in today, predominantly in the cargo market. But as we see more passenger aircraft take to the sky, we see opportunities to take the part business to support that growth. I think you're correct in terms of material out of parked aircraft, but we haven't seen the elevated levels of retirements that have been forecasted for many years, particularly at the beginning of the pandemic. As OEM production rates come up and as airlines reflect their aircraft, we do expect to see more retirements over time, although that dramatic jump that many talked about for so long, we don't expect that. But we do expect that curve to steepen over the next few years, and that will provide more material for our USM business. Please standby for our next question. Your line is open. For existing programs that we're on, off the top of my head, I don't -- I'm not aware of any major recompetes for programs that we are currently on. To the extent we're successful, that would be a net new work for AAR. And so our used parts offering, which, as you know, has been very successful in the commercial market, now as agencies as they look to buy parts are required to give that a look. As a matter of fact, the FAA itself is actually a Trax customer, but we believe, again, similar to the commercial market, there are doors in government agencies, but because of our presence, we can help open for Trax. And then, on the distribution  on the commercial side, availability look like coming from the OEMs. It's been stable over the last few quarters and when we think about supply chain for our business, certainly availability of labor, we kind of put in the supply chain bucket. But as it relates to parts availability, from the OEMs and repair turnaround times both of those elements have stabilized in the last few quarters. And similarly, as we manage parts in the USM business that we send out for repair, weâ\u0080\u0099ve accounted for longer turnaround times as we look to buy and market material. Please standby for our next question. Your line is open. John, just on the -- into the fourth quarter, I mean it's usually seasonally your strongest quarter, but I think you called for flattish revenues. In Commercial, we do for all the reasons you just mentioned, we expect continued growth sequentially in Q4. MRO remains strong, and we expect continued growth in commercial. We've mentioned this a few quarters ago, as we saw the wind down of certain long-term government contracts, we have been able to offset a fair bit of that wind down with shorter-term government activities. We were successful in doing that in Q3, which accounted for the strong government program performance in Q3. However, we don't expect that same level of activity on the government side in Q4, which net-net leads us to a, I would say, similar to slightly better overall Q4 in revenue and EPS than what we delivered in Q3. Ultimately, Trax manages a tremendous amount of data for its customer base. Over time, we want to work with Trax and their customers, many of whom are our customers to see how in partnership with everybody, we might be able to use that to offer more parts and solutions, more parts availability to the Trax customer base. You have access to some of that engine material, but it sounds like they also are focused on ramping up their USM. So the JV that we have with them and the overall relationship is going as well, if not better than we expected when we originally outlined it. Please standby for our next question. Your line is open. First, with respect to Trax, we are not really focused on cost synergy at this point. As we mentioned earlier, we believe that can help grow Trax's revenues by funding further development of their products and services and by opening doors for them around the world with a larger customer base, government included. And then similarly on AAR side, again, over time, as we develop Trax and work in cooperation with their customers, we think this could be a unique channel to market for our traditional products and services, which would in turn grow our own revenue. So really, it's a revenue synergy play with track. And then thinking about M&A, as you heard from Sean, we think about capital deployment first organically; second, inorganically M&A and then third, returning capital to shareholders. We've been working with them and thinking about this deal for really about 10 years, and it's great to get it over the finish line. And with the balance sheet strength that we have, provided that it fits the portfolio and the value makes sense, we're in a great position to act. I would say first part, we are seeing it in both categories, individuals on their own as well as whole airframes that come with engines. With respect to pricing, I wouldn't want to comment on that element just for competitive concerns, but we are encouraged by the assets that we see coming available. Thank you very much, everyone for your time and attention, and we look forward to talking to you next quarter. Ladies and gentlemen, this concludes today's conference call."
}