{
    "symbol": "PKX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 11:54:05",
    "content": " The Steel business achieved a sound performance with higher revenue and operating profit Q-o-Q, thanks to increase in sales prices and efforts to achieve cost cuts despite the raw material cost and decrease in production volume due to the revamping of key facilities. The Green Infrastructure and Green Materials and Energy businesses saw an increase of over KRW2 trillion in revenues Q-o-Q, thanks to improvements in the revenues and operating profits of key units such as POSCO International, POSCO E&C and POSCO Chemical. As for China's Zhangjiang stainless steel, we have seen that profitability worsened because of the raw material increase due to spike in nickel prices as well as the well-known lockdown in the Shanghai area. For India, POSCO's Marastra recorded a decrease in revenues and operating profits Q-o-Q due to steel export tax imposed by Indian government as well as the slow demand from nonautomotive industries such as construction and distribution. As you're well aware, the demand such as the automotive market is expected to normalize, and that will pivot on the supply chain disruptions, which we believe will continue into the second half, and it seems that interest rates are being raised around the world, and this will directly and indirectly in cakesteel market, and we believe that unlike expectations, the recovery of the steel market will be slower than expected. And so we will have the second half price negotiations with a slight increase for the second half for the shipbuilding and home appliances, we will reflect the raw material and market prices -- and you also asked about China, the forecast for the second half as well as the steel market forecast, as you're well aware. I would like to ask you more about your projections for the second half of this year for iron ore, steel ore and coking coal prices -- my second question is on the fact that the performance of the overseas subsidiaries have been slightly different."
}