{
    "symbol": "EW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 22:05:05",
    "content": " In TAVR, full year 2022 global TAVR sales of $3.5 billion increased 7% on a constant currency basis, building on nearly 20% growth in the year ago period. Our global TAVR sales of $868 million increased 5% year-over-year on a constant currency basis, consistent with our expectations. Fourth quarter sales of $32 million were consistent with our latest guidance and driven by the continued adoption of PASCAL in Europe supported by the early initiation of PASCAL Precision in the U.S. Full year global sales were $116 million, up nearly 50% on a constant currency basis versus the prior year. In Surgical Structural Heart, full year global sales were $893 million, up 6% on a constant currency basis versus the prior year. So as Mike mentioned, our sales of $1.3 billion in the fourth quarter grew 7% on a constant currency basis, despite the health care disruptions in a number of our key geographies. Absent big moves in FX, we expect total company sales of $5.6 billion to $6 billion, TAVR sales of $3.6 billion to $4 billion, TMTT sales of $160 million to $200 million, Surgical Structural Heart sales of $870 million to $970 million and critical care sales of $840 million to $940 million. SG&A expenses in the fourth quarter decreased 3% over the prior year to $411 million or 30.5% of sales, primarily due to the weakening of the euro and the yen against the dollar and partially offset by continued investments in the ongoing build-out of the U.S. TMTT commercial team and our high-touch model for TAVR. January, it's pretty early to say, but obviously, we wouldn't the signals that we've seen in January are reflected in the guidance that we've given in that $13.70 to $14.50 sales range for the first quarter. Mike, I wanted to go back to the COVID-related headwinds in the U.S. and one hypothesis that I think concerns investors what you guys really haven't talked much about is the idea that excess mortality in your patient population could have depleted your pool and that, that might take longer to normalize than something that's a little bit simpler like hospital staffing."
}