{
    "symbol": "IZEA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 22:22:05",
    "content": " It is now my pleasure to introduce your host Ryan Schram, President and Chief Operating Officer. Revenue from Managed Services improved to $8.4 million during the first quarter, up 66% over the prior year on the strength of steady quarterly bookings growth and an increase in completed campaigns during the quarter. As we previously announced, managed services bookings, a key metric measuring sales orders we received, net of cancellations and refunds during the period, reached another all-time high of $12.1 million for the first quarter of 2022, an 88% increase over Q1 of 2021. Our steady quarterly bookings growth enhanced revenue growth, demonstrates the demand for managed services continues to increase as new and existing customers are shifting more of their marketing spend to influence our marketing campaigns. Sales and marketing costs were $2.5 million in the first quarter of 2022, or 21% above the comparative quarter due primarily to higher sales compensation, which varies with higher bookings and increased marketing costs, including additional head count associated with driving customer growth. Based on the growth percentages we are seeing, we believe we continue to gain market share in the influencer marketing industry, which market or forecast will grow 11% this year alone, our 30% revenue growth would be nearly 3x the industry growth rate. This aligns with the tremendous growth we expect to continue seeing in content creation across various platforms and the number of brands looking to benefit from partnering with these emerging influencers, working with influencers can provide incredible value for brands versus other forms of marketing, which continue to push the space forward If there is one constant in the world it has changed. It is now my pleasure to introduce your host Ryan Schram, President and Chief Operating Officer. And I think it's part of the thought process tying back to what Ted shared in his remarks also that we think that other companies that are smaller competitors, but given the fragmented nature of influencer marketing, are still taking share that we don't have, but we're reluctant to pull too heavily off the preverbal gas because we think that can be a real opportunity for IZEA strategically, Jon. We are ultimately going to be transitioning from that platform to this new platform, that's designed to give us a lot more flexibility in terms of the way that clients manage their campaigns and what platforms that they are activating on, but it's important to understand that IZEAx really services our managed services team, as well as the SaaS customers that are licensing our software on the other side. And that's where you're starting to see this confluence of social networks and the software that powers them with different forms of hardware, whereas, today most of the experiences that IZEA helps facilitate are taking place on a mobile device or on a laptop perhaps, we envision a future not too far down the road where that could be just as much a connected contact lens or a pair of smart sunglasses that would be both on the content creation as well as the content engagement side Elliott."
}