{
    "symbol": "IZEA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 19:23:02",
    "content": "  Operator: Good afternoon, ladies and gentlemen and welcome to IZEA Worldwide, Inc., Third Quarter 2022 Earnings Call. Good afternoon, everyone, and thanks for joining us for IZEA's earnings call covering the third quarter of 2022. Earlier this afternoon, the company issued a press release detailing our pertaining to our third quarter of 2022. Before we begin, please take note of the safe harbor paragraph included in today's press release covering the company's financial results and be advised that some of the statement that we make today regarding our business, operations and financial performance may be considered forward-looking and such statements involve a number of risks and uncertainties that could cause actual results to differ materially. Revenue for the third quarter of 2022 totalled $10.8 million, 40% higher than in Q3 of 2021. We recorded $350,000 in net revenue from our SaaS offerings during the current quarter down 23% from the prior year quarter. Managed services revenue grew by $3.2 million quarter-over-quarter, primarily due to revenues on one large customer contract, which grew by $2.6 million. Revenues from all other customers grew approximately 10% compared to Q3 of 2021 as previously announced, managed services bookings fell by 27% to $8.2 million in the third quarter of 2022 as we saw, the contracting process slowed down over the summer months. Some of the slowness over the summer is reflected in the current quarter revenue total, but a higher percentage will manifest in Q4 2022 and early 2023 revenues. Our managed services backlog, which represents the total of unrecognized revenue for contracts that are underway as well as recent bookings that have yet to begin invoicing totaled $19.2 million on September 30, 2022. SaaS services revenue consisting of license fees, self-service, marketplace spend fees, and other fees declined by 102,000 in the current quarter or about 23% compared to the prior year quarter. Gross billings for SaaS services fell by 23% quarter-over-quarter, mostly due to a sharp decline in marketplace spend, including fewer marketers and lower average spending levels. Accordingly, our gross margin in the third quarter averaged 39% compared to 48% in the prior year quarter. The increase in the cost of revenue is primarily due to a higher delivery cost on one large customer contract, which made up 31% of total revenues during the current quarter. Sales and marketing costs total $2.5 million during the third quarter, 261,000 or 11.7% higher quarter-over-quarter. General and administrative costs total $2.9 million during the third quarter, 256,000 or 9.7% higher quarter-over-quarter due primarily to higher professional fees associated with changing our auditor. Our net loss was $906,000 for the third quarter of 2022 or $0.01 per share compared to a net loss of $1.4 million in the prior year quarter or $0.02 per share. Adjusted EBITDA was negative $591,000 for the third quarter this year compared to a negative $926,000 for the prior year quarter. As of September 30, 2022, we had $67 million in cash and investments down from $75.4 million at the beginning of the year, lower partly due to negative $2.5 million of adjusted EBITDA for the year to day period, with the rest of the change tied up in working capital, mostly due to timing difference of payments and receipts related to our large customer contract. The product and expansion announcements we've made in just the last quarter alone have demonstrated that very clearly, including significant improvements to our creator marketplace on IZEA.com by launching next generation enterprise software solution Flex and the continued growth of geographic markets around the world where we can serve managed service clients in a differentiated and compelling manner. Shareholders can expect as we plan for the fiscal year ahead, IZEA is committed to making important offs where needed and will moderate operating losses prudently due to the current macroeconomic climate. There's so much more to share about Flex's benefits for both Izea's current and future customers, but central to its business strategy is providing the best price to value in the influencer marketing industry, lowering the barrier to entry for enterprise software across the board competitively. Having built a reputation as a trusted strategic partner in the North American and Chinese markets, IZEA has brought our flexible managed services model underpinned by our powerful technology platforms to one of the world's epicenters of advertising itself. As a battle-tested best-in-class partner, IZEA will be filling a significant gap in the market by working both directly with brands or alongside partner agencies while dispensing the mandatory long-term retainers and hourly billing that currently dominate the sector. Thinking about these initiatives holistically, when faced with an uncertain economy or other unexpected volatility, clients and customers tend to double down spending what the companies that they believe have the best customer experience and focus on delivering lasting value, and that is where our efforts remain focused. Across all of our lines of business, team IZEA remains heads down, concentrated on driving a fantastic experience across all of our services and products as we believe putting clients and customers first is the only reliable way to create lasting value for shareholders. Customer contracting throughout the quarter was slower than we expected, particularly for net new clients. As the quarter progressed, we concluded with a strong September, the second best month that we've had so far this year, but that did not make up for the slower proceeding months. We saw our new opportunity pipeline for managed services hitting all-time high in Q3 of 2022, up 40% from the new opportunity pipeline that we delivered a year ago in Q3 of 2021. Brand graphs customer facing experience will be rolled into IZEA Flex in 2023, and we will eventually market under the IZEA brand for all software services. IZEA has a strong pipeline of managed services opportunities, but we must continue to build that pipeline given the longer close cycles and impacts on close rate we have seen in the back half of this year."
}