{
    "symbol": "IZEA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 19:32:02",
    "content": " Total revenue for the fourth quarter of 2022 was $8.8 million, 15% lower compared to the prior year quarter. Managed services revenue was $8.4 million in the fourth quarter, also 15% below the prior year quarter. Managed services revenue for the fourth quarter of 2022 fell by $1.5 million from the prior year's quarter, primarily due to weaker second half of the year bookings. As previously announced, managed services bookings fell by 26% to $7.8 million in the fourth quarter of 2022 compared to the prior year quarter, following a similar percentage decline in the third quarter this year as we saw the contracting process slow down over the summer months. However, due to timing, revenues from this customer increased compared to the prior year fourth quarter, somewhat offsetting a 26% decline in year-over-year quarterly revenues from our other customers. This customer represented 23% of our 2022 managed service bookings, which totaled $37.5 million for the year, representing a 33% decrease in that customer's bookings compared to the prior year. Our managed services backlog, which represents the total of unrecognized revenue for contracts that are underway as well as recent bookings that have yet to begin invoicing, totaled $18.3 million on December 31, 2022, and as previously mentioned, $7.8 million or about 43% is nonrecurring from our largest customer. SaaS services revenue, consisting of license fees, self-service marketplace spend fees and other fees declined by $79,000 in the current quarter or about 18% compared to the prior year quarter. Gross billings for SaaS services fell by 15% compared to the prior year quarter, mostly due to a sharp decline in marketplace spending, including fewer marketers and lower average spending levels. Sales and marketing costs totaled $2.2 million during the fourth quarter, up 2% compared to the prior year quarter. General and administrative costs totaled $1.8 million during the fourth quarter, $1.3 million or 42% less than the prior year quarter, due primarily to capitalized payroll and contracted costs associated with current period platform development."
}