{
    "symbol": "GPC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 14:00:15",
    "content": " Segment margin of 9.5%, up 80 basis points from the prior year and adjusted earnings per share of $2.05 up 15% from 2021 and our 10th consecutive quarter of double digit earnings growth. For the full year, our strong quarterly performance drove record total sales of $22.1 billion up 17% which follows a 14% increase in 2021. Turning our attention to the fourth quarter performance total sales for the global automotive segment were $3.4 billion, an increase of approximately $243 million or 7.6% versus the same period in 2021. For fiscal year 2022, Global Automotive segment sales was $13.7 billion, an increase of 8.9% from 2021. Global automotive segment profit in the fourth quarter was $295 million and segment operating margin was 8.6%, an increase of 30 basis points versus the same period in 2021. For the year Global Automotive segment profit was $1.2 billion and segment operating margin was 8.7%, an increase of 10 basis points from 2021 and up 110 basis points from 2019. In the Asia Pac automotive business, sales in the fourth quarter increased approximately 10% in local currency from the same period in the prior year with comparable sales growth of approximately 7%. During the fourth quarter, total sales at Motion were $2.1 billion, an increase of approximately $478 million or 29.6%. Comparable sales growth, which excludes the benefit of KDG, increased approximately 17% in the fourth quarter versus last year. Industrial segment profit in the fourth quarter was $230 million or 11% of sales, representing a 150 basis point increase from the same period last year. For the year, Global Industrial segment profit was approximately $887 million, and segment operating margin was a record 10.5%, an increase of 110 basis points from 2021 and up 240 basis points from 2019. As we continue to invest in organic and acquisitive growth initiatives for both of our segments, it was encouraging to see our core business combined with acquisitions, including KDG, which added more than $1 billion in revenues for 2022 drive strong sales throughout the year. These gains were partially offset by a few key factors: first, moderating year-over-year supplier incentives pressured gross margin by approximately 30 basis points; second, a shift in the mix of our sales based on the strength of our industrial business impacted gross margin by approximately 30 basis points; finally, foreign currency and inflation impacted gross margin by approximately 50 basis points. Our total operating and non-operating expenses in the fourth quarter, excluding adjustments, were approximately $1.6 billion, up 16.6% from 2021 and a 28.7% of sales compared to 28.3% of sales in the prior year. Segment profit in the fourth quarter was $526 million, up 25%, and our segment profit margin was 9.5%, an impressive 80 basis point increase from the same period in 2021. With strong earnings growth and improved working capital, we generated $222 million in cash from operations in the fourth quarter and $1.5 billion for the full year, a 17% increase from 2021."
}