{
    "symbol": "GPC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 15:39:11",
    "content": " A few highlights in the quarter include another quarterly sales record for GPC and our automotive and industrial segment, segment operating margin expansion in both segments and for GPC overall, record quarterly earnings and double-digit EPS growth for the eighth consecutive quarter and strong cash flow generation and the further strengthening of our balance sheet. Turning to the performance details by segment total sales for our global automotive segment were $3.5 billion in the second quarter, an increase of approximately $271 million or 8.5% versus the same period last year. Global Automotive segment profit was $323 million and segment operating margin was 9.3%, representing a 20 basis point increase from the same period last year. Comparable sales were up 8% from last year and up 26% on a two-year stack, both commercial and retail sales performed well with Repco and NAPA growth driven by strong execution of complimentary customer value propositions and robust demand. During the second quarter, total sales at Motion were $2.1 billion, an increase of approximately $547 million or 34.5%. Select initiative highlights contributing to the strong performance in the industrial business include sales programs to capture profitable share of wallet with target accounts, data driven, strategic pricing, and sourcing programs, technology investments to enhance the omni-channel experience and inventory productivity and footprint optimization initiatives. Total GPC sales were $5.6 billion in the second quarter, up $819 million or 17.1% from last year. With our strong performance, segment profit was $548 million up 24%, and our segment profit margin was 9.8%, a 60 basis point increase from last year and up 160 basis points from 2019. During 2022, we have invested $153 million in capital expenditures, including $75 million in the second quarter and continue to plan for additional strategic investments through the balance of the year."
}