{
    "symbol": "GPC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 15:19:03",
    "content": " The GPC team is focused on key strategic priorities to sustain accelerated sales growth, improved gross margins and enhanced operational efficiencies in the face of ongoing supply chain challenges and inflationary pressures at levels we haven’t seen in 40 plus years. Total sales for global automotive were 3.3 billion for the quarter, and 11% increase from 2021 and representing 62% of total company’s sales. This compares to 218 million or $1.50 per adjusted diluted share in the prior year, an increase of 24%; really solid work across our global teams to achieve this strong growth in the first quarter. So in closing, we’re proud of our progress in the first quarter, and the strong results to start the year, delivering a new sales record, continued margin expansion, double-digit earnings growth, a strengthened balance sheet, and strong cash flow highlight our first quarter performance. So certainly what went into our thinking, the stronger quarter that we had, I mean, really couldn’t be more pleased with both our automotive and industrial teams and the stronger comp sales that they delivered. Yeah, look, and again, as we have contemplated, when you look at what we’re contemplating for the full year, moving comps of 6% to 8% for automotive and 5% to 7% for industrial, we were pleased to take those comps, up 100 BPs. We’re also seeing good increases, solid increases in segments like aggregate, cement, conveyance logistics products, which really points to the strength and expansion we’re seeing in distribution centers around the country; equipment and machinery, which is our single largest segment, again, really, really strong growth in the quarter. And then related to your second question, Scott, on automotive, and the higher price points are we seeing consumers trade down; we didn’t see much of it in Q1, I think as evidenced by our strong 12% comp increase, it was strong across just about every product category."
}