{
    "symbol": "CORT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 19:59:06",
    "content": " We expect to make further progress in the next 12 months with the submission of relacorilant's NDA in Cushing's syndrome and enrollment of our confirmatory Phase 3 trial of relacorilant in platinum-resistant ovarian cancer, Phase 2 trial of dazucorilant in ALS, and Phase 2 trial of miricorilant in NASH. By a different mechanism, relacorilant also does not appear to cause hypokalemia, low potassium, a serious side effect experienced by 44% of patients in Korlym's pivotal trial. Our second Phase 3 trial in hypercortisolism, GRADIENT, is studying relacorilant's effects in patients whose Cushing's syndrome is caused by an adrenal adenoma or adrenal hyperplasia. In our successful controlled Phase 2 trial in women with platinum-resistant ovarian cancer, the addition of a selective cortisol modulator, relacorilant, enhanced the effect of chemotherapy, likely by blending cortisol's anti-apoptotic effect. ROSELLA's design closely tracks our Phase 2 study with planned enrollment of 360 women, randomized one-to-one to receive either relacorilant plus nab-paclitaxel or nab-paclitaxel alone. Leading gynecological oncologists have told this that in their view, relacorilant's potential benefit, improved survival without increased side effect burden, would constitute an important medical advance, and relacorilant plus nab-paclitaxel has the potential to become a new standard of care in women with platinum-resistant ovarian cancer. We are conducting a Phase 1b trial of relacorilant plus the PD-1 checkpoint inhibitor, pembrolizumab, Merck's drug KEYTRUDA, in patients with advanced adrenal cancer whose tumors produce excess cortisol. Our trial is evaluating whether relacorilant can treat these patients' Cushing's syndrome by reducing excess cortisol and by reversing cortisol-induced immune suppression, allow pembrolizumab to achieve its full cancer killing effect. Next week, we're having an investigator meeting in Europe with all of the top investigators, I think there's about 50 investigators attending that investigator meeting, and we expect to see the same result of them seeing the same -- and having the same excitement of relacorilant plus nab-paclitaxel for women in their practice."
}