{
    "symbol": "CORT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 23:11:04",
    "content": " Diagnosing and treating patients with a complex disease such as Cushing's Syndrome requires frequent input in person contact with-- Revenue in the third quarter was affected by fewer than expected in person interactions, as many physician practices have not returned to pre-pandemic patterns of activity. Our trial is evaluating with a relacorilant and treat these patients Cushing's Syndrome by reducing excess cortisol activity and by reversing cortisol induced immune suppression, allow pembrolizumab to achieve its own cancer killing effect. Unlike Korlym, it does not bind to the progesterone receptor PR for short, and so does not cause PR related side effects including termination of pregnancy, endometrial thickening, and vaginal bleeding by a different mechanism Korlym also does not appear to cause hypokalemia, low potassium, serious side effects experienced by 44% of patients in Korlym's pivotal trial. Our second Phase 3 trial, GRADIENT, is studying Relacorilant's effects in patients whose Cushing's Syndrome is caused by an adrenal adenoma or adrenal hyperplasia. And part of your question was around, although we're not maybe in the height of the pandemic, some practices and health groups that maybe weren't always up to seeing clinical specialists in the past I would say somewhat taken advantage of the change and of the situation now and closed their doors to pharmaceutical reps which is a shame because a lot of newest -- the newest information and science actually delivered by industry\n Edward, what I what I'm really just like to answer the question, just to really give you the kind of full round is that. And so that's going to be our focus is to make sure that we fully understand all of that data, because we believe, when we produce the results, and we communicate those results, we want to make sure that we're clear where we understand and therefore you understand the benefit that miricorilant can bring to these patients. It's really been known for quite a while, probably 20 years that patients with ALS have hypercortisolism, the exhibit hypercortisolism, never really been known what to do about that, or if that was, in fact, leading to their disease."
}