{
    "symbol": "LBRT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 17:37:09",
    "content": " Fourth quarter revenue of $1.2 billion increased 3% sequentially, and adjusted EBITDA grew 7% sequentially to $295 million as continued momentum from strong execution in the third quarter and strengthening pricing more than offset weather and holiday seasonality. Two factors summarized today's frac market, full utilization of existing frac capacity and strong demand for gas-powered fleets that significantly reduced fuel costs natural gas is much cheaper than diesel, while driving down frac fleet emissions. This transition to natural gas-powered fleets is happening at a measured pace, roughly aligned with the attrition of the industry's older generation diesel frac capacity. Over the past few years, Liberty's team has rapidly innovated to develop the most technically advantaged frac fleet with digiFrac and 2022 marks the first commercial deployment of these game-changing pumps. In 2023, we are targeting approximately 40% to 50% growth in adjusted EBITDA with no meaningful change to our fleet count from today's levels. In the fourth quarter, adjusted EBITDA increased by 7% sequentially in a seasonally weaker quarter, and we reduced net debt by $55 million, while we invested $116 million in capital expenditures and returned $64 million to shareholders. Our team delivered 68% revenue growth, approximately $400 million of free cash flow generation defined as adjusted EBITDA less capital expenditures and nearly 50% free cash flow to adjusted EBITDA conversion ratio. Looking forward, we are targeting approximately 40% to 50% growth in adjusted EBITDA year-over-year in 2023, with no meaningful change in our fleet count from today's levels. I'll turn it back. The 40% to 50% EBITDA growth, it's about $1.25 billion, and we think about half of that is around $600 million for CapEx for the year. I'll turn it back. Yes sorry, '23 so for 2023 cash tax is around 10% of pretax net income obviously we see CapEx around about 50% of EBITDA, interest is relatively diminimis, because we got - it's relatively small amount of debt and those and we're going to have slight build of working capital as revenue is going to increase from Q4 levels through the end of the year, but that will be relatively small. Obviously as it - it depends on market conditions, whether it's the earnings that we're going to end up with EBITDA, the amount we will spend on CapEx and the speed at which we rolled out to digiFrac. I'll turn it back. I'll turn it back."
}