{
    "symbol": "LBRT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 17:53:09",
    "content": " Importantly, these long-term, dedicated customers seek additional next-generation fleets that are not available today in the market and Liberty is providing an avenue to serve those customers and simultaneously driving free cash flow from these existing fleets to reinvest in our fleet modernization program and free cash flow. We are now targeting capital expenditures of $500 million to $550 million for full year 2022, approximately $200 million increase reflects an additional next-generation technology investments, including incremental spending, additional digiFrac fleets and PropX sand handling of wet sand equipment, as well as capital investment in the frac fleet reactivation and with the transaction of approximately $55 million to $60 million, including the one fleets deployed in the second quarter and the balance that will be deployed in the second half of the year. Please go ahead with your question. Chase, we really got some piggyback on sort of what we announced at the beginning part of the year, right, the 200 change that was announced we think about it, there maybe two newbuild digiFrac fleets $120 million, probably, the $50 million to $58 million with the reactivations and the balances just to make some additional wet sand handling, technologies and some margin build for projects that were green lighted with the improved pricing. So where all we go shy about predicting the future, in fact we did say a year ago that we return to mid cycle economics this year and that was based on anything specific, itâ\u0080\u0099s just based on where margins are awful, supply shrinks and eventually demand will grow, but just supply shrinkage alone we are going to fix the marketplace given that two years or two and a half years of four frac market conditions. Please go ahead with your question. And so as we think about contracting next generation fleets to the point Chris made earlier, the fuel savings opportunity there is massive, maybe we are $20 million to $25 million annually and so we think about where leading edge Tier 2 diesel pricing is and then the fuel savings opportunity there, and of course, we want to capture some meaningful piece of as well and that provide guidance as to where we want to set pricing for our next-generation capacity we are deploying. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. The fleet count from the start of the year till today maybe a little 10%, growing a little bit fast at the start of the year, probably moves a few percent from here at the end of the year and we sort of model next year as sort of flattish at the end of this year, because there is simply isnâ\u0080\u0099t, people wanted 20 more fleets next year, I simply donâ\u0080\u0099t think they are there. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question."
}