{
    "symbol": "ENTA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-08 21:08:11",
    "content": " So Yasmeen, again the RSVP so called the RSVP patient populations, otherwise healthy -- otherwise healthy adults, which is probably not where the -- it's a great sort of staging trial and it's a great bridge from our challenge study into other patient populations adult and peds, but it's not the main patient population that we would be focused on and instead going after the three high risk once that I had mentioned. But as it pertains to more a longer NUC study, I think was your other question, could you do a core and a NUC for a really long time, I mean, that's probably not super high up on our list, but it is something that I know KOLs think could work over time, you just have to be patient enough to run those kinds of studies and sort of launch that satellite and then hope that it reports data back after a significant period of time. Well, I guess you could never really know the answer to that without doing the study, but what we did find in this patient population that -- in RSVP, we think it will substantially mirror the challenge setting that's -- that should be -- we think that should be adequate, when you get into the immune compromised setting, RSVTX, the hematopoietic cell transplant recipients are highly I mean suppressed in the first year close transplant and for these individuals, who don't have confident full immune system helping them, we are dosing longer 21 days in fact in that study. So there is just different things going on that you need to be able to understand and I think any time a patient's on concomitant meds, it's a -- the question that physicians will need to understand and explain to patients and then set up whatever plan of attack that you would need to set up to make sure everyone is safely medicated. Like one of the other things, just during the pandemic, the transplant recipients are probably among the most cautious people, right, because they're immune suppressed, they have to be incredibly careful post-transplant because of COVID and so that raises other special challenges during the pandemic, but we're just going to have to, just like with RSVP we had to -- as you know was compromised by the pandemic for a while and we just needed to be ready with sites and all the appropriate spots for when things opened up a little bit and then take advantage of harvesting the trial enrollment. So I can't really, I guess speak to which data would come first, we haven't -- we're going to begin dosing 235 soon and we'll get into that study and get the various cohorts progressed, so depending upon how many doses we have et cetera, et cetera, it's safe to say they're -- they're probably both Q2, but exactly which one's first, I can't really speak to today. And is that part of your assumption in your guidance and I'm just looking at R&D, because you came in at around $49 million this year, I feel like you have a lot going on in your pipeline, you're guiding to $168 million, sorry $150 million to $170 million, where -- like how do we kind of make the math work with all these studies going on, is there something, I know a couple of things probably wrapped up in the fourth quarter, maybe a wrapping up in the first quarter, but given the -- \n Sure. The strain that you used in the challenge study, is that like pretty representative of kind of how the different -- because virus out there, it just came to my attention because you talked about the strains going around right now, how similar or divergent can strains be for RSV from and compared to what you looked down the challenge study, because as I recall, yours was one of the more it seems like, I don't know if the right word, is virulent or whatever but you had one of the higher viral loads, as I was kind of looking at across other challenge studies."
}