{
    "symbol": "ELV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 11:44:04",
    "content": " Our focused efforts and investments in these areas are resonating with employers and state partners driving strong organic membership growth in our commercial and government health benefits businesses, as well as rapid growth for Carelon and IngenioRx. As we discussed earlier this year, Carelonâ\u0080\u0099s AIM Specialty Health business expanded its risk-based contract with our commercial health plans to perform focused management of select clinical conditions such as oncology, surgery and diagnostic imaging to cover our entire 14 state footprint at the beginning of this year. We are pleased to have delivered another quarter of double-digit growth in revenue, operating income and adjusted earnings per share, driven by the disciplined execution of our strategy and ongoing growth of health benefits and services businesses, progressing us further down our path of transforming from a health benefits company to a lifetime trusted partner in health. Our industry-leading organic enrollment growth, which constituted nearly 90% of our total enrollment growth year-over-year, was led by strong sales in our commercial fee-based membership, growth in Medicaid driven in large part by the ongoing suspension of eligibility redeterminations and growth in excess of the overall market in our individual Medicare Advantage business, primarily driven by dual eligible members. We earned higher premium revenue driven by membership growth in Medicaid, including the acquisitions of Integra and Paramount; Medicare; and commercial risk and fee-based membership growth and premium rate increases to cover overall cost trends in all of our health benefits lines. Revenue eliminating consolidation, a proxy for affiliated business between our risk-based health plans and our services businesses, grew 17% year-over-year in the third quarter, representing approximately 21% of our consolidated benefit expense, up from approximately 20% a year ago."
}