{
    "symbol": "ELV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 10:29:02",
    "content": " Today, we're pleased to share that Elevance Health delivered strong fourth quarter results, closing out another year of growth, consistent with our long-term targets and considerable progress in our transformation to become a lifetime trusted health partner. Elevance Health ended 2022, serving more than 47.5 million medical members, up nearly 2.2 million members year-over-year, including more than 1 million new commercial and over 1 million new government members, investments in enhancing the customer experience, delivering innovative, customized whole health solutions, deepening digital engagement, and prioritizing health equity, all helped to deliver strong growth across customer segments. Membership growth, coupled with expansion in both the scope and scale of Caroline's business with our health plans, helped to propel double-digit growth in CarelonRx and Carelon services. Our guidance reflects double-digit growth in operating earnings in each of our health benefits and Carelon businesses that will be driven by the focused execution of our enterprise strategy, to optimize our health benefits business, invest in high-growth opportunities and accelerate capabilities and services. Fourth quarter adjusted earnings per share of $5.23 was ahead of our expectations and drove full-year adjusted earnings per share to $29.7, reflecting growth of over 15% year-over-year off of our adjusted 2021 baseline of $25.20 and above our long-term 12% to 15% annual earnings per share growth target. Total operating revenue for the year was nearly $156 billion, an increase of approximately 14% over the prior year, reflecting solid growth in our health benefits businesses and continued momentum in Carelon. In 2022, we produced another year of strong operating cash flow of $8.4 billion, representing 1.4 times net income, which was significantly better than our outlook to start the year and was driven by stronger risk-based membership growth and maintaining a prudent balance sheet. As we've continued down the path of scaling Carelon by addressing the needs of our commercial, Medicare and Medicaid health benefits businesses, it's become increasingly apparent that the similarities between our health plans have evolved to outnumber the differences. To ensure a smooth transition to our new reporting structure, we have also included a supplemental table in this morning's press release, showing our quarterly and full year 2022 results pro forma for new reporting structure alongside new supplemental performance metrics for CarelonRx and Carelon services that can be used to model revenue for each business. 2023 will be a year of optimization, but we will also demonstrate the balance and resilience of our health benefits businesses as we execute the planned recovery of our commercial and Medicare health plan margins from pandemic era low's, which we expect will more than offset the impact of membership attrition and margin normalization in our Medicaid business when eligibility redeterminations resume. The consolidated medical loss ratio is expected to be 87.2% in 2023, plus or minus 50 basis points, an improvement of approximately 20 basis points compared with 2022, primarily driven by the re-pricing of commercial risk-based business and margin expansion in Medicare Advantage, related to the improved reimbursement levels across rates, risk adjustment and star quality performance. The SG&A expense ratio is expected to be 11.2%, plus or minus 50 basis points, a reduction of 20 basis points at the midpoint driven by expense leverage associated with growth in operating revenue, partially offset by continued growth in our Carelon businesses, which carry higher SG&A ratio than our health benefits business. Our full year operating cash flow is expected to be greater than $7.6 billion, including the unfavorable impact of a timing delay on the payment of approximately $500 million to certain Medicaid state partners that we previously believed we would pay in the fourth quarter of 2022. In closing, 2022 was another year of strong growth for Elevance Health as we continue down the path of transforming from a traditional health insurance company to a lifetime, trusted health partner, and we are well positioned to deliver another year of strong growth in line with our long-term targets in 2023. First, in terms of org structure, we've actually been building our team over the last 18 months, and Pete's done a really strong job of both, bringing individuals who are in the services industry to Carelon, but also taking individuals from our health benefits business, who have a deep understanding of that business and having them lead."
}