{
    "symbol": "ELV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-20 12:26:09",
    "content": " It's the ongoing momentum in every one of our businesses, driven by the disciplined execution of the strategy we shared with you at last year's investor conference, coupled with the balance and resilience of our core benefits business that is allowing us to produce this level of growth. Today, you can see in our results that commercial group fee-based enrollment grew by over 750,000 members in the first quarter alone, with a meaningful proportion of that growth driven by existing large employer clients consolidating their business with Anthem after working with us on a piece of their business in the past. As Gail mentioned, we delivered strong first quarter results, including GAAP earnings per share of $7.39 and adjusted earnings per share of $8.25, reflecting growth of approximately 18% year-over-year. Commercial membership is off to an especially strong start this year as Anthem's integrated solutions, which focus on Whole Health, the customer experience and total cost of care continue to resonate in the employer market. First quarter operating revenue of $37.9 billion increased $5.8 billion or 18% over the prior year quarter, with strong growth in each and every one of our businesses. With the risk transfer between businesses, we expect more seasonality in DBG's earnings with a larger proportion of full year earnings in the first quarter relative to prior years and a decrease in the seasonality inherent in the commercial business. Anthem's consolidated benefit expense ratio for the first quarter was 86.1%, an increase of 50 basis points over the first quarter of 2021, primarily driven by the continued shift in mix of business towards government, which has a higher medical loss ratio. These opportunities, coupled with the expectation of continued strong double-digit growth in our services businesses, Anthem's programmatic approach to M&A and our opportunistic focus on share repurchases, leave Anthem uniquely well positioned for growth in the coming years. Certainly, higher satisfaction, better and predictable outcomes from our health plans higher star ratings, which we think because of the alignment drives and greater stability for our benefits business, MA, our Medicare Advantage business, but also our Commercial and Medicaid businesses are a really important part of the strategy."
}