{
    "symbol": "AMPL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 02:06:02",
    "content": " During today’s call, management will make forward-looking statements, including statements regarding our financial outlook for the second quarter and full year 2022, the expected performance of our products, our expected quarterly and long-term growth, accelerated investments and our overall future prospects. Dropbox’s partnership with Amplitude, enables teams to analyze end-to-end product experiences, run measurable experiments faster and ultimately better understand their customer needs and Dropbox – in Q1, Dropbox scaled their Amplitude Analytics implementation to more products and added Amplitude Experiment, which allowed them to conclude experiments significantly faster than what they were using before. I think there is – the first thing to understand is that what we are seeing in the market is that customers don’t really think about themselves differently if I am in the marketing experience versus if I am in the product experience, it’s just all one end to end journey about customer experience. I think the updates that Gartner’s market guide provided where they said, hey, marketing analytics is going to converge with product analytics/digital analytics is just kind of another sign and often with analysts they are really just playing catch up to what they see in market. And I think what we saw in Q1 both kind of the fact that we hit 126% net retention rate, the fact that we had our second largest expansion ever is we actually saw customers going no, we really do believe product led growth is very critical. And there is, what was really interesting is, if you hear the party line from Google, they say, “Hey, everyone is happy on this migration.” But their customers and partners are just or anything, but and so it’s I think that will – we will continue to see more customers landing and having switched off of Google Analytics to Amplitude. I think when we see us land quite consistently and then it’s really that kind of first expansion to a core product or to a suite of products we will become standardized on Amplitude that can ask variability and timing, because that depends on when different executives are bought into product led growth and data driven product that depends on proving out that success in the first product."
}