{
    "symbol": "AMPL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 23:42:06",
    "content": " Filing a company that you would think they've already been doing product analytics and digital analytics for a long time, going, 'Hey, wow, maybe this isn't the best wayâ\u0080\u0099, whether it's their in-house solution or they were using some existing marketing solution, going, 'Hey, is there something betterâ\u0080\u0099, as they evaluate and they discover Amplitude and they're moving over to us. And so what we want to do, all of them have confidence that they're going to increase their spend with Amplitude long term and so we're deploying different levers to help them out, whether from helping them track the ROI that spend better by seeing what data is being used, who is using it to, selling -- getting them additional products if they're not getting all the usage that they want out of  or in some cases, decreasing the volume that they're doing with Amplitude. Some of the cutback that you're seeing is actually as a result of us kind of bringing in new leadership and them saying, \"Hey, let's take a pause on things we know are not working, so that I can actually redeploy and use them on new bets and new things that I think we're working even better\". And then just when we â\u0080\u0093 when you think about the coming quarters and even going into next year, the Google Analytics opportunity, are you expecting that to ramp-up, or is the â\u0080\u0093 is what you're seeing now in terms of the impact on new customers and the migrations that are taking place. One of the big opportunities in 2023 for us is we're going to be focusing more on a product-led growth motion, which includes a self-service and a whole bunch of other things to allow customers to get started at lower price points or more easily with Amplitude as we get into next year. I think the way I think about setting it up is we're building out the leadership from to take us from here to $1 billion in revenue, and that's a new kind of stage for us as a company."
}