{
    "symbol": "TMO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 13:05:36",
    "content": " Our adjusted operating margin in the second quarter was 23.7% and we delivered another quarter of strong adjusted EPS performance, achieving $5.51 per share. We are increasing our revenue guidance by $700 million to $43.15 billion, which would result in 10% reported revenue growth over 2021 and we are raising our 2022 adjusted EPS guidance by $0.28 to $22.93 per share. This higher outlook primarily reflects the strength of our core business and additional contribution of COVID-19 testing revenue, which are more than offsetting the increased foreign exchange headwinds, demonstrating how well we operate with speed and scale to enable our customer success and navigate dynamic macro environments. This included 13% core organic revenue growth, $630 million of COVID-19 testing revenue, $5.51 of adjusted earnings per share, and over $1 billion of free cash flow. Revenue in Q2 was $930 million higher than we had incorporated in our previous 2022 guidance, with $640 million driven by ongoing strength in the core business and $400 million from testing, partially offset by $110 million due to higher headwind from foreign exchange. In our previous guidance, we had assumed a $200 million headwind from the lockdowns in China and we offset all of that, half from strong local core growth and half from local testing support, a great achievement by our China team. With respect to our operational performance, adjusted operating income in the quarter decreased 3% and adjusted operating margin was 23.7%, 530 basis points lower than Q2 last year. Adjusted operating margin was slightly higher than we had anticipated in our prior guidance for Q2, reflecting how our growth strategy and PPI business system enabled us to continue to manage dynamic times. Total company adjusted gross margin in the quarter came in at 43.2%, 740 basis points lower than Q2 last year. The R&D expense was approximately $360 million in Q2, representing growth of 6% over the prior year quarter. While Q2 adjusted operating income decreased 1% in the quarter, adjusted operating margin was 22.1%, up 220 basis points from the prior year quarter. Q2 adjusted operating income in the segment increased 55% and adjusted operating margin was 12.5%, which is 10 basis points higher than the prior year quarter. So starting with the $750 million increase in the outlook for the core business, this reflects a strong performance in Q2 and a $100 million increase in the core organic outlook for the second half of the year, and that second half raise reflects higher price we put in place to offset higher inflation versus the previous guidance. As I mentioned previously, the increase in core revenue guidance raised the full year outlook for core organic revenue growth from 9% to 11%. PPD, our clinical research business is now expected to deliver $6.8 billion of revenue in 2022, which represents 12% core organic revenue growth on a full year basis for this business, up 1% from our previous guidance. So, Matt, thanks for the question. So, Matt, thanks for the question."
}