{
    "symbol": "TMO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 13:04:08",
    "content": " And finally, in diagnostics and health care, in Q4, revenue was approximately 40% lower than the prior year quarter and 25% lower than full year 2021. For the full year, PPD delivered core organic growth in the high teens, generating over $7 billion in revenue and contributing over $2 to our adjusted earnings per share. For the quarter and the full year, we delivered 14% core organic revenue growth. We offset $4.2 billion less testing revenue, which was a headwind of over 10%, and still delivered slightly positive organic growth for the year. On the top line as I mentioned in Q4, we delivered 14% core organic revenue growth and $370 million of testing revenue. With respect to our operational performance, adjusted operating income in the quarter decreased 19% and adjusted operating margin was 22.4%, 710 basis points lower than Q4 last year. For the full year, adjusted operating income decreased 9% and adjusted operating margin was 24.5%, which is 650 basis points lower than 2021. Total company adjusted gross margin in the quarter came in at 41.4%, 910 basis points lower than Q4 last year. For the full year, adjusted gross margin was 43.5%, down 810 basis points versus the prior year. For the full year, adjusted SG&A was 15.8% of revenue, an improvement of 130 basis points compared to 2021. For the full year R&D expense was $1.5 billion, representing 5% growth over the prior year, reflecting our ongoing investments in high impact innovation. Our adjusted tax rate in the quarter was 12.8%, which is a 100 basis points lower than Q4 last year, reflecting the results of our tax planning activities. Moving on to the segment details, starting with Life Sciences Solutions, Q4 reported revenue in this segment declined 27%, and organic revenue was 24% lower than the prior year quarter. Q4 adjusted operating income in Life Sciences Solutions decreased 48% and adjusted operating margin was 34.1%, down 14 percentage points versus the prior year quarter. And for the full year, adjusted operating income decreased 29% and adjusted operating margin was 41.2%, a decrease of 880 basis points versus 2021. Q4 adjusted operating income in the segment increased 25% and adjusted operating margin was 25.4%, up 330 basis points year-over-year. For the full year, adjusted operating income increased 26% and adjusted operating margin was 22.8%, up 310 basis points versus 2021. In Q4, reported revenue declined 23% and organic revenue was 20% lower than the prior year quarter. For the full year, reported revenue in the segment decreased 16% and organic revenue was 13% lower than 2021. Q4 adjusted operating income decreased 30% in the quarter and adjusted operating margin was 18.6%, down 190 basis points versus Q4 2021. For the full year, adjusted operating income decreased 20% and adjusted operating margin was 21.5%, down 110 basis points versus 2021. PPD at Clinical Research business continued to perform very well, and during the quarter it delivered over 20% core organic revenue growth and contributed $1.9 billion of revenue to the segment. Q4 adjusted operating income in the segment increased 73% and adjusted operating margin was 14.1%, which is 260 basis points higher than Q4 2021. For the full year, adjusted operating income increased 56% and adjusted operating margin was 12.8%, up 40 basis points versus 2021. Our initial guidance for 2023 assumes 7% core organic revenue growth, $400 million in testing revenue, $250 million of revenue from acquisitions and a tailwind of $100 million from FX. Even with this headwind, weâ\u0080\u0099re expecting to deliver 7% core organic revenue growth in 2023, demonstrating the strength of our initial outlook, the agility with which weâ\u0080\u0099re managing the business and the ongoing benefits of our growth strategy. With regards to FX in 2023, weâ\u0080\u0099re assuming itâ\u0080\u0099s a year-over-year tailwind of approximately a $100 million of revenue or 0.2% and $0.04 to adjusted EPS also 0.2%. From a foreign exchange standpoint while a slight tailwind for the year as a whole in Q1, FX is expected to be a year-over-year headwind of approximately $200 million of revenue and $80 million of adjusted operating income."
}