{
    "symbol": "TMO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 12:20:05",
    "content": " Our adjusted operating income was $2.37 billion and we delivered another quarter of strong adjusted EPS performance, achieving $5.08 per share. So to summarize our key takeaways in the third quarter, our outstanding results in Q3 and year-to-date reflect our teamâ\u0080\u0099s excellent execution, the benefits of our proven growth strategy and the positive impact of our PPI Business System. Revenue in Q3 was approximately $800 million higher than we had incorporated in our previous 2022 guidance with just over $600 million driven by another quarter of extremely strong core organic growth, just over $200 million from additional COVID-19 testing revenue, partially offset by a small additional headwind from FX. On the top line in Q3, we delivered 14% core organic revenue growth and $440 million of testing revenue. With respect to our operational performance, adjusted operating income in the quarter decreased 15% and adjusted operating margin was 22.2%, 760 basis points lower than Q3 last year. The companyâ\u0080\u0099s adjusted gross margin in the quarter came in at 41.7%, 970 basis points lower than Q3 last year. Q3 adjusted operating income decreased 29% in the quarter, and adjusted operating margin was 21%, down 210 basis points year-over-year. The increase in the revenue guidance is driven by three elements: an increase of just over $600 million in the outlook for the core business, an increase of just over $200 million for COVID-19 testing revenue and a $200 million decrease to reflect the recent changes in FX rates. From a core organic revenue perspective, the strength of our performance is enabling us to raise our full year core organic revenue growth outlook from 11% to 12%, and there is no change in the assumptions for core organic revenue growth in the fourth quarter. We now expect $2.8 billion of testing revenue for the year, which includes the assumption of an endemic run rate level of $100 million per quarter in Q4. PPD, our clinical research business, is expected to deliver $6.8 billion of revenue in 2022, which represents 14% core organic revenue growth on a full year basis for this business. Should FX rates stay the same as they are right now, we estimate the impact on FX in 2023 would be a year-over-year headwind of approximately $1 billion on revenue and $0.75 on adjusted EPS."
}