{
    "symbol": "ESTA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 21:03:05",
    "content": " Before we begin, I would like to remind you that comments made by management during this call will include forward-looking statements within the meaning of federal securities laws. For a discussion of the principal risk factors and uncertainties that may affect our performance or cause actual results to differ materially from these statements, I encourage you to review our most recent annual and quarterly reports on Form 10-K and Form 10-Q as well as other SEC filings which are available on our website at establishmentlabs.com. I would also like to remind you that our comments will include certain non-GAAP financial measures with respect to our performance, including but not limited to sales results which can be stated on a constant currency basis. Please also note that Establishment Labs received an investigational device exemption from the FDA for Motiva implants, is undergoing a clinical trial to support regulatory approval in the United States. Revenue in the third quarter of 2022 totaled $38.2 million, a 32% increase over the third quarter of 2021. Excluding the negative impact of foreign currency changes, our growth in the third quarter would have been approximately 38%. With this commitment to innovation, we are expanding existing markets and creating new categories that will sustain our growth for many years to come. Raj will provide additional detail on our third quarter performance in our updated outlook, including tightening our revenue guidance range to $158 million to $162 million. On Wednesday, October 5, we presented an update on Mia Femtech, the new category we are creating in breast aesthetics. During the presentation, we showed an update on the clinical progress with Mia, our expectations for commercialization in a video of the procedure, as well as testimonials from women who have had the Mia procedure. We are creating a new category in aesthetics for women that donâ\u0080\u0099t want a traditional breast augmentation, but are conscious about the shape and proportions of their breast. The insights for the extensive consumer reasons we have completed, show that many more women are interested in Mia than receiving a traditional augmentation today. In Japan, for example, our primary research showed 155,000 women are interested in Mia with 133,000 saying they are interested in getting the procedure in the next 12 months. As we announced in our second quarter call, all cohorts of our U.S. IDE study are fully enrolled and we are moving diligently through the follow-up. All patients in the cohorts passed a three-year mark in August, and we continue to expect we will submit the fourth and final module to the FDA this quarter. In our Aesthetic Breast Recon franchise, the launch of our Motiva Flora tissue expander in Europe and other CE Mark countries is ongoing. Flora has many advances of other commercially available tissue expanders, including a first-of-its-kind RFID-enabled port which allows for MRI imaging without artifacts. Flora also features our patented, self-friendly smooth silk surface technology and early users have noted improved patient comfort and healthier capsule formation with this unique tissue expander. Adoption will take time, but early efforts have been encouraging and add to our belief that we can help support women in their breast reconstruction journey. Before I turn the call over to Raj to cover our financial results, I wanted to note the publication last month of our annual, post-market surveillance report, which is available on our website. The report, which we update every year, highlights the clinical and safety performance up to 2.5 million Motiva Implants in market over 12 years since we began commercialization in 2010. After more than a decade in the market, Motiva Implants continue to show less than 1% device-related complications leading to re-operation, including capsular contracture and implant rupture. Direct sales were approximately 38% of this total, while distributor sales which can fluctuate based on changes in inventory levels and the timing of reorders made up to balance. From a regional perspective, sales in Europe comprised approximately 23% of global sales; Asia Pacific and Middle East was 44%; and Latin America made up to balance; Brazil which our single largest market globally accounted for approximately 18.6% of total quarterly sales. Both of these factors disproportionately affect our revenues in Europe where surgeons and patients take vacations in the summer months and where we price our products in local currencies like the Euro and British Pound, and many of the markets around the world we price in U.S. dollars. Even with a negative effects of foreign currency exchange rates, overall average selling prices in the third quarter up slightly from the second quarter of 2022. The increase in SG&A in the third quarter resulted from continued normalization in business practices following the disruption from the global pandemic and our prioritization of investment in new growth initiatives like Mia and preparations for our launch in the U.S. R&D expenses for the third quarter increase approximately $1.4 million from the same quarter a year ago to $5.3 million. Total operating expenses for the third quarter were $36.6 million, an increase of approximately $7.9 million from the year-ago period. The increase this period was again due primarily to the normalization of activity and spending relative to a year ago, as well as the investments in growth initiatives. Our cash position as of September 30th was $65.3 million, this compared to $53.4 million at the end of the previous year. As a reminder, the term-loan has three additional tranches totaling $75 million of additional non-dilutive capital we can access on the achievement of revenue and regulatory milestones. Cash used in the third quarter included approximately $5.2 million of investments in our new manufacturing facility that will expand our capacity, produce more than half of the world's breast implants. Under our current forecast, the cash we currently have on hand, as well as the additional capital available to us under our credit facility, allows us to achieve cash flow profitability, while still funding our growth initiatives. However, as we also saw in the third quarter, the steeper headwind from form currency is impacting our report results. At current rates, we estimate a year-over-year currency impact of fourth quarter sales of approximately $2.5 million. In total, we now expect currency will negatively impact our reported revenue this year by approximately $6.5 million or 5 percentage points to full year 2022 sales compared to 2021. Preparing for the launch of Mia and our entering into the U.S. remain top priorities, while operating spending over the near-term is reflecting our investments in these opportunities. While survival rates have improved, the disease can still have a devastating impact on women's lives. For those women who seek breast reconstruction surgery, the availability is low. Less than 10% of women globally approximately receive a breast reconstruction after a mastectomy, and the waiting times in some countries can be as long as 10 years. While our commitment to these initiatives is year around, the month of October, which is breast cancer awareness month is a time to redouble our efforts in awareness and understanding of breast cancer. In partnership with a network of plastic surgeons, this year Establishment Labs provided the resources to allow 310 women in 18 cities across Brazil to receive a breast reconstruction, providing them access to healthcare they were unable to obtain for many years. Is a global medical device company focus on women's health, Establishment Labs has the opportunity and the responsibility to democratize access to breast reconstruction. Not only bringing to market technologies, techniques and education that can improve clinical and aesthetic outcomes, but also promoting education and awareness. We will continue to transform our markets and in doing so we will create new categories for growth, but more importantly, we are creating new options for women around the world and solidifying our credentials as leading the industry to a sustainable future. Please proceed with your question. I'll start with the Motiva U.S. timelines here, J.J. and I'll have a couple of follow ups. Just wondering, it sounds like in the aesthetic cohort, the threshold for at least three years of data â\u0080\u0093 follow-up data post-surgery is satisfied there. And so when we think about that threshold being satisfied and all the other modules in place, is there a pathway perhaps to mid-to-late 2023 U.S. clearance? And we are of course extremely happy that we have crossed that three-year mark, which is in the guidance from the FDA for the approval of silicone gel-filled breast implants. This is a process of continuous communication with the FDA, and of course we will try to find the right scientific forum for the data to be shown at the three year mark. We are always very good at responding as quick as possible and doing everything that we can not to slow down the process, but we are dependent on a foreign external entity like the FDA. And a couple of follow-ups, some pivot to Europe; two-part question for you J.J. would be, are you seeing any evidence of a demand slowdown just due to some economic constraints in Europe as certain regions? But on the flip side in Europe, it's still heavily tilted or textured implants. Definitely there is concern in Europe regarding what's going on with the Ukraine, and all of that but there is no reason to believe at this point that this is going to have a significant impact in the aesthetic market. I would say that in this last quarter we were impacted on currency with the British pound, and also the Euro and this Scandinavian currency is being hit. Many of them are using textured and this is the opportunity for us because when you look at our rate of growth, so plus 30%. So if the market is growing at roughly 3% and we are growing at 30% plus, what that means is that we continue to do our job to be effective at it. Please proceed with your question. Just, more of a structural question about the modular submission process; once you have the first three modules submitted and the clinical module is the last module that you will submit, and then kick off the PMA review time. And this process is continuous and they can always ask questions, and we have had questions from different modules at different times. And then just one follow-up on just, thinking about the U.S. commercial effort and build out of the sales infrastructure may not be ready to talk about that. But any high level kind of clues on the strategy there or any timing about when, when you'll be ready to share the commercial strategy for the U.S.? Thanks for taking the questions. We had Dr. Robert Langer there speaking about his work on implant bio compatibility and that shows you that we are active, but we have to be mindful not to promote ahead of the approval of Motiva Implants? Please proceed with your question. Now that the common specifications have been approved by the European authorities, so with that we do plan to move ahead full steam and get going with the different areas that are necessary for C-mark of the tools, having had the approval for the implants a couple years ago. We are currently in Japan, taking this call because we are continued â\u0080\u0093 continuing to work with our local partners here in Japan, local clinics towards the preparation of the launch. These are early experience cases, but it shows you how, you know, we continue to progress with Mia and we're very happy about that. And this is something we've already built, so we continue to progress with their work necessary for creating all the messaging and everything that makes Mia a new category in breast aesthetic. We're working with local agency specialized in this type of messaging, and we plan to make sure that we are messaging correctly in every, every single market that is significant. Please proceed with your question. Wanted to hear a little bit about Asia, the APAC region, I know that you were just in Thailand recently for your world symposium. It kind of tells you how we see the Asia region growing and it's the area with the fastest growth for us, it's also an area where we see great opportunities with Mia. So definitely we are very excited to see hundreds of plastic surgeons from around Asia Pacific and also from other parts of the world, but mostly from Asia Pacific. In terms of country to country, we don't give specific data country to country, but what I would say, Marie, is that either we are market leaders or in path to leadership short term in every single one of the markets that we participate in. I think, the focus for us is always on safety first, and that is more so in the breast reconstruction market. So the fact that we can bring to women in breast reconstruction, the possibility of doing an MRI during the expansion process of the breast reconstruction, that they have more comfort and less pain and the possibility of reducing radiation oncology levels are all important to us. Just in this meeting in Thailand one of the scientists that has been involved with Mia conducting an independent study comparing our device to another CE Mark device, showed the results from her research in which patients are responding clearly that this is a much more comfortable option. Please proceed with your question. Yes, part of our trip here to Asia has been devoted to update on our different regulatory timelines around Asia. Not only on Motiva Implants, but also on Mia and Flora. And I wanted to ask follow-up on you sort of mentioned in past that the, as a reminder, the facility that you're building is going to be able to produce half the world's breast implants, I think you said. So, I wanted to kind of tie that back into your, I guess, confidence and what you're seeing in some of these other markets where you've been for a while and starting to see market leadership. Yes, I think the way to think about it is that this market for many decades was led by two big companies basically, Mentor the breast division out of Johnson & Johnson and Allergan. So once Allergan retreated from most of these markets, but the four markets where they compete with Motiva, then I think, market leadership tends to look different. And I think that's our job, is to make sure that market leadership can be as high as possible. And remember one of the biggest things that we do is expand markets and we have a lot more work to do, but we actually believe that the fact that you improve the safety levels has an impact in expanding markets. And when we think about what we've been doing over the last couple of days here in Japan, the excitement level from the potential launch of Mia is high and the local partners and clinics understand very well that this can be a major game changer in breast aesthetics in Japan. And Matt, I would just offer too that, we are poised into the two largest markets in the world, in the United States and China, so that capacity is needed for those initiatives along with the continued share gains we're doing in other markets around the world. Please proceed with your question. Thanks for taking the questions. So maybe just on Mia Femtech I guess for the countries where you've already started to receive the regulatory clearances, I believe it might have been Latin America and Asia. And maybe just one quick follow-up, just in terms of the kind of the ASP strategy, I think, in the slides from the Mia Day, it kind of gave a range of like 2,500 to, to 3,500. Of course, we're always going to try to do as best as possible, but that's why we are always conservative on our pricing when it's given in this fashion. And I think Neil, you probably appreciate too in the slides that we presented and talked about at that day, that if you look at the economics to the surgeon at those price points, given the speed at which they can do the procedure, the efficiency at which they can run their practice if they have devoted time to Mia, even at those price points, it still represents quite a bit of value to the surgeon. And so I think it's a question of finding that sweet spot that creates value for us as a company, but also for our partners and surgeons and absolutely for the women who received the procedure. Please proceed with your question. Yes, I mean obviously there is a lot of â\u0080\u0093 currency is fluctuating right, but I think as a start that is not a bad place to be. But yes, and so I would also suggest we'll give a lot more detail and a lot more guidance around 2023 when we report our fourth quarter numbers. And then on the OpEx side, it looks like for the year you are going to end up growing SG&A a bit ahead of where total sales numbers are going to be, even on an underlying basis with all of the investments that you're making for next year in the U.S. and in China, is that growing SG&A similar or ahead of sales a reasonable starting place for next year with all the investments that are going on? And again, all of these plans are in development, right as we think about budgeting for 2023 and what the year looks like. As we stand up â\u0080\u0093 Mia as we stand up the U.S. operation, this is not a time we will see significant leverage from us. However, as those opportunities start to materialize, Mia next year, in the U.S. hopefully not too long after that the leverage will start to show in our model. If I could sneak one last one, Raj, I believe you said 23% European sales and 44% for the APAC region. I know the questions have been asked about the regions already, but I'm wondering if there's anything one time to call out either from a distributor standpoint, APAC that was a pull forward or from Europe that you would highlight kind of to the negative side. That's the major thing, pushing that number to that 23%. We're also seeing stronger seasonality, I think, in Europe. So really nothing one time, I think, the business is doing very well. We're still taking shared most of our markets, so I wouldn't call that anything specific in terms of one time there. And Asia-Pacific is one as I mentioned, we're seeing very strong growth, the traction with implants and the move to Motiva in a lot of these markets continues. And so I think it's again, currency kind of impacting Europe and then just really good growth in a lot of other markets. We look forward to providing our next quarterly update in early 2023, and we wish everyone continued good health."
}