{
    "symbol": "AQST",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 11:45:22",
    "content": " We completed the license of Sympazan to Assertio surpassed 150 million doses of shipped product to multiple licensees, announced early payments to our debt holders to reduce our debt overhang, and ended the fourth quarter with more cash than we had at the end of any other quarter last year. In 2022, we executed on three significant non-dilutive deals that generated over $25 million in cash, significantly streamlined our business to reduce ongoing costs, reduced our ongoing litigation through successfully winning a motion to dismiss in the Sympazan   trust case and gained a tentative approval for LIBERVANT, diazepam buccal film. During the fourth quarter of 2022 and continuing into 2023 we continue to manage the company for success as we received additional non-dilutive capital and reduced expenses going forward to extend our cash runway to support the continued development of our lead product, AQST-109, the first orally administered epinephrine product. For the fourth quarter of 2022 compared to the prior year period, we saw 141% increase in license and royalty revenue due to an increase in our licensee sales of products, a 17% increase in co-development and research fees revenue and a 16% increase in manufacturing and supply revenue due to increased manufacturing volume of Ondif for Hypera in Brazil offset by 79% decrease in proprietary sales net revenue due to the licensing of Sympazan to Assertio in October 2022. The change in net loss was primarily driven by a one-time loss on extinguishment of debt of $13.8 million in 2021, lower non-cash interest expense related to the KYNMOBI monetization transaction of $1.8 million and a decrease in total operational cost and expenses of $1.4 million, primarily due to a reduction in our sales force, subsequent to the out licensing of Sympazan during the fourth quarter of 2022 and lower share-based compensation expense offset by higher raw material and production cost. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}