{
    "symbol": "AQST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 15:45:33",
    "content": " On today's call, I am joined by Dan Barber, Chief Executive Officer; and Ernie Toth, Chief Financial Officer, who are going to provide an overview of recent business developments and performance for second quarter 2022, followed by a Q&A session. We remind you of the company's safe harbor language as outlined in yesterday's earnings release as well as the risks and uncertainties affecting the company as described in the Risk Factors section and other sections included in our annual report on Form 10-K filed with the Securities and Exchange Commission on March 8, 2022, and in our quarterly reports on Form 10-Q and current reports on Form 8-K filed with the SEC. On June 8, we closed on a registered direct offering with a single healthcare-focused institutional investor, and certain of the company's executives, generating net proceeds of approximately $7.8 million after deducting fees and expenses. Excluding the KemPharm milestone of $2 million, as well as the deferred revenue of $2.1 million from the terminated license and supply agreement with Fortovia Therapeutics that was recognized in the first quarter of 2021, but did not reoccur in 2022, total revenue increased by $3.2 million, or 14%. The year-over-year change in net loss was driven by lower revenue, as mentioned earlier, and higher cost and expenses, including severance costs of $2.3 million in the second quarter of 2022. Non-GAAP adjusted EBITDA loss was $18 million for the 6 months ended June 30, 2022, compared to a loss of $10.3 million for the 6 months ended June 30, 2021. Our updated financial year expectations are: total revenues of approximately $46 million to $49 million, increased from $42 million to $47 million in prior guidance; non-GAAP adjusted gross margin of approximately 70% to 75%; and non-GAAP adjusted EBITDA loss of approximately $37 million to $43 million, improved from $51 million to $58 million in prior guidance. In summary, our 2022 guidance for full year non-GAAP adjusted EBITDA loss reflects continued strong performance by both our commercial operations and manufacturing and supply operations and continued focused R&D investments related to the advancement of AQST-109."
}