{
    "symbol": "WF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 00:19:09",
    "content": " On todayâ\u0080\u0099s call, we have the Woori Financial Group Chairman, Son Tae-Seung; President, Chun Sang-Wook, responsible for the group IR; group CRO, Jung Seok-Yong; group CSO and ESG Officer, Park Jong-il; and group CFO, Lee Sung-Wook, on the call today. Before going into the presentation and the Q&A, I would like to take this opportunity to briefly go over the third quarter highlights and also future business direction. The groupâ\u0080\u0099s 2022 Q3 year-to-date net profit totaled KRW2,661.7 billion, which includes the third quarter net profit of KRW899.8 billion. Moreover, we have already exceeded last yearâ\u0080\u0099s full year performance in only three quarters and the third quarter YTD performance is the strongest level in our history. In addition, in terms of third quarter asset quality, credit cost was 0.24% and the delinquency rate 0.22%, representing the strongest asset quality levels within the industry. As inflation in Korea and abroad led to deeper concerns about consumer price increases, preemptive efforts to improve business efficiency at the group has enabled the group in the third quarter to post a cost/income ratio of 40.5%, an improvement of 4.7% year-over-year. By strengthening our attention to the bottom line, the Woori Financial wants to be in a position to take a big leap forward when economic conditions subside. This is President, Chun Sang-Wook, and I am also responsible for the groupâ\u0080\u0099s IR activities. First, let me discuss the groupâ\u0080\u0099s net income. On a 2022 third quarter year-to-date basis, the groupâ\u0080\u0099s accumulative net income was up 21.1% year-over-year at KRW2,661.7 billion. This is due to our stronger profit generation capabilities, stable asset soundness management and cost efficiency efforts. The third quarter YTD accumulative net operating revenue was KRW7,263 billion, an increase of 17.5% year-over-year. Though funding costs have increased, the groupâ\u0080\u0099s interest income has continued to grow due to our solid asset growth by core subsidiaries. On the non-interest income side, even though there were some non-cash valuation losses due to the movement in our FX rate, stronger synergies were created across affiliates, resulting in core fees driving solid performance. For the third quarter only net operating revenue, it was KRW2,377 billion, up by 11.3% year-over-year. Next is on costs, including group SG&A expenses and credit cost. YTD group SG&A edged up 5.2% year-on-year to KRW2.938 trillion, but the C/I ratio decreased 4.7% year-on-year to record 40.5%. This is ascribable to Woori Financial Groupâ\u0080\u0099s group-wide preemptive cost optimization efforts Meanwhile, YTD group credit cost recorded KRW622 billion, and credit cost ratio posted 0.24%, demonstrating the groupâ\u0080\u0099s stable risk management capabilities. First is the group interest income and NIM or NIM, YTD group net interest income jumped 24.7% year-on-year to KRW6.348 trillion. Q3 bank NIM climbed 4 basis points quarter-on-quarter to record 1.62%, while group NIM, including Woori Card, increased 3 basis points quarter-on-quarter to post 1.86%. Household loans dropped 3% compared to the end of last year and recorded KRW135 trillion due to rising interest rates, including housing market, among other factors. Corporate loans, on the other hand, rose 11% compared to the end of the previous year to record KRW163 trillion, backed by 8.9% increase in Korean won-denominated loans, coupled with a rise in FX rates. In this slide, Woori Financial Group will focus on maintaining the current prime asset ratio of 89.3% as of September 2022 going forward. One-off factors, including soaring FX rates and interest rates depressed Q3 non-interest income compared to the previous quarter. In the face of rising inflation pressures and increasing concerns over cost management, Woori Financial Group will beef up its ongoing preemptive cost optimization efforts, while making sustained investments in digital and IT segments to fuel future growth. Meanwhile, Q3 group credit cost stood at KRW125 billion kept at a stable level with a normalized credit cost ratio of 11 basis points. As of September â\u0080\u0093 late September, group CET1 ratio stood at 10.9%. This is primarily due to an increase in the RWAs among foreign currency assets following FX rate hike despite strong retained earnings, but by modest net income. With that, I would like to conclude Woori Financial Groupâ\u0080\u0099s business report for Q3. Thank you very much. So, first to talk about the NIM outlook that we have to take your questions in order. So if you look at the third quarter NIM levels, it would be 1.62%. So if we go into the year end in terms of expectations, we do think that it will be at the upper level of 1.6%. So as a result of that, we do think that there â\u0080\u0093 we would hope that NIM would expand more rapidly but because there is an economic slowdown and also we do think that in the core areas, there may be a slowdown there. To talk about third quarter about one-off factors, the first is that in terms of the FX rate changes that we have seen, we did have a non-cash valuation loss of around KRW92 billion. And if we take that into consideration, there was around KRW70 billion in terms. Next, I would like to take second question from NH Securities, we have Mr. Jung Jun-Sup. And also with regard to capital ratio, I understand that itâ\u0080\u0099s going to be difficult to have M&A. Please bear with us as we prepare your answer. Yes, this is Lee Sung-Wook, CFO. And we also have foreign currencies and also derivatives, and thatâ\u0080\u0099s with the bank and FX rate skyrocketed to KRW1,400 per dollar, and we also have our investments in derivatives and because of the valuation changes, we do have a lot of RWAs, but I believe that if the FX rates come down, this is going to automatically raise cover. For your information, in 2023, we believe that FX rates will stay really high, therefore, we are going to also approach our business plans in a very conservative way. And when it comes to FX rates and interest rates, if they come down, then we believe that our CET1 ratio is going to recover, then we will seek growth strategies. So maybe if â\u0080\u0093 while we are preparing our answers, if you could just wait for a second, that would be appreciated. First, for the real estate project financing, I think that on overall grounds, if you look at the group as a whole in terms of the exposure, the amount would be around KRW1.8 trillion and around KRW1 trillion of that is on the bank side, and there is no insolvencies on that side at all. And then at the capital side and the investment bank side, would be the remaining balance of where the exposure is. So on a whole, if we look at the substandard and below, it would be around KRW40 billion, and we have a reserve of around KRW20 billion. But if we look at the market concerns on the beach loan side, where there is the most concerned, I donâ\u0080\u0099t think we have a lot of exposure in that area. And the second question that you asked on the capital business for Woori Capital, there was some preemptive measures taken because they were working in line with a lowering or decreasing growth rate environment. Thank you very much. Yes, thank you very much. Please bear with us as we prepare your answer. Thank you very much. But taking into consideration our financial circumstances, we will make a final decision on ERPs, and we also need a Board approval. I am Jung Seok-Yong, CRO, with regard to your second question, real estate PS. Because I do believe that you havenâ\u0080\u0099t asked this question yet, but in terms of our digital direction going forward, maybe CRO, Jung Seok-Yong can take. Jung Seok-Yong, the President maybe can take an opportunity to discuss about our digital strategy, while we are waiting for other questions. While it would be similar to other groups that we have, but to enable universal banking is the big trend that we want to ensure it takes place. But one thing that I would like to highlight is that recently, there is a lot of discussion about super apps or one apps or maybe if you have separate apps for each of your affiliates, whatâ\u0080\u0099s the best approach, I think is a discussion that is taking place. In the case of our Woori Financial Group, I think that it would be a hybrid approach. And at the same time, at the group level or at the bank level, we would have a consolidated one banking application that would cover more of a universal scale, so that customers can be approached through that and that there will be a hybrid approach for how we face our customers. So, that would be the big picture that we have for our digital strategy going forward. So, with regards to the PS exposure that you had and you mentioned before, I would like a question asked about that. But on the corporate side, especially on the SOHO side, I do think that there is a higher level of concerns within the overall market. This is the CRO, Jung Seok-Yong. And not only on the bank side, but on Woori Capital and then on the investment bank side and for other areas of our group, within the group as a whole, if we talk about real estate exposure, this is something that we are monitoring very cautiously. So, in the first half of the year, since the first half, we have been focusing on the prime borrowers and also in terms of the LTV, as recognizes, we keep it as a standard 60% level. So, as a result of that, even if the real estate market would worsen versus the current situation, we do think that in terms of asset quality or in terms of our overall impact, it would be very limited. And in terms of this trend, we do think that this is something that may continue until the beginning of next year in terms of the market in itself. Thank you very much. Thank you very much. Thank you very much. Please bear with us as we prepare your answer. Yes, this is Lee Sung-Wook, CFO. And if you look at the data that we have submitted to the regulatory side, we believe that we satisfy all the regulations so with regard to capital adequacy and soundness, so external and internal economic outlook and environment we are going to do our best in order to maintain a stable dividend payout ratio. Yes, thank you very much. So, now I think that we really have two last questions. So, related to these corporate loans, in terms of what the assets are and what the distribution would be, if you could provide more detail that would be appreciated. Thank you very much. This is the CRO, Jung Seok-Yong. And with regards to capital, of the numbers, if we talk about real estate PS and also real estate mortgage loans, I think that they are different. So, on the corporate side, as mentioned before, of the KRW3.2 trillion that we have around half of it would be real estate related for the project financing. And when we talk about credit, it would be real estate secured loans, real estate project financing in total would be the balance. So, KRW1.7 trillion would be the real estate-related credit. Thank you very much. And if you go into next year, on the funding side, how much do you want to squeeze because I do think that, that could determine how much margin expansion you are able to experience also. So, to summarize the question, you are asking about on the banking side, how much funding, what would be the funding mix for the future in terms of our strategy, our plans and how we are going to manage our margins in light of that overall profile that we want to create. So â\u0080\u0093 and the reasons behind that would be that, of course, the interest rate environment in general is at a higher level. So, right now, at the banking sector as a whole, if you look at the LCR or LDR, so for LDR, it would be 100% and try to be managed stably in that manner. So, as you have just mentioned, in terms of the funding cost rising, of course, in the fourth quarter, we do think that it will continue to rise. But if that stabilizes, and then for next year, as mentioned before, in the market rates in the first quarter, if it peaks-out as we expect, then we do think that in terms of the base rate or the market rate, if it does peak out, then we do think that the decline in the core deposits that we are experiencing will reverse and go to uplift, and that will actually improve our margins. And as mentioned before, on the core ratio side, as we are managing that, if we are moderating out our overall asset growth, then I do believe that as we have expected that we will be able to meet the target levels that we talked about in  or maybe even actually outperform that level. And with this, we would wrap up the 2022 third quarter earnings conference call. Thank you very much."
}