{
    "symbol": "GL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 20:22:04",
    "content": " Please go ahead, sir. In the fourth quarter, net income was $212 million, or $2.14 per share compared to $178 million or $1.76 per share a year ago. Net operating income for the quarter was $221 million or $2.24 per share, an increase of 32% from a year ago. In the life insurance operations, premium revenue for the fourth quarter increased 3% from the year ago quarter to $754 million. The American Income Life life premiums were up 5% over the year ago quarter to $381 million, and life underwriting margin was up 27% to $130 million. In the fourth quarter of 2022, net life sales were $70 million, down 6% from a year ago quarter. At Liberty National, life premiums were up 4% over the year ago quarter to $82 million, and life underwriting margin was up 74% to $21 million. Net life sales increased 24% to $23 million, and net health sales were $9 million, up 14% from the year ago quarter due mainly to increased productivity and agent count. At Family Heritage, health premiums increased 7% over the year ago quarter to $94 million, and health underwriting margin increased 2% to $26 million. In our Direct to Consumer Division at Globe Life, life premiums were flat over the year ago quarter to $238 million, but life underwriting margin increased from $12 million to $39 million. Net life sales were $31 million, down 9% from the year ago quarter due to declines in circulation and response rate. At United American General Agency, health premiums increased 5% over the year ago quarter to $137 million and health underwriting margin increased 1% to $20 million. Net health sales were $20 million, down 25% compared to the year ago quarter, and this decline is due primarily to the market dynamics we saw throughout 2022, including aggressive pricing by competitors on certain Medicare supplement products and a consumer movement to Medicare Advantage. Excess investment income, which for 2022, we defined as net investment income, less required interest on net policy liabilities and debt, was $63 million, up 7% from the year ago quarter. Net investment income was $254 million, up 6% from the year ago quarter. At the midpoint of our guidance, for the full year 2023, we expect to invest approximately $940 million in fixed maturities at an average yield of 5.5% and approximately $310 million in commercial mortgage loans and limited partnership investments with debt-like characteristics at an average cash yield of 7% to 8%. The $118 million combined impact of COVID and higher non-COVID policy obligations was around 4% of total life premium in 2022, down from approximately 6% in 2021. Thank you very much, sir. Please go ahead, sir. Thank you very much, sir. Thank you very much, sir. Please go ahead, sir. Thank you very much, sir. Thank you very much, sir. Please go ahead, sir. Thank you very much, sir. Please go ahead, sir."
}