{
    "symbol": "GL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 15:44:09",
    "content": " In the second quarter, net income was $177 million or $1.79 per share compared to $200 million or $1.92 per share a year ago. Net operating income for the quarter was $205 million or $2.07 per share, an increase of 12% from a year ago. In life insurance operations, premium revenue increased 4% from the year ago quarter to $760 million. At American Income, life premiums were up 8% for the year ago quarter to $376 million and life underwriting margin was up 19% to $128 million. In the second quarter of 2022, net life sales were $85 million, up 16%. At Liberty National, life premiums were up 5% over the year ago quarter to $81 million and life underwriting margin was up 12% to $18 million. Net health sales were $7 million, up 10% from the year ago quarter due mainly to increased agent productivity. At Family Heritage, health premiums increased 7% over the year ago quarter to $91 million and health underwriting margin increased 9% to $24 million. In our direct-to-consumer division of Globe Life, life premiums were flat over the year ago quarter to $249 million, while life underwriting margin declined 16% to $29 million. Net life sales were $33 million, down 23% for the year ago quarter due to lower response rates and lower paid initial premium. At United American General Agency, health premiums increased 16% for the year ago quarter to $135 million and health underwriting margin increased 8% to $19 million. Net health sales were $12 million, up 2% compared to the year ago quarter. Excess investment income, which we define as net investment income less required interest on net policy liabilities and debt, was $57 million, down 4% from the year ago quarter. For the full year, at the midpoint of our guidance, we expect to invest approximately $1.3 billion in fixed maturities at an average yield of 4.9% and approximately $200 million in limited partnership investments with debt-like characteristics at an average yield of around 7.6%. This amount is higher primarily due to the net proceeds of the issuance in May of a 10-year $400 million senior note with a coupon rate of 4.8%, less amounts used to temporarily reduce our commercial paper balances. This amount of excess cash flows, which, again, is before the payment of dividends to shareholders, is lower than the $450 million received in 2021, primarily due to higher COVID life losses and the nearly 15% growth in our exclusive agency sales in 2021, both of which resulted in lower statutory income in 2021 and thus lower cash flows to the parent in 2022 than were received in 2021. Taking into account the liquid assets of $318 million at the end of the second quarter plus the estimated $145 million of excess cash flows expected to be generated in the second half of the year, we anticipate having around $463 million of assets available to the parent for the remainder of the year. Based on the additional claims data we now have available related to first quarter COVID deaths, we now estimate that our average cost per 10,000 U.S. deaths in the quarter was approximately $2.4 million, down from the $3 million average cost previously estimated on our last call. In the second quarter, we estimate that our excess non-COVID life policy obligations were approximately $28 million, $10 million higher than expected, primarily due to adverse development of first quarter incurred losses in our direct-to-consumer channel. For the full year, we anticipate that our excess life policy obligations will be around $64 million or around 2% of our total life premium. All of that difference were related to DTC, and that's -- was about $10 million of additional claims that we're seeing, higher policy obligations incurred in the second quarter relating to those non-COVID claims. So in total, about $45 million -- around $50 million of total excess obligations for direct-to-consumer related to the non-COVID causes of death and probably about, yes, about 3% related to COVID."
}