{
    "symbol": "GL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 03:05:05",
    "content": " Net operating income for the quarter was $211 million or $2.15 per share, an increase of 21% from a year ago. In the life insurance operations, premium revenue increased 4% from the year ago quarter to $755 million. Looking at the quarter, at American Income Life, life premiums were up 6% over the year ago quarter to $378 million, and life underwriting margin was up 16% to $128 million. In the third quarter of 2022, net life sales were $76 million, up 4%. Liberty National Life premiums were up 5% over the year ago quarter to $82 million, and life underwriting margin was up 17% to $19 million. Net life sales increased 2% to $19 million, and net health sales were $7 million, up 5% from the year ago quarter, primarily due to increased agent count. At Family Heritage, health premiums increased 6% in the year ago quarter to $92 million and health underwriting margin increased 1% to $25 million. In our direct-to-consumer division of Globe Life, life premiums were up 1% from the year ago quarter to $243 million, and life underwriting margin increased from $12 million to $39 million. Net life sales were $29 million, down 13% for the year ago quarter due to lower response rates and lower paid initial premium. At United American General Agency, health premiums increased 13% over the year-ago quarter to $134 million, and health underwriting margin increased 12% to $20 million. Net health sales were $13 million, up 11% compared to the year ago quarter. Net life sales included in our guidance are as follows: American Income Life for the full year 2022, an increase of 8% to 12%; for the full year 2023, relatively flat. Excess investment income, which we define as net investment income less required interest on net policy liabilities and debt, was $56 million, down 5% from the year ago quarter. At the midpoint of our guidance, for the full year 2022, we expect to invest approximately $1.4 billion in fixed maturities at an average yield of 5.1% and approximately $200 million in limited partnership investments with debt-like characteristics at an average yield of 7.9%. This amount of excess cash flows, which again, is before the payment of dividends to shareholders, is lower than the $450 million received in 2021, primarily due to higher COVID life losses in 2021, plus the nearly 15% growth in our exclusive agency sales, both of which resulted in lower statutory income in 2021, and thus lower cash flows to the parent in 2022. Taking into account the liquid assets of $141 million at the end of the third quarter, plus $32 million of excess cash flows expected to be generated in the fourth quarter, we will have approximately $173 million of assets available to the parent for the remainder of the year, out of which we anticipate distributing approximately $20 million to our shareholders in the form of dividend payments. While the longevity risk factors that primarily relate to life contingent annuities will have little impact on our subsidiaries, the higher mortality factors will apply to our products and will increase our company action level required capital by approximately $30 million or about 5% of our required capital. For the full year, we anticipate that our excess life policy obligations will be approximately $70 million or around 2% of our total life premium. While still very early and levels of claims activity in the fourth quarter could influence our views, at the midpoint of our guidance, we estimate total excess obligations will be around 1.5% of life premium, down from approximately 4% expected in 2022. Driven by the anticipated growth in life underwriting margin and the favorable impact of higher interest rates on excess investment income noted by Gary, we estimate our 2023 net operating earnings will be in the range of $9 to $9.70 under current accounting guidance, representing 15% growth at the midpoint of the range."
}