{
    "symbol": "SYNH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 11:23:05",
    "content": " 09:43 Second, our Commercial Solutions business continues to demonstrate strong performance, with our full service approach resonating with customers and the Syneos One portfolio beginning to achieve commercialization milestones, resulting in 18.1% revenue growth. 11:32 Importantly, the clinical revenue and our top 20 pharma customers segment returned to year-over-year revenue growth in the first quarter, marking an important milestone in our growth strategy. Growth in commercial revenue continued to be driven by expansion across our core commercial businesses, with particular strength in Deployment Solutions, including a growing contribution from field team launches for our Syneos One portfolio assets. Your line is now open. I mean, the environment at the moment is cooled off a little bit I think in terms of M&A, we've got a list of kind of priorities and targets that we want to continue out into the business as we move forward both across Clinical and Commercial, we -- and the medical affairs base actually is a place that we look and have good engagement in. Your line is now open. Your line is now open. The feedback that we're getting about the culture that we have, our abilities around building hybrids and being able to deliver that clinically as well as bringing that advisory in from commercial, the cross-sell that we're seeing as well, I think I'll get Michelle to talk a little bit about the new awards that we've got in the large pharma, but really where Michelle's team have excelled delivered very well is people want us now to come in and deliver Clinical. Your line is now open. Your line is now open. Your line is now open. 55:55 When you look at the full Syneos Health portfolio, Syneos One portfolio as you know, some are smaller assets, rare disease, more targeted commercialization, some are larger Idorsia's absolutely on the larger side of $1 value because it's insomnia asset and we all know that insomnia has a very large and wide physicians target base versus something like an oncology rare disease. Your line is now open."
}