{
    "symbol": "SYNH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 11:58:05",
    "content": " Excluding reimbursable expenses and on a constant currency basis, Clinical Solutions revenue grew 6.9%, driven primarily by growth in our large pharma business, partially offset by backlog conversion delays and lower revenue from COVID-related projects. Excluding reimbursable expenses and on a constant currency basis, Clinical Solutions revenue increased 6.9% versus the third quarter of 2021, primarily driven by our large pharma customers, including strength in our FSP business, partially offset our backlog conversion delays and lower revenue from COVID-related projects. Our Clinical growth was below our expectations during the third quarter primarily due to the impact of lower awards, customer delays in our full service and FSP businesses and foreign exchange. In the pre-revenue SMID, well we do know there's been some macroeconomic issues, we're performing well there, so -- and commercial business development and new wins are performing really well. We've talked about their investments and the pacing of our investments and the fact that we will continue to invest in the business, because that's ultimately what's going to help us deliver effectively for our customers and to make our employees successful in their growth and development endeavors. And then finally, as we talked about today, project Velocity is going to be really transformational for the company, we're excited about it and the opportunity that we have there that is going to launch here in the fourth quarter, and we'll be standing that up during 2023 and think about that as leveraging investments in automation and process improvement and systems and innovations that our partners have been investing in for years and years and years and rolling out to their customers. And so we're very focused on delivering against clinical reimagined, getting our business development team to continue to focus on converting those new awards in SMID, winning our preferred partnerships in large pharma and continuing to have the commercial business perform at the rate it's been performing. And so we're just focused on what comes in right in front of us, making sure we deliver against clinical reimagined our new business development approach of just making sure that we have the cross-functional regional teams working to ensure we utilize our full capability set to design the best delivery strategy and we're just focused right in front of us in Q4 on conversion."
}