{
    "symbol": "SYNH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 12:34:07",
    "content": " Excluding reimbursable expenses and on a constant currency basis, Clinical Solutions revenue declined 0.8% due primarily to lower net awards and backlog conversion delays, largely offset by growth in our large pharma business, including FSP. Excluding reimbursable expenses and on a constant currency basis, Clinical Solutions revenue declined 0.8% versus the fourth quarter 2021, driven primarily by lower net awards and backlog conversion delays, largely offset by growth in large pharma. Adjusted diluted EPS of $1.23 for the fourth quarter declined 16.9% year-over-year, driven by the decline in adjusted EBITDA and higher interest and depreciation expense, partially offset by lower share count and tax rate. Your line is open. Your line is open. Your line is open. And I think the thing that we are seeing thatâ\u0080\u0099s having a lot of impact is marrying our business developers with our technical and scientific experts along with the local project leads to ensure that we have a fulsome understanding of what the customer is looking for and that we can meet them in their journey where they are at, whether itâ\u0080\u0099s from a scientific expertise perspective, whether itâ\u0080\u0099s making sure we deliver with quality and consistently, and whether they are looking for innovative solutions around technology and data, et cetera. Your line is open. Your line is open. And then on the EBITDA side, we are making some investments earlier on in the year that will stay consistent throughout the year, we will continue to make investments, but some of them will sort of tail off from Q2 and Q3 onward given what they are, particularly around the Clinical business and Clinical Reimagined that Michael has talked about as we get through that first half and sort of get most customers into that new model and then the savings initiatives that we have start to pick up from Q2 onwards as well. Your line is open. Your line is open."
}