{
    "symbol": "SYNH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 14:39:18",
    "content": " We delivered total company year-over-year revenue growth of 6.1% for the second quarter, driven by robust growth across both segments, which was partially offset by the impact of clinical reimbursable expenses. Your line is open. Your line is open. In the top 50 the pipeline is down a bit and that's due to some of the award decisions and things of that nature, and that's the reason we laid out that the TTM, large pharma RFP flow is up significantly year-over-year, and you know the reason we believe that TTM cadence is right there or time frame is right there is given the fact that we are still under, you know underweight in large pharma and need to continue to grow those partnerships which Michael just walked you through. Your line is open. Your line is open. I think secondly you know that our ForwardBound initiative, which is around automation initiatives, along with offshoring certain roles in the organization, you know as Jason has shared in the past, we kind of got to that party late, so there's still opportunity for us from a ForwardBound perspective to continue to have opportunities in lower cost jurisdictions, right, so we're going to continue to do that. Your line is open. Your line is open. If you look at the back half, right, youâ\u0080\u0099re going to see the lowest percentage that I think, you know that weâ\u0080\u0099ve probably seen as a percentage of our fee revenue, and you know I do believe that is related to the COVID specific opportunities weâ\u0080\u0099ve talked about, as well as just the underlying therapeutic mix in the business and what weâ\u0080\u0099re seeing in the back half, when we look at the backlog by project. If you go back pre-COVID, you know given what we were â\u0080\u0093 you know the portfolio of what we were managing, the SMID profile of our customer base and percentages versus large pharma, right, weâ\u0080\u0099ve always said that given our SMID heritage, the amount of SMID work that we were doing that was 50% plus of the business, we carried a higher pass through load and that over time that would come down as we move more into large pharma. Okay, thatâ\u0080\u0099s really helpful. Your line is open. Okay, thatâ\u0080\u0099s really helpful. Your line is open. Your line is open. I mean, I think, well in terms of where The Streetâ\u0080\u0099s getting it wrong, Iâ\u0080\u0099m not to say anyone is wrong, but I mean how we think about it is the business has good growth, excluding reimbursable expenses and on a constant currency basis, right, 12.4% in the quarter and almost 12% for the year."
}