{
    "symbol": "DRI",
    "quarter": 2,
    "year": 2023,
    "date": "2022-12-16 12:22:02",
    "content": " Total sales for the first quarter were $2.5 billion, 9.4% higher than last year, driven by 7.3% same-restaurant sales growth along with the addition of 35 net new restaurants. And I know there's been a lot of talk over the year about consumers that's below $50,000 in income because high inflation impacts that consumer more disproportionately, but we've seen a little softness in that consumer over the last 6 months, but the mix of the 50,000 income and under is still above pre-covid levels for us. But again, high level, really proud of the work that JW and his team have done at Cheddar's, really proud of the progress they've made in staffing their restaurants, building their pipeline, and we're seeing some pretty strong performance in these new restaurants. We're not seeing a lot of shifting in mix because we've got a very strategic way methodical way we price so that we don't get mix changes when we take price because we've learned this system over time, and it's a proprietary way we do it, -- we use it with our data scientists here. And with the inflation on construction costs and the margins that a lot of folks have, it's a little bit harder to open restaurants as Raj said earlier, we've actually walked away from deals even though they were above our cost of capital because we thought we had some better deals. And for the full year, we're saying it's going to be closer to -- so the way to think about it is Q3 is likely going to be low 6s, and Q4 is likely going to be closer to 5%. I think you said you expect total restaurant labor inflation to go down by 50 bps sequentially through the end of the year from the 7% that we saw in Q2, that would imply for the year something around 7%, maybe slightly lower than 7%, but your total inflation guidance is 7% with 8.5% commodity inflation at the midpoint. And then as we kind of think about the inflation gap versus food at home, the gap has been pretty favorable for restaurants for a few quarters now, and that's potentially narrowing and maybe even may reverse next year in terms of calendar '23. Jake, I think you're activating too much signs to this method here because when we look at how we do this, the midpoint of our guidance is about 75 basis points higher than last time with 1% pricing."
}