{
    "symbol": "DRI",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-23 16:38:02",
    "content": " Thank you very much. So there's a lot of noise when you look at year-over-year because of the reopening last year and especially if you think about California that reopened in the middle of June or late June that helped Olive Garden and, to some extent, Yard House, you're wrapping on those levels. But in general, we're actually fairly consistent, and I think it's just -- I know it's hard because it's three years ago, but that's really the baseline you got to look at. And that's the point we're trying to make is that, I don't think -- we are -- us being close to the business and understanding the details, when we take out those noise -- take that noise out, Olive Garden's performance has been pretty consistent. So that's the other part that I think you're missing is like September, three years ago, we did not have the same level of promotional activity at Olive Garden as we did in June and August -- or the first quarter of this year. Thank you very much. But even if you just look at the absolute number, I think for Q1 -- Q4, it was, like I said, 91%, 91% to 92%, and Q1 was basically 91% of pre-COVID at Olive Garden, for example. Thank you very much. Thank you very much. But we're going to go about it in a manner that's actually sustainable and that's where we go back to -- over the last three years, we've invested so much into underpricing inflation. If you look at where Olive Garden's pricing has been over the three years, combined -- full three years combined is at 10%. I don't know if there -- I'd have to go back and check, but what brands maybe we're talking about there, that's pretty striking because I think the industry customer satisfaction levels are near lows. Thank you very much. In fact, when you look at over the last two quarters, while our total off-premise mix stayed pretty consistent at Olive Garden at 24%, there's more of catering and a little bit less of individual To Go, but ended up being 24% of total sales, but it was just a different mix. On the pricing side, I don't want to get specifically to a brand, but I mentioned already that when you look at over three years, Olive Garden's pricing has been 10%."
}