{
    "symbol": "IBM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 20:02:09",
    "content": " Our full stack capabilities across software, consulting and infrastructure delivered 20% growth in hybrid cloud revenue over the last year to over $22 billion. As IBM Consulting designs and enables enterprise hybrid cloud strategies, this business delivered $8.9 billion in hybrid cloud revenue over the last year. And based on this revenue performance in the first three quarters, as Arvind said, we now see constant currency revenue growth above our mid-single digit model for the year. Your line is open. Your line is open. Turning to sort of address the questions, last October we talked about that we are going to be in a mid single digit revenue growth model and that we will be increasing cash flow each year and we have set out a target of $10 billion for this year and $35 billion over the period. Letâ\u0080\u0099s go to the next question, please. Your line is open. Your line is open. Letâ\u0080\u0099s go to the next question, please. Your line is open. Your line is open. And to software basically rounded to zero, itâ\u0080\u0099s all organic growth software had a very strong quarter, 14% growth at constant currency, about 8 points of that being Kyndryl, that is all organic because weâ\u0080\u0099ve wrapped on our Turbonomic acquisition, which by the way still is done extremely well. Your line is open. When you take a look at our free cash flow posture one, I think we have quantified back in earlier this year in April about our Russia business, orderly wind down right decision, unfortunate humanitarian crisis that continues right now, but that was about a $300 million revenue profile and about a $200 million profit and cash profile overall. That $6 billion give or take in us delivering that about $10 billion that is going to come out predominantly out of our operational profit driven by one, that revenue growth at the high end of our model all in, by the way anniversary of Kyndryl, we got two more weeks and we anniversary that, that is offset by basically Watson Health, so all-in high single-digit model is a good representation of todayâ\u0080\u0099s IBM. Yes, itâ\u0080\u0099s going to deliver that free cash flow in the fourth quarter, but it also gives the investor a perspective now that weâ\u0080\u0099re basically anniversarying the year-to-year contribution at Kyndryl; you see the healthy operating leverage at this portfolio now that we were reposition can deliver."
}