{
    "symbol": "EHTH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 20:45:09",
    "content": " While the enrollment quality initiatives that we introduced in July of last year are still impacting telephonic conversion rates, we've also seen encouraging quality and retention metrics from the most recent Annual Enrollment Period cohort, members that we enroll during the fourth quarter with the policy effective date of January 1st, '22. The initial traction we're seeing through the early part of 2022 combined with positive carrier feedback, reinforces our belief that eHealth can establish itself as a leader in Medicare distribution as this market moves away from volume at all costs and towards growth built on a foundation of enrollment quality, enhance consumer experience, and cash flow generation. In contrast, total Medicare Advantage enrollments, including telephonic and partially assisted applications declined 22%, Q1 '22 total revenues of $105 million was down 22% relative to Q1, '21, primarily driven by telephonic conversion rates, which were down on a year-over-year basis. This includes focusing on marketing channels with best ROIs, driving more enrollments through our online fulfillment that is characterized by favorable member economics, retaining our best performing agents, and investing into training and career paths, and shifting our variable acquisition costs to geographic markets that have the highest financial and strategic value for us. First quarter, Medicare revenue of $95.1 million declined 21% compared to a year ago, driven primarily by a 22% decrease in approved Medicare members. In addition to having an impact on our enrollment volume, lower telephonic conversions also drove up our per member acquisition costs as the year-over-year increased and marketing and call center spend resulted in fewer applications compared to a year ago. We expect to lower our per member acquisition costs in the second half of the year compared to a year ago, through a combination of cutting marketing spend, in channels generating enrollments below our margin goals, and increasing our conversion rates in the call center."
}