{
    "symbol": "SCL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 16:17:07",
    "content": " Our Specialty Products segment also had a record quarter, growing operating income to $9.7 million, representing a $7.3 million increase over prior year. Specifically, the adjusted net income for the third quarter excludes deferred compensation income of $1.1 million compared to last year's income of $1.3 million. Finally, Specialty Products also had a record quarter, delivering $9.7 million of operating income, an increase of $7.3 million. During the quarter, cash from operations was $71 million and we deployed $132 million against CapEx investments, dividends and debt payments, share repurchases, higher working capital requirements due to strong sales growth and the acquisition of Performing a console business. We project full year capital spending in the range of $330 million to $350 million, inclusive of our 1,4-dioxane project and Pasadena investments in the U.S. Beginning on Slide 9, Scott will now update you on our 2022 strategic priority. We expect to deliver another record year, both on a reported and on an adjusted basis, despite approximately $8 million of incremental fourth quarter expenses related to planned maintenance activity in our PA plant at Millsdale and low 1,4-dioxane related transition expenses. From a segment perspective, we believe that Surfactant volume within the functional products and institutional cleaning end markets should show full year growth over 2021 -- despite the short-term challenge demand challenges and volatility, we believe that the long-term outlook for rigid polyols will remain extremely attractive as energy conservation efforts and more stringent building codes are expected to continue and are a critical step to deliver a world with less energy consumption. Have a great day. Have a great day. And Vincent, this is Luis -- an additional perspective is, as Scott was mentioning, probably were on the peak on the margin side but we continue looking for opportunity to grow volume and we have extra capacity right now in our facility in Maywood -- so as fatty acid become more available, our focus for the next few quarters will continue to grow as a business, get new customers and continue growing volume. Actually, I want to make a clarification that $8 million is after tax, just make sure that everybody understands that it's roughly $10 million to $11 million on a pretax basis and around 70% of that will hit polymers and 30% will hit surfactants... And have you seen any customers pulling forward any volumes in Q3 in anticipation of that Q4 outage? Have a great day. Have a great day."
}