{
    "symbol": "SNCR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 20:13:04",
    "content": " Additional contributors to financial performance in the quarter came from $5.9 million in revenue recognized in Q4 2021 from the sale and product sunsetting of the nonstrategic DXP and Activation assets earlier in 2022, and expected $3.6 million runoff in cloud deferred revenue and a $1.2 million unfavorable revenue impact from foreign exchange. Despite these headwinds, the operating improvements made throughout 2022 still resulted in a $20.3 million increase in operating income for the year, thanks to a nearly $50 million reduction in total cost and expenses. Looking at revenue by product, cloud revenue of $39.8 million was down 12% on a year-over-year basis as a result of expected deferred revenue runoff as well as the sunsetting of the mobile content transfer product the functionality of which is now built into the cloud product platform. Looking at the full year, total revenue decreased 10% to $252.6 million from $280.6 million in 2021. For the full year gross profit increased 5% to $131 million, or 52.1% of total revenue from $139.1 million, or 49.6% of total revenue in 2021. The increase in net loss was primarily attributable to the changes in revenue of $12.2 million, an increase in SG&A primarily as a result of the change in the contingent consideration of $3.6 million, an increase in commissions directly related to the Tier 1 cloud contract signed in Q4 mentioned by Jeff, an increase in other expenses related to noncash foreign exchange from reevaluation of the company --intercompany trade receivables, which was partially offset by continued expense management. In Q4 adjusted EBITDA decreased 41% to $10.9 million, or 17.7% of total revenue from $18.3 million or 24.8% of total revenue in the period than prior year period. The net contribution to GAAP revenue from noncash deferred revenue is expected to be $7.4 million less in '23 than it was in 2022, most of which is related to the first half of the year."
}