{
    "symbol": "IHS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 14:52:11",
    "content": " Based largely on the strong secular demand as well as additional upside from power revenue and lower withholding taxes and despite an $11 million ForEx headwind versus rates previously assumed in guidance, we are raising our 2022 guidance for revenue by $20 million, adjusted EBITDA by $10 million, and RLFCF by $10 million and reiterating our guidance for CapEx. This, in turn, is expected to reduce the Scope 1 and Scope 2 kilowatt hour emission intensity of our tower portfolio by circa 50% by 2030 as well as, of course, the volatility in our cost structure.\\ Under Project Green, the next significant step of our CRR, we expect to spend approximately $214 million in CapEx towards these efforts between 2022 and 2024, including the $110 million in 2022 and to deliver annual RLFCF savings of approximately $77 million by 2025. Organic revenue growth of 23.1% in the third quarter was driven primarily by CPI escalations, power indexation, which we've now shown as its own bar, Lease Amendments, FX reset, New Colocation, Fiber, which we've also shown as its own bar and New Sites. Third quarter 2022 revenue of $355 million increased almost 23% year-on-year on a reported basis and almost 29% on an organic basis, albeit including the $18 million one-time revenue in the quarter, which was in the Nigerian segment. Q3 2022 adjusted EBITDA in Nigeria was $210 million, a 17% increase from a year ago, and adjusted EBITDA margin was 59.1%, in each case, reflecting in part, an increase in power generation cost of $35.7 million, an increase of administrative expenses of $4.8 million. Q3, 2022 revenue of $115 million increased by almost 29%, of which organic revenue grew 3.1%, primarily from escalations, new sites and new colocation. In this third quarter, we generated $521 million in reported revenue, a 30% increase versus Q3 last year, while organic revenue growth was 23%, each demonstrating the continued strong top-line growth trends of the businesses led by Nigeria and Lat Am in particular. Moreover, excluding the quarter $18 million of additional non-recurring revenue, our reported revenue growth was still 26% and organic growth was still 19%. Regarding our adjusted EBITDA and adjusted EBITDA margins in the third quarter, adjusted EBITDA of $275 million increased 25% versus the prior year, including the onetime items and still increased 17% if you exclude the onetime items. We generated RLFCF of $91 million in the third quarter, a 24% increase versus Q3 2021 due to a combination of factors, including the $18 million nonrecurring revenue in the quarter, an $18 million decrease in bond interest costs in the quarter this year post our November 2021 bond refinancing and those items offset by higher interest expense from the bridge loan and the new South Africa acquisition-related financings. And on to CapEx, in Q3 2022, CapEx of $174 million increased over 100% year-on-year, primarily from increases in Nigeria in connection with Project Green, on which we spent $42 million in aggregate through September this year, including $27 million in the third quarter as well as increased CapEx in LatAm following the I-Systems and SP5 acquisitions and increased CapEx in SSA in connection with our South Africa acquisition. You can see we are raising our FY 2022 revenue guidance by $20 million and raising our guidance for adjusted EBITDA and RLFCF by $10 million each, while maintaining our CapEx guidance, which we just raised by $100 million on October 24, when we announced Project Green."
}