{
    "symbol": "IHS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 09:03:02",
    "content": " For the year, we generated revenue of $1.961 billion, adjusted EBITDA of $1.031 billion, an RLFCF of $363 million, with organic revenue growth of 19.5%. This was for services we previously provided to them, but had not previously recognized given our revenue recognition policy. You'll see on this slide that our main KPIs have all increased by double-digit percentages in Q4 '22 versus Q4 '21, and we again delivered double-digit growth in revenue and adjusted EBITDA for the year, while the annual RLFCF comparison is impacted by onetime items in each year that I'll discuss shortly. In fourth quarter, IHS generated $526 million in reported revenue, a 27% increase versus the fourth quarter of 2021, while organic revenue growth was 23.5%, each demonstrating the continued strong top line growth trends of the businesses led by Nigeria and LatAm in particular. Aggregate inorganic revenue was $45 million, equating to nearly 11% growth during the quarter, reflecting the acquisitions we've discussed. Regarding our adjusted EBITDA and adjusted EBITDA margins, in the fourth quarter, adjusted EBITDA of $273 million increased 26% versus the fourth quarter of '21, and adjusted EBITDA margin was 51.8%, down 30 basis points from the fourth quarter of '21. For the full year, adjusted EBITDA up slightly more than $1 billion, increased 11% versus the prior year, and adjusted EBITDA margin was 52.6%, down from 58.6% in FY '21. The year-over-year changes in adjusted EBITDA and margin for full year '22 primarily reflect the increase in revenue discussed, partially offset with year-on-year increases in cost of sales, mainly due to higher diesel costs as well as increased SG&A associated with being a public company for a full year in '22 versus 2 months in 2021, and some increased maintenance and repair costs on a larger business. We generated RLFCF of $97 million in the fourth quarter, an 11% increase versus fourth quarter 2021 due to a combination of factors, including the increased revenue and adjusted EBITDA discussed already, offset in part by increase in net interest paid withholding tax and maintenance CapEx. For the full year, we generated RLFCF of $363 million, an almost 11% decrease versus FY '21, and our RLFCF cash conversion rate was 35.2%, down from 43.8%, with onetime items in each year impacting the comparison. RLFCF for 2022 was then impacted by the increased diesel costs, impacting adjusted EBITDA that we've already talked about, as well as our bond financings at the end of 2021, driving an increase of nearly $59 million in net interest paid for the year. We incurred almost $43 million of additional maintenance CapEx, in part due to owning I-Systems now for a full year versus 2 months in 2021, as well as nearly $30 million more in corporate income taxes and revenue withholding tax, and a $16 million of additional lease and rent payments made versus FY 2021, due to owning a larger business. In the fourth quarter, CapEx of $196 million increased 30% year-on-year, and full year CapEx of $633 million increased 57% versus FY '21. The increase in FY '22 was primarily due to increases in Nigeria in connection with Project Green, on which we spent $104 million during the year, increased CapEx in LatAm following the full 12 months of owning I-Systems in the year, and increased CapEx in South Africa, in connection with the refurbishment of the portfolio we acquired during 2022. This was for services we previously provided to them, but had not previously recognized given our revenue recognition policy."
}