{
    "symbol": "ULH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 12:09:04",
    "content": " As with the general rate environment our accessorial charges such as the demurrage, storage and per diem fell slightly from $33.6 million in the second quarter of 2022 to $31.3 million in the third quarter of 2022. Looking at our segment performance for the third quarter of 2022, in our contract logistics segment, which includes our value add and dedicated transportation businesses, income from operations increased $29.4 million to $35.4 million on $209.5 million of total operating revenues. As Tim mentioned in his comments, our third quarter of 2021 results included $7.1 million of operating losses incurred at a large contract logistics program here in Metro Detroit. On to our Intermodal segment, operating revenues increased $33.4 million to $154.4 million compared to $121 million in the same period last year. In our trucking segment, operating revenues for the quarter decreased $7.6 million to $99.6 million compared to $107.2 million in the same quarter last year, and income from operations decreased $2 million to $4.8 million. In our company managed brokerage segment operating revenues for the quarter decreased $18.6 million to $40.6 million compared to $59.2 million in the same quarter last year, while income from operations decreased $700,000 to $1.1 million compared to operating income of $1.8 million in the third quarter of 2021. Based on the current operating environment, for the fourth quarter of 2022 we are expecting top line revenues between $450 million to $475 million and operating margins in the 10% to 12% range. And you know a good portion of our Intermodal Groups transportation power is coming from owner operators, and they've had a pretty good stretch of run where they've been able to pick and choose what they want, and I think that we realize that, but I think that we'll have those continued conversations about the stepping down in the marketplace and maybe their reconsideration of how they point their business going into the latter half of this year and into 2023."
}