{
    "symbol": "ULH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-10 13:34:08",
    "content": " For the full year 2022, Universal reported record operating income of $240.4 million, and $6.37 per basic and diluted share. While we saw a year-over-year deterioration in our transactional transportation sector, our contract logistics segment which includes dedicated transportation, and value-added services expanded top line revenue and operating margin because of our diversified service offerings, Universal proudly printed its best fourth quarter operating income and EPS in company history. Now for the quarter, and yesterday's release Universal reported 2022 fourth quarter earnings of $1.27 per share on a total operating revenue of $458.7 million. Declining accessorial charges was the biggest contributing factor to our top line declining revenue per dm, storage and demurrage were down over 36% or $13.2 million to $22.5 million in the quarter, influenced by less congested supply chain and a more normalized operating environment. Our drayage revenues in Southern California were down over 50% from Q4 of last year, and operating profits were down $5.3 million. Top line revenue of $89 million was down 12.3% for the quarter, while operating income of $5.7 million was an increase of $4.6 million over the same period last year. Yesterday, Universal Logistics Holdings reported consolidated net income of $33.4 million or $1.27 per share on total operating revenues of $458.7 million in the fourth quarter of 2022. Looking at our segment performance for the fourth quarter of 2022, in our contract logistics segment, which includes our value-add and dedicated transportation businesses, income from operations increased to $24.1 million to $30.1 million and $205.6 million of total operating revenues. And our intermodal segment, operating revenues decreased $18.6 million to $123.1 million compared to $141.7 million in the same period last year, and income from operations decreased $2.7 million to $11.1 million. In our trucking segment, operating revenues for the quarter decreased to $12.5 million to $89 million, compared to $101.5 million in the same quarter last year, and income from operations increased $4.6 million to $5.7 million. In our company-managed brokered segment, operating revenues for the quarter decreased to $22.4 million to $39.6 million compared to $62 million in the same quarter last year, while income from operations decreased $1.6 million to $900,000 compared to operating income of $2.5 million in the fourth quarter of 2021. Based on the current operating environment, for the first quarter of 2023, we are expecting top line revenues between $400 million and $425 million and operating margins in the 8% to 10% range."
}