{
    "symbol": "STLD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 13:41:13",
    "content": " Please be advised this call is being recorded today, April 21, 2022 and your participation implies consent to our recording this call. As a reminder, today's call is being recorded and will be available on our website for replay later today. Leading today's call are Mark Millett, Chairman and Chief Executive Officer of Steel Dynamics; and Theresa Wagler, Executive Vice President and Chief Financial Officer. Some of today's statements which speak only as of this date, may be forward-looking and predictive typically preceded by believe, expect, anticipate or words of similar meaning. Such statements involve risks and uncertainties related to our steel, metals recycling and our fabrication businesses as well as to general business and economic conditions. Examples of these are described in the related press release as well as in our annually filed SEC Form 10-K under the headings Forward-Looking Statements and Risk Factors found on the Internet at www.sec.gov and if applicable, in any later SEC Form 10-Q. Their record performance this quarter was another extraordinary achievement driven by the commitment, innovation and passion of our people, executing on our long-term strategies of diversified value-adding growth. We encourage the use of new technologies and processes to reduce our impact on the environment, including a strategic focus on carbon emissions mitigation with a goal for our steel mills to be carbon neutral by 2050. In the quarter, we incurred cost of $84 million or $0.31 per diluted share for the continued commissioning start-up of our Sinton Texas Flat Roll Steel Mill. Excluding these costs, first quarter 2022 adjusted net income was $1.2 billion or $6.02 per diluted share. First quarter 2022 record revenues of $5.6 billion and record operating income of $1.5 billion were both 5% higher than sequential fourth quarter results driven by higher realized selling values in our steel fabrication business and continued strong performance in our steel and metals recycling operations. We also achieved record quarterly cash flow from operations of $819 billion  and adjusted EBITDA of $1.6 billion, a truly exceptional performance. Our steel operations generated very strong operating income of $1.2 billion in the first quarter, achieving record shipments of 2.9 million tons, of which Sinton contributed 50,000 tons. In contrast, our long product steel operations experienced metal spread expansion based on rising product prices. Despite hitting record volumes, we still have additional steel shipping capacity, much of which is within the long product steel group. When Sinton is fully operational, it will contribute an additional 750,000 tons per quarter of availability. Operating income from our mills recycling operations for the first quarter were strong at $48 million, based on improved metal margins as both average ferrous and nonferrous pricing improved in the quarter. They almost doubled their previous record results, achieving a new record high quarterly operating income of $467 million, eclipsing the entire full year of 2021 results by almost 30% in just one quarter. These earnings were driven by record pricing supported by near-record shipments of 210,000 tons. Based on this strength, we expect steel fabrication earnings to continue to increase even further as the year progresses. At the end of March, we had liquidity of $2.4 billion comprised of cash of $1.2 billion and our fully undrawn unsecured revolver. During the first quarter of 2022, we generated record cash flow from operations of $819 million. Working capital grew $757 million due to higher customer account values stemming from higher prices and volume, coupled with the payment of our 2021 company-wide profit sharing of $360 million. We repurchased 390 -- excuse me, we repurchased $389 million of our common stock in the first quarter, representing 3% of our outstanding shares. As we exhausted our previous program, we also announced the Board's approval on an additional $1.25 billion share repurchase authorization, further demonstrating our confidence in Steel Dynamics future cash flow generation. Since 2017, we've increased our cash dividend per share by 143% and we've repurchased $2.7 billion of our common stock, representing 27% of our outstanding shares. Sustainability is a part of that long-term value creation strategy and we're dedicated to our people, our communities and our environment. Further committing to this path, in 2021, we announced greenhouse gas reduction and renewable energy goals, including a goal for our steel mills to be carbon neutral by 2050. We had led the steel industry with our exclusive use of electric arc core steelmaking technology, our circular manufacturing model and our innovative solutions. We plan to sustain our leadership position by executing our carbon reduction goals through among other avenues, investing in emission reduction projects, increasing the use of renewable energy and developing and supporting new innovative technology. As an example, we're incredibly excited to recently invest $25 million in the equity of Aymium. Aymium is a producer of renewable biocarbon products that replace fossil fuels and reduce emissions in large global industries, including new electric arc furnace steel industry. For those of you that like to track our detailed flat roll shipments for the quarter, hot rolled and Pickled and Oiled shipments were 736,000 tons, cold-rolled shipments were 162,000 tons and coated shipments were 1,065,000 tons. Our steel joist and deck order backlog remain at record volume and forward pricing levels, extending well into the first quarter of '23. The nonresidential construction market remains solid, considering the trend we have seen over the last year, especially in areas that support online retail, specifically represented by construction of distribution and warehouse facilities, along with data centers, schools and health care. They also support our steel mills during periods of weaker steel demand as a ready internal customer, what we call pull-through volume, increasing the through-cycle utilization of our steel mills. We have steel fabrication facilities located throughout the U.S. and in Mexico, providing us with an advantaged broad-based customer-centric supply chain. As I move into metals recycling, I'll just take a moment to thank Russ Rinn given his impending retirement in July for the truly significant contributions he's made to that platform over his 10 years, 11-year tenure. Today, we're operating at the same volumes with 1,500 less teammates. As one of the largest ferrous and nonferrous metal recyclers in North America with operations throughout the U.S. and Mexico, we have a competitive advantage in providing the highest quality, cost-effective scrap to our EAF-based steel mills and to our other customers. In today's environment, our advantage of having our metals recycling platform is even greater. During the last 18 months, our recycling and steel teams have worked closely in developing a higher-quality shredded scrap that can be used in place of prime scrap. The combined effort resulted in our Butler Flat Roll Steel division, reducing its need for prime scrap from 65% of its mix to only 40%, while achieving the same steel qualities. We are currently rolling this out to our Columbus and Sinton Steel divisions, allowing for a lower cost, readily available, low-residual scrap supply. Additionally, given the historically high spread between prime and obsolete grades which is around $170 a ton today, the reduced prime scrap requirement has provided a significant cost savings. Additionally, of particular note, our Butler Flat Roll division has the advantage of iron dynamics, an on-site liquid pig iron production facility that supplies almost all of Butler's pig iron requirements. The steel team had an outstanding quarter as well, achieving record shipments and operating income of $1.2 billion. During the quarter, the domestic steel industry operated at production utilization rate of 80%, while our steel mills operated at a rate of 93%. We consistently operated at higher utilization due to our value-added product diversification, our differentiated customer supply chain solutions and to support our internal manufacturing businesses. hot roll coil pricing moderated during the early part of the first quarter but prices have recently firmed with extending order lead times across the product set, especially in coated products. With continued strong demand, we believe steel prices will remain strong. Based on higher raw material input costs, global flat-rolled steel supply disruptions related to the Ukraine, Russia conflict and lower steel imports. Throughout our company history, we have intentionally grown our value-added steel product portfolio and created valuable customer supply chain solutions to mitigate the impact of price volatility. Today, at least 70% of our steel sales are considered value-added. And additionally, as we discussed steel fabrication operations are operating at never seen before levels. In aggregate, our steel order backlogs and order input strength coupled with broad optimistic customer commentary and general market momentum drive us to conclude that steel market dynamics will remain strong throughout 2022. Steel Dynamics is a dynamic growth company, increasing through-cycle earnings and cash flow to support continuous long-term value creation. Our most recent and significant investment represented by a new state-of-the-art electric arc furnace flat roll steel mill located in Sinton, Texas. This electric arc furnace steel mill represents next-generation lower carbonate emitting steel production capabilities, providing differentiated products and supply chain solutions. The 3 million tons state-of-the-art facility is designed to have product capabilities beyond that of any existing electric arc furnace flat-rolled steel producer, competing even more effectively with higher carbon-emitting integrated steel facilities and high carbon foreign competition. We offer shorter delivery lead times, providing a superior customer supply chain solution for the region. We have seven customers locating on our site, representing up to 1.8 million tons of annual flat-rolled steel processing and consumption capability, four are already operating and the other two have broken ground -- three have broken ground actually. Sinton provides a differentiated product offering, a unique regional supply chain solution, with significant geographic freight and lead time advantage and offers a lower carbon alternative to imports in a region in need of options. In addition, our previously announced additional four value-added flat roll coating lines are still on schedule to begin operating mid-'23 in support of our Sinton steel mill and our Heartland flat roll operations. In closing, our sustainable symbiotic operating platforms and customer-centric supply solutions demonstrate our financial and operating stability differentiating from any competition. Emily, one way to look at it from the shift that Mark talked about from going to -- from prime scrap to an upgraded type of obsolete scrap all the way from 65% to 40%. So if that were able to be accomplished with Columbus, Sinton and Butler, if you just make high-level assumptions that generally we would use approximately 20% of pig iron. If you think about that from a volume perspective, it could be as much as 1.5 million to 2 million tons shifting from prime scrap to higher grade. Today, I think Mark mentioned it's like around $170 per ton which is higher than normal. Even if it's $100, $150 per ton, that could be a significant change once -- if all three mills are fully operational. Just as a reminder, from a natural gas perspective, for electric arc furnaces for Steel Dynamics specifically, it isn't a huge part of the cost structure. And just to add, if you look at it from a global perspective, obviously, energy prices in other parts of the world have appreciated far greater than the U.S., along with other commodity pricing issues. And obviously, given our low-cost position advantages Steel Dynamics. I just wanted to ask a little more about the fabrication business, unbelievable how much this has exploded higher over the last year, I know it's directionally not new but again, another doubling in basically the profit contribution this quarter which is fabulous. And it really just to summarize, if you could just give us what you think your view is on a normalized go-forward EBITDA contribution basis from this business beyond the first quarter of 2023. Secondly, I think it needs to be recognized that the industry since prior peaks has changed dramatically. It's a rationalized, consolidated industry today. And that allows -- it's just a change dynamic that allows us to have, I think, greater pricing strength. And as a realization today, the value of the product is a lot higher than people would suggest in past history, that product is going to sell at higher levels going forward no matter where we are in the cycle. So if you're looking at a backlog for the fabrication business versus the steel business, it's very different. So once a project enters the backlog in our fabrication business, the entire project has been highly engineered and is part of a bigger construction project overall. And if you look at the steel costs that are involved in these large projects that we're participating in, it's really not a large percentage of the entire project. So the customer base, if you will, is not as sensitive to steel pricing as one would think. The second thing is because our backlog is out much longer than it typically is, we typically would see a backlog of maybe four to six months. We know where we're pricing today and Mark mentioned in his notes that, that forward pricing is higher than what we even realized at this point in time. And so, I'm not sure if there's no specific you asked about pass-throughs of costs, specific surcharges, etcetera, like you might see in some of the steel businesses in fabrication. But all of that, once it hits the backlog, it's already guaranteed from a price perspective. Just again, I'm trying to gauge what the comfort level is around a normalized -- the EBITDA contribution now is 20x what it was historic average for well over five years and that 20x increase happened in four quarters. Some of this is structural and some of it is not, I'm trying to figure out what you think a normal sort of contribution should be for a business that's relatively low visibility from my perspective. There are some specific things that happened and with extended steel prices with a very strong construction market, we think that market will continue. First, thanks for the color on your efforts to cut your reliance on prime scrap and pig iron. Well, firstly, on the pig iron opportunities I prefer not to go into that. Well, obviously, the unimaginable human tragedy of U.K. -- of Ukraine, sorry, should be at the forefront of everyone's mind but the consequences of that on our industry has obviously been massive and I think just on commodities in general, all commodities. If you look at pig iron, the typical global trade is around about 12 million tons merchant trade, roughly 7 million, maybe 8 million tons of that were originating from Russia and Ukrainian mills. We -- I can't speak really for other metals but I think they followed suit that we scrambled as an industry to cover our needs for the rest of the year into 2023 from other sources, we were very, very successful in procuring material from Brazil and from India in particular and at the same time, changing our sort of operations and process to lower the need or the requirement of that pig iron. So typically, where a mill is around about 22% pig iron input, our mills today are running around about 14%. So in combination, that's got us into 2023 from an uninterrupted supply. Consequence of all that, though, obviously, pushed pig iron pricing up, it peaked at around about $1,100 a ton. And that drew particularly if we prime scrap up with it, prime scrap today is around $75-ish I guess. And we foresee that pressuring scrap pricing down, at least sideways but more likely pressuring it down going forward into the summer. And as Theresa suggested, there's a record spread between obsolete shred grades to prime of around about $170 a ton. Flow is very, very, very high and we feel that is going to pressure scrap pricing over the next few months as well. So from a fairs perspective, the shipments were down in the first quarter. It had to do with where raw material inventories were at the end of the year, heading into the first quarter. Heading forward is when traditionally, you're going to see seasonality kick in and based on where we see steel demand and how that translates then into raw material demand as well, we would expect to see increasing volumes second and third quarter for mill recycling. So first, I just wanted to just get a little bit more color on the new guidance for Sinton starting up. So I think it's going well, to be honest and confident that we will exceed that 1.5 million tons in all honesty, we're just being conservative perhaps. I would say, that we just had our national sales, flat roll sales, meaning at Sinton for the last two weeks -- last two days, sorry. As I said, it's such an underserved marketplace today and the product differentiation of that facility is going to be insane. And we -- if you consider our ramp-up is going to be solid through the rest of this year and we went to 24, five operation, just this Monday. Galvalume steel, obviously, is not ramping up yet and delta is not. Given that prices are now higher than $4,000 a ton. As we've seen or as we described in our last call, we substantially increased productivity and volume capability from our facilities there with almost no capital expense because simply, it's people alliance more than actual capital asset. The engineering of that product is intense to engineer cost effectively is a -- it's proprietary kind of intellectual sort of evolution of many, many, many years. There's absolutely no way they could emulate our productivity and our efficiency and they wouldn't be able to penetrate in my mind, the marketplace. Just to add to what Mark is saying, if you think about it, you have to have the architecture and the firms the customers are willing to design at some extent, for your products, etcetera. So it's not something that someone can just get involved and have all the constituents know you right off the bat, Mark said that incredibly well. The first one, are there -- could you talk about any potential additional cost in this enhanced shredded-scrap products that you are now creating and charging your mills with other than the spread which obviously is a big incentive for you to move down to shredded. Well, I'll take the scrap one and essentially call us, I'd say, somewhere around $10 a ton. From the perspective of guidance for CapEx for this year, we're still tracking around $750 million and your question was specific to Sinton. And specific to it, we don't expect anything of significance for digital CapEx related to the delays, there was additional expense which you saw flow through the first quarter already due to the delay in just manpower and maintenance of things associated with that delay but not from a capital perspective. So for Sinton we're still at that $2 billion mark which honestly is incredible, given what the teams have gone through for them to be able to maintain their budget while being able to make it through COVID and whatnot and everything else. Mark, with respect to the 1.8 million tons on site that -- I know you said four operating, three under construction but when would you expect that to be fully operational. And then also, when you look at that sort of localized manufacturing capability, do you have a sense of if -- how much of that would be a potential onshoring capability, i.e., sort of new demand or are those facilities replacing, say, existing sites within North America? Well, I guess the on-campus sort of development is firstly evolved much quicker than we anticipated. So it's a good spread, a good array of activity to support our supply chain to customers. It's just 200 -- well, not smaller than 200 yards. That's giving those customers massive operational benefits, yield benefits. And it also, obviously, just the elimination of that first freight is $25, $30, $35 a ton savings in the supply chain. It's going to allow us to penetrate markets much, much quicker. And Curt, in addition to what Mark said and we're getting a lot of excitement from this from customers of those customers that are on site is that it removes a considerable amount as the greenhouse gas is associated with delivery and movement of material and we'll be able to take their scrap as well. And then with respect to Iron Dynamics, I mean it seems like that facility has really become a viable asset to the company. Can you give a bit more color on the split, perhaps, how much of that was tied to strength in steel prices and volumes versus growth in raw materials inventories, perhaps there was a need to build particularly elevated inventories of raw mats given supply chain disruption. And then, looking forward into Q2 or into the back half what should we think about the sequencing of working capital investment potential release as Sinton begins to then ramp up. One big draw which I'll just reiterate, even though I had it in my opening comments is that we do pay our company-wide profit sharing in March of every year -- the following year. It's based, as you know, on 8% of pretax earnings. Specifically as it relates to Sinton, Sinton isn't in a building working capital mode. So it increases working capital in the first quarter, somewhere around $150 million to $200 million. From a consolidated perspective, moving throughout the year, again, we're heading into a seasonally strong environment, second and third quarter. So I would say it's going to be muted, then likely you'll see some working capital give back in third and fourth quarter. But you've talked about scrap and pig, how does DRI, HBI potentially fit into your raw material strategy. And hopefully and I see some are just recognizing the strength of our business model, the vertical integration, the downstream supply chain solutions that we have, the diversified value-add mix that we have and now Sinton coming online and another four lines soon thereafter. Thank you for the customers, for your faith and support and for our vendors, particularly the vendors that have gone far and beyond the call of duty, so to speak, in putting Sinton together. Once again, ladies and gentlemen, that concludes today's call."
}