{
    "symbol": "PJT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 11:30:09",
    "content": "  Operator: Good day, everyone, and welcome to the PJT Partners Second Quarter 2022 Earnings Call. Before I turn the call over to Paul, I want to point out that during the course of this conference call, we may make a number of forward-looking statements. These forward-looking statements are subject to various risks and uncertainties, and there are important factors that could cause actual outcomes to differ materially from those indicated in these statements. I want to remind you that the company assumes no duty to update any forward-looking statements and that the presentation we make today contains non-GAAP financial measures, which we believe are meaningful in evaluating the company's performance. This uncertainty has pressured debt, equity and M&A markets across the board. While we always expect that M&A markets to cool in 2022, the slowdown in activity is greater than we previously forecasted. Our unique combination of businesses, combined with the ongoing strategic advisory build out helps insulate us from market dislocations. This resiliency is challenged -- in challenging markets, is reflected in our record 6 month revenues. We have often said that a slower M&A environment benefits us from a recruiting perspective, particularly at the senior level, where bankers have more bandwidth to engage and switching costs are lower. And while our overall near-term growth in headcount is likely to moderate, we expect this pace of senior hiring to continue. Revenues in our three businesses were essentially unchanged from a year-ago with slight increases in restructuring in Park Hill, and a slight decline in strategic advisory revenues. Interest income and other revenue decreased $6 million in the second quarter, resulting in total revenues down 3% year-over-year. For the 6 months ended June 30, total revenues were $479 million, a record level and up 7% year-over-year. These adjustments more fully described in our 8-K. First, adjusted compensation expense. Total adjusted non-compensation expense was $37 million for the second quarter, up $5 million year-over-year and $72 million for the first half, up $12 million year-over-year as a percentage of revenues 15.9% in the second quarter, and 15% in the first half. Of the $12 million year-over-year increase in non-comp expense for the first half of the year, approximately $9 million was due to increased travel and related expense. Excluding travel and related, our non-comp expense was down 1% in the second quarter and up 5% for the first half compared to a year-ago. Given the timing of certain expenses, we expect growth in these non-comp expenses will be higher in the second half of the year, compared to the first half. Therefore, for the full year we expect our non-comp expense excluding travel and related to grow in the high single-digit percentage. Turning to travel and related, activity continues to normalize more quickly than we initially expected. We reported adjusted pre-tax income of $49 million for the second quarter, and $105 million for the first 6 months. Our adjusted pre-tax margin of 21.1% for the second quarter, compared with 24.1% for the same period last year, and 22% for the first 6 months, compared with 24% for the same period last year. The provision for taxes as with prior quarters, represented our results as a full partnership units had been converted to shares and that all of our income was taxed at a corporate tax rate. Our effective tax rate for the first half of 2022 were 25.8%, and we expect this to be the effective tax rate for the full year. Our adjusted if-converted earnings were  per share for the first -- second quarter, and $1.88 per share for the first 6 months. On the share count, for the quarter, our weighted average share count was 41.6 million shares. During the second quarter, we repurchase the equivalent of approximately 469,000 shares, primarily through open market repurchases, repurchases in the first 6 months total approximately 1.7 million shares, including the exchange of partnership units for cash. On the balance sheet, we ended the quarter with $181 million in cash, cash equivalents and short-term investments, and $273 million in net working capital, and we have no funded debt outstanding. Although M&A announcements have recently slowed, and announced deals are currently taking longer to complete, the level of strategic engagement across the board continues to be high. While M&A activity often ebbs and flows in the short-term, M&A remains a secular growth business over the longer term. To that end, we continue to invest in our strategic advisory franchise and we are beginning to see meaningful benefits from investments previously made. As a case in point, PJT Camberview's shareholder advisory capabilities have increasingly become a differentiating element of our strategic advisory franchise. The significant gains we have made across Activism, Defense, Strategic IR and ESG advisory reflect our unique ability to knit together boardroom and investor perspectives to deliver a differentiated advice. Even with a challenging backdrop, our mandate count is up year-over-year and currently stands near record levels. The fundraising environment for alternative investments has also become more challenging, with the fundraising market more crowded than ever before. Alternatives outperformance relative to public market indices has created a numerator and denominator effect, and many investors have limited capital available for new commitments. In this environment, PJT Park Hill delivered record 6 months results and remains on track to deliver record results for all of 2022. While not immune to industry wide challenges, we are well-positioned given PJT Park Hill's leading franchise, our careful selection of best-in-class managers and differentiated relationships with capital allocators around the globe. As the year has progressed, stress is clearly building in the credit markets. We have seen an uptick in liability management discussions, and our mandate count is up meaningfully relative to a year-ago. While our 2022 restructuring revenues will be up relative to 2021 levels, most of our recent increase in activity won't be reflected in our restructuring results until 2023 and beyond. Looking ahead, we feel really good about our people, our mix of businesses, and our competitive positioning. I guess, start maybe with a two-parter here on just the M&A advisory outlook. But can you maybe just help us with qualification or quantification of the degree of how much more challenging than previously forecast, the M&A market has become. And I think tied into that, the theme that we're hearing a lot is just kind of elongated deal processes and deal closings. Well, look, we came into the year with a more cautious, and I would suggest a more realistic sense of the M&A conditions around us. So you're seeing a backup across the board and that's why we tend to focus principally mandates because mandates are really the single best indicator of company's willingness, desire to engage and to pursue strategic transactions. And even if it becomes more challenging for deals to be agreed or if agreed deals take longer to close, you need to start somewhere. And what we found is even through all of this volatility, more challenging markets, volatile moves and prices and the like, companies have strategic needs and they're willing to go forward to investigate those. But if you step back and ask, well, why aren't transactions happening at the same pace, I think it's a multifaceted explanation. They may have started a price with one expectation and in the midst realize that, that will no longer be obtainable and they'll then choose to withdraw that asset from the marketplace. But it's inevitable or not inevitable, but nearly inevitable that asset will return to the market in the not-too-distant future. And as a result, some of the buyers have had difficulty securing financing or some of their capital sources are less willing to be aggressive in providing committed financing or just simply the cost of the financing has risen and its impact on valuations have then caused buyers and sellers to be unable to agree. Markets are uncertain, and I think there's just a broader pause that we're seeing in the marketplace. And then when you add on top of that in certain industries, lots of shocks to the system that are driven by the war in Ukraine, inflationary pressures, supply chain disruption, it's just harder to get companies together. And then finally, when you think about out-of-the-box transformative ideas, the notion of bringing those to market and trying to tell that story in a bearish market is not something that we are seeing a lot of -- all of those reasons, there has been a meaningful reduction in activity, but there has not been a meaningful reduction in engagement. But if we were to kind of fast forward to 2023, just based on the way your business model works with the balance with restructuring as well, that being a meaningful contributor. Because it feels like 2023 could actually be a better year than maybe you would have thought heading into 2022, just given that restructuring feels like it's accelerating at a much more meaningful pace. Well, I certainly don't want to cast the gauge to 2023 until we actually get through 2022. So I think to give me another 6 months, I'd be more than happy to give you a clear eye sense of 2023 because a lot of that will reflect conditions that will exist that will all operate in over the balance of the year. What I would say is relative to where we started the year, we are seeing increased pressures on strategic activity, and that is a headwind, but we are seeing clear stress in the system and our restructuring business heating up. And I don't think that our overall perspective on the year has changed very much, but clearly, the composition of that has shifted, and that is one of the benefits in having a broad based and balanced business. And a lot of our strategic advisory work continues to be focused on securing mandates, introducing new clients to the firm, building out our capabilities and really using our other tools to support clients, whether it's in activist defense, whether it's on investor outreach and positioning companies. But when and how it actually hits the P&L, I think we will need to play it out a little bit. So, Paul, I was hoping you could talk about the engagement from financial sponsors and how that's evolved over the last few months, just given the significant dislocations that weâ\u0080\u0099ve seen in markets. So with respect to financial sponsors, as I just said a moment ago, I wouldn't say that that the summer is being taken off. But there's clearly been a pause, which is reflective of two fundamental conditions. One is the extraordinary pace at which capital was deployed over the past year or two, and that has sort of naturally pause. The second is just given the uncertain environment, I think sponsors are looking very carefully at where  are headed. They're looking at businesses who are all being buffeted by different challenges, whether it's supply chain, its inflation, ability to pass higher costs on to consumers, technological innovation, competitive threats, regulatory overlay. We are just dealing with an uncertain market, and I do think that there's a general sense to sort of let things hit a new equilibrium before you start to see very significant capital being deployed. That doesn't mean that capital isn't being put out that deals aren't getting done, that sponsors aren't willing to engage. And I do think that from their own portfolio perspective, this is probably not viewed as the optimum time to monetize some of their own assets. So for all of those reasons, there's been a meaningful falloff in sponsor activity, but it's been relatively recent. And I don't think it's at all permanent, but it's going to weigh on activity levels for a period of time. And when you're already having difficulty sort of matching buyers and sellers, I think that, that's an issue. So you had spoke about slower deal activity, more subdued sponsor deployment, the elongation of deals, certainly a more tepid outlook as you noted, than where things were at the start of the year, unsurprising given the higher recession probabilities. I think most people recognize 2020, 2021, there was a bit of a frenzy of activity. Now part of it is -- a lot of it's a function of where the equity markets are because for better or for us, M&A tends to be highly pro-cyclical. It's almost the higher the price, the more companies transact and what you find is when there are big declines, sellers don't want to sell and buyers may be a little bit cautious whether they're catching a falling knife. So if you ask me to compare the level of desire or engagement or willingness to set up transactions, I don't think it's very different than 2019. I mean, look, I -- the current accrual, which was for the 3 months and the 6 months is our best estimate of the full year and that has not changed. And while we did, it's just harder when people are locked down and it's even harder when people are locked down and up to their eyeballs in deal activity to pivot and just head off the gardening leave in the midst of that. And as a result, since we think we have a very compelling proposition, we have seen and I expect you'll continue to see us with more senior . So I don't think that will change, and Iâ\u0080\u0099m quite comfortable that, that fits well with our current accrual estimates. Paul, just maybe to put a finer point on some of the discussion around the outlook. You kind of said it didn't -- hasn't really changed much, but maybe the geography has. I think when we last spoke on the last call, you were thinking the second half would be, particularly in strategic advisory, a little bit stronger than the first half. Yes, when you talk about geography, I think you're talking about like which floor they're building as opposed to  the broader geography. So what I would say is there shouldn't be all that surprising that from the beginning of the year, we are more constructive on restructuring than how we started the year. And just even though we have a near record number of mandates and we have a very robust backlog, you have to acknowledge that the strategic advisory backdrop is far more challenging. And therefore, some of that's going to affect our business. And as it relates to earlier commentary about strategic advisory with it being back end weighted, that continues to be the case. So I think the demand, and as we've talked about, as we have a more challenging fundraising environment and as LPs need to create priorities, they're more likely to want to shift and that will create more demand. So all in place, but when you see price volatility, you tend to want to see things sort of put on pause for a quarter or two until everything sort of aligns. So it does sound like activities more active than what you talked about on the last earnings call, but the revenue potential, as you mentioned, is probably more of a 2023 and beyond event. So I know that you don't have a crystal ball, but I am trying to understand what this current restructuring up cycle could look like relative to prior ones, because it seem to be a lot of different factors in play here. So I mean how -- I mean, how big this opportunity gets is really going to be a function of how severe this economic downturn is, and I don't think anyone has a crystal ball, so you can do all sorts of stress scenarios and it could be bigger, it could be a lot bigger, it could be dramatically bigger than where it is today. The second point, and weâ\u0080\u0099ve been consistent on this is COVID did an awful lot of damage and disrupted a lot of business models where that damage was not fully understood because of the extraordinary stimulus that was pumped into the market, both fiscal and monetary. So that is  this time as I'd argue a lot of companies were weakened because of the change in market structure, consumer buying patterns and the like that resulted from COVID. I think the third is as we continue to build out our strategic advisory footprint, and as we are in more industries as we have more relationships, we get pulled into more liability management dialogues, which is a competitive advantage. So that's more of a micro lens as to how PJT should benefit more from the next cycle than the last cycle because being free of conflicts having a much larger, far more powerful strategic advisory business plays into that. And as it relates to the team, we have an extraordinary team of practitioners and they've been working hand in glove with their strategic advisory counterparts for 7 plus years now, if you include when we first announced this transaction. And I think the cadence and the familiarity and the way in which weâ\u0080\u0099ve built up on the strategic advisory side, a capital markets business, which does work hand in glove. And on the management side, I think there's a lot more opportunity there to work together. Then when you look at the damage that was done and how much of that was hidden because of extraordinary fiscal monetary stimulus, that was not a fair indication of sort of the stress in the broader system. And I just think that as you've taken the punch all the way, '22, '23 is a meaningfully higher set point than '21 because it sort of shows the challenges that many companies are facing. And then if you add to that a recession or steep inflation or the need to really drive interest rates higher to combat inflation, it could be meaningfully worse. I just got two kind of modeling nitpicky questions here, maybe for Helen. So on the pull forward, there was a $14 million Q2 this year, and that compares with $21 million in the same period last year. In terms of the interest income and other, that's averaged about $3 million a quarter if you look over the last four quarters. And when we look at it, where it sits today, it's still above where it was initially marked."
}