{
    "symbol": "PJT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 13:25:09",
    "content": " This morning we reported 2022 full year revenues of $1.026 billion, adjusted pre-tax income of $221 million and adjusted EPS of $3.92 per share. We are pleased with how we navigated 2022 challenging market environment, with total revenues up 3% from year ago levels. As PJT Park Hill again delivered record performance, our Restructuring revenues grew meaningfully and our Strategic Advisory business performed well on a relative basis, down significantly less than the declines in global M&A and capital markets activity would suggest. Our 2022 cadence of face-to-face client meetings and engagement return closer to pre-COVID levels, which not only help build new relationships, but strengthen existing ones. Partner headcount was up 8% and total headcount was up 9% for the year, as we continue to attract highly talented professionals to our firm. We remain focused on managing share dilution resulting from these investments in talent, ending the year with a fully diluted share count below year ago levels. For the full year 2022, total revenues were $1.026 billion, up 3% year-over-year, with increases in Restructuring and PJT Park Hill more than offsetting declines in Strategic Advisory revenues. For the fourth quarter, total revenues were $280 million, down 11% year-over-year. With lower corporate capital raises during the fourth quarter, the principal driver of the decline in placement revenues in the quarter. Total revenues that met the criteria to be pulled forward in the quarter were less than $8 million, compared with approximately $12 million in the same period last year. Consistent with prior quarters, we presented the expenses with certain non-GAAP adjustments, these adjustments are more fully described in our 8-K. First, adjusted compensation expense. Full year adjusted compensation expense was $657 million, up 5% year-over-year with a compensation ratio of 64.1%, up from 63% in 2021. As a percentage of revenues, our adjusted non-comp expense was 14.4% for the full year 2022 and 13.7% for the fourth quarter. For 2022, the majority of the year-over-year increase in non-comp expense was due to increased travel and related expense. Looking ahead, we expect our travel and related expense to increase in 2023, reflecting more normalized levels of travel, increased headcount and higher travel costs. With our full year run rate for 2023, more consistent with the fourth quarter run rate in 2022. Away from travel and related expense we expect our non-comp expense to grow in the in aggregate in the mid-to-high single digits year-over-year, driven primarily by higher professional fees and a modest expansion of our office space. We reported adjusted pre-tax income of $221 million for the full year 2022, down 9% and $61 million for the fourth quarter, down 24% year-over-year. The provision for taxes, as with prior years, we have presented our results as the full partnership units have been converted to shares and that our income was taxed at a corporate tax rate. Our effective tax rate for the full year was 26%, up slightly from the 25.8% estimated rate that we applied for the first nine months of the year. In 2023, we would expect our effective tax rate to be in line with 2022 and we will refine our view at the end of the first quarter. Our adjusted converted earnings was $3.92 per share for the full year, compared with $4.44 in 2021 and $1.08 in the fourth quarter, compared with $1.52 in 2021. The share count for the year ended 2022, our weighted average share count was 41.7 million shares, down 2% year-over-year, and during the year, we repurchased the equivalent of approximately 2.2 million shares primarily through open market repurchases. On the balance sheet, we ended the year with $223 million in cash, cash equivalents and short-term investments and $355 million in net working capital and we have no funded debt outstanding. As the year progressed, the fundraising environment for alternative investments became significantly more challenging. Even with this backdrop, revenues grew modestly year-over-year as PJT Park Hill delivered another record year. In 2022, a sharp downturn in equity markets, greater economic and geopolitical uncertainty, and slowing global growth all adversely impacted the pace of strategic activity. The 425 basis points in Fed tightening across seven consecutive rate hikes, represented the largest and sharpest annual rate increases in more than 40 years. Announced global M&A volumes were down roughly 25% for the first half of the year and nearly 50% for the second half of the year, as the impact of these rate hikes and continued political and economic uncertainties further weighed on markets. While we were not immune to these market dynamics, we performed well on a relative basis, with full year Strategic Advisory revenues down only modestly, notwithstanding the dramatic decline in industry-wide volumes. Our shareholder engagement practice continued to evidence strong momentum as these dislocated markets resulted in increased client engagement on shareholder advisory, strategic IR and shareholder activism topics. This strength offset the considerable drop-off in our corporate placement revenues, particularly in the fourth quarter. We continue to invest, adding talent across industries, product capabilities and geographies, including the opening of a Paris office this past year. Overall, our Restructuring revenues increased in 2022 and we ranked number one in announced U.S. and Global Restructurings. As we look ahead, while 2023 is shaping up to be another choppy year, our firm remains well positioned to navigate these uncertain times. In PJT Park Hill, we expect the environment for alternatives fundraising to remain challenging as investors remain highly selective with many fundraises expected to be smaller in size and take longer to close. PJT Park Hillâ\u0080\u0099s 2023 revenues are forecast to be around 2022â\u0080\u0099s record results, even though Q1 revenues could well be down $30 million to $40 million, given the expected timing of 2023 closings. While the recent snapback in equity valuations and the first green shoots of a reopening in the IPO market, are promising harbingers for M&A activity, the low level of global M&A announcements in recent months may well continue for some significant part of 2023. For 2023, we expect significant growth in our Restructuring revenues beginning in the second quarter. Looking beyond 2023, we remain highly confident in the intermediate and long-term outlook for our Strategic Advisory business as we benefit from the significant investments we have made, which expand our client reach and increase our market share. So piecing it all together, it sounds like thereâ\u0080\u0099s still an expectation right now for some level of revenue growth in 2023. The flip side is 2021 and 2022 were equally aberrational the other way, given risk on appetite, near zero interest rates and abilities for even the most highly leveraged companies to secure financing and to manage their debt stack. The first is default rates the last two years were in the 1%, 1.5% rate, which is meaningfully below what the long-term default rate average is. The second is that the quantum of debt outstanding and the liabilities potentially to be managed in some way, shape or form are meaningfully greater today than they were five years ago. And by that, I mean, if you just look at how much debt is likely to mature in the next few years, so that number is at levels that we havenâ\u0080\u0099t seen since 2009, 2010. And just a follow-up on Strategic Advisory, I just love to maybe discuss the visibility that you feel like you have heading into this year just in terms of that outlook. And so just trying to kind of think about the framing here, I appreciate announcements have been relatively light over the last few months and so thatâ\u0080\u0099s going to feed into the first quarter or two of this year. But at the same time, it sounds like maybe conditions have improved a bit in recent months, but itâ\u0080\u0099s way too early to say itâ\u0080\u0099s sustainable, especially with all the macro uncertainty. And therefore, the good news is we are seeing those conditions fall into place and we are starting to check them off and that gives us a reasonable degree of confidence that itâ\u0080\u0099s just simply a matter of not if, but when during the year that you start to see that. But when you try and figure out when do you get lift off, is it a week from now, a month from now, three months from now, and then just given the extended periods of time for transactions to ultimately close and how much of that hits in 2023, itâ\u0080\u0099s just a cloudy crystal ball as it relates to Strategic Advisory this year. But if I step back just a little bit, I can see much more clearly just given the client engagement that we have, the revenue opportunities, the opportunity to bring the entire firm together. We are a far more advanced organization today than we were two years or three years ago, and at the right time, that will all work through. Where I do have clarity is because those headwinds, which may lean on Strategic Advisory in the near-term, serve to elevate Restructuring in the near-term. If I think about it as a pair trade, I am quite confident that we will be net beneficiaries of this uncertainty, and then as I get a little bit further out, I have greater clarity in where we can take the business next. So when you talk about kind of the engagement with clients and the momentum because again, we see the deal announcements, but we donâ\u0080\u0099t get to see a lot of the behind the scenes kind of new client wins and even some time mandates way before announcement. It continues to establish its brand and its presence, and as we have more industry colleagues who can help and as we leverage the fact that we have a differentiated culture, we are doing more and more on a cross-border transatlantic way that really wasnâ\u0080\u0099t available for the taking a few years ago. The second is, the way in which we have integrated our Camberview capabilities into Strategic Advisory and where we are from shareholder engagement, strategic IR, activist defense and the like, and how wrapped in that is and the opportunities and the boardrooms that we are present in, as well as the commercial opportunities for the firm. And then the third is, just as we have continued to build out our holistic capital markets advisory business, the ability to be much more present as it relates to direct lending initiatives, to be working more closely with Restructuring to deal with companies that are not yet ripe for traditional Restructuring but benefit greatly from the capabilities. The only thing that I cannot control is just how quickly the macro environment sort of shifts into gear and then it becomes very much a micro story, which is client by client, whatâ\u0080\u0099s the cadence of their of their reengagement and then how quickly does some of these mandates translate into revenues. But itâ\u0080\u0099s all being built and we are very comfortable with where we are at this point and we love the fact that we have this diverse but highly integrated group of businesses, which continually present more opportunities for us. And I guess one last thing Iâ\u0080\u0099d address is, we have gotten increasingly better at integrating the Park Hill sponsor relationships into our broader sponsor coverage and that becomes another opportunity where we are more present and better able to commercialize some of these relationships. Well, look, I was always taught that trees donâ\u0080\u0099t grow to the sky and the notion that financial sponsors would just be all things at all times and M&A dialogues. I think thereâ\u0080\u0099s no doubt that financial sponsors as they continue to accumulate assets, as they continue to move into broad and broader reach of strategies, as they look at traditional buyouts as well as minority investments, venture and the like, they are going to become an increasingly important part of the ecosystem. But that doesnâ\u0080\u0099t mean that it all becomes all about sponsors all the time and I think thereâ\u0080\u0099s no doubt that in a risk-on world where capital was incredibly plentiful, where rates were at historic lows and where LPs we are very comfortable pushing a lot more dollars into alternatives that you saw a meaningful spike up. I think what we are just seeing now is a little bit more of a regression to the mean where this is an opportunity for corporates to take advantage of the fact that the capital deployment thatâ\u0080\u0099s coming from sponsors has slowed and it slowed for a few reasons, one of which is, as the fundraising environment becomes more difficult, sponsors are appropriately more conservative in capital deployment, thatâ\u0080\u0099s a macro trend. And then at the micro level, when itâ\u0080\u0099s harder to secure committed financing or where the committed financing is available, but far more costly, it just makes it more difficult to be everywhere in strategic dialogues. And I think that thereâ\u0080\u0099s a recognition in corporate boardrooms that at least in the near-term while the playing field may not have tilted to strategics, itâ\u0080\u0099s at least leveled. In 2020, it is hard to recruit when everyone is locked down and itâ\u0080\u0099s a virtual world and there are bigger issues as you have got a global health crisis and the like, trying to find the next platform to be an investment banker is not necessarily highest on the list. And I have said consistently that the best way for us to continue to recruit at a very aggressive clip is to return to a more normal cadence of face-to-face engagement and the like, we are there. The second issue was in 2021 with everyone so busy and with such activity in strategic world, it was hard for individuals to lead their clients at large and to make a shift, and as a result, we also said that we needed the world to calm down a little bit. I think in 2022 and 2023, where we are in a lower velocity environment, where a number of larger banks are creating a less attractive opportunities for their best talent and where we can engage face-to-face. Now as far as how that flows through the comp ratio and the like, itâ\u0080\u0099s very hard to see until you get further into the year, understand whatâ\u0080\u0099s the actual pace of onboarding, as well as whatâ\u0080\u0099s the revenue profile for the firm in 2023. However, given we have already seen some pressures on the comp ratio this year despite revenue growth and your headcount is up 9%. Look, we have always thought that as we get further and further into the build-out that we will be able to demonstrate meaningful compensation leverage, but that we are not going to resist making investments, which are the right thing for the long-term, if thereâ\u0080\u0099s a little bit of short-term turbulence. So if you give me a wider birth of two year to three years, I kind of know the direction of travel. We have always said that we donâ\u0080\u0099t add just to hit a recruiting target, and therefore, in some years, if we donâ\u0080\u0099t see the talent, we are going to be light on additions. And in other years, we have an abundance of opportunity, we will lean in a little bit more. And as I said, I think we have a differentiated platform that enables us to navigate these turbulent times better than most, and therefore, that should be an advantage for us, and we will just sort of play it out. But one thing I think everyone appreciates we have incredible regard for creating shareholder value, we are big owners in this firm and we are always going to do the thing that creates the most value over the longer term. But sitting here today, I have no reason to believe 2023 is going to be aberrational one way or the other, and hopefully, we will be able to continue to show progress on all dimensions. And then I guess for my follow-up, in your remarks, you noted that our Restructuring prospects have continued to improve and it seems like you have had greater success than some of your peers in winning these mandates so far. Look, itâ\u0080\u0099s a highly competitive environment and we compete against very formidable firms, and thereâ\u0080\u0099s always a cadence of mandates that you win and mandates that go elsewhere. Having said that, we have had impediments in competing against others that each year those constraints melt away and it really boils down to two. If we have a smaller advisory footprint and if we are competitive in fewer industry verticals, it means that the heads up or the front-end sales force is less able to present opportunities to our Restructuring colleagues than if it was further built out. So every year that we build out and we are in more geographies, have more presence, have more industry domain expertise, have more corporate relationships, that gets us better aligned with the competitive set, and therefore, we are able to leverage that. And as the Strategic Advisory business gets bigger, more formidable, more present, it becomes a greater additive to the Restructuring franchise. And I think thatâ\u0080\u0099s the macro trend you are seeing, but as far as any given quarter, what mandates travel to us or elsewhere, I try not to get too caught up in that, because thereâ\u0080\u0099s always noise in the very short-term. Paul, a number of your peers have talked about engagement levels still remaining high in the advisory -- Strategic Advisory side, just not being able to pull the trigger, given the financing markets. One thing you havenâ\u0080\u0099t really talked about is sort of that aspect of Strategic Advisory, you have talked in the past about backlog, engagements and sort of pre-announcement type thoughts. If you started last year, strategic engagement and interest was red hot and as the market cooled engagement levels did not waver. And in some respects, it was -- the crisis of confidence was on the investor side, not in corporate boardrooms and we saw our engagement levels at record levels for most of the year. I think itâ\u0080\u0099s got to the end of the year, some of these transactions just were not viewed to be actionable in the near-term. And I think clients, they suspended sort of working on some of these things, because while they still had every interest in pursuing them, they were deemed to not be actionable. Whatâ\u0080\u0099s happened is in the first five weeks of the year, I think, thereâ\u0080\u0099s a clear recognition that things that were maybe put on the hold pile are now coming back. So we are seeing a lot of that, just because itâ\u0080\u0099s been so fluid and so volatile and the sentiment moved sharply negative from Thanksgiving to the end of the year and it started to inflect to the positive. I havenâ\u0080\u0099t talked about it as much, because I donâ\u0080\u0099t really want to make too much of either the downturn in the last six weeks of 2022 or the pickup in the first five weeks of 2023. But the reality is, if you step way back, the corporate needs for transition and transformation are as great today as they have ever been and when you think about what really drives M&A activity, you can run all the correlations, you can do all the analysis, the single biggest correlation is equity valuations. And given the start to the year that is a very healthy sign and I suspect that if we can maintain some of these levels for a bit, you are going to start to see a lot more of the hold pile come back into the active or red hot pile. And Paul, do you have any -- you commented on the Restructuring business sort of a second quarter event. But how do we think about any visibility on the Strategic Advisory into the beginning of the year and how is the caseâ\u0080¦\n Itâ\u0080\u0099s -- honestly, itâ\u0080\u0099s hard -- itâ\u0080\u0099s really hard to tell. I mean thatâ\u0080\u0099s just the one where I have the least confidence, particularly trying to talk about how itâ\u0080\u0099s going to be quarter-to-quarter other than sort of state the obvious, which is, if you think about last year, last year started down, but respectively down and then inflected further. My gut is that this will look sort of as the mirror image of that, which is soft but building and I think that probably is a good read across to how I would expect our business to be. But you did say 2022 was a record year for the overall Park Hill business, which given the place for GP  performance, I think, it would suggest a strong level of secondaries activity. So when we say Park Hill was up year-over-year, it was up in both secondary and in the primary business. And then, secondly, just looking at Q1, given the timing of what we see coming in Park Hill, we see it being down significantly year-over-year, last year was a record Q1 for Park Hill. But just for the first quarter, with recovery for the rest of the year. We reduced the share count for the year, we increased our balance sheet strength and our view was if we are going to retire the shares, we would rather do it early in the year rather than wait until late in the year and thatâ\u0080\u0099s exactly what we did. We intend to be very forward-leaning in buying back stock, and all else equal our bias has been, if we are going to do it, it will probably do more in the first half of the year than the second half of the year, as simple as that. Well, once again, I want to thank everyone for joining us on this morningâ\u0080\u0099s call and we very much appreciate the dialogue and the interest in our firm and we look forward to speaking with you when we report first quarter results in the spring."
}