{
    "symbol": "KNX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-20 21:39:05",
    "content": " We've seen huge demand for our trailers that electronic logs have changed supply chains to using trailer pools, as opposed to paying for detention when a driver can't immediately be loaded or unloaded upon arrival, which historically and prior to the regulation in 2018, that's largely gone uncharged to the supply chains from small carriers previous to that electronic log mandate. So if 43% call it of our business is really a regular route exposed and that's when you back away dedicated, you back away all the other businesses, recognizing that again 90% of that business is tied to trailer pools which makes it where there's a relatively small number of competitors that we have that can come in and bring thousands of trailers in a nationwide type of a bid to compete with, 24% of our revenue is variable and that would be logistics and the new arrangements we have with our rail partners provide some variability for us, so allowing us to be a little flexible in the market. So that's why when we look at our model, and we look at, okay, giving up as much as comparing to where we just performed with our truckload business in the first quarter, giving up as much as 9 or 10 OR points, we still can see our way to the EPS annual number that starts with a 4, that's significantly different than any other cycle we've been part of as we can -- as we think about a crystal ball and just look out for a moment. And so Ravi, if you look at we talked about Iron Truck Services, and we see that kind of growth in the other reportable, we're now a couple of years into developing, for example, the maintenance network, where we're doing maintenance out of 29-or-so shops or we're underwriting insurance for thousands of carriers now, and we're really addressing the pain points for these small carriers because the nature of our relationship with third-party carriers is evolving and changing."
}