{
    "symbol": "KNX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 22:42:05",
    "content": " On a year-over-year basis, our truckload revenue, excluding fuel surcharge, grew 3.7% while our operating income declined 14.9% as we operated with an 81.8% adjusted operating ratio. A changing freight market from the all-time high demand experienced that started really in the summer of 2020 and continued into a more typical seasonal demand, which we started to see at the beginning of this year and now in some ways we're seeing sub seasonal demand as we come towards the end of 2022 and head into 2023 has been a little easier to anticipate, predict and even prepare for than what we originally saw back at the start of COVID-19. Our industry leading OR and size have afforded us the meaningful cash flow to invest in related but less cyclical industries such as LTL or insurance or maintenance, and maybe even more impactful to increase our already industry leading largest trailer fleet, but to continue to increase that to create more value and reduce volatility with increased trailer pool business with our truckload customers by providing the truck and driver to power from one of our partner carriers of our massive portfolio of third party carrier relationships. You look at the kind of performance that we've been able to do these last three quarters and what has been a changing environment where the spot market has been almost nonexistent and things have worked in a much more seasonal type pattern, and now maybe even sub seasonal now as we go into our fourth quarter. I would also add that from prior cycles we've learned this that as supply rationalizes in the full truckload market, we can see -- we usually see and we expect to see that the truckload freight market will recover before the broader demand market recovers, because supply eventually gets to a point where enough has come out that you find that at least equilibrium or maybe at that point where you're under supplied in the market even though you might have muted demand. I wouldn't be surprised if there aren't many small carriers that were just holding out hope for the fourth quarter, a strong fourth quarter to bail them out of a tougher summer with no spot because many of them have found themselves very dependent on the stock market or very dependent on a non-asset broker who used to be able to charge a much higher rate to the customer and pass a lot of that through."
}