{
    "symbol": "SPCE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 21:52:04",
    "content": " Our future fleet development roadmap calls for the first of our Delta Class spaceships to come off the line at our Phoenix assembly facility in time for entering commercial service in 2026 whereas 2022 was about establishing our design and manufacturing strategy, selecting our primary suppliers and building up our internal teams. First is leveraging Eve mothership to just get back to Spaceport America with unity, and let's just start hitting regular flights to space, do so safely do so exquisitely and create incredible experiences for people, I think that's going to be very powerful and showcasing to the world the power of this product. I'll just in the general trends, so we are kind of same place where we've been before we've, we have right around 800 or so people on board in the future astronaut category, we pulled 100 of our first 1,000 seats off to use for research that we're going to call it feather in to the manifest along the way. Following up on Mike's questions earlier on cash, if we analyze your one two cash guide that could be a free cash flow usage of 560 million per year, you guys have a $980 million cash balance, so that would only leave you with four 20 million by year-end. Well, let's see Doug, it yes, you can kind of we can tag team on this one, I framed the start of this Austin with our strategy is to invest in non-recurring engineering work, both in the engineering design and in the building of tooling that allows us to build parts and an ongoing basis and final assembly infrastructure that allows us to continue to assemble copies of this production model, both of these production models ships at relatively quite relatively low variable cost. But I do think, the heaviest bulk of getting a leverage to have additional revenue streams like the ones you're talking about, really get enabled as you start to get closer to closer to at least a weekly, if not a multi-times a week cadence there, because there's just a lot of excitement, huge emotional excitement, just being around and seen our ships go to space."
}