{
    "symbol": "MKSI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 11:49:08",
    "content": " That said, when excluding the impact of foreign exchange and palladium pass-through, Atotech's GMS business grew 2% year-over-year in the fourth quarter and 4% for the full year. Excluding the impact of foreign exchange fluctuations in palladium pass-through, fourth quarter revenue grew 1% on a year-over-year basis compared to combined company results. Fourth quarter semiconductor revenue was $503 million, declining 6% sequentially and growing 2% year-over-year each compared to combined comps result for the previous period, which was better than our expectations. Fourth quarter revenue from electronics and packaging market was $266 million, a decrease of 8% sequentially and 19% year-over-year each compared to combined company results for the previous period. Excluding the impact of foreign exchange, inflation pass-through, fourth quarter revenue declined 11% on a year-over-year basis compared to combined company results. Revenue in the fourth quarter was $316 million flat sequentially and declining 4% year-over-year, each compared to combined company results in the previous period. Excluding the impact of foreign exchange in palladium pass-through, fourth quarter revenue grew 3% year-over-year on a combined company basis. In the fourth quarter, consumables and service revenue across the 3 end market categories comprised 37% of our total revenue, up 3% year-over-year on a combined company basis, excluding the impact of foreign exchange in palladium pass-through. Specialty Industrial revenue was $1.3 billion in 2022 on a combined company basis, excluding the impact of foreign exchange palladium pass-through, combined company sales grew 4% on a year-over-year basis. Total consumables and service revenue amounted to $1.7 billion in 2022 on a combined company basis, up 5% year-over-year from the effect of foreign exchange in palladium pass-through. This reflected widely publicized cycle softness in the semiconductor industry, offset somewhat by a strong backlog coming into the quarter, continued weakening in global electronics spending impacted our electronics and packaging market and a modest sequential decline in revenue, especially industrial market. In terms of operating expenses, we're also expecting approximately $260 million in the first quarter, up from fourth quarter levels primarily due to seasonal increase in compensation and fringe expenses as well as continued investment into product development and customer-facing sales and marketing expenses. My follow-up question is, if I look at the first quarter, you gave some color on -- in the pre-ransomware events, what you've guided $1 billion, down 8%, you give a little comment on semi versus electronics packaging and especially Industrials."
}