{
    "symbol": "MKSI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 10:17:07",
    "content": " On a pro forma basis for the third quarter, we delivered revenue of $1.1 billion of which over $360 million was from Atotech. As a result, we expect revenue from our semiconductor market to decline sequentially by approximately 20% in the fourth quarter, compared to pro forma revenue for the third quarter. In the immediate term, we expect that macroeconomic headwinds in electronics end markets will negatively impact our performance with revenue from our Advanced Electronics market expected to decline sequentially in the fourth quarter, compared to pro forma results for the third quarter. For the fourth quarter, we expect revenue from our specialty industrial market to remain consistent pro forma results for the third quarter. In the third quarter, we delivered revenue of $954 million and net earnings per share of $2.74, which includes a partial quarter contribution from Atotech following the close of the acquisition. On a pro forma basis for the third quarter, revenue from our semiconductor market was 48%. Now, turning to end market results, while be commenting on pro forma revenue in change from prior periods on a pro forma basis, we delivered record pro forma revenue from our semiconductor market in the third quarter, increasing 4% sequentially to $552 million and growing 9% year-over-year. Moving to advanced electronics market, pro forma revenue in the third quarter was $296 million, growing 1% sequentially and declining 9% year-over-year. In our specialty industrial market, we delivered pro forma revenue of $292 million in the third quarter, declining 1% sequentially and flat on a year-over-year basis. On a pro forma basis, we expect revenue from semiconductor in advanced electronics markets to decline sequentially, while revenue from our specialty industrial market expect to remain consistent with third quarter levels. The sequential decline in adjusted EBITDA on a pro forma basis is a function of lower projected revenues, as well as a $20 million foreign exchange gain recorded by Atotech in the pro forma third quarter period, which is not expected to repeat in the fourth quarter."
}