{
    "symbol": "SFL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-17 12:49:15",
    "content": " Our fixed rate backlog has increased significantly over the last year and stands at approximately $3.6 billion from owned and managed vessels after recent acquisitions and charters, providing continued cash flow visibility going forward. We had a strong cash position of $224 million at the end of the second quarter and we have increased liquidity through refinancings of some assets where we have secured new strong charters, but the debt was amortized to low levels. In the second quarter, the liner fleet generated gross charter hire of approximately $89 million, including approximately $3.8 million in profit share contribution related to fuel savings on some of our large container vessels. The tanker fleet generated approximately $35 million in gross charter during the quarter compared to $30 million in the previous quarter as several Trafigura vessels at the first full quarter of revenue, as well as two Suezmax tankers and two smaller chemical tankers trading in the spot and short-term charter market. Furthermore, the company expects the recent announced Suezmax tankers on charter to cost to have full cash flow effect from early in the fourth quarter with an estimated EBITDA contribution of $7.5 million per quarter. SFL generated approximately $31 million in gross charter hire from the dry bulk fleet in the second quarter, including $1.4 million of profit share. 5 vessels were employed in the spot and short-term market and contributed approximately $13.4 million in net charter hire during the second quarter compared to approximately $8 million in the previous quarter as well on 2 drilling rigs, which have been charted out of subsidiaries of Seadrill on variable terms. So for the second quarter, we report total operating revenues according to U.S. GAAP of approximately $163 million, which is less than approximately $165 million of charter hire actually received for the reasons just mentioned. At quarter end, approximately 75% of our debt were swapped or fixed, and based on our assumptions, we estimate that a 1 percentage increase in interest rates from current levels equals approximately $0.02 per share in lower distributable cash flow per quarter and vice versa."
}