{
    "symbol": "TSAT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 22:08:04",
    "content": " Assuming all of these things occur as planned, we now anticipate that we'll retain over 90% of the revenue we originally expected to recognize from anik f2 next year, although there are some additional operating expenditures associated with leasing third-party capacity for some of the customer requirements, as well as the capital expenditures associated with purchasing the third-party satellite and making other investments in ground infrastructure. And although we have the authority to repurchase up to an additional USD 100 million of debt, given everything else that's going on at the company right now, including the discussions we're having on securing additional Lightspeed financing, we decided to hold off on further repurchases last quarter. In the third quarter of 2022, Telesat reported revenues of $180 million, adjusted EBITDA of $137 million, and generated cash from operations of $92 million with $1.7 billion of cash on the balance sheet at quarter end. In 2022, we recorded a loss on foreign exchange of $249 million during the third quarter compared to a loss of $68 million in the third quarter of 2021, the loss for the 3 months ended September to Turkey was mainly the result of the stronger US dollar, the Canadian dollar compared to the spot rate as of June 22, with the resulting unfavorable impact on the translation of our U.S. dollar-denominated debt. Included was $65 million by way of receipt of the remaining Phase 1 USC band clearing proceeds in terms of overall C-band proceeds, we have received approximately USD 85 million and expect further proceeds of approximately $260 million in terms of the capital expenditures made to date, virtually all are related to a lower or constellation Telesat lately. To meet our expected cash requirements for the next 12 months, including interest payments and capital expenditures, we have approximately $1.7 billion of cash and short-term investments at the end of September as well as approximately USD 200 million of borrowings available under our revolving credit facility."
}