{
    "symbol": "CCO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 13:25:02",
    "content": " We delivered consolidated revenue of $603 million in the third quarter, up 8%, excluding movements in foreign exchange rates. At the close of the third quarter, digital represented less than 5% of total inventory, yet digital revenue accounted for 40% of our consolidated revenue and rose 20% during the period, compared to the third quarter of last year, excluding movements in foreign exchange rates. The increase is primarily due to a 10.2% increase in site lease expense to $114 million, driven by higher revenue, primarily in our airports business, partially offset by a small increase in negotiated rent abatements. Billboard and other digital revenue continued to rebound in the third quarter and was up 6.8% to $98 million and now accounts were 34.8% of total billboard and other revenue, an increase over Q2. CapEx totaled $43 million, an increase of $11 million, compared to the third quarter of the prior year as we ramped up our spending, particularly on digital displays in the Americas. Cash paid for interest on the debt was $56 million during the third quarter, an increase of $4 million, compared to the same period in the prior year, primarily due to the higher floating rate interest on our term loan B facility. Europe's revenue is expected to be between $345 million and $360 million, excluding movements in foreign exchange rates. Based on monthly and October exchange rates, foreign currency could result in a 15% headwind to year-over-year reported revenue growth in Europe's fourth quarter. And so when -- let's say the renewal is a December 1st renewal, we'll start working that December 1st renewal over the summer and try to get a feel for whether the advertiser that's currently incumbent is on for the next year, see what they think of the price increase that we're going to put forward, which tends to be something that we look at relative to what's going on in the economy as well as traffic growth rates, which generally only move in a positive direction."
}