{
    "symbol": "ABT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 13:23:05",
    "content": " With the exception of any participantâ\u0080\u0099s questions asked during the question-and-answer session, the entire call, including the question-and-answer session is material copyrighted by Abbott. Before we get started, some statements made today may be forward-looking for purposes of the Private Securities Litigation Reform Act of 1995, including the expected financial results for 2022. Economic, competitive, governmental, technological and other factors that may affect Abbottâ\u0080\u0099s operations are discussed in Item 1A, Risk Factors, to our annual report on Form 10-K for the year ended December 31, 2021. Abbott undertakes no obligation to release publicly any revisions to forward-looking statements as a result of subsequent events or developments, except as required by law. On todayâ\u0080\u0099s conference call, as in the past, non-GAAP financial measures will be used to help investors understand Abbottâ\u0080\u0099s ongoing business performance. Note that Abbott has not provided the GAAP financial measure for organic sales growth on a forward-looking basis, because the company is unable to predict future changes in foreign exchange rates, which could impact reported sales growth. Unless otherwise noted, our commentary on sales growth refers to organic sales growth, which excludes the impact of foreign exchange. Today, we reported results of another strong quarter, including ongoing earnings per share of $1.15. Based on our performance through the first nine months of the year, we increased our full year adjusted earnings per share guidance to $5.17 to $5.23, which is more than 10% higher than the initial guidance flow we provided back in January. Inflation continues to be a stubborn force globally, but we have started to see some moderating impacts in certain areas of our businesses compared to earlier in the year. At the same time, the U.S. dollar has continued to strengthen, including throughout the most recent quarter. And lastly, global supply chain dynamics, staffing shortages continued to impact our healthcare markets, though we are seeing steady signs of improvements. Over the last few months, we have made progress in several important areas following the temporary shutdown of our infant formula manufacturing plant in Sturgis, Michigan, earlier this year. In fact, we delivered roughly the same volume of formula to our U.S. customers this past quarter as we did during the three months prior to the recall. Our number one supply priority was to the WIC, women, infant and children, federal food assistance program to ensure that underserved participants would have access to infant formula. During the quarter, we also made leadership changes, both at our Sturgis site and in our entire organization, and we concluded a month-long investigation into the accusations that were made by a former employee. And lastly, we conducted an analysis of the U.S. infant former market and concluded that this country would benefit from more manufacturing capacity and redundancy. As such, we are moving forward with plans for a $0.5 billion investment in a new U.S. nutrition facility for specialty and metabolic infant formulas. And I will start with Established Pharmaceuticals or EPD, where sales increased more than 12% in the quarter. Strong performance was led by double-digit growth across several countries, including India, China, Brazil and Vietnam, along with broad-based strength across several therapeutic areas. EPD has now achieved double-digit organic sales growth since the beginning of last year, fueled by a steady cadence of new product launches and strong commercial execution. Moving to Diagnostics, where COVID test sales of $1.7 billion were significantly higher than expectations, but lower compared to last year, which resulted in a modest decline in sales growth overall. Whereas demand for our rapid tests, which include BinaxNOW, Panbio and ID NOW continues to be strong, with sales this past quarter at a similar amount to the third quarter of last year. They provide a quick and affordable way to test COVID almost anywhere and at any time, whether you are experiencing symptoms or just want to know your status before attending events or gatherings. Excluding COVID testing revenues, sales of routine diagnostic tests grew 6% in the quarter overall and even faster internationally, fueled by the continued global rollout of our Alinity instrument for immunoassay, clinical chemistry and molecular testing. Lastly, I will wrap up with Medical Devices, where sales grew 6.5% in the quarter globally. In the U.S., sales growth of approximately 11.5% was led by strong double-digit growth in Electrophysiology, Structural Heart and Diabetes Care. During the quarter in the U.S., cardiovascular procedure volumes were somewhat soft in July before strengthening in August and September. Internationally, in addition to similar procedure volume trends, sales were negatively impacted by intermittent COVID lockdowns in China, as well as supply constraints in certain areas, most notably, in Electrophysiology. In Diabetes Care, sales of FreeStyle Libre exceeded $1 billion in the quarter and our user base expanded to approximately 4.5 million users globally. In the U.S., where sales grew more than 40%, we initiated the full launch of Libre 3, which automatically delivers up to the minute glucose readings with unsurpassed accuracy in the worldâ\u0080\u0099s smallest and thinnest wearable sensor. Internationally, organic sales growth was impacted by a couple of transitory items, including supply constraints on Libre 1 in certain emerging markets, which we expect to improve over the next couple of months. And secondly, a strategic choice we made in Germany to rapidly transition our large existing user base to our latest generation Libre 3 system, which temporarily reduced our focus on new user additions during the quarter in that country. This move strategically fortifies our leadership position in the second largest continuous glucose monitoring market in the world and further enhances our already strong strategic position as we work to bring the benefits of Libre to more and more people, including those with Type 2 diabetes that are not reliant on insulin to manage their disease. So in summary, despite the challenging environment, we achieved another strong quarter that significantly surpassed expectations, which reflects the strength of our diversified business model and execution, and based on our strong performance for the first nine months of the year, we are once again raising our EPS guidance for the year. As Scott mentioned earlier, please note that all references to sales growth rates, unless otherwise noted are on an organic basis, which excludes the impact of foreign exchange. Turning to our results, sales increased 1.3% on an organic basis in the quarter. COVID testing-related sales were $1.7 billion, which while stronger than anticipated reflect a year-over-year decline versus sales in the third quarter of last year. Additionally, organic sales growth was negatively impacted by a temporary shutdown of manufacturing at our nutrition plant in Sturgis, Michigan earlier this year. Excluding COVID testing-related sales and the U.S. sales impacted by the temporary manufacturing shutdown, total Abbott sales increased 6% on an organic basis in the third quarter. During the quarter, we saw the U.S. dollar continue to strengthen versus several currencies, which resulted in a slightly more unfavorable impact on sales compared to exchange rates at the time of our earnings call in July. Regarding other aspects of the P&L, the adjusted gross margin ratio was 55.9% of sales, which reflects the impacts of the nutrition manufacturing disruption and inflation we have experienced on certain manufacturing and distribution costs across our businesses. Lastly, our third quarter adjusted tax rate was 18.1%, which reflects an adjustment to align our year-to-date tax rate with our revised full year effective tax rate forecast of 15.5%. Turning to our 2022 outlook, for the full year, we now forecast ongoing earnings per share of $5.17 to $5.23, which is comprised of our year-to-date results through September, plus ongoing earnings per share guidance of $0.86 to $0.92 for the fourth quarter. We forecast total company organic sales growth, excluding the impact of COVID testing-related sales to be in the mid-single digits for the fourth quarter. Excluding U.S. sales impacted by the temporary manufacturing disruption, we forecast fourth quarter organic sales growth to be in the mid-to-high single digits for the remainder of our combined businesses, which includes Medical Devices, Established Pharmaceuticals, Diagnostics, excluding COVID testing-related sales and areas of nutrition not impacted by the disruption. We forecast COVID testing-related sales of approximately $500 million, which does not assume a COVID testing surge in the fourth quarter. And lastly, based on current rates, we expect exchange to have an unfavorable impact of approximately 7% on our fourth quarter reported sales. Your line is open. Robert, maybe we could start, we are already towards the end of 2022 and I think peopleâ\u0080\u0099s attention are really shifting to next year just with so many moving pieces both in revenues and down the P&L with currency and inflation and COVID testing assumptions and so on. So Libre 3, Amulet, Aveir, CardioMEMS, Navitor, we expect to be launching next year here in the U.S. EnSite X, our mapping system, launching a new ablation catheter into the market globally next year also. I expect to see continued share capture that we are seeing in core Diagnostics, and then obviously, a strong recovery in U.S. infant nutrition. So, like I said, you see that high single-digit growth in the clear path just based looking at how those businesses will perform and how they are performing and the launches that we got upcoming. Then you mentioned COVID, right, and thatâ\u0080\u0099s the other piece of the business, so high single-digit growth excluding COVID. COVID is an interesting one, Robbie, where I think over the last couple of years, we have been talking about the sustainability of COVID. Many of you writing that COVID testing will probably go away and here we are in the third quarter, in the summer months with a $1.5 billion, $1.6 billion number here in the third quarter. Down the P&L, as I have said, we are going to be taking a close look at our cost structure. We have increased that over the last couple of years, made the investments. And at the topline, the way itâ\u0080\u0099s kind of laid out comes through and the leverage falls through, you are going to see that sales growth falling through at, Iâ\u0080\u0099d say, pretty healthy margins. I think in the past a lot of you have written about the big three of Abbott, where there was Libre, Alinity and MitraClip, and those are still a big contributor of a driver of growth. But we have got a new class of products, I guess, I would call them the Fab 5 looking at TriClip, Aveir, Navitor, CardioMEMS and LAA. These products combined are an annual run rate of about $0.5 billion growing 50% and those will also receive the kind of investments to be able to kind of drive their growth since I think they are, again, in the early innings of growth for us. So we will look at managing the P&L and our investments in our structures and choosing the areas where we are going to continue to invest, and then other areas, we will see some of the leverage from the investments that we have made in the past. So as we go into 2023, to say that everything is fundamentally nothing has changed, Iâ\u0080\u0099d say true, our markets are still very attractive. We have got leading positions in these very large, high growth markets. We are going to have to be mindful, obviously, of the cost structure of some of the inflation pressures and FX challenges we have. And maybe one for Bob, the fourth quarter implied EPS guide came in a little bit lower than the street. So how should we be thinking about the impact to the bottomline in third quarter, whatâ\u0080\u0099s implied in fourth quarter and if we start thinking about our models for next year, Robert gave us the topline considerations. And the biggest moves have been really in developed market currencies, the euro, the pound, the yen, so this is something that most, if not all, multinationals are dealing with and certainly not unique to us. And I think, Robbie, maybe these headwinds are a little bit underappreciated in terms of the impact here. We always are looking to mitigate as best we can, but thereâ\u0080\u0099s certainly going to be a limit here in terms of what can be done. This year at current rates, our full year headwind is a little bit more than $0.15 in terms of earnings. About $0.10 of that is happening just in the fourth quarter alone and so while there are certainly other moving parts, that fourth quarter impact should give you a pretty good feel for the magnitude of headwind thatâ\u0080\u0099s flowing into next year, particularly in the first two to three quarters of the year. One moment for our next question. Your line is open. Two product-related questions for me, first, I wanted to start with Libre, a lot going on there, Robert. Obviously, the exciting news this quarter was the Type 2 basal LCD from CMS. So it is very exciting and if I think about your model, you are probably more aligned maybe to my team. I mean, you got 4 million basal patients in the U.S., about a third of them are covered by CMS. So this is probably going to be in terms of the timing of public comments and amount of time itâ\u0080\u0099s going to take for CMS to make the decision and then the implementation date, et cetera. So this is probably more of a second half 2023 item, I would say. Itâ\u0080\u0099s going to expand CGM coverage by about 1.5 million patients on CMS, and as you probably know, Larry, one CMS makes that determination then thereâ\u0080\u0099s a natural flow that will then move into the private commercial market. Listen, I think that we have -- itâ\u0080\u0099s not surprising from the perspective of this coming up because we have been leading in the generation of data and evidence to support this proposal. I think if you do a lit search on all the studies that have been done on CGM and then segment them between pump studies and basal studies and Type 2 studies and Type 2 with non-insulin studies, you are going to see that Libreâ\u0080\u0099s at the head of all of those Type 2 study. And then with the value proposition that Libre has, it provides us, I think, I know what your model is saying, I just think that we will have a disproportionate share of that. This is a market where, whether itâ\u0080\u0099s in the U.S. or in Europe, it predominantly drives around primary care, primary care call point, primary care scale, specifically in the U.S., DMEs and this is a segment where we do very well. If you do an audit of prescriptions by physician class, Libre has taken about 80% market share of the primary care Rx. We announced manufacturing capacity expansions also in the quarter for Diabetes Care, because we believe this is a $10 billion franchise by 2028. So we are resourcing our manufacturing, our scale, our commercial infrastructure, our service, our clinical investments to be able to support what I believe is a significant growth opportunity and we intend to lead that. I think your other question was on vitamin C. Yeah, we have completed the clinical work on the vitamin C. I will provide updates at the appropriate time. I do recognize that this is an important, I would call, short-term, medium-term kind of growth driver for us. If you think about our franchise, itâ\u0080\u0099s going to be about basal, Type 2 and pump integration. So think of that in the next kind of two years, three years of key core growth drivers. And then Iâ\u0080\u0099d say, more longer term to get to those numbers, I made an announcement beginning of this year regarding looking at this outside of diabetes on our Lingo franchise and that will then sustain our growth going forward. We are working on pump integrations outside the United States and we will have a pump integration launch by end of this year, beginning of next year into Europe with one of our pump partners and I think they are going to benefit a lot from our user base that we have in those countries. Just for my follow-up, Iâ\u0080\u0099d love to get your reaction to the Pascal data at TCT and the launch in the U.S. specifically, your thoughts on the greater durability effect they showed with Pascal. I think in Europe, we are kind of at that 80-20 split. Regarding the data set, yeah, I mean, it was -- I think it was 117 or 120 patients. I mean we have done over 150,000 implants, Larry, and we have got great data on our products. I think right now, I think, the biggest opportunity is market expansion and we are going to be driving a lot of that with the FMR indication. I think I said this in the last call, I think, that one of the biggest impacts we have for me as I looked at our portfolio was regarding COVID was not being able to benefit the FMR indication and the NCD. Yeah, I think we had -- we took a field action and I think thatâ\u0080\u0099s so far going okay. Well, I mean, I think, we have talked about how important the Structural Heart portfolio was for us even when we go all the way back to the acquisition of St. Jude and really building this franchise. That was impacted a little bit in the U.S., but we had double digit -- almost double-digit growth internationally. So if you kind of then back into that, you could see that some of the other parts of the portfolio are now starting to kind of -- as they are gaining in scale, Joanne, they are starting to have a stronger impact on the portfolio. So Amulet and Navitor internationally, I know you mentioned Portico, but Iâ\u0080\u0099d say, itâ\u0080\u0099s probably more Navitor in Europe that did very well for us and it continues to do pretty well. We have -- as I say, we acknowledge that we are behind two market leaders here, but we are making the investments and itâ\u0080\u0099s done pretty well. In Europe, Iâ\u0080\u0099d say we have got about an 8%, 9% market share in Europe and the accounts that we actually have Navitor in we are close to kind of mid-teens. Scott, maybe you can talk about kind of Amulet and what we are seeing there also. Iâ\u0080\u0099d say, Joanne, as Robert mentioned, it is kind of the remaining basket of that Structural Heart business thatâ\u0080\u0099s driving a lot of the growth there, Amulet being a component of that. In particular, I would say, in the early adopter accounts as it started late last year. So as we have added accounts over the first portion of this year, we will look to do the same thing with them as we go forward. So a great opportunity to build, seeing nice growth there, and like I said, like Robert said, kind of a handful of the other items along with TriClip, Navitor and Amulet here that are driving growth in addition to what you are seeing and now is the long-term opportunity for MitraClip. I would say, we have gone -- we have had a situation like this back in 2010 and we have seen other competitors have situations like this, Joanne, in terms of the share recovery process. Iâ\u0080\u0099d say thereâ\u0080\u0099s a couple of key things in terms of consideration and when you think about doing those modeling, itâ\u0080\u0099s looking at your share of the WIC program, your ability to continue to call on pediatricians and your share in the hospitals. So thatâ\u0080\u0099s probably where we made a decision to take our -- take the volume that we had and like I said in my opening comments, we actually supplied to the market this quarter, what we supplied in the three months prior to the recall. And I think by focusing on that, we not only live to our commitments and the contracts that we put in place, but thatâ\u0080\u0099s going to obviously be a base for us as we go into this quarter and into next quarter. So if you look at the Nielsen data, you do see share recovery, Iâ\u0080\u0099d say, we probably lost about 20 share points from the recall and I think the last read that I saw in September was we got half of it back. And that is a mix -- this will go to the mix piece where on the WIC side, we have recovered all of our share and now we are going to take our capacity and start moving it into the non-WIC channel with the non-WIC configuration. So like, I said, we have intentionally made these decisions in terms of how we are supplying the market and I think by doing that, just naturally with the work that our teams are doing, we will start to see the share recovery build month-over-month. One moment for our next question. Your line is open. Robert, I wanted to ask about the COVID testing franchise and just the strength in 2022 and thinking about the comp for 2023. I know itâ\u0080\u0099s impossible to forecast utilization or uptake of COVID testing next year, but if thereâ\u0080\u0099s any base commentary you can provide that would be helpful and I just have 1 follow-up. I think thatâ\u0080\u0099s -- looking at the market between government contracts and non-government contracts is something that we spent a lot of time this year doing, because obviously, those government contracts, they are high volume and they, ultimately, skew a little bit of kind of the run rate as we are trying to kind of run rate this. So about $0.5 billion across the world, across all of our platforms, in a winter season without necessarily forecasting the kind of surge that we saw last year, in that number, we do not have any significant government contracts. They work very well with the -- in terms of determining COVID and the new variants, et cetera. So we donâ\u0080\u0099t have any significant number in 2020 -- in Q4 of this year, we think that thatâ\u0080\u0099s the kind of right -- kind of run rate from an endemic standpoint. Just one follow-up on Libre, you mentioned just the path to achieving full iCGM status and understand thereâ\u0080\u0099s a segment of the CGM that will open up for Libre. So we are doing -- like I said, we completed the work on Libre 2 regarding the vitamin C. We will be updating the market and our partners as we go through that process with the agency. So if thereâ\u0080\u0099s some sort of interruption in insulin delivery from the pump, what is understood clinically is that the ketone levels will rise earlier than the glucose levels and to be able to have that ketone level, that continuous ketone level measurement is an added safety feature for that pump environment and I think it does provide, I guess, a step ahead in terms of innovation, in terms of pump integration. Regarding the accuracy, I mean, I think, itâ\u0080\u0099s commonly understood and the data is very clear in terms of Freestyle Libre 3. Yeah, Libre 3 pricing, Libre 2 pricing, Libre 1 pricing, itâ\u0080\u0099s practically all the same, Josh. And the more volume we can get on to Libre 3, the more we can kind of lower those COGS, but we have a parity pricing right now. And we think that, that pricing strategy, as I said last year, as the international markets or even in the U.S., people have challenges either with copays in the U.S. or with formularies and reimbursement decisions internationally. So I think that our value proposition, consumer friendly product with best-in-class accuracy, feature set that no real gaps and our pricing strategy, I think, itâ\u0080\u0099s a complete value prop. One moment for our next question. Your line is open. When you back out some of these the supply chain impact, I think, you mentioned Germany nutrition, what was the underlying organic growth and when can we get back to an environment where there is no mismatch in the headline organic and underlying rate, itâ\u0080\u0099s a clean number. I would say the issues that we have had, the challenges we have had in this quarter regarding supply chain, they are fairly, Iâ\u0080\u0099d say, from a Med Device perspective, they are pretty significant and they kind of had the impact that we saw in our Med Device business. I think if you had look at the kind of back orders that we had, whether it was Libre 1 and some of the back orders that we had in EP, we would be high-single digits, but if you back out these issues mid-to-high overall for the company. I think part of the challenge here is COVID -- COVID to play and as that base becomes smaller than what it is this year, I mean, this year, we will probably do very much close to the same amount of COVID test sales that we did kind of last year. But as we move into next year and that becomes smaller than this year, we will see a little bit of an impact on that overall growth rate. But as I said, I think in Robbieâ\u0080\u0099s question, I see high single-digit growth once you back out of COVID and so COVID will be just the determining factor there, but base non-COVID high single digits next year. And then maybe one on the financial side, I think, gross margins were down Q-on-Q, I am wondering what was the FX incremental inflationary impact. I think Robert Funck mentioned $0.10 of FX impact in Q4, should we annualize that to $0.40 of FX impact for next year? But, certainly, through the first 3 quarters, you would expect to see that, but then in the fourth quarter you are going to kind of be at those rates that we currently are at. So, but again, it is going to be a significant headwind for us next year. Like others the biggest impacts we have seen is really around commodities, other manufacturing input cost and logistics. So thatâ\u0080\u0099s about $1 billion for the year, so call it, maybe 240, probably, a little more than 240 basis points on the gross margin. As we -- as Robert said, we have seen a little bit of moderation in the rate of increase in the third quarter compared to where we were earlier in the year and we are trying to take some price to offset that really more in our consumer facing businesses. Kind of given the way that inflation has hit us over the course of this year, the inventory that we purchased and manufacture this year at these higher costs will definitely negatively impact us next year when that inventory is sold, even if inflationary pressures start to come down kind of as we get into next year. On your question on Lingo, Vijay, we have factored in a launch into next year. Itâ\u0080\u0099s a different business model, as I talked about it, more of a direct-to-consumer wellness subscription model and we are on target here to come out of the gates to that in Q1. We are going to be launching into, what I would call, a little bit of a challenging environment. But I think that the long-term growth opportunity of building this kind of business, a wellness subscription-like model with the platform that we have built and the scale that we have, I think, is a great growth opportunity for us. But we will be launching, like I said, in a challenging environment, but I still think itâ\u0080\u0099s the right thing to do from a long-term perspective. Your line is open. Itâ\u0080\u0099s interesting, as we have been looking at this, thereâ\u0080\u0099s definitely interesting impacts in terms of ranges of these pricing. And really the magnitude here depends on whether itâ\u0080\u0099s a national or regional process, some of the categories have been more regional and they tend to be a little bit lower, and it also depends on the number of participants that exist in that category. So as I look at -- on the EP side, we have also seen that when there are more system -- like a system based approach, Travis. So I think capital, think about the technical support and the infrastructure associated support that, those tend to be a little bit on the lower end of that range versus to be on the higher end of that range. But as I have said, just because we have a strong balance sheet and we have got a lot of flexibility, we are still going to make sure that we are going about this from a strategic perspective and we are going about it from a financial perspective. But I would say they probably need to stabilize a little bit of these valuations so that you can engage what I would call just meaningful discussions here and I think as those stabilize, I think, you will see the environment pick up here in terms of M&A. But thereâ\u0080\u0099s a lot of opportunities out there for us and we are going to apply that consistent framework of strategic and financially disciplined in terms of how we look at that, okay. Q3 was probably a very challenging quarter for us, probably, our most challenging. Obviously, the impact of inflation and supply chain and some of the back orders that we encountered was a headwind. But you saw the portfolio strength and the execution here coming through that, all those challenges and delivery, not only in the quarter but also for the full year as evidence of our full year raise here also. So itâ\u0080\u0099s also provided us an opportunity to make some strategic choices, to strengthen our business and to strengthen our position and build our momentum."
}