{
    "symbol": "ABT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 13:00:26",
    "content": " In diabetes care, fourth quarter sales of FreeStyle Libre, our market leading continuous glucose monitoring system grew over 40% in the U.S. and global Libre sales reached $4.3 billion for the full year 2022. Excluding both COVID testing-related sales and U.S. infant formula sales that were impacted by manufacturing disruptions last year in our Nutrition business, total Abbott sales increased 7.1% on an organic basis in the fourth quarter and 7.4% for the full year 2022. Your line is open. But I mean, if you look at really the two areas I would say, Robbie, that kind of have had this effect of maybe sometimes distorting the results a little bit is our COVID testing business and the impact of the recall products last year, right. And then if you take that comp out on the recall product side this year as we return to market and look at the base business, obviously, without the COVID testings, we are going to be growing high single-digits, probably at a higher end of that pre-pandemic range probably 8% plus. If you look at our device portfolio, we will be looking at high single-digit growth rate, low double-digit growth rate, combination of both kind of recovery, the steady recovery procedures that we are seeing combined with all these product launches that we have got lined up that will ultimately have a full year impact, whether itâ\u0080\u0099s Libre 3, Amulet, Aveir, Navitor, CardioMEMS, Eterna on the neuromodulation side, our mapping system in EP, we are going to launch a new ablation catheter. And I think thatâ\u0080\u0099s the other part of, I guess, in the P&L, if you look at what we have been able to do this year is because of COVID and the investments that we made during COVID in these growth areas, we are able to drive this high single-digit growth across the company with a fairly flat investment line, whether itâ\u0080\u0099s R&D and SG&A, so really getting the leverage across the businesses. Your line is open. And then finally, I would say on the pipeline perspective, I donâ\u0080\u0099t think itâ\u0080\u0099s a 2023 milestone for sales, but I think itâ\u0080\u0099s an important development activity for us is going to be the running our trial for the compline glucose ketone sensor with the FDA and generating the data to support a dual sensor because I think, again, as Iâ\u0080\u0099ve mentioned, it seems to be the go-to sensor for pumpers will be this ability to measure glucose and ketones and factoring that into the algorithms. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}