{
    "symbol": "ROCK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 12:12:15",
    "content": " As a reminder, my discussion will cover results from continuing operations and also excludes the related revenues and expenses from Agtech segment's processing equipment business, which has been removed from the adjusted results for both 2021 and 2022, as we classified this business as held for sale with this quarter's results. Again these factors began to abate in March and we expect significant sequential margin improvement in the second quarter, driven by stronger revenues as construction season begins improved field efficiencies as the severe weather impact has ended and we have less project disruption from customer supply chain issues. As we previously mentioned, finding temporary employees continues to be a challenge and we took advantage of the seasonally slower first quarter to increase production to ensure we're able to meet our customer demand as we move into the seasonally stronger period of the year for these businesses. As I mentioned earlier in the call, we've classified the processing equipment business which accounted for 10% of the Agtech segment's 2021 revenue as held for sale with the first quarter 2022 results and remove the related revenues and expenses of this business from adjusted segment results. On the organic side, if you think about the process equipment coming out of the portfolio we're kind of back focused on the roots we've been in for 80 years and over the last couple of years, we've added more emphasis on produce in particular, which is a relatively fast-growing end market with a lot of investments going in, in North America particularly in the US here in the last year but continues in Canada as well. That's why our confidence in Agtech this year, as we continue to make progress starting last year, we said sequentially we're going to get better every quarter on margin and we have not as fast as I would have liked, but we've continued to improve. I mean, we have a if you think about the population in the US and you think about where C&I solar installations are heavily oriented, traditionally it's been in Northeast which is highly populated and unfortunately the projects that were supposed to be done in Q4 of 2021 because of panel supply and other supply chains got pushed into January, February timeframe and then we got into some unfortunate weather and that was a problem. Now that we have this new development in the industry with the DOC investigation, it's actually forced us and our customers for every project that's in flight or in plan to understand what is already in hand because if you have -- if you don't have your panel before March 22, then depending on the outcome of the investigation, if it goes in favor of the complainant and you bought your panel after March 22, you have risk of these retroactive duties. So the weather's gone, because of this DOC, but also because for the last two quarters we've been working with our customers before we start full forming a racking system and schedule our projects in the field, we make sure we know what panels are going to show up and when, because it can't really manufacture the racking system efficiently until you know what panel is going to be on that job."
}