{
    "symbol": "OCX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-04-03 11:40:24",
    "content": " These factors may include, without limitation, risks inherent in the development and/or commercialization of potential diagnostic tests, uncertainty in the results of clinical trials or regulatory approvals, the need to obtain third-party reimbursement for patientsâ\u0080\u0099 use of any diagnostic test the company commercializes, our need and ability to obtain future capital and maintenance of IP rights, risks inherent in strategic transactions such as failure to realize anticipated benefits, legal, regulatory or political changes in the applicable jurisdictions, accounting and quality controls, greater-than-estimated allocations of resources to develop and commercialize technologies or failure to maintain any laboratory accreditation or certification and uncertainties associated with COVID-19 pandemic and its possible effects on our operations. This transaction, which closed in February 2023, eliminated an estimated $8 million of annual operating expense and $13 million of future milestone and development liabilities while allowing Razor Genomics to maintain continuity of service for DetermaRx patients and clinicians. Our consolidated preliminary revenues for the fourth quarter of 2022 were approximately $1.1 million, representing a decrease of 69% year-over-year. Fourth quarter revenues associated with DetermaRx, were $0.8 million, an increase of 3% year-over-year. Our pharma services business generated $0.3 million in the fourth quarter, a decrease of 44% year-over-year. Cost of revenues for the fourth quarter were approximately $2.4 million, including $1.6 million from the cost of diagnostic test and testing services we performed for our DetermaRx and pharma services customers and $0.8 million in non-cash amortization expenses related to DetermaRx and pharma services-related intangibles. G&A expense for the full year was approximately $22.5 million which was relatively flat versus the prior year, reflecting managementâ\u0080\u0099s efforts to control spending not directly related to product development or commercial activities throughout 2022. For the full year, sales and marketing expense was approximately $13.6 million representing an increase of 22% year-over-year. If you recall, this is ahead of guidance provided in our midyear 2022 earnings call, where we stated our goal of entering the first half of 2023 with a quarterly cash burn rate below $10 million. With our current plan, we expect that continued cash management efforts will get us below $6 million in quarterly average burn for the second half of 2023. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}