{
    "symbol": "OCX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 03:03:40",
    "content": " These factors may include, without limitation, risks inherent in the development and/or the commercialization of potential diagnostic tests, uncertainty and the results of clinical trials or regulatory approvals, the capacity of OncoCyte's third-party supply blood sample analytic system to provide consistent and precise analytic results on a commercial scale, the need to obtain third-party reimbursement for patients use of any diagnostic test the company commercializes, our need and ability to obtain future capital, the maintenance of IP rights, risks inherent in strategic transactions, such as failure to realize anticipated benefits, legal, regulatory, or political changes in the applicable jurisdictions, accounting and quality controls, greater than estimated allocations of resources to develop and commercialize technologies or failure to maintain any laboratory accreditation or certification and uncertainties associated with theCOVID-19 pandemic and its possible effect on our operations. When combined with the operating savings from the reprioritization process, reduced head count and the imminent modernization of some of our assets through licensing and strategic activities, we anticipate being able to reduce our annual operating cost by over $12 million over the next year and have improved line of sight to how our cash will last into 2024, but still allowing us to deliver on VitaGraft, DetermaIO and DetermaCNI product launches. Our consolidated revenues for the second quarter of 2020 were approximately $2.1 million, up $0.7 million quarter-over-quarter and a slight increase as compared to the same period a year ago. Cost of revenues for the second quarter were approximately $2.4 million, including $1.4 million from the cost of diagnostic tests and testing services we performed for our DetermaRx and Pharma Services customers, providing revenue deliverables under our license agreements and $1 million in noncash amortization expenses of DetermaRx and Pharma Services related intangibles. Sales and marketing expense for the first quarter of 2022 was $3.5 million, an increase of $0.9 million year-over-year, primarily attributable to an increase in headcount and continued ramp in sales and marketing activities to prepare for commercialization of our transplant business, as well as support the commercialization efforts of the DetermaIO and DetermaRx. General and administrative expense for the second quarter of 2020 was $5.5 million, a decrease of $2.4 million for the same period in 2021, primarily due to onetime acquisition-related costs of Chronix Biomedical in the same period of the prior year. Non-GAAP operating loss as adjusted for the second quarter of 2022 was $11.2 million, an increase of $3.4 million as compared to the same period a year ago. For second quarter of 2022, we reported a GAAP net loss of $8.3 million or $0.07 per share as compared to $10.3 million or $0.11 per share, a decrease of $2 million quarter-over-quarter and $10.5 million, an increase of $2.2 million as compared to the same period a year ago. et cash used in operations for the quarter was $11.3 million Net cash used in operations decreased sequentially due to focused efforts to control hiring and optimize our use of cash primarily by reducing clinical trial spend and marketing investment beyond the $1 million milestone payment from the Burning Rock, licensing agreement. We remain confident that the combination of these activities will allow us to enter the first half of 2023 with a quarterly cash burn rate below $10 million, and we expect the burn to decline below $8 million by the second half of 2023. And just to confirm the timing also, the $810 million burn rate per quarter is really in the first half of 2023, just so that's clear, too."
}