{
    "symbol": "TAL",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-28 09:33:06",
    "content": " Ladies and gentlemen, thank you all for joining us today for TAL Education Group's first   quarter fiscal-year 2023 earnings conference call. Also, our earnings release and this call include discussions of certain non-GAAP financial measures. This quarter, we continue to execute our development strategy as we proceed our new journey and have made meaningful progress. As a result of our top line expansion, for the fiscal quarter ended on August 31, 2022, we recorded US$42.3 million and US$26.6 million in non-GAAP operating income and non-GAAP net income attributable to TAL respectively. This quarter, we updated our mission statement from love and technology make education better to empower lifelong growth with love and technology. We've been empowering our users lifelong growth through providing learning services, learning content solutions, and learning technology solutions since inception, and will continue to empower their lifelong growth through learning and beyond. Afterwards, I will update you on our business strategy and then we'll open the floor for questions. Before we start, please note that the financial data for each business line mentioned below is based on unaudited data for the quarter. Let's start with learning services and other, which primarily consists of learning programs we provide in various class sizes, both online and offline. This includes Peiyou small class,  , Think Academy, and other learning services businesses. This quarter, learning services and other accounted for approximately 75% of the total net revenue, maintaining its status as our largest revenue contributor. Within learning services, for enrichment learning, we continue to optimize our user experience and operating metrics by improving service quality of our existing programs, while also expand our program offerings. With respect to our overseas learning services, I'm delighted to share with you that Think Academy is still maintaining a triple digit year-over-year growth rate. It also created incredible opportunities across all aspects of learning,   demand for high quality learning products and services. To better address this market demand in various overseas markets, we have focused on developing effective localized learning service offerings leveraging our technology capabilities and our expertise in learning. Moving on to our learning content solutions business, which provides learning content in print, digital, and hardware formats to adjust diverse demands across various user groups. In this quarter, our Content Solutions business accounted for around 15% of the total net revenue, representing a larger share of our overall revenue and exhibiting encouraging quarter-over-quarter growth. In the last quarter, I talked about Smart Books, the products where we embed videos into print books to supplement the learning experience of our users. For this past summer holidays, we rolled out summer specific Smart Books that decompose the learning experience into weekly and in some instances daily programs. As Smart Books break the learning experience into engaging and interactive bite sizes, students are more likely to engage and finish the programs. Finally, let's look at our learning technology solutions business, which provides a full suite of enterprise grade technology products and services for learning institutions. Its revenue accounted for less than 10% of our total net revenue, primarily due to seasonal demand fluctuation from our institutional clients driven by school holidays. Now, let's switch gears a bit and let me talk you through the key financial results for the quarter. Our total net revenue was US$294.1 million, representing a 79.6% decrease from US$1,443.9 million in the same period last year. Year-over-year, growth profit declined by 69% to US$176.9 million from US$571.3 million in the same period last year, while gross margin increased from 39.6% to 60.2%. Non-GAAP selling and marketing expenses, which excluded share based compensation, decreased by 75.5 year-over-year to US$69.8 million from US$285.2 million in the same period last year. Non-GAAP general and administrative expenses, which excluded share based compensation costs decreased year-over-year by 74.4% to US$80.7 million from US$340.9 million in the same period last year. Income from operations was US$14.9 million, compared to loss from operations of US$379.9 million, in the second quarter of fiscal year 2022. Non-GAAP income from operations, which exclude the share based compensation expenses was US$42.3 million, compared to non-GAAP loss from operations of US$313.4 million in the same period last year. Net loss attributable to TAL was US$0.8 million in this quarter, compared with net loss attributable to TAL of US$826.5 million in the same period last year. Non-GAAP net income attributable to TAL, which excluded share based compensation was US$26.6 million, compared with non-GAAP net loss attributable to TAL of US$760.1 million in the same period of last year. From the balance sheet, as of August 31, 2022, the company had 1,759.3 million of cash and cash equivalents. US$1,327.3 million of short-term investments and US$366.2 million in current and non-current restricted cash. Now, I'll hand the call back to Mr. Alex Peng to briefly update you on our business strategy outlook. As we continue to transform our business into a smart learning solutions provider, we are committed to executing our company's long-term strategy. First, for our learning services business, we'll continue with our efforts in advancing product development, optimizing our go-to-market strategy, and further exploring opportunities in overseas markets. And as I mentioned on the previous call, we look forward to partnering with third parties from around the world to delivering world-class content to our customers. Regarding learning technology, by adhering to our keywords, online, digital, intelligent, and open, we'll stay committed to enhancing our technological competitiveness and empower our institutional customers to deliver a better learning experience through technology and innovation. As we look at this last quarter's performance, we're really encouraged by the progress and we are really thankful to our customers trust in us. Although the financial performance was partially as a result of seasonal fluctuations, we could see some early signs of positive customer reception of our new products and services. I think that's not just the mission to our customers, but also a constant reminder to ourselves to look at every setback and every challenge with a  , to be humble, to be resilient and to be open to new possibilities. So, first of all, I think we believe that the scope of our content business is not really limited to print books. So, our content solutions are  a kind of end-to-end learning solutions to our users. These contents, they can guide users along their learning experience at a self-directed pace. And I think as I mentioned last quarter, we're also on the   side continued to double down on some of the most dynamic e-commerce and content platforms. So, with all that combined, we really think as this business matures, it will have more upside than the traditional publishing industry. So, in this past quarter and in the next few quarters to come, weâ\u0080\u0099ll continue to invest in new initiatives such as overseas learning services, and certain new product categories within content solutions. You asked about investment size and budget, I would say, as we look at these new initiatives, the company's management will adopt a balanced and prudent investment strategy. In terms of new initiatives impact on the company's cash flow, I would say, by the end of this past quarter, the company had more than $3 billion where we combine cash and cash equivalents, short-term investments, and current and non-current restricted cash. As each of our businesses are still in the early stage of exploration, we're still closely following the impact of seasonality throughout the year. Let me talk through each business line, respectively. For learning services, similar to the past, we've witnessed higher demand in winter and summer holidays. This business is impacted by school holidays, as well as shopping holidays in China such as . For Technology Solutions, Q2 tends to have lower market demand because some of our institutional clients offer less tutoring services during our summer school holidays. This is a combined effect of business growth, seasonal fluctuation, and all cost optimization measures. And that is because we expect revenue to decline quarter-over-quarter, due to seasonality. At the same time, we'll continue to take measures to drive business growth and optimize cost efficiency. I think first, I think on the previous question, I already discussed a bit on the content business. And I think there is a key takeaway from that, which is we're seeing a shift in consumer behavior toward more self-directed and self-paced learning. In concurrent with that, what I'm also seeing is that in an increasingly digitally connected world, we need to provide to young people the benefit of online content through digital devices while safeguarding their health. So, underpinned by improvement in AI Technology and other innovations from the hardware industry, such as screens that are more protective of the user's  , we believe that intelligent device will tailor to the needs of young people will play an increasingly important role in this industry. They provide a way for users to seamlessly consume a wealth of third party, printed and digital content on a more interactive and more personalized basis. I think for the business model, we look out for each particular used case. My question is on the â\u0080\u0093 on your overseas business, you mentioned that the Think Academy is reporting triple-digit growth this quarter. I think first of all, the revenue share of this business still at low-single-digit level, but as we mentioned before, the growth rate is high. At present, we provide online and offline courses under the Think Academy brand in several regions and countries, but we really look at those as only the initial phase of the company in the overseas market. After the outbreak of the epidemic, we noticed that there are many opportunities worth exploring in the overseas market, such as the development and distribution of digital content, highly interactive teaching aids or Smart Books and high quality online and offline teaching services."
}