{
    "symbol": "TAL",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-19 10:40:05",
    "content": " Before we continue, please note that today's discussion will contain forward-looking statements made under the safe harbor provisions of the U.S. I appreciate you all for joining us on today's call, especially as we are approaching the Chinese New Years' holidays. On this call, I'd also like to share with you our performance in the last quarter, as well as our expectations for the quarters to come. We recorded US$232.7 million and RMB 1,658.5 million in net revenues for the quarter. So if we look at a quarter that's more comparable to Q3, for example, Q1, the net revenues increased 4% in US dollar terms and 14% in RMB terms. In terms of profitability for the fiscal quarter ended on November 30, 2022, we recorded US$4.5 million and US$23.2 million in non-GAAP operating loss and non-GAAP net loss attributable to TAL respectively. So with that overview, I'd like to give Jackson the floor to share more color on the operational developments and the financial performance of our core business lines. Afterwards, I will update our business strategy for you and then we'll open the call for questions. Within learning services, we continue to fine-tune our enrichment learning programs and as a result saw an increase in average retention rate for two consecutive quarters. However, if we compare the enrollment of Q3 to that of Q1, we recorded growth in learning enrollment between these two periods. Aside from operating metrics, we're also closely monitoring customer feedback on our enrichment programs. In this past quarter, we also witnessed recovery in our offline learning centers. In fact, revenue generated from offline enrichment programs increased in Q3 when compared with Q2. In this  age where OMO learning experience continues to proliferate, we see online and offline presence both as important components in our learning services business. While our domestic learning services business continues on its development path Think Academy, our overseas learning services business maintains its momentum with online operations covering a global market and offsite operations in countries such as US and Singapore. Moving on to our content solutions business, which accounted for roughly 20% of total net revenue compared to slightly more than 15% a quarter ago. I talked about small books in the last couple of quarters, the products where we embed videos into print books to supplement learning experience of all users. In this quarter, we're glad to see that a significant portion of the users who purchased and activated the online features of the smart books are learners who historically never enrolled in our learning program to the best of our knowledge. Within content solutions, we also made progress on the exploration of smart learning devices. In addition to product development, we also continue to build our go-to-market capabilities for our content solutions business. In an industry where offline distribution channel typically constitutes a large portion of the total volume, the majority of our content solutions are sold through online channels, such as e-commerce and live streaming. Finally, let's look at our learning technology solutions business. In this past quarter, we released a new sub-brand called Meixiao Smart Education, which targets the market for schools. Our net revenues totaled US$272.7 million, representing a 77.2% decrease from US$1.02 billion in the same period last year. Non-GAAP cost of revenues, which excluded share-based compensation decreased by 80.9% to US$99.4 million, from US$519.2 million in the third quarter of fiscal year 2022. Gross profit declined by 74.1% to US$129.7 million, from US$501.4 million in the same period last year, while our gross margin increased from 49.1% to 55.8%. So, I think I got cut off when I said non-GAAP net loss attributable to TAL which excluded share-based compensations -- was $23.2 million compared with non-GAAP net loss attributable to TAL of $58.6 million in the same period of last year. As of November 30th, 2022, the company had $1.86 billion in cash and cash equivalents, $1.18 billion of short-term investments, and $447.4 million in current and non-current restricted cash. Now, I'll hand the call back to Mr. Alex Peng to briefly update you on our business strategy outlook. As we continue to transform our business into a smart learning solutions provider, we remain committed to executing our company's long-term growth strategies with each of our four business blocks. Although the revenue of this quarter was affected by exchange rate fluctuation and seasonality, our new business has maintained the momentum of continuous development. The first, our learning services and other business. We will continue to strengthen the quality of the products and services, while also gradually roll out more programs and increase our physical footprint. As the market for enrichment learning evolves, we plan to leverage our â\u0080\u0093 in learning in our operational knowhow to further serve our customers. For our content solutions business, we're really encouraged by the progress, but we also do understand that we have a long way to go, before we become competitive in this relatively new market lots. In the next few quarters, we'll roll out new product SKUs, while investing in our go-to-market capabilities, especially in our OMO channels. And as I come to the end of my remarks, I'd like just to say, we're just a few days away from Chinese New Year. I think on the previous call with you all, I reflected on the fact that we changed our mission statements, and how critical it is for us to adopt a growth mindset going forward. Your line is open. Before I spend more about the numbers, I would just say, as we transform our business and how we think about profitability, we probably focus more on creating more value for customers and have structurally healthy business model as opposed to focusing on near-term operating profitability as well. When I look at the three main business lines, for learning services and other, in this past quarter, we had a positive operating margin. For learning technology solutions, we are also operating profit and had double-digit operating margin. For content solutions, if we look at the more mature SKUs, they're profitable on a contribution margin basis. I would say, as we look in the long run, when we think about learning services and other, we tend to think operating margin will have some fairly small room for margin improvement as the business goes up and the improvement will be quite gradual. And for content solutions, we'll carefully manage our operating profitability, as we manage the balance between mature and new SKUs. We will take our next question. Your line is open. Iterating to your introduction report, the content solutions business is still in the investment period. The first one, we mentioned I think on a couple of previous calls, our aim is really to build world-class content. So, as I think about that more topics -- more topic areas for print and smart books and continue to enhance the digital features of those contents, more core factors for hardware, those are all going to be the investment areas on the content side. I think, we talked about this just now, that much of our content products are sold on online channels. As we go into these various form factors, we obviously are getting deeper into various kind of supply chain for physical movement  and these are all deep expertise areas for us to build up our experience and capabilities, wanting to continue to enhance our product, quality and experience and also to ensure we have a competitive cost structure. In terms of the strategy in introduction â\u0080\u0093 I think I mentioned this on a few calls over the past quarters, I think we are continuing to â\u0080\u0093 led to building that world-class content. We will take our next question. Your line is open. Regarding the first part of your question, the impact of the epidemic, I would say historically we carefully manage that impact through offering an online option to students who enrolled in our offline classes, when the epidemic caused inconvenience. In the last â\u0080\u0093 and looking forward and obviously, as the impact of COVID starts to diminish in China, we'll offer a balance and hybrid online and offline learning experience to our learners. I would just say with regard to our offline learning centers, for the last two consecutive quarters we increased the number of our learning centers by both single-digit increase in the last two quarters and we currently have somewhere between a 100 and 200 learning centers. In the next few quarters to come, we'll continue to slowly but gradually increase the number of our learning centers. We will take our next question. Your line is open. So that $32 million of other expense obviously is not related to any operating activities and that is a combination of multiple factors including: one, exchange rate fluctuation and two, some of the equities we hold and booked according to fair value. And the second part of your question with regard to restricted cash, again, it's a combination of multiple factors including: one, some of the payment we collect from learning from for our learning programs are restricted; and two, some of the wealth management product depending on the nature of the underlying instruments are restricted as well."
}