{
    "symbol": "PGRE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 16:50:04",
    "content": " Of the 250,000 square feet, 153,000 square feet was leased in our New York portfolio, which led the way accounting for over 60% of this quarter's leasing at a solid weighted average lease term of 9.3 years. Of the 97,000 square feet leased in San Francisco this quarter, about 59,000 square feet or over 60% was leased at One Market Plaza at starting rents in excess of $118 per square foot. Our second quarter leasing activity was more heavily weighted toward New York with approximately 153,000 square feet leased or 61.1% of this quarter's total leasing. Midtown's second quarter leasing activity of approximately 4.2 million square feet, excluding renewals, was only 4.1% below Midtown's pre-pandemic 5-year quarterly average and was the fourth consecutive quarter of leasing activity in excess of 3 million square feet. Financial services continue to drive the Midtown market, contributing 49% of leasing activity during the second quarter, well in excess of the 32% share of occupancy the sector currently accounts for in Midtown. Our New York portfolio is currently 92% leased on a same-store basis at share, up 130 basis points quarter-over-quarter and up 570 basis points year-over-year. During the second quarter, we leased approximately 97,000 square feet at a weighted average term of 7.9 years with initial rents of approximately $105 per square foot. Much like the first quarter, the growth in the second quarter was once again driven by our New York portfolio, which grew by a robust 9.2%, while the same-store growth in our San Francisco portfolio decreased, as expected, by 2%. During the second quarter, we executed 20 leases covering slightly over 250,000 square feet of space at weighted average starting rents of $78.28 per square foot and for a weighted average term of 9 years. But suffice it to say, we feel good about our pipeline. But suffice it to say, we feel good about our pipeline."
}