{
    "symbol": "PGRE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 17:03:05",
    "content": " Our fourth quarter leasing activity was weighted toward New York with 151,700 square feet leased or approximately 74% of this quarter's leasing total. At quarter end, our same-store portfolio-wide leased occupancy rate at share was 91.3%, down 10 basis points from last quarter and up 70 basis points year-over-year. Midtown's fourth quarter leasing activity of approximately 2.6 million square feet, excluding renewals, was down 44% quarter-over-quarter and down 30% below the 5-year quarterly average. Our New York portfolio is currently 92.1% leased on a same-store basis at share, unchanged quarter-over-quarter and up 180 basis points year-over-year, demonstrating the resilience of our portfolio during a challenging year for Midtown. At quarter end, our San Francisco portfolio was 88.9% leased on a same-store basis at share, down 40 basis points quarter-over-quarter and down 270 basis points year-over-year. Our San Francisco portfolio, as expected, reported negative year-over-year same-store growth of 4.2% and 8.7% on a GAAP and cash basis, respectively, driven primarily by a 270 basis point decline in occupancy. During the fourth quarter, we executed 18 leases covering 205,530 square feet of space at a weighted average starting rent of $77.66 per square foot and for a weighted average term of 3.8 years. The $0.07 per share decrease in core FFO when compared to our 2022 results is comprised of the following, negative same-store cash NOI growth between 3.5% and 5.5% or $0.08 per share, which, as a reminder, results primarily from the previously reported lease expirations of Credit Agricole's 305,000 square foot lease at 1301 Avenue of the Americas in New York and Uber's 235,000 square foot lease at Market Center in San Francisco. Operationally, we expect to lease between 600,000 and 900,000 square feet during '23, and we expect to end the year with a same-store leased occupancy rate between 90.8% and 91.8% or 91.3% at the midpoint, which would keep us flat relative to where we ended 2022. It's taken a little bit longer than we would like, but we have some good credit tenants at this point, expressing some interest -- and then really beyond that, the only space that I think you're asking about would be 31 West 52nd Street, the space that we get back in 2024. But I think the point is while demand is less than perhaps what we had experienced in the earlier part of 2022, our theory and what we're experiencing in real time is that our portfolio continues to get looks from all prospective tenants, all tenants in the market, and it's a function of the way in which we've invested in the buildings and what we have to offer."
}