{
    "symbol": "PGRE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 00:07:09",
    "content": " Our third quarter leasing was New York driven and was highlighted by the 142,000 square foot lease with O'Melveny and Myers at 1301 Sixth Avenue, where they will take over four floors currently occupied by Credit Agricole which was set to expire in February 2023. The activity we see remains at strong rates with initial starting rent on the 35,000 square feet we leased at a robust $114 per square foot and increasing a modest 1.6% on second-generation space on a cash basis and over 14% on a GAAP basis. Our third quarter leasing activity was heavily weighted toward New York with approximately 254,000 square feet leased or 88% of this quarter's leasing total. Turning to our markets, Midtown's third quarter leasing activity of approximately 4.6 million square feet, excluding renewals, was 4.5% above Midtown's pre-pandemic 5-year quarterly average and was the second highest quarterly leasing total since Q4 of 2019. During the third quarter, we executed 12 leases covering 288,554 square feet of space at a weighted average starting rent of $82.76 per square foot and for a weighted average lease term of 12.5 years. I would say the advantage of our -- and you can see that from the average rent per square foot that we lease in San Francisco that because of the quality of our assets, we get a fair share and we get pretty good pricing in the market. That's not to say we don't have large tenants looking at the pace of 1301 because we do, but we're starting to see the small and midsized tenants start to contribute to total leasing activity, specifically here in New York. I mean I don't know if you heard, I did address a portion of that question in the beginning of the call and the lease rate was cut again because of some of the activity and the big deal that we got done, which happens to de-risk the future role, which was the Credit Agricole block that comes due in February 2023 versus the existing vacant block of Barclays, and so, had that deal got done on the vacant block, you would not have seen necessarily the cut or as significant a cut in the leased occupancy percentage."
}