{
    "symbol": "PRMW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 16:34:03",
    "content": " In 2022, we delivered normalized FX-neutral revenue growth of 16%, adjusted EBITDA growth of 11%, increased adjusted EBITDA margin by 70 basis points to 19%, sales of approximately 1 million water dispenser the Razor in our Razor Razorblade model and increase return of funds to shareholders through the higher dividend and the opportunistic share repurchase program partially funded by the sale of two properties in California. Normalized revenue excluding the impact of foreign exchange grew by a healthy 14% driven by resilient consumer demand, increased dispenser sell through solid volume growth Water Direct and Exchange strong revenue growth and Water Refill and Filtration, consistent growth of our premium water brand Mountain Valley, execution of our M&A tuck-in acquisition strategy and consistent customer retention. Adjusted EBITDA in the fourth quarter increased 9% to $107 million, supported by higher volume, increased pricing, and effective expense management that offset the impact of inflation. Our Water Direct and Exchange business continued to experience strong top line momentum during the quarter with 13% revenue growth through pricing actions, volume growth and improved customer satisfaction enabled by increased delivery frequencies. Increased customer growth from these events will ramp up through the year as we build out the program across more and more of the U.S. Now, Water Refill and Filtration business continues to accelerate its growth with an increase in revenue of 14% in the quarter as a result of price increases on outdoor machines, improved machine uptime, and improved service levels in water filtration. As we shared last month at the ICR Conference, for the full year 2023 we expect revenue to increase to between $2.3 billion and $2.35 billion with normalized revenue growth in the range of 6% to 8%. We expect full-year 2023 adjusted EBITDA to be between $450 million and $470 million. Our 2022 results of $2.215 billion in revenue, $420 million of adjusted EBITDA and 70 basis points of adjusted EBITDA margin enhancement confirm our strategy is working and we are on track to deliver our 2023 and long-term outlook. Turning to our Q1 and full-year outlook, we expect consolidated revenue from continuing operations for the first quarter to be between $520 million and $540 million and that our first quarter adjusted EBITDA will be in the range of $90 million to $95 million. We expect full-year 2023 adjusted EBITDA to be between $450 million and $470 million. Yes, we had, we began to close the gap in 2022 and you saw - we saw - we enjoyed good numbers from Europe in '22, particularly in Q4 where we had adjusted for FX something on the order of 50% increase in adjusted EBITDA with FX, it was 33% and 20% revenue growth. So, North America volume was up 5% organic volume growth which is a continuation of both price and the elasticity of our business and the volume growth, which says that more customers consuming more water both from customers we sign up as a result of dispenser sell-through but also from the benefit of programs like Costco and other tactics we execute on growing the Water Direct customer base. Our in-market tactics are working and they're driving the revenue growth that we expect that's embedded in our growth algorithm for 2023, which is in the range of 6% to 8% and obviously that would contemplate some softness in dispensers."
}