{
    "symbol": "SQNS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 07:44:41",
    "content": " All statements other than present and historical facts and conditions contained in this call, including any statements regarding future results of operations and financial positions, business strategy and plans, including financing alternatives for our 5G business, expectations for Massive IoT and portable router sales, the impact of the COVID-19 on our supply chain and on customer demand, the impact of component shortages and manufacturing capacity, our ability to convert our pipeline to revenue, and our objectives for future operations, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. First quarter revenue grew by more than 12% year-over-year and, when adjusted to exclude the $1.1 million of the Verizon Jetpack contribution, from the first quarter 2021, revenue grew by 23.7% year-over-year. The main revenue growth driver was our LTE-M/NB-IoT business with our Monarch products family, which grew more than 24% sequentially and 125% year-over-year, driven by design wins moving into mass production. Typically, we see seasonality in our first quarter product revenue, and that was the case with all our product categories this quarter except for our LTE-M/NB-IoT category that helped to compensate for such effect and allow us to deliver over 12% sequential growth in terms of total number of units in all categories shipped in the quarter. As I stated in my opening comments, the LTE-M/NB-IoT category once again delivered strong revenue growth both sequentially and year-over-year, reflecting the layering in of a number of new design wins that moved into the mass production and shipment phase in the quarter. The growth in Cat M/NB offsets the contraction in the Cat 1 category, related to lower module sales to an eHealth customer, which saw shipments spike last year in the first quarter related to COVID and the build-up of inventory levels by another customer in 2021, that affected the sequential growth in Q1 2022. Our revenue for the first quarter was $13.9 million, an increase of 12.7% versus Q1 2021 and slightly up compared to $13.8 million in Q4 2021. The net loss in the first quarter of last year was $11.4 million or $0.33 per diluted ADS, which also included non-cash charges totaling $5.2 million on revaluation of the embedded derivatives and non-cash interest expense. On a non-IFRS basis, our net loss for Q1 was $1.8 million, or $0.04 per diluted ADS, again an improvement compared to a non-IFRS net loss of $3.5 million, or $0.09 per diluted ADS, in the fourth quarter, and a non-IFRS net loss of $5.1 million, or $0.15 per diluted ADS, in the first quarter of last year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. If we stay with the original guidance, let's say like this, obviously, we're expecting services to go down we have a peak in the services related to some revenue recognition in the year and because we closed Renesas license at the end of the year, this was impacting Q1 mainly and a little bit of Q2 and this will go back to more normal in Q3, Q4, which is what we used to see last year if you want to see."
}