{
    "symbol": "LRN",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-24 19:19:04",
    "content": " Revenue for the quarter was $458.4 million, an increase of 12% from the same period last year. For the third quarter of fiscal year 2023, we are forecasting revenue in the range of $445 million to $465 million Adjusted operating income between $70 million and $80 million and capital expenditures between $16 million and $19 million. But I think as you see, our guidance suggests that we think we're going to end strong even though we did get the benefit in this quarter, in the back half of the year, we do expect to be very strong. And if you think about across 30 different states and 70 different programs, we're talking about 6,000 extra enrollments from last quarter spread across that -- across any different classroom size, you're not really talking about a real significant number. And I think -- so the short answer is, yes, it continues and I think it's going to continue for some foreseeable future, because I think the career offerings specifically for high school students and for many middle school students, it's so much more compelling because you get all of that general education high school with an extra layer of career education on top. And I think if you look at, Iâ\u0080\u0099d say, largely the growth in career education, even it's -- we've said this before, we look at it sort of right now in the aggregate because we think it's all sort of - one, we see 90% plus of the funnel for career education is actually generated originally from -- for career education is generated originally from general education. And I think I indicated previously in previous quarters that, it looks like this is a year we're turning that around and we're seeing that. I think we're seeing -- if you look sequentially, Q1 to Q2 to Q3 to Q4, historically over the past several years, sequentially we gain strength in revenue per enrollment through the year. So I think that's where you sort of get the full year percentage since there's going to be some dilution, if you will, in Q4 probably in the full year comp in percentage terms."
}