{
    "symbol": "HHC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 19:24:09",
    "content": " MPC land sales revenue rose 46%, operating asset NOI increased 15% and revenues at the Seaport increased 166%, all compared to the second quarter of 2021. We sold 2 residential superpad sites during the quarter, representing 48 acres for an implied price per acre of $1.1 million, a 33% increase from the prior year. In Bridgeland, land sales increased 136% compared to the prior year, fueled by a 78% increase in residential acres sold, as well as a 35% increase in price per acre at $576,000. Overall, the Seaport's revenue increased to $27 million, a 166% increase over the same period last year, improving the net operating loss to $3.7 million for the quarter. The majority of this increase was seen in our multifamily assets, which produced quarterly NOI of $12 million, representing a strong 60% increase versus the prior year. In the second quarter, the Ballpark generated $5 million of NOI, representing a 74% increase from the prior year. And now turning to Ward Village in Hawaii, we generated $21 million in condo sales during the quarter, including the closing of 19 units for $17 million at A'ali'i, which completed construction late last year. In summary, during the second quarter, we reported net income of $21.6 million or $0.42 per diluted share compared to net income of $4.8 million or $0.09 per diluted share during the prior year period. Our MPCs generated land sales revenue of $85 million, a 46% increase over the second quarter of 2021 and $71 million of EBT, a 2% increase compared to the prior year period despite a $22 million reduction in equity earnings from the Summit in Summerlin. Despite this operating loss, quarterly revenue of $27 million rose 166% over the prior year period. Since the announcement of our transformation plan in the fourth quarter of 2019, we have sold 15 noncore assets generating $578 million in net proceeds, which have been redeployed back into our core MPCs to fund new developments and repurchase stock at prices far below net asset value. We'll look at the cash in hand, which we ended our quarter with $573 million of unrestricted, we'll look at our development commitments which we have $232 million of remaining development costs, we'll look at our debt, where we have 79% of our debt not due until 2026 or later, we'll look at our -- at the price of our stock that we believe is still very attractive relative to intrinsic value and then we decide which one of these areas or other on our business will have the highest risk-adjusted return, and we deploy capital to those opportunities."
}