{
    "symbol": "HHC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 17:00:11",
    "content": " Together with a 17-acre commercial land sale and a near doubling of builder price participation revenue, Bridgeland's EBT grew to $15.9 million, a 72% increase versus last year. Overall, Seaport revenue increased to $32 million in the quarter, reflecting a 57% increase over the same period last year. In the third quarter, our operating asset segment delivered $61 million of net operating income, which was a $2 million or 3% decline from the same period last year. These assets generated $3 million in the prior year's quarter, excluding these divested assets, NOI was up $1 million or 2% year-over-year. The largest increase in our portfolio was seen in our multifamily assets, which produced quarterly NOI of $12 million, representing a 27% increase versus the prior year. Starting with Houston, we completed 3 projects during the quarter, the largest of which was Starling at Bridgeland, a 358-year multifamily development in Bridgeland Central, we welcomed our first residents in mid-September and experienced solid initial lease-up with the complex already 16% leased as of quarter end. At Ward Village, we call some 404 condo units, resulting in $123.3 million of condo profit at a 30% margin and continue the strong pace of presales for our projects in development. At the end of the third quarter, the remaining equity contribution needed to fund our development projects was $322 million before anticipated new financings for Wingspan in Bridgeland and the Columbia medical office building, which we expect will close later this year or early in 2023. Now to get to the example, using One Lakes Edge, one of our multifamily projects in the Woodlands, one in such has a 42% cash-on-cash return, which is calculated by taking the stabilized NOI of $7.2 million, which you can find in the supplemental less the debt service of $3.3 million, which is not directly found, but we do publish the principal amount in the rate in the property level debt section of the supplemental. We all know it's a mix quarter-to-quarter if some super pads or high-end land closes, that obviously impacts, appreciate your comments that the high end -- the bulk of your home sales prices continue to go up, the low end, which I'm going to guess is more Woodland Hills is more affected. And as we think about next year, should we plan -- are we thinking about major declines in land sales because you don't like pricing or what you're hearing now from the builders is they're willing to pay the prices per acre because they really want to be in your communities, and they don't really have a lot of inventory so they sort of need to be there because that's where the buyers are. We don't need to sell that land unless there's demand there from homebuilders unless, we're getting the appropriate price per lot and price per acre, and we're not going to sell that land because we very much value maintaining the quality standards, desirability and the amenities that we think make our community special."
}