{
    "symbol": "WRAP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 21:47:06",
    "content": " In 2022, we reduced operating expenses 19% or $5 million as compared to 2021 and improved our full year net loss by 28% or $6.9 million comparatively as well. Q4 domestic sales grew 250% to $1.8 million from $500,000 in the prior year period, while international sales fell 6% to $1.8 million from $1.9 million in the prior year period. Net revenues increased 5% to $8.1 million from $7.7 million in the prior year period, marking the fourth consecutive year of sequential sales growth. Gross profit for the fourth quarter of 2022 improved significantly to a record $1.7 million or 46% of net revenue and over 140% year-over-year increase from $700,000 or 30% of net revenue in the prior year period. Looking at the full year results, gross profit increased 88% to a record $3.7 million or 46% of net revenue from $2 million or 26% of net revenue in the prior year period. SG&A expense for the fourth quarter of 2022 increased $379,000 or 9% to $4.4 million from $4.1 million in the prior year period. For the full year, SG&A decreased $3.9 million or 19% to $16.4 million from $20.3 million in the prior year period. R&D expenses in Q4 decreased $1 million or 54% to $870,000 from $1.9 million in the prior year period. Operating expenses for the fourth quarter of 2022 decreased $661,000 or 11% to $5.3 million from $6 million in the prior year period. For the full year, operating expenses decreased $5 million or 19% to $21.5 million from $26.5 million in the prior year period. For the full year of 2022, net loss improved 28% to a loss of $17.5 million or a $0.42 loss per diluted share from a loss of $24.5 million or $0.62 loss per diluted share in the prior year period. Those are the major changes between the BolaWrap 100 and BolaWrap 150, significantly upgraded device, and we've been getting terrific feedback, that is why we want to make this our baseline device for the next 5 to 10 years so that departments that are doing very large deployments, especially some of our international departments and very large U.S. cities that they can count on continuing to deploy the 150 even as we come out with new R&D products in the future."
}