{
    "symbol": "DY",
    "quarter": 1,
    "year": 2022,
    "date": "2021-05-25 15:32:07",
    "content": " Your line is now open. Your line is now open. Your line is now open. And so, I think it's just a question of working through some of the challenges, while we're doing that within the context where lots of customers are kicking off large fiber programs, and the largest of which of course is AT&T. Your line is now open. Your line is now open. I mean, if you just think about the organic growth calculation for this quarter, and then, you know Drew's guidance implied for the next quarter, we actually see the organic growth improving, but it was really -- the current quarter was really focused on two clients, one who started the year slow and the other one who clearly has pivoted spending away from a large program, and it's much more focused in the second half of the year getting or this half of the year to get ready in the second half of the year to deploy C-band. Your line is now open. I think, what it does say is that, we're going to be careful where we commit our resources, make sure that we've got returns right, and that's what you always do in a period of time where the industry looks ahead to more demand than what they currently -- than what resources are currently available. Your line is now open. You said there's not enough capacity to handle things, but the way it works with you guys as your top five customers really represent the bulk of the business, I realize collectively they're not growing, but there is a couple of reasons for that in between, but underneath the hood, things look a little better you got to parse of the data. We've got some absorption issues in our slow first half for top five customer, but we haven't been at 68% of revenue for the top five or 32% for everybody else in a very long time, and we think that's a good sign for the future. Your line is now open. Your line is now open. So, Jon, it's not an input, it's not a labor or material constraints, it is that customers made clear in a number of presentations with the advent of C-band and the focus on deploying that spectrum, the portion of the bill that was going to do more network extensions to more small cells is at a level that is lower than I think what everybody expected a year ago. What I would say is that the portion of the work that's in support of extending the network this year is currently slower that I think everybody expected a year ago, and I think in part that's because of the result -- of the C-band results. Your line is now open."
}