{
    "symbol": "MGM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 20:44:04",
    "content": " Net revenues associated with BetMGM operations were $400 million this quarter, exhibiting an approximately 90% year-over-year growth from the third quarter last year, led by the continued strength iGaming and new markets, as well as disciplined reinvestment within sports betting by the management team. And I feel even more strongly now, with market leading domestic operations driving record results, leases limited to 2% or 3% escalation for the next 10 years, embedded cashflow growth in BetMGM and MGM China, and about $11 per share in cash, I think our stock trades at pretty attractive levels. If you factor in the licensing fee and the initial expansion, we're looking at about a $2 billion to $2.2 billion investment, which given -- let's just say it takes till the end probably the spend on that is going to be between $24 million and $25 million. Thank you very much. And if you think about the nature of people saying, that's like 100 days a year that people have visitation to Las Vegas driving a huge activity case, particularly at the south end of the strip which is obviously core to that neighborhood. Thank you very much. Thank you very much. Thank you very much. But when I look at the capital structure, the combination of it and its cost with what I think is our operating leverage in these other businesses with the demand dynamics we've described and the fact that really our regional cross-property efforts are just getting started to the Cosmopolitan integration is still very early in this whole event backdrop I just think it's a fantastic opportunity for value creation. You continue to see the strength in the growth Again, we think there's been a couple of fundamental changes both in the context of the customer mix, the opportunity and the desire to want to come to a place like Las Vegas and our position with the asset changes of Mirage for Cosmopolitan and some of the other things we do."
}