{
    "symbol": "MGM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 21:28:11",
    "content": " Our consolidated second quarter net revenues were $3.3 billion, an increase of 44% compared to 2021 despite a $168 million negative impact from MGM, China due to the COVID-related limitations to visitation Bill mentioned in his remarks. Turning to BetMGM, our 50% share of BetMGM losses in the second quarter was $71 million, which is reported as a part of the unconsolidated affiliates line of our adjusted EBITDAR calculation and we expect to contribute $225 million to BetMGM this year. And I think the other thing that I add is we still have a number of initiatives in flight that would help us greatly in such a situation, and those would include of course, the cost work that we've done over the past couple of years and also the MGM Rewards program which is designed, in part to stimulate increased visitation from our regional properties in Las Vegas, visitation that I don't think we get our fair share of now. I would note that the you can probably do this math yourself, but I'll save you a step on the same-store sales -- or same -- and same-store EBITDA calculation in the six weeks that we owned the Cosmopolitan of Las Vegas during the second quarter, it generated kind of just a little bit under $60 million of EBITDAR. Well, we mentioned in our results today, we purchased $1.1 billion of shares in the second quarter, that's the -- that's our highest investments since this program restarted a little over a year ago, at the -- should surprise nobody at the most attractive price just 30 -- it's 34 and change. But it's also true that this was a part of the strategy -- our asset-light strategy to return this capital to our shareholders and fine-tune the leverage of the business and at $4 billion in the past 15 months, we -- I think more of that strategy is behind us than is still in front of us. But at the end of the day, if I said we're going to invest $1 billion in a business and ultimately reap hundreds of millions, and by the way, the build cycle is three years, you'd all say let's go."
}