{
    "symbol": "KNSA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 17:35:21",
    "content": " By the end of 2022, we have achieved $122.5 million in net revenue by activating approximately 5% of this target population on ARCALYST treatment. First, fourth quarter total revenue was $61.9 million and consisted of ARCALYST net product revenue of $39.9 million, as well as collaboration revenue of $21.9 million from our license agreement with Genentech. Full year 2022 total revenue was $220.2 million and consisted of ARCALYST product revenue of $122.5 million, as well as collaboration revenue of $97.7 million from our license agreements with Huadong Medicine and Genentech. As Ross just mentioned, we expect total 2023 ARCALYST net revenue of between $190 million and $205 million, and we ended 2022 with cash reserves of $190.6 million. And as both Ross and Mark mentioned, we expect that full year 2023 net product revenue of $190 million to $205 million, which represents greater than 50% growth year-over-year at the midpoint of that range. So we've provided guidance, which is $50 million delta, which is the same as what we provided last year, as well knowing that there were some uncertainties, of course those things that you mentioned, the prescriber continued growth and the growth in the fee prescribers, compliance and adherence rates as well. So we're delighted to have a 5% penetration into the 14,000 target populations so far, but we've got a lot more work to do to get the message out there, create awareness, create familiarity and comfortable -- physicians to be comfortable in prescribing ARCALYST when they see appropriate patients. So we work very closely with the patients to make sure both kind of economic circumstances like that that are within appropriate ways as we can and to try to support patients going onto -- going back to commercial therapy if they're provided bridge therapy and so on throughout, ensures plan changes as well. But out of all those patients that do stop, regardless whether it's at the 12 months time period or much shorter or even longer than that, we see a restarting total of 45%, which I think really eludes and speaks to what we know about the duration of the disease and how persistent this disease can be. And we put a lot of efforts into our touchpoints with patients to make sure that they're kind of helped all the way along the journey, and that they also understand the high importance of compliance and adherence to therapy driven from our data showing that continuous treatment duration results in continuous response."
}