{
    "symbol": "GTHX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 15:10:32",
    "content": " On this morning's call, the team will provide a business overview of the first quarter of 2022, including an update on our clinical programs and our commercial progress in that period with COSELA, which is approved and commercially available to decrease the incidence of chemotherapy-induced myelosuppression in adult patients was administered prior to a platinum etoposide continue regimen or a topotecan containing regimen for extensive stage small cell lung cancer or ES-SCL. We were pleased to see COSELA trial and uptake in 9 new top 100 organizations during the first quarter to bring the total number of top 100 organizations with COSELA utilization to 53% by end of Q1, and we see an overall reorder rate of around 80% in those 53 organizations. I want to first discuss some compelling real-world data that we recently presented at the National Comprehensive Cancer Network, or NCCN, conference on the benefit that COSELA provides patients and then remind listeners of our current expectations for data from our ongoing Phase II and Phase III trials of trilaciclib. The results were consistent with those from our clinical trials, showing that the use of trilaciclib prior to chemotherapy was associated with an approximately 50% reduction in patients with 1 Grade 3 or greater HAE and a 74% reduction in the percent of all cost hospitalizations up to 21 days after treatment compared to patients who received chemotherapy alone. First, we expect to release initial data, including results from mono protection and overall response rate end points from PRESERVE 1, our ongoing line extension trial of trilaciclib in first-line colorectal cancer in the first quarter of next year. Second, we expect initial data, including interim results for overall survival from PRESERVE 3, our first-line triple-negative breast cancer pivotal trial in 170 patients with PD-L1 positive and negative tumors in the second half of next year. First, regarding the divestments, as you saw in this morning's press release, after completing our evaluation of partner, partnering options and data from recent clinical trials in the highly competitive oral SERD space, G1 has made a strategic decision to discontinue the program, including all clinical and partnering efforts in order to focus our full attention on the development and commercialization of trilaciclib. We expect to provide initial results from 3 Phase II trials later this year, the TNBC combination MOA and bladder combination studies and data from our 2 ongoing pivotal trials in CRC and TNBC next year, starting with CRC data in the first quarter of 2023. Your line is open. Your line is open. Your line is open. Your line is open."
}