{
    "symbol": "LMFA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-18 17:31:03",
    "content": " Before management reviews the company's operating results for the quarter-ended September 30 2022 and the company's financial condition at September 30, 2022 we'd like to remind everyone this conference call may contain forward-looking statements. All statements other than statements of historical facts contained in this conference call, including statements regarding our future results of operations and financial position, strategy and plans and our expectations for future operations are forward-looking statements These forward-looking statements are based largely on the company's current expectations and projections about future events and trends that it believes may affect its financial condition, results of operations, strategy, short term and long term business operations and objectives and financial needs. Revenues for the three months ended September 30, 2022 totaled $180,000 compared to $224,000 for the three months ended September 30, 2021 which reflects our shift in focus to Bitcoin mining. However, because our mining activities didn't commenced till late in the quarter, our mining revenues don't have meaningful impact on the quarter's results of operations,  Operating expenses totaled $5.5 million for three months ended September 30 2022, compared to $2.4 million for the three months ended September 30, 2021. For three months ended September 30, 2022 the net loss attributed to LMF shareholders was $6.6 million, compared to $5.5 million for three months ended September 30, 2021. Turning to our balance sheet, as Bruce mentioned earlier, we ended the quarter with $10.2 million cash and $15.5 million in working capital which we believe provides sufficient liquidity to execute our current Bitcoin mining strategy. Finally, net cash used by operations was $1.7 million through the nine months ended September 30, 2022, compared to net cash provided by operations of $5.3 million through the nine months ended September 30, 2021."
}