{
    "symbol": "OPGN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 23:15:27",
    "content": " Major area of focus for us in the first quarter of 2022 was strategic R&D programs, such as our ongoing invariable UTI clinical trial here in the U.S., the 830 platform development as well as R&D related to Ares genetics, products and services. During Q1 2022 we reached an agreement with our Pan European distribution partner Menarini to significantly increase minimums for the coming to contract years, starting in April 2022 by 50% in the coming 12-months, and overall by the end of the fifth year by more than 80% compared to last contract years minimums. Since we already have an experienced team of experts in the lab infrastructure in place, we will draw on the knowledge of a team that successfully developed the Acuitas AMR gene panel for these NGS based services for Ares Genetics in the U.S. By now and look today, Ares has built a funnel of more than 60 commercial account opportunities, which have been qualified and are in various stages of the sales process. As we have recently provided commercial agreements to several potential accounts in the Northeast and Midwest and have identified additional opportunities across the U.S., these proposals which remain subject to final negotiations ranging science from smaller scale, initial test volumes of maybe 100 to 200 tests this year, at some sites relating to expected revenue in the couple of 10s of 1000s of dollars, all the way to high volume opportunities for as many as 1000 Acuitas AMR Gene Panel tests for a full year once the implementation has been completed. In closing, we're excited about our results for the first quarter of 2022 and year to date as we see plenty of growth drivers that have begun materializing here in Q1 2022 as far as 76% growth in direct sales of our molecular diagnostics products in the U.S. compared to prior year and with deals that have been signed or about to get signed here in Q2 of 2022 and beyond. And we've previously guided to sort of a range between $120 and $180, with an average selling price, probably right around $150 mark versus a distribution model where in Europe and rest of world, let's assume the end customer prices, if they're in the similar ballpark, that means the distributor will typically require a 30% to 40% distributor margin, which means you know, our transfer prices to the distributor are closer to the $100 mark."
}