{
    "symbol": "BRZE",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-13 21:50:04",
    "content": " At our recent Forge customer conference, we outlined our Start Anywhere Go Everywhere framework, in which we recognized that Braze customers exist across the full spectrum from small pre-launch startups up to the world's largest multinational enterprises and that we are committed to meeting our next generation of customers wherever they are in the transformation of their customer engagement practice, getting them up and running quickly and helping them rapidly realize high ROI. Some customers even start by simply migrating their existing email or push notification strategies into Braze, but once those early campaigns are live, rapid results build the case for further expansion and Braze is built to help teams quickly leap forward in sophistication while expanding across new channels and use cases, all while enhancing the customer experience of their products and building first party relationship assets. As a reminder, our dollar-based net retention represents a 12-month trailing statistic and sources of upsell dollars include growth to existing contracts through increases in pre-committed volumes of monthly active users and messaging entitlements and the addition of add-on features and recurring professional services as well as signing new business units as we continue to further penetrate our existing customer base through both geographic and brand expansion. And so I think we're seeing robust signs of great renewal cross-sell and upsell motions across the customer base and around the world, but the portions of upsell that are acting more like new business because they're expanding to a new team, a new set of stakeholders, maybe accessing a brand-new net new budget, those are acting more like new business, and we're seeing some of the similar effects that we referenced earlier. And I think that throughout our lifetime, it will continue to be a mix of the two with both greenfield and replacement because our vision for Braze and the customer engagement platform and attacking these problems in a customer-centric way, that's not channel siloed means that we're always going to go into an environment that is going to be heterogeneous. And for our customers, it's a commitment that wherever they are in their journey, whether they're a one person team at a prelaunch startup who is ambitious, but maybe not yet sophisticated in modern customer engagement, all the way up to fast scaling start-ups with agile and your disciplinary teams and spreading across the large enterprise where you've got big global teams spreading across functions and maybe reporting to different places, different brands and geographies. We measure that through time to first deal that they're closing and then continuing to look at the existing sales team, maybe even those that were fully ramped, but recognizing that with the macro environment shifting that buy our priorities have shifted with our product continuing to expand that the surface area that they need to understand is greater and also that we are forging into new areas of our addressable market, which means that we're engaging with new competitors that maybe they would have been unfamiliar with in the past and that the nature of those competitive dynamics certainly change along with the impacts on buyer sentiment that comes the macro. And so that's an area where we've been very excited to continue to build out the R&D teams, and we actually have our kind of new hires and our hiring budget for R&D already signed up and they'll be starting even over the next few months looking kind of further into the future than we're used to from an R&D perspective. And so when you look across the Braze customer base, what you're going to see is diversification across a lot of differences I've already spoken earlier in this call about the diversification that we have across company size, across geographies, across verticals, those -- and then also across use cases. And so I'll speak specifically to the global systems integrators in response to this question because I think -- it's been a topic over the last few quarters, and it's certainly one that we're really excited about, both for the long-term leverage that you mentioned through sales and marketing efficiency as well as through the pipeline contributions and also just the opportunity to work with a lot of brands that are -- that work with GSIs and without those relationships, those that was -- those were opportunities that we were never previously really able to access. The -- as brands have really led the way, as Braze has continued to move and penetrate deeper and deeper into our global strategic accounts and into our enterprise footprint, it's become very clear that this is the next generation that our partners should be ready to be trained for into service to their customers and to their future customers as well. So I'll first clarify that the new pricing and packaging that we're experimenting with is part of Start Anywhere, Go Everywhere didn't have a big impact in the quarter -- so it's something that we're piloting with a small set of account executives and we're excited to see that play a bigger role into next year, but you didn't see that in Q3 specifically."
}