{
    "symbol": "BRZE",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-30 23:51:04",
    "content": " These statements include but are not limited to, statements regarding our financial outlook for the first quarter ended April 30, 2023 and for our fiscal year ended January 31, 2020 and our planned product and feature development and the benefits to us and our customers therefrom, including our AI tools, our anticipated market opportunity, the potential impact of current macroeconomic trends our anticipated customer behaviors, including vendor consolidation trends and their impact on Braze, our growth plan, our vision our long-term financial targets and goals, including the anticipated period in which we may generate positive non-GAAP operating income and positive free cash flow. With Brave, customers ranging in size from small digital start-ups up to some of the world's large enterprises can cost effectively consolidate their customer engagement efforts into 1 solution, breaking down silos between channels and teams simplifying their technical architectures and improving is for customers in one particular new business win with an athletics retailer this quarter, we replaced 3 separate vendors, signing a deal across an array of channels, including e-mail, push, web and content cards. Excluding this impact, Q4 non-GAAP gross profit was $67.5 million, representing a non-GAAP gross margin of 68.4%, up 120 basis points year-over-year due to continued economies of scale in our core technology expenses and ongoing efficiencies related to our customer support functions. But I think that because we have access to a more complete picture of the customer, combined with the ability to directly interact with them and we have our vertically integrated real-time data flow and the comprehensiveness across these customer touch points and messaging channels, that puts us in a position in the technology stack with respect to the data flow and access to it in real time as well as comprehensiveness of the entire picture of the first-party data that will just allow us to have more flexibility and optionality in what we build out from an AIML perspective into the future. First, as we referenced earlier on the call, we're seeing things like messaging and data volumes and such, all hold up which I think is a pretty clear sign that, that overall activity between brands and customers communicating with each other, it's not something that is a temporary a temporary phenomenon in business or in the lives of humans. But also when we just look at the secular and generational trends that are happening right now as we continue to digitize more and more of our lives and really importantly to me is I think that we're still in the early innings of this move to first-party data, the first kind of valley of investment in first-party data, I think, has been an understandable reaction to the fall of third-party data, the -- whether it's IDFA or the death of the cookie or what have you, you see brands trying to collect first-party data sets because they're trying to replace third-party data sets for things that they were doing before. But I think that the super cycle under all this is really that move toward brands being able to take action directly on their customer relationships, being able to inform that action with the first-party data assets that they are building up and then being able to take action on it through software and strategies and team structures like customer engage -- the entire customer engagement category delivers to them. One is that we've been preparing the product for this and I think that, that's really important both in the near term for all the things you just referenced but also in the long term because as part of our start anywhere, go everywhere framework, we want to have customers have more and more places where they can get going. And I think that's where you're going to see continued pressure where that behaves just like net new business and we're -- that is going to continue to be under pressure and work against us in terms of the evolution of the dollar-based net retention, particularly for those large vendors. So when we look at things like cloud data injection, a lot of the work that's being done around data transformation, bringing currents into the fold, the expansions to the product catalog capabilities as well as I referenced earlier that there are subsets of the artificial intelligence feature set that we're building that do require being some sophistication in terms of how you train it, how it learns and how you nurture it over time which does end up bringing more data scientists into the fold."
}