{
    "symbol": "BRZE",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-13 22:35:20",
    "content": " With Stream Processing data flows immediately into the highly differentiated and customer centric portion of our Tech Stack, the classification, orchestration and personalization layers, enabling our customers to create more relevant and responsive campaigns such as preference based reminders or limited time promotions, while also enabling them to rely on Braze for mission critical product use cases that are delivered by messaging. Dollar base net retention for our large customers, those spending at least $500,000 annually was 133%, down 130 basis points compared to the first quarter of last year and down 300 basis points compared to the fourth quarter. Cash generated from operations in the quarter was $17.9 million, compared to a use of approximately $3.8 million in the year ago quarter, with the change driven by strong cash collections from customers, as evidenced by $22 million decrease in accounts receivable and $30 million increase in deferred revenue. I think that one of the great things that you have as the as a Braze customers that once we get you up and running quickly, and as you're correct, that we've been very focused on time to value over the last few years. And from a priority perspective, what we're seeing customers do is that, obviously, they want to be able to kind of defend the customer bases that they have, we're seeing an increased focus on getting higher ROI out of your acquisition investment, which means that people are trying to improve their retention rates or trying to improve the pace and the kind of -- the turning a funnel into a pipe, if you will, so that they're not acquiring and having large drop offs at each stage as customers kind of develop habits and become more committed customers over time. So what we're seeing overall, I think, amongst their marketing and their business priorities are going to be a focus toward those things that are ultimately higher ROI focused on first party audiences going through, things that are going to maximize retention, maximize lifetime value, improve the ROI of their acquisition spend. I think it's really important to center your thinking, not necessarily in how those things are split, but rather in how they get implemented, because the key thing is that whether someone starts with either marketing use cases or customer engagement use cases with Braze, the way that they actually are going to integrate Braze and get up and running is going to be the same because when they're going to integrate us into their end user interfaces, into their apps or their websites or into their data warehouses, they're then going to flow all the data that's generated through those to generate those signals in order to inform targeting or orchestration or personalization. So I think that when you look at a lot of the kind of D2C growth over the last few years, a lot of it was focused on a small number of products in a small product portfolio, many of them were working on the kind of CAC LTV arbitrage that Facebook was affording them in terms of being able to run really good retargeting through platforms like Instagram and other places. I think that Braze has been super focused over the last few on making sure that we are getting data flowing through the system, that we are investing in things like Canvas to make it more and more usable over time and enable more of our business experts, the people that are really close to the problems in the day-to-day and understand them intuitively and are kind of constantly in the flow of those things. Bill, it seems like, obviously, customers are spending more with Braze, you're seeing larger deal sizes as customers realize the importance of this customer-led growth in first party data."
}