{
    "symbol": "GPS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-26 21:51:05",
    "content": " We expect the issues at Old Navy, which we estimate are negatively impacting fiscal 2022 diluted EPS and by approximately $0.90 to $1, to largely resolve by the end of the fiscal year as we take necessary actions to right size the assortment and reengage responsive supply chain capabilities and I will address this in more detail shortly. As we shared last quarter, we expect a tough first half compares driven by moderate product delays due to supply chain disruptions last year as well as lapping the brand's disproportionate benefit from last year's stimulus. The decline was primarily driven by Old Navy, down 19% versus last year with comparable sales down 22% stemming from size and assortment imbalances all compounded by continued lateness in our inventory flows and product acceptance issues in some key categories. Excluding the transitory elevated air freight costs, merchandise margin declined approximately 280 basis points from the prior year, primarily as a result of higher discounting at Old Navy due to assortment imbalances and inflationary commodity price increases partially offset by lower discounting at Banana Republic as last year's brand relaunched and the elevated customer experience is resonating with customers. Operating margin in the first quarter was a loss of 5.7% reflecting the lower sales volumes, higher air freight expense, elevated promotional activity, primarily to Old Navy, higher inflationary costs and SG&A deleverage. We expect flat to modest year-over-year revenue growth in the second half of the year as supply delays, normalize and assortment balancing at Old Navy begins to improve, positioning total sales in the second half of fiscal 2022 relatively flat to 2019 pre-pandemic levels. Excluding the $220 million of air costs from the first half of the year, we expect gross margins for the year would be in the range of 37.9% to 38.9%, which includes inflationary cost headwinds from raw materials as well as higher discounting at Old Navy and modest incremental fuel increases compared to our prior outlook. Looking at the margin progression as we move through the year after adjusting for the elevated air freight expenses in the first half of fiscal 2022, gross margin at the midpoint of our guidance range is expected to improve nearly 150 basis points in the second half of the year relative to the first half, primarily reflecting modest improvements in promotional levels at Old Navy. Now that being said, our brands do, I think, benefit from a broad range of consumers and whether it's in the premium space with Banana and with Athleta as well as the mid-market with Gap, and Old Navy also has as many customers that earn over $100,000 as they do below 75, so because of their strong Kids and Baby business."
}