{
    "symbol": "GPS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 18:38:06",
    "content": " Old Navy delivered net sales growth of 2% over last year, showing early signs of improvement as the brand continues its efforts to right-size inventory, balance assortment, relevance and sizing across its channels. Third quarter net sales of $4.04 billion increased 2% versus last year or 3% on a constant currency basis, driven by an improvement in trend relative to the first half of the year and in part due to the timing of franchise sales. Comparable sales were up 1% on top of negative 1% comp last year and a significant sequential improvement from the negative 10% comp last quarter, primarily as our assortment rebalancing efforts at Old Navy and Gap are starting to take hold and resonating with our customers as well as the benefit of an early holiday promotional event at Old Navy in October. Old Navy comparable sales were down 1%, representing a sequential improvement from the negative 15% comp last quarter, driven by improvements in category mix and a more balanced assortment that now includes more of the product that our customers have been looking for, as preferences have shifted from cozy casual to work occasion this year. Gap brand global sales of $1.04 billion were flat versus last year, with global comparable sales up 4%, driven by improved category mix and a more balanced assortment, including more occasion-based and fast and driven categories, as well as comp growth in Asia as a result of lapping the outsized negative impact of COVID-related restrictions last year. Gross margin in the third quarter was 37.4%, deleveraging 470 basis points versus last year, inclusive of 130 basis points of deleverage related to a $53 million Yeezy Gap impairment charge. As we look to gross margin in the fourth quarter, we will lap last year's $245 million of incremental airfreight, which is expected to add approximately 540 basis points to gross margin versus last year. The 12% year-over-year growth in the third quarter includes a 13 percentage point benefit related to in-transit, as we lapped last year's supply chain challenges, 9 percentage points of growth related to pack and hold, and close to two-thirds of the remaining increase is attributable to elevated levels of slow-turning basics and the remainder seasonal products. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. It is very much consistent with what we've put out for Gap brand, which is that we have spent the last couple of years really right-sizing the business model to a more modern model for the Gap brand, closing North America specialty stores that we potentially had over-expanded back in the heyday, getting out of malls that are not as relevant anymore, pivoting to be much more digital, really focusing on ensuring that the international growth, which we think is important, it's our most global brand, is being done with other people's capital in a way that we can be in those important markets, but not be sustaining the operating losses that we were sustaining there. Your line is open."
}