{
    "symbol": "GPS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 18:21:04",
    "content": " At the end of the fiscal 2022, liable inventory for Old Navy store hit one of the lowest levels in brand's history, abate at expensive margin, which made room for newness and seasonally the right assortment that you can see these days across our fleet and online. We improved category, size and assortment balance at Old Navy, which helped drive an improvement in total company trends in the second half of the year, resulting in second half sales down 2% year-over-year, compared to down 11% in the first half. We aggressively managed costs, identifying $550 million in annualized savings with a significant majority expected to impact fiscal 2023 earnings and we further fortified our balance sheet, ending with $1.2 billion of cash, an increase of almost 40% from last year. Starting with Old Navy, sales in the fourth quarter of $2.2 billion were down 6% versus last year and down 4% relative to 2019. While Banana Republic delivered comparable sales growth of 9% and gained market share in fiscal 2022 as the brand continued to capitalize on the shift in consumer preference and its relaunch and elevated positioning of the brand last year, fourth quarter results were below our expectations. As discussed, we made progress rightsizing inventory and exceeded our goal of inventory levels below last year by the end of fiscal 2022, and primarily driven by significant improvements at Old Navy. Starting with factors impacting year-over-year comparisons, Gap China represented approximately $300 million in net sales last year, representing a two-point headwind to Gap Inc. in fiscal 2023. We expect to make progress towards getting back to pre-pandemic gross margins compared to the 35% adjusted gross margin in fiscal 2022, gross margin in fiscal 2023 is expected to be driven by approximately 200 basis points of leverage as we lap last year's elevated air freight. I think as it relates to Old Navy in the promotional environment, I think what's really important for us to recognize is a significant portion of the margin drain whether it was at Old Navy or our other banners last year was because we just had too much inventory for the demand and so the quality of that pricing and margin was really poor because we were focused on clearing it."
}