{
    "symbol": "DHR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 11:15:26",
    "content": " I mean, if you think about sort of where we ended up in the feed that gave us a lot of latitude to offset some of the FX headwinds, but I think if you think about what we're seeing in the businesses pricing is holding in very well kind of couple hundred basis points better than we did here in Q1. And so hopefully with that, and then the full year frame, right on 20% to 25% you can kind of â\u0080\u0093 it frames a little bit of what we're thinking about for sort of the back half from a margin perspective. I think barring any additional FX headwinds or something who knows what could happen out there these days, but barring anything else, barring FX or some sort of other macro event, yes, I think that's right 35% to 40% on our base business is a good way to think about margins as we head into 2023. It's just really the breadth of the FX headwinds that I think have been sort of quite â\u0080\u0093 it's quite surprising frankly, but that's what we've been seeing here in the first half\n Guys, help us understand the logistics of pricing and some of your business. We'd say for the full year, this year in view of what we've seen in the first half, high single digits is the way to think about China, which we consider to be strong growth in view of some of the macro challenges that China is facing today. So just to repeat here, Jack, for everybody 2021, $2 billion of revenue, 2022, $1 billion of COVID-related vaccine and therapeutic revenue, I think, it's fair to say that that trails off here towards the second half of the year, getting you to for that 2023 run rate that I talked about we're $500 million for the year. As we sort of think about Q3 what we are sort of hearing, we think that it's going to look a little bit more like the mix we saw Q3 of last year, which was 80% COVID only, 20% four-in-one. I mean, I think, maybe just kind of, like you said, get everybody grounded that, that low single is overall the base business we think would be mid-single digit plus and the COVID headwinds which are all testing at this point would be sort of down low- to mid-single to get to a low single overall. But I think given that we're going to grow that base business mid-single digit plus, with that sort of fall through, I still think you would see even in that low-single digit environment, I still think we drive EPS growth."
}