{
    "symbol": "BFIN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-31 13:58:09",
    "content": " We also had a higher than usual scheduled amortization in the equipment finance portfolio, particularly government because that's the fourth quarter of the government's fiscal year. And if we can do a little bit better than that, if a couple of the larger credits actually fund this quarter, then we'll get a little more meaningful growth out of the equipment finance portfolio. But our primary goal here is to put as much aboard in the fourth quarter to set up 2023 to be in the strongest possible position, and particularly so in our commercial finance side then followed by equipment finance because that sets up a higher coupon environment and a higher interest income environment for 2023. The customers that paid off their loans in third quarter, I think just on the numbers we saw in their portfolio, they enjoyed almost a 300% return on their investment, and there are still purchases in the pipeline, there's still activity in the market even with rates a little bit higher. So I think we're seeing a little bit less risk in the real estate portfolio as far as payoffs, probably a little less volatility over time in the commercial, and the equipment finance portfolio is 90%, 95% of the activity is scheduled activity. So if we look ahead into 2023, our marketing focus, our growth focus is going to be on the commercial finance, healthcare finance, government finance, lessor finance portfolios will still be active in real estate, but on a relative basis, we're going to put more emphasis on the C&I portfolio. And then the re-pricing of cash coming off of the equipment finance portfolio and of the multifamily portfolio even with a reduced amount of prepays, Paul told next year we have approximately a little over $700 million in assets repricing next year. We're assuming that equipment finance trends stay in place, and there's a greater â\u0080\u0093 there's a continued interest in equipment finance going forward because it's economically efficient from a cash perspective as opposed to paying cash for it, and that's usually good for us."
}