{
    "symbol": "BFIN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 17:03:05",
    "content": " And based on the pipeline, based on the activity we're seeing, based on the results in April, we are still working towards our $40 million a quarter, which would put us slightly over $1.2 billion by the year end. Just, the paydowns that you've seen in the last couple of quarters, kind of, in that 200 kind of in the $200 million to $300 million range, based on kind of your commentary about how the rates are changing and how that's impacting it and what you've seen so far in April. Can you just talk, whether you do it Morgan or Paul, just a little bit on how you're thinking about what your outlook is on rates and kind of how you're thinking the benefit to the margin just from outside of what you just highlighted as far as your pickup you're going to get on is the volume growth. And with each additional rate hike coming up with the asset sensitivity that we currently have, we expect to increase net interest margin by at least $1 million, probably closer to $1.5 million with each additional rate hike because now we're redeploying some of that excess liquidity that we had in the first quarter into loans. But going forward, we're thinking it will normalize somewhere around $10 million a quarter range, give or take, at least for the next couple of quarters. We would expect -- for example, if there's 50 basis points today, we're going to pick up $2 million in interest income immediately. And just the other one was, as far as the expense outlook, just with your -- if volume does pick up like you think it does, I mean in your kind of thought about where the expenses are, does that include that incentive comp pickup, or should we be adding to that $10 million kind of range for the expenses as you…\n Right now, that includes a reasonable range of incentive comp results based on what we think the growth is going to be. So -- but if you put it all together, we would hope to be somewhere in the 80s to 90s range on a run rate to start 2023, but that is -- that requires us to perform in second quarter, perform in third quarter, consistent with what we're saying and then have a good run rate going into the fourth quarter."
}