{
    "symbol": "ANIP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 11:23:06",
    "content": " First, on quarterly performance, we delivered net revenues of $64.5 million in the first quarter of 2022, an increase of 18% year-over-year. Net revenues for the generic pharmaceutical products were $49.1 million during the three months ended March 31, 2022, an increase of $16.1 million or 49% from $33 million in the prior year period. Contract manufacturing revenues were $2.9 million during the three months ended March 31, 2022, an increase of 13% compared to the $2.6 million for the prior year period, due to an increase in the volume of orders, including $1.1 million of Novitium contract manufacturing revenues. Royalty and other revenues were $2.7 million during the three months ended March 31, 2022, a decrease of $8.7 million from $11.4 million for the prior year period, due to the aforementioned final royalty payment under the Kite Pharma license agreement for Yescarta that was recognized during the three months ended March 31, 2021. Net revenues of rare disease pharmaceutical products consist entirely of sales of Cortrophin Gel, and totaled $1.3 million during the three months ended March 31, 2022. Operating expenses increased by 63% to $83.7 million for the three months ended March 31, 2022, up from $51.5 million in the prior year period. Cost of sales, excluding depreciation and amortization, increased by $14.3 million to $34.3 million in the first quarter of 2022, compared to $20.0 million in the prior year period, primarily as a result of increased volumes, including $9.5 million of costs related to sales of Novitium products. Research and development expenses increased to $5.3 million in the first quarter of 2022, from $3 million, an increase of 78% primarily due to the addition of Novitium cost tempered by a decrease in expenses associated with the completion of our Cortrophin development efforts. On a total company basis, for the projected 12 months ended December 31, 2022, we currently anticipate net revenue between $295 million and $315 million, representing approximately 36% to 46% growth as compared to the $216.1 million recognized in 2021. And we are also seeing that in the revenue, like, we indicated revenues of $1.3 million for the first quarter, and I highlighted during my prepared comments that in April and May, we clearly have seen an increase in the sales, and that trajectory, and that's part of the data that we looked at as we give our full-year guidance."
}