{
    "symbol": "BG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 12:00:03",
    "content": " Adjusted core segment EBIT came in above last year's results, largely driven by strong performance across all regions in Refined and Specialty Oils. Yes, I think, Adam, as we look forward and kind of back to my comments, we do expect to -- we didn't get all of the $250 million bought last year that we kind of laid out in our strategic plan. Thank you very much. But I would add, Ben, that our call down next year right now is principally outside the U.S. And I think we feel very good about the S&D in the U.S. And then relative back to the -- our strategic financial plan, we knew RSO, the whole Refined and Specialty Oils business was going to over perform or perform very well here in the near term. Thank you very much. And that's why we already did last year a multimillion dollar improvement in our innovation and R&D facility, and we're already working with customers, putting our lipids with plant proteins and developing new and different products. Thank you very much. I would say the way we're looking at it right now, Tom, is when we look at the -- at least $11, I'd say our bias is a little bit skewed toward the first half of the year and then within the first half a little bit toward the first quarter. And obviously, where we think the biggest opportunity is going to be is in merchandising, and that's always difficult to predict the timing and the magnitude, but that could very well be realized a little lumpier or could be over the year kind of evenly. Thank you very much. Thank you very much. And I think some of the things around the IRA, everyone's trying to understand where there's leverage there for a number of things and not just around renewable green diesel, but around lower carbon opportunities because ultimately, with all of our customers in feed, food and fuel are looking for lower carbon intensity products, and we've got to find that value and drive that back to the farm gate to the producer to the farmer, the one who's ultimately going to have to make that happen with those farmer-grown crops. Yes, I would say -- I would just add on, I think two things we're looking at as well, we expect to develop in the relationship with Chevron and others is low CI feedstocks is going to be something that we think there's some opportunity down the road. And as we talk about calling at $1.5 higher than we did a year ago, because we do have more visibility with what's booked on the RSO side for feed and fuel as well as with the tight Argentine crop, the curves are reflecting that. And I think we're highly confident we'll get the remaining $300 million done this year in our current program and get a new program in place and as we move forward, we fully intend on doing a mix of both growth -- mix of all growth, M&A and our share buyback."
}