{
    "symbol": "GSHD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 22:05:03",
    "content": " I'll provide a summary of our key results in the second quarter and we'll discuss some strategic initiatives we have underway that we believe will drive continued strong revenue and earnings growth over time, as well as some high level thoughts on our longer term sustainable runway for growth. It's also important to remember that given our high rates of growth, our overall client retention is significantly muted by new business bias as retention of newer clients â\u0080\u0093 as retention of our clients greater than one year is several points higher than for new clients. Franchise launches showed strength with growth of 31% for the quarter, a strong improvement over the trend during the last nine months and against the challenging year ago comparison of 80% launch growth in the second quarter of 2021. Given the manner in which we earn franchise revenue of 20% of new business and 50% of renewals, core revenue growth will likely trend a few points lower than premium growth. For the second quarter of 2022 total written premiums, the leading indicator of our future core and ancillary revenue growth increased 42% to $566 million. The increase in compensation and benefits is being driven by increased headcount across the organization particularly in the hiring of service agents to manage our largest revenue stream renewals, corporate agents recruiting an onboarding functions to continue our growth trajectory and systems developers to ensure our technologies on the cutting edge for our clients and internal users. So kind of looking forward to next year again and going forward past that, we feel like we can continue to manage our core revenue, a little bit growth, a little bit higher than our expense growth and with the plans to kind of gradually step up margins over the next several years. And then I guess a bigger picture margin question, again a quarter ago with normal commissions we were thinking we could maybe do a 20% margin this year, but then the prepared remarks you said you were hoping to do mid-20s over the next few years, which is kind of what you guys were doing when you IPOed. So it's one of those things that'll affect us this year, but it will not â\u0080\u0093 there is no sort of structural decline which is why if you look at our premium guidance, we actually firm that notched it upward a little bit, because the â\u0080\u0093 sort of the core, the base of the business, we continue to be really optimistic about, but we don't set insurance premiums, the carriers do. So hopefully that changes as the carriers become more profitable, we can negotiate more kind of guaranteed growth based contingencies, but really we're focused on what we can and that's growing our core revenue with the hopes that over time we can start to negotiate some better plans as profitability changes. And then thinking about the growth profile of the business, if the corporate agents they flatten out from here, that's driving roughly half your revenue, the new business commissions, the agency fees, the renewal commissions spring from that. So if we assume that you flatten out this year, maybe you grow in next year, but much lower than we were growing before, does that imply then that the growth in the franchise count, which I think if I looked historically, it's called the past three years has been anywhere from 35% to 45%, right."
}