{
    "symbol": "GSHD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 20:33:04",
    "content": " What's most exciting to me and what bodes so well for our future growth is that January, 2023 new business productivity for first year corporate agents was up 77% from January, 2022. We're focusing on increasing productivity across both distribution networks, improving our recruiting function to drive strong and sustainable growth of total producers across corporate and franchise distribution, continuing to invest in our service function to protect our client base and support our growing renewal book, expanding our digital marketing efforts to drive more cross selling and other referral business and improving our technology platform to support our core business and expanding distribution through partnerships. Until then, we will continue to optimize for productivity and selectively hire experienced sales professionals to bolster the team, but under no circumstance will we substitute quantity for quality, although we intentionally reduced our agent count by 37% in 2022, our total new business premium for corporate increased 11% in Q4. These franchises that launched this year are six times the new business production on average of new franchises, and importantly, they will be well positioned to quickly scale their own operations as many of these new owners previously managed teams of producers and corporate. Yes, Paul, I would expect probably similar seasonality, because when you think about what a franchisee begins to add to revenue when they onboard somebody, and theyâ\u0080\u0099re very heavy new business bias as opposed to having anything in their renewal book, weâ\u0080\u0099re only getting 20% of that. You might not see the growth rate in operating agencies as high as you would have historically, but thatâ\u0080\u0099s because weâ\u0080\u0099re funneling those resources into the agencies that are producing a disproportionate amount of our new business growth, so that we can work with more scale individual franchises and maximize the total producer count, not necessarily the total operating agents account."
}