{
    "symbol": "RUSHA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 15:46:11",
    "content": " Not only did we achieve record high quarterly profits, we also completed the conversion of our previously acquired Summit locations to our SAB businesses, acquiring additional 30% of Rush Truck Centers Canada Limited, repurchased $38.4 million of company stock and declared a cash dividend of $0.21 per common share or a 10.5% increase in our dividend and our fifth increase since 2018. Our Class 4 through 7 new truck sales reached 2,815 units in the second quarter, accounting for 5.1% of the US Class 4 through 7 market and 1.3% of the Canada Class 5 through 7 market. But I can tell you that all -- everything in the industry aligns if you go back and look at what like 1.5 years or people projected 1.5 years ago for 2024, and understanding what's going on -- we went through a decade between 2010 and 2020 where we didn't have any governmental influence, okay? But because taking and not being able to meet demand, I think we somewhat -- we're going to go down in 2024, no question, but it's not going to go to 170, maybe it's 210, 215. We get a soft R, a middle R, not a big R. There'll be some effect, but I don't think it's just going to look bad given these other things that I've talked about is what we've -- is what could be expected. So while it may slow our growth rate down and I'm not here to say guarantee 100% that if we had a pretty strong recession, I wouldn't have -- I wouldn't take a few hits because that's just natural in this business. We'll be in a whole lot better shape given that diversity of customer base across many market segments not -- it's focused -- because you have to remember back in what 2017 or so, we figured that we were what 15% tied to sale or something right oil and gas . I do expect that to -- but it's still higher than we -- it got so high unlike I have never seen in my entire 40 years in this business okay, 40-plus years cash amount  in this business, never seen it like it peak to that kind of, but there was such strong demand out there, but it got really high. And that's just a guess, because we are building more new trucks not building as many as we probably could given demand, but we are building more, so you've got to expect it to what 5%, 7%, 8%, 10% more, I'm hoping. Look I mean, we are buying trucks more than you sold them two years ago, you know things are crazy and that's kind of stuff that was going on late last like -- given the back half of last year, and into the first quarter of this year."
}