{
    "symbol": "RAIN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 21:04:08",
    "content": " As Rain continues to drive forward with our late stage clinical program milademetan or mila, our oral small molecule inhibitor of the MDM2 p53 complex, we'd like to approach today's call by providing context around our goal of demonstrating how p53 reactivation through mila's disruption of the complex could potentially be transformative in treating a broad range of cancer patients. Bob will provide additional color on the p53 reactivation story along with insights from the recent publication in the Journal of Clinical Oncology, before Richard discusses how those data support the novel dose regimen of milademetan, which is optimized to reduce toxicities associated with MDM2 p53 inhibition. Moving on to the MANTRA-2 basket study, we continue to enroll patients with MDM2 amplified p53 wild type solid tumors and plan to expand to additional sites worldwide with the goal of targeting full enrollment of approximately 65 patients across a range of solid tumors. We provided an update on the last quarter's call with the latest data cut-off date of October 26th, 2022, and at that time we reported two unconfirmed partial responses and two near-PRs, using the same three out of 14-day dosing schedule in this study, safety was consistent with what was reported in a prior Phase 1 study, with no new safety signals being observed. The MANTRA-2 study was designed with melanoma monotherapy across all solid tumors, exhibiting a certain degree of MDM2 amplification, and if the data support meaningful confirmed responses across a range of cancers, we would intend to pursue a discussion with the FDA to better understand the requirements for a tumor agnostic registrational filing. With multiple clinical strategies for milademetan underway and in planning, we are excited by all the emerging and potential new clinical data and the associated potential commercialization opportunities and benefits for patients, while providing a potentially best in class MDM2 inhibitor for patients across multiple tumor types. Non-cash stock-based compensation expenses included in R&D expenses were approximately $1million and $3.8 million in the three months and year end of December 31, 2022 respectively as compared to $1.1 million and $2.5 million in the same period in 2021 respectively. Non-cash stock-based compensation expense included in G&A expenses were approximately $0.3 million and $1.1 million for the three months and year ended December 31, 2022 respectively as compared to $0.2 million and $0.6 million were the same periods in 2021 respectively. Total non-cash stock-based compensation expenses for approximately $1.3 million and $4.9 million for the three months and year end of December 31, 2022 respectively, as compared to $1.3 million and $3.1 million for the same periods in 2021 respectively. We also anticipate the start of the Phase 1/2 Basket study, the MANTRA-4 study in patients with p53 wild type advanced solid tumors that have CD, that have lost CDKN2A gene function around middle of the year."
}