{
    "symbol": "RAIN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 20:11:09",
    "content": " First and foremost, our Phase III trial, the MANTRA study, for mila in patients with liposarcoma, has progressed well, and we can now offer guidance on completion of enrollment and refine the availability of top line pivotal Phase III data from the MANTRA study. Based on our related guidance for the pivotal MANTRA study and our existing cash balance, we believe there is ample cushion between the availability of pivotal data and our cash runway, which takes us into the first half of 2024, avoiding the need for additional equity financing ahead of Phase III data. Second, our Phase II tumor-agnostic MANTRA-2 study is also proceeding according to plan, and we continue to anticipate an interim data readout on approximately the first 10 patients in the fourth quarter of this year. This includes the Phase II MANTRA-3 study in Merkel cell carcinoma, evaluating polyomavirus positive patients who are resistant or refractory to checkpoint inhibitor therapy and a Phase I/II MANTRA-4 study evaluating the combination of milademetan with a checkpoint inhibitor, Roche’s atezolizumab in a basket study of patients with p53 wild-type advanced solid tumors that exhibit loss of the gene CDKN2A. We continue to anticipate that based on the progress of our ongoing studies, there will be an ample cash runway beyond our Phase III data for the MANTRA study, and we anticipate to be able to complete all 4 studies within the articulated cash runway into the first half of 2024. In the prior 107-patient clinical trial at milademetan in which 53 patients with DDLPS were enrolled using various doses and schedules, the data previously presented demonstrated that those with the lowest median PFS rates were in the 30 patients receiving milademetan daily for either 21 or 28 days of a 28-day cycle. This study, the MANTRA-4 study will evaluate the combination of milademetan and Roche’s Tecentriq or atezolizumab, in a Phase I/II study, in approximately 30 patients with wild-type p53 advanced solid tumors that also exhibit loss of the CDKN2A gene. In particular, for our Phase III MANTRA study, we highlighted rapid enrollment in liposarcoma and top line data anticipated in the first half of 2023, earlier than previously guided."
}