{
    "symbol": "TCRT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 14:10:05",
    "content": " This patient received standard Cy/Flu lymphodepletion prior to an infusion at the first dose level of 9 billion TCR-T cells, which were produced by our employees using Sleeping Beauty at our in-house cGMP manufacturing facility. Now before turning over to Abhi for a manufacturing update and details on the product characteristics of the TCR-T cells for the first two patients, I will summarize why we are so encouraged by the early clinical data. The ability of our TCR-T cells to be a living drug and survive in great concentration is quite encouraging in -- for the prospects of a durable response And most importantly, evidence of efficacy was observed in both patients with tumor infiltration, suggesting that our Sleeping Beauty manufactured T cells can survive in the hostile tumor microenvironment. Additionally, these data also provide proof of concept that we can successfully manufacture TCR-T cells for both KRAS and TP53 mutations as sufficient doses at our in-house cGMP manufacturing facility. As we saw in our initial data set where all patients had a response to one of the mutations expressed by their cancer, hunTR may also be suitable for personalized TCR-T cell therapies for most solid tumors. Our team has made significant progress across our business this year, focusing on our novel Sleeping Beauty TCR-T -cell platform targeting solid tumors and the team is poised for continued clinical progress treating more patients and generating additional valuable translational data. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And so what we are excited about with the two new TCRs coming in with the move from fresh to cryopreserved product, we believe that we will be able to produce cells even earlier in a patientâ\u0080\u0099s journey, which will allow us to, we believe, treat more patients and I can tell you that the excitement, we have a lot of inbound inquiries, people coming from different geographies, people responding to the  our presentation of that that of the case studies mentioned at CRADA  and NCI."
}