{
    "symbol": "SBUX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-03 20:21:06",
    "content": " And by engaging deeply with our customers over 50 years, we've amassed a treasure trove of assets, both physical and digital, just 1 example being the nearly 27 million active Starbucks Rewards members in the U.S. We're activating these unique brand assets as a catalyst to accelerate the future of Starbucks as a global brand and as a business. Q2 consolidated operating margin contracted 300 basis points from the prior year to 13%, primarily due to inflation, which increased over the course of the quarter, significant investments in store partner wages and benefits and reduced traffic in China. Underpinning the enduring demand is our continued focus on digital customer engagement with Starbucks Rewards members delivering 54% of the revenue in our U.S. company-operated stores, the highest level of engagement on record, up 2 percentage points from the prior year. North America's operating margin was 17.2% in Q2, contracting 260 basis points from the prior year due to inflation, investments in labor, including enhanced store partner wages and new partner training as well as the lapping of prior year government subsidies. Operating margins for the International segment was 13.1% in Q2, down 600 basis points from the prior year, mainly driven by strategic and partner investments lapping higher prior year COVID relief, including government subsidies as well as higher product and distribution costs from sales mix shift, partially offset by sales leverage across the P&L. We've got significant investments that we're making around the Mastrena machines, around the Merrychef ovens, around handheld order points for drive-thru and also the investments we're going to make on the cold beverage station to increase the capacity of the cold beverage work area for our partners going forward, which will help improve productivity as well. And as we progress through the quarter in Q2 and as COVID eased, staffing levels normalized, hours of operation began normalizing as well and all channels were open, productivity became coming back into the stores, and that was signified by the strong performance from a comp perspective that we saw in the quarter to deliver a 12% comp as well as see the increase of attach of food at record levels, signifies that our partners are doing heroic work to meet the demand of the customers and what they're seeing in their stores."
}