{
    "symbol": "SBUX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-01 20:47:02",
    "content": " Starbucks delivered global revenue of $8.1 billion in the first quarter, up 19% from the prior year, setting a Q1 record, primarily driven by the exceptional holiday performance in the U.S., coupled with strong results from our global portfolio with remarkable breadth and depth despite continued mobility disruptions to our China operations impacted by the country's zero-COVID policy. Q1 consolidated operating margin contracted 30 basis points from the prior year to 15.1% due primarily to significant investments in store partner wages and benefits as well as inflation, partially offset by sales leverage and pricing in North America. North America’s operating margin was 18.8% in Q1, up 10 basis points from the prior year as sales leverage, pricing, sourcing savings and the benefit of the North America trade area transformation were largely offset by investments in store partner wages, high inflation as well as increased spend on new partner training, onboarding and support costs to address labor market conditions. Excluding a 3% decline attributable to lapping the prior year VAT benefit, the segment’s comparable store sales were flat as reoccurring COVID resurgences severely hindered mobility and impacted our business in China, where the majority of stores were operating under elevated safety protocols and reduced store hours even as we exited the quarter. Operating margin for the International segment was 18.3% in Q1, down 170 basis points from the prior year, mainly driven by investments in store partner wages and benefits and strategic initiatives as well as higher profit and distribution costs from a sales mix shift, partially offset by sales leverage. The segment operating margin was 43.9% in Q1, down 480 basis points from the prior year as our North American coffee partnership joint venture income declined due to supply chain constraints and inflationary pressures as well as business mix shifts. In closing, the three key points summarizing my prepared remarks are: first, Q1 demonstrated our strong revenue growth and the resilience of our brand while also highlighting margin pressures, which we are addressing through purposeful actions; second, given the evolving macro and operating environment, we are revising our margin and EPS outlook for fiscal 2022 while reaffirming strong top line growth; and finally, we remain committed to our long-term growth model. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Hi, thank you very much. Please proceed with your question. Please proceed with your question. Hi, thank you very much."
}