{
    "symbol": "SBUX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-03 22:16:17",
    "content": " In Q4, Starbucks grew global revenues 11% over prior year to a quarterly record of $8.4 billion driven by 7% comp growth globally and 11% comp growth in North America. In the U.S. alone, we grew our unique customers 9% year-over-year, and our U.S. customers are engaging more deeply with the Starbucks brand as evidenced by a 16% increase in U.S. Starbucks Rewards membership year-over-year to nearly 29 million members, up 5% over Q3. Customer demand for customized, handcrafted Starbucks cold beverages is so strong that, today, cold coffee beverages account for 76% of total beverage sales in our U.S. company-operated stores. In North America overall, the combination of customer shifts towards premium hot and cold beverages, increased customization, strategic decisions around beverage, food and modifier pricing and an 18% increase in food sales drove net revenues up 15% year-over-year to a record $6.1 billion. Starbucks is the number one share in global ready-to-drink coffee, and continued growth in our Global Coffee Alliance with Nestle combined to deliver strong performance in Q4, with revenues increasing 18% on a constant currency basis to $484 million. Our strong quarter, comparable sales of 11% and revenue growth of 15% were largely driven by a record-breaking fall launch, coupled with continued strategic pricing actions and increased food attach as well as the shift to more premium beverages and a growing demand for personalization in both company-operated as well as licensed businesses. In Q4, more than 60% of beverage units sold in the U.S. company-operated business were customized, contributing to the $1 billion and growing annual net sales for modifiers, representing growth of 2x since the first fiscal 2019. Importantly, we finished the year with nearly 25% of our U.S. license portfolio live with Starbucks Connect, allowing us to create a seamless digital experience across our stores, giving customers more ways to connect with our brands, furthering the value of the rewards experience. Q4 consolidated operating margin contracted 380 basis points from the prior year to 15.1%, primarily driven by investments in growth in labor, including enhanced store partner wages and new partner training, part of which were investments under our reinvention plan. For full year fiscal 2022, our consolidated revenue reached a record $32.3 billion, up 13% from the prior year or 15% when excluding a 2% impact of foreign currency translation driven by 8% comparable store growth, 6% net-new store growth and strength in our global licensed store businesses. North America delivered revenue of $6.1 billion in Q4, up 15% from the prior year and another all-time record, primarily driven by an 11% increase in comparable store sales, inclusive of a 10% increase in average ticket as well as net-new store growth of 3% over the past 12 months. Importantly, the volume of beverage and food items sold per store has well-exceeded pre-pandemic levels, and the number of unique customers, again, reached an all-time high in Q4, up 9% over the prior year and up more than 1% versus prior quarter, underscoring our brand's expanding reach and relevance and customer loyalty. North America's operating margin was 19% in Q4, contracting 270 basis points from the prior year, primarily due to investments in growth in labor, including enhanced store partner wages and new partner training as well as inflationary headwinds, partially offset by pricing and sales leverage. With this powerful combination of global comp and store growth, coupled with our Channel Development performance, we expect our consolidated revenue growth to reach the range of 10% to 12% in fiscal year 2023 despite an approximately three percentage point unfavorable impact expected from foreign currency translation."
}