{
    "symbol": "AXS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 12:26:04",
    "content": " For the year, we grew our specialty insurance gross written premiums by 15%, net earned premiums by 18% and underwriting income by 46%, and produced an all-in combined ratio of 89.6%, improving both our loss and expense ratios. In the end of our of our addressable non-property-related renewals, we estimate a 90% retention ratio, 12.5% rate increases and 7% new business with more than half of the new business coming from targeted credit and surety, cyber and A&H lines. The consolidated acquisition cost ratio was 20.6% in the quarter, an increase of 0.2 points over the prior year and this was driven by an increase in the reinsurance segment, largely offset by a decrease in the insurance segment. Reinsurance segment's gross premiums written increased by $40 million or 16%, compared to the prior year quarter. Additionally, we reviewed our loss cost trend assumptions and given the current inflationary environment, we increased the year-to-date loss ratios in our motor liability and professional lines of business, and this impacted the quarter by over one point. For a better view on the ongoing run rate of our reinsurance business, I would look at the full year loss ratio for the business, ex-property and cat, which is 67.3%, essentially flat from 2021. The acquisition cost ratio increased by 1.2 points, primarily related to changes in business mix, driven by our exit from catastrophe and property lines of business and adjustments attributable to loss-sensitive features, driven by improved loss performance, mainly in the credit surety business. In the quarter, investment income from fixed maturities was $105 million, up over 57% from $67 million in the fourth quarter last year, as the yield on the portfolio has increased 160 basis points from 1.9% to 3.5% over the last 12 months. Within our insurance book the average rate increases was nearly 6% for the quarter and close to 9% for the year, marking 21 straight quarters of positive rate change and bringing the cumulative rate change for our insurance book to almost 60% since the beginning of 2018. Looking at rate by underwriting division AXIS wholesale which is a key area of investment for AXIS generated increases of more than 8% in the quarter and 7% in the yea, these results were fueled by a resurgence of pricing across property and select casualty lines. Across our reinsurance book, pricing was up more than 12% with most lines of business seeing positive rate momentum. So, we are still seeing a little bit of rate over trend in the insurance segment but it did slowdown in the second half of the year and the predominant reason was I think those three lines of business really had good experience in the quarter."
}