{
    "symbol": "IR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 14:50:05",
    "content": " It is also important to note that on a two-year stack, the ITS segment organic orders grew more than 50%, which is higher rates than the Q1, 2022, two-year stack of approximately 40%, meaning that thus far we continue to see accelerated demand for our products. And as we look through the other eight that we have in the LOI, I would say similar to what we have been doing over the past kind of 12 to 18 months, which kind of bolt-on tuck-in in nature, great returns, good growing companies, elevating the portfolio of the company and one that we see can be highly â\u0080\u0093 highly strategic for us to continue accelerating the growth. Your line is open. And as we get closer to the 40s for the second half, and that's going to be driven, primarily through a better pricing realization that we already have action, as well as some kind of continued movement in terms of the merger-related productivity savings, that -- so think about it it's already actions, that you could call it that we have so to speak in the back or already action. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I think on the contrary, I will say that because of current energy prices being so high and the fact that our technology allowed us to drive this energy efficiency and improvements, we're seeing customers making the acceleration of let's just get it done here now because they see energy prices to be high for the longer or kind of medium to longer period of time of perspective. Your line is open. I wanted to ask on the M&A contribution to growth based on the deals this quarter and then based on what you have under LIO, when you think about the framework of the 4% to 5% annual target and given kind of what's in motion right now what kind of a contribution you think that's setting up for next year. So we actually see that whether you want to look at the in-year impact of revenue, the annualized impact of what we expect to be able to purchase this year all of us -- all of those lead to the 400 to 500 basis points whichever way you want to look at it, which is actually setting us up nicely here, if I'd say, the M&A impact to revenue as we go into 2023. And the last piece, I'll say Joe is that our team in the Asia-Pacific, the ITS team has been incredibly agile in terms of being able to take the technology that we have in our kind of pilot of old technologies compares well as vacuums and really move pretty quickly to create applications to those areas where they're seeing kind of the good areas of growth momentum."
}