{
    "symbol": "CLVT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 14:28:08",
    "content": " First quarter revenue reached $662 million, an increase of $234 million compared to the same period last year, driven primarily by inorganic growth from the ProQuest acquisition as well as 4.4% organic growth, which was slightly better than the 4% indication we provided in March. Adjusted EBITDA for the quarter was $262 million, an increase of nearly $100 million compared to Q1 of 2021 for a profit margin that approached 40% and represented 140 basis points of margin expansion over the same period in the prior year. First, organic growth of 4.4% added $19 million to the top line and $11 million to the bottom line for a profit conversion of 58%. As you can see from the table on the lower left of the page, the organic growth rate is in line with the 2021 full year growth rate has improved pricing in our subscription and reoccurring business and early traction in cross-selling were offset by continued softness in transactional sales. It's worth noting that renewal rates were in line with last year as retention improvements for smaller customers stemming from our investment in the inside sales force were offset by the adverse effect of suspending our operations in Russia, which restrained the growth rate expansion by nearly 40 basis points. Second, inorganic growth contributed $228 million to the top line and $69 million to the bottom line for a profit conversion of 30% before the impact of cost synergies. Adjusted free cash, flow which excludes the impact of onetime costs was $191 million in the first quarter, an increase of $28 million over the same period last year. First, organic growth is expected to accelerate by 200 basis points to 6.5% and deliver approximately $120 million of revenue growth and about $70 million of profit growth for a profit conversion of more than 55%. Second, inorganic growth is expected to contribute an additional $870 million of sales and $285 million of profit growth for a profit conversion of just over 30%, as a result of the ProQuest acquisition on a pre-cost synergy basis. Slide 17 illustrates the expected seasonality of our revenues for this year, which remains relatively consistent with last year's pro forma results and is essentially unchanged with the phasing we shared in March, given the first quarter was in line with our expectations. Specifically, in the second quarter, we expect the organic growth rate to increase sequentially between 100 to 150 basis points to approximately 5.5% to 6%, delivering sales of about $700 million that could be as low as $690 million, if the dollar maintains its current momentum against other major foreign currencies. We anticipate the profit growth of nearly $400 million will be partially offset by higher interest to servicing debt used to fund the acquisitions, higher cash taxes on the profit growth and modestly higher capital requirements, as increased capital spending will be ameliorated by lower working capital needs. In the upper left of the page, you will see that with two consecutive years of organic growth in the 6% to 7% range, we will reach $3 billion of revenue, which represents a more than tripling of revenue over a five-year period. As our top line reaches that level, you can see in the upper right, we expect profit margins to expand meaningfully on the profit conversion from the organic growth and the realization of the ProQuest cost synergies, implying an increase in profit margins of more than 12% in the five-year term. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}