{
    "symbol": "MQ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 23:32:08",
    "content": " The strong first quarter reflects our continued success in diversifying and growing our business by focusing on 3 critical factors: one, fueling our customers’ success; two, broadening the ways we support our customers; and three, increasing our global platform’s resiliency, reliability and scalability. Across Europe, we have a growing number of customers that use the Marqeta platform to launch in other countries quickly, including the U.S. Payhawk, Bulgaria’s first startup to achieve unicorn status, has been live in our platform for the past 2 years. Capital on Tap, which provides a small business credit card and spend management platform to over 100,000 small businesses in the UK, recently used Marqeta’s platform to launch their product in the U.S. As a result, Upgrade has launched 4 reward card programs, broadening its total addressable market to cover a larger target audience, from millennials looking for crypto rewards to savers looking for cash back. Our solution allows our customers to implement risk rules based on a cardholder’s spending history, making it a strong fit for verticals like expense management. However, it did grow double digits in Q1, accelerating 2 points from last quarter due to two factors: the rise of the Omicron variant lifted volume in January in both the U.S. and Canada; and one of our large customers is successfully expanding into drug stores, retail and grocery driving a meaningful step-up in growth versus last quarter. The last thing I would say about this, as I kind of mentioned in my remarks, is as we diversify to more and more customers, there are a lot of newer verticals where we’re just starting and customers who are relatively new and so are really ramping quickly and have explosive growth. It grows based on current verticals we’re in, current customers, adopting new products that we’re building for existing products to sort of scale their business and grow their addressable market. We have a long-term vision here that’s been playing out really well over the years and really looking to enter the new verticals, new products and a lot more to announce here in the coming quarters. And then you get the – outside of the top 20, then you have a very large number of customers serving all kinds of different verticals that are in very much hyper growth stage, which is what’s exciting."
}