{
    "symbol": "FERG",
    "quarter": 2,
    "year": 2023,
    "date": "2023-03-07 12:18:07",
    "content": " When you look at our residential building and remodel business, with a 12% growth rate in the quarter on top of a 21% prior year comp and then you attach that to really good activity inside of our showrooms, good open order volumes, and candidly some pretty good confidence in that high-end builder and remodeler customer-base, we feel pretty good about where that is and the support mechanism for it. As you know, we delivered a 10.3% operating margin last year, we are expecting some compression in that largely driven on the gross margin side of the business, but we had also indicated there could be some SG&A deleveraging as we went through the year given market volume declines, and given some inflationary cost pressures that we would face. As discussed earlier in the call today, we talked about what that typical knock-on construction of commercial activity looks like after residential build-out and that's not really what we're seeing as much of, it is those large mega projects. But what's really exciting about that is really in line with your question, we're seeing the activity much earlier, because we are by our strategy getting closer to the engineering community closer to the ownership group, closer to the general contractor, to make sure that we're involved in making sure that the supply chain is reliable and that we've got the right products regardless of customer group from underground infrastructure, through commercial mechanical, through fire and fabrication and on through our industrial product sets, so that we can make sure that the project is built appropriately and properly, together with the professional doing the install. And on the waterworks side specifically, for me, it's really a story of balance and that planned balance that we started to architect years and years ago, where we would have a balanced business mix between residential subdivision, residential multifamily, construction up through public works, infrastructure, commercial activity, and municipal spend. On finished goods, when you think about what you're selling through residential trade or the e-commerce business, I'm assuming that the price has been much more steady as we look at -- through last year sort of upwards and I think you mentioned there might be some price increases even into this calendar year. If you look at just the business mix that we have, about 18% of our business is in new residential construction that activity level again has seen a bit of pressure on the RMI side, particularly the high-end RMI side of residential, we're seeing good activity levels, no abnormal price competition. In terms of valuation, look I think coming off over the last two years that we've had from a market perspective, we've talked about in the past that sometimes there's a valuation mismatch on sellers wanting a peak multiple, on top of peak profits and so that's something that we're very disciplined about that we're looking at potential deals, but that has not slowed us down from finding good quality deals to continue to consolidate our markets. It is a very good organic growth engine for us as we think about north of call it 20% growth rates inside of that business in the quarter with good two year stack, particularly as we've always talked about that business allows us to continue the relationships that we make on commercial new construction and continue that through the life-cycle of the building and we're seeing good growth in both multifamily renovation, hospitality renovation, and overall MRO. I mean, I can't really give you a guide within the guide, so to speak, on that 9.3% to 9.9% operating margin to my point earlier, we're sitting at a 9.8% through the first half of the year and pleased with that delivery and we believe we'll land in the range that we've provided. Yes, short-term pressure on the new construction residential side, but as we look at that repair, maintenance, and improvement side of the world and specifically what's happening as the residential trade plumbing contractor and the residential HVAC repair, replace contractor are coming together in that dual trade environment and what our ability is to service that contractor in what we think is a very large $90 billion-plus overall market."
}