{
    "symbol": "DCGO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 21:14:07",
    "content": " The year-over-year revenue growth was driven mainly by the contribution of revenue from continued expansion of major corporate accounts due and expanded municipal mobile health contracts, and the expansion of key customer relationships on the medical transportation side, such as Northwell. Mobile health revenue for the second quarter of 2022 amounted to 87.3 million as compared to 33.2 million in Q2 of â\u0080\u009921, up approximately 163%. Excluding mass COVID testing revenues from both quarters, mobile health revenues amounted to 59.3 million up from 23.2 million last, an increase of 156%. Mobile health revenue amounted to 80% of total revenue during Q2 this year, which is 53% in the prior year with transportation as the remainder. Total gross margin percentage during Q2 â\u0080\u009822 amounted to 35.9% as compared to 34% in the same period of â\u0080\u009821, it is important to note that on a consolidated basis, DocGo was able to drive year-over-year gross margin improvements, despite the negative impacts of inflation on the cost of labor and other cost of sales items. This mobile health gross margin improvement was driven by a combination of factors, including lower lab fees and a continued shift away from higher price subcontractor labor, which represented a much lower percentage of mobile health revenues this quarter versus last year second quarter. COVID related testing and revenue declined to 28 million during the second quarter of â\u0080\u009822 as compared to 38 million in the first quarter, excluding COVID testing revenues from both Q1 and Q2 of this year, mobile health revenue increased by 13% to 59.3 million in the second quarter of â\u0080\u009822, up from approximately 52 million in the first quarter. Adjusted EBITDA amounted at 12.3 million in the second quarter of 2022, approximately 11.2% of revenue, basically in line with the first quarterâ\u0080\u0099s EBITDA margin of the 11.5% and above the annual guidance of 9.3% given at the beginning of the year. In the six months ended June 30, â\u0080\u009822, total revenue amounted 227 million, representing growth of 104% over the total revenue of 112 million last year. We talk about 30% to 36% growth, but if that's if you take the number of 319 from last year compared to the guidance that we provided this year, the realities are that 319 number from last year has about 40 million, 50 million of COVID testing. So it's 30%, 35% if you look at it from end of last year, but in reality that number's closer to 50%, 60% if you remove last year's second half portion of the COVID testing, which we do not see as a major contributor this year. So in terms of the COVID testing reduction, there's no real impact on gross margin because everything we price on mobile health, that includes COVID testing, and this is mass testing, not consumer, we price it about the same margin between 50 and â\u0080\u0093 50% to 53%."
}