{
    "symbol": "RSG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 23:15:32",
    "content": " During the second quarter, we delivered revenue growth of 21%, generated adjusted earnings per share of $1.32, which is a 21% increase over the prior year and produce more than $1.1 billion of adjusted free cash flow on a year to date basis, which is a 14% increase over the prior year. Second quarter environmental solutions revenue increased $260 million from the prior year, which primarily relates to the acquisition of US Ecology. With respect to our outlook, our guidance implies sequential growth and adjusted EBITDA dollars of 5% to 5.5% in the second half of the year compared to our first half performance. So again, when you take a look at what we're doing with the inflationary environment that we're experiencing today, and we're seeing that across our book, and we're able to drive underlying margin expansion this year, as we start to get those relatively higher price increases next year, we think that actually sets us up very well for continued margin expansion into 2023. When you think about that 1.5% to 2% on a like-for-like basis, that's relatively consistent what would we see in a normal year. So when you take a look at the 17.1% for the environmental solutions business, that's -- again, I would say there wasn't much that that we were able to affect in that period of time, it's only two months. So, we expect that with the -- the 5%, that we just reported here in the second quarter, we would expect, as we talked about that to accelerate in the second half of the year for the reasons we discussed, so we expect to stay over 5% for the balance of the year. So, as we're talking about 5% yield, as you think about the sequential improvement from the CPI-linked contracts, we think to the second half of the year, that's probably about a 20 basis point increase or so in yield second half versus our second quarter performance, within a further step up, probably somewhere in that kind of mid fives as we sit there and look at 2023  today. So, as we move into a CPI range of 3%, let's say, in a multi year basis, which was consistent with prior cycles, how different is the business setup today in terms of streamline operations, routing, costs, like how different is this business today with for a CPI 3%, 3.5%, long term compared to where we were in prior cycles? And then as we look forward to 2023, again, assuming that things stay relatively stable on the open market portion of our business, that's where we think of average yield right now in kind of that mid 5%."
}