{
    "symbol": "WING",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 16:58:04",
    "content": " In the second quarter, company-owned restaurant sales totaled $18.7 million up about 3% primarily due to six net new restaurants versus the prior year comparable period, as we continue to invest in building out Manhattan. Cost of sales as a percentage of company-owned restaurant sales, increased by 1.8 percentage points compared to the prior year, driven by increases in labor and other operating expenses inclusive of preopening expenses totaling one percentage point, which were partially offset by lower food costs driven by a 19% reduction in the cost of bone and wings, as we began to see deflation progress through the second quarter. So, I think when you couple that with what we saw in our market tests with the chicken sandwich and how that mixed as well as just the elevated level of advertising that we're able to spend in the back half of the year up over 35%. But my comments that I shared around willing to invest some of that deflation, if it's called for it, if we saw further deterioration in consumer sentiment and we needed to lean in a little bit and do something that â\u0080\u0093 we're just now piloting for the first time as an example is another bundle that again is still at a nice food cost but includes our premier product, the Classic Wing with boneless and with tenders in a triple mill deal is an example of where we can lean in and present the consumer with value and we're able to do that and not have to take price, which is the key differentiation. And so what we're seeing in 2022 is a much more balanced cadence of development, which is great for our brand partners because they're getting restaurants opened earlier, making a return on their investment sooner and then it's good for us as we're getting those operating weeks in the year and the royalties on those. And we shared this â\u0080\u0093 for international â\u0080\u0093 we shared this earlier I think in the last call, where we do expect this to be a record development year for our international business, which I really think speaks to the excitement and momentum we have around that the strategy, the proven playbook, the markets we're in how we're showing up and how that's going to become a bigger part of our growth story as we look into the outer years. And again as we think about mapping our way through the back half of the year and delivering on our outlook of low single-digit same-store sales growth, we think a lot of that's just going to be transaction growth. And then, as we take a step back and kind of what we thought about, as we planned the launch of the chicken sandwich was, we've heard over the years the concept of a veto vote, where you've got a group and not everybody wants wings and what we think -- we believe we saw in some of the consumer feedback during our market test was this chicken sandwich really helped us solve that veto vote. So I think time will tell, but I think at a minimum we're in a position to where we feel confident when we consider the opportunity we have to grab a new customer base on the Uber platform combined with the other levers that we're pulling in the back half of the year to be confident in reiterating our low single-digit same-store sales guidance for the year."
}