{
    "symbol": "WING",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 15:55:04",
    "content": " And if those levels we see a path to food costs in a low 30%, which I know you're familiar with our story and the unit economics, John, that's really compelling when you think about what that can do for our brand partners returns. That said, we we're confident in our ability to deliver on our target of low single-digit, same-store sales growth, particularly something we're proud about, particularly when you think about the challenging macro environment that we're in and doing that in a way that's really fueled by transaction growth. Yes, well in a little bit earlier in that we've kind of seen the chicken sandwich sales that we're seeing be highly incremental, we're really seeing a combination of two things here, David, one is bringing in a lot of new guests, which we're really excited about. And we've talked about this in the past, David, where we've often with our wing focused offering, I've had to navigate that Veto vote literally believe offering a chicken sandwich, which is a pretty universal occasion for just about anyone that's really good to have an opportunity to address some of those issues we've seen in the past, in the past, and again provides us a lot of confidence, not just for this quarter, but that this is something we're going to be able to build on as we progress through the balance of 2022 and in 2023. But then in addition to that, I think what we demonstrated in the third quarter is the opportunity we have around just bringing in new guests, whether that's closing the gap on brand awareness, whether it's capturing these chicken sandwich occasions, or even the addition of an additional delivery service provider such as Uber Eats, that's allowing us to access a consumer base that we weren't previously offering Wingstop to. But can you remind us just contractually when the next 50 or 100 basis points raise to national ad fund contribution is up for grabs, to go to 5.5% to 6% of sales, and your level of confidence following like we mentioned few weeks ago that that  increase that contribution to continue to fuel the advertising trends you're seeing. And continue to close the gap on the opportunity we have in front of us around brand awareness when we compare ourselves to other more mature national brands and the thing that's going to continue to fuel that fund and fuel growth is really going to come in the form of system sales growth, which is growing not only from same-store sales growth, but our unit expansion as well. So, trying to better understand the implication for lower than expected 4Q and so you provide the restaurant margin guidance is encouraging and kind of curious as the 4Q guidance some hefty deterioration in underlying three year same-store sales trends for 3Q to 4Q, recognizing that you're going over that 5% price increase from a year-ago, or perhaps a higher tax rate in 4Q than 3Q, just love some help kind of as we see through the mechanics. And I really just think that that highlights the efficient labor model that we deploy, you can run a Wingstop at our average unit volume of 1.6 million, with as few as three to four team members in there and the overall roster is clearly much smaller than what a lot of other brands have to operate within their assets, and so I think that helps us navigate and feel less of an impact from any sort of staffing issues out there, if there are any that, that continue to persist. And something that we're really excited about, and we think is pretty unique in this environment, and gives us confidence to come out and reiterate our low single-digit target for this year, and deliver on 19 consecutive year of same-store sales growth. We continue to expand around that Southeast Asia region, in addition to the success we're seeing in Europe, particularly in the U.K., where we're 25 restaurants strong on pace for a record development year, and even with some of the challenging macro environment that the U.K. consumer is having to navigate our business there continues to demonstrate strong sales. A few weeks, and it's probably hard to get much of a read, particularly when you think about the frequency we just referenced with three times, three times a quarter being the average, but we do see it as an opportunity to capture more occasions and inherently in capturing more occasions, you're going to impact frequency. I think it's an interesting question, but one that we really haven't seen the need to push very hard on in that we're $1.6 million AUVs today in a box that anywhere from 1,300 square feet to 1,700 square feet in line with the majority of our business off-premise. And I think, as I mentioned earlier, it really speaks to the stickiness of the digital growth that we've seen in our business over the last couple of years is something that we're excited to continue to build on in advance from here."
}