{
    "symbol": "TVE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-02 15:23:13",
    "content": " At this time for opening remarks, I'd like to turn the floor over to Ms. Tammy Wilson, TVA Vice President, Treasurer and Chief Risk Officer. Today I have with me TVA's Chief Executive Officer, Jeff Lyash; and TVA's Chief Financial and Strategy Officer, John Thomas. Today's discussion may include forward-looking statements that are subject to various risks and uncertainty, so please refer to our report that's Form 10-Q for the quarter ended June 30 of 2022 and TVA's annual report that's Form 10-K for the fiscal year ended September 30 of 2021. And with that, I will now turn the call over to TVA's President and Chief Executive Officer, Jeff Lyash. TVA works with 153 local power companies to deliver a reliable, low cost and sustainable energy supply every single day for the residents, businesses and industries in the Tennessee Valley region. In the first three quarters, partner credits returned to our customers totaled over $141 million. In fact, it was our employees that ensured TVA has been able to meet recent power demand challenges this summer. During the two week period in June, TVA had six days with energy demand above 30,000 megawatts, including the highest recorded June power demand of 31,161 megawatts. Put that in perspective, TVA had only recorded six total days above 30,000 megawatts in June prior to this year. Throughout this period of historic demand TVA's power system remained stable, reliable, and resilient. Keeping upwards of 30,000 megawatts flowing day after day is not an easy task, even for a system as large and diverse as TVA's. Add to that our commitment to keep power rates low, and it's quite a balancing act. TVA has more than 250 individual generating units, and one of the nation's largest transmission systems. As the nation grapples with rising energy costs, TVA is cleaner more diverse power supply is also helping to keep the price of power lower for our customers. This is not only carbon free, but stable power, which is helping to keep TVA's rates low. TVA operates the nation's third largest nuclear fleet, which meets approximately 40% of the energy needs of TVA's service territory. TVA was proud to be presented a Nuclear Energy Institute Top Innovative Practice Award in June for our demonstrated commitment to safety, cost savings, and individual leadership. They also completed more than 26,000 work activities, including replacement of 88 of Unit 2's 193 fuel assemblies, and installing enhancements to help the unit continue safe, reliable operation for years to come. Watts Bar Unit 2 is now helping us meet summer demand on another 18-month fuel cycle of providing reliable and affordable carbon free power generation 24 hours a day, seven days a week. As noted in our sustainability report, TVA is among the industry leaders in cleaner energy and decreasing carbon emissions, the numbers provide the proof. TVA has slashed carbon emissions by 57% through 2021 from 2005 levels, while maintaining residential power rates, lower than 80% of other utilities. In 2021, TVA announced our aspiration to achieve net zero carbon emissions by 2050. As we build the energy system of the future, carbon free energy sources are an integral part of meeting our sustainability goals, while continuing to provide the low cost, reliable power that our customers expect and that they deserve. To that end, and consistent with our assets strategy TVA recently announced a request for proposal or an RFP for up to 5,000 megawatts of carbon-free energy projects with commercial operations dates through 2029. The RFP welcomes a broad range of generation sources including nuclear, green gas, solar, storage, and wind, either located in the TVA service territory or delivered to TVA's interface with neighboring transmission systems. This RFP allows us to better assess what is currently available in the market, what may be on the horizon, and how these resources can help meet our carbon reduction efforts for 2030 and beyond. It's important to note that in addition to adding contracted resources, TVA is continuing to make investments in the power system to ensure we maintain a low cost reliable and sustainable power supply. In fact, I want to mention that TVA recently completed the - Boone Dam restoration project, on time and on budget. As I mentioned, TVA is executing a defined strategy toward establishing a carbon-free energy future and part of that strategy is to be a national leader in developing cost effective technology. TVA continues to actively support the development of emerging technologies, including energy storage, electric vehicle evolution, decarbonization, connected communities, regional grid transformation and advanced nuclear solutions. You've seen us announced several partnerships recently to help advance cleaner energy, especially new nuclear. We're exploring a variety of new technologies that - would contribute to TVA and national decarbonization objectives without adversely affecting generation reliability, or unreasonably raising energy costs for our Tennessee Valley customers. The new nuclear program coordinates TVA's collaborative efforts with other utilities government agencies, research institutions and or other organizations on advanced nuclear technologies. I'm pleased to announce the TVA has taken another step on that road and signed a two-party agreement with GE-Hitachi, which will support our planning and preliminary licensing for the potential deployment of an SMR at the Clinch River site. TVA is planning process includes several decision gates and if any of the metrics lead us to believe continuation of the program isn't practicable, we could cease design and licensing activities. TVA's business model is based on generating the revenue needed to manage our system, while keeping our power rates low, and providing reliable and sustainable power which creates an attractive business environment. TVA and our partners in economic development work together to help create or retain more than 57,000 jobs, and to attract over $9.6 billion in capital investments to our region so far this fiscal year. But overall, our effective power rate still stays on trend, in line with - saw almost a decade ago so very happy for long, sustained performance and the benefit of this diverse fleet that we have I'll talk more about that later. If you look at the impact overall on rate, you can see again, TVA holding base rates flat, we continue to do that and then our overall effective rate at about 11% higher. And as everybody's aware, natural gas prices are significantly higher, 90% higher than they were a year ago. When you're looking at these 90% to over 100%, we'll include coal increases in fuel prices, the fact that our overall effective rate is only up about 11% is a tribute to one, the diversity of this fleet that you see with 39% of our electricity coming from nuclear. And then the benefit of the hydro system we have, the layer on top of that the fact that we have hedging programs, to fix the price for our natural gas and for our coal, that we help mitigate a significant portion of this price volatility for our customers. You do see that nuclear is down slightly, that's really just attributed to nuclear the re-fuelling outages and the fact that we had the steam generator replacement, so we had 85 more nuclear re-fuelling outage days this year than we did last year, but the fleet continues to perform very well. So then, in terms of the income statement, I've talked about the revenue, you can see driven significantly by the fuel cost recovery, and then the fuel and purchase power expense in line with that overall operating and maintenance expense at $163 million higher than the previous year. You can see $33 million lower interest expense and then overall net income at $476 million, $433 million less than prior period, driven largely by the increase in O&M and depreciation and amortization. And so our operating cash flow at just over $1.8 billion for the nine months, that is down approximately $400 million from the prior period, really driven by three factors. And then a little bit associated with the cash gap, just the timing between the increasing fuel prices and when we pay for fuel versus when we recover the cost of revenue so three factors really driving that $400 million overall investing activity at just approaching $2 billion. Please go ahead with your question. When we put together the 20 year long-term partnership proposal, one of the beliefs as a part of that was that - this in the low 20 range of TFO for TVA was, was a good healthy level. And so, I would expect that over the next decade, as we invest further in the transition of the fleet that our debt will go up slightly, not significantly, but it will kind of level out where we are today and then begin to increase slightly as we add new assets. Please go ahead with your question. So - if I make the assumption that the process proceeds and the six Board members are confirmed, sometime before the end of the congressional session that will result in a full TVA Board with all nine members by the end of the year. So three years ago, TVA communicated to our customers that our objective was to hold base rates flat for a decade. When it comes to fuel price as John and I talked about earlier, almost 60% of our generation, wind, solar, hydro, nuclear really has zero or very low and stable fuel prices. As John said, the doubling of natural gas and coal has resulted in about an 11% increase in our base plus fuel costs, and we're working hard to minimize that impact on folks. And that's going to take investment in our existing assets, which we're executing on a good example is the Watts Bar Unit 2 steam generator project, which not only extends the life of those plants, but add it over 20 megawatts of additional zero carbon generation investing in our hydro fleet to preserve it extend it and get more out of it. And so all of these things are in flight and a great example of a step here for us is this 5,000 megawatt clean energy RFP where we're looking for any source of zero carbon energy that can factor into our 2030 carbon goal - and accelerate our progress there. Reliable, so people can count on it resilient, so that our customers can be confident when faced with a challenge, expected or unexpected, we'll recover well, and then ever more clean, lower carbon. Please go ahead with your question. Hi, we have been seeing announcements from all over the TVA service region by local power companies saying their rates are increasing due to TVA's natural gas investment and fuel costs adjustment. Well, let me start out TVA's rates haven't increased at all, because of our ongoing investment in modernizing the gas fleet. And as I mentioned, the diversity of TVA fuel of our generation fleet in fact, produces best decile fuel cost performance for our customers when compared to the industry. And we're continuing to head down that path with the industry's largest ever clean energy RFP, in order to be able to go farther faster. And even as we do that, we're developing technologies with others, such as low carbon fuels and carbon capture that in the long-term can take that natural gas bridge and reduce its carbon emissions. In closing, let me just reiterate how proud I am of TVA employees for their tireless work that's allowed us to meet record power demand this summer. They keep the power flowing across our 16,000 mile transmission system for the 10 million people that rely on us every day, especially when it matters the most."
}