{
    "symbol": "JBSS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-04-29 17:39:09",
    "content": " Net sales for the third quarter of fiscal 2022 increased 5.1% to $218.6 million, compared to net sales of $207.9 million for the third quarter of fiscal 2021. The increase in net sales was attributable to an 8.1% increase in the weighted average sales price per pound and was offset in part by a 2.8% decrease in sales volume, which is defined as pounds sold to customers. Sales volume decreased 5.8% in the consumer distribution channel, primarily driven by a 57.1% decrease in peanut butter sales volume due to the planned downtime associated with the upgrading -- with upgrade of our peanut butter line that occurred and was completed in the third quarter and the discontinuance of our inshell peanut product line, which occurred in the fourth quarter of fiscal 2021. Looking at sales volume for our branded products and consumer channel, sales volume for Fisher recipe nuts fell 24.5%, primarily due to the later Easter holiday this year, higher at-home cooking and baking nut consumption in our prior fiscal year due to COVID-19 restrictions and reduced purchases due to the impact of higher selling prices at retail. Fisher snack nut sales volume decreased 23.5% primarily due to the discontinuance of our inshell peanut product line, which was partially offset by distribution gains of our Oven Roasted Never Fried product line at existing customers. Excluding the impact of the discontinued product line, Fisher snack nut sales volume increased 14.4% due to increased distribution and velocity of the Oven Roasted Never Fried product line. Sales volume increased 11.2% in the commercial ingredients channel, mainly due to a 19.9% increase in sales volume to foodservice customers, attributable to improved conditions in the restaurant industry from fewer COVID-19 restrictions. For the first three quarters of fiscal 2022, sales volume increased in all three of our distribution channels. Sales volume increased 2.8% in the consumer distribution channel primarily from an 8.6% increase in private brand sales volume driven by increases for trail and snack mixes and mixed nuts mainly from new distribution at existing customers. The weighted average cost per pound of raw nut and dried fruit input stock on hand at the end of the current quarter increased 52.1%, due to higher commodity acquisition costs. Turning to priorities by JBSS business channel, the consumer channel as Frank mentioned, net sales increased 2.5% in dollars and decreased 5.8% in sales volume in the third quarter of fiscal 2022. The commercial ingredient channel, distribution increased 21.2% in dollars and 11.2% in volume in the third quarter. The contract packaging channel increased, 11.5% at dollars and 3.1% in sales volume in the third quarter. Our last segment, produce nuts, increased 2% in dollar sales and was flat in pound volume sales in Q3."
}