{
    "symbol": "JBSS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-10-26 12:50:18",
    "content": " Net sales for the first quarter of fiscal 2022 increased 7.6% to $226.3 million, compared to net sales of $210.3 million for the first quarter of fiscal 2021. Increased sales volume was partially offset by a 5.6% decrease in the weighted average selling price per pound, which was caused by a decline in commodity prices for all major tree nuts except cashews. Sales volume increased in the commercial ingredients channel by 37.2%, due to a 47.8% increase in sales volume to our food service customers. Sales volume declined in the contract packaging distribution channel by 3.9%, primarily due to promotional activity by a customer in the first quarter of fiscal 2021 that did not repeat in the current first quarter. Looking at sales volume for our brands and our consumer channel, Fisher recipe nuts decreased 9.7%, primarily as a result of merchandising timing shifts, lost distribution at a customer and lapping of increased at-home cooking and baking nut consumption compared to last year's first quarter due to COVID-19. Fisher snack nuts sales volume, excluding the impact of our discontinued inshell product line, which occurred in the fourth quarter of fiscal 2021 increased 7% due to new distribution and increased merchandise in existing customers. Gross profit margin increased to 22.9% of net sales in the current quarter of fiscal 2022, from 18.7% for the first quarter of fiscal 2021. The increase in gross profit and gross profit margin was attributable primarily to lower commodity acquisition costs for all major tree nuts except cashews and increased sales volume Total operating expenses for the current first quarter increased to 10.8% of net sales from 9.7% from last year's first quarter. The total value of inventories on hand at the end of the current first quarter increased $2.2 million or 1.5%, compared to total inventory value at the end of the first quarter of fiscal 2021. The weighted average cost per pound of raw nut and dry fruit input stocks on hand at the end of the quarter increased 11.1%, compared to the first quarter of fiscal 2021."
}