{
    "symbol": "GRAB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 21:56:03",
    "content": " For the fourth quarter specifically, I'm pleased to report that on a year-on-year basis, group revenue rose over 300%, while we reduced our losses by 64% from the same period a year ago. We also saw two consecutive quarters of positive segment adjusted EBITDA margins for Deliveries, which expanded to 2% of Deliveries' GMV in the fourth quarter. I would like to start by sharing the business and operational highlights for Mobility, which recorded strong year-on-year revenue and GMV growth in the fourth quarter. For Mobility, revenues grew 78% in the fourth quarter and 40% in 2022, underpinned by the continued recovery in ride-hailing demand and our efforts to improve supply across the region. To note, if the model change had not taken place in the fourth quarter, our fourth quarter group would revenues be $434 million with full year group revenues of $1.37 billion, implying growth of 255% and 102%, respectively. Revenues from Financial Services for the fourth quarter came in at $28 million from a negative $1 million in the same period last year, and it grew 166% on a full year basis attributed to greater optimization of our incentive spend and our increased focus on lending. In Deliveries, segment adjusted EBITDA was $47 million in the fourth quarter and negative $35 million for the full year. For Financial Services, segment adjusted EBITDA was negative $93 million in the fourth quarter and improved 16% year-on-year. As a percentage of TPV, fourth quarter margins for Financial Services improved from negative 3% to negative 2% as we continue to streamline our cost base for GrabFin and to focus on driving ecosystem transactions. Group adjusted EBITDA margins in the fourth quarter improved by 454 basis points year-on-year and 94 basis points quarter-on-quarter, which sets us up on the right path towards achieving group adjusted EBITDA breakeven. We reported a fourth quarter loss of $391 million, representing a 64% improvement from a loss of $1.1 billion in the same period last year. We're leveraging GrabMaps, as Anthony was saying in his remarks, where we saw wait times fall 27% year-on-year and 12% quarter-on-quarter for food deliveries. Overall, driver earnings for transit hour, which is a really key draw for new drivers to come into the industry increased 13% year-on-year and driver retention is at 87% in the fourth quarter and 74% of our 2-wheel drivers are now doing both deliveries and mobility in the quarter. So Deliveries' GMV in the fourth quarter grew on a constant currency basis by 5% and then 22% for the full year, year-on-year. So we did trade off growth to drive a more sustainable and profitable deliveries business, as we substantially improved the EBITDA margins quarter-on-quarter plus 160 basis points and then year-on-year 550 basis points up to 2%."
}