{
    "symbol": "MDV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-25 10:39:01",
    "content": " We reported fourth quarter AFFO of $6.9 million or $0.68 per diluted share, more than double AFFO of $2.4 million or $0.27 per share reported in the fourth quarter of 2021. The $4.5 million increase in AFFO was primarily attributable to early termination fee revenue of $3.8 million related to our property in Rancho Cordova, California. AFFO per diluted share also reflects an increase in fully diluted shares outstanding from our dividend reinvestment program and the issuance of 1.3 million Class C units in our operating partnership, at $25 per unit in connection with the January 22 acquisition of a Kia auto dealership property in Carson, California. AFFO for 2021 included $1.4 million in early termination fee revenue from our property formerly leased to Dana Incorporated in Cedar Park, Texas, which we sold in July 2021. Excluding the $3.8 million early termination fee revenue for 2022, AFFO per diluted share was $1.26. Fourth quarter revenue was $14.4 million, a 63% increase over $8.8 million in the year ago quarter. For the full year, revenue increased 22% to $46.2 million compared to $37.9 million in the prior year, reflecting the growth in the companyâ\u0080\u0099s portfolio and the $2.4 million increase in early termination fee revenue I just described earlier. Excluding the increase in early termination fee revenue, 2022 annual revenue increased $5.9 million or 16% year-over-year due primarily to rental income from 16 acquisitions, partially offset by the sale of 8 non-core properties in 2022. On the expense side, fourth quarter G&A costs were $2.3 million compared with $2.2 million in the fourth quarter last year. For the full year, G&A expenses were $7.8 million, a $1.9 million decrease from $9.7 million in 2021 as a result of our exit from the crowd funding business when we listed our shares and other cost savings initiatives. Our property expenses were $2.1 million in the fourth quarter, an increase from $1.6 million in the prior year period. For the full year, property expenses were $8.9 million, an increase from $6.9 million in 2021. Annualized adjusted EBITDA for the fourth quarter was $41.2 million, an increase of $19.3 million over the prior year quarter, primarily reflecting the increase in revenue from our acquisitions and the early termination fee. Adjusted EBITDA for the full year 2022 was $31.7 million, an increase of $7.3 million from last year, reflecting the increases in revenue described above and the $1.9 million decrease in G&A expense. During 2022, we invested a total of $162.7 million in real estate properties, including an opportunistic acquisition of one retail property leased to a key auto dealership for $69.4 million, where we issued $32.8 million of equity at $25 per share and 15 industrial manufacturing properties for a total of $93.3 million. During 2022, we completed the sale of 6 office properties, 1 flex property and 1 retail property with total contract sales prices of $73 million, generating net proceeds of $48.7 million and gains on sale of $12.2 million. On December 30, 2022, we sold a retail property in San Antonio, Texas, which was leased to raising cans for a sales price of $4.3 million, representing a 5.7% exit cap rate and $669,000 gain on sale. Moving on to the balance sheet and liquidity, as of December 31, 2022, we had total cash and cash equivalents of $8.6 million and $197.5 million of outstanding indebtedness consisting of $44.5 million in mortgages and $153 million outstanding on our $400 million credit facility. The weighted average interest rate on the total debt outstanding of $197.5 million as of December 31, 2022, was 4.03% based on the 38% leverage ratio as of September 30, 2022, and December 31, 2022. As previously announced, our Board of Directors declared a multi cash dividend per common share of approximately $0.96 for the months of January, February and March 2023, representing an annualized dividend rate of $1.15 per share of common stock, which represents a yield of over 9% based on the recent price of our common stock. Please state your question. Please state your question. Please state your question. Please state your question."
}