{
    "symbol": "MDV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 21:25:07",
    "content": " Early in the second quarter, we completed one acquisition Lindsay Precast for $56 million at an 8.5% weighted average cap rate, which we outlined for you on last quarter's call. 53% of the increase in property expenses for the first six months of 2022 compared to the same period of 2021 reflects the one-time write-off of $587,000 related to the cancelled acquisition of 10 properties leased to Walgreens in the first quarter, given changes in market conditions and the failure of the mortgage servicer to approve our assumption of the related CMBS loan prior to the contract termination date of February 18, 2022. As Aaron mentioned, following the close of the quarter, we completed two industrial manufacturing acquisitions in sale and leaseback transactions with productive holdings in Valtir, LLC, which was formerly known as Trinity Highway Products, for a total purchase price of $28.7 million and a blended weighted average cap rate of 9.55%. As we reported during last quarter's call, in May we executed a five-year interest rate swap on our $150 million term loan, resulting in a fixed rate of 3.858% when our leverage ratio was less than or equal to 40%. I think the other element to it is, the stuff that we could buy, that stuff that is -- let's call it, I think our guidance underwrites a 6.25%, which we could -- we have clearly exceeded in terms of the cap rates. And so when I contrast its industrial manufacturing, but you can't back build a factory, most of these have been around for 20 plus years or greater and so they're -- and it is a function of the private equity model typically, where they're doing a sale leaseback and so it's really the -- I see a lot of manufacturing assets that we pass on. They fit my blue collar nature and, I think, they're to their assets that you may not see pretty pictures, you may not be able to -- you immediately turn off your thinking because it's got a CVS or a Walmart investment grade status, you have to look, you have to do the credit homework, which we do, but you have assets that are sort of underappreciated and we're finding cap rates that are better for them."
}