{
    "symbol": "CLFD",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-02 21:17:03",
    "content": " Consolidated net sales in the first quarter of fiscal 2023 were $86 million, a 68% increase from $51 million in the same year-ago period, and down 10% from $95 million in our fourth quarter of 2022. In addition for the trailing 12-months ended on December 31, 2022, our community broadband market net sales totaled approximately $192 million, which was up 69% from the comparable period last year. Net sales in the international market increased 412% year-over-year in the first quarter compared to the same period last year and we are up 126% year-over-year on a trailing 12-month basis due to the acquisition of Nestor Cables, which are included international sales. Gross profit in the first quarter of fiscal 2023 increased 33% to $31 million, or 35.7% of net sales from $23 million or 44.9% of net sales in the same year-ago quarter. As a percentage of net sales, operating expenses for the first quarter of fiscal 2023 was 15% down from 19% in the same year-ago period. Net income in the first quarter of fiscal 2023 increased 37% to $14.3 million from $10.4 million in the same year-ago period, and was down from $17 million in the fourth quarter of fiscal 2022. As a percentage of net sales, net income for the first quarter of fiscal 2023 was 17% down from 20% in the same year-ago period, and down from 18% in the fourth quarter of fiscal 2022. With our current visibility into our current pipeline, we are reiterating our previous staff line guidance of estimated revenue of between $380 million to $393 million, representing a 40% to 45% growth rate over fiscal year 2022. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. In terms of the - you seem to be going back, I guess, to maybe your more traditional seasonality, going back several years now where you had, I guess, a quarter in there somewhere that was up 20%, 30% sequential, something like that on a seasonal basis, that is the way we should kind of look at this in context just at a much higher revenue level, obviously. Please proceed with your question."
}