{
    "symbol": "SURG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 21:49:01",
    "content": "  Operator: Good day, and welcome to the SurgePays Incorporated Third Quarter 2022 Earnings Conference Call. After today's presentation, there will be an opportunity to ask questions  Please note, this event is being recorded. I'd now like to turn the call over to Mr. Brian Prenoveau, Investor Relations. Today's date is November 14, 2022. And on the call today from SurgePays are Brian Cox, President and Chief Executive Officer; and Tony Evers, Chief Financial Officer. Before we begin, I'd like to remind everyone that this call may contain forward-looking statements as they are defined under the Private Securities Litigation Reform Act of 1995. For a discussion of such risks and uncertainties, please see SurgePays' most recent filings with the SEC. All forward-looking statements made today reflect our current expectations only, and we undertake no obligation to update any statement to reflect the events that occur after this call. Also, during the course of today's call, the company will be discussing one or more non-GAAP financial measures. Copies of today's press release are accessible on SurgePays' Investor Relations website, ir.surgepays.com. In addition, SurgePays' Form 10-Q for the quarter ended September 30, 2022, will also be available on the SurgePays' Investor Relations website. Now I'd like to turn the call over to President and Chief Executive Officer, Brian Cox. We were tremendously busy in the third quarter of this year, and the team's hard work is translating into not just growth but growth with a strategic direction. Revenue exceeded $36 million in the third quarter, a 2.5x increase compared to last year. In the first nine months of 2022, revenue increased by 131% compared to the first nine months of last year, and it's important to note, this was during a timeframe where sales were intentionally throttled by management in order to grow without dilution. Last month, we announced that we had eclipsed 200,000 mobile broadband subscribers, our year-end target in our wireless business through the Affordable Connectivity Program, or ACP. As we discussed previously, estimates vary, but it looks like there is 50 million households that qualify for ACP. And after almost a year and a half, only 14 million households have taken advantage of ACP, which puts the adoption of this benefit at around only 28%. We believe we've only scratched the surface of the program and there's significant room for growth, which is why we're so excited about being able to do enrollments and activations over our SurgePays' software platform inside convenience stores. We will be strategic and long-term in our decision-making and business operations, especially when it comes to leveraging existing synergies to accelerate sales using our competitive advantages. 150,000 mobile broadband subscribers was my benchmark for analyzing our efficiency and purchasing our wireless equipment, our ongoing recurring margins and customer retention. While speaking with convenience store owners, they estimated 75% of their customers are actively using SNAP EBT to purchase things like energy drinks and food at their stores. Currently, almost all ACP companies, our competitors, get enrollments using pop-up tents outside and low-income neighborhoods. The weather is now changing and in most parts of the country where it's cold, things slow down. Until recently, the SurgePays' Fintech platform has taken a backseat to the intense subscriber land grab and ACP enrollments and growing SurgePhone. Jeremy has an extensive background in the telecom and fintech space and will be tasked with expanding SurgePays' Fintech revenue by increasing the number of stores on our network, the sales per store and margins per sale. In addition to adding Jeremy to the SurgePays' Fintech team, we've also inked a new master service agreement with GPO Plus, Inc. GPO Plus is a distribution company focused on independent regional retailers. Under the agreement, GPO will be considered a master agent and will be compensated for setting up stores to transact on our network. We're excited to start seeing the benefits of a 40-plus salesperson team pulling doors, bringing sales and with the impact of such a different sales pitch they have now when you can lead with enabling the store to offer ACP to their community. I'd like to look at current assets as a gauge of where we've been, where we are and where we want to be. Accounts receivable has steadily increased throughout the year from $3.2 million at the end of 2021 to $5.6 million at the end of the first quarter, and $8.3 million at the end of the second quarter and $9.5 million at the end of the third quarter with $7.5 million of cash. In the future, we will continue to balance the need for growth with the cash flow provided and the cash opportunities. I'm the company's largest shareholder, and let me tell you, I'm not eager to see my share cut. To address our cash flow needs, we're at the finish line finalizing a significant financing backed by U.S. government receivable. Revenue growth is accelerating, and we have several programs to improve margins. As Iâ\u0080\u0099ve said, we are uniquely positioned to offer these products and services to the underbanked and underserved because giant corporations have overlooked these communities for a long time. We want to gauge success by growing revenue and profit, but we also believe we can do this by providing valuable services to households and communities that desperately need them. For the quarter, we reported revenues of $36.2 million compared to $14.5 million in the third quarter of 2021, representing an increase of 149%. Of the $1.5 million loss in the third quarter, approximately $1.4 million was due to accelerated expenses at LogicsIQ related to the  ad campaign. Additionally, the third quarter of 2022 included much lower interest rate, interest expense than the prior year quarter and certain non-recurring items, including a $52,000 loss on investment in Centrecom and a $58,000 loss from amortization of debt discount. Given our strengthened financial position, higher cash balance and capital structure, our cash allocation priorities are focused on investing in the business and maintaining ample liquidity for future growth. As a company, our North Star is building a successful organization that provides access to mobile broadband and essential financial services to households and communities where they arenâ\u0080\u0099t readily accessible. We believe we are developing an ecosystem to serve this market, both at home, around their local communities and then the local stores where they shop. If we do this successfully, we will tap into a huge market with tremendous growth potential. Lastly, I greatly appreciate the support and interest of our shareholders as we continue this journey of growth. So Brian, it sounds like you really ramped up the sales potential here in the quarter. As you know, Iâ\u0080\u0099m very open about the 100% focus on the ACP program. Number one, it wasnâ\u0080\u0099t just the land grab of profitability and revenue growth for us. It was also learning the customer base, the habits and being able to analyze how to maximize and scale this growth without ever plateauing. I guess about four, five months ago, when I saw this coming, okay, we want to be able to do this through our stores. Thatâ\u0080\u0099s the big picture, long-term play is being able to provide products and financial services to folks where they shop in the corner, getting as many stores as we can on our network transacting and ultimately, thatâ\u0080\u0099s the way weâ\u0080\u0099ll never get our technology, if you will. The problem is thereâ\u0080\u0099s only one me, and running two channels was just not going to work time wise. So I called in all the favors with folks Iâ\u0080\u0099ve worked with now for 20 years in the financial services prepaid under bank market, Iâ\u0080\u0099ll be able to godfathers if you will. So itâ\u0080\u0099s going to be a huge boost for us being able to grow that without taking any focus off my plate or my teamâ\u0080\u0099s plate and being able to build â\u0080\u0093 leverage our existing infrastructure that we already have supporting these stores, but now building it from more of a concurring standpoint to go add more stores, adding sales per store and really focus on those margins per sale. So Jeremy was a great, great hire for us, and weâ\u0080\u0099re already seeing as heâ\u0080\u0099s adding folks to his team. Their primary, letâ\u0080\u0099s call it, tip of the spear growth product is â\u0080\u0093 and really cool CBD products that theyâ\u0080\u0099ve acquired. But the biggest, I think, Iâ\u0080\u0099d say, partnership with them is the fact they already have 40 people that are out there actively pulling doors. And when youâ\u0080\u0099re pulling doors, and for those of you who donâ\u0080\u0099t know, thatâ\u0080\u0099s one of the ways I got my start, so Iâ\u0080\u0099ve pulled thousands of convenience store doors. And to anybody that's taken EBT or SNAP at their store, you see the sign up front. It changes the sales pitch completely from buying my stuff to, hey, I want to help you â\u0080\u0093 help your base. We wonâ\u0080\u0099t to do that, here's what we need to engage together and now they're on our platform. Now they're able to do this, oh, by the way, that same platform enables you to do prepaid wireless top ups. I don't want to say it's premature, I'm lapping because I've given a deadline of this call, and I just watched that deadline slip up a little bit. I think keep an eye, I think it's all the last-minute acronyms and the components where the attorneys are finalizing things. And so it's just I want to be very clear, the borrowing base is using a factor of the receivable, but also using a factor of the inventory. And it's more of an installment sale financing, where we pay back the money we pulled down over nine months, it's not debt. So those of you out there who live in the balance sheet world can quickly ascertain that there's a great chance for us to leverage this to some point next year, hopefully by the middle of next year, be not only profitable but debt free. So it's a really unique tool that we've put a tremendous amount of time and energy into that we're really, really excited about. My question is, obviously, you guys have done very well and there's a lot of big opportunity. I think, the strong get stronger because we're all learning. So â\u0080\u0093 and also keep in mind too, we bought the shockwave software platform. So we're able to kind of see market trends as well, and pretty interesting data there. It's folks trying to figure out better ways to add more customers, trying to work on their margins and equipment costs. We have a completely different perspective on servicing this base â\u0080\u0093 this underserved, underbanked market. It was never my goal just to be a wireless carrier, a wireless MVNO, that's just one of the products that we use to attack the market, to penetrate the market, and then we bring in our entire suite of products. So with that said, we own the CRM ShockWave, which again, for those of you that may not know, we're integrated into the National Verifier and the National Accountability Database of the FCC. And it also integrates us into the AT&T and T-Mobile backbones, which is what we use to provide the wireless service and mobile broadband. So we're one of the â\u0080\u0093 to my knowledge, the only company that offers ACP that owns their own CRM, now stack onto that, Ed, that we own the SurgePays platform, which does payments at the store level. And I know for a fact that none of the other transaction companies out there, there's not too many of them that do the convenience store payments. So we've got a significant competitive advantage here, and I plan on maximizing it to really grow that base. And to your point about competition, I get asked that on every call, one-on-one shareholder call. I want to sprint and do things that not only these other folks may not be thinking of, but they can't do. My last question is, obviously there's been a lot of headlines about weakening macro, high inflation, and it just completely pounding the people at the bottom of the social ladder. Yes, that's a good question. And it always puts me in a unique spot because â\u0080\u0093 and I always want to be very, very clear. And right now, there's a lot of collateral damage for what's going on in the world or our country. I think most of the people on this call, whether gas is $3 or $5, it's not going to affect where we drive today. Well, that's not our base. But can we do it in a way where we could cut their cost from who they're getting the service from now, whether it's Track on Boost, MetroPCS. If our software is in that convenience store where they shop, they're getting the Internet from us through the ACP program. The store owners incentivized to talk to that customer and go ahead and bring them over to our prepaid wireless, too. That's other financial products and other prepaid products that we can offer where we can grow our revenue, yes, absolutely, but we can do so by helping folks as much as we can. Again, I do not want to offer Telehealth, but partnering with companies who do, putting those apps on our tablets, their devices or phones. And all of those folks who cannot use Telehealth because you need a credit card, but we could package it with top text data and now face time your doctor is a plan that could go pay cash at the convenience store. And as another service that we could provide these people who have been hit pretty hard, like I said at the â\u0080\u0093 with inflation and food costs and gas prices. Hello, you guys delivered some very nice top line growth. And obviously, that's going to be a part of the ecosystem for me to accomplish the goals for this company. When a lot of this was laid out, two factors there that I think that is contributable to keeping in mind there's an upfront cost to every mobile broadband subscriber we had. If you accelerate growth faster than what you had anticipated, then you're going to have more upfront expense considering that we're expensing more than we're making in the first two months. So if we had a more steady, slow growth pattern, I think you would see the expenses balanced out and a little bit more in line with what the analysts had put out there. But the fact that our sales, let's say, our sales acceleration has been so successful from a business perspective, we're high-fiving from a reporting perspective, and this is where it gets into actual real business versus reporting or what you guys look at it quarterly. It's getting us to 0.5 million subscribers as fast as possible, which is what I beat in their head on a weekly basis religiously. Again, I'm focused â\u0080\u0093 laser-focused on a couple of things. And obviously, controlling costs I mean, we're not burning money â\u0080\u0093 to do this, we're using our own cash flows to grow it. So from a reporting perspective and how that falls, I think those things will take care of themselves in the next couple of months."
}