{
    "symbol": "STER",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 13:07:07",
    "content": " Our sustained excellence in new business growth, client service and innovation drove year-over-year revenue growth of 18%, including 12% organic constant currency revenue growth even as we lapped last year's third quarter growth of 44%. Our product innovation and technology excellence continue to resonate with prospective clients, helping drive third quarter growth from new business of 9%, the eighth consecutive quarter of growth from new business above our long-term target of 7% to 8%. From the combination of new business, cross-sell/upsell and gross retention our organic revenue growth has averaged 15% since the first quarter of 2021, double our combined 7% to 8% target for those items. During the third quarter of 2022, we reported revenue of approximately $199 million, an 18% increase compared to the third quarter of 2021 with 12% organic constant currency revenue growth. As Josh described, our base growth moderated a bit earlier than expected in Q3, which drove approximately $6 million less in revenue and approximately 100 basis points less in adjusted EBITDA margin versus our expectations. For 2022, we now expect to generate revenues of $769 million to $779 million, representing a year-over-year growth of 20% to 21.5%. Adjusted EBITDA of $204 million to $210 million, representing year-over-year growth of 14% to 17% and adjusted net income of $109 million to $113 million representing year-over-year growth of 18% to 22.5%. As shown on Slide 16, our guidance includes full year organic constant currency revenue growth of 15% to 16.5%, implying low single-digit organic constant currency growth in the fourth quarter. Our margins are lower for the year from previous expectations driven by lower revenue guidance, fulfillment labor surplus to support extraordinary growth, higher inflationary costs and higher third-party verification costs in the U.S. We expect fourth quarter adjusted EBITDA margins to expand substantially, both year-over-year and on a sequential basis as we execute on the low growth playbook that Josh mentioned earlier. Obviously, the first half as we lap our stellar 38% and 29% growth rates in the first and second quarter, which were in turn lapping 80% and 44% growth rates last year will be a little bit more challenging. But we do have a very heavy Gig business in the U.K., which has actually had a pretty tough year after stellar growth last year and the headwinds from currency on the pound, Peter shared the 11% organic constant currency growth rate for our international businesses, but the impact of currency actually wipes out almost all that growth in the quarter. So those would be the 2 drivers to think about along with the fact that there's about $6 million of revenue that we didn't see because of base growth moderating sooner than we expected, and that would have had 100 basis points flow through, which would have expanded margins quarter-over-quarter, which was our commitment in our last earnings call. So as you think about Q4, we're lapping a 35% growth from last year and, as Peter shared, kind of 40-ish percent for the last 6 quarters prior to Q3. And our view is any step-backs, whether that's the low growth environment that we're anticipating and experiencing now and that if it holds going into next year where we expect to grow or if it turns to be a more recessionary environment, in either of those cases, we think that our view is to take care of the clients make sure they're served really well, make sure we use the time to expand our margins and do a lot of the work that was just hard to do the explosive growth rates we had so that we can see that significant margin expansion."
}