{
    "symbol": "STER",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 12:15:24",
    "content": " We saw a double-digit organic revenue growth in almost all of Sterling's regions and verticals, and we are particularly proud of the 10% growth we saw from new business in the quarter. The US saw particularly strong results at 46% growth, and international grew low double digits on a constant currency basis, in line with our long-term expectation, and 24% when normalized for one-time revenues in the UK during the first quarter of 2021. For 2022, we now expect to generate revenues of $770 million to $780 million, representing year-over-year growth of 20% to 21.5%, adjusted EBITDA of $210 million to $216 million, representing year-over-year growth of 17% to 20.5%, and adjusted net income of $112 million to $115 million, representing year-over-year growth of 21% to 25%. This was approximately 38% increase compared to the first quarter of 2021, including over 30% organic constant currency revenue growth, and 8% contribution from M&A, partially offset by 70 basis points drag due to foreign currency translation. Normalizing the prior-year period for this non-recurring item, internationals organic constant currency revenue growth during the first quarter of 2022 was 24%, and our total company's revenue growth was 41%. Due to our strong top-line results, first-quarter adjusted EBITDA was $47.6 million representing a 29% year-over-year increase compared to the first quarter of '21. We had adjusted net income of $24.4 million or $0.25 per diluted share in the first quarter of 2022, representing year-over-year growth and adjusted earnings per share of 47%. Adjusted EBITDA of $210 million to $216 million, representing year-over-year growth of 17% to 20.5%, and adjusted net income of $112 million to $115 million representing year-over-year growth of 21% to 25%. Over the next 3 to 5 years, we are targeting an annual organic revenue growth rate of 9% to 11% with adjusted even of margins, ultimately expanding to 29% to 32% or more over that period, as well as annual adjusted net income growth of 15% to 20% per year. And then if you translate that to the overall growth rate, right, our headline is 38% but if you adjust it that one-time revenue 1Q of '21 of $3.5 million, you're 41% revenue growth for the quarter."
}