{
    "symbol": "STER",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 15:57:09",
    "content": " In particular, our continued focus on new client wins, resulted in $57 million or 9% revenue growth in 2022, marking the fourth consecutive year at or above our long-term 7% to 8% target. The organic revenue increase included growth from new clients of approximately $57 million or 9% and growth from existing clients of approximately 4%, including base growth, cross-sell upsell and net of attrition. Q4 continued the positive trend in the drivers within our control, including growth from new clients of approximately $12 million or 7%, our ninth consecutive quarter at or above our 7% to 8% long-term target. The second item was signed new business implementations pushed out to late Q1 2023, over time we expect the current normalization in growth rates and modest pullback in hiring to be followed by a return to the historical 2% to 3% base rate and for our total organic revenue growth to return to our 9% to 11% target. Like with our revenue and adjusted EBITDA, our 2022 adjusted net income set a new company record of $29 million or $1.08 per diluted share, representing a year-over-year increase in adjusted earnings per share of 11%. For 2023, we expect to generate revenues of $760 million to $800 million, representing year-over-year growth of minus 1% to positive 4%. Turning to profitability, our 2023 guidance implies adjusted EBITDA growth of 0% to 10%, the midpoint of this range implies a full year adjusted EBITDA margin of 26.7%, reflecting a notable margin expansion over 100 basis points versus 2022, muted by approximately 30 basis points drag from our two M&A deals. We have significantly outperformed our topline targets during the past two years and are reaffirming our long-term target of 9% to 11% organic revenue growth levels, with margins expanding towards 29% to 32% plus and adjusted net income growth of 15% to 20% per year. So, for full year $57 million of revenue from new clients, which is 9% growth for the quarter, that was $12 million which is 7% growth. We don't believe that's going to be uniform over the year as we mentioned, we expect to see a contraction in Q1 of organic constant currency rate currency revenue of 8% to 10% with that improving over the year, but we do believe for full year '23, we're going to be in that 7% to 8% range for new client growth. Please go ahead, your line is open. We also shared in our prepared remarks that December we believe is a trough of base growth and we're seeing improvement in January and February, and when you think about kind of our full year 2023 drivers, as I just shared, we believe, new business will be 7% to 8%, we believe that cross-sell upsell and attrition will both be around a positive 4% and a negative 4% netting each other, and the base growth will be 8% to 9%, there will be seasonality in 2023. I know you cited on the slide 250% increase in identity transactions this year between ID.me and Yoti, I'm just curious as we think about the cross and upsell growth target over the medium term, if continued acceleration there would mean upside to those numbers, it certainly seems like at the growth rates that you're targeting there and as that becomes a bigger and bigger piece of the business that would be a possibility. And I think that the reason I mentioned all those growth rate is with our overall business growing that way to keep that same mix we've talked about before of 90% of our revenue being driven by the pre-screen -- the pre-hire screening and 10% by identity and monitoring the identity and monitoring obviously need to grow really, really fast. Please go ahead, your line is open. Please go ahead, your line is open."
}