{
    "symbol": "HTGC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 21:04:09",
    "content": " Despite continued market and macro volatility, the continued strength and expansion of our originations platform, robust liquidity position and strong balance sheet put us in a position to deliver achievements on multiple fronts in 2022, including record total gross debt and equity commitments of $3.12 billion, up 18% year-over-year and the first time in our 18-year history where we have been able to deliver over $3 billion of new commitments in a year. Record debt investment portfolio growth of nearly $600 million; record total investment income of $322 million, up 14% year-over-year; record net investment income of $188 million, up 25% year-over-year; increased our base distribution 3x in 2022 with our most recent increase to $0.39 per share in Q4. Our gross fundings continued to be strong during the quarter with over $367 million, which led to strong net debt investment portfolio growth of over $133 million during the fourth quarter and a record $598.5 million for 2022. With over $3 billion of new commitments in 2022 and a lower-than-typical funding-to-commitment ratio driven by conservative credit underwriting, we expect this trend of increased follow-on fundings to existing portfolio companies to continue in 2023. In Q4, we generated a record total investment income of $100.2 million and record net investment income of $62.1 million or $0.47 per share, providing 121% coverage of our recently increased base distribution of $0.39 per share. As of the end of Q4, we had only 2 debt investments on nonaccrual with an investment cost and fair value of approximately $18 million and $1.7 million, respectively or 0.6% and 0.1% as a percentage of the company's total investment portfolio at cost and value, respectively. Despite more selectivity and valuation sensitivity from venture capital investors, capital raising across our portfolio remained strong throughout 2022, with 58 companies or more than half of our portfolio companies raising over $5.6 billion of new capital. In total, $470 million of additional debt financing and credit facility capacity was made available to Hercules Capital, demonstrating our ability to raise significant amounts of capital at attractive rates in a period of significant volatility for the capital markets. Net investment income was a record $62.1 million, a 24% quarter-over-quarter increase or a record of $0.47 per share in Q4. In your prepared remarks, you talked about how half of your companies -- portfolio companies raise equity capital in 2022 for, I think, you said about $5.6 billion and that's with -- as the industry activity fell off meaningfully."
}