{
    "symbol": "MLKN",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-22 22:45:18",
    "content": " At the consolidated level, net sales in the third quarter of $984.7 million decreased 4.4% on a reported basis and 2.7% organically compared with the same quarter last year. New orders for this segment came to $461.6 million, reflecting a decrease of 12.6% from the same quarter last year on a reported basis and down 11.8% organically. Within our Global Retail segment, net sales in the quarter were $257.6 million, a decrease of 7.7% compared to the same period last year on a reported basis and down 5.5% organically. New orders totaled $213.7 million in the third quarter, down 23.5% compared to the same quarter last year on a reported basis and down 21% organically. Turning to our International Contract and Specialty segment, net sales for the quarter were $242.5 million, reflecting an increase of 0.6% on a reported basis and an increase of 4.3% organically. And then same kind of line of questioning on the gross margin side, it looks like with your guidance for the next quarter, youâ\u0080\u0099re still kind of on the path that you laid out at the end of last year, and thatâ\u0080\u0099s what I think is despite less volume than you probably would have otherwise thought and then maybe less mix of the higher-margin retail. And then the last thing I would point out is, I mentioned â\u0080\u0093 this wasnâ\u0080\u0099t a surprise as we knew this was going to be a factor, 50 basis points of that storage fee impact that we had in the retail side of the business, that inventory demurrage and storage fees that I talked about on the call last quarter, it was 50 basis points of pressure year-on-year. So, the fully restructuring â\u0080\u0093 well, no, we had total special charge items in the quarter of just over $52 million, I think Budd, $37 million of which relates to the fully decision and those were impairment of things like leases, inventory valuation reserve, so the majority of it was related to fully, but not the total amount."
}