{
    "symbol": "BDC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 14:52:13",
    "content": " Additionally, we increased our EPS guidance by $0.25 at the high end, resulting in full year EPS growth of 24% to 28%. Second quarter revenues increased 16% year over year to $667 million, exceeding our guidance range of $625 million to $640 million. Enterprise Solutions revenues increased 15% year-over-year on an organic basis in the second quarter, driven by strong end markets and share capture. EPS increased 31% year over year to $1.60, compared to $1.22 in the year-ago period and our guidance range of $1.35 to $1.45. Revenues were $667 million in the quarter, increasing $90 million, or 16%, from $577 million in the second quarter of 2021. EBITDA was $111 million, increasing $18 million, or 19%, compared to $93 million in the prior-year period. Net interest expense declined $4 million from the year-ago period, benefiting from the early debt repayment that we completed in the first quarter as well as favorable foreign exchange rates. Net income in the quarter was $72 million, compared to $55 million in the prior-year period. And earnings per share was $1.60, increasing 31% compared to $1.22 in the second quarter 2021. The Industrial Automation Solutions segment generated revenues of $359 million in the quarter, increasing 16% from $309 million in the second quarter of 2021. Industrial Automation segment EBITDA margins were 19% in the quarter, increasing 110 basis points compared to 17.9% in the year-ago period, due to solid operating leverage on volume growth and favorable pricing. The Enterprise Solutions segment generated revenues of $307 million during the quarter, increasing 15% from $268 million in the second quarter of 2021. Net capital expenditures were $19 million for the quarter, up slightly from $16 million in the prior-year period. Free cash flow in the quarter was $31 million, compared to $52 million in the prior-year period. Accounts receivable increased by $50 million compared to first quarter levels, due to the strong growth in revenues sequentially. However, compared to second quarter revenues, third quarter revenues are expected to be lower by approximately $25 million due to a stronger U.S. dollar and lower copper pass-through pricing, with minimal impact to EPS."
}