{
    "symbol": "ROLL",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-08 23:00:46",
    "content": " Net sales for the first quarter of fiscal ‘22 were $156.2 million versus $156.5 million for the same period last year, a decrease of 0.2%. Adjusted operating income was $31.3 million, 20% of net sales compared to last year’s 19.1%. Adjusted EBITDA was $45.3 million, 29% of net sales compared to $43.8 million and 28% of net sales for the same period last year. As a percentage of net sales, SG&A was 19.1% for the first quarter of fiscal 2022 compared to 17.1% for the same period last year. For the first quarter of fiscal 2022, other operating expenses were comprised mainly of $2.6 million of the amortization of intangible assets and $0.6 million of restructuring costs and other items. Other operating expense for the same period last year consisted mainly of $2.5 million in amortization of intangible assets, $1.1 million of restructuring costs and $0.2 million of other items. On an adjusted basis, operating income would have been $31.3 million for the first quarter of fiscal 2022 compared to adjusted operating income of $29.9 million for the first quarter of 2020 – sorry, 2021. For the first quarter of 2022, the company reported net income of $26 million compared to net income of $22.7 million for the same period last year. On an adjusted basis, net income would have been $26.3 million for the first quarter of fiscal 2022 compared to adjusted net income of $23.6 million for the same period last year. Diluted earnings per share, was $1.03 per share for the first quarter of fiscal ‘22 compared to $0.91 per share for the same period last year. On an adjusted basis, diluted earnings per share for the first quarter of fiscal ‘22 was $1.04 compared to $0.95 per share for the same period last year. Turning to cash flow, one of our strongest quarters-to-date, the company generated $53.3 million in cash from operating activities in the first quarter of fiscal 2022 compared to $48.4 million for the same period last year. Hi, good morning guys. Hi, good morning guys. Hi, good morning guys."
}