{
    "symbol": "ROLL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-10 16:39:05",
    "content": " In summary, RBC Bearings net sales for the third quarter of fiscal 2022 were $267 million versus $145.9 million for the same period last year, an increase of 83%. Adjusted operating income was $44.8 million, 16.8% of net sales compared to last year’s $27.9 million and 19.1% of net sales. Expanding on gross margin that Mike already covered, gross margin for the third quarter of fiscal 2022 was affected by a $7.0 million inventory step-up related to the Dodge acquisition. SG&A for the third quarter of fiscal 2022 was $43.2 million, compared to $25.7 million for the same period last year. As a percentage of net sales, SG&A was 16.2% for the third quarter of fiscal 2022, compared to 17.6% for the same period last year. Other operating expenses for the third quarter of fiscal 2022 totaled $35.8 million, compared to $3.3 million for the same period last year. For the third quarter of fiscal 2022, other operating expenses included $23.5 million of costs associated with the Dodge acquisition, $12.1 million of amortization of intangible assets and $0.2 million of other items. On an adjusted basis, operating income would have been $44.8 million for the third quarter of fiscal 2022 compared to adjusted operating income of $27.9 million for the third quarter of fiscal 2021. Other non-operating expense was expense of $1.4 million for the third quarter of fiscal 2022, compared to income of $0.1 million for the same period last year. For the third quarter of fiscal 2022, other non-operating expenses were comprised of $0.9 million of charges associated with the elimination of a domestic debt facility, $0.4 million of postretirement benefit costs and $0.1 million of other items. For the third quarter of fiscal 2021, other non-operating income was comprised of $0.5 million of gains on marketable securities, partially offset by $0.2 million of foreign exchange loss and $0.2 million of other items. For the third quarter of fiscal 2022, the company reported a net loss of $0.1 million, compared to net income of $21.6 million for the same period last year. On an adjusted basis, net income was $26.1 million for the third quarter of fiscal 2022, compared to $22.7 million for the same period last year. On an adjusted basis, net income available to common stockholders for the third quarter of fiscal 2022 was $20.3 million compared to $22.7 million for the same period last year. Diluted earnings per share was negative $0.20 per share for the third quarter of fiscal 2022, compared to $0.86 per share for the same period last year. On an adjusted basis, diluted EPS for the third quarter of fiscal 2022 with $0.70 per share compared to adjusted diluted EPS of $0.90 per share for the same period last year. Diluted cash EPS was an adjusted $1.46 per share for the third quarter of fiscal 2022 compared to $1.35 per share for the same period last year Adjusted cash net income and adjusted cash earnings per share excludes non-cash expenses for depreciation and amortization of fixed and intangible assets, stock compensation and amortization of deferred financing fees, net of their income tax impact. Turning the cash flow, the company generated $40.0 million in cash from operating activities for the third quarter of fiscal 2022 compared to $36.1 million for the same period last year and $133.4 million in cash from operating activities for the nine-month period fiscal 2022 compared to $110.6 million for the same nine-month period last year. Capital expenditures were $14.9 million for the third quarter of fiscal 2022 compared to $2.8 million for the same period last year, approximately $6.2 million of capital spending this quarter was related to the Dodge acquisition and they were submitted post closing purchase price adjustment costs. Your line is open. Your line is open. Your line is open, please go ahead. Your line is open, please go ahead. I mean as we mentioned earlier, we’ve got about another $6.8 million in the step-up of amortization of the inventory that will come out in the next quarter. We’ve incurred I would say the majority of the onetime acquisition cost, there will still be, I’d say, $0.5 million to $1 million of additional costs in the fourth quarter, kind of onetime costs there. Your line is open, please go ahead. Your line is open. Your line is open. Your line is open."
}