{
    "symbol": "RS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 17:42:23",
    "content": " As anticipated, metal price declines during the quarter led to a temporary compression of our gross profit margin but we nonetheless achieved strong diluted earnings per share of $6.45 which were the highest in our history for a third quarter. In the third quarter, our diversification strategy benefited our results as the recovery in certain areas such as aerospace, energy and semiconductor helped moderate declines in our third quarter average selling price, gross profit margins and tons sold and our performance of value-added processing on approximately 50% of the orders contributed to our industry-leading gross profit margin profile and provided stability to our gross profit margin despite declining metal prices. During the third quarter, we generated record quarterly cash flow from operations of $635.7 million, driven by ongoing strength in our profitability combined with effective working capital management which helps fuel our growth both and long-standing history of solid stockholder returns. Our average selling price per ton sold of $3,039, declined 6.2% compared to record pricing in the second quarter of 2022 which was in line with our expectation of down 5% to 7%. As we have experienced in prior cycles, declining pricing levels led to temporary compression in our gross profit margin during the third quarter of 2022 to 29.2%. On a year-over-year basis, our third quarter same-store non-GAAP SG&A expenses were relatively flat with an increase of only $2.3 million or 0.4% as lower incentive-based compensation from lower FIFO pretax profit offset inflationary factors, including higher wages, freight, fuel and plant supply costs. Pretax income for the quarter which totaled $524 million, declined by only 1.6% compared to the third quarter of 2021, despite a 230 basis point year-over-year decline in our gross profit margin. Our third quarter 2022 diluted earnings per share of $6.45, a record for the third quarter, were up about 5% from the third quarter of 2021 despite relatively flat pretax and net income levels due to a reduction in our outstanding common shares of about 6% during the past 12 months from our share repurchases. As a result, we estimate our average selling price per ton sold in the fourth quarter of 2022 will be down 6% to 8% compared to the third quarter of 2022."
}