{
    "symbol": "HP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-01 15:42:10",
    "content": " Looking ahead to the second quarter of fiscal ‘22 for North America Solutions, as I mentioned earlier we ended Q1 near the midpoint of our actually guidance range, the activity levels continuing to grow, albeit at a more moderate pace than the first quarter, driven in part by public company operators who are working to fulfill their calendar ‘22 budget levels. As a reminder from our November call, we increased labor rates in early December, which although a margin neutral pass-through will be accretive to full second quarter costs, we are still seeing some inflationary pressures on materials and supplies as mentioned last quarter, although some pricing pressures appear to be beginning to stabilize, we do expect recurring per day expenses to increase above $15,000 per day in fiscal Q2. Your line is open. Your line is open. But as we said, we're – you know around 40% of our working rigs today, you know it’s really a partnership working with our customers and you know what's great about it is there's a portfolio of different options that we can provide for the customer working together, based on what's most important to them in terms of the outcomes that they are looking for or the areas that they are challenged with in terms of driving performance. Your line is open. Yeah, you look at oil and gas prices and how they are really at eight year highs, and you know you’re going back to that period of time when we last saw pricing or prices at that level, our average day rate on a rig was between $25,000 and $26,000 a day. Just to give you a little color on some specifics within that, of the 27 rigs we added during the first quarter Taylor, you know 12 were on term and 15 were on spot, but more recently the 10 we've added this calendar year to-date, you know seven of those are on term and three are on spot. Your line is open. Your line is open. Yeah, well that's part of it, that’s part of the opportunity right, is that if this year follows like ’21, whereas you've got the rig count ramp at the first quarter of the year, of the calendar year, and then it kind of flattened out slightly up, then obviously the rig recommissioning costs go away and your focusing – you know your costs are down, so you are focusing on growing the marching through pricing."
}