{
    "symbol": "HBM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 11:49:10",
    "content": " Phase 1 reflects a 16-year stand-alone operation on private land with average annual copper production of approximately 86,000 tonnes at attractive cash costs of $1.15 per pound. Fourth quarter consolidated copper production increased by 20% from the third quarter, primarily due to higher copper grades in Peru, consolidated gold production was slightly higher than the third quarter due to higher gold grades in Peru, which were partially offset by lower Lalor gold grades in Manitoba. Annual copper and gold production was on the lower end of the guidance range, primarily due to lower than planned grades in the fourth quarter in Peru as we implemented short-term mine plan changes to mitigate the risks associated with logistical and supply chain disruptions. Consolidated copper cash costs increased from the third quarter levels as a result of lower precious metal sales volumes and continued inflationary cost pressures, partially offset by higher copper production. Full year 2022 production in Manitoba was impacted by the planned closure of 777 in June, resulting in a decrease in copper, zinc and silver production while annual gold production increased by 13% as New Britannia ramped up to full production. All in mind that Lalor increased by 6% in the fourth quarter compared to the third quarter, mainly due to the higher production initiatives and the integration of the Flin Flon employees and equipment partially offset by a planned maintenance program at the mine. Combined unit operating costs in the fourth quarter were relatively in line with the third quarter Full year combined unit operating costs increased by 27% compared to 2021, reflecting the stand-alone higher cost structure of Snow Lake after the closure of the 777 mine and the Flin Flon operations in mid-2022. Manitoba's gold cash costs were $922 per ounce in the fourth quarter, higher than the third quarter, primarily due to lower byproduct credits and lower gold production. 2023 is expected to be another year of meaningful growth, with consolidated copper production expected to increase by 10% and consolidated gold production is expected to increase by 30% compared to 2022. Despite these changes and a period of higher stripping at Pampacancha, 2023 production is expected to be 103,500 tonnes of copper and 95,500 ounces of gold, representing year-over-year increases of 16% and 64%, respectively. In Manitoba, 2023 gold production is expected to increase by 18% to 190,000 ounces due to higher gold grades and a 10% increase in ore throughput at the Lalor mine. Copper cash costs in Peru are expected to decline by 26% in 2023 versus 2022, primarily due to higher gold by-product credits and higher copper production. Consolidated sustaining cash costs in 2023 are expected to be 18% lower than 2022 levels due to the same factors affecting consolidated cash costs, partially offset by slightly higher sustaining capital expenditures. So I think the story would be that we're producing more copper in Peru, more gold in Manitoba and at a lower cash cost, and that's a testament to the team's focus on cost efficiencies and despite the inflationary environment. You'll notice that our plan for this year results in an increase in the gold production guidance versus last year or this was planned last year, and that's due to some of these efficiencies that Andre talks about we're going to be running New Britannia now above 1,600 tonnes per day, which is above nameplate. So in terms of the balance -- and right now, that's why we're doing the all grade recovery improvement program around getting better gold recoveries and copper recoveries because today, we're producing more gold ore than what New Brit can handle even though I think in January, we peak close to 1,800 tonnes per day in terms of throughput at New Britannia."
}