{
    "symbol": "BRMK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 20:02:06",
    "content": " In addition to the press releases issued this afternoon, we have filed a supplemental package with additional detail on our results, which is available in the Investors section on our website at www.broadmark.com. As a reminder, remarks made on today's conference call may include forward-looking statements. For a more detailed discussion of the factors that may affect the company's results, please refer to our earnings release for this quarter and to our most recent SEC filings. During this call, we will also be discussing certain non-GAAP financial measures. This afternoon's conference call is hosted by Broadmark's Interim Chief Executive Officer, Jeffrey Pyatt; Interim President, Kevin Luebbers; and Chief Financial Officer, David Schneider. Management will make some prepared comments, after which we will open up the call to your questions. I have assumed the role of Interim CEO and Kevin Luebbers, a Director and Chair of the Audit Committee, has been named Interim President. Also, Kevin and I will remain members of the board and I will continue to serve as its Chairman. These appointments follow a mutual agreement to separate between the board and Brian Ward, who will leave his role as CEO and resign as a director of the company effective immediately. Additionally, I am pleased to share that Jonathan Hermes has been hired as our Chief Financial Officer effective December 1, 2022. Jon will succeed David Schneider, who previously announced his intention to resign to accept an opportunity at a private company. Given this is his last call with us, David, on behalf of the board of directors, we thank you for your numerous contributions and helps in the transition and we wish you all success in your next chapter. While we've experienced significant leadership change over the past year, the foundational principles of our business remain unchanged. We founded Broadmark over a decade ago in the wake of the global financial crisis, so we know a thing or two about navigating choppy waters. Through it all, we have lived up to our commitments to our borrowers and thrived as a trusted go-to provider of capital. Our loans are generally short-term in nature, allowing us to reprice our book with relative speed. Notably, we have always operated with little or no debt, significantly reducing risks associated with liquidity, refinancing and interest rate exposure. As we look to the future, we remain confident in our cycle-tested strategy. We are diversified across a national footprint and have a deep and experienced team of ground level, real estate investment experts. As we manage our existing portfolio in the current economic and financial market turmoil subsides over time, we believe we will emerge in a strong position to take advantage of the opportunities that arise to resume growth and create value over the long term. 2022 continues to bring unprecedented challenges to the global economy, real estate and the financial markets. Persistently high inflation has forced the Federal Reserve to rapidly increase rates, greatly impacting asset values in the near term. 30-year residential mortgage rates have risen from roughly 3% one year ago to over 7% today, and commercial mortgage rates have followed a similar pattern. And while overall employment has continued to grow, real wages have declined and there are increasing signs of recession risk amid a backdrop of political uncertainty. With counter vailing risks of inflation along with the rising rates and recession fears, financial market volatility has hit levels not seen since the global financial crisis in 2008, 2009. Despite this environment, we believe that Broadmark is positioned ultimately to thrive as opportunities arise as they always do from market dislocation and uncertainty. Capital is precious and while we have confidence, we will ultimately resolve those loans in a manner favorable to Broadmark until they are resolved, it continues to create a drag on our growth and our earnings. To that point, the team will remain hyper focused on this issue. David will provide additional detail, but we wanted to call out that this will continue to be one of our most important areas of focus. Today, the board approved a share repurchase program to purchase up to $75 million of common stock. We remain committed to continuing to source and fund new loan originations, but we recognize the value of our company and wanted an additional capital allocation lever on which to potentially add opportunistically in the future. With an experienced team in place and the lowest levered balance sheet in the industry, Broadmark is poised to build the business in a disciplined and thoughtful manner. I'd like to thank our team for their hard work and contributions, and while this will take some time, we believe we are taking the right actions to move forward and achieve long-term success. And with that, I'll turn the call over to David. Thanks, Kevin and good afternoon, everyone. For the third quarter of 2022, we produced total revenue of $27.1 million and net income of $2.6 million. On a per share basis, this reflects GAAP net income of approximately $0.02 per diluted common share. Adjusting for the impact of non-recurring costs and other non-cash items, our distributable earnings prior to realized loss on investments for the third quarter were $18 million or $0.14 per diluted common share. Interest income on our loans in the third quarter was $20.7 million, and fee income was $6.4 million. On the expense side, for the third quarter, we had cash compensation and employee benefits expense of $2.7 million, while G&A was $3 million. In the third quarter, we executed on 18 loan originations with an average loan size of $7.8 million at an unlevered yield of 12.9%. As a reminder, our loans remain short-term with a weighted average term of 14 months at origination for the third quarter. Turning to portfolio management, as of September 30, we had contractual default rate of 19% of the total portfolio by value. During the third quarter, we foreclosed on one small loan and received payoffs on six loans in contractual default status, representing $18 million in total commitment. At the end of the quarter, we owned 11 foreclosed properties with $93.5 million in carrying value. As I noted earlier, our CECL reserve was up in the third quarter. As a reminder, our portfolio is less than 5% hotels and weighted towards single and multi-family collateral with substantially lower LTVs, and we do not believe this troubled loan is representative of our broader portfolio. Outside of this specific reserve, we noted a 13% increase in our aggregate CECL general reserve based on consideration of current macroeconomic factors. From an earnings perspective, as of September 30, we had approximately $115.4 million in principle outstanding on loans and non-accrual status and foreclosed properties, which resulted in a drag on earnings of approximately $0.05 per diluted common share for the third quarter of 2022. As Kevin mentioned, effectively addressing our non-performing loans remains a high priority as we continue to work diligently to resolve these issues to achieve the best result for Broadmark and in a manner accretive to shareholders. Ultimately, we strive to generate strong cash flow and earnings growth, so effectively executing on this strategy is essential as we work to maximize performance. While our loan payoffs were significant in the third quarter of 2022 at $198 million, this was largely due to a few expected prepayments on storage facility loans. However, given the changing economic backdrop, we began to see a slowdown and payoff activity in October associated with a decrease in available takeout financing in the market. With our $100 million of five-year 5% fixed coupon senior unsecured notes outstanding, we currently have a debt equity ratio of 8.8%, which remains the strongest in the mortgage REIT sector. Maintaining a fortress balance sheet has always been a foundational principle for Broadmark, this provide a significant competitive advantage in the current environment that will allow us to remain opportunistic with an evolving market environment. With that, Iâ\u0080\u0099d like to pass the call back to Jeff. Given the circumstances, the Board will continue to take clear, decisive action on behalf of shareholders as necessary. We understand this will take time, but we know the right path forward and given our alignment of interest with our shareholders, we can and will achieve the desired results. Hi, good afternoon, Jeff. But the â\u0080\u0093 this just happened Stephen, and so the Board is going to begin a search to find a new CEO and I think the important takeaway there is that Kevin and I, who both have a lot of experience working together in this company, our committed to being here until we find that person and get him or her up to speed. So the current structure with the leadership changes that we described with specifically with Jeff and Kevin coming on Board, those will have no material expense. In fact, thereâ\u0080\u0099s probably a bit of a net savings from that perspective. Longer term to your question, if we do engage a search firm, there could be a potential search fees associated that similar to what we incurred in the first quarter of this year. So I think right now, Iâ\u0080\u0099m still comfortable running with the $24 million of cash comp and G&A expenses and we can provide you an update in the interim and weâ\u0080\u0099re in the fourth quarter. To think about the investment portfolio, now itâ\u0080\u0099s on a footnote on the supplement. Broadmarkâ\u0080\u0099s always made loan decisions based on underwriting and attractiveness, and so theyâ\u0080\u0099ll continue to do that. No, I mean, I think when we did the first mezzanine loan, we said, donâ\u0080\u0099t expect this to be a large portion of our portfolio. So doesnâ\u0080\u0099t mean weâ\u0080\u0099re going to do a bunch of mezzanine loans, it doesnâ\u0080\u0099t mean we wonâ\u0080\u0099t do mezzanine loans. I think weâ\u0080\u0099re just looking for good opportunities to play capital, while being mindful of the current macro environment. And when you think about the dividend level versus current portfolio earnings, given the performance levels. Ultimately Steven, this is a Board decision that is reviewed and determined each month. So in light of the rapidly changing business environment, management is taking a hard look at the business. But again, itâ\u0080\u0099s a Board decision and theyâ\u0080\u0099ll continue to review and determine it each month. Appreciate the time this afternoon, Jeff. Probably wasnâ\u0080\u0099t part of â\u0080\u0093 necessarily part of your plan six months ago, but I respect you have a lot of talent to bring to bear and the company is lucky to have you to step in. So we are in a very different world than we were six months, 12 months ago from a real estate standpoint. Unfortunately, maybe where we are right now in terms of priorities in the market for all real estate lenders, maybe broadening or expanding is less important than focusing on the existing portfolio. I guess, my question there is about your current lending focus. Can you talk about what youâ\u0080\u0099re comfortable doing and youâ\u0080\u0099re having repayments obviously come in, although my next part of my question is the slow down there. And I guess that the overarching theme is that whether I was in the seat or Brian or now me again, weâ\u0080\u0099ve never changed from our strict underwriting standards. When you and I first met, I think we were in nine states. And so we still make sure that weâ\u0080\u0099re paying attention to loan to value ratios, to loan to cost ratios, to all those things that have always been underpinnings of our loan portfolio. And so we probably want to look a little more carefully, not that thatâ\u0080\u0099s probably not the right term, but we want to continue to look carefully and just make sure that weâ\u0080\u0099re underwriting good loans. And for the reasons David mentioned, rising interest rates, rising cap rates, the exits are difficult for our borrowers and we expect that they will be for who knows how long. So weâ\u0080\u0099re just being cautious and careful, but we are a lender and so weâ\u0080\u0099re going to continue to make good loans where theyâ\u0080\u0099re available. And on your borrowerâ\u0080\u0099s situation, I assume if you have a good property and you have a reasonably responsible borrower and heâ\u0080\u0099s basically just saying, one, normally you would think, okay, if I complete it, I sell it. Two, I just â\u0080\u0093 I refi it in some fashion, you have a certain term, youâ\u0080\u0099re in there for the renovation or construction, and youâ\u0080\u0099re not in there necessarily for a five year loan. Iâ\u0080\u0099d say itâ\u0080\u0099s a, Steve, itâ\u0080\u0099s a case by case basis, and thatâ\u0080\u0099s exactly what weâ\u0080\u0099re working on. Well, listen, I know itâ\u0080\u0099s a challenging time. Youâ\u0080\u0099ve got a great fortress balance sheet, and Iâ\u0080\u0099m sure that youâ\u0080\u0099ll come through it, and applaud the effort on the buy back. And I kind of echo Stephen Lawsâ\u0080\u0099 comment, the dividends obviously a board decision were â\u0080\u0093 thereâ\u0080\u0099s going to be a lot of dividends reconsidered simply because â\u0080\u0093 one, a 15% yield is kind of crazy, but two, you got to a balance it against liquidity needs and the buyback opportunities. So, nobody signed on buying your stock thinking they were going to get 15% yield. So, Iâ\u0080\u0099ll just leave it with that thought and wish you all well and good health. Just starting with the leadership transition Jeff, Iâ\u0080\u0099m just curious why now for the change in CEO, as Brianâ\u0080\u0099s just been in the seat for about 18  months or so in whatâ\u0080\u0099s been a very difficult economic environment. The why now, I think the answer is that the board and Brian sat down and looked around and decided this was the right time. And, I think, I donâ\u0080\u0099t think I can go much beyond that, candidly. And then as far as strategic changes, Brian did a lot of good work around here. And then a second one just on loans and contractual default, so theyâ\u0080\u0099re now just under $290 million. So, I think we were up quarter-over-quarter about $60 million in defaults. In terms of being more aggressive, I could note that, I think $40 million out of the $60 million was us deciding to strategically put seven loans. Six of them were performing, one was default with the same borrower, and we decided to put the whole package in default just to expedite the process around probably the most valuable, but risky loan. So weâ\u0080\u0099re making a little bit quicker decisions around putting borrowers in default, exercising our right to start the foreclosure process to put a little bit more pressure and just trying to find more timely exits. In the third quarter, I think we had about 18 million of defaults resolved in October, want to say we were about 20 million. And weâ\u0080\u0099re expecting kind of a little bit of an increased pace consistent with that on a monthly basis, just by way of being a little bit pushier, being a little bit tougher, being more aggressive with foreclosure action or threatened foreclosure action and finding ways to exit as quickly as we can. Sure, Iâ\u0080\u0099ll take that one, Crispin. So I think our increased quarter-over-quarter was about $10 million and $9.1 million of that was a specific reserve on this one, Colorado World Resorts loan. I mean, Jeff, I think a lot of shareholders are going to ask the question and Iâ\u0080\u0099m curious to hear the answer. I mean, you look at buying back shares today, your stocks roughly at a 30% discount to tangible book value. You look at that versus originating new loans, the 13% unlevered. So, in terms of our use of capital, our main business is to source and fund loan originations. But we do understand the value of our company and again, we thought it was prudent to have this additional lever on which to potentially act in the future. Iâ\u0080\u0099ll also say that we announced the plan, but the amount, the timing, the execution, all of that is part of our overall capital allocation strategy, which will determine over time. In terms of the dividend, you asked about that, obviously, itâ\u0080\u0099s a balance. Our goal, as I said, is to set a dividend thatâ\u0080\u0099s sustainable over time and covered by distributable EPS. When you look at, obviously, is tangible book value, the stock price to tangible book, a good reasonable proxy on when it would be attractive to buyback share originating, I mean, just walk me through the accretion sort of analysis. It's something we'll analyze, but I can't tell you exactly what the price is or how we're going to look at it. But in terms of kind of where we see that, I'll let David answer the questions more specifically. Thanks for the question, Matthew, itâ\u0080\u0099s David. Yes, so we were at 12.9% on new origination dollar yield unlevered this quarter. Now, I would say some borrowers are probably hesitant to pull the trigger and do new loans given the current macroeconomic environment. But we did finally start to see that gap close a bit from the bid-ask spread, and it went in our favor. So, I think we said in our prepared marks expect to be somewhere around 12% to 13%, at least in the near term. And I guess just the last question why I have you, I mean, clearly the priority is to get to the non-accruals that cost you free of cash and capital. I mean, there's nothing obviously do for a while letâ\u0080\u0099s say 8.8%, but I mean, what's â\u0080\u0093 when you talk about issuing debt, what can you tell us in terms of where you can issue it? I mean, right now doesnâ\u0080\u0099t seem like the time to be raising capital. We still continue to have conversations where weâ\u0080\u0099re ready to access the capital markets if they, we see some windows of sustainability but current market, just you can see how few transactions there are. So if I, we certainly wouldnâ\u0080\u0099t be able to execute at a 5% fixed rate coupon like we did in November. But I think, in terms of cash liquidity position, we feel good about where we are for now. Weâ\u0080\u0099re measuring that against our origination pipeline, other demands like the dividend and where share repurchases could come into play in the future. So I think thereâ\u0080\u0099s a few different levers that weâ\u0080\u0099re measuring, but we donâ\u0080\u0099t need capital right now. And now it feels like a time where if youâ\u0080\u0099re raising capital, itâ\u0080\u0099s a bit of a really urgent need or desperation, which weâ\u0080\u0099re not in that position. I would just add, I would echo what David said, but thatâ\u0080\u0099s the job is to stay in touch with the capital markets. So whether now is the right time, I donâ\u0080\u0099t disagree with what David said but that can change. I think, it all depends on how everything, itâ\u0080\u0099s just another decision that we make. I think, as David has mentioned in past calls, we constantly evaluate the capital markets and make decisions all the time. Well, Iâ\u0080\u0099ll leave it there and good luck on the search and weâ\u0080\u0099ll wait and update. One last time, David Schneider, we all wish you the very best and I look forward to speaking with all of you on our next call."
}