{
    "symbol": "YSG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 00:31:01",
    "content": " According to the adjusted data published by the China National Bureau of Statistics, Chinaâ\u0080\u0099s total beauty retail sales in the fourth quarter of 2022 recorded a negative growth of 3.1% year-over-year, while for the full year 2022 Chinaâ\u0080\u0099s beauty retail sales declined by 3.2% year-over-year. Net revenues for our Skincare Brands increased by 42.4% year-over-year to RMB471.6 million, highlighted by outstanding performance among our fast-growing clinical and premium brands, including DR. WU, Galenic and Eve Lom, which recorded a robust growth of 73% year-over-year and the 99.3% year-over-year in combined net revenues for the fourth quarter and full year of 2022 respectively. In terms of revenue contribution, our Skincare Brands accounted for 46.9% of total net revenues in the fourth quarter and 33.5% for the full year of 2022, more than doubling compared with the prior year period in both cases. Turning now to profitability, thanks to higher contribution from our Skincare Brands, more disciplined pricing and discount policies and continued cost optimization across all our brands, our gross margin increased by 6.1 percentage points to 71.1% for the fourth quarter from 55% a year ago. Most importantly, we recorded a non-GAAP net income margin for 3.4% for the fourth quarter as compared with a non-GAAP net loss margin of 14.7% for the third quarter and the non-GAAP net loss margin of 21.9% for the prior year period. For the full year 2022, our R&D expenses increased to 3.4% of total net revenues from 2.4% for the prior year period. As a percentage of total net revenues, total operating expenses for the fourth quarter of 2022 were 78.9% as compared with 97.8% for the prior year period. As a percentage of total net revenue, fulfillment expenses for the fourth quarter of 2022 decreased to 6.2% from 8.1% for the prior year period. As a percentage of total net revenues, selling and marketing expenses for the fourth quarter of 2022 decreased to 53.2% from 70.7% for the prior year period. As a percentage of total net revenues, general and administrative expenses for the fourth quarter of 2022 increased to 16.9% from 16.3% for the prior year period. As a percentage of total net revenues, research and development expenses for the fourth quarter of 2022 decreased to 2.5% from 2.8% for the prior year period. Total net revenues for the full year of 2022 decreased by 36.5% to RMB3.71 billion from RMB5.84 billion for the prior year period, primarily attributable to the decline in net revenues from Color Cosmetics Brands, partially offset by the increase in net revenues from Skincare Brands. Looking at our business outlook for the first quarter of 2023, we expect our total net revenues to be between RMB623.7 million and RMB712.8 million, representing a year-over-year decline of approximately 20% to 30%."
}