{
    "symbol": "ALG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 20:40:06",
    "content": " First quarter consolidated net sales for 2022 came in at $362 million, an increase of 16% compared to $311.2 million in the first quarter of last year. Consolidated net income for the first quarter of 2022 was $18.5 million or $1.55 per diluted share, an increase of 5.8% versus net income of $17.5 million or $1.47 per diluted share for the first quarter of 2021. Margins during the first quarter of 2022 were down 145 basis points compared to the first quarter of 2021 as higher material and labor costs compressed the division’s margin by 106 basis points, while the remaining 39 basis points impact resulted from a combination of lower operating efficiencies and significantly higher inbound freight costs. Industrial Equipment division net sales in the first quarter of 2022 were $141 million, up 11% compared to $127.3 million for the first quarter of 2021 due to a strong performance in North American excavator and vacuum truck operations, along with improved net sales in the division’s other product lines. Income from operations in the first quarter of 2022 was $10.8 million, up 15% compared to $9.3 million for the first quarter of 2021, still a solid performance in the division despite the ongoing issues I covered above. For the first -- for the fifth quarter in a row, strong order bookings continued during the first quarter of 2022, resulting in a record backlog of just under $918 million, an increase of 103% compared to the backlog at the end of the first quarter of 2021. First quarter order bookings of $469 million were up 22% compared to the first quarter last year, and the company’s order backlog increased nearly 103% to $918 million. Company net sales were 16% higher than the first quarter of 2021, with sales in the Vegetation Management division up 20% and Industrial Equipment division sales up 11%. While certainly a portion of the increase is attributable to higher prices, more than half represents real growth, and given the significant supply chain disruptions we experienced, I’m pleased that our teams accomplished this nice top line growth during the quarter. In spite of the higher costs, operating income in Vegetation Management benefited from the higher sales volume and rose nearly 13% compared to the first quarter of 2021, although income as a percentage of sales declined modestly as a result of the margin pressure. Although the Industrial Equipment division’s net sales growth was more modest, the top line leverage, combined with the higher margin, resulted in a nearly 23% improvement in operating income. We expect that sales will continue to show solid growth, although perhaps at a slightly more modest pace than we saw in the first quarter, given what’s happening in the supply chain."
}