{
    "symbol": "ALG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 16:36:03",
    "content": " Thanks, Jeff and good morning, everyone Alamo groups third quarter 2020 to close with a solid performance with record sales and net income results for the quarter were driven by strong demand for our products, but with continued supply chain challenges and labor shortages. Third quarter consolidated net sales for 2022 or 368 8 billion, increase of 9% compared to $338 3 million in the third quarter of last year. The vegetation management division had a solid third quarter as markets remain strong third quarter 2022, net sales were $228 5 billion, an increase of 9% compared to $209 8 billion for the third quarter of 2021. Industrial equipment Division net sales in the third quarter, $140 3 million up just over 9% compared to $128 5 million for the third quarter of 2021. First nine months of 2022 net sales for the industrial equipment Division for $422 5 million compared to 388, $388 7 million for the same period of 2021, an increase of almost 9%. Inventory's up almost $68 billion compared to the third quarter of 2021, $42 million compared to the end of 2021. Street, and governmental mowing produced strong results sales in these segments rose more than 20% compared to the third quarter of 2021. Despite these issues the division's margin improved and operating income rose, 27% compared to the third quarter of 2021 increased sales healthy margin and good control of expenses drove vegetation management third quarter operating margin percentage up 170 basis points compared to the third quarter of 2020, 1% to 12% of sales. Currently the division continued to ramp up its investment in product electric electrification during the quarter and also incurred certain one time costs associated with an ongoing plant consolidation and its snow removal segment, although the division demonstrated good control over expenses operating margin percentage for the quarter declined 50 basis, compared to the third quarter of 2021. It was gratifying that despite the headwinds we encountered the company's third quarter sales reflected a nice improvement in both sales and earnings versus the third quarter of 2021, and again set New company Records, while sales growth was more modest than expected for the reasons described it's worth noting that sales group growth excluding. They nonetheless showed excellent growth versus the third quarters of 2019 and 2020, our backlog increased sequentially and continues to hover close to the all time high achieved earlier this year material cost inflation, while still Evan. It's looking like it's shaping up to be a pretty nice quarter in that business, but youre right in a typical year without all the noise in the supply chain and the backlog fourth quarter would be just a little bit softer than the third."
}