{
    "symbol": "PIK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 20:25:21",
    "content": "  Operator: Good morning, afternoon, evening and welcome to the Kidpik First Quarter 2022 Financial Results Conference Call. We’re going to start with a review of our financial and business highlights, followed by a financial review, which Adir, our CFO will take us through, and we will then open the call to Q&A. Moshe Dabah, our Chief Technology Officer and Chief Operating Officer is also available for any questions you may have pertaining to that side of the business. As previously communicated in our last quarterly update, we continue to face many of the same business challenges that have slowed the pace of our sales growth due to reduced member acquisitions that has been further effected by nationwide decline in consumer confidence. While the quarter did not meet our expectations, we are confident that our concept, our team, our products, and the underlining business value propositions that we have at Kidpik will enable us to scale and reach our growth objectives in time. Q1 revenues were 4.3 million, which represents a decrease from the same period in 2021 of approximately 19%. As previously communicated, privacy changes across social media advertising platforms that were implemented late last year continued to affect the pace of our new customer acquisitions and resulted in lower revenues for Kidpik. To address these changes, we have launched a number of new programs that we expect to help grow our acquisitions and top line sales. These programs include a heightened focus on Google Search, our newly expanded ambassador program, newly planned direct-to-mail marketing and improved utilization of YouTube, Tik Tok, Pinterest, and Snapchat. In addition, we aim to build upon existing brand partnerships and introduce new collaborations similar to our previously announced partnership with Disney, which will enable us to gain brand awareness amongst new customer databases. We have noted in our prior calls that we have launched a grand ambassador program, which is up and running and growing steadily and we're implementing a paid influencers campaign strategy in which we enlist key influencers in the fashion and parenting space to share their Kidpik experience with their many followers. Our ambassadors and influencers create UGC, our user generated content, capturing the family experiencing Kidpik, which is amongst the most effective type of content when it comes to building brand awareness and attracting new members. Our combined expertise was in-house design, merchandising, sourcing and branding, coupled with the immense technology we have built with data driven analytics, uniquely positions us within the kids subscription marketplace and enable us to deliver great products and value to a price sensitive children's wear consumer. Our products and services are appealing to parents who value more quality family time, having an expert stylist for their child, receiving outfits that make the children’s look great and feel confident and who enjoy the fun unboxing experience and discovery we provide. Lastly, as you know, we operate with an integrated model where our design, merchandising, and procurement are done in-house. We have built our own Kidpik fashion brand, which gives us the opportunity to expand beyond subscriptions by selling our Kidpik brand through other e-commerce platforms and retail channels. Additionally, we’re growing our website e-commerce sales on shop.kidpik.com, which we invite you all to experience and where we see great growth opportunities. I want to close by saying that while we have challenges to overcome, Kidpik offers a very special and differentiated brand in service, which delights our customers. Q1 revenue was $4.3 million, a decrease of 18.7% year-over-year. Looking at Q1 revenue by channel, subscription sales were $3.5 million, a decrease of 24% year-over-year. Looking at Q1 revenue by product line, girls’ apparel decreased by 22% to 3.3 million, boys’ apparel decreased by 23% to 868,000. Toddler revenue was 201,000 versus 7,000 during the same period last year. Gross margin for the quarter was 59.9%, slightly lower than the 60.9% last year. Shipped items for the first quarter decreased by 32% to 371,000 compared to 543,000 last year. Keep rate for the first quarter was 70.4%, compared to 67.7% last year This is in-line with our record level of 70.8%, which was achieved in Q4 2021. On the bottom line, net loss for the quarter was approximately 1.8 million or a loss of $0.24 per share, compared to net loss of 1.5 million or a loss of $0.30 per share last year. Speaking to non-GAAP adjusted EBITDA for the quarter was a net loss of 1.5 million, compared to a net loss of 1.3 million last year. Cash at the end of the quarter was approximately 5.4 million, compared to 8.4 million at the end of 2021. We used 2.2 million in operating cash flow for the quarter, compared to 2.7 million in the last year's quarter. And as you know, we have this new ambassador program that we are paying much more attention to and it's giving us – at this particular moment, we're not seeing the kind of return we would like to see, but we know it's very cost effective and we will see it. So, we hope that will be launched within the next   weeks And in the past, we really have not paid much attention to Tik Tok and Pinterest and YouTube and Snapchat, and we are beginning to play in these channels as we speak. Well we have, you know, I guess throughout last year passed some of the costs that we have incurred, especially as it relates to the freight. We haven't seen as much of cost increase on the China side, but we really have not seen much of any issues as the customer accepting the cost increases that we have put in place over the last year in order to maintain our margins."
}