{
    "symbol": "ENVA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 21:49:03",
    "content": " As a result of the strong demand and our successful marketing, total company originations for the first quarter, totaled just over $1 billion, nearly flat sequentially from a very strong Q4 and more than doubled originations during the first quarter of 2021 while our portfolio grew 71% to $2.2 billion in the quarter. However, as a result of the strong origination growth this year, revenue in the first quarter increased 49% year-over-year and 6% sequentially to $386 million and benefiting from the strong credit performance, we produced solid bottom line returns as well with adjusted EBITDA of $106 million and adjusted EPS of $1.67, both up 4% from the fourth quarter. Revenue was driven by the continued growth of total company combined loan and finance receivables balances, which on an amortized basis were $2.2 billion at the end of the first quarter, up 11% sequentially and 71% higher than the first quarter of 2021. Small business receivables on an amortized basis totaled $1.2 billion at March 31, a 20% sequential increase and 74% higher than the end of the first quarter of 2021. Small business originations increased to $659 million, up 14% sequentially and more than double in the first quarter of 2021. Consumer receivables on an amortized basis ended the first quarter at $963 million, up slightly from December 31 and 69% higher than the first quarter of 2021 as consumer originations more than doubled from the prior year quarter to $382 million. The net revenue margin for the first quarter was 70% and was at the high end of our expected range as credit quality, which is the most significant driver of portfolio fair value remains solid and in line with our expectations. First, the total company ratio of net charge-offs as a percentage of average combined loan and finance receivables for the first quarter was 7.6%, up from 6.7% last quarter, and up from 4.2% in the first quarter of 2021, but still well below the pre-pandemic rate of 16.8% and 15.4% during the first quarters of 2020 and 2019, respectively. Even with nearly $3 billion in originations over the past three quarters, credit metrics for both our small business and consumer portfolios remain favorable to comparable pre-COVID periods as payment performance continues to be in line or better than our expectations. The first quarter net charge-off ratio for small business receivables was 1.9%, up from 80 basis points last quarter, but below the prior year ratio of 2.6% and below pre-pandemic periods as we continue to see strong payment performance across all of our small business products. The percentage of total portfolio receivables past due 30 days or more was 5.2% at March 31, down slightly from 5.3% at the end of 2021 and lower than the 7.6% ratio at the end of the first quarter a year-ago. To summarize, the change in the fair value line item this quarter is driven primarily by relatively low levels of net charge-offs, higher discount rates and credit metrics and modeling at the end of the first quarter that continue to reflect a solid outlook for expected future credit performance for our rapidly growing portfolio. Total operating expenses for the first quarter, including marketing were $168 million or 44% of revenue compared to $108 million or 42% of revenue in the first quarter of 2021. Looking forward, we expect marketing expenses as a percentage of revenue to be approximately 20% next quarter, slightly higher during periods of higher seasonal demand later in the year, but will depend upon the growth and originations especially from new customers. To summarize our outlook, with continued strong customer demand and meaningful growth in originations and receivables, we expect the net revenue margin to range between 63% and 68% next quarter and to normalize in the range of 55% to 65% over time."
}