{
    "symbol": "ENVA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 21:37:04",
    "content": " In the third quarter, small business products represented 60% of our portfolio while consumer counted for 40%, within consumer line of credit products increased to 33% of our portfolio while installment products decreased to 67%. Total company originations for the quarter reached $1.2 billion, up 10% sequentially and up 40% compared to the third quarter of 2021. Turning to our third quarter results, total company revenue rose 12% sequentially and increased 42% from the third quarter of 2021 to $456 million. The increase in revenue was driven by the growth of total company combined loan and finance receivables balances, which on an amortized basis were $2.6 billion at the end of the third quarter, up 11% sequentially and nearly 60% higher than the third quarter of 2021. As David noted, total company originations for the third quarter totaled $1.2 billion, up 10% sequentially and 40% higher than originations during the third quarter of 2021. Small business receivables on an amortized basis totaled $1.6 billion at September 30, a 16% sequential increase and 80% higher than the end of the third quarter of 2021, as small business originations increased 75% from the prior year quarter to $807 million. Consumer receivables on an amortized basis ended the quarter at $1.1 billion, up 3% from June 30 and 35% higher than the end of the third quarter of 2021, as consumer originations of $396 million were flat to the prior year quarter. For the third quarter, net charge-off and delinquency rates for the total company as well as for both the small business and consumer portfolios reflect the expected seasoning of recently originated vintages. The total company ratio of net charge-offs as a percentage of average combined loan and finance receivables for the third quarter was 8.4%, up from 7.2% last quarter and 4.2% in the third quarter of 2021, which preceded the acceleration of growth and receivables over recent quarters, especially from new customers. The ratio of net charge-offs as a percentage of average combined loan and finance receivables for both the small business and consumer portfolios increased sequentially, but are similar or better than pre-pandemic levels at $3.3 billion of origination so far this year continue to season in line with expectations in our unit economics framework. The percentage of total portfolio receivables past due 30 days or more was 5.6% at September 30, and itâ\u0080\u0099s flat compared to the end of the third quarter a year ago. As we would typically expect between the second and third quarters due to an acceleration of originations to new customers, the ratio of total receivables past due 30 days or more increased sequentially from 5.1% at the end of the second quarter. As I mentioned last quarter, while there may be quarter-to-quarter variations in credit metrics for our consumer and small business portfolios as vintages season, stability or improvement in the fair value premium as a percentage of principle typically reflects stability or improvement in the cumulative lifetime loss outlook for the portfolio, which was the case this quarter. Despite the impact of the discount rate adjustment, the fair value of the consolidated portfolio as a percentage of principle at September 30 increased from the end of the second quarter to 108%, reflecting a stable outlook for the expected lifetime credit performance of our total company portfolio. The increase in the total company fair value premium this quarter was driven primarily by the fair value of the consumer portfolio, which increased to 109% from 106% at the end of the â\u0080\u0093at the end of last quarter, as the rate of early stage consumer delinquencies declined sequentially. To summarize, the change in fair value line item this quarter was driven primarily by credit metrics and modeling at the end of the third quarter that continue to reflect a solid outlook for expected future credit performance, partially offset by higher discount rates and increases in net charge-offs during the third quarter as recently originated vintages have seasoned in line with our unit economics expectations. Total operating expenses for the third quarter, including marketing were $184 million or 40% of revenue compared to $151 million or 47% of revenue in the third quarter of 2021."
}