{
    "symbol": "ENVA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 23:46:04",
    "content": " Actual results may differ materially as a result from various important risk factors, including those discussed in our earnings press release and in our annual report on Form 10-K, quarterly reports on Forms 10-Q and current reports on Forms 8-K. We once again produced a strong quarter, capping a great year for Enova, with solid revenue and profitable growth, combined with stable credit across both our SMB and consumer businesses. The increase in revenue was driven by the growth of total company combined loan and finance receivables balances which on an amortized basis were $2.9 billion at the end of the fourth quarter, up 8% sequentially and 46% higher than the fourth quarter of 2021. As David noted, total company originations for the fourth quarter totaled $1.2 billion, down slightly sequentially and 9% higher than originations during the fourth quarter of 2021. Small business receivables on an amortized basis totaled $1.8 billion at December 31, a 13% sequential increase and 77% higher than the end of the fourth quarter of 2021 as small business originations increased 42% from the prior year quarter to $826 million. Revenue from our consumer businesses increased 3% sequentially and 18% from the fourth quarter of 2021 to $286 million as consumer receivables on an amortized basis ended the fourth quarter at $1.1 billion, flat sequentially and 12% higher than the end of the fourth quarter of 2021. As a result, consumer line of credit receivables grew 18% sequentially and 43% from the end of last year as consumer line of credit originations grew 13% sequentially and 30% from the fourth quarter of 2021. With the meaningful growth in our small business portfolio this year, we continue to see credit metrics for the portfolio moving to more normal levels from unsustainably low levels we experienced during 2021 and early 2022, along with a corresponding move in the small business net revenue margin toward a more typical level, ranging from the low 60% to the low 70%. The credit outlook for our small business portfolio, as reflected by the fair value premium as a percentage of principal, continued to reflect a stable outlook for lifetime portfolio credit losses at the end of the year and increased 1 percentage point from the end of last quarter to 109%. Similar to what we have observed with our consumer portfolio during 2022, as our small business portfolio's performance and credit metrics continue to settle at more typical ranges, there could be some quarter-to-quarter variability, including temporarily falling below or above typical ranges for the net revenue margin. Consistent with that shift, we've seen an increase in the fair value of our consumer portfolio as a percentage of principal during the second half of 2022, including 3 percentage points this quarter, reflecting a solid outlook for the lifetime credit losses versus original expectations. As a result of the aforementioned trends in our small business and consumer portfolios, the fair value of the consolidated portfolio as a percentage of principal increased by nearly 2 percentage points this quarter to 110%. Looking ahead, the small business credit continuing to settle at more typical levels and consumer credit remaining relatively stable, we expect the total company net revenue margin for the first quarter of 2023 to be in the range of 55% to 60%. Total operating expenses for the fourth quarter, including marketing, were $176 million or 36% of revenue compared to $187 million or 52% of revenue in the fourth quarter of 2021. With growth in receivables and originations during 2022, operations and technology expenses for the fourth quarter increased to $45 million or 9% of revenue compared to $39 million or 11% of revenue in the fourth quarter of 2021. In addition to closing a new $125 million facility to finance net credit installment loans in October that we discussed on our last call, during the fourth quarter, we also successfully renewed or amended $463 million of existing facilities secured by OnDeck receivables to either extend maturities or increase advance rates with favorable pricing. And we expect the total company net revenue margin in the range of 55% to 60%, with continued normalization of our small business portfolio and stable consumer credit."
}