{
    "symbol": "ENVA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 22:32:08",
    "content": " Total originations for the second quarter totaled just over $1 billion, up 5% sequentially from an unusually strong Q1, and up 60% compared to our second quarter of 2020, while our portfolio grew 68% to nearly $2.4 billion. The increase in revenue was driven by the continued growth of total company combined loan and finance receivables balances, which on an amortized basis were $2.4 billion at the end of the second quarter, up 10% sequentially and 68% higher than the second quarter of 2021. Small business receivables on an amortized basis totaled $1.4 billion at June 30, a 13% sequential increase and 75% higher than the end of the second quarter of 2021, as small business originations increased 70% from the prior year quarter to $679 million. Consumer receivables on an amortized basis ended the second quarter at $1 billion, up 6% from March 31 and 59% higher than the end of the second quarter of 2021, as consumer originations rose 74% from the prior year quarter to $410 million. As expected, the net revenue margin for the second quarter was 65% as credit quality, which is the most significant driver of portfolio fair value, continues to perform in line with our expectations. The second quarter net charge-off ratio for small business receivables was 2.2%, up from 1.9% last quarter and 70 basis points in the second quarter of 2021, but below pre-pandemic periods as we continue to see strong payment performance across all of our small business products. The consumer net charge-off ratio for the second quarter declined to 13.7% from 14.2% last quarter and is higher than the 4.6% ratio in the prior year quarter which preceded the acceleration of growth in consumer receivables over recent quarters, especially from new customers. Even with $4.1 billion in originations over the past year and record levels of new customer originations, this quarter marks the third consecutive quarter that the fair value premium as a percentage of principal for both our consumer and small business products has increased as payment performance for both portfolios continues to be in line or better than our expectations. To summarize, the change in fair value line item this quarter is driven, primarily by improved levels of net charge-offs, slightly higher discount rates and credit metrics and modeling at the end of the second quarter that continue to reflect a solid outlook for expected future credit performance for our growing portfolio. I mean if you look across the different products, just given what we've done with consumer, it's a little -- it's a touch below like our more normal range, but we've also seen strong growth and a high mix of new customers, as David mentioned, in small business credit has really continued to drive a high net revenue margin for small business, which I would expect to settle in somewhere between the low 60s to low 70s."
}