{
    "symbol": "PDCO",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-01 13:47:10",
    "content": " Overall, in the first quarter, we achieved year-over-year internal sales growth of 3%, driven by strong growth in the Animal Health segment. Fiscal 2023 first quarter internal sales in dental equipment were slightly ahead of the year-ago period, with double-digit sales growth in the core equipment category. While the pricing dynamics in infection control products impacted our consumables business, Patterson achieved year-over-year internal sales growth of nearly 2% in our non-infection control portfolio in the fiscal first quarter. Our Animal Health segment had a strong first quarter, achieving internal sales growth of nearly 6% year-over-year, driven by mid-single digit growth in companion animal and high-single digit growth in production animal. Even as this market's growth has moderated following the pandemic pet boom and despite a tough comparison to the 23% growth in the first quarter of fiscal 2022, Patterson delivered mid-single digit year-over-year internal sales growth in companion animal for the fiscal 2023 first quarter. On the production animal side, Patterson achieved high-single digit internal sales growth year-over-year in the fiscal first quarter. Consolidated reported sales for Patterson Companies in our fiscal 2023 first quarter were $1.52 billion, a decrease of 5.7% versus the first quarter one year ago. In the fiscal 2023 first quarter, our consolidated adjusted operating margin was 2.9%, a decline of 70 basis points compared to the first quarter of last year. Adjusted net income attributable to Patterson Companies, Inc. in the first quarter of fiscal 2023 was $31.7 million or $0.32 per diluted share. In the first quarter of fiscal 2023, internal sales for Animal Health business increased 5.7% compared to the first quarter of fiscal 2022. Adjusted operating margins in our Animal Health segment were 3.2% in the fiscal first quarter, a decrease of 30 basis points from the prior year."
}