{
    "symbol": "BQ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-03 09:29:06",
    "content": " : \n 00:01 Good day, ladies and gentlemen, thank you for standing by and welcome to Boqii’s Fiscal 2022 Third Quarter Earnings Conference Call. As a reminder, we are recording today's call. 00:31 Now, I will turn the call over to Mandy Luo, Boqii’s IR Manager. Joining us today are Ms. Lisa Tang, Co-CEO and CFO; Mr. Kai Fang, Chief Strategy Officer; and Mr. , Financial VP of Boqii. 01:18 Before we continue, please note that today's discussion will contain forward-looking statements made under the Safe Harbor provisions of the US Private Securities Litigation Reform Act of 1995. As such, the company's actual results may be materially different from the expectations expressed today. 02:03 Please note that certain financial measures that we use on the call, such as adjusted net loss, adjusted net loss margin, EBITDA and EBITDA margin are expressed on a non-GAAP basis. Also, please be reminded that unless otherwise stated, all figures mentioned during the conference call are in Chinese renminbi. 02:34 With that, let me now turn the call over to our Co-CEO and CFO, Ms. Lisa Tang. During Q3 for fiscal 2022 we continued to enhance our value chain position at an end-to-end connected, creating values for both pet parent and industry partners. We were able to engage more users, on top of that, we observed the struggle for precise vertical traffic of our industry partners. While our proven private domain user traffic has enabled us to grow topline, while controlling the sales and marketing spend. And the number of orders increased by 19.2% quarter-over-quarter, pointing towards our expanding brand value and improving customer engagement. 05:03 We remain dedicated to supporting the development of small to mid-size brands with our established capabilities in supply chain, warehousing,  membership system and  distribution network. This has translated into a significant growth in online marketing, information facilities, and other revenue from 0.2% of total revenue in Q3 of fiscal 21 to 4.6% of to total revenue in this quarter. As the infrastructure for such service revenue is already in place it's marginal cost remains low, together with our  fulfillment margin we are confident to reach breakeven in near future. 06:08 Boqii is looking not just a sustainable growth in user base, but also a comprehensive network and inverse juncture that allows us to connect the sellers and the buyers. As we achieved a new low in CAC of RMB5.5 per user, we believe our closed-loop system has taken shape and we will further improve our servicing capabilities. Looking ahead, China's per industry is expected to continue its growth, reaching more than 400 billion event by 2023 according to market research. 07:04 Now, I will turn the call over to our CSO, Kai Fang, who will share more details about our strategy and the financial highlights. On top of a general business overview, I'd like to share more detailed financial information that we're moving steadily towards profitability this quarter and onwards. We believe such brand is well balanced between efficiency, acquiring new traffic and returning user loyalty within our own communities. This quarter, our gross profit was RMB76.9 million, up by 37% year-over-year. And our gross margin increased to 23.1%, this is mainly driven by improved margin of optimized SKU matrix and higher margin contribution from our value-added services. This increase was primarily due to the increase in staff handling cost and the packaging cost as a result of increasing proportion of the pet supply products, which will higher packaging required. 09:20 Our total sales and marketing expense were RMB48.3 million, down by 12.4% from RMB55.1 million in the same period of last year. Sales and marketing expenses as a percentage of total revenue was 14.5%, down from 17.6% in the same period of last year. 09:55 G&A expenses were RMB22.3 million, down by 64% from the RMB61.8 million in the same quarter of fiscal year 2021. G&A expense as a percentage of total revenue was 6.7%, down from 19.8% in the same quarter of last fiscal year. We ended this quarter with cash, cash equivalents and short-term investments of RMB315.7 million compared to RMB339.4 million as of September 30, 2021. 10:37 With no major CapEx were seen, strong credit line back up and we are very close to the breakeven point, we believe we are cash sufficient in our operational and new initiatives. To conclude, Boqii delivered a set of solid results in this quarter with meaningful progress in execution of our growth strategies. We believe that by leveraging our leading market position in the pet industry, strong execution and the business development strategies, we can capture the promising business opportunity and deliver value add for post pet parents and our brand partners. So far, we can see a very steady demand in terms of domestic market, but unfortunately for our offline business, as well as our offline traffic is heavily impacted by the COVID situation and that impact our supply chain as well. And due to the COVID situation, we are seeing some tough -- especially for the cross-border business, we see some headwind in terms of the logistics. So therefore, as you can see, some of the imported products in our SKU lineup get the impact in the last quarter, and the quarter before last. So putting this way, it’s like -- we did see a lot of traditional overseas imported products that were under-supplied. And domestic -- the domestic supplies – the domestic brands are trying their best to fulfill the gap, but we do see a lot of gap that are on the field. But I just want to understand, I appreciate the online marketing piece is showing a lot of strength and that's a higher margin business. 15:58   In this quarter we saw very solid growth of gross profit margin in our product and our product sales part that has increased from 17.9% to 21.4% compared to the same period last year. And if we break this down, the contribution was from all across the categories, including staple food, pet supplies, as well as pet care products. Firstly, because we increased the support for the small to mid-size brands and they have higher margin compared to other brands. And secondly, because we have changed -- we have kind of adjusted the product mix, which has also helped the increase in the product sales margin. Of course, one part is from the information services and other revenue, because it has higher margins and it will -- we also foresee that this will constitute an increasing part of total revenue. And secondly, this will be contributed from the sales -- product sales part, because in Q3 of the fiscal year is the December quarter and we usually have the e-commerce promotions. You mentioned profit -- reaching profitability breakeven, whatever the metric is, several times in your press release. I'm just kind of curious what level of quarterly sales, you kind of have to be at to achieve that goal. As Lisa mentioned with our GPM continued improvement, we expect our total revenue -- our total revenue achieved RMB400 million. And on the other hand side we are fully aware of, like all the technique  that the company can take in terms to full fee to meet the requirements, such as reverse fleet of the stock. So therefore, we will definitely keep investors and the public be aware, should we have more concentrated -- concrete plan to meet that requirements. 21:45 Thank you, Andrew, and thank you all for participating in today's call and for your support."
}