{
    "symbol": "RDN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 15:25:14",
    "content": " In 2022, we returned significant capital to our stockholders, paying dividends of $135 million and purchasing $400 million of Radian Group common stock, representing 11% of total shares outstanding. As we announced last month, we completed a series of capital actions in the fourth quarter that resulted in a $382 million distribution from Radian Guaranty to Radian Group. And for the first time since the beginning of the great financial crisis 15 years ago, Radian Guaranty is positioned to resume paying recurring ordinary dividends to Radian Group this year, which we project to be between $300 million and $400 million in 2023. As reported last night, in the fourth quarter of 2022, we earned GAAP net income of $162 million or $1.01 per diluted share compared to $1.07 per diluted share in the fourth quarter a year ago. As shown on webcast Slide 13, our in force portfolio premium yield for our Mortgage Insurance portfolio was approximately 38 basis points for the fourth quarter of 2022, reflecting a decline over the past year that was more moderate compared to prior years and consistent with our previously stated expectations, as the composition of our insured portfolio continued to shift to more recent vintages. In addition to the positive impact on persistency rates, another benefit from the rising interest rate environment has been a notable increase in our investment income to $59 million in the fourth quarter of 2022 compared to $37 million in the fourth quarter of 2021. As Rick noted, the industry wide decline in mortgage and real estate transactions also negatively impacted our Homegenius segment revenues, which totaled $19 million for the fourth quarter of 2022 compared to $25 million for the third quarter of 2022 and $45 million for the fourth quarter of 2021. As noted on webcast Slide 16 and consistent with the direction in recent quarters, we had a net benefit of $44 million in our mortgage provision for losses for the fourth quarter of 2022 due to favorable prior period reserve development. Our other operating expenses were elevated in the fourth quarter of 2022 due primarily to two items; $15 million in impairment of long lived assets and other nonoperating items, primarily from impairments to lease related assets, as well as $12 million in total severance and related charges. Once this merger was completed, the Pennsylvania Insurance Department approved a $282 million return of capital and a $100 million early repayment of an outstanding surplus note from Radian Guaranty to Radian Group, and both were paid at the end of 2022. As a result of the favorable impact of these capital actions as well as our outstanding financial results discussed earlier, Radian Guaranty ended 2022 with a positive unassigned funds balance of $258 million as shown on webcast Slide 22. While we are mindful of the risks and uncertainties in the broader macroeconomic environment, we believe we are well positioned to deliver meaningful value to our customers, policyholders and stockholders, given the expected future cash flows from our in force Mortgage Insurance portfolio, the level of risk distribution we have in place and the current financial strength and flexibility at both our holding company and Radian Guaranty."
}