{
    "symbol": "DIS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-10 19:37:05",
    "content": " We had an excellent quarter powered by world-class storytelling, outstanding performance at our domestic theme parks, increases in live sports viewership across our linear channels and ESPN+ and significant subscriber growth at our streaming services which added 15.5 million subscriptions in the quarter, including 14.4 million Disney+ subscribers, of which 6 million were core Disney+ and 8 million were Hotstar. Speaking of Disney+, which is now available in 155 markets after recently launching in 53 new territories, we released content with appeal across demographic groups including Obi-wan Kenobi and Ms. Marvel, as well as feature films like Disney's Chip n' Dale: Rescue Rangers and Disney Nature's: Polar Bear. For example, in addition to driving engagement amongst tens of millions of existing Marvel fans, we have seen each new Disney+ original Marvel series, attract incremental viewership and new subscribers that hadn't previously engaged with Marvel content on the service, thanks to the episodic format that enables us to explore new characters and genres. Looking ahead Q4, will feature a fantastic Disney+ content slate, with the steady flow of key releases including Marvel's, She-Hulk, Attorney at Law, Lucas Films' Andor and Disney's Hocus Pocus 2 and we look forward to celebrating the second annual Disney+ Day on September 8 with activations across our synergy machine. At Parks, Experiences and Products, third quarter revenues increased by more than $3 billion and operating income increased by $1.8 billion versus the prior year reflecting improvements across both domestic and international parks and experiences. At the Media and Entertainment Distribution segment, third quarter revenues increased by over $1.4 billion versus the prior year, and operating income decreased by $645 million, as an increase at linear networks was more than offset by declines at direct-to-consumer and content sales licensing and other. At Direct-to-Consumer, lower operating results across Disney+, Hulu and ESPN+, reflect increased programming and production costs, in line with the guidance we gave last quarter, as we continue to strategically invest in our streaming businesses. Strong Disney+ core net subscriber additions of six million reflect growth in existing markets as well as launches in over 50 new markets during the quarter, and we currently expect Disney+ core net additions in the fourth quarter to accelerate modestly versus Q3 and particularly in the domestic market. At content sales, licensing and other, operating results decreased in line with our expectations by about $160 million versus the prior year quarter, reflecting an unfavorable foreign exchange impact and lower TV, SVOD and home entertainment distribution results, partially offset by higher stage play and theatrical results. As we continue to scale back on third party content licensing, we believe content sales, licensing and other results will continue to face headwinds and expect fourth quarter operating results will decrease versus the prior year by close to $100 million. Excluding the impact of any significant future macro headwinds, our core Disney+ subscriber target range is 135 million to 165 million by the end of fiscal 2024, largely consistent with previously provided guidance that non-Hotstar Disney+ subscribers in 2024 would approximate 60% to 70% of the expected 230 million to 260 million total subscriber base. As we sit here today, we remain confident that Disney+ will achieve profitability in fiscal 2024 and look forward to several upcoming catalysts including reaching a steady state of tentpole original content releases, delivery of premium general entertainment and international local originals and the upcoming launch of our ad-supported tier alongside the new pricing structure announced earlier today."
}