{
    "symbol": "DIS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-08 20:34:14",
    "content": " That expectation is based on three factors: first, the benefit of both price increases and the launch of the Disney+ ad tier next month; second, a realignment of our cost, including meaningful rationalization of our marketing spend; and third, leveraging our learnings and experience in direct-to-consumer to optimize our content slate and distribution approach to deliver a steady state of high-impact releases that efficiently drive engagement and subscriber acquisition. Operating income in the fourth quarter decreased by $864 million versus the prior year as a modest increase at linear networks was more than offset by wider losses at direct-to-consumer and to a lesser extent, at content, sales, licensing and other. International channels operating income decreased by $25 million in the fourth quarter versus the prior year, reflecting lower results from our ongoing channels and operation partially offset by a benefit from channel closures. Core Disney+ added over 9 million subs in Q4, accelerating as expected versus the $6 million net adds we saw in the third quarter, reflecting the success of Disney+ Day and our Tempo content releases in addition to continued growth from third quarter market launches. In the first quarter of fiscal 2023, we expect direct-to-consumer operating results to improve by at least $200 million versus the fourth quarter of fiscal 2022, with larger improvement expected in Q2, reflecting a couple of key factors. Iâ\u0080\u0099ll note that our Direct-to-Consumer expectations are built on certain assumptions around subscriber additions based on the attractiveness of our future content, churn expectations for our upcoming price increases, the financial impact of the Disney+ ad tier and price increases and our ability to quickly execute on cost rationalization while preserving revenue, all of which, while based on extensive internal analysis as well as recent experience provides a layer of uncertainty in our outlook. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Forward-looking statements are subject to a number of risks and uncertainties, and actual results may differ materially from the results expressed or implied in light of a variety of factors, including economics or industry factors or execution risks, including the connection with our DTC business plans relating to content creation and future subscriber growth churn, financial impact of Disney+ ad tier and our new pricing model and cost rationalization."
}