{
    "symbol": "EXPE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 21:01:10",
    "content": " Good afternoon, and welcome to Expedia Groupâ\u0080\u0099s earnings call for the third quarter of 2022 that ended September 30. As always, some of the statements made on todayâ\u0080\u0099s call are forward-looking, typically preceded by words such as we plan, we expect, we believe, we anticipate, we are optimistic or confident that or similar statements. Before we get started with the update on the quarter, Iâ\u0080\u0099d like to formally welcome our new CFO, Julie Whalen to her first earnings call. Iâ\u0080\u0099m excited to add Julie to our leadership team during 10 years as CFO at Williams-Sonoma, she helped drive significant growth in the business and in shareholder returns. We delivered our highest ever quarterly revenue and adjusted EBITDA, the ladder exceeding $1 billion for the first time in our history. This quarter, we also further delevered our balance sheet, which put us in a position to resume buying back our stock, which we continue to believe is highly undervalued. Going forward, we expect to continue to reduce leverage and return capital to our shareholders. As weâ\u0080\u0099ve discussed before, our goal is to use great product innovation and unmatched membership benefits to drive more engagement with our customers and ultimately higher lifetime value from those customers. And the two biggest drivers of lifetime value are improving loyalty, membership and app usage. And the rollout of our unified loyalty program, one key is on track for next year, which will be a big catalyst for continued membership growth. And as a reminder, this spend includes direct marketing, but also discounting and loyalty spend, which are recorded as contra-revenues. In terms of our marketing mix, we have been shifting towards longer term channels including app downloads and other methods to capture traveler intent outside of classic performance channels. These longer term marketing investments, including loyalty and brand, are helping us build a larger base of long-term high value customers. Among our recent successes, we have introduced exciting new products features including price tracking, trip boards, and smart shopping, all of which are designed to engage customers, to inform customers and to ensure theyâ\u0080\u0099re finding the right product at the right time, at the right price. So just to remind you, our flight â\u0080\u0093 excuse me, our flight price tracking feature, which we launched earlier this year, has been a great engagement tool. Since launch, we have seen exceptionally high notification open rates, which demonstrate the value that our customers see in this tool. In Q3, we launch Trip Boards on brand Expedia where users can save their favorite lodging and activities and share and collaborate on trip details. This feature not only increased conversion, but has helped us expand our base of customers through sharing with family and friends. In the first two months, since its broader launch, we saw trip board users have twice the repeat visit rate, they were twice as likely to purchase multiple products, and most importantly, they transacted at four times the conversion rate versus non-users. This has led to better consumer outcomes, more premium product sales for our partners, and ultimately higher value transactions for us. In addition to these new features during Q3, we finished the migration of the Hotels.com front end onto the Expedia platform, which allowed us to accelerate our optimization programs across our entire conventional lodging portfolio. While we are just getting started, the ability to test and deploy faster across one platform is already driving higher customer conversion, better customer experience, and improved signups to our loyalty program. So overall, weâ\u0080\u0099ve seen a great reception from customers on these new features and benefits. And for us it has led to increased engagement, better conversion, and higher revenue per customer. Everything we are doing on the main technology stack for our B2C products will have benefits that inure to the B2B business, as well as a ton of work we are doing specific to the B2B business that will lead to new products, new partners, and new revenue streams. As excited as we are about the momentum in our existing business, we continue to build, pilot, and deploy new products and services for our open world platform. This quarter we signed the first pilot partner for our best-in-class fraud prevention product, and next year we plan to continue to deliver more new commercial products and services. So to sum it all up, we delivered another record quarter of results, rolled out more products, features and member benefits, and continue to add significantly to our member base and our app usage. So all in all, weâ\u0080\u0099re feeling really good about our progress, not least of all because of the phenomenal team of people weâ\u0080\u0099ve assembled to drive all of our acceleration. So, Iâ\u0080\u0099ve had the opportunity to develop a great deal of respect and admiration for the leadership team and the growth strategy that the company is executing against. As it relates specifically to the third quarter, we are pleased to see the continued momentum in our business. Resulting in revenue and profitability to levels we havenâ\u0080\u0099t seen before, which clearly speaks to the early success we are seeing with our initiatives to drive long-term profitable growth. As far as the details regarding our financial performance for the quarter, similar to previous earnings calls, I will discuss our revenue related and adjusted EBITDA growth metrics, both on a reported and like-for-like basis. And as a reminder, on November 1, 2021, we completed the sale of a Egencia and our EPS business entered into a 10-year lodging supply agreement with Amex GBT. However, since early July, we saw trends meaningfully improved, primarily driven by lodging bookings growth, our largest line of business with continued ADR strength. Total lodging gross bookings, which were the highest Q3 on record grew 5% on a reported basis and grew 7% on a like-for-like basis versus Q3 2019. Lodging gross bookings on a reported basis was down 1% in July and the rest of the quarter rebound itâ\u0080\u0099s up 9% in August and up 6% in September, which was impacted by Hurricane Ian. Overall, we are pleased to see strong demand extended to the fourth quarter as consumers continue to prioritize travel spend over other discretionary spending. And while it is still early in the quarter, we are seeing total lodging bookings for stays expected to occur in the balance of the year and into 2023 continuing to outage 2019 levels. This revenue strength resulted from a mixed shift towards our lodging business, including our higher ADR Vrbo business. Cost of sales in the third quarter was $451 million, which was down 17% versus 2019, driven by cost reductions, primarily resulting from our investiture of Egencia and from ongoing efficiency across our customer support operations resulting from the automation initiatives we have been implementing over the past couple of years. Direct sales and marketing expense in the third quarter was $1.5 billion, which was up 8% versus 2019, which includes spend with a longer term return profile to drive more profitable future growth. As a reminder, we are focused on acquiring high lifetime value customers. As a result, we are allocating more marketing dollars on channels that have a longer term return profile, such as brand awareness, loyalty and paid app installs, which as Peter mentioned, are already beginning to drive growth in loyalty members and app usage. Our sales and marketing expense is also impacted by an increase in commissions paid to our partners, which is a direct reflection of the accelerating growth we continue to see in our core B2B business. Overhead expenses were $569 million, down $144 million or 20% versus the third quarter 2019. Overhead expenses slightly increased from the second quarter, approximately $19 million or 3%, primarily associated with our ongoing focus on investing in top talent across our product and technology teams to help accelerate our various platform initiatives, which we believe will ultimately drive future top-line growth and margin expansion. Free cash flow, with negative $1.2 billion in the third quarter and over $200 million improvement over prior year due to higher EBITDA levels. As a reminder, the third quarter is a negative free cash flow quarter due to the seasonality of the business. Year-to-date, our free cash flow remains strong and a positive $3.1 billion more than double where we were year-to-date in 2019. On the balance sheet, we ended the quarter with strong liquidity, a $7.1 billion from both our unrestricted cash and our undrawn revolving line of credit, which provides us with ample access to cash to operate the business. This quarter, we continue to focus on delevering our balance sheet, improving our leverage ratios, and solidifying our investment grade rating. As a result in September, we redeemed an additional $500 million of our senior notes as part of a tender offer resulting in a total repayment of debt and preferred equity of $3.4 billion over the last 18 months. These balance sheet actions, along with our significant growth in adjusted EBITDA has enabled us the additional flexibility to begin returning capital to shareholders again. As we move forward, given our strong liquidity, our confidence in the business, and the fact our stock continues to be highly undervalued, we expect to further delever the balance sheet and continue returning capital shareholders the form of share buybacks. In summary, our third quarter results demonstrate some of the early wins we are starting to see from the transformation of the business and the success of our strategic growth initiatives. Your line is open. First, in terms of the broader end demand environment, I think there continues to be a lot of investor questions about levels of ADRs as you look out through the December quarter and into next year, or elements of how youâ\u0080\u0099re thinking about the booking windows more broadly. And any sense you can give us of the way youâ\u0080\u0099re thinking about what you see in the business today against elements of potentially more volatile macroeconomic environment as we moved into next year, thatâ\u0080\u0099d be number one. We still see pacingâ\u0080\u0099s for the rest of this year and next year, considerably above where we were in 2019. So, I think, thereâ\u0080\u0099s a lot we all think about and watch the NBC or whatever, but so far thereâ\u0080\u0099s really no evidence to suggest thereâ\u0080\u0099s some bigger macroeconomic thing happening. And as far as capital allocation, I would just say that first of all weâ\u0080\u0099re, pleased that weâ\u0080\u0099re in a much stronger position that weâ\u0080\u0099ve been in the past. Weâ\u0080\u0099ve seen improving profitability, obviously I mentioned that we, at record levels of EBITDA, this has enabled us to generate strong cash flow, strong free cash flow. Itâ\u0080\u0099s enabled us to delever more in the balance sheet and resume our share buyback program, which weâ\u0080\u0099ve stopped for a little bit. And so going forward, given the strength in our position certainly this enables us to continue to delever and buy back more stock, which we think is the right thing to do, certainly by, delevering on the balance sheet, it in four, fives our investment grade rating and gives us more flexibility to be able to return more to shareholders, which we think is the right thing to do. Certainly given the fact that we are very confident in the future growth of our business, that our stock is highly undervalued, that we have strong liquidity and we have 21 million shares remaining on our existing share purchase authorization to do buyback. So obviously with that in mind, we think itâ\u0080\u0099s the right thing to do going forward. Your line is open. So on the expense side; I would say, Julie mentioned weâ\u0080\u0099ve been trying to hold the line pretty clearly. Obviously thereâ\u0080\u0099s been inflation over the last few years, particularly in people. And weâ\u0080\u0099ve certainly invested in people to build all the technology that we want, et cetera. So, we will keep a pretty tight hand on fixed expenses going into next year. And again, as technology delivers, we think thereâ\u0080\u0099s lots of opportunity to continue to become more efficient. So, we are pushing hard to get across the line on a number of technology fronts. So, weâ\u0080\u0099ll hold the line, but we expect longer term, more efficiency coming out of the business. Obviously putting hurricane aside, which this lodges people and things like that, itâ\u0080\u0099s really been a very steady, very strong demand picture. As you know, weâ\u0080\u0099ve been differently selective about the traffic and the consumers weâ\u0080\u0099re looking to get and how weâ\u0080\u0099re building them up into long-term valuable customers. And as I said that the pacingâ\u0080\u0099s for next year are strong, so a lot to still be filled in next year, but so far we havenâ\u0080\u0099t seen any of it. Your line is open. We continue to see that deleverage a little bit, say quarter-on-quarter and versus 2019 as a percentage of bookings, getting your investments in longer dated ROI initiatives. So, I think the answer to that is, we are already seeing benefit, but we are also investing more benefit back into long-term ROI. But as we believe that as we build that base of customers, as I mentioned, our membership base is now high â\u0080\u0093 our active membership base is now higher than itâ\u0080\u0099s ever been and growing faster than it ever has. Our app usage, likewise and that all gives us the ability to build more direct traffic, which gives us the ability to invest in driving more direct traffic. Now, those lines will start to separate over time, and we will get, we believe the margin expansion and the incremental leverage. So itâ\u0080\u0099s really a transition weâ\u0080\u0099re going through and we think that separation will come, but we are continuing and weâ\u0080\u0099ll continue in the fourth quarter to invest in these longer dated return opportunities like apps, et cetera. So, we think weâ\u0080\u0099ll continue to see that. We think weâ\u0080\u0099re already seeing it, but itâ\u0080\u0099s hard to see from the outside. And then as to your question on more broadly, how that affects us, I guess going forward, I think we will watch that, we will put the money back in, but we expect to see expanding leverage in this as we go forward. I would just add that we have the loyalty program, one key rolling out next year that would expand loyalty to many customers who werenâ\u0080\u0099t in the program before. We think thatâ\u0080\u0099s going to drive a lot of business, but it will again, drive a little bit of noise as you â\u0080\u0093 as we try to help you figure out where the leverage is. So just fair warning like, itâ\u0080\u0099s a great opportunity, but in terms of like this linear road, itâ\u0080\u0099s going to be a little bumpy as we roll some of these things out and weâ\u0080\u0099ll help you understand those as we go. Your line is open. On the, when we think about LTV, itâ\u0080\u0099s over a longer horizon. So weâ\u0080\u0099re not, and, as you all know, travel for many peopleâ\u0080\u0099s not a, five times a year kind of thing. So it does take a little longer, as Iâ\u0080\u0099ve mentioned before, for some of these LTV investments to return. But thatâ\u0080\u0099s how we think about that timeline is, weâ\u0080\u0099re sort of normalizing it over more like an 18 month to 24 month period as opposed to six months or something like that. And thatâ\u0080\u0099s really the tradeoffs youâ\u0080\u0099re making in many cases, is buying that very short term intent, perhaps unprofitably versus buying long-term intent and long-term LTV, but it takes longer to pay out. Itâ\u0080\u0099s not everything, obviously, but we have directed money that used to be in that short-term intent bucket into these longer term buckets. Itâ\u0080\u0099s why we didnâ\u0080\u0099t pivot at all at once, because it takes time to build those customer bases that are those high LTV customer, customer bases that are then paying out at higher levels than the short term intent that we used to buy. And we think, weâ\u0080\u0099ve settled in a place that will be, very good for the customers. Theyâ\u0080\u0099re gaining flexibility, theyâ\u0080\u0099re gaining the opportunity to use the value on all our products, which is highly valuable and we know they want it. And yes, we will have more customers in that base, so we would expect that base to grow over time. But the short-term movements will be sort of the movement between putting Vrbo customers into the pace, changing the some of the platforms like the Hotels.com platform, the stamps platform into a points platform and so forth. And so thereâ\u0080\u0099ll be some short-term puts and takes, but over time itâ\u0080\u0099s something we think will grow at a rational level. But itâ\u0080\u0099s going to, weâ\u0080\u0099re going to retake that capital, deploy it better across our entire customer base, and then hopefully if itâ\u0080\u0099s successful, which we believe it will be, it will continue to build on itself and more people will join and we think the economics of that are very attractive. Your line is open. We are â\u0080\u0093 we have a pretty good base of business in South Florida, and hurricane did some damage, which  with our, September and October report results. But and we think by now most of that, itâ\u0080\u0099s never a 100% will get replaced into other properties and other spots so that, thereâ\u0080\u0099s a little bit of overhang from losing that supply for a little bit of time. But in general, weâ\u0080\u0099re pushing much harder into growing supply. Now, again we are seeing ADRs hold up and so far, the business broadly remains strong. Again, you will see pockets of change as the world evolves as certain, as APAC opens up versus, maybe we all worry about EMEAâ\u0080\u0099s economy or something like. But broadly, we have not seen anything that is affecting the overall business. Your line is open. Just thinking back to the last time we saw this in 2011 and 2012, scaling up Expediaâ\u0080\u0099s loyalty program and globally expanding the Hotels.com program, it did seem to drive a headwind to revenue take rate. And so with Vrbo not having a program prior to this, it would seem like it could be a take rate headwind in 2023. I think the way we think about it is weâ\u0080\u0099re going to balance â\u0080\u0093 we think of our portfolio of tools, including loyalty, regular way marketing, this discounting and other tools we use to drive sales. So there is a little noise potentially, as you point out, between take rate, which is the contra revenue stuff above the line versus conventional sales and marketing below the line. But from our perspective, we look at it as one pool of capital, and we are trying to balance the investment and driving that long term. Now itâ\u0080\u0099s not instantaneous as you point out, itâ\u0080\u0099s not like spending on Meta. But we think thatâ\u0080\u0099s a big benefit in terms of expanding our base of customers, expanding our direct traffic, et cetera. So yes, there will be some â\u0080\u0093 there may be some, I guess, I would say, across the P&L., there may be some movement top to bottom is a little more moves into loyalty perhaps when something gets taken out in some of the perhaps direct S&M spend, but we are looking to balance that whole thing. And as we get closer to it, we will give you insight into how to think about looking at the P&L going forward. There may be some balance sheet adjustments for accruals and other things, noise like that. But in terms of driving the real P&L and real cash flow, we think weâ\u0080\u0099ve got enough things to offset it and some other opportunities to expand margins at Vrbo that we can pretty much absorb it and chew it up in other places and again, manage that balance as we go forward of driving these long-term investments as against the short-term loans. I donâ\u0080\u0099t know if thatâ\u0080\u0099s one of the ideas, but curious anything you could share there. We are thoughtful about how we want to deal with that with â\u0080\u0093 for our host partners and for our consumers, thereâ\u0080\u0099s volume trade-offs for cost when you increase take rates as well. So thereâ\u0080\u0099s a bunch of things to balance, but we are looking at all of those things and have opportunity. Your line is open. And then secondly, I think you just touched briefly in the last question or two on Asia Pacific. To what extent have you â\u0080\u0093 just any color commentary on â\u0080\u0093 I think thatâ\u0080\u0099s sort of the last not shoe to drop, but shoe to rise. I would say to address your first question, some of what we saw in, letâ\u0080\u0099s call it, the middle of the summer, and I talked about some of this on our last quarterly numbers, we had â\u0080\u0093 we were moving platforms. Weâ\u0080\u0099ve seen that normalize and we are â\u0080\u0093 we donâ\u0080\u0099t see, if anything, we think weâ\u0080\u0099re gaining ground, but there hasnâ\u0080\u0099t been a continued erosion. And I think you can see that in the relative growth rates, although again, we are still being more selective about the business we buy and everything else, we are stable and others have seen growth rates decline. And again, we believe that as we continue to build this base of business and base of members, which is largely U.S.-driven given our relative strength in the U.S. that starts to be a repeating underpinning of our business, that drives us up as just buying in meta, the old-fashioned way that the â\u0080\u0093 the ground board took place. So we think weâ\u0080\u0099re setting up quite well for that, and we like our position there. Obviously, we would have liked to not give up some free room nights, but not all room nights are valuable and not all room nights are profitable and we donâ\u0080\u0099t view it as strictly a room night game. So â\u0080\u0093 but weâ\u0080\u0099re setting up well, and we like our position, and that noise has definitely stabilized from when we were doing all the platform transitions. As far as APAC goes, I wish it were a bigger part of our business. We have a very nice B2B business there thatâ\u0080\u0099s been largely stifled by the closed APAC market, so as our B2B â\u0080\u0093 B2C business. And our B2C business, like many parts of the world, is much more internationally driven. So even though there has been some opening; Japan has opened up; somewhat Korea; China, not yet; itâ\u0080\u0099s been more domestic travel than international. I think youâ\u0080\u0099ll probably see some shift if Europe slows down, youâ\u0080\u0099ll see airlift move to APAC, if APAC is opening up and youâ\u0080\u0099ll see opportunities. Obviously, currency will play a role in where people are willing to go and how far their money goes in different regions. Again, we think thatâ\u0080\u0099s probably net good for us being relatively heavy in North America where the dollar is strong. Hopefully, China will open at some point this coming year, and we have a very good relationship with Ctrip and power a lot of their outbound international travel. So I think thereâ\u0080\u0099s opportunity for us, but that is the next shoe to drop. Your line is open. And then it just seems, Peter you mentioned Trip Boards and smart shopping and airfare tracker just this may be stating the obvious. I would segment the last part to say thereâ\u0080\u0099s testing and optimization work, which is ramping up significantly right now and was what was sort of on hiatus in the middle of the year as we were moving Hotels.com. Thatâ\u0080\u0099s now allowed us to be in a new position to roll out innovation winners, et cetera, across a much wider base and to test across a much wider base of our consumers. And then the future part whether itâ\u0080\u0099s trip planning or flight tracking or other things, thatâ\u0080\u0099s really another category thatâ\u0080\u0099s like innovating into new ways of shopping, new ways of sharing and collaborating, and we think thatâ\u0080\u0099s the future of the business. So we really want to differentiate on the product, on the benefits of being a member, including loyalty, but also pricing and packaging and other capabilities. Weâ\u0080\u0099re doing a much better job of it now, but we will do a much, much better job of going into next year. Your line is open. First, Peter, you look at â\u0080\u0093 traditionally, we look at marketing to bookings, and I think youâ\u0080\u0099re kind of arguing we should look at gross profit, which is up since 2019. The point I mentioned about thinking of the whole pool of spend on customers, be it loyalty, direct marketing brand, et cetera. Thatâ\u0080\u0099s how weâ\u0080\u0099re looking at it now, which was not entirely held and looked at before. These are all from our perspective, ways to drive transactions, drive value and weâ\u0080\u0099re looking at that as a complete pool of spend. It has to be a question of how much GP youâ\u0080\u0099re deriving on a given transaction because ultimately, GP is what turns into real margin into a real contribution. So we are â\u0080\u0093 if you use that room was $100 and now $200 or our take was $100 on transaction and now itâ\u0080\u0099s $200, youâ\u0080\u0099re not going to bid the same thing you would bid or invest the same thing you would invest to get a $100 transaction, youâ\u0080\u0099d be willing to invest more to get a $200 transaction. We recognize itâ\u0080\u0099s challenging for the outside world to know what our booked GP is but weâ\u0080\u0099re trying to express to everybody that, that is the â\u0080\u0093 from our perspective, the right way to look at it. But thereâ\u0080\u0099s noise in it because most of us have here and other things floating through the gross booking lines, and it gets a little confusing. And as Iâ\u0080\u0099ve said a couple of times, itâ\u0080\u0099s all for us about balancing this journey into this long-term investment pool without over-indexing to it and giving up too much short-term business but getting there over time because we believe itâ\u0080\u0099s absolutely the right answer to long-term profitable growth with higher margins, et cetera. So thatâ\u0080\u0099s what weâ\u0080\u0099re pushing into, and thatâ\u0080\u0099s that we totally believe in that model. Regarding your margin comment, obviously, that is something weâ\u0080\u0099re very focused on. And if you look even through the third quarter today, weâ\u0080\u0099re at 30% margin, which is over 400 basis points over 2019 levels. But certainly, even as Peter mentioned earlier, weâ\u0080\u0099re all about still maintaining efficiency, maintaining a culture of strong financial discipline. And certainly, thatâ\u0080\u0099s something that I look forward to bringing to the table as well. And certainly, all the things that weâ\u0080\u0099re doing from a strategic growth initiative perspective is all about driving profitable revenue and not just driving revenue at any cost. I mean setting a target is always difficult, because then you set a target we want to be even higher. So, I think at this moment, weâ\u0080\u0099re just focused on growing that margin as fast as we can as a result of all of our strategic initiatives. Your line is open. Peter, I donâ\u0080\u0099t know if you could add any comments on the B2B business and the opportunity there. Where we donâ\u0080\u0099t play a B2C business, we view it as an opportunity to grow, grow our number of partners, grow our wallet share, as I referenced, and of course, grow our product offerings. And weâ\u0080\u0099ve had incremental improvement over the years as weâ\u0080\u0099ve added things like our wholesale business optimized distribution, which is expanding quite well. We donâ\u0080\u0099t announce every one, but itâ\u0080\u0099s a continuing expanding base. So, we think thereâ\u0080\u0099s a lot of benefits in that core business. We will test many other things this coming year, and weâ\u0080\u0099re piloting them with different partners. So that goes to social commerce and other things that have been talked about in other industries, but weâ\u0080\u0099re really in a pretty unique position to do that at scale as we roll out these technical capabilities. Weâ\u0080\u0099ve expanded and improved our partnerships with many of our biggest supply partners through these kind of technological relationships, and weâ\u0080\u0099re feeling quite good about it. Those new products are quite early days, and theyâ\u0080\u0099ve got to get perfected and rolled out and then scaled. And in the meantime, our core business and some of the more recent additions like our wholesale business, et cetera, are expanding quite nicely, and we continue to win business across the globe. And so because of that, I was able to certainly be involved with the management team is here and also to be sort of under the covers, if you will, with the strategic opportunities that they were executing against and certainly, of course, like some of the financials and all of the capital allocation policy and things like that. But really, the strategic initiatives that I was able to see that they were transforming the business. And so I just thought thereâ\u0080\u0099s tremendous opportunity for growth and profitability of this company, and I wanted to be a part of it. As far as changes that could be coming down the way, I mean, first and foremost, Iâ\u0080\u0099m just trying to learn as fast as I can, the details of the company, certainly, as I said, I knew the bigger picture. But certainly, if you look back at my track record, which I mentioned earlier, certainly all about strong financial discipline, driving efficiencies, making sure weâ\u0080\u0099re generating investments with high returns and that we have a capital allocation policy that really favors our shareholders. Your line is open. Youâ\u0080\u0099re making a transition of trying to build a base of customers that actually left your product, have found benefit in your product and will drive longer-term returns. Weâ\u0080\u0099re really invested, as you can probably tell in making the product better, making the benefits better, making people stick and making sure they get the benefit of being with us. And weâ\u0080\u0099re not suggesting we found a perfect balance, but weâ\u0080\u0099re moving across a journey where we think we can get to a place where the core base of long-term valuable customers becomes a new threshold level that youâ\u0080\u0099re building on top of. And we also believe as the product improves and as weâ\u0080\u0099re better at getting people into membership and into experiencing the benefits that those otherwise cheap, less valuable pieces of business that weâ\u0080\u0099ve sort of assure during this period become more valuable to us over time. In other words, weâ\u0080\u0099ll be able to buy letâ\u0080\u0099s say, meta traffic or other kinds of traffic more efficiently because weâ\u0080\u0099re better at keeping them and turning them into long-term customers. Weâ\u0080\u0099re not looking to throw business to the wild and let somebody else get it, but weâ\u0080\u0099re also not willing to just be upside down at any price to buy traffic and pray. So itâ\u0080\u0099s something weâ\u0080\u0099re balancing literally every day, and weâ\u0080\u0099re continuing to balance. And as we continue to build up this huge base of members and reduce churn and include more of them through the broader loyalty plan, we think thatâ\u0080\u0099s going to be incredibly valuable to us. Itâ\u0080\u0099s both driving faster growth, which is getting some of the benefit of the members, et cetera, that weâ\u0080\u0099ve been stacking up low these many months and into next year and having that expansion come to more direct business that we donâ\u0080\u0099t have to pay to get regained. So thatâ\u0080\u0099s where we pay through loyalty, but thatâ\u0080\u0099s a much smaller cost to us. So thatâ\u0080\u0099s a big area of separation, where I think the margin dollars will expand because we wonâ\u0080\u0099t be paying incrementally all the time for the same business. And then I think on the fixed cost side, thereâ\u0080\u0099s all kinds of efforts going on. Weâ\u0080\u0099re still synthesizing our data pools to be more efficient around data, all of those things have knock-on effects and costs in compute time and cloud. Itâ\u0080\u0099s just better technology, more use of machine learning, et cetera. Thereâ\u0080\u0099s no like, oh, by the way, thereâ\u0080\u0099s â\u0080\u0093 I can tell you where $1 billion is hiring, but we spent a ton of money on cloud. So, I think itâ\u0080\u0099s a lot of little things, but it adds up with our base of people and fixed cost, it adds up significantly over time. Weâ\u0080\u0099ve been able to maintain our headcount at a level we feel good about, and we think we can grow massively on top of that without having to add lots of bodies to be able to do it. Your line is open. Peter, I think you mentioned earlier this year, you had pulled back marketing in some of the European countries because you werenâ\u0080\u0099t happy with the ROI. So, I think weâ\u0080\u0099re in a great place for homeowners who want to monetize their assets to come, assuming itâ\u0080\u0099s in places that are interesting to us and where we can drive business. So, I think we set up quite nicely if you believe in that construct that people need to monetize their homes, their assets, their second homes, et cetera. Again, we do â\u0080\u0093 weâ\u0080\u0099re not doing a lot of primary home where people move out of their house and rent it for two days or whatever. And presumably, people are maybe a little less flush with the cost of capital and may want to monetize that. So, I think directionally, itâ\u0080\u0099s positive, but itâ\u0080\u0099s not that quick switch thing, that we see a massive uplift just because rates increase. But weâ\u0080\u0099re pushing into it, and we expect supply to grow meaningfully next year. As far as the marketing question, it goes back really beyond this past year. I mean we saw a lot of pockets where we were overinvested, werenâ\u0080\u0099t getting the return, werenâ\u0080\u0099t getting the long-term return that even made sense of what we were investing to buy traffic in some parts of Europe and other places and we ratcheted that back. We found this, as I mentioned, as we keep rebalancing, sometimes weâ\u0080\u0099re finding opportunity to push back in some of those places. So itâ\u0080\u0099s not â\u0080\u0093 itâ\u0080\u0099s not like thereâ\u0080\u0099s a line  in the sand, and we got to it and weâ\u0080\u0099re staying there, like we pulled back and then we saw opportunity. But I think broadly, at the heart of your question, which is right, we want to be lined up with all the right product capabilities to go after a market fully. But I think as we get into next year, we will have a much clearer idea of where youâ\u0080\u0099ll see us take some more aggressive action in certain markets where they think thereâ\u0080\u0099s opportunity. Of course, thereâ\u0080\u0099s some macroeconomic noise to watch out for there because there may be markets we want to get aggressive in that may have economic challenges. And when we have like our full suite of weapons, weâ\u0080\u0099re going to go at these markets one by one and try to win."
}