{
    "symbol": "EXPE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 21:17:08",
    "content": " In the fourth quarter of 22 versus 2019, Expedia US grew new customers that became loyalty members by over 300% and entered 2023 with nearly 70% more active loyalty members than any prior year, and almost 60% more active app users. It is also important to note that our fourth quarter 2022 growth rates as compared to 2019 were negatively impacted by FX headwinds of approximately 250 basis points to gross bookings, 400 basis points to revenue, and 800 basis points to adjusted EBITDA or 70 basis points to our adjusted EBITDA margin. Total revenue margin also improved to 13% for the quarter, or up approximately 90 basis points versus Q4 2019 as we continue to benefit from a mix shift towards our higher margin lodging business, which as a percentage of the total has grown approximately 1,000 basis points over the same period. Cost of sales was $408 million for the quarter, which is a cost reduction of $125 million or 24% and 380 basis points of leverage as a percentage of revenue versus 2019, driven by our divestitures and ongoing efficiencies primarily across our customer support operations. So really the fact that we're holding that ex all the storms and the noise that we've been talking to you guys about, and it's been accelerated in the fourth quarter, and we're seeing a step change as we enter into 2023, as well as with our Bex US business, we think that's a really good sign that we've got some strength ahead for this year. And I think when you look at things like the types of customers, the high lifetime value customers that we are getting and are getting significantly more in brand Expedia US business and we're seeing that translate into really strong revenue, it's a pretty exciting time to see this all come to fruition. And I think in terms of what we're capable of as a company, I would say that's less than halfway home because as we get more and more of the whole back end of the stack aligned, as we get our test environment all aligned, we have lots of opportunity to go faster. And we think as we're starting to demonstrate when we're getting these lifetime value customers that we can get more efficient, as we have started to do on the year with our marketing spend, and we're deriving the top line to levels that we're seeing has accelerated through the Q4 and coming in even stronger in 2023, all of that should be bode well for us to be able to drive profitability and EBITDA."
}