{
    "symbol": "EXPE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 20:30:29",
    "content": " To be clear, we have been evolving our consumer approach from being largely transactionally focused, where we and the industry spent virtually all of our time, tuning our products for maximum arbitrage and performance marketing channels and spending more and more money on intermediaries, to a future where we build longer-lasting direct relationships with loyal high-lifetime value customers. As that loyalty plan reaches everybody, as we have one identity for every customer we are going to get better and better at understanding LTV and understand each customers' performance and that's going to allow us to get a lot sharper on how we acquire traffic and who we acquire. I think, there's lots of tools we have already to drive LTV, but we're going to have many more and a better understanding of how to buy the right kinds of customers out of the market as time passes. And again, just for everyone clarification, it's essentially taking out Egencia, the Chase non-lodging components and then also the lodging service agreement that we have with Amex GBT, so that it gives you a sense \"for our core business\" and what the trends look like given the puts and takes that we've had given the changes that we've made over the last few years. And then two is, the profile of the travelers and customers that we're acquiring because of a mix shift of marketing into longer-term relationships such as brand marketing or creative, as I mentioned and then also app downloads that we're essentially building cohorts over time that have a higher lifetime value, but also can take longer to hit the P&L if you will. So to be specific, and I don't want to underwrite our instruments, but our goal is true granular understanding of every customer's lifetime value, and the difference of where those customers emanate from and what actions they take that indicate and drive, higher lifetime value. So every time we make that better, we see more opportunity then to drive into okay, now we can acquire this set of customers and they'll perform better, because we can get them into these high lifetime value activities and then we get more value -- drive more value out of them long term. One quick thing to add as well which is not necessarily your question but I think it might be helpful to you all which is just around -- we didn't spend a lot of time in this call on constant currencies or FX impacts to our P&L just given our weighting to the U.S. market to your question, but if we did adjust on a constant currency basis as compared to 2021 our EBITDA would have been 4% higher in Q2."
}