{
    "symbol": "AES",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 15:40:30",
    "content": " But since then, it has become even more apparent how it is likely to greatly accelerate the demand for renewables and stand-alone storage in the U.S. We are very well positioned to capitalize on this demand and growth through our market leadership in renewables, particularly in the C&I segment due to our strong customer relationship, our ownership interest influence and our extensive and growing pipeline. I'm pleased to share that our third quarter results are very strong, and we now expect to be at or near the high end of our full year 2022 adjusted EPS guidance range of $1.55 to $1.65. To address this growth in demand, we have increased our pipeline to 64 gigawatts, including 51 gigawatts in the U.S. and year-to-date, we have signed 3.2 gigawatts of renewables and energy storage under long-term contracts, and we are in late-stage discussions on several more that we expect will bring us within our full year range of 4.5 to 5.5 gigawatts. The other thing we wanted to point out is just if we look at the U.S. and utilities business unit, the fourth quarter, the skew towards the fourth quarter is, in large part, driven by the fact that we are commissioning more projects typically in the fourth quarter, more renewables projects and the tax credit recognition for the investment tax credit is tied to the commissioning. We have doubled the amount of people that we have working on construction in renewables in the U.S. We have been working with strategic EPC contractors, meaning that we can give them not sort of just project by project, but really a line of sight, how much work they're going to get over the next 2 years, so they're able to staff up. But the credits are an important part of how it's monetized and wanted to show that given the IRA and also given how the U.S. Utilities SBU seasonality is becoming more shaped by the renewables, the clean energy business in the U.S. but it's important for everyone to understand what that looks like for modeling purposes."
}