{
    "symbol": "WCN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 15:59:23",
    "content": " Acquisition activity during the year also outpaced expectations for a total of approximately $640 million in acquired annualized revenues, which along with activity year-to-date, already provides acquisition contribution of 5% in 2023 with additional dialogue ongoing. Thank you, Mary Anne. As noted earlier, we're extremely pleased with our strong operating and financial performance in Q4 and throughout '22 as we overcame elevated wage, fuel and inflationary pressures and a 70% drop in recycled commodity values to drive adjusted EBITDA margin expansion, excluding acquisitions in the year. Moreover, given the acceleration of pricing during the year, the lagging benefit of higher CPI resets and a strong start to the New Year were already set up for pricing to increase sequentially by about a 100 basis points from the fourth quarter to 11.5% in Q1 and to average about 9.5% in 2023, essentially all in core price. We delivered adjusted free cash flow of $1.165 billion in 2022, up over 15% year-over-year on CapEx of $913 million up 23% year-over-year, reflecting a purposeful step up in CapEx during the year for opportunistic real estate purchases. Since year end, we've closed another integrated West Coast franchise with over $35 million in annualized revenue, which along with the rollover contribution from deals completed in 2022 already provides for 2023 acquisition contribution of over 5%. In 2022, we returned $668 million to shareholders through dividends and opportunistic share repurchases, up nearly 20% from the prior year and we invested over $3.2 billion in CapEx and acquisitions for future growth. Adjusted EBITDA for Q4 is reconciled in our earnings release was $564 million up 13.8% year-over-year, and about $11 million above our outlook, driving adjusted EBITDA margin of 30.2%, a 20 basis point beat to our outlook. For solid waste, we expect pricing of about 9.5%, essentially all core and volumes in the range of flat to down 1%, plus about $360 million of estimated revenue in 2023 from acquisitions already completed and E&P waste activity and values for recovered commodities assumed in line with recent levels. Adjusted EBITDA 2023 as reconciled in our earnings release is expected to be approximately $2.5 billion for about 31.1% of revenue, up 30 basis points year-over-year in the face of approximately 100 basis points in headwinds from recycled commodity and RIN values. To be clear, our outlook does not assume any improvement in recycled commodity values from earlier this year, which for instance, would add $10 million in annual revenue for every 10% move in price levels, or in RIN values, which would add approximately $5 million in annual revenue for every 10% move-in price levels, both of which with very high flow through. Adjusted free cash flow in 2023 as reconciled in our earnings release is expected at $1.225 billion on CapEx of $925 million, including $50 million in delayed fleet delivery in the prior year as noted earlier. Adjusted EBITDA in Q1 is estimated at approximately 30% of revenue, or $568 million in what sets up as the toughest quarterly comparison in 2023 for recycled commodities and RINs. Thank you, Mary Anne. So just looks like, with the first quarter outlook you're setting up to be exiting the year with margins up, call it 80 basis points year over year in the fourth quarter and seasonally adjusted margin rate that's closer to 31.5%. And that's when, if you start layering on the contribution of the renewable fuel plants by '26, that additional $200 million or so structurally move the free cash flow generation to revenue by '26 to about 17.5% of revenue. I mean you look at -- first off, on the CapEx side, again, you've got almost 100 basis points of revenue or 1% of revenue from sustainability projects in the current year and next year. But again, as the RNG starts kicking in, as we're getting, as we said before, about $200 million of incremental EBITDA by 2026, the tax effect that that's putting another 1.4%, 1.5% by then cash flow generation as a percentage of revenue. But look, I think more about revenue and if we are -- if we did, what, about $100 million or so of landfill gas and RINs revenue last year, and we stepped that up to $300 million or so by '26, we're going -- and by the end, the company, obviously, will be bigger than the $8 billion we're guiding to now. I mean if we just -- if an average year is $150 million and, let's say, we do $150 million to $200 million of acquired revenue this year, that's probably us spending about $0.5 billion."
}