{
    "symbol": "RM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 20:03:13",
    "content": " Thanks to the success of our strategic growth initiatives, we generated record first quarter originations of $326 million, up 39% from the prior-year period, and we grew our net finance receivables to an all-time high of $1.45 billion. We originated $40 million of digitally sourced loans in the first quarter, up 150% from the prior-year period. In the second quarter, in light of the continued strong demand in the market, we expect that our growth will accelerate, driving our finance receivables portfolio to around $1.525 billion by the end of the quarter and creating healthy sequential revenue growth in the third and fourth quarters. Our average receivables per branch were at an all-time high of $4.1 million at the end of the first quarter, an increase of 58% from $2.6 million at the end of the first quarter of 2019. In the second quarter, we expect total revenue yield to be approximately 40 basis points lower than the first quarter and our interest and fee yield to be approximately 30 basis points lower due to the continued mix shift to large loans and credit normalization. Our net credit loss rate in the first quarter came in better than we expected at 8.7%, up 100 basis points from the prior-year period but still 200 basis points better than the first quarter of 2019. Compared to the first quarter of 2021, when we released $10.4 million in reserves on $31 million of sequential portfolio liquidation, In the first quarter of this year, we released only $0.5 million in reserves on $20 million in sequential portfolio growth, reducing our pretax income by $9.9 million year-over-year. Our G&A expense for the first quarter were $55 million, and our operating expense ratio was 15.4%, a 90 basis point improvement from the prior-year period. G&A expenses for the first quarter included approximately $0.4 million of expenses associated with the branch optimization actions that Rob discussed earlier, which impacted our operating expense ratio by 20 basis points. The expected year-over-year increase in interest expense in the second quarter is primarily attributable to the growth in our average net finance receivables, offset partially by the $1.1 million gain on the sold caps. But the net credit margin of those customers was still relatively good, but there was so much demand coming through in the first quarter, we made a decision from a productivity standpoint, probably first and then a credit standpoint, second, that you would rather take somebody’s work effort because remember, take the digital leads we get, they still get booked today in the branch until we roll out the end-to-end and then we have that opportunity for customers to avoid a branch. So we feel like we’re doing a really good job returning capital to shareholders in addition to the quarterly dividend of $0.30, while still generating enough capital to support what is a very healthy growing business, which this quarter we grew 30% on the portfolio or 31% of the portfolio versus prior year."
}