{
    "symbol": "RM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 21:40:25",
    "content": " As a result of the sale and the acceleration of the net credit losses on the sold accounts from the first quarter to the fourth quarter, our net income was negatively impacted by $2.7 million in the fourth quarter, but net income will be positively impacted by similar map in the first quarter. We ended 2022 with a 30 plus day delinquency rate of 7.1%, only 10 basis points higher than 2019 pre-pandemic levels and our early 1 to 29 day and 30 to 59 day delinquency buckets, monthly roll rates improved sequentially from the third quarter to the fourth quarter by 80 basis points and 120 basis points respectively. Our fourth quarter receivals growth, however, provided us with a higher jump off point for the new year and will generate nearly $30 million of incremental revenue in 2023. As Rob noted, we've intentionally slowed growth in recent quarters, and while our portfolio is up $273 million or 19% year-over-year, much of the annual growth rate is attributable to the strong origination activity early in the year. In the first quarter, we expect delinquencies to improve consistent with normal seasonal trends, and we expect that net credit losses will be approximately $42 million or $20 million lower than the fourth quarter as the first quarter benefit of the loan sale, more than offset the typical seasonal increase in net credit losses. Turning to Page 10, our allowance for credit losses declined slightly in the fourth quarter as the reserve reduction of $11.8 million due to the loan sale, more than offset a reserve build of $9.1 million due to portfolio growth and $1.7 million of additional macro related reserves. As we enter the new year, we feel good about having put a portion of our stress loans behind us starting year with 30 day delinquencies, nearly flat to pre pandemic levels and observing early signs of credit improvement, including lower first payment defaults and lower delinquency, and improved roll rates in our early stage delinquency buckets compared to the third quarter and pre-pandemic levels. It's great that we're entering 2023 with 30-day delinquency, nearly flat to pre-pandemic levels, having -- after having sold the $27 million of distress loans in the quarter and we are seeing early indications of proving credit, as I said in the prepared remarks."
}