{
    "symbol": "RM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 20:41:06",
    "content": " Loans originated through the eliminated affiliate and direct mail segments contributed 30 basis points to our 30-plus day delinquency rates as of September 30, and 60 basis points to our net credit loss rate in the third quarter, despite only representing 1.9% or $31 million of our total portfolio as of quarter-end. While our credit tightening actions slowed our year-over-year receivables growth to 22% in the third quarter, we believe that the trade off between credit and growth is appropriate. Given the uncertainty presented by persistently high inflation and rising interest rates, we prudently increased our allowance for credit losses to 11.2% of net finance receivables at the end of the quarter, including $19 million of macro related reserves. We believe that our investments in improved credit models and collection capabilities years long shift to large and sub-36% loans and recent credit tightening actions have contributed to an overall higher quality portfolio, compared to pre-pandemic levels. There remain millions of job openings for our lower and moderate income customers in their respective industries, along with strong wage growth including 7.3% annual wage growth in the lowest quartile wage earners in the third quarter. We originated a record $56 million of digitally sourced loans in the third quarter, up 17% from the prior year period. Year-over-year, we grew our ending net receivables by 22% in the third quarter, compared to year-over-year growth rate of 31% and 29%, respectively in the first and second quarters of this year. As shown on page seven, our growth initiatives lighter branch footprint strategy in new states and recent branch consolidation actions in legacy states contributed to another strong same-store year-over-year growth rate of 19% in the third quarter. Moving to page nine, our 30-plus day delinquency rate as of quarter end was 7.2%, up 100 basis points sequentially and up 70 basis points, compared to September 30, 2019, inclusive of the 30 basis points of impact from the eliminated Digital Affiliate and Direct Mail segment that Rob discussed earlier. Our net credit loss rate in the third quarter came in at 9.1%, up 100 basis points, compared to the third quarter of 2019, inclusive of the 60 basis points of impact from the eliminated Digital Affiliates and Direct Mail segment. Likewise, we anticipate that fourth quarter net credit losses will be approximately $11.6 million higher than the third quarter, as late stage delinquency buckets flow through to loss, including approximately $2 million of the segments we eliminated. Turning to page 10, we built our allowance for credit losses by $12.3 million in the third quarter, including an incremental $4.1 million in macro-related reserves related to potential future macroeconomic impacts on credit losses. In the fourth quarter, we're expecting to build our base reserves by approximately $7.6 million to support portfolio growth in the quarter and we expect to end the year with a reserve rate of approximately 11.2% subject to macroeconomic conditions. Relative to the guidance we provided on our prior call, G&A expenses came in $1.2 million higher than our expectations, primarily due to one-time restructuring cost of $0.6 million and increased incentive accruals for our 2022 long-term incentive program, which debt based upon our pre-provision net income and EPS performance over a three-year period, compared to our peers. Turning to page 12, our interest rate expense for the third quarter was $11.9 million, better than initially expected due to slower growth in our receivables."
}