{
    "symbol": "OSH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 16:32:06",
    "content": " Capitated revenue in the second quarter of 2022 included a $3.7 million reduction related to prior periods due to the retrospective trend adjustments made by CMS as part of the direct contracting program, which were partially offset by favorable developments in Medicare Advantage. Our cost of care, excluding depreciation and amortization, was $98.9 million for the second quarter, an increase of 48% versus the prior year, driven by growth in the number of centers we operate and the number of team members supporting our significantly larger patient base. Adjusted EBITDA, which we calculate by adding depreciation and amortization, transaction and operating-related costs, onetime litigation costs and stock-based compensation but excluding other income to net loss, was a loss of $53.1 million in the second quarter of 2022 compared to a loss of $53.5 million in the second quarter of 2021. Your line is now open. The way we think about it is how can we bring patients in under kind of our cost per acquisition target and generate a CAC:LTV ratio that we want to generate, which is â\u0080\u0093 I think shared before is kind of north of what you would see in most kind of tech recurring revenue businesses. Your line is now open. This year â\u0080\u0093 I donâ\u0080\u0099t think that weâ\u0080\u0099ve disclosed a number of months, but weâ\u0080\u0099re talking â\u0080\u0093 itâ\u0080\u0099s much lower, obviously, just given where â\u0080\u0093 if you take it ratably you know that weâ\u0080\u0099ve grown our patients a fair bit. On new patient economics, I would say itâ\u0080\u0099s pretty comparable on the COVID side, obviously unrelated, but just from a general direction perspective, kind of in line with the midpoint â\u0080\u0093 as you can tell, given our performance thus far, right, midpoint, the upper half of our range. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And this quarter it was pronounced because of the retro trend adjustment, but I just want to highlight that if folks are doing the math and trying to do some â\u0080\u0093 I think Gary is trying to do some of this â\u0080\u0093 some implied math around direct contracting dollars or impact that it would be larger than just the $3.7 million on space."
}