{
    "symbol": "LEV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 15:07:03",
    "content": " Specifically, we are reducing the amount of total CapEx expected to be insured for the full year in the Joliet plant in 2022 by $35 million from $115 million to $80 million. While there are no changes to the expected CapEx of approximately $100 million to be incurred in total in 2022 for the Lion Campus, we will hear again focus on the battery plant, which will have a significant impact on our short-term revenue and accelerate return on investment. Our PO book amounts to $590 million consisting of 286 trucks and 2,071 buses for a total of 2,357 vehicles substantially all of them being conditional on the grant of subsidies and incentives. The act currently includes over $60 billion to increase domestic production of clean energy and transportation technologies, and $1 billion specifically for clean heavy duty vehicles, including school buses and garbage trucks. In Q2, we delivered 90 buses and 15 trucks for a total of 105 vehicles translating into revenues of $29.5 million for the quarter. First for the Joliet Facility, we expect to incur total CapEx of $80 million in 2022, a $35 million reduction versus the $150 million previously disclosed. For the Lion campus, we continue to expect to incur approximately $100 million of total CapEx in 2022 of which approximately $39 million has been incurred this year as of June 30. As of today, we estimate that approximately $40 million of the CapEx to be incurred in 2022 on the Lion campus will be funded through this government support subject to the related claim process and timing. We have a committed $200 million revolving facility that is borrowing based, I guess and that does today $75 million of that could be issuance â\u0080\u0093 could be borrowed right away to figure that we expect will continue to increase over time. And we expect that as we with the spend that weâ\u0080\u0099re going to do this year, $40 million of that will be unlocked if you will subject to the â\u0080\u0093 obviously the process and the timing to claim that money."
}