{
    "symbol": "SRE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 21:12:16",
    "content": " Sempra California is preparing to submit GRC filings at both SDG&E and SoCalGas later this month, focused on providing safe, reliable and cleaner energy to its 26 million consumers. Turning to Texas, Oncor is executing on its record 5-year capital plan focused on critical T&D infrastructure investments across its service territory to support strong demographic growth and plans to file its rate case later this month. Our strategy of investing in T&D infrastructure to expand and modernize North America's energy systems across each of our 3 growth platforms is continuing to drive our record $36 billion, 5-year capital plan and has helped us deliver another quarter of strong financial results. In the last 6 months, we've returned $750 million of capital to our shareholders in the form of share repurchases, which taken together with our dividend program, demonstrates our commitment to returning value to our owners while remaining focused on investing in and growing our businesses as part of the disciplined capital allocation strategy. Earlier this morning, we reported first quarter 2022 adjusted earnings per share of $2.91. Please turn to the next slide. Please turn to the next slide. Please turn to the next slide. Please turn to the next slide. Sempra California is preparing to submit GRC filings at both SDG&E and SoCalGas later this month, focused on providing safe, reliable and cleaner energy to its 26 million consumers. Turning to Texas, Oncor is executing on its record 5-year capital plan focused on critical T&D infrastructure investments across its service territory to support strong demographic growth and plans to file its rate case later this month. Our strategy of investing in T&D infrastructure to expand and modernize North America's energy systems across each of our 3 growth platforms is continuing to drive our record $36 billion, 5-year capital plan and has helped us deliver another quarter of very strong financial results. Now in the last 6 months, we've returned $750 million of capital to our shareholders in the form of share repurchases, which, taken together with our dividend program, demonstrates our commitment to returning value to our owners while remaining focused on investing in and growing our businesses as part of a disciplined capital allocation strategy. Earlier this morning, we reported first quarter 2022 adjusted earnings per share of $2.91. So as you think about the Clean Energy transition, you think about the GRC programs that are going forward in our company here in California and Texas, there's no question that putting IEnova together with LNG and have -- circling some EBITDA figure of around $2 billion was the right move with an investment-grade balance sheet. Maybe you could walk folks through some of the growth you're seeing on the system because I think your examples would be helpful to people, and then get right to Julien's question about how we think about settlement, which has been the tradition at Oncor as you look at regulatory filings like this."
}