{
    "symbol": "FRC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-14 13:54:05",
    "content": " Despite the interim rate conditions, our long term focus always remains maintaining exceptional credit standards so we can focus on the future rather than the past: operating with strong levels of capital to support franchise growth as we serve existing clients and acquire new ones; steady execution of our simple, straightforward model; and always acting in the best interest of our clients, while consistently delivering extraordinary and differentiated service. And as we look to 2023, the safety and stability of the bank's loan portfolio is absolutely critical and we continue to serve clients each and every day, and that's always been our objective and that has put some pressure on the margin as we talked about in the prepared remarks, because we are growing the loan portfolio and then funding it a little bit differently than we had in the past couple of years given the market forces you talk about, right. As Olga said, we think we're going to be at the lower end of our annual guidance range for this year, right, which means the fourth quarter is going to come in a little bit below that guidance range and that's where you'll sort of start 2023. So you've seen the increase in CDs, but it's still relatively lower â\u0080\u0093 itâ\u0080\u0099s higher than we had over the last few years, but it's still about 9%  and historically was being in mid-teens levels and even if we look at longer term back, it's even higher than this. But it's this period of the rapid rise where you see a little bit of the compression, but you're right, two quarters from now, three quarters from now when they are done, given the nature of the CS portfolio that we've talked about, it is a bit of a short term issue and a short term challenge, because the fed will â\u0080\u0093 they will get to a successful point in this battle and at that point it will get better from there. So, I think I mentioned this before, you know checking at 64% of deposits, which includes both non-interest and a very nominal interest we pay on checking, you know it could trend a little bit lower from here, but we feel like probably not a lot given the working capital needs of our clients. Got it, all right. Got it, all right. You know we're really pleased that in August we were able to raise capital opportunistically like we have done over many years, and you know growing tangible book value per share at 11% continues to support our balance sheet growth and it supports 2023â\u0080\u0099s growth that will be coming as a result of service."
}