{
    "symbol": "FRC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-14 15:57:03",
    "content": " So along the spring buying season that Mike just talked about, deposits are starting to sort of see that same seasonality we've seen in the past, where the first half of the year is a little bit lighter because of the April 15 and June 15 tax dates that, obviously in the pandemic years of '20 and '21 were moved around. We're really excited about and then pleased with the first half of the year results on sort of where we -- frankly, if I go back probably three years ago, we've said we would be in these ranges, and we've continued to deliver quarter after quarter, further demonstrating that consistency and stability. And I think now we're sort of towards the high end on margin and low end on efficiency, and we feel good about that because it allows us to continue serving clients, continue investing in the franchise for future growth and delivering stable, predictable results that are very safe over time. And for Mike R, as we think about rapidly rising rates, I think you had 3.75% for the end of the year, can deposit growth at First Republic continue to be positive, even if, let's say, we actually start seeing more negative deposit growth for the industry, particularly given that your deposit exposure is now more skewed away from the consumer? And if we think about how the business has operated while the Fed has raised, I guess, 150 basis points through June precisely and consistently as we would have hoped or would have expected because we -- again, stability of margins, stability of efficiency while continuing to serve clients and deeper relationships, and we're exactly on point with that. And that's why once they discover the service and the relationship, half the growth rate or more comes from the existing client who likes what they're experiencing and starts to consolidate more of their banking and wealth management with us. On the second part of your question, I would say no because, typically, they're coming from relationships where we're having a new relationship where relationships are being built, and you do a loan and you bring deposits in a portion of that's in checking and some of it may be in money market, but I wouldn't see it as a greater pricing than the current portfolio."
}