{
    "symbol": "POWW",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-15 23:45:04",
    "content": " This increase was a result of approximately $11.2 million of increased sales in bulk pistol and rifle ammunition, an increase of approximately $1.8 million of sales, a Proprietary Ammunition, a decrease of approximately $0.6 million of sales from our casing operations, and an increase of approximately $4.2 million of revenue generated from our marketplace GunBroker.com, which includes auction revenue, payment processing revenue and shipping income. And more specifically, given our recent announcement of the transformational spinoff transaction, guidance for our ammunition segment revenues in the range of $230 million to $240 million, EBITDA in the range of $35 million to $38 million and adjusted EBITDA in the range of $57 million to $60 million and our marketplace segment revenues of $70 million, EBITDA of $47 million and adjusted EBITDA of 51 million. And we think the spinoff is good for the shareholders, because ultimately youâ\u0080\u0099re only â\u0080\u0093 you will end up with shares and two separately traded pop-up companies, one being our manufacturing company, which will be Action Outdoor Sports, and the other being GunBroker.com or will be known in the future as Outdoor Online. And then on the ammunition business and the revenue run rate there, Iâ\u0080\u0099m just curious whatâ\u0080\u0099s holding back production, because it â\u0080\u0093 revenueâ\u0080\u0099s declined pretty drastically from the fourth quarter down $8 million. Again, and you know, from our past conversation in the existing facility with only one door for shipping and receiving, shipping got to be a huge issue and moving to get into your point number two, what we are seeing is we should be totally up and running by the end of the month, which means we think weâ\u0080\u0099ve done a couple of different things, A, weâ\u0080\u0099re here, weâ\u0080\u0099re kind of morphing away a little bit. We do view Outdoor Online as a vehicle to really become, which it already is the destination for Outdoor Sporting goods, but now thatâ\u0080\u0099s with the ability to cart coming online and with the financial service products, adding additional products, I think youâ\u0080\u0099re going to see some incredible margins even increase being able to buy from multiple sellers at one time, as far as individuals the brands, nothing, it could be, thereâ\u0080\u0099s nothing right on the surface that I would say, I want to buy this brand."
}