{
    "symbol": "POWW",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-14 23:16:18",
    "content": " We will continue to expand the capacity Out of our new Wisconsin plant to address the domestic and export demands support our military and move as quickly as possible in improving the GunBroker.com marketplace experience through better customer treatment and leverage revenue drivers, all of which makes its way down to the bottomline for the benefit of our shareholders. At the same time, AMMO and the market expect to see the stabilization of commodity pricing for our new plant comes to measurably increase production capacity from approximately 400 million rounds at the end of our most recent fiscal year to approximately 1 billion rounds and better absorb manufacturing-related expenses, which drive down cost of goods and thus increased gross profit. Also, and as you have probably seen in our public announcements, we are implementing several marketplace enhancements at GunBroker.com, which are designed to drive revenue and gross profit, while significantly improving the userâ\u0080\u0099s overall experience, such as in-house ACH and credit card processing, loyalty programs, data analytics offerings, as well as cartigability on the site. We have now consolidated almost the entirety of manufacturing operations within this new 185,000 square foot facility and through coordinated efforts of management and the Mayorâ\u0080\u0099s office in Manitowoc, we also secured contiguous powder and primary storage that minimizes our costs and allows us to continue to enhance margin through right in time manufacturing and transportation cost reductions. The facility now houses equipment and machinery we have been acquiring over the past couple of years, all of which allows us to strategically and incrementally increase production with the plan to elevate loaded ammunition moving out of the 13 May shipping docks from $400 million to $1 billion, allowing AMMO to further ascend within the global ammunition marketplace among our peers. We have also designed and constructed a state-of-the-art engineering lab and underground range within this new plant that really allows us to remain on top of quality at every level of the production, while also answering the call we now regularly receive from our government and U.S. Military partners to design and manufacture cutting-edge ammunition, the best serves our men and women in near peer conflicts around the globe. So there was -- it seemed like a sort of a quasi paradigm shift that happened within at least our market and our operation within the market as related to the import backfill opportunities versus our international transactional activities, and thatâ\u0080\u0099s increased from my personal experience, thatâ\u0080\u0099s increased four or five, probably more than that, probably, five to tenfold in the last two months from all different points within the globe as people became aware of our plant coming online and what those capabilities were."
}