{
    "symbol": "RIG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 14:56:05",
    "content": " As reported in yesterday's earnings release, for the third quarter, Transocean delivered adjusted EBITDA of $268 million on $730 million in adjusted revenue, resulting in an adjusted EBITDA margin of approximately 37%. In the Gulf of Mexico, we signed a contract with a major operator for 2 years on the deepwater conquer and direct continuation of the current program at a very favorable rate of $440,000 per day with up to an additional $39,000 per day for managed pressure drilling, integrated services and our technology products. In the Gulf of Mexico, Murphy Oil awarded the Deepwater Asgard a 1-well contract plus a 1-well option at a rate of $395,000 per day anticipated to commence in the fourth quarter. In Norway, our joint venture, Harsh Environment Semi, the Transocean Nordia, was awarded a 17-well contract with Wintershall DEA and OMV at day rates escalating from $350,000 per day to $430,000 per day, resulting in an initial $73 million contribution to our backlog. But assuming that the components of the program received final investment and government PDO approvals, which we expect, the backlog potential is $437 million based upon an average market leading regional day rate for a full term of $408,000 per day. The much anticipated results of the Petrobras pool tender have been announced, and we are pleased to confirm that the Deepwater Corcovado and Deepwater Orion are among the 7 rigs that Petrobras selected for this work at day rates of $399,000 per day and $416,000 per day, respectively. In the third quarter, 3,924 days were contracted in the North Sea market, including Norway and the U.K. Of the contracted days, 72% were in Norway, where we are beginning to see the supply of RIGs decline as demand from outside Norway could pull up to 4 RIGs out of the North Sea market in 2023. Looking closer at our results during the third quarter, we delivered adjusted contract drilling revenue of $730 million and an average day rate of $343,000."
}