{
    "symbol": "XPOF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 03:59:10",
    "content": " Importantly, as we continue to open more studios and as our AUVs continue to grow, our profitability increases, driven by high-margin royalties from growing system-wide sales with an active pipeline of approximately 2,800 studios contractually obligated to open globally and only about a quarter of our conservative North American total addressable market currently penetrated. For the second quarter, we posted net revenues of $59.6 million, an increase of 66% year-over-year. Q2 adjusted EBITDA of $17.6 million, or 30% of revenue was up 112% from $8.3 million, or 23% of revenue in the prior year period. On a consolidated basis, revenue for the quarter was $59.6 million, up 66% from $35.8 million in the prior year period. Franchise revenue was $27.6 million, up 55% from $17.8 million in the prior year period. Equipment revenue was $12.4 million, up 160% from $4.8 million in the prior year period. Franchise marketing fund revenue of $4.9 million was up 49% from $3.3 million in the prior year period, primarily due to strong system-wide sales and average unit volume growth. Cost of franchise and service revenue were $4.5 million, up 45% from $3.1 million in the prior year period. Adjusted net income for the second quarter, which excludes the $31.6 million change in fair value of non-cash contingent consideration and $0.2 million expense related to the second quarter remeasurement of the companyâ\u0080\u0099s tax receivable agreement liability was $0.1 million compared to an adjusted net loss of $7.8 million in the prior year period. Based on current business conditions, our year-to-date performance and our expectations as of the date of this call, we are increasing our full-year 2022 outlook for revenue and adjusted EBITDA and reaffirming our guidance for studio openings and system-wide sales in North America as follows. We also continue to project North American system-wide sales to range from $995 million to $1,005 million or $1 billion at the midpoint, which represents a 41% increase from the prior year and the highest North American system-wide sales in our history. Total 2022 revenue will be higher than initially forecasted and is now expected to be between $211 million to $221 million, an increase of 39% from 2021 at the midpoint of our guided range. Adjusted EBITDA is now expected to range from $68 million to $72 million, a 156% year-over-year increase at the midpoint of our guided range. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions."
}