{
    "symbol": "NMR",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-01 07:35:11",
    "content": " Now on our First Quarter Results of the Fiscal Year Ending March 2022, I'm using the document titled consolidated results of operations. Net revenue increased 108% quarter-on-quarter to ¥353.3 billion, while income for income taxes improved to ¥78.5 billion, as shown on the top right. Three segment income before income taxes was ¥35.6 billion, recovering from a loss last quarter due to two main reasons. First, Investment Management established in April this year made a significant contribution; and the second, Wholesale performance improved. First, the revenue from the market department, page 10. Top left, fixed income on a year-on-year basis is in line with US peers. My second question goes a bit away from the financial reports, but I would like to ask a question about the enhancement of risk management. Yesterday, Credit Suisse publicized a report, more than 100 pages, and looking at the content of their report, it appears that if the exposure exceeds limit by more than 20 times -- well, the exposure exceeding the limit by 20 times, and that was left for a long time, and that was identified as the cause. Thank you very much. So as Mr. Muraki said, for fixed income, our performance is in line with our US peers, especially when it comes to our core business, which is rates business. So as the market normalized, our rates revenue was also normalized. However, excluding the impact from the incident in the USA, wholesale's overall performance is that bottom line is ¥37 billion. If anything, FY 2019-2020 as compared with FY 2020 – 2019/2020 before pandemic, we are above that level now. So looking at the numbers, on a daily basis, we acknowledge – we have acknowledged the difficult environment. But excluding that incident in the USA, we have ¥37 billion of bottom line profit. As mentioned earlier, reopening of economy and infrastructure package announced by Biden administration and inflation expectation triggered by them and the tapering moves by central banks, so there will be progress in discussions on those matters. So current situation will not continue forever, especially the monetary easing created lots of money that have been left to be invested somewhere. Regarding my first question, my follow-up question is regarding risk. But in these days, China's regulatory risk has been drawing attention. The last couple of days, Chinese equities and Hong Kong equities have trended in a quite volatile manner, I acknowledge that. Thank you very much, Mr. Kitamura for clear answer. First, CET1 percentage is up to 17.7%. And next is the – on dividends, the profit revenue. Now, we had made – we have had discussions and different considerations, and quite honestly, if I may, we just thought, this is not the right timing for share buybacks. When we distributed dividends the end of last fiscal year, we had excluded the impact from the loss of the US incident. So, this time it will not be consistent, if we apply it differently this time, compared to what we did end of last fiscal year. So, even if you had cash from NRI sale of JPY50 billion, you would be making considerations around, I think, in that loss from the U.S. incident? Thank you very much. So this time, the Nomura Capital Partners investees IPO is mentioned, I believe it's about Plus Alpha Consulting that JPY24 billion of gain. I'm not sure this is everything, but this IPO portion, without this IPO portion, then from this gain/loss number JPY24 billion, this would have been or might have been lower than the revenue compared with the previous quarter's number of JPY54 billion. So, if we exclude JPY24 billion, then the remaining a number, of course, will be short or smaller as you pointed out. In the previous quarter, JPY24.2 billion, the investment gain, in the previous quarter. Actually, this number partially includes the former Merchant Banking department's markup numbers. So this JPY24.2 and – number that we have, JPY24 billion deducted from JPY35 billion, that is not apple to apple comparison. So if you go back to the previous financial report, then previously what was disclosed as Asset Management division, ACI gains was JPY10 billion or so of number was booked to ACI lines. The other remaining number was included in the investment gain, previously. So, in this most recent quarter as you show depending on the performance, on a Q-on-Q basis there has been an improvement. And this US incident related loss compared with the previous quarter and this quarter excluding that loss, if we take that second numbers from three segments then, unfortunately, the revenue is -- sorry, a profit is down, I believe. Regarding the personnel expense, on a quarterly basis, well, it's difficult to look at personnel expense on a quarterly basis because of some technical factors involved, especially in the fourth quarter. Compared with previous quarter, quarter-on-quarter analysis or comparison is something that doesn't match your – our situation. Of course, as much as possible during the fiscal year or period, we are trying to equalize the volatility of P&L, however we cannot rule out such special factors. And also, our thinking about the bonus is that, of course, revenue is an important factor. And especially in the first quarter, technical accounting factors are also involved. So the first quarter personnel expense tends to look big, and also there is a factor of weak Japanese Yen and other factors. So my answer is not that straightforward, but there are various factors involved here. Thank you, Mr. Kitamura. So the US incident excluded, then this ratio is around 80% and it's a bit high but that's linked to the factors you mentioned. So, in the middle of the quarter, or quarter-on-quarter, the expense ratio is volatile, so we should take a look at the full year number. But 80% that percentage itself, excluding various factors as Mr. Otsuka calculated and that ratio Wholesales KPI, income – a cost income ratio is 80%. Thank you very much, Mr. Kitamura for the clear answer. First, I have a question on the market division. And this time, compared to the average situation last year, equity has come down. And when we look at the contents of what's going on, equity, you look at the market and comparing it with US peers, you're not doing much in US equity, so I can see that. If you could talk about that situation, say, on different products, so that would be my first question. So the global market -- so we have clients, revenues from clients, and there's rest of revenue coming from flows. When we look at the trading volume compared to last year, the trading in government bonds were down about 11%. And as a result, the client revenue has declined somewhat because of that. And this time around, that is -- this first quarter, the direction of the yield curve is -- hasn't been set. And in the middle of this quarter, we've been a return of the replacement trade. And because of macro factors, we have seen a lower activities, lower trading activities of our clients. Moving forward, as I've mentioned the direction of the rates and the interest rates are mixed, will probably be mixed. And in that environment, especially in our business, especially around fixed income, it will be an environment where we should be able to have a better business for fixed income. So, for fixed income, so when we look at your US peers' earnings, I thought that you could have done better or higher. Now as we look at the first quarter, when we look at the securitized products and credit, they did well. On the other hand, for us, our strength or core business, the slowdown in rates has been more pronounced this year. And even in that environment, our performance faring as well as our US peers, I think we could say that we've done a relatively good job. Thank you very much. There are realized and unrealized portion and the unrealized gain -- realized gain of plus alpha, and you said that the unrealized gains are going to be part of the distributable -- I mean, the profit for distributable dividend. And I think since this is more of a temporary than realized gain, so I don't think you will be canceling it against the US incident loss. So, I think your first question was around how we think about the unrealized gains around ACI and the impact to our P&L. Now ACI's earnings, so regarding the valuation, we take into consideration what we expect for their earnings moving forward. And since they are a non-listed company, I don't know to what extent I could comment on this. Of course, it's a bit difficult to -- if you ask a proof what it is that they do. Now we are -- even when we look at our third party valuation sort of entities, we do think that the way we evaluate ACI is quite conservative. Now the thinking around dividends, I think that was your second question. Now as a matter, of course, since we are part of the market, of course, there will be fluctuations in our P&L, but we are striving to stabilize our earnings, stabilize our revenues. And the thinking around shareholder return, of course, our basic performance of our core business to be linked with that, that is -- of course, that's important. In addition to that, to make as stable dividend returns as possible is also important. Now since there is a large fluctuation in our earnings on our P&L, there would be fluctuations there inevitably. Thank you very much. After July, so you mentioned the current situation of wholesale, but you didn't comment on the current situation of retail after July. And also in the first quarter performance, looking at the total sales due to COVID, in the first quarter last year, the sales activities stopped and the level in the first quarter was the same as last year. The situation of retail in July is as follows: because of the spread of COVID infections and concerns about that, there is uncertainty about the macroeconomic situation, so the retail division is off to a slow start in July; on the other hand, the approach by type of customers or the initiatives to expand our clients' assets, that's been our focus. So even in July, investment trusts and the discretionary investment services have continuously enjoyed net inflow. Thank you, Mr. Kitamura. In the first quarter, our customers' activities were slow. And the total sales, especially the equities, declined by 28% because of the customers staying on the sidelines. However, our business model is being transformed in a significant manner. Thank you, Mr. Kitamura. Regarding the wholesale business, there was a loss in the US incident, and that, I believe, has been a challenge. And in terms of the asset management and financing, there are various needs on their end and the Nomura's global platform and Nomura's capabilities of making proposals on products. On the other hand, compared with the regular investors, institutional investors, there is only so much information that we can obtain from family office clients. So regarding that, by strengthening risk management frameworks, we would like to continue providing certain services. So regarding the regulatory tightening being discussed, I'm aware of that. But due to the – if the regulatory tightening urges family offices to open up and disclose more, then market will become more favorable. Thank you, Mr. Kitamura. Regarding the prime brokerage in some regions, I believe you've downsized your prime brokerages in some regions. The PB, prime brokerage business itself, it is positioned as playing the supporting role to the overall equity business. So some prime brokerage business might have been downsized, but the impact on our performance is limited. For those areas, by having the refined risk management, we will be continuing with those businesses. So in that sense, the impact on our business or performance will be limited. My question is that in the area of alternative investments, the unrealized gain and what is related to the IRR, the right bottom in Page 8, you haven't disclosed the AUM there. So how much unrealized gain is there, and the investment period from the vintage. On that area, on the alternative investments, the AUM, I mean, we will -- we are investing our clients' assets to alternative products. If the profits are coming from the X Merchant Banking business, and it's a bit difficult to know how much we could expect. Now, if we could markup and of course when there is an exiting from the position, we would see profits of this way. On your second point, on the personnel expense costs and gaining talent. And newspaper -- when we look at newspaper reports, we see that companies are increasing compensation to capture young talent. So what we need to retain our talent, I think what's most important is to give a fair evaluation of what they are doing and their contribution. And to return to their expectation to their growth, career growth, provide training opportunities, education opportunities, and to support their career growth, and to provide a working place that has diversity, and to provide a platform or place, where you can expect people with high capability to flourish. And of course, compensation or salary, wage, is an important factor in retaining talent and attracting talent. But in addition to that, by different -- by implementing different initiatives, we intend to attract and retain talent. On the other hand, just a more bigger picture, so the role of employees or people is changing quite substantially, compared to the past. Now, human capital is, needless to say, very important for a company, but things that could be replaced by -- I mean, what people need to do, what they don't need to, what could be replaced. So, when we think about that, I think it is possible to control a personnel cost rise to some extent. I'd like to ask further a question on your latter part, this new up. Thank you very much. But as we came out of the first quarter, we believe the result was decent. And though it's not reflected in P&L, there are some positive moves such as expansion of client assets. Also, our activities for stabilizing revenue, I believe, are starting to show effectiveness. And today, I haven't had time to talk about this, but for example, we are working on establishing entity to invest in private equities and also, we are working on enhancement or enrichment of contact centers. So, these new activities, so that they will start to grow and bear fruit, and contribute to the bottom line profit that you see."
}