{
    "symbol": "PGY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 13:47:08",
    "content": " We delivered $7.3 billion in network volume, which grew 49% year-over-year and was approximately 5x higher than our volume in 2020. In just three years, we grew from $100 million of revenues to a $750 million of the business, helping our partners originate over $7 billion in assets annually and providing access to unique investment opportunities for our institutional investors. In 2022, we saw application flow grow nearly 100% versus the prior year, driven by growth from new partners and as we scale newer products such as auto. In 2022, approximately $650 million of network volume was generated by new partners and channels on our platform. Production costs, which are expenses incurred from our partners related to the origination of network volume, grew by 60% as newer products and partners grew at a faster pace than our more mature products and partners. In 2022, AI integration fees grew from 48% to 65% of total revenue, as we began to earn incremental fees from certain partners related to the growing contribution of Pagayaâ\u0080\u0099s network on their total volume. To summarize, revenue grew by 58% year-on-year driven by the 49% growth in network volume combined with a greater ability to monetize both sides of the network, taking our take rate to a record of 10%. At the same time, we onboarded six new partners in 2022 and scaled into newer products such as auto, which led to production costs increasing to 7% of network volume in the fourth quarter of 2022. In the first quarter, we expect network volume to range between $1.7 billion and $1.8 billion, total revenue and other income to range between $175 million and $180 million and adjusted EBITDA to range between negative $5 million and breakeven. In the full year 2023, we expect network volume to range between $7.5 billion and $8 billion, total revenue and other income to range between $775 million and $825 million and adjusted EBITDA to range between $10 million and $25 million. And what I described in some of the prepared remarks was around the increased monetization, and what is on the fourth quarter was AI integration fees were higher, they were higher because we've been able to demonstrate through these markets the value of Pagaya in many cases being 20% to 30% of volume on some of our partnersâ\u0080\u0099 networks, or some of our partnersâ\u0080\u0099 platforms."
}