{
    "symbol": "FLO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 11:56:03",
    "content": " I would now like to hand the conference over to your speaker today, J.T. Thank you, Gigi and good morning everyone. I hope you all had the opportunity to review our earnings release, listen to our prepared remarks and view the slide presentation that were all posted yesterday evening on our Investor Relations website. After todayâ\u0080\u0099s Q&A session, we will also post an audio replay of this call. Please note that in this Q&A session, we may make forward-looking statements about the companyâ\u0080\u0099s performance. Although we believe these statements to be reasonable, they are subject to risks and uncertainties that could cause actual results to differ materially. In addition to what you hear in these remarks, important factors relating to Flowers Foods business are fully detailed in our SEC filings. Joining me today are Ryals McMullian, President and CEO and Steve Kinsey, our CFO. Before we get started on this Veterans Day, weâ\u0080\u0099d like to recognize the contributions of our servicemen and women, both past and front. Moving on to our results, we executed well in the quarter, driving third quarter sales to record levels. Consumers continued to express a preference for the differentiated attributes of our leading brands and we are focused on maintaining our momentum with investments in innovation and marketing, including our new agile innovation capability. As always, our team is committed to delivering results in line with or better than our long-term financial targets. And so with that, Gigi, we can open it up for questions, please. Hey, just wanted to talk a little bit more about store branded in your prepared remarks and just the growth in the quarter. And then two, I think you had mentioned that it was really a one retailer that was not allowing you to or not allowing pricing to come up. Just generally, to start off, as we have been saying all year in a challenging economic environment like this, you would expect to see some trade-down to private label. And looking across the market, that has held true. But digging down a little deeper into that, what you see as we mentioned last quarter, is that this is very concentrated in the mass channel. In the mass channel, some of the retail prices on private label have been held down a little bit lower. If you flip and look at grocery, the story looks quite a bit different. In fact, we gained 10 basis points of share in grocery in Q3 and then later in the quarter that actually accelerated and we gained 60 basis points of unit share in grocery. So â\u0080\u0093 and then also as we got towards the end of the quarter, to answer your trend question, we actually saw that rate of growth in private label slow a bit, now too early to call that a trend, but we did see it slowdown some. As far as our own results go, you did see a large increase in private label sales. But remember, we also took significant price increases in private label, which frankly we needed anyway harking back to our portfolio strategy, where not only are we trying to shift our mix to more branded retail, but in other parts of the business that are lower margin, we have been working furiously to improve the margin of those lower margin items. So between SKU rationalization, price increases, strategic businesses, etcetera, thatâ\u0080\u0099s all part of our strategy. So overall, market wise, yes, private label has shown a little bit of strength, certainly show dollar strength in Flowers, but the unit story is a bit more nuanced. I imagine with your hedging program, some of the higher or the lower cost hedges will be rolling off and you have covered some of that with pricing. You also have the cost savings program, which certainly helps. But then you have maybe private label, which you do make, which is lower margin that is growing faster right now. I mean, as you said, we are not prepared to give guidance for next year. And we look particularly at some of our input costs, still a lot of volatility in weeks although remaining pretty true to our hedge strategies and labor, transportation, all of those continue to show significant inflation and really no signs of any of that reverting at this point. So without getting into specific set for 2023, I would say you could continue to expect some of the same pressures youâ\u0080\u0099re seeing this year with regard to gross margins. So as we start to lap inflation and pricing is largely catching up, can you share any thoughts on sort of the balancing act of recovering gross margin while protecting market share. Look, I mean, obviously, there is always a tricky balance, as you say, between covering these inflationary costs and holding your market share. And I think so far, weâ\u0080\u0099ve done a pretty good at. So far, the competitive environment has remained pretty rational. As you might expect, DKB being a super-premium item, weâ\u0080\u0099ve had a little bit of unit share â\u0080\u0093 a little bit of unit share loss in DKB. And so weâ\u0080\u0099ve done some targeted promotions, right, to hold on to those consumers. But for some folks, obviously, thatâ\u0080\u0099s going to be out of reach in the short-term. And thatâ\u0080\u0099s why itâ\u0080\u0099s also important that we keep up our media and advertising, digital, social campaigns to make sure we keep these brands, front and center, in front of those consumers. So, that when relief does come and thankfully, at least we got a better inflation report yesterday, hopefully, that trend continues. As that relief does come, they come back to the brand. But there â\u0080\u0093 as you say, there is a balance that we deal with daily. And then also, I wanted to ask about maybe any impact from Hurricane Ian in the quarter. So typically, we tend to perform really well during hurricanes. And frankly, Iâ\u0080\u0099m glad you brought it up because as you look at our share performance in the quarter, remember that last year, in the third quarter, there were four named storms, and we typically outperformed the competition in these storms. And this year, we only had one. I donâ\u0080\u0099t want to overemphasize it too much, but it does have an effect on our share. And so as usual, the team did an outstanding job keeping the market served. Iâ\u0080\u0099d say, overall, Mitch, pretty even. And so we, from a share standpoint, really performed nicely again this quarter in the Northeast. Mitch, itâ\u0080\u0099s been a little tougher out west, particularly California. And really, youâ\u0080\u0099ve got a state that already has very, very high cost. Fuel has been a better story for most of the country lately, but itâ\u0080\u0099s still very high in California. And so as weâ\u0080\u0099re looking at our share, we see a little bit more weakness out there on the West Coast right now. And then when as youâ\u0080\u0099re looking at your bakery capacity, and maybe future needs. So that takes care of days because we were really tight out there for a while, but weâ\u0080\u0099re in good shape there. Demand for Canyon is still very, very high, very pleased with how that business is progressing, but weâ\u0080\u0099re super tight on capacity at Canyon. So just like this year, it will probably be a little bit higher than normal, but a lot of thatâ\u0080\u0099s the ERP implementation. And then just the last question is in terms of your cake and foodservice, volumes were down, I think, 5%. I saw, in cake, I guess, units were down 12% in the measured and tracked channels. Most of that is cake and food service, okay, the lionâ\u0080\u0099s share of it is. For the rest of the business, elasticities are well within the normal range that we were expecting for the year and frankly, below historical levels. But specifically for cake and food service, a lot of that volume decline, the lionâ\u0080\u0099s share of it has been SKU rationalization and strategic business exits. So on purpose kind of stuff, reducing complexity, getting out of the lowest margin business, all part of that portfolio strategy that we keep talking about. As far as tracked channels go, the traction pick-up all of our cake business. And to answer your question, profitability is also up as well. And because of that and because of the stabilization that weâ\u0080\u0099ve achieved, at Navy Yard in particular, we will start turning our attention back to actual growth. A lot of that growth in sales, obviously, has been pricing so far. We need to start innovating, get some new products out there, reintroducing the seasonal items, the things that you used to see up your way. Two questions for me, actually. I guess I am just curious, as you size up the consumer amidst inflation and some of the other pressures you have talked about. Yes, a little bit. I mean obviously, we are focused on snacking. So, we have got DKB bars that are being launched nationally rather in January â\u0080\u009823, very excited about that. But also to your point, we are looking at some things from a price-back architecture standpoint that could help in a recessionary environment should that come to pass. But overall, I wouldnâ\u0080\u0099t say that itâ\u0080\u0099s changed our innovation pipeline meaningfully, particularly when we talk about the agile innovation side of things, the actual new products outside of core categories. So, we are â\u0080\u0093 obviously, we are monitoring that. Itâ\u0080\u0099s in the comment period right now, which I think runs out sometime in December. But remember, too, that what this is doing is just going back to the rule that was in effect under the Obama administration. Going back to the Obama rule, and obviously, we were able to operate fine in that environment as well. I donâ\u0080\u0099t have it in front of me, but I would say that the gaps are probably as we have taken branded pricing too. They may have narrowed a bit, but itâ\u0080\u0099s also going to depend on what channel you look at from a retail standpoint, because obviously, it depends on what the retailer actually does. I mean you would think that, that would be the case. But again, the gaps are going to be a lot higher right now in mass. What you are seeing in grocery, and maybe this is a proof point relative to your question, what you are seeing in grocery are tighter gaps there and the performance for brand in grocery has been much better. In the script, you guys talked about expanding beyond the core business. Well, the direct answer to your question is absolutely yes. And I mean, like I said, we are introducing the DKB bars in January nationally. The loyalty, the interest in that brand, DKB is just astounding to me. And so we will continue to push that brand further out, particularly in the snacking arena. Itâ\u0080\u0099s just a smaller market, with Canyon, right. So, we are to a point as far as scale goes right now where we think we have the right to play in other categories. The second part of your question, though, is we will absolutely continue to look for M&A opportunities where we can add brands to our portfolio that will likely play outside of our core business that can further strengthen that branded portfolio. That one was an outlier, so itâ\u0080\u0099s not really all that relevant to the conversation actually. But yes, I mean I would say that the pipeline has slowed a bit, honestly, just given the economic environment, interest rates spike in the way they had. We still have plenty in our pipeline, but the overall flow of deal activity has slowed. Now, prior to this, itâ\u0080\u0099s the normal struggles with any deal, right. I mean you have got to make sure that your financial, operational and commercial conviction is there. And seller expectations, up until now, have remained pretty robust, that may moderate, we will have to see. Itâ\u0080\u0099s always been an important part of our growth story, and I believe that will continue. I would now like to turn the conference back to Ryals McMullian, President and CEO, for closing remarks. Thank you, Gigi, very much and thank you everybody for your interest in Flowers."
}