{
    "symbol": "XPO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 13:00:13",
    "content": " We also had first quarter records for net income, adjusted EBITDA and adjusted EPS, which was up year-over-year by 58%. And we continue to expect our adjusted operating ratio, excluding real estate gains, to inflect to year-over-year improvement later in the quarter and for the full year to be at least 100 basis points better than 2021. First quarter margin dollars were up 21% year-over-year and rose 5% sequentially, outperforming typical seasonality in large part due to the effectiveness of our digital platform, XPO Connect. For the first quarter, we delivered strong year-over-year growth in revenue, adjusted EBITDA and adjusted diluted EPS. Our adjusted earnings per diluted share for the quarter was $1.25, which was up from $0.79 a year ago, an increase of 58%. Pro forma for the intermodal sale, the midpoint of our second quarter EBITDA guidance implies a year-over-year growth rate of 15%. We grew LTL revenue by 15% year-over-year to $1.1 billion, the highest revenue of any quarter in our history. We reported record first quarter revenue of $1.1 billion, which is 15% higher than last year. In the first quarter, the number of registered carriers on XPO Connect year-over-year was up 39%, registered customers were up 41% and weekly carrier usage was up 59%. If we look at the guidance that you gave for the enterprise as a whole and then LTL and try to back into what that means for brokerage and other, there's obviously a deceleration from the first quarter on the adjusted EBITDA. So if you look at the delta from the guidance that we issued at the end of the fourth quarter entering the year and the guidance that we just gave you today, we had about $60 million of adjusted EBITDA modeled for intermodal for quarters 2 through 4. It has allowed us to go out and to grow volume by over 20% for the last 6 quarters, and it's allowed us for the last 8 years to outperform the industry revenue growth by more than 3x."
}