{
    "symbol": "RBBN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 21:24:06",
    "content": " We've made great progress on this strategy in the third quarter, with bookings of our Neptune IP routing products more than doubling compared to the second quarter and making up more than half of the IP Optical segment product bookings in the quarter. In our Cloud and Edge business, third quarter revenue was $125 million, down 12% year-over-year and 9% quarter-over-quarter. Non-GAAP gross margin for IP Optical was 38%, a 9 percentage point increase over the previous quarter and a 1 percentage point higher than the third quarter of 2021. International customers provided 58% of revenue, which is a higher percentage from previous quarter commensurate with the increase in IP Optical business as a percentage of total Ribbon revenues. Overall, we expect further revenue growth in our IP routing and optical transport segment in the fourth quarter across the majority of regions supported by significantly higher backlog entering the quarter and approaching profitability on an adjusted non-GAAP basis. With that backdrop, our expectations for the fourth quarter are as follows: For revenue in a range of $220 million to $240 million; non-GAAP gross margins of 53.5% to 54.5%; and non-GAAP adjusted EBITDA of $30 million to $36 million. I guess, if I break it into two pieces, certainly, the demand perspective, the demand backdrop around IP Optical improved significantly in the third quarter, as we expected and as we have guided, and it's a combination, obviously, of the momentum around the new products we're bringing to market. And in particular, as I mentioned, the bookings in the third quarter increase around IP routing in particular now being more than half the bookings in the quarter for that segment, was really good to see underpinned or underlined by this new deal with Airtel in India. As we look into the fourth quarter, again, as I think about the two segments in the IP Optical business, what we're projecting is really some increases in each of the geographies around the world. In addition to the optical business that we're doing, which also grew clearly in the quarter, the growth in IP and kind of the increased balance in the portfolio is really exciting to watch here. So with revenue increasing in IP Optical in the third quarter to $82 million and the book-to-bill increasing to 1.45, of course, you can easily do the math on that. So we actually see, as we get into kind of the second quarter next year, another step up in improvement in stability around supply chain, because some of the products that we know we're just going to continue to struggle on some parts will get designed on more readily available components."
}