{
    "symbol": "RBBN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 22:37:02",
    "content": " And we had a particularly strong quarter in North America, with sales of our Cloud & Edge products and services increasing 33% sequentially led by a $25 million increase in voice over IP network transformation sales quarter over quarter. Based on the pipeline for the second half, weâ\u0080\u0099re projecting 20% plus growth in total IP optical sales in the third and fourth quarter versus our second quarter results. We continue to effectively manage a variety of supply chain and logistics challenges in the quarter, with a comparable amount of shipments delayed to future quarters, as weâ\u0080\u0099ve seen over the last several quarters, approximately $10 million. Total revenue was $206 million, down 3% from last year, but up 19% quarter-over-quarter, itâ\u0080\u0099s a Cloud & Edge revenues from new large telecom projects rebounded seasonally low levels in the first quarter. Non-GAAP operating expenses were $96 million, down sequentially from the first quarter by $3.4 million, after adjusting for one-time accounting accruals that benefited OpEx in the second quarter of 2021. In our Cloud & Edge business, second quarter revenue was $137 million down 3% or $4 million year-over-year. We recorded second quarter revenue of $69 million, which was a $1 million decrease versus the prior year, but an increase of $5 million or 8% quarter-over-quarter. With that backdrop, our expectations for the third quarter are as follows: revenue in a range of $210 million to $225 million; non-GAAP gross margins of 55% to 56%; and non-GAAP adjusted EBITDA of $26 million to $34 million. Weâ\u0080\u0099re also adjusting our full year targets based on our results to date, our outlook for the third quarter the continued expectation of a strong fourth quarter, as well as continued to elevated supply chain costs and inflation pressure on operating costs. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And I think as you kind of break down the numbers, youâ\u0080\u0099ll see, yes, yes, we expect double-digit 20% light growth in the second half of the year on IP optical, so both Q3 and Q4 versus the Q2 number. Please proceed with your question. And we anticipate continued growth in the second half, both from kind of the core business that we have with the customers, but thereâ\u0080\u0099s opportunities around additional long-haul transport business, as well as with the 5G deployments, thereâ\u0080\u0099s a variety of project opportunities around cell site routers around the IP portion of the portfolio, that in particular, Iâ\u0080\u0099m pretty excited about."
}