{
    "symbol": "SQSP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-25 11:54:05",
    "content": " But again, Unfold, itâ\u0080\u0099s a smaller revenue size overall and itâ\u0080\u0099s a small--very low ARPU, but in terms of unique subscriptions, it has a significant impact when you look at that because, first of all, the base of customers that has Unfold is pretty large, and for the most part there is a little--there is not much attached yet between Unfold and our website, so thereâ\u0080\u0099s a lot of potential for growth there as well, particularly with buy side. Got it, thank you. Glad youâ\u0080\u0099re calling this out because when you look at our GNV, I think we saw this last quarter, that people expected us to be much more correlated with just essentially physical goods sales, but in that GNV number we have, thereâ\u0080\u0099s many categories, so youâ\u0080\u0099ve got the scheduling business which operates differently than hospitality and time-slotted based businesses that Tock has, and operates differently than our ecommerce business and operates differently than our member areas businesses, which are just starting to grow. Thatâ\u0080\u0099s great color, and--\n Just to add onto that, one more point on the profitability and the strength of the core business, at the beginning of the year we talked about the investments that we are doing in younger revenue streams, like Tock, international and enterprise, and so we are delivering--weâ\u0080\u0099re expecting to deliver unlevered free cash flow margins that are in the range of 16%, 17% for the quarter, and even higher of the year, in spite of the fact that we are making those investments in those businesses that are an actual driver to the unlevered free cash flow margins and the EBITDA margins that we have shown. Sure, so first off with respect to consumer spending, I think whatâ\u0080\u0099s interesting is we sort of--we capture a bit of that when we kind of go through our GNV commentary, and if you think about okay, Iâ\u0080\u0099m not going to buy this physical wallet, Iâ\u0080\u0099m going to go and invest in an experience, weâ\u0080\u0099re perfectly situated to capture that demand with things like Tock, which is about time-slotted businesses and will eventually be about events. Got it, thank you. I would just say this - in terms of business impact, itâ\u0080\u0099s going to have a much bigger impact for new sites than existing sites, because if you have an existing site, youâ\u0080\u0099ve kind of created those pages already, so this might be better and you might use it to get more expressive layouts at times, but itâ\u0080\u0099s really around that new build experience that I think youâ\u0080\u0099re going to see it shine, especially people putting sites on the platform that otherwise would have had to go to different tools because the expressability isnâ\u0080\u0099t there, right, and youâ\u0080\u0099re always limited by that."
}