{
    "symbol": "GTX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 09:42:09",
    "content": " In Q4, net sales were $898 million, up 4% from the same period last year on GAAP basis, but up 15% on a constant currency basis. For the year, net sales were just over $3.6 billion, down 1% on a GAAP basis, but up 8% on a constant currency basis compared with 2021. Full year adjusted EBITDA was $570 million near the high end of our latest outlook, but down 6% versus 2021, mainly due to FX. Specifically, the generation of $313 million is adjusted free cash flow enabled us to fully redeem the series B preferred shares early in 2022 and later in the year to settle the Series A dividend payments for Q3 and Q4 in cash. Looking at the upper left hand graph, you'll see reported net sales for the last eight quarters with Q4 2022 at $898 million, up from Q4 of 2021 by 4% on a GAAP basis and 15% on a constant currency basis, driven by continued pass-through inflation and favorable mix. Looking at the upper right-hand side of the page, Q4 2022 adjusted EBITDA of $140 million was up 9% from $129 million last year. All verticals improved compared to the prior year with gasoline products up 17% at constant currency, adding $60 million in sales, gasoline products now comprise 42% of reported net sales with versus 41% last year, driven by new program launches and share of demand gains. Diesel products grew 13% in constant currency, adding $29 million to sales and comprise 25% of total sales, flat with last year. On a full year basis, 2022 reported net sales were down 1% on a GAAP basis, essentially flat at $3.6 billion and up 8% at constant currency. In 2022, gasoline product sales increased $183 million or 13% and comprised 41% of net sales, up from 39% in 2021, driven by volume growth as well as new program launches. Diesel products grew 1% for the year at constant currency, adding $12 million to sales in 2022 and comprised 26% of total sales versus 29% last year. Garrett delivered solid adjusted free cash flow of $330 million despite lower than expected volumes in Q4, and this performance was within our full year outlook at the low end of the guidance range. We ended 2022 with a strong liquidity position of $721 million, comprised of $475 million of undrawn revolving credit facility capacity, and $246 million of unrestricted cash, which decreased $97 million sequentially -- which increased $97 million sequentially, ended after the $42 million payment at year end for the Q4 Series A dividend settled on January 3, 2023. As of year end 2022, 80% of our long term debt is at fixed rates during the year, and during the year we increased our revolving credit facility to $475 million from $300 million at year end 2021. Net sales of $3.7 billion, representing a growth at constant currency of 3.5%; net income of $278 million; adjusted EBITDA of $585 million; net cash provided by operating activities of $440 million; adjusted free cash flow of $350 million. We achieved an adjusted EBITDA margin of 15.8% for the full year of 2022, which includes 80 basis points of dilutive impact from FX and inflation pass-through."
}