{
    "symbol": "GTX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 13:08:10",
    "content": " Second quarter of 2022 net sales of $859 million were down 8% on a GAAP basis, mainly due to the weaker euro and were unchanged on a constant currency basis as compared with Q2 last year. Q2 adjusted EBITDA was $138 million and the EBITDA margin was 16.1% virtually flat sequentially with Q1, which is notable considering Q2 unit volumes were sequentially lowered by 6%, driven by the factors mentioned above. Compared to Q2 2021, adjusted EBITDA was down $30 million from $168 million half of which was due to foreign exchange driven by a weakening euro and the remainder due to lower volume, while margins still remained above 16%. On the right hand side of the page, adjusted EBITDA remained strong at $138 million and the adjusted EBITDA margin of 16.1% was in line with or better than the last two quarters and a solid result in a volatile production environment affected by supply chain disruptions, China lockdowns, and FX headwinds driven by a weaker euro. Lastly, on the bottom left graph, Garrett generated positive adjusted free cash flow of $23 million, despite an increase in working capital due to lower volume, as well as the cash interest associated with the early redemption of the Series B preferred stock. Turning now to Slide 7, you see our adjusted EBITDA bridge compared to Q2 last year, when both volume and margins were higher due to the recovery and demand in production following the end of COVID-19 lockdowns and before the biggest impact of the semiconductor shortage in Q3 of 2021. Q2 2022 volumes of 3.2 million units declined 6% versus last year, lowering adjusted EBITDA by $18 million. Once again, Garrett successfully navigated macro headwinds by adapting to volatile production schedules, delivering improved productivity and passing through inflationary pressures even while increasing investment into new technology, such as R&D spending increasing $5 million from last year as previously mentioned. Shifting to the left hand side of the slide, you will see the bridge from adjusted EBITDA to adjusted free cash flow for the quarter, reflecting a positive $23 million of adjusted free cash flow with the largest impact coming from working capital driven by declining volumes, as just mentioned. Importantly, you will see the two comparisons both assume a 2022 adjusted EBITDA midpoint of the range of $560 million with the following changes from our revised outlook, an additional $10 million from volume, an additional $14 million from product mix, price net of inflation passthrough of an additional $7 million offset by $7 million in greater energy inflation and $24 million from a weaker Euro."
}