{
    "symbol": "TRIB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-30 15:43:03",
    "content": " Moving on to financial expenses of $2.2 million, as you may have seen from prior press releases, the company refinanced the majority of exchangeable notes during the quarter, and this has resulted in a change in our interest profile. $99.7 million of the company's exchangeable notes, which had a coupon rate of 4%, were replaced by a senior secured term loan of $81.3 million at an interest rate in the quarter of 12.25%. The remainder of the financial expenses consist of notional financing charges arising on leased assets, arising from IFRS 16, which was approximately $0.2 million in both quarter 1, 2022 and quarter 1, 2021. In Q1 2022, accretion interest and the amortization of loan origination costs of $0.2 million were recorded to give a closing carrying value of $76.2 million at March 31, 2022. The derivative financial asset is valued at $0.2 million at March 31, 2022, and represents an estimate at that date of the value to the company of being able to repay the term loan early and potentially refinance at lower interest rates. The derivative financial liability is valued at $1.7 million at March 31, 2022, and represents the fair value of the warrants issued to Perceptive. Our revenues for quarter 1 were $18.8 million compared with $25.6 million in the corresponding quarter last year, which is a decline of 27%. Point-of-care revenues for quarter 1 increased to $2.2 million from $1.9 million in quarter 1 last year, which is an increase of 15%. Moving on to Clinical Laboratory, our revenues were $16.6 million compared with $23.7 million in the corresponding quarter, representing a decrease of 30%. I mean, we have moved from a situation where we were extremely worried about repaying $100 million loan note in circumstances where we didn't really have the funds to do so, to a situation where we've repaid that, where we brought in $45 million worth of equity at a price -- average price of $2.60 per share."
}