{
    "symbol": "DFIN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 13:50:24",
    "content": " A weak capital markets transactional environment resulted in lower-than-planned revenue in the quarter, while our third quarter adjusted EBITDA margin of 24% was in line with our expectation and once again significantly higher than historical quarters with similar overall and transactional revenues. Total Software Solutions sales accounted for nearly 37% of total third quarter net sales, an increase of approximately 880 basis points from last year's third quarter sales mix. A trailing four-quarter basis, Software Solutions sales reached $285 million, growing 14% from the third quarter 2021 trailing four quarters and represented 32% of total net sales, an increase of approximately 590 basis points from the third quarter 2021 trailing four-quarter period. Turning to our transaction-driven software Venue, which experienced tremendous growth last year as a result of a robust capital markets transactions environment compared to a very strong third quarter of 2021 when Venue sales were up 53% versus the prior year, third quarter 2022 Venue sales were down 11%, driven by a much weaker transactions environment. By continuing to focus on operational efficiencies, while also improving our sales mix, specifically more software and less print sales third quarter adjusted EBITDA margin was 810 basis points and 1030 basis points higher than the third and fourth quarters of 2019 respectively, despite overall sales and transactional sales in this year's third quarter being slightly below the levels we reported in those quarters. Third quarter non-GAAP gross margin was 55.5% approximately 690 basis points lower than the third quarter of 2021, primarily driven by lower sales volume and an unfavorable business mix, both related to lower capital markets transactional activity, partially offset by the impact of ongoing cost control initiatives and lower incentive compensation expense. Our third quarter adjusted EBITDA margin was 24%, a decrease of approximately 930 basis points from the third quarter of 2021, which was a quarterly record for adjusted EBITDA margin driven by less transactional sales, partially offset by lower incentive compensation expenses, as well as the impact of ongoing cost control initiatives. To illustrate this in more detail in the third quarter this year with slightly lower overall and transactional sales compared to the third and fourth quarters of 2019, this year's third quarter adjusted EBITDA of $45.3 million is $14.2 million and $19.2 million higher than the third and fourth quarters of 2019, respectively. Net sales in our Capital Markets Software Solutions segment were $45.8 million, a decrease of 4.8% from the third quarter of 2021. The decrease in net sales is primarily due to lower Venue Data Room activity, partially offset by the increase in our recurring compliance product ActiveDisclosure, which grew 10.6% in the third quarter. Net sales in our Capital Markets Compliance and Communications Management segment were $83.3 million, a decrease of $59.2 million or 41.5% from the third quarter of 2021, primarily due to lower capital markets transactional activity, as well as lower proxy and traditional compliance revenue. Net sales in our Investment Company Software Solutions segment were $23.7 million, an increase of 11.8% from the third quarter of 2021, which was also a very strong quarter. Net sales in our Investment Companies Compliance and Communications Management segment were $35.9 million, flat to the third quarter of 2021 as the impact of regulatory changes and a reduction of print sales, related to contracts we proactively exited, were offset by higher service-related revenue and price increases on the remaining print-related work. Compared to the fourth quarter last year, the midpoint of our revenue guidance $180 million implies a year-over-year sales decline of approximately 23%, similar in magnitude to our third quarter year-over-year change. From a margin perspective, our guidance of mid-20% range is similar to last year's fourth quarter adjusted EBITDA margin, despite a much lower level of transactional revenue and once again, much stronger than historical quarters of like size total and transactional sales."
}