{
    "symbol": "DFIN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 12:34:05",
    "content": " As noted in this morning's press release, our first quarter results were consistent with our expectations, with net sales of $211 million and non-GAAP adjusted EBITDA margin of 24.2%. Arc Suite, the other major component of our recurring compliance software offering, delivered solid year over year sales growth of 15.1%, despite last year strong first quarter driven by regulatory change, we continue to see increased adoption of our Total Compliance Management offering. From an overall sales perspective, the decline in capital markets transactions along with the plan, print and distribution sales reduction, more than offset the growth in Software solution sales, resulting in a consolidated net sales decline of 14% from last year's first quarter. First quarter, non-GAAP adjusted EBITDA was $51.1 million, a decrease of 28% from last year's first quarter, and non-GAAP adjusted EBITDA margin was 24.2%, a year-over-year decline of approximately 480 basis points. While our margin contracted versus last year's first quarter, which had nearly twice the amount of transactional revenue, from a multiyear perspective, the first quarter 2022 non-GAAP adjusted EBITDA margin is much stronger than historical quarters with similar levels of total sales and transactional revenue. Against those quarters of comparable total and transactional sales, first quarter 2022's non-GAAP adjusted EBITDA margin, is higher by more than 1,000 basis points, reflective of our improved sales mix. On a consolidated basis, net sales for the first quarter of 2022 were $211 million, a decrease of $34.3 million or 14% from the first quarter of 2021. Print-in distribution net sales, were $49.5 million, a decrease of $17 million or 25.6%, primarily due to lower print volumes associated with the decline in capital markets transactional activity and regulatory driven reductions in demand for printed materials within investment companies. First quarter non-GAAP gross margin was 53.1%, approximately 160 basis points lower than the first quarter of 2021, driven by lower sales volume and an unfavorable business mix, both related to lower capital markets transactional activity, partially offset by lower incentives compensation expense and the impact of ongoing cost control initiatives. Our first quarter non-GAAP adjusted EBITDA margin was 24.2% a decrease of approximately 480 basis points from the first quarter of 2021, driven by less transactional sales, partially offset by lower incentive compensation expenses, as well as the impact of ongoing cost control initiatives. As Dan mentioned earlier, our first quarter non-GAAP adjusted EBITDA margin is much stronger than our historical margins in quarters with similar overall in transactional sales. Illustrate this in more detail in the first quarter this year on a similar level of transactional sales and slightly lowered level of overall sales compared in the first quarters of 2019 and 2020, this year's first quarter, non-GAAP adjusted EBITDA of $51.1 million is $27.4 million and $21 million higher than the first quarters of 2019 and 2020, respectively. Net sales in our Capital Markets Software Solutions segment were $44.7 million, an increase of 16.1% from the first quarter of 2021 primarily due to the performance of our recurring compliance products, ActiveDisclosure, which had another excellent quarter posting 29% growth. Net sales in our Capital Markets, Compliance and Communications Management segment were $103.6 million, a decrease of 25.2% from the first quarter of 2021 due to lower capital market transactional activity, partially offset by higher compliance volumes. This is particularly noticeable in the Capital Markets Compliance and Communications Management segment were first quarter 2022 non-GAAP adjusted EBITDA margin exceeded margins from both the first quarters of 2019 and 2020, which had similar total and transactional sales relative to the first quarter of 2022. Net sales in our Investment Companies Software Solutions segment were $25.1 million, an increase of 15.1% from the first quarter of 2021, which was also a very strong quarter. Net sales on our Investment Companies ' Compliance and Communications Management segment were $37.6 million, a decrease of $8.9 million or 19.1% from the first quarter of 2021 due to the impact of regulatory changes and a reduction of print sales related to contracts we proactively exited. Regarding the regulatory changes that will continue to reduce this year's demand for print in this segment, we expect a decline in net sales of approximately $40 million dollars, $10 million of which was realized in the first quarter and only a de minimis impact on non-GAAP adjusted EBITDA in 2022. With that as the backdrop, we expect consolidated second quarter net sales to be in the range of $220 million to $240 million and non-GAAP adjusted EBITDA margin in the mid 20% range, similar to first quarter margin."
}