{
    "symbol": "DFIN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 12:19:08",
    "content": " On a consolidated basis, net sales for the fourth quarter of 2022 were $167.7 million, a decrease of $65.1 million or 28% from the fourth quarter of 2021. In aggregate, capital markets transactional and Venue dataroom revenue decreased $57 million, or 42%, versus the fourth quarter of last year. Fourth quarter non-GAAP gross margin was 54.9%, approximately 550 basis points lower than the fourth quarter of 2021 primarily driven by lower sales volume and an unfavorable business mix, both related to lower capital markets transactional activity, partially offset by the impact of the ongoing cost control initiatives and lower incentive compensation expense. Fourth quarter adjusted EBITDA margin was 23.4%, a decrease of approximately 290 basis points from the fourth quarter of 2021 primarily driven by lower capital markets transactional and Venue sales, partially offset by lower selling expenses as a result of lower sales volume, lower incentive compensation expense, and the impact of ongoing cost control initiatives. Turning now to our fourth quarter segment results, net sales in our capital market software solution segment were $43.4 million, a decrease of 14.2% from the fourth quarter of 2021. Adjusted EBITDA margins for this segment was 21.2%, a decrease of approximately 210 basis points from the fourth quarter of 2021, primarily due to lower sales volume, and unfavorable sales mix, and a higher allocation of overhead costs partially offset by lower selling expenses as a result of lower sales volume, lower incentive compensation expense, and price uplift from new AD. Net sales in our capital markets Compliance and Communications Management segment were $73.4 million, a decrease of $54 million or 42.4% from the fourth quarter of 2021, primarily driven by lower capital markets transactional activity, which accounted for approximately $52 million of the year-over-year sales decline in this segment. Net sales in our investment company software solution segment were $25.3 million, an increase of 9.1% from the fourth quarter of 2021. Net sales in our investment companies Compliance and Communications Management segments were $25.6 million, a decrease of 19% from the fourth quarter of 2021 as the impact of regulatory changes, and a reduction of print sales related to contracts we proactively exited, were partially offset by higher service related revenue and price increases. Non-GAAP on outdated corporate expenses were $13.7 million in the quarter, a decrease of $8.9 million from the fourth quarter of 2021 primarily driven by lower incentive compensation expense, and the impact of ongoing cost control initiatives partially offset by an increase in expenses aimed at accelerating our transformation."
}