{
    "symbol": "FLNT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 22:49:04",
    "content": " Joining me on today's call are Fluent's CEO, Don Patrick, our CFO, Sugandha Khandelwal; and Ryan Schulke, our Co-Founder and Chief Strategy Officer. For a discussion of the risks and uncertainties associated with Fluent's business, we encourage you to review the company's filings with the Securities and Exchange Commission, including the company's most recent annual report on Form 10-K and quarterly reports on Form 10-Q. During this call, we will also present certain non-GAAP financial information relating to media margin, adjusted EBITDA and adjusted net income. Management evaluates the financial performance of our business on a variety of indicators, including media margin, adjusted EBITDA and adjusted net income. I'll make some brief comments about our second quarter results which we believe reinforces the appropriateness of our commitment to quality in an evolving test and learn culture, update you on the progress against our strategic priorities and then discuss the impact of the current economic operating environment. As we continue to test, learn and validate, we are leaning into opportunities where we can establish and leverage Fluent's brand credentials in the marketplace. An adjusted EBITDA of $9.4 million represents 9.6% of revenue, up $7.6 million year-over-year. Our strong second quarter operating results exhibit the continued progress we're making on our long-term strategic growth plan, focused squarely on consumer engagement, enhancing the quality of their experience in our performance marketplace. Importantly, we believe the results also further validate our strategy and in turn, provide us with competitive advantages by leveraging Fluent's core go-to-market capabilities. This enhanced brand strength and a foundational principle of our business model, is creating more effective and sustainable customer acquisition solutions for our clients while successfully positioning Fluent as a market leader in a rapidly evolving industry environment. As I've consistently outlined Fluent's ultimate competitive advantage is grounded in our 3 strategic growth pillars: our media footprint, our platform and our performance marketplace. We will continue to test, learn and extend our reach into other media channels as we explore longer-term growth opportunities that a larger Fluent media footprint will create. Regarding our performance marketplace and platform strategic initiatives, we leaned into our CRM capabilities grounded in higher-quality consumer experiences. Not only was revenue quite strong but as importantly, we also managed business mix across our investment profiles to expand Fluent's business unit margins, all while continuing to establish our competitive advantage. Given the ramifications are rather complex, I want to touch on the relevancy to Fluent's business and our performance marketplace. Historically, during recessions and times economic uncertainty, there's both a decline in advertising spend and a significant change in media mix. Fluent's performance marketplace has direct measurable and immediate attribution for our clients and, as such, derisk their marketing spend regardless of the fact they may be reducing total ad spending. In this current environment, while remaining disciplined towards our long-term strategic growth plan, we look to accelerate against our growth agenda and take market share in the process. Regarding the second half of 2022, we see Q3 growth moderating compared to Q2 related to the current economic uncertainty that has led consumer spending less and our clients operating more cautiously. While we see -- we recently seen some consumer sentiment shift across the marketplace, become more heavily engaged with relatively lower cost, lower consideration -- products and services, like media and entertainment, that tend to be more recession resilient. We maintain our belief that on a fiscal year basis, our annual 2022 financial results will continue to show revenue growth returning at or above industry growth rates as we look to earn market share. In closing, while we're being very diligent in managing expectations, we remain fixated on our well-defined growth pillars and we'll continue leaning into strategically compelling 2022 and 2023 revenue opportunities where we believe we have a differentiated position and significant consumer runway. As you may recall, we made a strategic decision to launch the traffic quality initiative to reposition our business and improve the quality of traffic we source into our media properties. Further, we have delivered a strong quarter with profitable revenue growth, thus anchoring the right strategy with strong execution and progress against our operating initiatives. In the second quarter, Fluent generated $98.4 million of revenue, up 34% year-over-year. While leaning on brands, channels and technologies, we're encouraging our customers to come back to our platforms and drive lifetime loyalty and in the process, generate greater margins for the business. The higher quality traffic has resulted in higher engagement by consumers on our media properties, yielded better conversion rates and provided more valuable customer acquisition outcomes to our clients. We believe our focus on traffic quality will continue to use strong monetization which we can then reinvest into media sourcing and product development, driving further client satisfaction and loyalty and turning the flywheel of our model. Our media margin in Q2 was $32.3 million, up 60% year-over-year and representing 32.8% of revenue. During our last quarter's call, we noted the opportunity to drive high-quality traffic from the biddable platform which we are seeking to optimize into high profitability over time. In the second quarter, we increased both biddable media spend and profitability sequentially over the prior quarter, as well as compared to the same quarter last year. Our operating expenses on a GAAP basis for Q2, comprising sales and marketing, product development and G&A, grew in aggregate by $3 million or 17% year-over-year to $21 million. Within that mix, sales and marketing expenses increased $1.5 million driven by an increase in business travel, events and in-person meetings. Our product development expenses increased by $1.4 million, reflecting continued investments that we have made in our technology and analytics platform, as well as development of new ad-based media properties, expanding beyond our traditional focus on web-based media properties. And lastly, our G&A expense increased by $160,000 with the increased operating expenses reflecting strategic investments in the business, as well as enhancements to our technology platform and internal capabilities. Our adjusted EBITDA, a non-GAAP measure, for the second quarter was $9.4 million, representing 9.6% of revenue and up $7.6 million year-over-year. Moving forward, we will continue to manage our media mix by focusing on margin accretive initiatives and driving operating leverage. The early momentum will help us accelerate our learnings while navigating the economic environment and advertiser spend levels, although Q3 growth will be moderate on a sequential basis. As described in our earnings release, the company determined that the decline in our stock price during Q2 represented a triggering event and an indication of impairment of our goodwill associated with the acquisition of Fluent operating business in 2015. Based on this analysis, the company took a noncash impairment charge to goodwill of $55.4 million in the second quarter. We reported GAAP net loss of $56.9 million in the quarter and adjusted net income, a non-GAAP measure, of $550,000. The working capital defined as current assets minus balance liabilities was $51.6 million at the end of the quarter, up 16% year-over-year. In closing, we are confident that our high-quality traffic models and strategic investments are the right path to achieving sustainable growth in our business. As the economy transitions to slower growth and we head into uncertain times, our management team is laser-focused on execution and operating discipline with the goal of creating long-term value for consumers, clients and Fluent shareholders. In that regard, we intend to expand our Investor Relations strategy and outreach in hopes that equity markets will come to see the value we see in our business and the value we are building for our consumers and clients. We are pleased with our strong Q2 results and we are very proud of our team and the hard work that theyâ\u0080\u0099re putting in, in terms of our strategic path and our growth initiatives."
}