{
    "symbol": "CHH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 14:17:10",
    "content": " In 2022, we grew the system size across our 20 brands in the higher revenue segments by approximately 10% year-over-year and saw an outsized increase in royalties driven by this growth. The acquisition of the Radisson Americas brands in August of last year accelerated our strategy of growing our hotel mix with higher revenue-producing hotels and added an incremental $18 million to our 2022 adjusted EBITDA in just four and a half months, exceeding our previously issued guidance. Likewise, we anticipate additional tailwinds from business travelers in sectors such as health care, technology and professional services, especially in the context of the Radisson Americas acquisition and the growth in our brand portfolio mix in segments and hotels that generate higher royalties per unit. Our investments in the WoodSpring Suites brandâ\u0080\u0099s marketing and distribution capabilities enabled us to achieve RevPAR growth of over 33% in the fourth quarter of 2022 compared to the same period of 2019, driven by increases in both occupancy and rate. Throughout my remarks today, I would like to note that our 2022 financial results, unit growth, pipeline and franchise agreement figures are inclusive of the Radisson Americas portfolio, while our RevPAR performance and effective royalty rate results do not include impacts from the acquisition. For full year 2022, a combination of impressive RevPAR performance, unit growth from our higher revenue brands, strong effective royalty rate growth, successful execution of the Radisson Americas integration and robust performance of the platform business drove full year adjusted EBITDA nearly $9 million above the top-end of our previous full year guidance. Our domestic RevPAR outperformed the overall industry by approximately seven percentage points for the full year and met the top-end of our previous full year guidance, increasing 14.6% versus the same period of 2019, which represents 12.4% growth versus 2021. And given our current momentum and the acceleration of our long-term strategic plan, a 1% increase in RevPAR growth in 2023 is now expected to drive $4.9 million of royalty revenue. For full year 2023, we expect our effective royalty rate, inclusive of the Radisson Americas portfolio to continue to grow on a comparable basis in the mid-single digits year-over-year off of a 4.93% baseline in 2022. In 2023, a 1% increase in unit growth in the higher revenue segments category is expected to drive $4.5 million of royalty revenue, while a 1% unit growth increase in our economy transient portfolio of two brands is forecasted to generate just under $400,000 of royalty revenue. We expect our full year 2023 adjusted EBITDA to range between $520 million and $540 million, representing approximately 11% growth at the midpoint compared to full year 2022. I think thatâ\u0080\u0099s probably  I mean, when you take a look at just the historical growth rate of this business, the RevPAR growth has been anywhere from kind of, call it, 2% to 3% on average, and our EBITDA growth typically year-over-year is right around that 7% to 8%."
}