{
    "symbol": "ING",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 08:05:04",
    "content": "  Operator: Welcome to ING First Quarter 2022 Conference Call  regarding future developments in our business, expectations for our future financial performance and any statement not involving an historical fact. A discussion of factors that may cause actual results to differ from those in any forward-looking statements is contained in our public filings, including our most recent Annual Report on Form 20-F filed with the United States Securities and Exchange Commission. Furthermore, nothing in today's comments constitutes an offer to sell or a solicitation of an offer to buy any securities. Good morning, Steven, over to you. Good morning, and welcome to our first quarter 2022 results call. I'm joined by our CFO, Tanate Phutrakul; and our CRO, Liliana Cortan. After that, we will take your questions. For the first time in 2 years, I started this presentation by saying that from a cover perspective, circumstances seem to be normalizing, which is positive. However, challenges remain with the invasion of Ukraine, which is adversely affecting people, including our colleagues as well as already high energy prices and disruptive supply chains. In these circumstances, we help colleagues to safely relocate and manage the risk of our risk-related exposure. At the same time, we focus on our strategic priorities by financing the green transition and improving our digital channels, and we continue to deliver value. This was reflected in the higher preprovision profits, driven by -- and highlight our efforts to finance a green transition and to improve our mobile channel. Operating profit was up 14% year-on-year and 9% quarter-on-quarter, a strong start to 2022. NII, excluding TLTRO, was up on both comparable quarters, which is a meaningful signal in the context of the liability pressure of the past years. With the yield growth normalizing, we can reinvest our replicating portfolio and more positive yields. And as we always said, the effect will come in over time. However, over 2021, we had approximately €600 million drag from negative rates. Excluding TLTRO, we expect NII to be up in 2022. At the same , ECB has not yet increased rates. So for now, a negative interest rate charging remains in place with the current contribution of €300 million for the full year. With inflation higher for longer, the ECB looks set to start normalizing monetary policy in the summer. In non-Eurozone countries, Central Bank rates have already gone up, most notably in Poland. Also with low rates, NII was supported by a high level of prepayment penalty income, which tend to return to more normal levels when interest rates go up. Going forward, the yield curve development will be supportive of NII growth. On fees, we had a strong 9% growth year-on-year. And also on the current higher fee level,  annual growth. Overall  despite inflationary pressure, which was mainly in salaries in some other countries  visible in the growth of the portfolio, doubling over the past 5 years, while fossil fuels almost halved. Going forward, we aim for faster growth of new renewable energy loans to a 50% higher level by 25%. At the same time, we will not finance new dedicated oil and gas fields. Also in Retail, we have taken steps to help customers become greener with the launch of a green mortgage in the Netherlands. I'm proud that our expertise is recognized also by our clients such as Vodafone Ziggo, whom we supported in their sustainability-linked bond as a debut one. And also by external organizations, with 2 green transactions receiving awards in their respective categories. On Slide 5, we focus on another strategic priority, which is our digital journey. The importance of the mobile channel continues to increase, and it is positive as expanding our mobile offering, both improved customer experience and reduces cost to serve. The examples show expanded digital capabilities for our customers, which help the top line as our customers take up more services. And at the same time, we invest in digitalizing processes to both improve efficiency and customer experience by a higher first-time right and shorter time to yes. As a proven example, 2 quarters ago, I mentioned digitalizing the Dutch mortgage process where we reduce our time to yes. And as the process became more efficient, it also allows us to handle higher volumes when needed. This resulted in continued high growth with the number of new investment accounts opened in the first quarter at 121,000, of which 1/3 customers are new to ING. As part of our digitalization strategy, we selected 60 main processes for which we will maximize the end-to-end digitalization. And let me now take you through our first quarter results, starting on Slide 7. Year-on-year NII, excluding TLTRO benefit, was up 1.6%, benefiting from higher results in Treasury and Financial Markets and higher lending volumes. We saw some pressure on lending margins, reflecting a delay in tracking higher funding rates. NII went up 1.3% quarter-on-quarter, again, supported by Treasury and Financial Markets, while we saw the liability -- pressure on liability starting to turn into a tailwind, partly offset by a lower level of prepayment penalty income on mortgages. In Retail, mortgages were again the primary driver of growth but also some growth in business lending. Mortgage lending demand was strong in Germany, but also Australia and Spain. In Wholesale Banking, loan growth was affected by repayments on TLTRO, eligible deals mainly on short-term facilities in Financial Markets. When we look at the pipeline, we see sizing amount is there, so we're positive loan growth in Wholesale Banking. However, given a higher level of macroeconomic uncertainty, for 2022, we expect this to be below our 3% to 4% growth ambition. In Retail, it came down by €7 billion, mainly due to an outflow in Germany following the introduction of negative rates per November 21. Year-on-year, fee income grew by 9% with growth in both retail and wholesale. And this reflected growth in primary customers, the increase in payment package fees and a recovery of the level of domestic payment transactions back to pre-COVID levels. In investment products, fees were lower, although still at a consistent high level as the year ago quarter was a record quarter in terms of brokerage rates. In Wholesale Banking, fees were 17% higher, with -- syndication deals. Sequentially, retail fees were 1% higher -- offset by a lower level in Financial Markets -- lower FTE and lower IT costs, which more than absorbed higher salary costs driven by CLA increases and indexation. Quarter-on-quarter costs were 4.2% lower, the lower marketing and performance-related expenses, while costs in the fourth quarter tend to be seasonally higher. Quarter-on-quarter, the increase is explained by the full payment of the annual contribution to the SRF and Belgian DES in the first quarter of this year. This also applies to the annual Belgium Bank tax, while the fourth quarter included annual Deutsche Bank tax. At the same time, we also need to look forward, and we will invest in areas where we can get the best return. Then on to risk costs, which were €987 million or 62 basis points of average customer lending. In Stage 3, the Russia-related inflow was limited to €71 million as the book generally remain performing. Furthermore, we booked €178 million, reflecting updated macroeconomic indicators and released €124 million in sector overlays, which were taken in previous quarters for vulnerable sectors during pandemic. Aside from these movements, risk costs were limited. While in challenging and growth countries, risk costs reflected collective provisioning, mainly in Germany, Poland and Spain. In Wholesale Banking, Stage 3 risk costs included limited additions to both new and existing files. Finally, Stage 2 ratio was up, reflecting the aforementioned additions, While the Stage 3 ratio went down to 1.4%. And regarding potential spillover of the situation in Ukraine, we see eurozone economic growth impacted and expect inflationary effects to stay longer. While we don't expect a recession, a stagflation is scenario a possibility. However, so far, we have not observed a meaningful impact on credit risk. Since the end of February, we have reduced our resin exposure by €900 million and continue to bring this down. Of this amount, €1.3 billion is onshore with €200 million covered by European parent guarantees and partial remaining exposure is Central Bank deposits. Our local capital is €100 million, and we have no internal guarantees outstanding. €4.5 billion was offshore with €200 million covered by -- sorry, €1.2 billion covered by ECA and CPRI, which is the outstanding amount. Undrawn committed facilities are €700 million and notional hedge exposure is €600 million, which is related to client business. Our Financial Markets recorded a good job over the past 2 months reducing the amount, and we work to reduce this further. As mentioned, we've taken €800 million loan loss provisions, which reflect capital impact from expected losses where RWA impact reflects unexpected losses. ROA on our Russian exposure has tripled in the first quarter, reaching €13.3 billion. So at 12.5%, this is equivalent to a €1.7 billion capital impact. So combined with the risk costs, this amounts to €2.5 billion of potential impact already included in CET1 capital. Regarding sanctioned entities, please note repayments of ING are allowed and are being received. The decline was driven by higher RWA, which were up by €21.8 billion, including €1 billion FX. This was primarily due to €19 billion of higher credit RWA, excluding FX, which included €7.3 billion for the risk weight for -- the other 50% was reserved for future distribution in line with our policy. On distribution plans, the final '21 dividend was approved at our AGM '22 and will be paid out on the 9th of May. And in line to converge our CET1 ratio ambition, we will distribute an additional €1.25 billion. Based on this, €0.232 per share will be paid out on May 18, and the share buyback for the remaining amount will start on the 12th of May. As you can see on Slide 14, CET1 ratio remains well ahead of our ambition. On ROE, we saw some impact this quarter from the elevated risk cost. However, with the continued growth of customers, loans and fees as well as focus on cost and capital optimization, we maintain our ambition to provide an attractive total return. Cost income remains an important input for ROE, and we continue to work on our ambition of 50% to 52%. And we manage the risk of Russia exposure while we keep the focus on our strategic priorities, including financing the green transition and improving the digital channel. And last but not least, we continue to deliver strong performance financially. This was reflected in a higher preprovision profit, driven by resilient NII, higher fees and lower costs as well as a healthy return for our shareholders. Risk costs were elevated at €987 million, mainly in Stage 2. The CET1 ratio declined to 14.9%, with 50% of the first quarter resilient net profit reserved for future distribution. The main driver was RWA growth, primarily for the Russia exposure and these mortgages. And finally, on capital distribution, we will pay a €0.41 final cash dividend and a €1.25 billion additional distribution as announced today. With that, we will go to questions. The first one is around the Russian exposure and the actions you've taken this quarter, I mean your introductionary comments and in your slides, you mentioned basically you cover within the CET1 ratio of €2.5 billion. I was just wondering to what extent do you think this €2.5 billion should cover, yes, basically the future? Or do you see -- obviously, that has gone up quite a bit more. So I was just wondering if you could give a little bit of guidance on what kind of tailwinds we should expect here because I think this could be high-teens millions of quarterly tailwinds for your NII trajectory, which is quite substantial. Yes, correctly, we have had the elevated risk costs with respect to the Russian situation of €834 million, as you noticed. And in trying to show to you how much we feel confident and adequate with current provisioning and impact on capital, we have some this impact of the LLPs of €834 million with the additional impact that we have experienced through inflated RWAs, which have resulted in additional 1.7 capital set aside for this cost. So first on the risk cost, as you've seen, only €70 million out of these risk costs referr to the really defaulted exposure. The rest, Stage 2, which is following our very prudent risk management framework, governance and processes in place, is actually reflecting the downgrade of the Russian-related exposure and as well a certain watch listing of the clients taking a prudent approach. On top of that, you have seen that we have in the 60 day were able to actually manage down our exposure by additional €1 billion. So all actions are showing that currently, we feel that our best estimate is adequately provisioned and adequately capital impacted. And then, Robin, on our NII. If look you at our Q4 disclosure, you can work it out that basically, we had a reduction around €600 million in 2021. Because we do barbell replication, which means that a considerable part of our replication sits in the 3 months bucket. So if the ECB, as anticipated, would move the rates in July, that would accelerate the tailwind that we have today. So I think in the past, there was the market at least had the perception that a rate hike from the ECB would initially be a headwind for NII. Well, I don't think we ever said that rising rates is bad for banks. In fact, it's the opposite. We think rising rates coming out of negative rates is actually positive for financial companies and positive for ING, in particular, given our big retail deposit base. But also the part from negative to 0 basically, I think that's the more doubtful part of the sensitivity. Well, we'll give you a bit more detail on Investor Day. But what we can say now is that, as we mentioned, the €600 million compression we saw last year has disappeared. And that we expect, actually this year, that excluding the TLTRO impact, that our NII will be positive this year. It seems that you're effectively silently writing down the exposure to Russia, both onshore and offshore. So you're not exiting Russia, unlike some of your other peers. And if I may, a super quick third one on fees. And the question on Russia, I will do as well actually. So we basically say that already with the current improved yield curves that we see, the negative drag has completely gone. NII, excluding TLTRO, this year will be up compared -- we expect it to be up compared to the last year. In that light, with regards to lending margins, what we have seen is that the prices to The Street were up actually across-the-board in many countries. And typically, you see that the cost of funding, it takes time to fully price in the cost of funding into The Street price as well. Still arguably, there's still a lot of liquidity in the market. So do we then -- so that also means that we don't necessarily expect a big increase in margins at this point in time, at least not on the the lending margins to our clients. But on the liability income, we have actually turned the corner. On Russia, well, look, first of all, we want to keep the people safe, which is what we do also in Russia, by the way, and we are making sure that we fulfill all the sanctions. With regards to the book, what we want to do is to make sure that we actually get repaid. And that basically means that we are continuing to decrease our exposure, gradually winding down our exposure. We have -- part of our remaining exposure is short-term facilities and part of it is more project financed, which is supported by ECA and CPRI insurance. And this is the way for us to actually gradually wound down the book and decrease our exposure in the interest of all our stakeholders, including our shareholders and our savers. And regarding fees, I mean, like we said, but I will not dwell on the many elements that we have or pillars, we have to grow fees. We haven't split it out separately, but the fees of the partnerships with -- such as AXA and Scalable are relatively small. But they also help in the overall, let's say, client experience that clients have with us, which will help NPS and which will, in turn, also help the quantity and, therefore, the quality of their interactions with us and, therefore, also the business they do with us. So yes, fee business of partnerships is still relatively small, but it also helps the overall experience they have in doing business with us, and that also helps our fee business overall. Our next question is from Mr. Kiri Vijayarajan, HSBC. When I look at the RWA and the ratings migration there, it looks like you've actually had positive ratings migration if you exclude what you've done for the Russia exposure. I will take the question on fees, and Ljiljana will take the question on RWA. With regards to fees, like we said, I'm confident that we can continue to to grow also this year our fees by 5% to 10% per annum. First of all, we continue to grow our primary clients and the level of interaction with them. Point two is that in many of the markets, we are competing with, let's say, local champions or local banks who increasingly feel pressure to increase fees on the back of of difficult market circumstances. We have seen it, by the way, lately in the Netherlands where ABN AMRO increased their payment package fees with 50%. And three, in a number of markets, we're still actually relatively low in terms of our fee potential also in terms of the interaction we have with our clients. And even though, and I proudly always say every quarter okay, and now we have 2 million brokerage accounts in Germany And this quarter, we have 2.1 million brokers accounting in Germany, and that's all fantastic. But if I look and that goes for all the markets compared to the total number of clients we have, let's take Germany. So it also means that we have still a quite some way to go to deal with this leaving alone what we do charge for payments, what we do with insurance. And we're gradually catching up, but we're not there yet at all of where we are supposed to be to, let's say, our \"fair market share,\" if you will, compared to the side that we have as an organization. And on the RWA, yes, you're correct. In total, we do see increase in inflation of RWA based primarily, as we say, on the credit risk side due to introduction of the risk weight for the Dutch residential mortgages. And on the other side, €9 billion, as Stephen mentioned, for the increased density for the Russian portfolio. If we would actually neglect these 2 points, we would see on the rest of portfolio and specifically on the Wholesale Banking side, a decrease. We have seen in certain industries, for example, RF some small increases in the portfolio, which absolutely contributed to the decrease of RWA. But as well in the other parts of the Wholesale Banking, we do see reduced RWA based on improved structure, both in terms of the rating of clients but as well in terms of the products and maturities. So in total on Wholesale Banking side, when isolating Russia, the improvements are positive. I mean it's roughly 35, 40 bps impact. Second one is actually on cost, very strong, down 2% clean. And then just a final one will be on the front book margins in the Netherlands on the mortgages, which seems to go the right direction. So it seems that the funding cost is going to the clients, clearly, there. I will do the -- thank you, Benoit. I'll do the question on front book and costs, and Tanate will talk about the distribution. First of all, on the front book, yes, I mean, typically, you see that in the quarter where you produce, so you go to the market to offer that then is delayed. With the quarter before, you can typically price in the full funding costs. So that you will expect as funding costs continue, then also margins will be impacted. Of course, it's a comparative dynamic, but that's what we typically have seen in the past. But one thing to note is that if that happens, also when you then look at prepayments, we're also benefiting always from prepayment income, whereby people pay a penalty for prepaying part of their mortgage. But when the interest rates goes up, that part of your income will decrease. But that is excluding the prepayment income, which will likely decrease when margins go up, which is logical. When we talk about costs, I mean, yes, we have now seen -- well, first of all, we are strict in costs, very focused on making sure that we can deliver what we need to deliver with the applicable FTE amounts -- number. But secondly, we've also taken a number of decisions in the past year or 1.5 years, and those decisions are now gradually filtering through. So we're  That's why I said even with all the inflation going on in all the markets, we cannot ignore that. And going forward, we then need to look at what additional measures do we need to take. Obviously, we also need to invest. And if inflation stays the way it is currently, yes, that is a challenge for all of us. But we're also, in the meantime, digitalizing processes our, which both have a benefit for our customers, but also for our cost to serve. And Benoit, on capital, clearly, we go through the normal capital management analysis to come with the €1.25 billion. And clearly, the tailwind on NII helps support that. We look, of course, at the Russian exposure, what the worst case could be, a stress test scenario. And based on a combination of that as well as any potential regulatory capital coming our way, and that's how we derived the €1.25 billion, which is rightsized from where our thinking was at the end of February prior to the war. And of course, we have been having constructive discussions with the ECB to arrive at this number, which they approve for us. I'm sure you're running internal scenarios, particularly from a stress testing perspective. First, Tanate, I think on share buyback, and then Ljiljana on --\n Raul, on the share buyback, I think it's a uniqueness of Dutch tax requirement that we need a certain minimum cash payments for share buyback to be exempted from withholding tax. And that's why we have that particular split that we talked about in this quarter, it's 70 against the 380 payment. But having said that, of course, looking at the share price, if it's discounted from book value substantially, then we will be focusing more on share buyback. On stagflation, yes, we deem the -- I would say, the threat, if not already reality, of stagflation is present in our economies. With that respect, we have already on the assumptions for the loan growth, I would say, downsized it to the lower range of the 3% to 4% loan growth yearly. We do, however, benefit, I would say, from the -- our books and coverage to manage this going forward. Clearly, it remains the challenge for all of us, and we are following the situation and assessing the scenarios making sure that we are adequately provisioned. Well, it's difficult to say. We definitely keep our, I would say, through the cycle look for the years to come. It might be different from year to year, but through the cycle, I believe we're going to be there. We have significantly, as I said already, provisioned part of the portfolio through Stage 2 provisions and also through still some existing overlays from COVID time and also from the mortgage book, you will remember from the last quarter. And also, you said that the €1.25 billion figure was rightsized from your expectations at the end of February before Russia. And what we have done also the last quarter on the wake of higher inflation, on the back of disrupted supply chains is already take overlays for mortgages and part of the Wholesale Banking book in risk cost. Now that, of course, is helping us now that, that inflation is really coming or persisting. So it also means that, yes, we still have a buffer based on corona. That's helping the rest of the book and, indeed, when looking at the first quarter. If you look at the remaining risk cost outside of Russia, the total risk costs were €987 million, Russia also about 85% of that. So it basically shows that for this quarter, we do not see current big problems looming. Otherwise, we would have taken the cost. Then on capital, it's not a simple mathematics that because Russia cost us €2.5 billion, we would have paid more from that perspective in capital returns. I think we just take a comprehensive view, what is our earnings ability going forward. Well, the future is the future. So it decreased basically €2 billion in -- sorry, €1 billion in 2 months. And then secondly, on -- just a follow-up on the question that was just asked around the negative rate charging. And Russia, I give the floor to Ljiljana. Yes, this is the normal, I would say, rundown of our portfolio based on the maturities. As you might know, our exposure is partially short term, partially long term. On the long-term side, we are involved in several projects and asset-based financing where we are as well credit insured for the good part of the portfolio. So what we are currently running down is the short part of the book, and we will continue to do that. Clearly, the good relationship with the clients and long-standing relationship the clients helps out in that respect, which was obvious in the last 60 days when we were able to, in a regular way, manage down the portfolio by almost €1 billion. Then the question on negative rates charging, the €300 million that Steven referred to is mostly retail-related benefits. And from the wholesale bank, we are neutrally geared towards negative rates. As negative rates disappear, we don't expect to lose revenue. In fact, we should benefit from that actually in terms of PCM business. And sorry, going back to the run rate of decline -- half of the book or any more because it seems like you have a large shorter part, but you also have one. So look, this is an emerging market. Even outside of FM, there wasn't any. And presumably, that's not just in Russia related. Especially, previously, you said the resumption of corporate lending was a key driver for you both in the next couple of years. Then second, thanks for the helpful guidance for this year on NII. Omar, on the loan growth, if you look at the loan growth for Wholesale Banking and when we saw -- well, first of all, let me give you a few pointers. So if you look at the fees in Wholesale Banking, the growth there comes from syndicated markets. So what we do see is positive is larger underwriting, syndicated deals with comment fees, which are, in general, more attractive for banks as well. So we do see pipelines that are good, and they continue to be good. And so I think this quarter, and that will continue a little bit. Two, on real estate finance, that came down a little bit also on the back of corona less need for certain uses of buildings. And we're actually focused on that, where do we have multiuse of buildings and where not. So those are 2 effects that came in, in the first quarter. Corona repayments -- sorry, corona repayments, the repayments of TLTRO-related facilities will continue in 2022 at a lower rate. So it means that for Wholesale Banking, we do expect loan growth, but at a lower pace than the 3% to 4% that we initially indicated. With regards to NII on the sensitivity, I mean, clearly, you mentioned Poland, but I can also mention Romania. But there's, every day, so much news about it that we will just wait and see what it will be. But already now, even with that rate not being there and short-term rate being positive is also positive for us, but with the current rate curve, the €600 million negative drag last year has evaporated. And that means that we're already now, even before the ECB has done anything, are positive on the NII turning positive this year. As a matter of fact, Tanate will do that, which is good. And then on the number of lower prepayment penalties, yes, we don't give that. But what you we would say to guide you with this that we would expect the margins, excluding prepayment penalties to move to a normalized level once the funding rates get fully filtered through in our -- in the market rates. But that gives slightly pressure on the total NII in the Netherlands because that was, of course, a significant part over the past number of quarters. That's very helpful, especially that we'll hear more on the sensitivities at the Investor Day. Mr. Goy, Are you there? I mean in some markets, they moved up a lot year-to-date, Germany, 2.5x. We have, of course, the impacts on the -- on the other hand, we see that in the Netherlands, there is -- couple of quarters is that we booked a record mortgage growth in Germany as well, and we don't see that demand decreasing in the short term. Our next question is from Mr. Farquhar Murray, Autonomous. Just two questions, if I may. Firstly, just coming back to the capital update and specifically the kind of question around how the €1.25 billion was arrived at. And then secondly, just coming back to Russia. In answer to Giuilia's question, you give a bit of a sense of how the exposures will develop. And on a subsidiary point, the €4.5 billion of market RWA we saw in the quarter, how would that have develop given the markets we've had since? So on capital, should we look at a pro forma 14.5% as our target level for the end of the year? And the actual the credit component as well in Russia, will it develop in line with the exposure. I mean, look, we have seen currently a decrease of our exposure with approximately €1 billion. I've just said to Giuilia, I believe, that we have a sort of a barbell in our exposure, has short-term unsecured, long-term secured. And the short-term exposure, if that gets repaid back, we also see some write-backs or term banks in RWA because that happens when we reduce the exposure. So just to clarify the 50% payout for the ordering dividend, is it -- so definition on resilient earnings. And then on the capital return, I mean you just said again, like in Q4 that would like to convert towards 1.5% within the next 2 years. On the dividend, does the -- I didn't say two years. And I think in the capital return, our conversations with the ECB has been very constructive. And it's really very much based on our own capital management, looking at the geopolitical situation, looking at capital generation that will determine ultimately the pace at which we get to 12.5 So you can imagine that given where we are today, the clarity of the future, it's a little bit more foggy than it was in February. But suddenly not being constrained by the ECB, it's more how we see the geopolitical and credit risk as we stand today. Sorry, I didn't understand the comment about 2 years. And just on the sanctions exposure, the €3.3 billion, and your comment imply no additional exposure, I guess, would suggest that the €2.5 billion capital is largely against that exposure. And then sorry, one last question. On the regulatory headwinds, no, we don't see that. We have had -- I've said before, Basel IV includes all the trim missions and Basel IV and the output and the input. But in the end, it all comes down to the same Basel IV direction of the ECB. We do see now and again, based either on volatility or based on model updates, you see spikes up or you see spikes down. But that is usual, so we don't have anything else going to report on that. I mean is sanctions could increase, that's true. So we do get repayments, and we are allowed to receive repayments also from sanctioned entities. So as long as companies are performing, we get repaid -- move them to stay. Yes, by and large, except for the €71 million we have seen, our Russian clients are performing. On the total risk cost for Russia, €834 million, approximately a bit less, around €200 million refers to the onshore exposure. It has €1.3 billion of exposure incurring losses in that subsidiary, in which case we would worry to lose up to €1.3 billion or when the capital is gone, it's gone and the subsidiary goes away, including the RWA? So look, I mean, we're currently talking about going concern. So we're currently looking to get repaid, both onshore and offshore. If you look at our capitalization of our Bank in Russia, that's currently €100 million. If worse comes to worst, if that's gone concern, which basically means you would lose your sub in Russia, that means that we would look -- that we would lose the equity in Russia, which would, in this case, be €100 million. It would mean we would lose our equity, that would be €100 million. A lot of numbers on NII flying around, and you did mention you will provide some more details with the Investor Day. But obviously, that's more than a month away, and people need to think about their NII numbers in the meantime. And there's a €300 million benefit from negative charging, which is partly offsetting that. I mean, by the way, I think the assumed rate rises stay on or after the Investor Day, but I'll grant you that. And I see that you need, and I understand that, that you want to have more guidance on NII and what it does. First of all, although the market has said in the past that -- so you said that there is no -- they may not -- we thought that R&D there was no benefit of rate rises. Just a short one on Basel IV, given the risk assets have been moving quite substantially this quarter. Yes, Esther, we can hear you very well. Just only a follow-up concerning the GDP growth, I mean, the sensitivity. And look, I mean, GDP is only one of the elements that doesn't impact as GDP. So there are heaps of elements that link that are not necessarily that you then also would need to know, but because GDP stand-alone is a much too simple metric to base the cost of risk on. Otherwise, we wouldn't have needed Ljiljana for this because it's actually quite complicated. Could you maybe give us a bit more explanation about the tax implications to do buybacks in the Netherlands I guess it has to do with how much cash dividends you pay, but I'm just trying to understand how this will affect future decisions on capital return, cash versus buybacks. I mean on -- thank you, Robin. But you do see is -- well, you know how big the book is. You typically know what the NIM is, then you can make sort of an extrapolation at certain levels what the revenue on an annual basis was with Russian clients. By the way, it's gradually winding down, so part short term, part longer term. But in the meantime, of course, and that's what I said also in the past, if you look at the total exposure, we have a total exposure -- shares coming down."
}