{
    "symbol": "TECH",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-01 12:55:05",
    "content": " In any case, our run rates in Europe picked up considerably in September as researchers seemingly returned to the labs; however, the strong double-digit growth in September, which by the way is continuing in October, wasnâ\u0080\u0099t enough to overcome the tough Q1 growth comp year last year when they grew a record 20%. Now letâ\u0080\u0099s discuss our growth platforms, starting with our protein sciences segment where organic revenue increased 3% for the quarter on a very strong comp from last year, when the segment grew over 26%. Given the tough comp we faced this quarter versus prior year, I will point out that our two-year organic growth CAGR for Q1 was approximately 13%, right in line with the early part of the five-year plan our leadership team presented at our investor day in New York City a little over a year ago. Operating margin for the protein sciences segment was 43.0%, a decrease of 270 basis points year-over-year with productivity gains more than offset by the impact of foreign exchange, price versus inflation dynamics, the fiscal year â\u0080\u009922 carryover of strategic investments to support future growth, and the Namocell acquisition. I think the key question that weâ\u0080\u0099re getting here is how should we think about protein sciences in the second quarter here, how much of this was really sort of pull forward of demand versus actual weakening of demand, as you talked about Europe and China, and--because I canâ\u0080\u0099t recall a time when you had 3% organic growth in this segment, so maybe just walk us through what you see now and how should we think about the next quarter and for the full year. You know, we have not had any supply chain issues the last couple years and weâ\u0080\u0099ve been pretty steady-eddy and very good growth, and a lot of other instrument makers and a lot of other higher capital or higher signature purchases have been--have had more supply issues, and we think thereâ\u0080\u0099s been a little bit of a bubble of pent-up demand in some areas, and I think we just maybe lost out a little bit on priority in some of the purchases this quarter, is what weâ\u0080\u0099re coming to. For us, when you look at the smaller purchase, what we call a run rate business which is lower dollar value, which is probably 80% of the purchases coming through, the growth in Q2 and continuing here in October continues to be mid-teens growth, particularly here in the U.S. Back to Chuckâ\u0080\u0099s earlier point, itâ\u0080\u0099s really the larger bulk purchases that had tougher comps and were more, call it soft this quarter and probably faced more competition with some of the supply chain breaks that were occurring in the larger dollar instrument purchases in terms of competing for dollars."
}