{
    "symbol": "TECH",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-02 11:51:02",
    "content": " In our second quarter of fiscal 2023, we delivered 4% organic growth on top of a challenging year-on-year comp, where we grew 17% in Q2 of last year. The consumable run rate business and instrument order book also suggests that underlying research activity is still robust, and this should become more evident as we pass the remainder of last fiscal year's high biotech comps. Now let's discuss our growth platform, starting with our Protein Sciences segment, where organic revenue increased 2% for the quarter on top of a strong comp from last year when the segment grew 19%. During the quarter, we continued to gain traction with our portfolio of cell and gene therapy workflow solutions despite a challenging year-on-year comp where we grew our cell and gene therapy business over 80% organically in Q2 of last year and within that, our GMP protein is over 185%. Please proceed with your question. So the mid-year -- the mid-teens is the average over five years, but again, as the cell and gene therapy continues to ramp and become more material for our business, particularly the GMP proteins, as well as the Exosome becomes more material to our business and continues at those kind of growth rates, and as Chuck alluded to, that we're still barely scratching the surface of the potential there, that's what kicks us into the mid- to higher teens growth rates later on in our five-year plan. Please proceed with your question. I mean the bottom line is we got way ahead of the curve and I had a forecast last couple of years right in COVID and some of that's re-normalized, but we're still safely in the $2 billion number, we think. Please proceed with your question. Please proceed with your question. Please proceed with your question. And yes, that's why we said we expect Q3 to be very similar to Q2 in terms of organic growth because the number of one-time bulk orders from these small biotechs was similar to Q2, perhaps a little bit less, but also keep in mind that we had the very large ExoTRU licensing agreement with Thermo Fisher in our Q3. Please proceed with your question. Please proceed with your question."
}