{
    "symbol": "OPAD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 22:46:06",
    "content": " Your line is now open. I think it's going to be pretty volatile until the end of the year, especially in places like Phoenix and Denver, and some of the really high home price appreciation markets that we saw due to affordability. Your line is now open. And so what we saw in the third quarter, that's where you're going to see the fourth quarter as moving through it a lot more and more of these homes is that there was a pause as the buyers who thought they were qualified for a certain amount mortgage rates increased. Your line is now open. Your line is now open. And to your point earlier and I have mentioned this for the last six years is when there's a market transition, the importance of renovation because of everything that we just mentioned, being able to control the renovations, your cost, your efficiency, your timing, and that is going to be really important, just again from the supply and demand, we want to hope to sell first. Your line is now open. So where -- the markets that are the most volatile that we're expecting more depreciating prices in we're being extremely careful in those markets, and you're going to see it with the volume that we buy in those markets, place like Phoenix and Denver, Vegas, those markets, we are expecting still a good decline in those markets. You're not seeing the nearly the impact that you're seeing in some of these other markets, we're getting -- we're buying more homes in those markets. So we're underwriting with what's more wider margins, more assumptions, especially with purchase price and knowing that, that home in a lot of these markets is not going to be worthwhile -- what it is when we underwrite that, so like I said, that the early signs of markets are performing well. But that helps them and helps us to work with them on selling the home in the open market, but that's not anything that we're going to buy, just because of the uncertainty in the market. Your line is now open. I was just going to say one of the things that we're seeing right now in some of the most volatile markets is -- the nice moves are not happening right now, some of them wants to upgrade their home or their kitchen or that's just not happening."
}