{
    "symbol": "OPAD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 23:21:06",
    "content": " Last year, we sold over 10,000 homes in the year for the first time in Offerpad's history, completed 9,985 renovation projects, increased our cash offer request from the Agent Partnership Program by 90% year-over-year and increased our asset-light FLEX transactions, including listing, buying and mortgages by 90% year-over-year. In 2023, this means we plan to retain and build our foundational cash offer, listing service and mortgage business, response to grow our footprint with an increased focus on market penetration and expand our business-to-business partnerships and services, allowing Offerpad to grow our asset-light offerings, seamlessly assisting customers to start to finish, buying a new home, selling their current home, financing the purchase and providing a free local move removes friction from a homeownership experience. Our continuous focus on cost management, the infusion of incremental capital, our nearing completion of the disposition of the legacy inventory, along with the positive performance of homes purchased during the fourth quarter, all support our expectations that Q4 results represented the low point of our reported net income, and we expect to see sequential bottom line improvements beginning in Q1 2023. And so the adjustments we make can build in more risk, and that's from time to cash, how long you're going to own the home to the type of homes that we're buying, like, for example, derisking ourselves for median home price homes is really important. Thank you, Mr. Tomasello. And so, we're definitely focused more on the median home price, allowing some more time to sell that home once we acquire that home, and then build it in other assumptions like for closing costs contributions for when we go to sell the home to help the buyer on that, and that's something that, when the markets on the uptick, you don't have to underwrite it, but we're underwriting that in there as well. The other thing that I'll just highlight - yes one other point on that is that, what we're seeing when we talk about more consistency in the market, if you remember the last time we talked, they said that there's so much equity that homeowners have in their home, the price reductions they were doing were very inconsistent. Thank you, Mr. Tomasello."
}