{
    "symbol": "EC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 19:13:02",
    "content": " The average production in 3Q was 720,000 barrels of oil equivalent per day and so far this year we have an average of 706,000 barrels of oil equivalent per day due to the increase of our execution capacity, which has improved the performance of the fields in Colombia and our growing unconventional operations in the US in the Permian. The increase in the capacity of more than 50,000 barrels per day at the Cartagena refinery, thanks to the successful start-up of the interconnection of crude oil plants IPCC project taking a firm step to guarantee the supply of fuels and Colombia's energy sovereignty. In order to strengthen the company's operation and contribute to the hydrocarbon transport business, two new tanks each with a storage capacity of 100,000 barrels came into operation at the Sebastopol station of the Mid-Magdalena trunk line, increasing the storage capacity of this strategic asset of the pipeline system by 26%. The lifting cost increased by 9% versus the third quarter of 2021 from $8.45 to $9.17 per barrel, mainly as a result of greater operational levels and the influence of inflationary pressure on the cost structure. EBITDA per barrel of the hydrocarbons business, which does not include ISA's contribution, increased $27.1 per barrel, compared to the first nine months of 2021, reaching $67.3 per barrel explained by higher realization prices of the basket of crudes and products incorporation of ISA and the increase in sales volumes. In the Energy Transmission and Toll Roads business, ISA's EBITDA margin excluding the construction business closed at 83.6%, mainly explained by the positive effect of macroeconomic variables in Colombia, Chile and Peru and the entry into operation of new projects since 4Q 2021 in all of the company's geographies. In terms of the Ecopetrol Group's consolidated results, the following standout, EBITDA margin stood at 49.5%, driven by higher realization prices of the crude and product basket incorporation of ISA and strong performance of the Permian asset and the Cartagena refinery. ROACE continue to increase and stood at 19.1%, during the first nine months of the year, compared to 10.8% in the same period of 2021, explained by higher operating income in line with the previously mentioned factors. Regarding CapEx performance, during the first nine months of the year $5.5 billion were executed, 74% more than in the same period of 2021 out of which $4.8 billion correspond to the hydrocarbon business. Regarding the financing of the acquisition, during 2021 and 2022 we carried out two liability management operations for a total of $3.2 billion, which allowed us to improve the maturity profile and reduce expiries in 2023, thus the balance of the international loan taken for the acquisition of ISA amounts to $472 million, which will be refinanced over the coming months. I'm just asking because if I look at the company right now in 2022 full year picture and I just try to do like a quick parallel in 2023 this new government is going to increase taxes, let's say, by COP5 trillion on Ecopetrol also depending on the assumptions. With regards to your second question around gross debt levels basically we closed with a healthy gross debt-to-EBITDA ratio in the third quarter and that's going to continue to be reduced over the next few months, and the outlook is a positive one for next year."
}