{
    "symbol": "TEF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 00:43:43",
    "content": " On Slide 3, you can see our improving organic trends with revenue growth accelerating by 2 percentage points, service revenue by 1.9 percentage points and OIBDA by 1.3 percentage points versus the first quarter figures. As for the revenue base, B2B revenue grew by 3.6% year-on-year in organic terms in the second quarter, whilst improving the mix with an increased contribution from the digital ecosystem development mainly in Spain and Brazil. In the second quarter, revenue grew by 5.8% year-on-year and OIBDA by 3.1% year-on-year with improved operational leverage in both fixed and mobile on the back of own brand momentum and some support from the recovery of international roaming. This also helped VMO2 returned to revenue growth in the second quarter with accelerating OIBDA trends of plus 4.8% year-on-year, which were also supported by cost efficiencies and the start of the realization of synergies. Organic revenue and OIBDA growth accelerated to plus 11.1% and plus same, 8.5%, respectively, and to plus 34.9% and 17%, respectively, in reported terms. Solid year-on-year revenue growth continued, up 72% in the first half of '22, massively outperforming the market with also constant perimeter growth of 30%. During the first semester, Telxius subsea cables good commercial momentum, together with good cost management contributed to a year-on-year organic OIBDA growth of 6.4% and a high mid-teens figure on a reported basis. It is worth noting the supportive trend on LatAm currencies, which had a strong positive effect on year-on-year reported growth, driving revenue and OIBDA growth of 18.4% and 33.4%. On B2B at group level, we are seeing resilient B2B growth, we are 3.6% up in the second quarter in organic terms and revenues. Our strategy has been resulting in an ARPU increase -- convergent ARPU increase of 3.1% year-on-year in Q2 in spite of the fact that in the second quarter, we always experience a seasonal factor, which is the downgrade of the end of football season, that in this quarter has been less impacting than in previous years, leverage on our new conversion portfolio."
}