{
    "symbol": "LBTYA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 15:22:05",
    "content": " I have say, given current prices, this may be the largest gap between public and private values that I've ever seen, with no discernible decline in private market demand for Telco assets, and not surprisingly we’d accelerated our buyback program, which as you recall was targeting a minimum of 10% of the shares this year. I think it's also important to point out that we do not see any noticeable impact from Fiber overbuild, which shouldn't be surprising because we're already marketing 1 gig services to 100% of our homes, and continue to see meaningful increases in average customer speeds in our network, which now exceed 230 megabits per second, up 24%. Your line is open. So you know thus far I think the ecosystem’s worked well; however, as we saw through the pandemic, there were material increases in data usage and broadband, you know capacity utilization anywhere from 30% to 40% a year, either both on mobile and on fixed, and so we will bear the burden of increasing investment in our networks and you know it certainly has had some impact on our decisions in certain markets to invest in fiber. Your line is open. Your line is open. So the minus 1000 broadband net ads, could you comment a little bit on how this looks in the BAU footprint compared to the new footprint, whether you’re seeing disconnections also in the new footprint potentially on price rises, whether that’s sort of normalizing and approaching the BAU footprint, and also whether you do see at all a difference in disconnection where you are actually facing Openreach fiber, that’s being actively marketed in those areas where you do not face that. Your line is open. Your line is open. Listen,  address the first question around broadband in particular we're seeing in the market, but as it relates to the network, listen, we have a – what we believe today is a very strong network strategy, focused principally on capacity expansion, you know CPE swap outs and you know where it makes sense, investments in fiber, both in B2B and in new build, you know because our research says that that’s the principal issue, it’s not so much headline speed. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}