{
    "symbol": "CGEN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 01:14:10",
    "content": " During our first oral presentation at SITC, Dr. Michael Overman from MD Anderson presented encouraging overall response rate following treatment with COM701 in combination with nivolumab in heavily pre-treated metastatic MSS-CRC patients, a hard-to-treat tumor type, typically not responsive to immunotherapy. During our second oral presentation at SITC, Eran presented data showing that COM701 in combination with nivolumab results in potent immune modulation in the two MSS-CRC patients with liver mass who responded to treatment. This data in an additional cold tumor type, typically not responsive to immunotherapy, is further supported by encouraging data in platinum-resistant ovarian patients treated with dual and triple combination therapy blocking PVRIG and PD-1 with and without blocking TIGIT. The combination of our translational data from patientsâ\u0080\u0099 tumor centers, along with our preclinical and clinical data suggests that the increased infiltration of T cells to the tumor microenvironment following blockade of PVRIG maybe needed to sensitize the tumors to TIGIT and PD-1 blockade. Observing two patients with anti-tumor activity, one stable disease and one partial response for 6 months or longer is encouraging, considering that this is a hard-to-treat tumor type in which the patients on the study have been extensively pre-treated and the median overall survival in this patient population is slightly less than 6 months when compared to standard of care. To go into details, we shared translational data from 13 patients with a static MSS-CRC, as I mentioned, treatment with COM701 in combination with nivolumab when associated with potent immune activation. We also presented translational data in 5 patients with another cold tumor, platinum-resistant ovarian cancer, treated as COM701 in monotherapy. Moving now to setting expectations ahead of the platinum-resistant ovarian cancer data, which we will present at ESMO-IO on December 8, we will present preliminary data, including overall response rate, duration of response, safety and very initial translational data from 20 patients with platinum-resistant ovarian cancer who are treated with COM701 in combination with nivolumab and 20 patients who were treated with COM701 in combination with nivolumab and BMS anti-TIGIT. So when we started the program based on preclinical data and also based on expression profiles in tumor samples taken from patients, not patients in our study, we were prioritizing ovarian, endometrial, breast and non-small cell lung cancer."
}