{
    "symbol": "CGEN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 23:25:10",
    "content": " In our COM701 monotherapy and combination with nivolumab studies, presented at ASCO in 2021, we showed partial responses or stable durable disease in patients with low expression of PD-L1 with tumors that are less inflamed and generally less responsive to approved checkpoint inhibitor. As of today, we have presented data in third line or greater setting from 12 patients using various doses of COM701 with or without nivolumab across studies and we have shown encouraging preliminary anti-tumor activity with an overall response rate of 8%, including one partial response of 44 week. Next, non-small cell lung cancer, an indication we selected as high priority due to clinical landscape and regulatory considerations, as an inflamed tumor type sensitive to PD-1 and possibly TIGIT checkpoint, non-small lung cancer may have an increased probability of responding to our triplet combination. Given our strategic decision to end the cohort expansion studies early, a year and half prior to projection completion of enrollment and focus our efforts on the prioritized indications, we do not currently plan to present data from the other cohorts. I think that I'll say to the management that the decisions that we're taking are really well informed by bold and decisive, and we do think that with the insights that we have and with the market conditions and the fact that we can focus on the triplet and two indications, that's the right way to go. Relatively, I would say that CRC was not pre-identified initially is one of the highest, highest indication where non-small cell lung cancer was, but it definitely has high expression of the pathway and when we also saw the clinical signals, it was again one of the indications that was not initially the top priority, but when we mentioned with the clinical signals, it was an easy choice to move this one. I guess that if we would try to be -- would trim less the studies, I guess, we would focus may be on more indications in parallel, but with that in mind, I'll tell you that we feel very strongly that that what we're doing now is not compromising on our ability to exemplify the value of COM701 and now, by the way, also COM902 and that we feel comfortable that this is the right decision."
}