{
    "symbol": "STWD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 14:23:10",
    "content": " In Commercial Lending, we originated $936 million across 10 senior secured first mortgage loans, all of which were floating rate and 76% of which were multifamily and industrial. This is the first quarter where base interest rates have surpassed 100% of our floors, leading to a $14 million increase in net interest income from higher base rates, which was offset by the benefit from our floors last quarter and higher interest expense from the timing of debt draws this quarter. Company-wide, inclusive of floating rate assets and liabilities in all of our business lines, a 100 basis point increase in base rates would increase annual earnings by $42 million or $0.13 per share. On the CECL front, our general reserve increased by $8 million from last quarter to a balance of $67 million as we applied a more negative macroeconomic scenario to the office property category, which represents 23% of our CRE portfolio. Our $2.2 billion loan portfolio, which was flat to last quarter, has a 4.7% weighted average coupon, 68% LTV and 745 FICO and includes $365 million of agency loans. Given continued rising rates and credit spread widening, we recorded a $92 million unrealized negative mark-to-market adjustment on this portfolio for GAAP purposes. We continue to have ample credit capacity across our business funds ending the quarter with $8.5 billion of availability under our existing financing lines, unencumbered assets of $3.9 billion and an adjusted debt to undepreciated equity ratio of 2.35 times. To create capital for the outsized opportunities we are seeing continuing in front of us, last week, management and our Board made the decision to access the term loan market, and we priced a $600 million five-year sustainability term loan at SOFR plus 325 basis points. We were able to tighten pricing, upsized the deal by 50% and generate nearly $1 billion of demand in the order book, notwithstanding a sell-off in equities and an increase in base rates during our marketing period. We have only two office loans in Manhattan totaling just $36 million, and those loans have an in-place 10% debt yield. The $3 billion worth of CRE CLOs we issued in prior years with very low borrowing rates are actively managed, giving us the ability to replace maturing loans with other loans that would otherwise be financed at todayâ\u0080\u0099s higher spreads. Our net lease and medical office assets also continue to perform exceptionally well, earning 12% cash returns in addition to having over $140 million in available distributable earnings gains. So, we have significant room for valuation adjustments in our multifamily book, which we told you was 34% of our $18 billion odd mortgage book, stabilized debt yields for us around 7.6% to our loans. So, we have like $100 million loan weâ\u0080\u0099re paying in December where my team says theyâ\u0080\u0099re 98% sure it will repay."
}