{
    "symbol": "STWD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 13:04:18",
    "content": " The credit performance of our portfolio continues to be strong with the second quarter origination LTV of 60%, a weighted average LTV of our overall portfolio of 61%, a weighted average risk rating improving to 2.5 from last quarter's 2.6 and 100% of loans current as of quarter end. Despite repricing in the securitization market and significant spread widening in the residential loan space, we securitized $828 million of loans in our 18th and 19th securitization and sold $220 million of loans, all at breakeven as a result of related interest rate hedge online. With the loans remaining on the balance sheet at quarter end, we recorded a $108 million unrealized negative mark-to-market adjustment for GAAP purposes, along with an offsetting $22 million unrealized positive mark-to-market on the related interest rate hedges. Our loan portfolio ended the quarter at a balance of $2.2 billion, including $400 million of agency loans, average LTV of 68%, a weighted average coupon of 4.6% and average FICO of 7 45. In addition to financing capacity available to us via the corporate debt and equity and securitization market, we continue to have ample credit capacity across our business lines, ending the quarter with $9.3 billion of availability under our existing financing lines, unencumbered assets of $4 billion and an adjusted debt to undepreciated equity ratio of 2.3x. The $3 billion of CLOs we issued in prior years at very low borrowing rates are actively managed, giving us the ability to replace assets that pay off in them with other assets that would otherwise be financed at today's higher spreads. We see obviously the significant decline in both the stock market and the crypto markets, which have taken something in excess of $12 trillion to $15 trillion out of global wealth just in the equity markets, but not including what's happened in private markets, in PE and tech, which have seen such dramatic increases in cost against this."
}