{
    "symbol": "STWD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 13:19:20",
    "content": " We were active on both the left and right-hand sides of our balance sheet with $4.4 billion of new investments across businesses, funded by diverse capital sources, including $500 million of corporate sustainability notes, two CLOs totaling $1.5 billion and an increase in funding capacity of $1.7 billion. As we continue to transform our collateral mix, 49% of the quarter's originations were multifamily and 22% were residential, while 83% of the $716 million in loan repayments were hotel and office. Company-wide, inclusive of floating rate assets and liabilities in all of our businesses, a 200 basis point increase in base rates would increase annual earnings by $34 million or $0.11 per share. And the third component relates to the 1% LIBOR cap that we have in place on this portfolio floating rate debt, which increased in value by $16 million in the quarter due to rising rates. In addition to financing capacity available to us via the corporate debt and securitization markets, we continue to have ample credit capacity across our business lines, ending the quarter with $9.6 billion of availability under our existing financing lines, unencumbered assets of $3.8 billion and an adjusted debt to undepreciated equity ratio of 2.1 times, which is down from 2.3 times last quarter. In the depths of COVID, we told you we believe our loan book would perform well, but not even the most optimistic management team would have predicted that we would have cumulative gain on defaulted loans in our 13-year history that we would have earned and paid our significant dividend every quarter or that we would have over $4 per share in distributable earnings gains available to us in our owned property book. Despite having a smaller CMBS book, we have increased our named special servicing by $18 billion year-over-year to $98 billion, which will provide a significant credit hedge should the economy deteriorate or enter a recession, and we continue to execute our business plan on our owned equity assets that will provide more recurring, non-recurring gains in future quarters. Our average LIBOR floor today is only about 54 basis points, down from 76 or 77 last quarter, but it's still higher than most of our peers, because we fought really hard to get LIBOR floors, which helped us as rates went down in the beginning of COVID. Most builders -- one of the reasons we built almost 15 million fewer units from 2010 to 2020 than we did in every decade prior going back to the 40s with builders stop doing spec homes and couldn't get blinds to improve land easily from anyone, and so it's just disciplined in the housing market and the result is what you see today. Our international lending business has really picked up the slack and will probably be over 30% of what we do this year, and it will be significant, and it won't be -- it will be multi-jurisdictional, Australia and core Europe and the loans competition better advance rates to us, better structure for us, et cetera."
}