{
    "symbol": "HFWA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 18:08:05",
    "content": " The balance of PPP loans was down to $65 million at quarter end, and its impact on net interest income will lessen as we progress through the year. Non-interest income decreased $1.3 million from the prior quarter due primarily to the $2.7 million gain on sale of property we recognized in Q4, partially offset by an increase in  income due to the Q1 recognition of a death benefit. For the first quarter, non-accrual loans declined by $7.2 million or 30% from our year-end 2021 level and we don't have any other real estate owners we've reported in previous quarters. As of quarter end criticized loans were $32 million higher than December 31, 2019 are what we consider to be our pre-pandemic level. For the quarter, our commercial teams closed $225 million in new loan commitments, down from $329 million last quarter, and roughly even with the first quarter of 2021. The commercial loan pipeline ended the first quarter at $527 million, up from $462 million last quarter, and down from $540 million at the end of the first quarter of 2021. Loans increased $61 million during the quarter, or a 60 or a 6.9% annualized rate, excluding the impact of SBA PPP, indirect loan balance declines and the Residential Mortgage purchase. Consumer loan production, the majority of which are home equity lines of credit was $22 million during the quarter, which is down from 23 million last quarter and up from 16 million in the first quarter of 2021. Our average first quarter interest rate for new commercial loans was 3.54%, which is 17 basis points lower than the 3.71% average for last quarter. The mortgage department close 37 million of new loans in the first quarter of 2022, compared to $45 million closed in the fourth quarter of 2021 and $43 million in the first quarter of 2021. I think we're, I'm really pretty positive about where we're going with them going in the next few quarters, I just start looking at our overall balance sheet with the amount of cash that we have, and say that, say, that we get 250 basis point increases, which certainly looks likely this next quarter. We've got -- I like going to page -- Matthew, if you can go to, obviously, Page 30, of our investor presentation, that really helps to me tell the story of a lot of what's going to happen to our balance sheet, where we've got 22% is over at cash, and we got a decent amount of our loans, that are floating, and even some investments about 10% of our investment portfolio."
}