{
    "symbol": "HFWA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 16:38:04",
    "content": " While non-accrual loans declined by a modest $320,000 during the fourth quarter, we have seen a significant reduction of $17.8 million or 75% since December 31, 2021. Our delinquent loans, which we define as those over 30 days past due and still accruing remains low at $5.4 million or 0.13% of total loans. Criticized loans, those risk-rated, special mention and substandard, declined approximately 10% or $15.6 million in the fourth quarter and are now down 26% from year-end 2021. It is worth noting that over the past 12 months, loans risk-rated substandard have declined by $47 million or 42%. As of December 31, criticized loans totaled $135 million or 3.3% of total loans. At year-end 2020, criticized loans were $291 million, and our current level represents a decrease of 54% from what we consider to be the high point of this credit cycle. In the fourth quarter, we saw a reduction of approximately $12 million in criticized loans in this category, primarily from the payoff of one loan. For the quarter, our commercial teams closed $329 million in new loan commitments, up from $277 million last quarter and the same as the $329 million closed in the fourth quarter of 2021. The commercial loan pipeline ended the fourth quarter at $536 million, down from $604 million last quarter, and up from $462 million at the end of the fourth quarter of 2021. Loan growth was $50 million for the quarter or 5% annualized, which is below the growth rate we experienced earlier in the year. Although new loan production during the quarter was higher than any other quarter and we purchased a small residential mortgage pool, this was offset by a higher mix of unfunded construction loans and a decrease in the utilization rate, which led to a $20 million decline in net advances this quarter versus a $55 million increase last quarter. Consumer loan production, the majority of which are home equity lines of credit, was $21 million during the quarter, which is down from $29 million last quarter and $23 million of production in the fourth quarter of 2021. Our average fourth quarter interest rate for new commercial loans was 5.72%, which is 85 basis points higher than the 4.87% average for last quarter. In addition, the average fourth quarter rate for all new loans was 5.51%, up 62 points from 4.89% last quarter. In addition, the FDIC premiums are going up this year, and that's going to be about $1 million for the year, and so it's about â\u0080\u0093 if you average that out about 250 per quarter. I would say just on kind of looking back â\u0080\u0093 previously, I haven't looked it up for this quarter, but I would say probably without that adjustable rate, probably another 20%, 30% of that is probably going to reprice this year. I think it boils down to a total of 27 loans with total outstandings of just under $48 million, which boils down to 8.3% of the office CRE portfolio."
}