{
    "symbol": "HFWA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 17:29:06",
    "content": " Starting with net interest income, there was an increase of $3.1 million due mostly to improved deals on earning assets and the leveraging of cash into investments and loans partially offset by a decrease in income from PPP loans. Excluding the decline in PPP balances, loans increased to $106 million during the quarter, which is up from the increase of $86 million in Q1. As a result of the increases in loans and investments, as well as a decrease of $161 million in total deposits, our interest earning deposits held at other banks decreased $588 million during the quarter. However, interest earning deposits is still at a very healthy $900 million at the end of Q2, which provides opportunities for further growth into higher yielding loans and investments. During the second quarter, non-accrual loans declined by $6.1 million or 37%. We have reduced non-accrual loans by $13.3 million or 56% from year-end 2021 and are now down 82% from December 31, 2020, which was the high point in this credit cycle. As it stands currently, even with the continued impact from this portfolio, we are just $24 million higher than where our criticized loans stood at year-end 2019. For the quarter, our commercial teams closed $284 million in new loan commitments up from $224 million last quarter, and up from $152 million closed in the second quarter of 2021. Using this measurement, loans increased $93 million during the quarter or a 10.18% annualized rate. Consumer loan production, the majority of which are home equity lines of credit was $43 million during the quarter, which is up from $22 million last quarter and up from $23 million in the second quarter of 2021. Our average second quarter interest rate for new commercial loans was 4.11%, which is 57 basis points higher than 3.54% average for last quarter. In addition, the average second quarter rate for all new loans was 4.05% up 66 basis points from 3.39% last quarter."
}