{
    "symbol": "DOOO",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-23 15:15:33",
    "content": " Seasonal product revenue were up 26% from last year, reaching $1.3 billion, driven by higher volume of personal watercraft and the introduction of the Sea-Doo switch. We generated $788 million of gross profit representing a margin of 25.6%, slightly down in comparison to last year's level primarily due to inefficiencies related to the ramp up of production of the new Manitou pontoons in some overhead investments. Now there were also elements that were more temporary in nature that impacted our margin over the last three years, notably, the lower sales program driven by the low product availability and the network and the tight supply chain environment which drove higher inflation and turbulence costs, especially in fiscal '23. As these temporary or elements normalized over time, the structural changes will mean that we will be well positioned to continue delivering strong normalized EBITDA margin of at least 17% in the coming years. And when you account for a slightly higher than usual inventory for three-wheels and personal watercraft for this time of the year, due to the delayed shipments of model year 22 units of the fall, or overall network inventory is up 130% from last year's level. As such, we are well positioned to continue our growth trajectory in fiscal '24 with expected revenue growth of 9% to 12%, driven by continued market share gains in our products as we further gain traction with the Can-Am brand, benefit from our increased production capacity for side-by-side, leverage our new mid-CC platform for ATV and sustain our momentum with Record . As mentioned, we expect fiscal '24 to be another solid year for BRP with revenue growth of 9% to 12% and normalized EBITDA growth of 9% to 13%, sustaining or strong normalized EBITDA margin of 17%. Our normalized EPS is expected to end between $12.25 and $12.75, representing a growth of more than 300% over the last three years, and making continued progress towards our M25 objective of reaching $13.50 to $14.50 of normalized EPS by fiscal year '25. Finally, while we expect to deliver solid quarters throughout the year, note that a stronger growth is expected to come in H1, notably with Q1 EPS up between 40% and 50%, as we are lapping your quarter that was significantly impacted by supply chain challenges last year. Okay, thank you very much. On year end products business, if you were to look at where is the growth coming from just maintaining our market share in side-by-side, the market share that we've gained in fiscal '23 would bring 7% revenue growth. As we said, obviously, we have a solid line up, but we also have exciting product introductions that are coming this year, which will obviously help the fuel -- further fuel market share gains and growth in business. Okay, thank you very much."
}