{
    "symbol": "DOOO",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-03 14:17:10",
    "content": " Revenue were up 1% to $934 million in the first quarter, driven by strong shipment of side-by-side vehicle, which were offset by lower volume of three-wheel vehicle as we shift production of that product line to the second quarter. To put things into perspective, while our North American personal watercraft retail was down in the quarter compared to last year, it was up about 20% compared to the first quarter of fiscal year ‘20 and ‘21. Our gross profit margin was stronger than anticipated, ending at 25.1%, but was down in comparison to last year’s level due to a less favorable mix of products sold and the impact of supply chain challenges, which caused additional costs and a less efficient use of our assets. We generated $272 million of normalized EBITDA and our normalized net income came in at $137 million, resulting in normalized earnings per share of $1.66, down 34% from last year’s Q1. Moving to our network inventory status on Slide 14, year-over-year, our network inventory is up 20%, driven by the strong shipments of missing components to dealers late in the quarter, notably for off-road vehicles. Obviously, the 80% we show here was because last year, we didn’t report Switch, Switch is basically sold out in North America and for ATV side-by-side, again, different than our competitor. You’ll get 99% of the components, and we know which components are more troublesome, and so proactively, we’re working with our suppliers to make sure that they source from their Tier 2 and Tier 3 suppliers, the necessary components so that when we do ramp up production, they’re able to supply these goods as well. As I said in my prepared remarks, we did ship quite a few components in the last few weeks of the quarters which allowed us to get the components to the dealers, and they’ll be able to work on these units early Q2, and obviously, it’s going to help retail in the second quarter. Obviously, the – when you look at the remaining part of the year, obviously, the revenue growth probably in the range of between 32% and 38% overall for BRP, year-round much higher, but a strong growth for seasonal."
}