{
    "symbol": "OWLT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 22:06:15",
    "content": " Kurt, please go ahead. Earlier today, Owlet Incorporated released financial results for the quarter ended June 30, 2022. Kurt Workman, Owletâ\u0080\u0099s Co-Founder and Chief Executive Officer; and Kate Scolnick, Chief Financial Officer, will host this afternoonâ\u0080\u0099s call. Before we get started, I would like to remind everyone that certain matters discussed in todayâ\u0080\u0099s conference call and/or answers that may be given to questions asked are forward-looking statements that are subject to risks and uncertainties relating to future events and/or the future financial performance of the company. The risk factors that may affect results are detailed in the companyâ\u0080\u0099s most recent public filings in the US Securities and Exchange Commission, including its Quarterly Report filed May 13, 2022, and other reports filed with the SEC, which can be found on its website at investors.owletcare.com or on the SECâ\u0080\u0099s website at www.sec.gov. Owlet disclaims any intention or obligation except as required by law to update or revise any information, financial projections or other forward-looking statements, whether because of new information, future events, or otherwise. You can find reconciliations of the non-GAAP financial measures to most comparable GAAP measures in the companyâ\u0080\u0099s earnings press release, which is also available on the companyâ\u0080\u0099s quarter results page of its website. Good afternoon, to all who are joining us today, as always, we're grateful to you and to the millions of parents who continue to root for and support Outlet, as we work to build a connected nursery ecosystem. Later in the call, I'll detail our approach for the remainder of the year, how we're navigating current headwinds and updates we're making to our business as we work toward profitability. I'll look at the second quarter of 2022, Owlet generated net revenues of 418.3 million, which fell short of the guidance we shared in Owletâ\u0080\u0099s last earnings announcement. Since we'll be referencing this throughout the call for a quick baseline definition, we refer to sell-in as a measure of the number of units retailers purchased from Owlet to stock their shelves and sell-through is when the unit is actually sold to the end consumer. Q2 was our first full quarter of dream product availability online and in store at all of our retail partners, Owlet online and with our Amazon distribution partners. As a reminder, following the launch of the dream products in January, much of the initial sellin and online in-store availability of our dream products took place late in Q1. From Q1 to Q2, we experienced over 40% growth in sell-through units for our dream products across our channels. While this rate of growth was good from an initial product launch standpoint, it was a slower pace of sell-through than we had expected and consequently, we had more aggressive Q2 selling sales expectations. In addition, along with many consumer brands, in Q2, Owlet began experiencing the effects of macro headwinds with retailers, adjusting their projections and ordering cadence in terms of weakening of supply as they began to defensively position their balance sheets compared to last year. With the second quarter revenue results and current macroeconomic factors in mind, we're realigning our operating plan for the second half of 2022. Owlet three primary areas of focus are: first, achieving strong sell-through of our core products, including our Sock and Camera lines. Second, making strides in our medical device submissions and finally, efficiently managing our balance sheet and expenses to reach, breakeven adjusted EBITDA. First, our focus on achieving strong sell-through of our core products to drive top-line revenue. Dream Duo was recently named as Best Baby Monitor by CBS News, and the number of expecting parents adding dream products to their baby registry continues to grow. Our recent Amazon Prime day in July was Owletâ\u0080\u0099s best ever, where the number of units sold were double our internal forecast and Owlet ranks as the number one baby monitor on Amazon in the US. Internationally, we're pleased with the progress we've made in launching our product in the parts of Asia with South Korea market opening this month. In July, we launched our newest technologies domestically, including the next generation nursery Owlet Cam 2, and the predictive Sleep Technology tool. We're continuing to load into our retail partners through the remainder of Q3, and Cam 2 will officially launch in international markets this quarter as well. The dream platform we're building today for our sock line as part of what we will leverage in our medical devices, expanding on our core technologies to accelerate adoption and add use cases for our monitoring technologies. The third area of focus for Owlet is to efficiently manage our operating model as we navigate the sell-in and sell-through demand trends effectively with our retail partners within macroeconomic headwinds, and as we resolve the working capital hangover from the FDA warning letter process. Prior to taking our company public, we were driving lean leverage in our business and adapted our investment strategy when we went public last July. In 2021, and the first half of 2022, we invested in scaling our business, marketing spend and future investment in our product portfolio. Based on macroeconomic conditions in the market, we are adjusting our 2022 operating plan to reduce our operating costs, and accelerating our plans to drive the business to breakeven adjusted EBITDA in 2023. Towards these goals in late July, we implemented a restructuring program to streamline our organizational structure, reducing operating expenses, and managing and conserving our cash resources. So in the second half of 2022, we're focusing on being the Baby Monitor of choice for families, which includes further enhancements and improvements to the Dream Sock and adding features that make this the monitor for every baby. We're optimistic these pivots will put the business on track for profitability sooner as we build on the foundation of our core technologies, accelerating adoption and expanding use cases with medical devices. As Kurt stated, it's our first full quarter for our dream products in the marketplace and we did not see the anticipated rate of sell-in and sell-through following our successful launch into retailers in Q1. In addition, retailers began to reduce our inventory productions as they work to reposition their balance sheets, more defensively for macro headwinds. Q2 product promotions and discounts were 2.5 million, relatively consistent with the prior year. Return adjustments for Q2 2022 were 1.8 million, a 41% reduction for the first quarter and in line with the prior year. Direct to consumer return rates normalized to levels similar to our smart fact products, which we believe is driven by consumersâ\u0080\u0099 better understanding the dream value proposition. In summary, Q2 net revenues were $18.3 million, including the impact of adjustments such as promotions, discounts and other allowances. Compared to the same period in 2021, our gross margin was impacted by macro inflationary pressures, including product costs, shipping and fulfillment. The increase in year over year operating expenses was primarily for planned increases in spending associated with the scaling of the business, public company costs and stock based compensation. In July, the company implemented a restructuring program to streamline the company's organizational structure, reduced operating expenses and manage and conserve cash resources to strive for profitability. As part of the restructuring program, we commenced a workforce reduction of approximately 74 employees that is expected to be substantially completed in Q3, and we expect to incur costs of approximately 1.1 million consisting primarily of severance, one time termination benefits and other related costs. As a result of the restructuring actions, we expect to reduce run rate operating costs, excluding share based compensation and incentive compensation to approximately $15 million to $19 million per quarter exiting the fourth quarter of 2022. Operating loss and net loss for the second quarter of 2022 were $20.4 million and $11.7 million respectively, as compared with $5.9 million operating loss and $5.3 million net loss for the same period in 2021. Inventory at the end of Q2 was $29.4 million, up $4.7 million sequentially from $24.7 million in Q1. Nearly all return authorizations for RTB was closed for retailers at the end of the second quarter, the company is in the process of working with its customers to apply liabilities against outstanding invoices were applicable. As part of our waiver agreement, our liquidity covenant was reduced to #22.5 million, and our line of credit was reduced to $5 million. The waiver agreement is intended to function as a bridge arrangement, and we're actively working with SVB on further restructuring our loan and line of credit, including amending future financial covenants, which we expect to complete during the third quarter. All of our outstanding partnerings with SVB are represented as a current liability on the June 30th, 2022 balance sheet, including our second quarter earnings release. Looking ahead, as current outlined, we have 3 primary areas of focus: achieving sell-through of our core products, making strides in our medical device submissions, and officially managing our operational plans towards breakeven and profitability. While we continue to believe in and invest in our strong relationships with our retail partners, we're entering the back half of the year with caution given retailer signals on reducing inventory and managing balance sheets, more defensively and cautionary consumer spending in this macro environment. But given where, I guess like the -- we've been seeing some moderation in the producer price index and also inflation this month, I guess like, can you unpack like some of the assumptions there and kind of like what's going into that outlook. I think, part of what we've tried to provide is similar discussion as we launched new products at the beginning of the year, which we're really excited about. So the NPS scores, the consumer ratings and the overall transition to the Dream product platform, that sell-in for us really happened late in Q1. And so we are monitoring very closely, the sell-through in Q2, which happened at the rate that we described, but was slower than anticipated, which also created slower sell-in for ourselves. So, a lot of the dynamic that we're talking about is for Owlet specific, but then also looking at the macro condition set that our retailers have expressed to us as well as the consumer spending. So I think that just given both of those dynamics, we're entering the back half with optimism around our portfolio, but also with the macro environment that other retailers and the consumer spending index are presenting. It's been kind of a unique year for Owlet, right, because we were out of the market for a quarter in Q4 of last year, where we weren't selling products. We launched the Dream Sock in Q1, and it took us like a full quarter to get back to market, get back into all of our stores and all of our online channels. But what I would say is overall in terms of just general sell-through growth, we've seen really good improvement Q1 to Q2, and then July, as we've noted was one of our was our best Prime Day ever. So there's kind of two stories here, but to your point, in June we did have some retailers pull back on their forecast and reduce the amount of inventory that they were willing to hold as part of our expansion activities and growth with them. Thereâ\u0080\u0099s sort of good momentum because we're coming back to market and we're seeing that, but at the same time, there's some of these macro pressures that are more coming from the retailers than the consumers themselves at this point in time. We're working with our partners to make sure that yeah, we're bringing the inventory down. That's one of our goals to bring it more in line with where sell-through and sell-in is today, and that's part of the activity. And then just the last question I have -- at least I think so is generally you talked about, wanting to get to breakeven, how quickly could that occur. So John, really the investments that we were making in the first half that we're contributing to the run rate of operating expense were investing in the product portfolio for next year. And then again, lower in Q4 trying to exit the year then in that range of $15 million to $19 million in operating expense, excluding the stock-based comp. In terms of bringing in that kind of breakeven and getting into profitability, we had said that we were targeting kind of exiting 2023, and as long as we maintain that run rate will be much earlier in the year next year. And that we'll see how things moderate with the macro and when we're able to turn back on in terms of marketing and sales, weâ\u0080\u0099ll continue to look at that. But I think that what's important is that, we were able to refresh our product portfolio this year with the dream platform. Both in terms of our Sock and Cam, and also, as we talked about with our regulatory clearances, we have a couple of those processes underway still through the end of this year and then those will be on track as well. And so we're selling that back into the market, or we have that in inventory on our balance sheet, but that process is we believe we're through it or nearly all the way through it. Can you walk us through, because I thought the returns were more kind of October, November, December of last year. So, the return rate that we saw in Q2 as it relates to the run rate of our product, our general sales returns, actually was back to where our original product was. I mean, I think our primary goal is to reduce operating expenses considerably in the back half of this year. We just took our action over the last couple weeks and we'll look forward to updating you on that timeline in November, but certainly the actions that we took in the changes in the product portfolio will help us accelerate that much earlier into 2023. Kurt, please go ahead. We look forward to putting our FDA submissions in very soon, and I believe the business is in a much healthier track with the restructuring that Kate mentioned."
}