{
    "symbol": "OWLT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 20:09:07",
    "content": " We’ve continued to introduce new Dream product features to parents, improving the baseline Net Promoter Score every month with Amazon reviews for our Dream Sock and Duo climbing to 4.1, 4.3 stars already. Number one, domestic launch of our Dream Sock and Dream Duo products; number two, sell into all of our major retail channels online and in store and relisting with Amazon while growing initial December sales momentum with Owlet online; number three, establish a successful return to vendor process for domestic Smart Sock and Duo product returns to rework the Dream Stock and Dream Duo inventory; and number four, manage our working capital, operating expenses, and existing cash position effectively. Within this uncertain macro backdrop, as Kurt discussed, Q2 will be a continued period of repositioning of Owlet’s domestic business, to focus on driving the first full quarter of retail sell-through in the Dream product line, and further reestablishing Owlet’s market presence after being out of the market this last year, due to the FDA warning letter. Our long-term core growth objectives remain intact, including growing Owlet’s connected nursery and market penetration domestically and internationally, executing our vision for the future that’s connected nursery market by targeting investments in product innovation to expand the lifetime value of our customers and focusing on developing medical devices and obtaining marketing authorizations in the US and key global markets where required. So when we launched the product, the difference that we had was that as we changed the product from Smart to Dream, some of the feature functionality that’s been rolled out senses, some of the Dream application, some of the look back application for the way that the app works and the some of the new feature that we’ve come out with since then but it’s the overall repositioning of the product in the marketplace. In addition, just to kind of follow up on that feature question, we launched three new features in the Dream Sock in Q1 post launch, one is a real time footage in the app, which is a really cool feature and kind of visually -- it’s pretty prominent in the app and helps parents in real time see what sleep -- kind of state they’re in."
}