{
    "symbol": "MDXG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 22:46:05",
    "content": " Before we begin, I would like to remind you that our comments today will include forward-looking statements, including statements regarding future sales growth, future margin, expected market sizes for our products and potential time lines for clinical trials and FDA submissions and reviews. In prior leadership roles, my approach in maximizing the Company's potential has always been to streamline operations and add businesses or products that strategically benefit the growth profile. However, my near-term focus is to build a world-class wound care business that generates substantial EBITDA well before the knee OA program is commercially available in the U.S. To that end, we finished 2022 with a solid Q4, generating over 10% year-over-year net sales growth and an improving adjusted EBITDA. Specifically, the Company has goals to improve the Wound & Surgical segment contribution margin to at least 30% of segment net sales, and to get corporate expenses as a percentage of sales to below 20%. As you know, virtually all our net sales come from our Wound & Surgical segment, which delivered $73.6 million, reflecting growth of 10.6%. The quarter reflects strength across our Wound & Surgical end markets, and the team remains focused on bringing more new products to the market in support of future top line growth, both organically and otherwise. I want to now briefly discuss results for the full year, and will remind you that 2021 included sales of products impacted by the end of the FDA's period of enforcement discretion on May 31, 2021, impacting not only net sales but also our profitability metrics. Excluding products impacted by the end of enforcement discretion, 2022 net sales growth was 10.5% compared to the $240 million in 2021. You could also see this growth in our Wound & Surgical segment, which had net sales growth of 10.9% for the full year 2022. On a segment basis in 2022, Wound & Surgical had a segment contribution of $66.7 million or 25.2% of segment net sales and Regenerative Medicine had a segment loss of $15 million. From a profitability perspective, as you heard us say on our third quarter call in November and as Joe indicated earlier, we are focused on our goals and of improving our Wound & Surgical segment contribution margin to at least 30% of segment net sales, and reducing our corporate overhead, so that the corporate and other SG&A expense as a percentage of sales is below 20%. As you have just heard, we finished the year with a strong fourth quarter, during which we reported quarterly revenue growth of over 10%, continued to roll out our two new products in the U.S. and set the Company on a course to drive greater efficiency and expense rationalization. We're pleased with the way that the team has performed domestically, again, 10-plus percent growth year-over-year, driven by the new products, driven by our work in the surgical recovery application and it's driven by the team's efforts working in some tough environments in that private office setting."
}