{
    "symbol": "TWLO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 21:37:05",
    "content": " Your line is now open. Your line is now open. Your line is now open. So long as the unit economics are good, especially in the Communications business, they're already very strong on the data and applications business, then we're going to keep seeking gross profit dollars I think a key difference being going forward that those gross profit dollars will drive incremental op profit dollars. Your line is now open. Thank you, so much. Your line is now open. And then I think some discipline on the OpEx side, which I think we've shown over the last couple of periods and certainly the most recent actions, really give us a sense of just how simplified and efficient we can run the business, that kind of gives us the confidence to say, as we look out, we can drive additional op margin accretion, which ultimately will yield GAAP profitability in 2027. Thank you, so much. Your line is now open. In terms of disclosures, which I think is kind of the other aspect of your question, what we committed during our Investor Day is that we provide additional transparency in terms of what we're now calling communications and then our data and applications businesses. Your line is now open. Fred, in terms of the second part of the question, I guess the way that I would think about it is just maybe take a step back and then I'll drill down for a second, is that one of the things that we thought a lot about as a company and as a management team is, is that we've become a really big business, but we also want to become a really profitable business. Your line is now open. Your line is now open. Your line is now open. And then we also think what we're building in terms of orchestration with Engage, also in terms of connectivity to our communications platform as well as to Flex really just create such an incredibly powerful set of capabilities for our customers but also competitive differentiation. Your line is now open. If I just kind of think about looking out and it's hard to predict two quarters out, let alone five years out, but maybe let's try or sort of talk about GAAP profitability in 2027 as well as bringing down your SBC to 10% to 12% of revenue. And I guess the way that we think about it is, is that if you stretch it out over those -- that five year period is that, number one, we get to something that probably looks like if we can execute well and at the upper end, 20% plus, one; two, that if we can get to the 10% to 12% that I talked about that we disclosed in the remarks on the SBC side, which we feel pretty good about, just given some of the changes that we've made in terms of compensation and moving more from stock-based to cash-based. Your line is now open. Your line is now open."
}