{
    "symbol": "ESMT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 04:42:05",
    "content": " SMB's strong growth of 56% year-over-year, combined with Enterprise's highly visible durable growth of 28% year-over-year, can be directly attributed to our customers and partners and the dedication of our employees who are relentless in their pursuit of customer satisfaction. We have continued to see outstanding customer count growth of 33% in our SMB segment, where we now serve nearly 85,000 customers and 130,000 professionals in 10 wellness verticals. Lost revenue from churn is within our expectations, we continue to see strong top of funnel growth, and additionally, we've experienced an uptick in customer referrals in Q4 and Q1 related to our increased marketing efforts. As of the end of Q1 2022, our total customer count increased 32% versus the prior year to 88,000 and was mainly driven by new customer additions from our digital marketing programs and word-of-mouth referrals in our SMB segment. Our SMB segment continued to perform exceptionally well with first quarter revenue coming in at $36.5 million, representing 56% year-over-year growth. Our adjusted gross margin for Q1 of 2022 increased 78.6% from 77.6% in Q1 of 2021, mostly driven by the growth in revenue, including the impact from the new pricing and packaging that we rolled out in SMB. As you know, our overarching strategy with the new pricing and packaging was really to give us more flexibility and to help us scale our pricing model as we grow in the future and roll out new features and functionality and move into new verticals and to make sure that we're aligning our price to the value that we offer to our customers. We moved to this three-tiered model, these packages we believe better align the needs of our customer and the journey that they're on, gives us greater flexibility on how we kind of price and package going forward, and to your point on marketing spend, attracts a broader set of new customers by offering a migration path that we didn't really have before for younger practitioners that are earlier on in their careers at a lower price point."
}