{
    "symbol": "ESMT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 13:40:05",
    "content": " SMB achieved outstanding revenue growth of 52% in 2022, driven by new customer adds, a favorable mix in subscriptions, the successful pricing and packaging changes that we implemented in Q1 of 2022 and our strength and transactions processed. SimplePractice designed to simplify administrative functions addresses those challenges by enabling practitioners to focus on what is most important to them, treating more patients with a network of over 160,000 mental health and wellness practitioners, SimplePractice helps many therapy seekers take their critical first steps, find the best provider, get in contact with that provider and successfully book an appointment, and we continuously evolve our offering with new features and functionalities that add value for our customers. In 2023, we are focused on driving continued growth in both segments and making product and go-to-market investments that are intended to help us achieve our next midterm milestone of $500 million in revenue, while we continue to expand our margins. We also saw continued strength in our net revenue retention rate, which was 117% for 2022, driven by the pricing and packaging changes in our SMB segment and strong digital payment adoption in our enterprise segment. Our SMB segment continues to perform exceptionally well with fourth quarter revenue coming in at $45.2 million, representing 45% growth year-over-year. Our enterprise segment also delivered strong results with reported revenue of $38.7 million, representing 27% year-over-year growth driven by new customer ads and strong digital payment and paperless adoption. In SMB we continue to test new digital marketing channels to drive new customer acquisition and broaden our brand to create awareness for our solutions in all of the verticals we serve today in enterprise, our investments continue to be on our partner relationships as well as sales headcount to fuel pipeline and bookings growth. I mean, we've continued to see growth in the average number of practitioners per practice, Bob, through 2022 as well and I think as you it's kind of steadily moved up over the past few years. We're really focused on is slowly moving upmarket, so selling to â\u0080\u0093 still what I would characterize as small group practices, but that's where we've been seeing the biggest traction to date and we'll continue to kind of slowly progress up into larger and larger group practices over time. We're definitely gaining traction very significantly with still speech language pathologist and with occupational therapist and a little bit of a â\u0080\u0093 I wouldn't call it a pivot, but an adjustment to accommodate really strong growth we're seeing in group practices, in behavioral health and interdisciplinary type clinician outfits where they've got speech language pathology, occupational therapy and behavioral health, all in the same â\u0080\u0093 in the same group. So we're focused on kind of that next segment up, if you will, in group practices, think still in the 10 to 20 practitioners, that's where we've been having some good success today, and I think that will be contributing to the growth that we see in 2023, especially as we roll out more features and functionality specific to them, which we expect later this year."
}