{
    "symbol": "CMCO",
    "quarter": 1,
    "year": 2023,
    "date": "2022-07-31 10:25:36",
    "content": " Sales grew 6.5% to $220 million on a constant currency basis, and we achieved record gross margin in the quarter of 37.5%, both on a GAAP and a non-GAAP basis. Strong demand and continued vendor capacity constraints led to a book-to-bill ratio of greater than 1.2 in the quarter, and we ended Q1 with a very robust $352 million in backlog, another record. On Slide 6, net sales in the first quarter were $220.3 million, up 6.5% from the prior year period on a constant currency basis and within the guidance we provided last quarter. As shown on Slide 8, RSG&A costs were $53.2 million in the quarter, or 24.1% of sales. For the fiscal second quarter, we expect RSG&A expense to range between $54 million and $55 million, which reflects the timing of our July 1 merit increases, offset by measures we are taking to control costs. This quarter's order growth once again outpaced sales, and our backlog grew to a new record level of $352 million. Long-term backlog, which is expected to ship beyond the second quarter, was up 20% sequentially to $163 million. If you'd please turn to Slide 15, you'll see that we expect sales in the second quarter to be in the range of $230 million to $240 million. And then, bigger picture, I'd love an update on what kind of synergies you're seeing from those two businesses together, thinking about that first synergy you saw in fiscal third quarter, that $700,000 order on ready-to-eat packaged foods. So as David just mentioned, we did see lower freight costs in the quarter by about $3.2 million sequentially compared to Q4's level. As we start to see that flow through and get better fixed cost leverage in our factories, and you think about the price increases we've already put in place, and then you think about the SG&A that we're taking out as we gain scale through the shipment of that backlog, that is the key to getting to that 19%. So we need about $40 million to $50 million and, ideally, a good bulk of it in the U.S. because the interest and the principal is paid out of the U.S. And today, we're carrying $86 million, I think was the reported balance at the end of the quarter. And I would add, it's products that are typically shorter cycle, standard products that have attractive margin profiles where we saw an increase in mix in the first quarter, legacy -- \n And then the other part too is our rail business, which has lower gross margins but a lot lower SG&A. And then, as we think about that longer-term backlog at $163 million, that would have a phasing of pricing based on the way that we increased price both in the fourth quarter of last year and then through this first half of the calendar year."
}