{
    "symbol": "HSTM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 12:33:04",
    "content": "  Operator: Good morning, and welcome to HealthStream's Second Quarter 2022 Earnings Conference Call. Good morning, and thank you for joining us today to discuss our second quarter 2022 results. Information concerning these risks and other factors that could cause the results to differ materially from those forward-looking statements are contained in the company's filings with the SEC, including Forms 10-K, 10-Q and our earnings release. At a time when so many things in the world are up in the air, pandemic, recessionary trends or there's just so many unpredictable things and they continue shifting. First and foremost, HealthStream is a healthcare technology company dedicated to developing, credentialing and scheduling the healthcare workforce through SaaS based applications. We sell these applications on a subscription basis under contracts, which average three to five years on link. We're also fortunate to be solely focused on one of the more recession resistant markets around, healthcare. And as we define our target customers within healthcare, we see it's a rather large audience of about 10.4 million healthcare professionals. We have internally developed innovative patented solutions such as Jane, robust enterprise class market leading applications, again, developed internally, such as our HealthStream Learning Center, and we have created new application suites such as CredentialStream through acquiring and integrating other companies. Since March of 2020, we have repurchased approximately $48 million of shares at an average price of $21.75, retiring approximately 6.5% of our shares outstanding in the process. First, we believe we are positioned to deliver an improved top line growth rate of generally around 6%, inclusive of our acquisition of CloudCME in the second half of the year. Second, our gross margin is 66% in the second quarter, representing a 700 basis point improvement from the 2019 gross margin of 59%. Third, we believe sales bookings indicate that customer purchasing decisions are beginning to pick up based on our sales teams reporting higher levels of engagement with customers and an increased level of virtual and in person meetings when compared to the height of the pandemic. In fact, as we reflect on the last few years, the management team is excited to feel that we're now more on offense or maybe a slightly more defensive posture in the prior three years. Later in the call, I'll talk about important developments with our single platform strategy as well as areas that we believe will drive future growth and expansion. But first, I'll turn it over to Scotty Roberts, our CFO, to provide details on our financial results for the second quarter. Revenues were $65.6 million, which were up 1%. Operating income was $3 million, down 14%. Net income was $3.1 million, up 26%. Earnings per share was $0.10 per share, which is up 25%. We continue to see positive product adoption and sales momentum in areas such as our market leading learning application, the HealthStream Learning Center, clinical competency solutions like Jane, the Credential Stream application, the ShiftWizard scheduling application, and new contributions from the Rievent and CloudCME acquisitions. We are pleased with the growth of these solutions, although the year-over-year comparison, particularly in the workforce segment was impacted by two products that experienced lower revenues this quarter. Unlike the other two products we acquired, ANSOS features an installed software application sold under nonrecurring perpetual software licenses. During the quarter, ANSOS experienced lower new sales and a higher rate of churn of its legacy installed software. Our focus is now on upgrading legacy ANSOS customers to our recurring revenue SaaS scheduling applications, including ShiftWizard, which by the way, demonstrated 28% revenue growth compared to the same period last year. Excluding cost of revenues,  were up 4% or $1.7 million. As our business has grown over the past year, staffing levels, in particular, have increased and were the primary driver for expense growth over last year. Investing in sales, marketing and product development have been our primary focus to drive sales and revenue growth, and create new products and enhancements for our customers. Sales and marketing expenses increased by 15% and included a combination of increased staffing levels, sales commissions, travel and marketing spend. Product development increased by 2%, which is net of labor costs that were capitalized for software development. Capitalized labor costs increased approximately $800,000 over the prior year quarter. As anticipated, our business travel began to pick up during the second quarter. We spent about $400,000 this quarter compared to less than $60,000 in the second quarter of last year. While $400,000 in the quarter is well below our pre-COVID travel spend, this amount exceeded what we spent for the full year of 2021. We expect that travel will continue to increase during the second half of the year, although it will likely remain below the pre-COVID levels. The reduction in office lease costs and transition service costs associated with the ANSOS staff scheduling acquisition, both generated cost savings versus last year. Our adjusted EBITDA was $13.1 million, which was down 10% from the record high that was set in last year's second quarter. We ended the quarter with cash and investment balances of $39.2 million, which is down by $6.2 million since last quarter. During the quarter, we deployed $3.1 million of cash for share repurchases, $6.1 million for capital expenditures and $4 million to acquire CloudCME. On a year-to-date basis, our cash flows from operations were $28 million compared to $24.3 million last year and free cash flows were $15 million compared to $11.6 million last year. For our share repurchase program, as I said, we spent $3.1 million under the program this quarter and we have approximately $1.9 million remaining under the program. Over this past two and half years, we've deployed over $48 million of capital towards share buybacks, retiring approximately 6.5% of our outstanding common stock in the process. And on May 18th, we completed the acquisition of the remaining ownership interest we had in CloudCME for approximately $4 million in cash and $4.1 million in shares of our common stock. With the first half of the year behind us and some of the year-over-year declines on the top line mostly flushed out during the first and second quarters, we expect revenues will begin showing improvement during the second half of the year. That said, as I mentioned earlier, there will be a reduced focus on selling ANSOS nonrecurring perpetual software, which will result in some drag on the top line growth. As a reminder, even the low end of our range would still result in an approximate 6% revenue growth rate for the second half of the year, which is more than double our top line growth rate for the first half of the year. From a hiring and retention perspective, through the first half of the year, our headcount increased by 4.5% through filling new positions and the addition of CloudCME employees. Looking to adjusted EBITDA guidance, we expect the second half of the year will be lower than the first half, attributed in part to the expected lower sales of ANSOS nonrecurring perpetual software, and as expenses such as travel, trade shows and compensation expenses will be higher than they were in the first half of the year. Whether it's the HealthStream Learning Center application for learning, the CredentialStream application for credentialing or the ShiftWizard application for scheduling, we firmly believe that HealthStream offers the best SaaS applications for the healthcare workforce. With the expected launch of our developer portal in the third quarter of this year, our first API services will become commercially available to customers and partners. That said, the learning APIs, for example, that will be included in the developer portal at its launch, are already being used by some of our largest customers. With our learning APIs, for example, one large customer has plugged into the hStream platform to establish interoperability between their HRIS system and the HealthStream Learning Center application. Now as soon as a new nurse is hired, they are automatically enrolled in the appropriate training programs in the HealthStream Learning Center application. This is just one example of how interoperability extends the reach of our network, makes our applications more deeply integrated with customer workflows and improves our value propositions. I'll start with NurseGrid, which is the top-rated app for nurses in the Apple's App Store with 4.9 star rating, and now over 84,000 ratings. That's 5,000 people choosing to subscribe in the last seven days. Every healthcare professional that interacted with our applications did so because their employer purchased a subscription for them to use, to now begin welcoming users directly to our platform through business to professional applications like NurseGrid and myClinicalExchange unlocks a great deal of potential. In the future, we hope that the millions of healthcare professionals who use HealthStream on the job will become customers and consumers in their individual capacity as well. Whether it's launching the developer portal in this quarter, while creating our new business to professional experience, while making our leading workforce applications even better, our success is due to our amazing employees. Please note that we are all excited now, management and employees to be on offense, launching new products and solutions and growing HealthStream. I wanted to circle back on that comment from the prepared remarks about just feeling like you can play on office a little bit more at this point, and just to put a little more context around that. Should we really just think about that as more -- just sort of feeling better about having some of these transitions that you've been going through in the last few years, kind of were behind you now, combined with just the general sort of favorable end market trends or is there something else that you're seeing in the market that maybe gives you confidence that you could perhaps invest a little bit more aggressively to drive an even faster growth profile over the next couple of years? As you know, we've spent many quarters explaining some of these business transitions we've been going through and the risks involved in them. And normal course for us is launching new products, finding out new ways to grow, like we talked about here at the very end and acquiring companies that tuck into our strategy. I mean, certainly, the pandemic -- if your customers were hospitals predominantly, and skilled nursing facilities and long term care facilities, this is one of the hardest times they've been through in my lifetime, the pandemic adjusting their strategy. And I think some of that's reflected in some of their announcements, the public company announcements over the last few quarters as they continue to show growth as well, many of them. We still have plenty of overhangs with recessionary fillers and things like that, but that's why we also mentioned that healthcare seems to always be in demand and the need for quality care is always in demand. So it is both the internal change in tone and the condition of our target customers changing to deposit that leads me to say, it feels good to be back on offense instead of on defense. But just in regards to the positive comments on the velocity of booking activities in some of the pipeline, things that you're seeing just as it gives you confidence for the rest of this year. Is there anything sort of competitively to call out or is it more of just starting to see these macro trends that have been really impacting the health system end market for the last couple of years, maybe just starting to alleviate and that's what giving you a little bit more comfort, just specifically as it relates to that comment on the pipeline. So during the pandemic, I described things -- I call them air bubbles kind of like if you know how it breaks system works in the cars get air bubbles, it creates kind of less effective braking. I think in the sales process, there are times where certain parts of the country, they are so busy with the pandemic, they really weren't in a purchasing mode or if they had purchased something, they didn't have the capacity to deal with implementation. And the way I've characterized that is, I think a lot of those air bubbles have kind of worked their way out of the system and we see a return to those patterns. But in addition, I think quietly and sometimes not so quietly, we were building new products and capacity during the pandemic. We're really excited about the positioning of some of our products as much as we are, the conditions of our customers to be able to purchase and implement them. So Bobby or Scotty, with respect to the confidence in the second half growth, I know a couple over the last couple of years, you had some softness in bookings, and because you're a SaaS company that takes a while to flow through the model, so to speak. So does the confidence in the accelerated growth in the second half, does that -- all of a sudden, you have a lot of new contracts that are going live here, as we speak. So the confidence stems from all the things we've already mentioned, and you reiterated that some of these purchase processes seem to be getting back on track. There are opportunities because we did have some good contract wins like on the CredentialStream platform, we've got a nice backlog that we're trying to normalize and get the revenue on those. So it's really -- as always, it's a blend of all those things. In fact, we provided that a little additional detail that we're looking at 6% inclusive of our CloudCME acquisition, which is in the range that we provided. With respect to CredentialStream, you've talked -- and I guess you're referring to that with respect to backlog. The processes and tools and teams we've been hiring and the teams to increase the rate of implementation of processes or better the tools to help customers migrate the strategies for migration or even enhance, we actually preselling now, provide some tools to allow people to experiment and prepare for implementation. Richard, looking back to last year, we saw some benefits come through in the first half, both Q1 and Q2 for that product, in particular, and a combination of sales of perpetual licenses, which have kind of an upfront revenue recognition and then just higher professional services and then just some other items as well. So I think it's combined both Q1 and Q2, we see both of those quarters reductions related to that product. I think in general, we're probably backfilling positions at fairly consistent pay grades as before, but maybe getting a little less experienced people. Well, right now, we're just still watching the patterns return. We're still encouraging generally our internal meetings, with some exceptions to be done virtually to manage costs. But even after all that, the total travel budget for the year would probably still be less than half of pre-pandemic levels. And so -- because we've insisted on kind of prioritizing travel for customer-facing instead of assuming five people at trade show, we try to send three, things like that. It's kind of -- as we've mentioned, a new phenomenon in our 30-year history. It makes us more of a longitudinal service provider, meaning instead of just engaging with these individuals when they're employed at an institution, they can now reach out, log in and increasingly participate in activities, in this case, finding a rotation to hospital if you're a student. And so we hope that as other tools come online like our portfolio concept we've been working on for a few years, it will create a longitudinal history for each person that they can carry with them throughout their lifetime. We think that by the end of the year, we'll be testing some commerce solutions directly to the professionals. And so hopefully, in the fourth quarter, we'll have our first attempts to provide some value to them directly as professionals through some offerings, through e-commerce. And so I don't really know the answer, but just conceptually the idea is, can we maintain contact through our applications and suites over their lifetime as healthcare professionals instead of only during their employment through a B2B application. And we do have a fairly robust road map of tools that like the ePortfolio we're working on, that will service the needs of the individuals and service their further ends of their career development and career opportunities. I mean a 50% growth organically in NurseGrid monthly active users of nurses, we're pretty excited about that. But you're right, we're new to -- I call it B2P, business to professional. So we're new to the business-to-professional world, but we do have millions of professionals in our network, but not as individual consumers. And so in the next 18 months, I hope to be able to announce that some of our pilots were successful and we've got some strategies to provide them value and also generate revenue. And my final question is, last quarter, in 1Q, you talked about strength in the -- renewed strength in the learning center. I think this morning, you mentioned Jane, or Scotty did, as being an area of strength as well as Learning Center. I think first, what was really exciting in the second quarter was surprisingly strong new additions to the HealthStream Learning Center. I believe that the number added in the quarter and largely due to a couple of big renewals that extended their contracts to cover more people, but also new market share was, over -- I'm trying to find the number. I believe there's over 100,000 new subscribers, which if you think back even five or seven years ago, that would have been a big number then. I guess I'll put a range around it just because I'm not 100% sure, but let's put between 80,000 and 110,000 in the quarter. But even if you think back five years ago, I used to say 20,000 to 50,000 net new subscribers was good on the learning platform, and we did add close to 100,000 this quarter. And so we see a bit of a pickup, particularly in what we call CE Center, which is almost a Netflix like subscription to a large library for continuing education. We see more institutions buying the subscription for their employees in bulk and provisioning -- hopefully, the benefit and maybe as a strategy to retain them showing their investing in their education and development. So we're encouraged by Jane, Checklist, CE Center and EBSCO, all performed pretty well now in the first half of this year."
}