{
    "symbol": "TITN",
    "quarter": 3,
    "year": 2022,
    "date": "2021-11-23 11:12:04",
    "content": " 04:45 The contribution of across all of our businesses allowed us to drive record third quarter adjusted diluted earnings per share of zero point nine six dollars, which represents an increase of eighty one percent compared to the prior year period. 11:55 Rental and other revenue decreased seven point one percent versus prior year due to a decrease in inventory rentals, a smaller rental fleet in our current construction footprint and a reduced fleet due to the January twenty twenty one divestiture of our construction stores in Arizona. 12:16 Helping to offset these factors with a higher dollar utilization of our construction segment rental fleet, which improved nicely to thirty one point four percent for the current quarter compared to twenty five point seven percent in the same period last year. 12:38 On Slide eight, our gross profit for the quarter increased twenty seven point five percent to ninety two million dollars. 14:06 Floorplan and other interest expense decreased twenty one point six percent to one point three million dollars in the third quarter of fiscal twenty twenty two, compared to the same quarter last year due to lower floorplan borrowings. 14:21 In the third quarter of fiscal twenty twenty two, our adjusted net income increased eighty point eight percent to twenty one point seven million dollars, which accounts for two point six million dollars of impairment costs net of tax in the prior year period. Agriculture segment sales increased twenty seven point six percent to two hundred eighty one point five million dollars helping to drive a significant increase in segment adjusted pre-tax income of forty two percent to nineteen point six million dollars. 16:14 We are pleased with the continued improvement in this segment's adjusted pre-tax income, which improved nearly one hundred and fifty percent to three point six million dollars, compared to one point four million dollars in the prior year period. The combination of strong equipment sales and margins coupled with solid growth in our higher margin parts and service businesses yielded a five point nine million dollar improvement in adjusted pre-tax income to a positive six point one million dollars, which compares to two hundred thousand dollars in the prior year period. 17:46 Turning to slide eleven, our gross profit for the first nine months was two hundred and thirty eight point five million dollars, a twenty three point one percent increase, compared to the same period last year. 18:21 Our operating expenses increased by sixteen point two million dollars or ten point one percent for the first nine months of fiscal twenty twenty two to one hundred and seventy six point five million dollars. Floorplan and other interest expense decreased twenty four point two percent to four point three million dollars in the first nine months, primarily due to overall lower floorplan borrowings. 19:31 Our nine month adjusted EBITDA increased fifty two point one percent to seventy eight point six million dollars, compared to fifty one point seven million dollars in the prior year. Overall, our adjusted pre-tax income was fifty nine point three million dollars for the first nine months of fiscal twenty twenty two compared to thirty one point three million dollars in the same period last year. 20:28 Our equipment inventory at the end of the third quarter was three hundred and twenty three million dollars, a decrease of fifteen million dollars from January thirty one, twenty twenty one, reflecting the net effect of a forty four million dollar decrease in used equipment, partially offset by a twenty nine million dollar increase in new equipment. 21:09 Our rental fleet assets at the end of the third quarter increased slightly to eighty two million dollars, compared to seventy eight million dollars at the end of fiscal twenty twenty one. 21:50 Our adjusted debt-to-tangible net worth ratio was zero point seven at the end of the third quarter, compared to one point zero at the end of the third quarter of fiscal twenty twenty one and is well below three point five, which is the leverage covenant requirement of our two largest floorplan facilities outside of our bank syndicate credit agreement. 22:40 At the end of the third quarter, we drove an inventory turn of three point one times and anticipate this to continue to move higher through the end of the fiscal twenty twenty two given current inventory levels and end market conditions."
}