{
    "symbol": "TITN",
    "quarter": 2,
    "year": 2022,
    "date": "2021-08-26 12:07:04",
    "content": " Our healthy inventory position coupled with robust demand, along with continued strength in our Parts and Service business grow strong consolidated pretax income growth of 89% and record second quarter adjusted diluted earnings per share of $0.57, which represents an increase of 97% compared to the prior year period. Our equipment business increased 34.6% versus prior year, which was driven by each of our segments with notable 40 plus -- 40%-plus growth coming from both our Agriculture and International businesses. The adjusted second quarter of fiscal 2022 net income excludes the $1.5 million asset impairment I mentioned a moment ago, a $278,000 income tax valuation allowance and a $53,000 Ukraine remeasured gain, while the prior year excluded approximately $200,000 of expenses says net of taxes. Revenue increased 4.1% to $80.9 million compared to the prior year period, despite the January divestiture of two stores in Arizona. The combination of strong equipment sales and margins, coupled with nice double-digit growth in our higher margin parts and service businesses yielded a $2.4 million improvement in adjusted pretax income to a positive $1.9 million. Overall, our adjusted pretax income was $30.6 million for the first six months of fiscal 2022 compared to $13.8 million in the same period last year. Strong sales and lower inventory levels continue to drive equipment inventory turns, which increased in the second quarter to 2.7 versus 1.6 in the prior year period. After applying these adjustments, our adjusted cash used by operating activities was $19 million for the six-month period ended July 31st, 2021 compared to adjusted cash provided by operating activities of $16.1 million for the same period last year. Obviously, the strong demand and supply environment, particularly that we're seeing today, I think some of the things that maybe impacting the first quarter and second quarters a little bit more, or some of the mix items affecting it, use sales, which tend to have a higher equipment margin to them continue to be strong in outpacing new sales for us."
}