{
    "symbol": "SCU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 15:47:09",
    "content": "  Operator: Good morning, everyone, and welcome to Sculpture Capital Second Quarter of 2022 Earnings Conference Call. I would now like to introduce your host for today's conference, Ellen Conti, Head of Corporate Strategy at Sculptor Capital. Before we get started, I need to remind you that Sculpture Capital's actual results may differ, possibly materially, from those indicated in these forward-looking statements. During today's call, we will be referring to economic income, distributable earnings, and other financials that are not prepared in accordance with US GAAP. Today, we reported a GAAP net income of $8.1 million for the second quarter of 2022 or $0.32 per basic and $0.89 per diluted Class A share. From a financial market perspective, the first half of the year has been one of the worst on record and while pretty much all major asset classes experienced dramatic declines, I think it's most informative to think about the 60-40 portfolio because some version of that represents the vast majority of both institutional and retail capital allocations. Of course, that was driven by the laundry list of all the issues we all now know too well, deteriorating global GDP growth outlook, record inflation, rising interest rates, central bank tightening, supply chain disruptions, the rolling and disparate COVID impacts being felt around the world, and last but not least, a war in Europe, all this taking place against the backdrop of what's been pretty significant value distortion and risk assets over the last two-plus years. Notably, within that, credit markets, which had been relatively well behaved for the initial part of the year that contingent hit towards the end of the second quarter and started to create meaningful dislocations across pretty much all types of credit assets, both public and private. As it relates to Sculpture, this has created a robust and ever-expanding universe of attractive investment opportunities for our funds. Across our businesses, we do a lot of different types of investing, but I would say, simply said, the same type of investments that nine or 12 months ago offered mid-single-digit rates of prospective return, today offer mid-double-digit rates of prospective return. For this type of environment, flexible capital is required to capitalize on the opportunity set, and we think we're well positioned across all our funds, given, our funds are generally opportunistic and generally unconstrained in their approach to investing. So simply dislocation can be good for our business, in terms of increasing the number of attractive opportunities for our funds to invest in that help create future returns and in our ability to showcase outperformance against other risk asset classes in the present moment. In the second quarter, we delivered solid financial results for shareholders and relative outperformance for our fund clients, notwithstanding the challenging market environment. Opportunistic credit funds delivered what we think are exceptional returns, relative during the quarter and continue to compound on year-to-date outperformance versus pretty much all relevant benchmarks. Our real estate funds continue to achieve terrific realizations on existing investments, and are now able to deploy capital into the type of environment that we think sets up for similarly successful future investments. Our multi-strategy funds have experienced a portion of the drawdown in risk assets year-to-date, more than we targeted, but better overall than the market and were broadly in line with expectations. That being said, incentive income is, of course, based on absolute performance, and our multi-strategy funds are in a year-to-date loss position. We've seen periods of market dislocation historically act as a catalyst for fundraising in certain areas, particularly credit and real estate related and a dampener for fundraising more broadly. You hear it from our peers, capital allocators of all shapes and sizes in the type of market environment that I described in the opening tend to pause and look inwards during a period of time, kind of take inventory and reset, especially when that stress is so broad-based across the typical portfolio. I think historically there's been, periods of dislocation where one asset class as worse, one asset class does better. Notwithstanding that, I'd say a highlight or an area to focus on -- within all that is the Sculptor Tactical Credit Fund we call that STAX, where we held a second closing on July 1st with $250 million, bringing total committed capital to $370 million. That is a private credit drawdown style fund, building on the track record of six or seven similar funds over the last decade as well as our open-ended opportunistic fund. And we believe that in this environment, it's particularly relevant to clients and specifically in a private credit format. We also had, as we discussed before, our first close on our second real estate credit fund, that was in the first quarter. CLO market is obviously not insulated from everything else that's going on, and that market is slower than it has been over the last several years. The breadth and depth of our investment capabilities and outperformance for our clients in our long-duration businesses has resulted in growth of our longer term AUM, both absolute and relative and it also helps to diversify the platform. It adds stability and diversity to our earnings stream, which is particularly helpful in times of market stress and like we saw in the second quarter, investments that we made across different vintages, different funds, different products that can create return streams in an idiosyncratic fashion that pay off when they pay off, and that's what we experienced in the second quarter this year. And I would say, right now, we are doing both, we are getting the benefit of that balance sheet resilience from a defensive standpoint, and we are doing what we think is opportunistic offensively with that balance sheet strength. But when we think about the combination of recurring earnings, the value of our balance sheet or NAV, and of course, the potential incentive income after variable bonuses that we can earn in any period of time across any number of funds. So, while markets will continue to be volatile or I should say, may continue to be volatile near-term, we think we're in a position of strength to capitalize that on many -- capitalize on that on many fronts, both in our funds and at the level of our business. And that's by making attractive investments for our clients by being stewards of our clients' capital and protecting it, by showcasing the value of our investment capabilities, and doing that with a strong balance sheet, reasonable earnings profile, excluding incentive income, and earnings power with the benefit of incentive income. And with all that together, we think we can continue to generate long-term earnings growth. During the quarter, we generated distributable earnings of $32 million or $0.55 per fully diluted share despite the overall volatility in the market environment. A portion of our distributable earnings this quarter were from earnings generated on our management fees, showcasing the value of recurring earnings and the progress we've made in improving the contribution from management fees to our business. We also had incentive income realizations of $44.6 million for the quarter, largely from our long-dated funds. This highlights the testament of our long-term performance and the value of diversification of our platform in terms of vintage, products and funds. As an offset, we had compensation expense directly linked to this incentive income, which increased our compensation expense versus our normal minimum quarterly fixed bonus accruals. As a reminder, we typically recognize compensation expense in the quarter in which we generate the income for our long-dated funds, as we did this quarter, and at year-end for our open-ended funds. As seen this quarter, our longer dated funds can generate significant incentive realization during otherwise challenging market conditions when we perform for our clients. Our adjusted net assets have increased from a deficit of $55.8 million in 2018 to $304.2 million as of June 30, which is up quarter-over-quarter. This balance sheet position significantly increases the resilience of our platform and has allowed us to start playing offence that we believe will lead to future long-term shareholder value, while returning capital to shareholders via our dividend and buyback. In the second quarter, we also continued to return capital to shareholders. We also announced a cash dividend of $0.13 per Class A share for the second quarter, which represents 10% of distributable earnings in line with the guidance that we gave last quarter. And then in the fourth quarter, we expect to true it up to bring full year dividends to between 20% and 30% of distributable earnings. As we discussed last quarter, this pace during the year is a more sensible prudent approach to our dividend policy, as it better aligns dividend payments with earnings, given the timing of incentive income and bonus expenses. Taking the dividends and share repurchases together for the second quarter, we are returning $16.4 million to shareholders, $13.2 million via the share repurchase program and $3.2 million via our dividend. We will continue to be thoughtful on maintaining the ongoing balance of a strong core balance sheet, deploying capital to areas of growth and returning capital to shareholders. As Jimmy discussed, we are well positioned to endure the current market volatility, given both our positioning in our funds and on our corporate balance sheet. A question around just the incentive income and how we should about sort of the pace of crystallization and generation of that incentive as you start to shift, I think you mentioned in the prepared commentary in the earnings release that some of the products won't necessarily have the kind of year-end anniversary that we're accustomed to. For annual funds, which is primarily our multi-strategy fund and our credit opportunities fund, we would expect annual crystallizations at the end of the year, should there be incentive income generated by funds. The main portion of that is going to be from our real estate funds, and we have a series of equity real estate funds at varying vintages, and also from our newly launched stack fund, which Jimmy had mentioned earlier. Lastly, there is a portion in our custom credit opportunity funds, which has a multiyear crystallization period, which will not be crystallizing this year but will in future years. You mentioned stacks, the second real estate credit fund on stack. The real estate credit funds, credit fund to that is give generally the same thoughts, we try to meet or exceed prior funds and Fund I was around $700 million. And as we get closer to 4Q, it looks increasingly unlikely that the master plan will have a performance -- in that vein, is that form of zero, do you think like the minimum annual bonus you need to pay people would put the distributable earnings into the rack for the quarter, or is it tooâ\u0080¦\n Dava, can run through that math, our figure out of that math is within guidance we would give. But big picture, the minimum bonus accrual is meant to represent the bonuses that we think we would pay to the extent there's no annual incentive income being generated. Obviously, when we generate incentive income off of either a buy or funds that have direct carry in them, you see that bonus roll through at the same time, which is what you saw in this quarter. And you'd be thinking about what your run rate management fees are, plus your fixed expenses, which would be salary and benefits, your fixed bonus accrual and GA. And we talked about that being a positive number for this quarter."
}