{
    "symbol": "SCU",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 11:50:19",
    "content": "  Operator: Good morning, everyone, and welcome to Sculpture Capital's Fourth Quarter and Full Year 2022 Earnings Call. Before we get started, I need to remind you that Sculpture Capital's actual results may differ possibly materially from those indicated in these forward-looking statements. During today's call, we will be referring to economic income, distributable earnings and other financial measures that are not prepared in accordance with US GAAP. For the full year 2022, we reported a GAAP net loss of $12 million or $0.48 per basic and $1.77 per diluted Class A share. For the full year 2022, distributable earnings were $56.4 million, or $0.96 per fully diluted share. Overall, 2022 was a historically challenging year for financial markets. Against that backdrop, the business made $56.4 million of distributable earnings or $0.96 per fully diluted share in 2022. Because of our multiple revenue streams from various funds, we can still generate earnings and cash flow in a tough year for markets. At the beginning of 2022, we laid out our goals for the business across investment performance, flows, new initiatives and balance sheet. At the conclusion of the year, we wanted to comment on our performance against those strategic goals. If we take a step back to talk about the overall macro environment, 2022 was an unusual year for the markets and one of the most volatile years on record. Balance 60-40 portfolios were down almost 20% in 2022, as both stocks and bonds declined. In opportunistic credit, our funds experienced significant relative outperformance in 2022, versus relevant benchmarks and indices. For 2022, our Credit Opportunities Master Fund generated a gross return of minus 3.2% versus the BAML Global High Yield Index which returned minus 13.2%. This represents a 10% excess gross return versus global high yield for the year, bringing annualized excess gross returns versus the BAML Global High Yield Index to 8.2% since inception. Our 2022 performance built on exceptional performance in 2021, where our op credit funds returns represented their largest annual excess return over high yield, in that case 22% versus 1.4%. The increased volatility in markets, tight financial conditions, higher rates, constrained capital markets, all help provide an attractive backdrop for our style of investing. In real estate, we continue to invest and harvest capital successfully. We focus on nontraditional niche asset classes within real estate, producing returns that are less correlated to the broader markets and to traditional real estate markets. In Fund III, currently in its harvest period, the overall portfolio saw a 15% increase in value year-over-year in a falling real estate market. This was driven by the monetization of some exceptional investments during the year, bringing life-to-date annualized gross returns for the fund to 30%. In Fund IV, we remain well positioned with dry powder to capitalize on opportunities that may arise from current market conditions. In multi-strategy, we were down 11.6% gross in 2022, with balanced 60-40 portfolios down 19.1% for the year. As a reminder, our investment approach in the multi-strategy fund is not market neutral. As a result, we historically have and would continue to expect some downside capture in the multi-strat fund in major down years for risk assets. Given the market backdrop, we would have expected the multi-strat fund to be down 8% or 9%, meaning our downside capture in the multi-strat fund was modestly higher than expected, but not out of the context with the historical range of outcomes for that fund. We set performance metrics for our fund, but we can undershoot them or overshoot them in a given year, and we evaluate that over a longer period of time, recognizing that in the multi-strategy business, there have been years of outperformance and years with performance that did not meet our expectations. Before 2022, we had entered the year with some of our best trailing performance for the multi-strat fund with three-year annualized gross returns of 18% and five-year annualized gross returns of 13%, surpassing our stated investment objectives. So far in '23, albeit a short period of time, we've had a good start to the year, with the credit opportunities fund up 2.3 net in January and multi-strategy up 4.1 net in January. Our second goal was fundraising with a focus on growing longer-term AUM by maintaining and accelerating real estate and credit flows, while continuing to turn the tide on capital raising for our multi-strategy funds. In the first quarter, we also held first closes for our Real Estate Credit Fund II, the second vintage in that series. Our Sculptor Tactical Credit Fund we call it Stacks , which is the latest vintage in our series of seven closed-end opportunistic credit funds, these products grow our longer term AUM adding additional stability, diversification, and duration to our platform. To that end, we closed on a $350 million structured alternative investment solution in the first quarter of 2022, which was tailored to insurance clients. 2022 proved how important this initiative was because when the markets got worse, instead of needing to play defense, we were able to play offense by investing in our business and repurchasing shares when our stock price dropped. Before we get into the drivers of our earnings for 2022, we wanted to step back and give some perspective on the year. Against the backdrop of one of the toughest years for the financial markets since 2008, our business made $56.4 million of distributable earnings or $0.96 per fully diluted share. This result is a direct outcome of some of the building blocks we've put in place over the past several years to strengthen our business including building management fee earnings, diversifying our product mix, aligning our cost structure, and strengthening our balance sheet. AUM increased during this period from $32.5 billion at the beginning of 2019 to $38.1 million at the end of 2021, but we've largely kept our fixed costs flat. We started the year with $38.1 billion in AUM, our highest start of the year since 2016. However, over the course of the year and largely as a result of fund appreciation, AUM decreased to $36 billion. Given the starting balance for the year we still had a contribution to earnings from management fees in 2022, but our 2023 run rate will be lower. As Jimmy mentioned, we had a strong start to the year with one of our best fundraising quarters in Q1 and continued momentum into Q2. However, in the second half of the year, we saw fundraising slow dramatically, impacted by the resumption of legacy corporate noise along with broader industry trend. In the second half of the year, we had net outflows and distributions across the platform as normalized redemptions occurred with limited offsetting inflows. Overall, redemptions for 2022 represented normalized levels in multi-strategy and opportunistic credit with combined lower redemptions as a percent of the beginning period AUM in 2022 than 2021. And as a result, our 2022 incentive income was primarily driven from these areas. In real estate, incentive income was primarily driven by Fund III. Over its life, this fund has delivered a 2x multiple on invested capital and a 30% gross IRR. This fund is in harvest and had several large realizations this year, as it's returning capital to investors. In opportunistic credit, incentive income was driven by crystallizations of our ABURI balance. In multi-strategy, we did not generate meaningful incentive income in 2022. Our multi-strategy funds have high watermarks, so we will need to earn back this performance before collecting incentive income. As Jimmy mentioned, we had a strong start to 2023 in terms of fund performance in January for both opportunistic credit and multi-strategy. Including February performance to-date, which is not yet finalized, we have substantially recovered our losses and reduced our high watermarks in opportunistic credit and have made meaningful progress on this in multi-strategy. As discussed, our fixed compensation has largely been in line with prior years and we would expect that continue into 2023. Our GA&O expense trended higher during 2022, since we incurred approximately $10 million of elevated legal expenses related to the books and records actions and the activities of the Special Committee of our Board of Directors. Given our absolute performance in 2022 was weaker than it was in 2021 in both opportunistic credit and multi-strategy, our variable bonuses were down meaningfully year-over-year in line with performance. What largely drove variable bonus in 2022 was carried interest profit sharing in our real estate business, which generated incentive income for the year through portfolio realizations. Our adjusted net assets were $322 million for the quarter, which is equal to our cash plus investments in funds and CLOs less our debt. Adjusted net assets was down from 2021, primarily from share repurchases, as we return capital to investors and we experienced some depreciation of our fund investments and CLOs. If we look at the longer-term trend, adjusted net assets is up significantly from 2018 when it was a deficit of $55.8 million. In addition to our adjusted net asset balance, we have significant expected value from our ABURI balance, which is our accrued but unrecognized incentive income. We would expect to continue to see this ABURI crystallize into incentive income, as capital is returned. Real Estate Fund IV is in its investment period, so we would expect to see ABURI balance from this fund increase over time, as we continue to invest capital. As a reminder, as real estate ABURI is crystallized into incentive income, we expensed the associated compensation. In opportunistic credit, the next major crystallization event for ABURI balance is expected to be in 2025, different than in real estate, as opportunistic credit ABURI is crystallized into incentive income, the associated compensation has already been largely expensed in prior periods. In 2022, we used our balance sheet to take advantage of declining share prices to repurchase stock. During the year we returned $43.8 million back to shareholders, $32.5 million through our share repurchase plan and $11.3 million through dividends. For the fourth quarter, we announced a cash dividend of $0.20 per Class A share, bringing full year dividends to 20% of distributable earnings. To-date, we have earned $528 million of the $600 million distributable holiday economic income target. We will continue to evaluate the best uses of our capital, while maintaining an ample balance sheet to help weather any potential downturn. Given the likelihood of continued volatility in the market, we think this presents an opportunity to showcase the value of our investment capabilities, while delivering long-term value to both fund investors and public shareholders. You mentioned sort of under goal number three, some of the new initiatives setting, obviously, the one that was tailored toward insurance clients, but hoping you might be able to add a little bit of color as to what other new products might be in the works, if it's appropriate at this time. I'd say certain investment capabilities are more distinct than others, but a lot of the value, we've historically been able to deliver we think comes from the collaboration across areas. As you look at where the stock is trading today, and you look at your cash position at the end of the year, I think, that's about 70% of that. One was to support a lot of those growth initiatives we talked about in the first half of the year that were assisted by the use of our balance sheet, and secondarily on a buyback when the market gave us the opportunity in terms of the price action you described. Some of your peers are starting to talk about sort of growing opportunity for liquid alternatives after a normalization of interest rates a little more volatility certainly have a very good long-term track record, but you mentioned the corporate governance issues as well hindering gross sales. I don't know if liquid alternative exactly the right word, but the more liquid end of our credit capability being something that some of the peers are focused on is also something we are focused on that also is more topical today."
}