{
    "symbol": "CWAN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 00:26:03",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by and welcome to the Clearwater Analytics Fourth Quarter and Full Year 2022 Financial Results Conference Call. And now, I would like to welcome Joon Park, Head of Investor Relations to begin the conference. I would like to remind all participants that during this conference call, any forward-looking statements are made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Expressions of future goals, including business outlook, expectations for future financial performance, and similar items, including without limitation, expressions using the terminology may, will, can, expect and believe and expressions, which reflect something other than historical facts are intended to identify forward-looking statements. Forward-looking statements involve a number of risks and uncertainties, including those discussed in the Risk Factors section of our filings with the SEC. The company undertakes no obligation to revise or update any forward-looking statements in order to reflect events that may arise after this conference call, except as required by law. And in the last 100 days of 2022, 2 more of the 20 largest insurers in North America chose to move to the Clearwater platform. Looking back at the year, I could not be more proud of our team. As all of you know, like other fintech firms, we faced headwinds throughout the year, and I believe the urgency and effectiveness with which we reacted and executed was very strong. In fact, we made our business stronger and more resilient by working with our customers to craft a modified commercial model. Given what we accomplished in 2022, we have renewed confidence that our overall plan, our commitment to building disruptive technology, our product strategy and our customer-centric approach will stand the test of time. When we completed our IPO in September 2021, we laid out five pillars to guide us, and we continue to build upon them throughout 2022. Given the New Year, we want to provide an update on those pillars, which are largely unchanged. Pillar number one is consistent, reliable and durable growth. Our Q4 revenue was $82.7 million and full year revenue was $303.4 million, which represented year-over-year growth of 20.4%. With strong booking in Q4, booking for the year 2022 exceeded the budget we had laid out in the beginning of the year. That allows us to look forward to 2023 with confidence in our plans, and we expect to deliver another year of 19% to 20% growth. More specifically, we will look to our booking to guide our continued investments. We have built a detailed view of our TAM by market, submarkets and geographies and have previously communicated a market opportunity of $10 billion plus. In addition to using our own team to validate this on a continuous basis, we work with leading consulting firms to further validate and refine this estimate. It is easy to be content with the long runway we have in our current markets, but our ongoing investments in R&D is in service of finding adjacencies that can continue to enhance the TAM on an ongoing basis. Not only does it double our European presence, it also enhances our TAM by $1 billion by allowing us to deliver front office systems, including order and portfolio management to current and new clients. In addition to the two large insurers we spoke about earlier, our new customer wins from Q4 include Adventist Health System, Bimini Advisors, Homestead Advisers Corp, Meeder Investment Management, Payden & Rygel, Robinson Capital Management and WestCap Management. Geographically, we are encouraged with our early continued successes in Asia, and in Q4, we signed Avallis Investments in Singapore, MSIG Insurance in Thailand and PT Asuransi MSIG in Indonesia. In the majority of these cases, we continue to replace legacy solutions and trying to get a daily reconciled comprehensive view of the portfolio across asset classes and geographies. Across the industry, investment and operations teams face real challenges when they deliver to the businesses. They have to deal with multiple systems that are narrowly focused on a given geography, a given asset class or a business function like risk. In 2022, we invested 25% of revenue in R&D and plan to continue this level of investment in 2023 before moderating that in subsequent years. When you first met us, Clearwater was predominantly a single product company, but that has and will continue to evolve as we build a best-in-class commercial model. Today, we offer multiple adjacent products, which can be used independently of Clearwater core. Clearwater Prism continues to get greater market acceptance, Clearwater JUMP OMS, PMS, for order and portfolio management. And we offer add-on modules, which can be used alongside Clearwater core, Clearwater LPx, Clearwater LPx Clarity, Clearwater Performance Plus, Clearwater unit-linked funds. We are proud to announce that in Q4, 2 of our largest clients, Nationwide and JPMorgan Asset Management chose to use Clearwater Prism. We are also excited to share that we have signed our first significant 7-figure Prism deal in Europe, expanding our offering for one of our largest clients. This client will be able to use Prism to generate reporting for their end clients, representing over $290 billion in AUM. As you will recall, we closed the JUMP acquisition in November of 2022. In December, we sold the JUMP platform to Luxembourg-based insurance provider, Cardif Lux Vie. We look forward to supporting Cardif Lux Vie, with the investment performance, regulatory compliance and reporting needs. In addition to JUMP standalone offerings, we have integrated Clearwater and JUMPâ\u0080\u0099s development and product teams for defined products so that we can offer integrated solutions for unit-linked funds and an enhanced feature-rich performance module to existing Clearwater clients, which brings us back to adjacent products like Clearwater LPx. Clearwater LPx, our products focused on limited partnerships is being well received and gaining traction with both existing clients and net new logos in the market. As you can tell by its rising popularity, the solution is being selected because it helps organizations dig deep into their private equity investments, providing them the visibility of the need to understand long-term returns. Clearwater LPx Clarity takes it one step further to convert unstructured data to structure data to provide our clientsâ\u0080\u0099 front-office teams with underlying portfolio exposure and look-through, including investment and risk analytics. Prism was our first adjacent product, and it is now starting to deliver meaningful bookings and revenue. The ultimate value of any tech platform rests in the value delivered to clients, the impact it has on the business and overall client delight. In Q4, we wonâ\u0080\u0099t again receive an NPS score in excess of 60%. In Q4, as a testament to this fact, Clearwater won numerous awards, the Tech Provider of the Year Award for Excellence from InsuranceAsia News, the best Redtech Solution from Insurance POST and the Technology Firm of the year from Insurance Asset Management. These always acknowledge the profound impact Clearwater is having on our clientâ\u0080\u0099s investment operations in the U.S., Europe and the Asia Pacific region. We are happy to report that Clearwaterâ\u0080\u0099s CMO and CHRO both won awards for the leadership in marketing and HR innovation, respectively. Now looking forward, many of you might ask how we expect macroeconomic conditions to impact our business. Rather, we are growing in line with our business. We stand steadfast on our pillars, consistent, reliable, durable growth, focus on TAM, enhancing our SaaS platform, innovating our product offering and dedication to clients. Little has changed in our philosophy, approach or culture, except that after weathering 2022, we have proven our resiliency and therefore, have even higher conviction. Before returning with a few closing thoughts, I would now like to hand the call over to our Chief Financial Officer, Jim Cox, to provide more details on our fourth quarter and full year financial performance as well as updated guidance for our first quarter and full year 2023. I plan to spend our time summarizing a few items from our Q4 results and then explain the financial impact of the JUMP acquisition, which closed on November 30, the tax receivable agreement or TRA expense, update you on the continued progress of our transition to the base plus model, and then conclude by providing color on our 2023 guidance. Turning to Q4 and 2022 results, let me start with the top line and the metrics that drive revenue. In 2022, we are especially proud to have delivered 20.4% year-on-year revenue growth in an otherwise challenging market environment. Q4 revenue included $2.7 million of revenue from JUMP in December, which was roughly $1.5 million higher than we expected when we provided our Q4 guidance. JUMPâ\u0080\u0099s revenue included a perpetual license agreement with Cardif Lux Vie, which closed in December. Annualized recurring revenue, or ARR, at the end of December 2022 was $323.5 million and included $6.4 million of ARR related to the JUMP acquisition. The asset management vertical comprises 33% with corporates, government and other entities comprising 15% of ARR on December 31, 2022. As of December 31, 2022, the Clearwater platform, processes and reports on $6.4 trillion in assets daily, up from the $5.9 trillion at the end of 2021. The bedrock of our business continues to be our client-focused approach, which has led to best-in-class customer satisfaction and an industry-leading 98% gross revenue retention for the 16th straight quarter. In the fourth quarter, net revenue retention increased to 106%, a nice uptick from the bottom we predicted in Q3 of 103%. As a reminder, we have historically charged our clients a fee, primarily based on the assets they manage on our platform, subject to contracted minimums. A significant majority of the assets on the platform are high-grade fixed income assets, which had historically led to very low levels of volatility and predictable revenue streams with the significant market volatility in both equity and fixed income in the first half of 2022, we evaluated our commercial model. A base plus contract framework includes a base fee for prospective clients existing book of business, plus an incremental fee for increases in assets on the platform. I am happy to share that since July, 100% of our new clients with contracts greater than $500,000 in expected annual revenue are using the base plus commercial model. In 2022, clients representing 80.1% of ARR either agreed to modify contracts or price increases in their existing basis point contracts. Going forward, we aim to have a vast majority of new customer contracts on the base plus model. Additionally, we will continue to engage with the remaining clients to transition them to the base plus model. Within one small portion of our client base, we do plan to maintain an AUM-based pricing model. For those clients, their NRR growth rates were consistently higher than our reported NRR. For those clients, we will continue to focus on growing with those clients as their assets grow. We reported $81.1 million in EBITDA for the full year 2022 and $24.3 million in EBITDA for Q4, which both exceeded the midpoint of our guidance by $1.6 million. EBITDA margin was 26.7% for the year, our first full year as a public company. Q4 EBITDA margins were 29.4% as our better revenue performance, combined with a more cautious hiring approach resulted in a 60 basis point improvement over that margin from Q4 2021, which was our first full quarter as a public company. Gross margin continues to be resilient even as we continue to execute on building operations for new client growth, including our investment in international markets, where we are onboarding clients in Singapore, Thailand, Hong Kong, Australia, Japan, France, the UK and Netherlands to name a few. Research and development expenses in the quarter were $20.1 million or 24.3% of revenue, an increase of $0.2 million from Q3. Sales and marketing expenses in the quarter were $10.4 million or 12.5% of revenue, an increase of $0.2 million from Q3. General and administrative expenses in the quarter were $7.8 million or 9.4% of revenue, a decrease of $600,000 from Q3. After closing the JUMP acquisition on November 30, we began the process of integrating JUMP into Clearwater with the creation of joint teams to merge our development efforts and provide a single solution for our business functions, like performance or regulatory reporting, as Sandeep described. JUMP doubles our European presence with over 100 employees and ramps up our expansion efforts in Europe, extending our offering to our existing clients as well as providing full investment life cycle functionality to the investment management industry. JUMP has historically been a perpetual license business and recorded their results under IFRS, not U.S. GAAP. Throughout 2023, in addition to merging the go-to-market teams and bringing their product to the cloud, we also plan to harmonize JUMPâ\u0080\u0099s offering into a recurring revenue model, consistent with Clearwater. At year-end, JUMP had $6.4 million in ARR. Given the joint selling motion, the transition to U.S. GAAP and product integration, we will generally not report JUMP results separately. As we migrate the JUMP business to a recurring revenue model, we expect the transition will reduce our overall EBITDA margins in the first half of 2023 and then improve margins as new recurring revenues from JUMP layer into the financials. Since JUMP is less than 10% of our overall cost structure, we continue to expect consolidated EBITDA margins to increase in 2023 compared to 2022. Moving to the tax receivable agreement expense, youâ\u0080\u0099ll see that we incurred $5.9 million in Tax Receivable Agreement expense in Q4 and $11.6 million for the year. Although we reported a GAAP pretax loss, we would have had taxable income in 2022, primarily because of the capitalization of R&D expenses and lower stock-based compensation tax deductions. Absent the Up-C structure and Tax Receivable Agreement, we estimate that the income tax expense would have increased by $14 million. However, we expect to have to pay the liability related to the 2022 expense in Q4 2023. We ended the quarter with $255.6 million in cash, cash equivalents and short-term investments and $50.5 million in total debt, resulting in net cash holdings of approximately $205 million. Even with the JUMP acquisition in Q4, the ending cash, cash equivalents and short-term investments at end 2022, was still $1 million higher than at the end of 2021. Free cash flow for the fourth quarter was $16.6 million, reflecting a conversion of EBITDA to free cash flow of 68% and included $1.9 million of capital expenditures. For most of 2022, we hired in advance of our growth. For 2023, we plan to more tightly align our headcount growth to our new business growth. Therefore, we expect modest EBITDA margin expansion in 2023. For the full year 2023, we expect revenue to be in the range of $361 million to $364 million, representing approximately 19% to 20% year-over-year growth. We expect our adjusted EBITDA to be in the range of $97 million to $98 million, which is 20 basis points better than the 2022 adjusted EBITDA margin. For 2023, equity-based compensation is expected to be approximately $80 million. After 2023, we expect equity-based compensation to decrease as a percentage of revenue. Focusing on guidance for the first quarter of 2023, we expect revenue to be $83 million and adjusted EBITDA to be $20 million. In Q1, we expect an adjusted EBITDA margin of 24%. Additionally, annual merit increases impact the Q1 EBITDA margin. As in previous years, we expect to expand margins throughout the year in 2023 resulting in an expansion of EBITDA margin for the full year. After a year of strong execution in 2022, in 2023, we look forward to more of the same: winning new logos, expanding with existing logos, integrating JUMP into our further growth plans. Despite some of the pressures that came with an uncertain market environment, 2022 was our strongest year on record, and we ended with great momentum, capturing impressive client wins across the globe and demonstrating just how resilient we are as a business. We enter 2023 with renewed confidence in our ability to capture more TAM, displace legacy vendors, drive R&D and technology innovation and deliver greater value and growth opportunities to our clients. As always, we remain relentlessly focused on our clientsâ\u0080\u0099 long-term success and supporting them as they benefit from our technologyâ\u0080\u0099s powerful network effect. I want to start by the outlook for next year, I mean, really impressive numbers. And alongside that, I know, Sandeep, you had mentioned youâ\u0080\u0099re going to invest depending on â\u0080\u0093 based on what you see in your bookings and not on macro assumptions. Before I begin, I did want to say that we sort of went on for quite a bit there like 37 minutes, but there was just so much to cover. But Rishi, just to your question, I do think that when you look at our business, we have a really good sense of the ARR. When you look at that, we have a really good understanding of what revenue will come about from that booking. Obviously, that booking builds up through the year, but we know exactly what the project plans are and how that booking sort of translates to revenue. And thatâ\u0080\u0099s why when you hear Jim and me talk, we always say, weâ\u0080\u0099re going to let booking guide our investment, not revenue because booking is really for us the forward indicator. I do also want to make one other point here is Rishi, last year was hard. But if you go back to February of last year and you look at our revenue guidance from last year, it was $302 million to $304 million last year. With all of the challenges we faced, we delivered $303.4 million. If you look at the EBITDA guidance we gave in the beginning of last year, it was $80 million to $82 million. And frankly, there is â\u0080\u0093 we thought we would do better than the numbers we guided to, but all of the headwinds we face, we still deliver to guidance. And our current plan sort of assumes that the macroeconomic condition is not going to improve very much, but it wonâ\u0080\u0099t get a whole lot worse like it did last year. Like last year, we felt the interest rate increases are dramatic. We donâ\u0080\u0099t expect dramatic increases, but we do expect continued increases in interest rates. And if those happen, those will be nice tailwinds to further our business. So when I look at the guidance, right, youâ\u0080\u0099re â\u0080\u0093 I appreciate that your guidance is a stock-based compensation. And stripping out JUMP, it looks like actually SBC in dollar terms is going to come down as well as a percent of revenue. And youâ\u0080\u0099re guiding to kind of a low level of dilution, which I think is great to see in this sort of environment. As we think about stock-based compensation, weâ\u0080\u0099ve obviously isolated the JUMP portion of that. That was all considered as part of kind of that business combination, but they need to earn that over time. For the stock-based compensation related to Clearwater and our guide for this year, it reflects kind of the additional awards in this year that are going to be granted across. And obviously, when youâ\u0080\u0099re growing 20%, 20% plus, you continue to grow through those numbers that weâ\u0080\u0099re trying to keep flat and static. And therefore, we would have kind of increasing leverage as a percentage of revenues of our stock-based comp expense. And given how we performed last year, we feel very, very good about that trade-off for shareholders. So in the first case, the situation was there was a client reporting need, which had to be done on a daily basis. And they had to bring together data from many spots and bring it all together, merge it and deliver that on a daily basis on time. What Prism does is brings data from various sources, pulls it together, ingests, does the calculations and provide that report to the regulatory body on a daily basis. So you have accounting systems of various kinds, some on Clearwater some not. Now I think the interesting thing for us here is, Michael that initially, we were seeing Prism deals of $300,000 and $200,000 ARR. And we have now seen deals of, in excess of $1 million ARR and this one in Europe, we just announced or we talked about today in the call. And so as we kind of â\u0080\u0093 the adoption with all of our new clients, itâ\u0080\u0099s been fantastic when we reflected and saw that 100% of all of our large contracts in the second half of the year were on the base plus model. For those larger strategic asset managers who we are growing with, as I mentioned, they typically had higher NRR rates than kind of what we had typically reported. So I would say that to finally get around to answering your question, Iâ\u0080\u0099m not sure that the contracting model impacts that NRR or that take rate, and itâ\u0080\u0099s more about the use case to the customers and as we drive that. The base plus model, we feel like this 106% that were reported in the fourth quarter is really reflective of our current business environment and kind of the current business. Sandeep just spoke about Prism, LPx and all of the JUMP modules are the path that will take time. Thatâ\u0080\u0099s a multiyear project, but thatâ\u0080\u0099s clearly a really important goal for the company. And most importantly, itâ\u0080\u0099s what our clients are asking for and want. But over time, if you look at the last 2 years and 4 years and 6 years, thatâ\u0080\u0099s been the highest NRR business for us, those large asset managers. And so weâ\u0080\u0099ve gone like say, okay, fine, but we will live with the current model because we feel the NRR would anyway be the highest there. I donâ\u0080\u0099t know, I wanted to provide the details that you understand why Jim said that weâ\u0080\u0099ve done this with 80.1% of ARR clients representing that much, but we are not pushing to try to get to 100%. I appreciate you breaking down the split between insurers, asset managers and corporations that seem to be pretty much in line for what itâ\u0080\u0099s been for the past year. I think we are â\u0080\u0093 thanks Ella, itâ\u0080\u0099s good to hear your point. And so as these percentages change, itâ\u0080\u0099s just about how relatively quickly, we are gaining share in each of those. With our investments in both Prism and in JUMP, we see greater opportunity as well in asset management. And if you just look at our TAM at the highest level, the largest TAM is in that asset management segment. And so if you were to look out to the future multiple years into the future, I think you would assume that asset management would continue to kind of increase kind of on the margin as far as a percentage of overall ARR. And so you may see that bubble up and down, but we donâ\u0080\u0099t â\u0080\u0093 not expect to win in every segment. So, there really isnâ\u0080\u0099t a need to say, hey, we are not going to go pushing that segment, why not, right. So, we have broken up the market into the segments and sub-segments, and each one has the dedicated team going after it. So, the vast majority would come from adding new business. Those could be both new logos as well as additional products and services to existing clients relative to the price increase absolutely, so. So yes, just to give you a sense, Ella, that I think more than 90% â\u0080\u0093 we donâ\u0080\u0099t have an exact number, but I can tell you more than 90% of the revenue would be from current clients whom we have either fully onboarded or we are onboarding. I donâ\u0080\u0099t want to put a number on it, but I do know it will be in excess of 90%. Sandeep, I love to follow-up on your comments that you made in the past on perhaps the business enablement use cases that Clearwater really allows some of the asset manager customers. And my â\u0080\u0093 what I would like to tell you is that almost always, it is because it is seen as a growth enabler. I think there are many software products which do that reporting well for a given asset class, many. And I think why clients sort of continue to grow with us is we actually â\u0080\u0093 Gabriela, we go into pitches with them. And so when you start to be seen as an enabler of growth, I think that changes who we are. There is a client obviously probably not appropriate to name, but who really lost a number of RFPs. And when they did the analysis of why they lost the RFPs, they found that other asset managers just had superior reporting online, they had superior analytics. And so I have always thought that if you go back at 2022 and look at why we won, it is because of that. Even the big Prism deal we announced in Europe, which was in excess in seven figures, if you look â\u0080\u0093 listen, the part from what I was talking about was they are reporting to their clients. So, they have $200 billion of assets. They used to take days and days to get these reports ready and sent to their client, and they come to Clearwater, and we should be able to generate that in a matter of hours. So again, if you think of the proposition, like you said, not as an accounting software, but as an enabler of growth, thatâ\u0080\u0099s why I think we get traction. I think itâ\u0080\u0099s the onboarding of the assets from our Q3 and Q4 bookings flowing into our revenue line item, right. So first, we win the business, then we onboard the business. And as those assets are being onboarded, they grow, and it takes obviously some time to onboard that. But relatively speaking, itâ\u0080\u0099s $6.4 million in ARR, so. And Gabriela, if I could add to that, the booking in the second half of 2023, will likely have very little impact on 2023 revenue. So, it does matter, of course it does matter, but a very vast majority would be based on the last two quarters of booking and the pipeline in this quarter. So, we obviously all understand that you just completed the acquisition JUMP, but you are in a good financial net cash position, as you have mentioned. Sandeep, I think you said at the beginning of the â\u0080\u0093 or at some point in your prepared remarks that you are not afraid to make more acquisitions. I believe on the JUMP acquisition call, you mentioned that you screened over 300 companies in your due diligence process. So, I would love to just hear more on the due diligence process you are going through right now. So look, itâ\u0080\u0099s got to be â\u0080\u0093 JUMP I thought was â\u0080\u0093 we are really excited about JUMP. I think what we can do, not just for Clearwater, but for the employees of JUMP themselves and being able to take their brand and what they have developed sort of taken around the world, I think itâ\u0080\u0099s so exciting, also for our current clients. So, we are very excited about what JUMP can bring to us. I think Jim is always telling me, the bar is going to be really, really high because we have a good clean business, grows nicely, nicely profitable. So, I feel like, hey, the bar is going to continue to be high. So, then what are we really looking for, one is, if it helps us expand geographically. But if you found something which should help us expand geographically or in the market, so this could be, is it something that does with REITs or things like that. So, if they were functionality which clients wanted, which we donâ\u0080\u0099t do well enough or deeply enough. Well enough is probably the wrong term, but deeply enough, then that would be another area where I feel like we would look at acquisitions. And the third thing is, if the â\u0080\u0093 we are helpful in bringing more value to our current clients. So, for example, some form of analytics would be really helpful. So really, itâ\u0080\u0099s more about adding value to current clients who are unhappy. So, we do â\u0080\u0093 all of us will acknowledge that investment accounting isnâ\u0080\u0099t working for many, many, many clients around the world. So, if we can hit in that process of them coming on to Clearwater, I think that would be really interesting. So, I think itâ\u0080\u0099s important to think about â\u0080\u0093 when you are on the core Clearwater platform, you are doing all of the accounting for all of these. Now letâ\u0080\u0099s say that you say, okay, I want to step through and do LPx and add more kind of visibility into that functionality, a little bit more broader and more robust than just the accounting and reporting functionality, and/or LPx clarity, I want to understand the underlyings in this. I think we were being a little â\u0080\u0093 we said always that we will follow bookings, but not economic forecasts, because we just have got bitten by these forecasts. Every time we hear the forecast, we think the world is going to fall apart. As Jim said, we became a little cautious in hiring because we started to believe the forecast a little bit and we did really, really well. So, we have now decided internally to say, no, we are just going to follow booking, because booking is much better for us, itâ\u0080\u0099s a leading indicator. Do we continue to see very large clients wanting to come on to Clearwater, absolutely. And do we continue to see smaller clients, so yes, we donâ\u0080\u0099t see â\u0080\u0093 we just donâ\u0080\u0099t see the softer as quite yet. And if we do and our bookings sort of even come down just a little bit, we will re-evaluate. I mean looking though, Brian, believe me, with every report I see on journal, I am always looking for signs of it. First, congrats on getting to that 80% target mix for the customers on base plus in just two quarters, which is amazing. So, our â\u0080\u0093 for all of our new clients, the other metric that was really terrific was 100% of those clients that signed up kind of for larger contracts were on the base plus model going forward. So, as we continue to add customers, the base plus model is the de facto way that we add those customers. Sandeep, you mentioned a lot about the momentum you are seeing in Asia. I think I speak about it because we get surprised by it, right. So, at an intuitive level, we believe that the need for a solution like ours should be much stronger in Asia. Look, I just want to thank everybody for your interest in our company. We are trying to build something special here, and we always appreciate just your engagement."
}