{
    "symbol": "ALRS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 05:53:02",
    "content": " Important factors that could cause actual results to differ materially from those indicated in the forward-looking statements, are listed in the earnings release and the company's SEC filings. Al's background and experience is just what I was looking for as we take Alerus to new heights, we will continue to distinguish ourselves as a uniquely diversified financial services firm via our one Alerus strategy. As I reflect on the first quarter, I am exceptionally proud of our company's ability to attract and retain talent. In addition to Al, we also successfully listed out a five-person commercial construction lending team, and have the privilege of additional Twin Cities talent seeking to join our organization. Alerus reported net income of $10.2 million, driven by strong annualized loan growth, ex-PPP, of 18.7%, and supported by a high level of reserves and continued pristine credit quality. Our mortgage team members are focused on their realtor relationships and purchase business, which is historically 70% to 80% of our origination volume. As you can see in our numbers, despite being in a down market, we saw large increase in our AUM based on strong new production and new assets from sale proceeds of one of our long-term commercial clients. With that, I will hand it off to Al to discuss the financial details of the quarter. For the first quarter of 2022, reported average loans declined 80 basis points on a linked-quarter basis. Excluding the impact of PPP, average core loans increased 1.7% on a linked-quarter basis. The increase in core average loans was driven by a 1.8% growth in C&I, 2.2% growth in commercial real estate, and a 1.3% growth in consumer. Within C&I, we saw a pickup in loan production, along with an uptick in utilization rates, as several clients tapped into their existing lines. At the end of the first quarter, we had approximately $13.1 million of PPP loans outstanding. We saw seasonal higher deposits related to synergistic deposits in the fourth quarter of the prior year, but those balances had their typical outflow in the first quarter. We had net recoveries of three basis points in the first quarter, compared to 22 basis points of net recoveries in the prior quarter. On a reported basis, net interest income declined 4.9% on a linked-quarter basis. Excluding the impact of PPP, net interest income increased 2.5%, mainly due to higher interest income from the investment portfolio. Turning to Page 17, net interest margin was 2.83% in the first quarter, a decline of one basis point from the prior quarter. Excluding the impact of PPP, our core net interest margin was 2.77%. Core net interest margin benefited from higher investment portfolio yields, along with higher loan yields from a consumer portfolio, offset by lower yields from our C&I portfolio. During the quarter, the reinvestment rate of our investment portfolio was accretive, as new investments were at a higher rate compared to investments that were maturing. On Page 18, you'll see that we have $698 million or 38% of our loans are floating, as you can see on the top right of this slide. Despite the increase on funding costs, the impact to our interest expense was minimal due to a decline in deposit balances that was discussed earlier. Assets under management and administration declined 3.2%, mainly due to market volatility and partly to net outflows. While AUM declined, we did see that the number of participants increased to approximately 445,000 versus 440,000 in the prior quarter. Revenues declined 4.9% from the prior quarter, mainly due to lower asset loans. Turning to Page 21, you can see highlights of our Wealth Management business. Despite the market volatility, assets under management and administration saw an increase due to a new custody deal that was brought in during the quarter. Revenues declined 5.5% from the prior quarter, mainly due to higher fees recognized at the year-end time due to lower average assets and due to lower average assets impacted by challenging markets during the quarter. Turning to Page 22, I'll talk about our mortgage business. The decline in activity was driven by higher interest rates in the quarter, as the 30-year mortgage rate recently eclipsed 5%. Additionally, we saw a lack of housing inventory that negatively impacted our volumes during the quarter. Despite the challenging markets, our current volumes are still 49% higher than the similar time period in 2019. During the quarter, non-interest expense declined 7.8%, mainly due to lower incentive compensation related to revenue-related activities. For 2022, we are still expecting average loan growth to be in the mid to high single digits. The biggest variable in our revenue outlook is our mortgage business, where the lack of inventory has caused unforeseen headwinds for us. Also, the recent market volatility has impacted our retirement and wealth businesses. Just a question on the loan growth side of things, a bit of a breakout, I guess, if you could kind of talk about any geographic strength. It's - particularly, especially in our Twin Cities markets, we saw some very good growth there too. But I would say too again, it's pretty thus far broad-based across all markets and across the portfolios, especially both the consumer, C&I, and CRE. And the biggest thing that we're seeing right now is that in the mortgage business, we're seeing some challenges there because of low inventory in our main markets. That's something we didn't foresee, but we're hoping there'll be a seasonal pickup there because just given winter conditions and just low inventory and hopefully - we expect inventory to pick back up. And then on our retirement wealth business is what I commented on, was that we expect some market volatility to impact that right now. So, we didn't expect the quarter to be as volatile as it was when it came to our initial outlook. In regards to Metro performance it was in line with theirs and our expectations, both in terms of net income, as well as balance sheet growth. And so, it's good strong start to their first quarter. I wanted to drill a little bit more, I think last quarter, we were thinking about retirement benefit services revenue flat year-over-year, curious if that's still the case. And so, I'm just trying to kind of put the pieces together to get to that kind of low single-digit - I'm sorry, mid to high single-digit decline in overall fees this quarter. Hey, Nate, I just want to make sure, we actually guided to low to mid-single-digits, not mid to high, so just make sure you got that down correctly. And then, yes, so the biggest thing when we think about our retirement business right now, so in the fourth quarter, we did have some fees that are not annual in nature that impacted. So, that's going to be - we're just facing a little bit of headwind right now. So, on our outlook for retirement business, I'd say that we're trying to keep revenues as fine as we can right now, but there might be a little bit challenge, given the markets where they are right now. So, when it comes to the mortgage business right now, we actually had a little bit of a challenging quarter given the low inventory. So, we do have some leverage there in terms of as revenues pick up for us in that segment, there'll be a little bit of higher expenses because we have more production coming through, but we also, we’re trying to do the best we can to manage that environment right now. Yes, we expect similar to previous quarters that increases will be driven by loan growth. we've seen nice increases recently, but still low pre-pandemic levels. Yes, Nate, I think, looking at our available balances and where our utilization rate has been historically pre-pandemic, I would say there's upside in the $20 million to $30 million range. You guys had a little bit of a decline in TC with the AOCI swing in the quarter, but you guys are still operating with ample capital levels, stock buyback like most of your peers over the last few months. So, just curious just to get an update in terms of the buyback appetite presently, and just kind of what you’re seeing in terms of acquisition options, as well as JV. We do have it in place, but our priority continues to be balance sheet growth, loan growth, as well as on the fee income side. And I would reiterate my comments from the prior quarter in regards to our focus is on building our pipeline, as well as building our sources for those key income deals. There are no non-competes or non-solicits, and we're already seeing a high degree of activity from the team. Our company has some of our own, but this company, again, has historically outperformed, and we remain well positioned for future success because of our business model. We continue to see momentum in building our pipelines and our new business and client expansion, as well as a high level of engagement within our team and within our markets and our brand. The steady and strong foundation is allowing us to retain and recruit top talent, serve in the best interest of our clients, and deliver long-term value to our shareholders."
}