{
    "symbol": "JBLU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 16:05:27",
    "content": " We began adjusting May capacity last month and we are continuing these adjustments into the summer and second half of the year as we focus on building a more operable and resilient schedule that takes into consideration the reality of the operating environment, including elevated pilot attrition, pilot training delays stemming from disruptions to planned training schedules due to Omicron, business partner staffing shortages and ATC staffing shortages. For the first quarter of 2022, our capacity declined 0.3% year over three as we proactively trimmed our schedules throughout the quarter in response to rising fuel prices and operational challenges and we have now made additional cuts to make our operation more resilient. That said, the strength in bookings is driving revenue in the second quarter that is expected to be up 10% to 15% year over three, which will set a new high watermark for quarterly revenue in JetBlue's history. While the operational disruption in April has delayed our return to solid pretax profitability, we are investing meaningfully this summer to restore operational performance and we believe we are on a path to building back our margins and creating value for our owners through strong revenue growth, disciplined cost control and a methodical approach to capacity decisions. As we think beyond 2022, we're looking forward to our Investor Day next month where we'll provide you with a framework for JetBlue's long-term earnings power and deep dive some of our key strategic initiatives that will drive out our out-year financial targets and create value for our owners as we look to expand our margins beyond pre-pandemic levels in the coming years. So just thinking about some of the staffing issues, it sounds like there's some short-term headwinds given the industry are facing tied to Omicron training delays and just being a max training throughput, but then there's also elevated attrition in addition to staffing issues at airports, air traffic control, which aren't directly under JetBlue's control. So I fully expect our airports team, our in-flight team and our technical operations teams to be fully staffed as we step in through the summer time frame and into a more, I think, normal course of business, where we see, I think, meaningful pressures, and it's something I think everybody is seeing across the industry is on the pilot front. And whilst I fully accept, we take a step back in the second quarter, there is -- there will be no catalyst for driving better cost performance and improved revenue than a stable operation, and that's what we're focused on. I mean, first of all, I don't think it's realistic to take the 10% of capacity this year and add it into next year because, again, it's not aircraft or fleet or demand that is driving that change that we would normally say, well, when the demand comes back, you ramp it up."
}