{
    "symbol": "KDP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 16:05:05",
    "content": " In Coffee Systems the story is one of accelerated supply recovery to enable us to fuel the continued strong growth of the Keurig System, following our addition of six million new households in the past two years. During the quarter inflation which was significant across the board particularly for inputs such as coffee, resins, aluminum and sweeteners, as well as transportation and labor approached 15% which is higher than we expected entering the year. Adjusted operating income declined 1.2% in the quarter, reflecting the significant impact of inflation, including the ongoing impacts of macro supply chain and labor challenges, partially offset by our strategic asset investment and other benefits that enabled continued investment in the business. During the quarter, we also made significant investments to accelerate coffee recovery and get us back to normalized inventory positions and service levels to realize our full growth potential in the second half of 2022. Packaged Beverages again delivered double-digit net sales growth with the first quarter up more than 13% driven by favorable net price realization and higher volume mix, the latter reflecting continued market share expansion and strong in-market execution across the portfolio. Adjusted operating income increased 13% reflecting the strong growth in net sales, partially offset by broad-based inflation and a significant increase in marketing investment. In addition, Coffee Systems faced a significant comparison to the first quarter last year where net sales increased 17%. We achieved higher Coffee Systems net price realization of 3.2% in the quarter, which was driven by pricing actions taken primarily on our owned and licensed pods in late 2021 and the first quarter of 2022 combined with sequentially lower retailer fines incurred in the first quarter. As we look ahead, we expect continued strong revenue growth, driven by innovation, renovation, partnerships and are pleased that we will be in the position to invest in marketing to restore full demand to our coffee business in the second half as inventories are rebuilt. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}