{
    "symbol": "KDP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 13:55:18",
    "content": " For the quarter pod sales grew 10%, led by both higher pricing and higher volume mix, while brewer sales grew almost 6%, led by higher pricing that was partially offset by lower volume due to the 29% volume growth comparison in quarter two last year. Just to pick up on the comments you made about the M&A environment, and you know I guess my question is, when you're thinking about or looking at high growth companies you know a year ago or two years ago, you know thereâ\u0080\u0099s a lot of focus on revenue model, revenue multiples, TAMs and like profit and cash flow were sort of taking a backseat I think in terms of a lot of the valuation discussions that were being had. The only difference is during COVID we saw an increase in attachment rate that has been working down gradually from that peak to pre-COVID levels, and there's a little bit of noise even in this quarter of a bigger re-opening where people are going out of homes, and that's actually been â\u0080\u0093 as strong as our business has been, that's actually been a negative factor that's been weighing against our strong growth that we've had and that's just about â\u0080\u0093 in our opinion thatâ\u0080\u0099s just about done. The reason is because we have more ideas for growth than we're supporting right now and that's a great position to be in, and so I think as we continue to whether all of the pluses and minuses of inflation and recession and the volatility over the â\u0080\u0093 you know the past three years is nothing like any of us experienced over our careers, we will increase our marketing spend overtime. And so I would say there's no indication, whether it's COVID, COVID recovery, recession, inflationary environment that our ability to add 2 million households per year is very steady, its strong and we have a ton of confidence in that, and that leads us to more than 10 years of household penetration growth at the size of the available market, so that area I think we're in good shape on."
}