{
    "symbol": "PARR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 02:56:10",
    "content": " Third quarter throughput was 80,000 barrels per day and production costs were $5.14 per barrel. Production costs were $6.63 per barrel and throughput was 18,000 barrels per day during the third quarter. As Bill mentioned, the Retail segment reported record adjusted EBITDA of $20 million for the quarter compared to $14 million in the third quarter of 2021. We generated record quarterly cash flow from operations of $341 million, driven by normalizing working capital in combination with strong earnings. Logistics segment adjusted EBITDA contribution was $22 million, up sequentially from the second quarter by approximately $1 million. The third quarter, Singapore 3.1.2 declined approximately $10 per barrel to $26.43. However, we are able to maintain a relatively flat adjusted gross margin of $19 per barrel in both quarters. We anticipate fourth quarter landed crude differentials will be between $8.50 and $9 per barrel versus ICE Brent, reflecting steep backwardation and increasing freight costs. Much like Hawaii, despite this nearly $13 per barrel drop in the index, we are able to maintain roughly flat adjusted gross margins at approximately $20 per barrel. Adjusted gross margin declined approximately $19 per barrel, which includes approximately $14.6 million FIFO expense or $8.70 per barrel. Laramie generated hedge adjusted EBITDAX of $26 million, unhedged adjusted EBITDAX of $40 million and net income, excluding unrealized derivatives of $17 million for the third quarter. Par Pacific's third quarter cash flow from operations, excluding turnaround funding, was $341 million. During the quarter, we reduced our gross debt by approximately $14 million including open market repurchases totaling approximately $10 million face value. I think the second factor I referenced was the price lag benefit with the falling prices that we saw during the quarter, it's roughly a $30 per barrel decline in flat prices, and that was approximately $7.50 per barrel improvement in price lag. And then again, this was partially offset by roughly $2.50 per barrel higher backwardation costs during the third quarter. And then just on the refining side, well, I think you mentioned the $8.50 to $9 premium to Brent for crude costs in Hawaii for the fourth quarter, recognizing that you buy forward quite a bit. But I would say, in general, the peak demand that we saw and really the barrels that are landing and that we're consuming in the fourth quarter were consumed -- were procured in the third quarter, which I think is really the timeframe where you saw the highest flat prices in the tightest kind of physical market conditions."
}