{
    "symbol": "BHG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 12:45:06",
    "content": " The net result of pricing next year across both commercial and Medicare Advantage, combined with our medical cost efforts, are expected to drive a significant improvement in gross margin and allow us to move meaningfully closer to profitability in 2023, which gives us further conviction in our target of breakeven adjusted EBITDA in 2024. While reported results reflect the impact of the 2021 risk adjustment payable true-up and the net PDR increase driven by our newer IFP markets, our second quarter operational results were in line with our expectations and reflect solid progress on our operational and medical cost efforts. Second quarter revenue for NeueHealth was $422 million with a sequential decline reflecting revised risk adjustment estimates for 2021 and 2022 that flows through to the capitated NeueHealth lives, as well as direct contracting member attrition in line with expectations and a reduction in the year-to-date direct contracting benchmark recognized in Q2. We continue to expect our enterprise medical cost ratio to be in the range of 90% to 94% and full-year 2022 adjusted EBITDA to be in the range of a loss of $500 million to $800 million, which consistent with prior guidance excludes any impacts from mark-to-market investment gains and losses. And then just as a follow-up, Mike, you talked about pricing for 2023 really helping to drive the margin, but just curious as to your thoughts around membership with the new pricing and how you're thinking about both sides of the business, especially as we think about Medicare Advantage bids, we think about the IFP market, any incremental insight into how you're thinking about membership going into next year. And so as a result of that, and just the share volume that we have in some markets with 25% market share or more in the commercial marketplace and some market significant Medicare Advantage in the marketplace, combined with our affiliate relationships from other payers, we've got strong relationships with our care partners and we believe net-net, we're going to continue to drive our underlying unit costs down. So we'll get more into that, but we believe we're -- we feel confident that the pricing will be above and beyond our underlying medical trend and then include additional upside as a result of medical cost initiatives, which yield the $400 million to $500 million of incremental gross margin next year. So both of our major lines in the Bright HealthCare business, we're seeing improvement, and it's a direct relation to a lot of the initiatives we put in place starting last year that we've talked about previously."
}