{
    "symbol": "BHG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 12:44:14",
    "content": " The year-to-date, MCR also includes the impact of the 2021 risk adjustment true up recognizing the second quarter this year, partially offset by variable true up 2021 medical costs, which increase the reported MCR buy a net 40 basis points. When comparing our MCR performance to 2021 we believe that the 240 basis points year-over-year in our year-to-date MCR continues to understate the improvement we're driving in the business given the risk adjustment and medical cost impacts we recognize in Q4 last year, and additional 2021 impacts for the keynotes earlier this year. Third quarter revenue for NeueHealth was $502 million, including the impacts from the year-to-date true up for risk adjustment estimates that flows through to the capitated NeueHealth lives, as well as a smaller adjustment to the direct contracting benchmark recognized in Q3. Your line is now open. And so depending on mix, that's going to vary, but when you look at the mix of business, without the ACA insurance business, which is lower than our enterprise ratio, when that goes away, coupled with the growth of DCE with the improved Medicare Advantage business, that's how you get to what we say is a modest improvement based on the enrollment targets that we put out there for 2023 year-to-date. Please go ahead, your line is now open. So that's really the reason for it and I would say somewhere in the mid 90s, is what we're expecting for Q4 which again, when you look at it on a year-over-year year-to-date, Josh when you normalize our medical loss ratio for risk adjustment, and medical costs, and put them in the right periods, we continue to track year-over-year on a year-to-date basis and expect this in the fourth quarter to be somewhere between 1000 to 1200 basis points improved year-over-year year over year. Your line is now open. quarterly volatility is impacted by the same things that are impacted by the Bright Healthcare book, principally, and that is as we've entered into Florida last year, the volatility in there is given the fact that it's on a risk basis or a capitated basis that the impact of Bright Healthcare flows through to NeueHealth. Your line is now open. Your line is now open. Your line is now open. Please go ahead, your line is now open."
}