{
    "symbol": "BHG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 02:04:08",
    "content": " We've made the investments necessary to position Bright HealthCare as a differentiated competitor in states with significant addressable markets in both the commercial marketplace and in Medicare Advantage, as well as establishing our NeueHealth care delivery business. We are operationally in a much stronger position, significantly reducing our claims backlog, successfully implementing our new technology platforms and demonstrating NeueHealth's differentiation to our Bright HealthCare business while it is becoming a meaningful contributor to our overall results. Bright HealthCare will be exiting the commercial marketplace in six states for the 2023 plan year – Illinois, New Mexico, Oklahoma, South Carolina, Utah, and Virginia – as well as discontinuing our employer group business. Bright HealthCare segment revenue grew 89% year-over-year to $1.6 billion, and NeueHealth segment revenue of $621 million compared to $49 million in the prior year. We expect our enterprise medical cost ratio to be in the range of 90% to 94% and full-year 2022 adjusted EBITDA to be in the range of a loss of $500 million to $800 million, which, consistent with the guidance we provided on our fourth quarter call, excludes any impact from mark-to-market investment gains and losses. The other impact that is a high loss ratio for NeueHealth that we've tried to break out separately as DCE just given the contractual relationship with the government of the high 90s or so, 97%, 98%, and so, we believe, over time, NeueHealth is going to contribute additional margin to the enterprise, both from our relationship with Bright HealthCare in the local markets and perform comparably to how we perform with our external customers. The good news is, starting off this year, I would note two things – one, we were much more prepared for the growth of our business, as well as each one of our markets in terms of having our care partner network and our affiliate physicians under contract and loaded into the system."
}