{
    "symbol": "DTSS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-30 20:23:05",
    "content": "  Datasea is a leading provider of products, services and the solutions in three converging and innovative industry: 5G messaging, acoustic intelligence, and smart city to enterprise and the retail customers. From July 2021  to June 30, 2022, the company generated $17.08 million from revenue which consisted by 5G messaging business with amount of $17.02 million, including $11.93 million from 5G SMS and the $1.8 million from 5G IN MPP  and $3.26 million from a aggregating the message cloud as value added services and $56k from Smart City project. Compared with fiscal year of 2021, 2022 marked a significant inflection point to scale and transfer Datasea under scoring the robust growth and competitiveness building in the 5G messaging business, the long term strategic planning by adding the acoustic intelligence business, and proof of great synergies and diversified revenue streams among the innovative business sectors, which are 5G messaging, acoustic intelligence and also the Smart City business. Datasea's primary operational goals are to first provide best-in-class products and solutions in 5G messaging, acoustic intelligence as Smart City. In 2022 Datasea also released China's first white paper was co-authored Institute of Cloud Computing and Big Data, China Academy of Information and Communications Technology to uncover detailed facts and compelling analysis of acoustic intelligence technology, commercial applications and also the industry outlook. And also, last, I want to mention that Datasea is one of the earliest like movers in this market, especially if you follow the company's disclosure closely you can tell that the company has already formed very strong relationships with the leading industry leaders such as other express delivery companies, several and also the commonly held strength is competitiveness, especially in the industry applications. So for the second question regarding the competitiveness, about the abilities of acoustic intelligence, Mr. Fu Liu, he thinks that first Datasea really is China's first white paper with the co-authors, which we mentioned earlier, like Institute of Cloud Computing and Big Data, China Academy of Information and Communications Technology, and also other leading research institutions. And also as companies start to add other business lines, for example, like 5G messaging and acoustic intelligence, in those two areas, there's a lot of things can happen together, and also reinforced and strengthen Datasea's solutions in terms of smart cities, or you can tell the synergies among these three businesses are very strong."
}