{
    "symbol": "DTSS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-14 10:52:01",
    "content": " In addition, benefiting from the great synergy between our proprietary technology and business lines, Datasea, together with MIIT, Ministry of Industry and Information Technology,  Laboratory stands for artificial intelligence key technology application evaluation and  , and the Cloud Computing and Big Data Institute of CAICT, China Academy of Information and Communications Technology, jointly released the first whitepaper on China's acoustic intelligence industry. According to the statistics released by Dow Insight, the market size of smart city, 5G messaging, and acoustic intelligence will reach respectively RMB400 billion approximately $62.9 billion, RMB300 billion approximately $47.2 billion, and RMB1.1 trillion approximately $172.9 billion in 2025 with a total 25% plus CAGR. Before I hand the phone to our CFO, I would like to ask our representative from the New York office to introduce the company's key progresses in 5G messaging, acoustic intelligence, and other businesses during the second quarter. First, client expansion and diversification, since 2021 as a leading service provider in the field of 5G messaging in China, the company has been engaged for services by over 100 institutional clients from express delivery, catering, to recent ecommerce, financing, and technology industry to establish messaging marketing cloud platform. In terms of marketing and also sales expansion from October 2021 to the end of December 2021, the company was engaged in various contracts that were related to SMS, integrated 5G messaging marketing cloud platform, and value added services with over contract value of approximately $14.73 million. From July 2021 to December 2021, the company generated revenue of $9,650,609 consisting of 5G business with amount of $9,916,811.12, including $7,786,104.56 from 5G SMS $1,830,706.56 from 5G IMMCP mobile projects on the cloud as value-added service, and $33,797.88 from smart city projects. It consisted of 5G SMS $7,786,104.56 and 5G IMMCP and $1,830,706.56, the search is due to the expansion of the company's business towards 5G messaging in fiscal year 2021. For the three months ended December 31, 2021 revenues mainly consisted of service fee from the 5G SMS service platform as the company proceeds into the later stage of the 5G messaging business."
}