{
    "symbol": "NTRS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 22:45:02",
    "content": " Within Asset Management, we saw strong year-over-year organic growth across key strategic areas of focus, including our FlexShares' ETFs which surpassed $22 billion in assets, up 13% for the quarter. Results for the quarter included $18.5 million in reclassification of certain fees that were previously recorded in other operating income, or as a reduction to other operating expense that are now included in trust, investment and other servicing fees. Trust, Investment and Other Servicing fees, representing the largest component of our revenue, totaled $1.2 billion and were up 10% from last year and up 5% sequentially. Foreign exchange trading income was $81 million in the quarter, up 3% year-over-year and up 5% sequentially. The remaining components of noninterest income totaled $88 million in the quarter, down 12% from one year ago and down 25% sequentially. Net interest income which I'll discuss in more detail later, was $388 million and was up 12% from one year ago and up 5% sequentially. Assets under custody and administration for asset servicing clients were $14.5 trillion at quarter end, up 5% year-over-year and down 4% sequentially. The year-over-year performance was primarily driven by new business, the previously mentioned $11.6 million accounting reclassification and favorable markets. Assets under management for Asset Servicing clients were $1.1 trillion, flat year-over-year and down 8% sequentially. Securities Lending fees were $19 million, up 3% year-over-year and flat sequentially. Other trust fees were $44 million, up 9% compared to the prior year and 24% sequentially. Trust, Investment and Other Servicing fees were $506 million and were up 14% compared to the prior year and up 4% from the prior quarter. Assets under management for Wealth Management clients were $396 billion at quarter end, up 11% year-over-year and down 5% on a sequential basis. Earning assets averaged $150 billion in the quarter, up 7% versus the prior year. The current quarter's equity incentives included $49 million in expense associated with retirement-eligible staff, compared to $32 million in the prior year. Employee benefits expense was up 1% compared to the prior year and was flat with the prior quarter, excluding last quarter's $3.4 million pension settlement charge. If you looked at that line overall, the custody and fund administration line, I think, $453 million in fees, about 27% of that would be equity sensitive just based on how the current allocations are. Now that said, as you look at other large asset managers that are not the largest but say, $50 billion to $100 billion in assets under management, there we're looking to have, I'm going to call it, 100% market share."
}