{
    "symbol": "NTRS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-20 15:02:08",
    "content": " Assets Under Custody and Administration for Asset Servicing clients were $12.8 trillion at quarter end, down 13% year-over-year and down 12% sequentially. Assets Under Management for our Wealth Management clients were $353 billion at quarter end, down 5% year-over-year and down 11% on a sequential basis. The current quarter's expenses included a $20.3 million pension settlement charge within the employee benefits category, while the prior year quarter included a pension settlement charge of $17.6 million. The sequential decrease was primarily due to the quarters -- to the prior quarter's equity incentives, including $49 million in expense associated with retirement eligible staff, partially offset by higher salaries. The year-over-year and sequential growth were both primarily driven by higher software costs due to continued investments in technology, as well as higher amortization Occupancy expense of $51 million was down 2% from a year ago and flat sequentially. And it's -- when we're -- I always say when clients are depositing $100,000, they -- those deposits are insured usually by the FDIC. And the power of rates going up on where we are, and if you look at just the way the balance sheet is naturally positioned, and loans are high -- probably 75%-ish floating, and then even a big chunk of the securities portfolio reprices within a year, and then, obviously, the cash position is short. Yes, that is incremental within the quarter, but that's us leaning in, in the spirit of trying to be helpful to uncertainty, we just don't -- a lot of what we're doing is just trying to hold on to those deposits, those operational deposits, because we feel they're so volatile. I don't think it changes the dynamics of the outcome significantly on NII, but it's -- when I -- when we say significantly higher, it's not 55% versus 50%, itâ\u0080\u0099s more like 75% to 100% is a safer way to model it. So the way that we're thinking about it is that as you put in a number of factors on both the revenue side and on the expense side, that we want to be in the range for a pretax margin of kind of that mid -- low to mid-30%s, that's the type of range that gets us at the higher end of our ROE target as well. I think what's -- the one thing Iâ\u0080\u0099d think it's instructive to think through is that a lot of our clients think about cash as an asset allocation output, and so one of the things to think about is you're predicting where even core operational transactional deposits will look like is what are overall asset levels and what are market levels, because our clients consistently think about liquidity as an asset allocation tool."
}