{
    "symbol": "SPB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-12 14:36:30",
    "content": " While we expect inventory challenges to persist over the next 2 quarters as retailers adjust to shifting consumer sentiment, particularly in HPC, we believe we are particularly well positioned in our Global Pet Care and Home & Garden businesses, which are high-margin, high-velocity consumable businesses that have historically been recession-resilient. While the exact mix of business unit contribution is difficult to predict, we believe that Global Pet Care has the ability to generate greater than $200 million of EBITDA per year, Home & Garden can generate greater than $120 million of EBITDA per year, and our Empowered Brands has the ability to generate at least $100 million per year. Excluding the impact of $29.5 million of unfavorable foreign exchange and acquisition sales of $71.3 million, organic net sales increased 4.4% from pricing actions related to inflationary costs and improved fulfillment despite reduced consumer POS, higher retail inventory levels and replenishment order headwinds. Gross profit increased $13.4 million, and gross margin of 33.7% declined 160 basis points from a year ago as price now exceeds inflation dollars but does not cover the margin percent, as well as increased demurrage and detention costs from higher in-house inventory and inventory back up in the supply chain. SG&A expense of $256 million increased 13.9% at 31.3% of net sales with the dollar increase driven by higher transportation costs, higher distribution expense due to short-term storage costs from high inventory, expanded distribution footprint and higher investment in restructuring, optimization and strategic transaction initiatives. Lower EBITDA in the quarter was driven by the unfavorable impact of FX, product mix and increased distribution investments as we expanded our DC footprint to support higher revenues, which have grown over 30% over the past 2 years, and continue to support our customer fill rates. First, we continue to make progress on the strategic objective of creating a higher-margin, faster-growing, pure-play global pet care and home and garden business by continuing to execute on our objective to close the $4.3 billion sale of our HHI business to ASSA ABLOY; and secondly, by accelerating the integration of Tristar into our Home and Personal Care Appliance businesses and completing the internal carve-out work necessary to separate that business through a spin-off or another transaction in fiscal '23. Secondly, given the challenging retail environment with multiple key customers actively reducing inventory levels, leading to unpredictable customer ordering and the overall uncertain macroeconomic conditions, we're lowering our 2022 earnings framework as we focus the business on cash generation even at the expense of our near-term EBITDA performance. And obviously, Chris, we're sitting here with a continuing operations inventory level, you can see on the balance sheet, it's about $250 million higher than it was at the end of the last fiscal year."
}