{
    "symbol": "GIL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 22:07:03",
    "content": " Please ask your question. As we move into the second half, as we said, we have seen some slowing as we've moved from June into July, but the outlook remains positive in the back half because of this shift that's going on, I would say, to a certain extent, from hard goods to people want experiences, and if they want experiences, they want travel, they want tours and they want events and that's a strength in the Printwear business where we're very strong, but we've got a large order book. Please ask your question. Where we saw really, I think a little bit of downward pressure, obviously, our retail business has been negative, and I don't think it's really ever since the end of Q1, I think it's been a trajectory similar and hasn't moved them in a typically because of stimulus and the higher cost of energy and food, et cetera, to the mass market shopper, but that's on the content. Please ask your question. Please ask your question. Please ask your question. I think that with the way the market is today, I would say that it's hard for us to say because obviously, our objective is to keep a good balance of inventory in the channel, so we may never ever get up to those levels of '19 to be perfectly honest with you, and it's not necessarily an advantage for anybody, it's more working capital for our customers, and so our objective is that as part of our back-to-basic strategy, the reduction of our SKUs and the ability for us to service basically, I think that we would like to see the levels of inventory stay where they are today. Please ask your question. Please ask your question. So we won't see the effects really until Q2 and then by the time that product gets our supply chain and really makes an impact on our sales, it will be a 24-story, so we're pushing as hard as we can on Bangladesh, but like anything else, we're working through all the supply chain and other things to bring on to capacity, but saying that, we have a lot of capacity that's coming on still in Central America. Please ask your question. Please ask your question. Our distortive business moderated somewhat in Q1 like we called out, but right now, I would say that it's the national account and obviously, the retail side of the business, which has been a little bit of a drag, let's say, for example, in the last six weeks or so, and obviously, international hasn't been performing either, but that's one area that we're starting to see a little bit of a pickup around because we've had a pretty sharp declines in our international business."
}