{
    "symbol": "PTC",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-01 22:02:02",
    "content": " The net impact of these softer bookings and stronger renewals was a slowdown of about 0.5 percentage point from last quarter's 16% ARR growth rate, taking the Q1 ARR growth rate down to about 15.5%. With Q1 behind us, as compared to our original guidance, we're now on track to deliver ARR growth results within a narrower 11% to 14% range in fiscal 2023, with the low end having been raised, because the 10% outcome is less plausible now, given that solid Q1. Across this range of ARR outcomes, we've also raised the original cash flow guidance we provided a quarter ago by $15 million to $575 million, which now represents 38% growth for the full year. The raise is powered in roughly equal parts: by a strong free cash flow result in Q1, the expected $5 million benefit from the ServiceMax acquisition and improving foreign exchange rates. In Q1 2023 our constant currency ARR was $1.6 billion, up 15% year-over-year and exceeded guidance. Our cash from operations also came in ahead of guidance by $11 million, due to a combination of free cash flow outperformance and the timing of capital expenditures which were $9 million in Q1, compared to our guidance of $5 million. Based on the exchange rates, at the end of Q1 2023, our as-reported ARR in Q2 of 2023 would be higher by approximately $62 million compared to the midpoint of our constant currency guidance and fiscal 2023 as-reported ARR would be higher by approximately $67 million compared to our constant currency guidance midpoint. For fiscal 2023, we expect constant currency ARR growth of 22% to 25%, which corresponds to a fiscal 2023 constant currency ARR guidance range of $1.91 billion to $1.96 billion. While we saw some incremental macro-driven booking softness in our first quarter, this was partially offset by better-than-planned churn and our guidance contemplated the potential for a much bigger impact than what we saw, and we actually finished $3 million above the high end of our Q1 2023 ARR guidance range. So, it's primarily for these three reasons that we're derisking the ServiceMax guidance for fiscal 2023 and adding $170 million to our now updated 11% to 14% guidance range. With a strong Q1 behind us and given our pipeline and forecast and how we've set our guidance ranges, we believe we're well-positioned to achieve our fiscal 2023 ARR guidance. Compared to the guidance we provided a quarter ago, our updated $575 million target for free cash flow factors in our strong execution and results in Q1, $5 million from the ServiceMax acquisition which we already communicated at our Investor Day, as well as an increase from FX tailwinds for the remainder of the year. The illustrative model indicates, that to hit the midpoint of our Q2 2023 guidance range of $1.8 billion, we need ServiceMax ARR of approximately $160 million, which is what we said at Investor Day and believe is a reasonable target. Your line is open. Your line is open. Your line is open. Your line is open. And because, again, the scenario was a little strange compared to the guidance scenarios, softer on bookings, stronger on free cash flow to avoid having to disclose a lot more detail, we netted it out and netted it out as better than guidance but a slowdown of about $8 million for the year 0.5 percentage point. Your line is open. Your line is open. Your line is open. Your line is open."
}