{
    "symbol": "CHX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 12:53:04",
    "content": " During the second quarter, we demonstrated our commitment to returning capital to shareholders by returning over 60% of our free cash flow generated during the period to our investors via our regular cash dividend and by repurchasing 20 million of ChampionX stock. As seen on Slide 7, second quarter 2022 revenue was $933 million up $67 million or 8% sequentially and up 24% year-over-year, as we posted solid revenue growth in all of our operating segments. As seen on Slide 8, ChampionX consolidated adjusted EBITDA in the second quarter was $138 million up 11% versus the previous quarter and an increase of 31% versus the prior year period. Turning to our business segments, Production Chemical Technologies generated second quarter revenue of $552 million up 7% from the first quarter and up 24% year-over-year. Our price realization caught up to raw material inflation during the second quarter, and we still expect to deliver healthy sequential EBITDA margin rate improvement in the second half of 2022. Production and automation technology's second quarter segment revenue of $242 million increased 10% sequentially primarily due to activity increases, market share capture and increased pricing. Drilling Technology's segment revenue was $58 million in the second quarter up 2% sequentially and 54% year-over-year, as we experienced continued demand growth in North America and internationally as well as increased pricing. Revenue Chemical Technologies' revenue for the second quarter was $44 million, which is an increase of 11% sequentially and up 33% year-over-year. During the second quarter, we returned over 60% of our free cash flow to shareholders in the form of our $15 million regular quarterly cash dividend and with $20 million of share repurchases. We expect our Production Chemical Technologies and overall ChampionX EBITDA margin to accelerate in the second half of this year, exiting 2022 at an EBITDA margin rate of 18%. So, which means there is the substantial portion of our surplus cash, we expect to return to our shareholders and you saw that in Q2 of 60% of it and we have said that we expect the cash flow profile to improve further in second quarter -- second half and we are committed to increasing our cash flow, a return of cash to the shareholders as that cash flow profile increases."
}