{
    "symbol": "CHX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 12:53:06",
    "content": " Let me start by saying that 2022 was a year of strong momentum for ChampionX as we delivered robust performance on each of our key metrics, including revenue growth, adjusted EBITDA margin expansion, free cash flow generation, and capital return to our shareholders. Despite experiencing a slight sequential revenue decline in the fourth quarter, which was driven by a normal seasonal slowdown in sales in our North America onshore businesses into the yearend holidays, our Q4 adjusted EBITDA margin improved by approximately 190 basis points versus the third quarter on continued pricing realization and favorable mix. For the full year 2022 we generated free cash flow of $329 million, which represented 54% of our adjusted EBITDA. Our fourth quarter 2022 revenue was $986 million, up 20% year-over-year, and 3% lower than our robust third quarter revenues. As seen on Slide 11, ChampionX consolidated adjusted EBITDA in the fourth quarter was $179 million, up 8% versus the previous quarter at an increase of 30% versus the prior year period. Turning to our business segments, Production Chemical Technologies generated fourth quarter revenue of $637 million, down 1% from the third quarter and up 29% year-over-year. Segment adjusted EBITDA was $121 million, up 18% sequentially and 47% higher than the fourth quarter of 2021. Production and Automation Technologies fourth quarter segment revenue was $244 million, a 1% decrease sequentially. PAT fourth quarter segment adjusted EBITDA was $51 million, down 3% sequentially and up 29% year-over-year. Segment adjusted EBITDA margin was 21%, down 30 basis points versus the third quarter and up 134 basis points from the prior year, again due to higher volumes and pricing. Drilling Technology segment revenue was $54 million in the fourth quarter, down 12% sequentially and up 7% year-over-year. Drilling Technologies delivered segment adjusted EBITDA of $11 million during the fourth quarter, down $6 million sequentially and down $2 million compared to the fourth quarter 2021 level. Reservoir Chemical Technologies revenue for the fourth quarter was $26 million, which is a decrease of 28% sequentially and 35% down year-over-year. At the midpoint, this represents a 35% increase over the first quarter of 2022, and again at the midpoint, this represents a 300 basis points improvement year-over-year in the company adjusted EBITDA margin rate."
}