{
    "symbol": "CHX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 13:42:05",
    "content": " As the cyclical recovery in demand for energy services and equipment has gained further momentum, our business portfolio once again delivered industry-leading top line growth in the first quarter, both sequentially and year-over-year, driven by strong top line growth both in North America and international markets. In the first quarter, our revenues increased 26% year-over-year and 5% sequentially, demonstrating the strong organic growth potential and the execution capabilities of our global business. As seen on slides eight and nine, first quarter 2022 revenue was $866 million, up $44 million sequentially and up 26% year-over-year as we posted solid growth in all our operating segments. Turning to our business segments, Production Chemical Technologies generated first quarter revenue of $515 million, up 4% from the fourth quarter and up 25% year-over-year. Production & Automation Technologies first quarter segment revenue was $220 million, increasing 9% sequentially, primarily due to activity increases, market share capture and increased pricing. Drilling Technologies segment revenue was $57 million in the first quarter, up 14% sequentially and 63% year-over-year, as we experienced strong demand growth in North America and internationally. And what we wanted to provide in the slide is a view of how the pricing versus raw material has been evolving and a line of sight to why we believe that starting in Q2, you will see our Production Chemicals business starting to deliver margin expansion and then exit at a much higher rate of at least 18% as we exit 2022. Hey, good morning, Soma. So, that's what I would say. So, that's what I would say. Hey, good morning, Soma. Now with respect to our growth internationally, I would say, let me say, in Production & Automation Technologies, the international business outside of North America in the first quarter for us, sequentially grew about 13%."
}