{
    "symbol": "CHX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 11:54:12",
    "content": " The third quarter reflected the accelerating momentum for ChampionX as we delivered strong performance along all key metrics, including revenue growth, adjusted EBITDA margin expansion, free cash flow generation, and capital return to our shareholders. First, revenue growth - ChampionX has consistently delivered strong top line growth since our transformational merger in June of 2020; in fact, the third quarter in which we grew our revenue by 10% sequentially and 25% year-over-year marked the sixth consecutive quarter in which we have delivered sequential revenue improvement. In the third quarter, between our regular cash dividend of $15 million and $80 million of share repurchases, we returned 57% of our free cash flow to our shareholders. As seen on Slide 7, third quarter 2022 revenue was $1 billion, up $89 million on second quarter or 10% sequentially, and up 25% year-over-year. Turning to our business segments, production chemical technologies generated third quarter revenue of $644 million, up 17% from the second quarter and up 32% year-over-year. Drilling technology segment revenue was $61 million in the third quarter, up 5% sequentially and 23% up year-over-year as we experienced continued North American and international demand growth. During the third quarter, we returned 57% of our free cash flow to shareholders in the form of our $15 million regular cash dividend and $80 million of share repurchases. We continue to expect capital investment to remain in the range of 3% to 3.5% of revenues, and while in periods of revenue growth we will see the need for working capital investment, we remain confident in our 50% to 60% free cash flow to EBITDA conversion ratio guidance through the cycle, and we expect strong free cash flow delivery as we exit this year. Both North America and international grew, and from a sequential perspective our international business in PCT grew over 24%, so the mix--if you think about North America, which is U.S. and Canada for us when we define North America, particularly in the production chemical business, the mix is over 50% now international, so I would expect that mix to continue to go up a little bit more as international growth continues to grow. Yes, you know Scott, first and foremost, as you have seen, we have absolute commitment to return excess cash flow to shareholders, and when you look at, for example, this year, year-to-date over the last three quarters, we have returned over 80% of our free cash flow to our shareholders, so clearly for us itâ\u0080\u0099s--the excess free cash flow, we are committed to return. Another element of it is if you think about rod lift, and again similar to production chemicals, during the times of constructive commodity prices, customers spend to make sure that their wells are operating in the most efficient manner and with less downtime, so rod lift benefited from that spending and also the conversion cycle that is going on--you may remember we talked about those conversions, and rod lift is continuing to benefit from that conversion as well, so you should expect if thereâ\u0080\u0099s going to be a strong D&C spending growth next year, you should expect our automation lift business to grow pretty strong in conjunction with that. Strong organic growth combined with the positive momentum and runway in our margin expansion, the strong free cash flow generation and our commitment to returns at least 60% of our free cash flow to our shareholders, these are the key elements as we look into the future."
}