{
    "symbol": "QCRH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 22:08:04",
    "content": " We increased our core earnings by $6 million for the first quarter, posting core earnings per share of $1.73 and generating an ROAA of 1.6%, after adjusting for nonrecurring items primarily related to the closing of the Guaranty Bank acquisition. Our reported net interest income for the quarter was $59.4 million, and excluding acquisition accretion of $1.7 million, it was $57.7 million, near the upper end of our guidance range of $56 million to $58 million. Given our solid pipeline of transactions, while recognizing timing continues to be impacted by project delays caused by ongoing supply chain disruptions and inflationary pressures, we continue to expect the source of fee income to be in a range of $13 million to $15 million per quarter for the remainder of 2022. Excluding swap fees and non-core items, noninterest income for the second quarter totaled $9.3 million, which was within our guidance range provided on last quarter's call. Certainly, we talked about the headwinds in this business in the past, but we feel comfortable that we can perform in that $13 million to $15 million range for the next two quarters given the market conditions we see today. Hey, good morning, guys. Hey, good morning, guys. Just the -- you talked, Todd, about the kind of a non -- on the fee income side, kind of the non-capital markets revenue being around that nine -- a little bit over $9 million this quarter. And so, it might be better for all of us to think about it that we're guiding to $26 million to $30 million for the last half of the year versus necessarily $13 million to $15 million each quarter. One of the things that helped us in how we think about it, and to Larry's point, being opportunistic when the time is right, based on our earnings run rate and the high level of earnings we're driving and our low dividend payout intentionally, we can organically add 40 to 50 basis points of TCE each quarter."
}