{
    "symbol": "QCRH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:51:05",
    "content": " The cost of our total interest bearing liabilities further improved by 1 basis point from the fourth quarter, we utilized our overnight borrowing capacity during the quarter to temporarily fund some of our loan growth and we subsequently repaid the majority of these advances after quarter end with Guaranty Bank's excess liquidity. 09:31 Now turning to our non-interest income of $15.6 million for the quarter, which was lower than the $23 million we generated in the fourth quarter. Capital markets revenue from Litech swap fees has averaged $15 million per quarter since the first quarter of 2020, which gives us continued confidence in the sustainability of this important source of fee income. 10:15 During the same nine quarter period, capital markets revenue from Litech swap fees has range from a low of $4.5 million to a high of $25.2 million. Given our solid pipeline of transactions, but recognizing the project delays caused by ongoing supply chain disruptions and inflationary pressures that Larry mentioned previously, we are expecting this source of fee income to be in a range of $13 million to $15 million per quarter for the remainder of 2022. 10:47 Excluding swap fees and non-core items, non-interest income for the first quarter totaled $8.3 million. We expect non-interest income, excluding capital markets revenue to be in the range of $9 million to $11 million for the second quarter. 11:51 Looking ahead to the second quarter and factoring in the addition of Guaranty Bank, we anticipate that our level of non-interest expense will be in the range of $46 million to $48 million. Please go ahead with your question. I’d love to get an update us in terms of kind of the interest rate sensitivity position, the balance sheet at the end of the quarter and how you guys see the margin trending over the next couple of quarters and similar Fed rises by -- I think 0.5% or so in both May and June? Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. So when you look back at that other non-interest income, we had about $8.3 million of that legacy QCRH GFED Guaranty Bank had about $2.2 million in the first quarter."
}