{
    "symbol": "ATEC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 09:21:19",
    "content": " On the EOS front, we're a long-term foundation building with regard to the clinical operational and economic influence of informatics and data as well as EOS is availing us new hospital access as well as we're really just starting to lay the foundation for what's going to happen in terms of the integration intraoperatively with regard to EOS. And so a little scorecard: we grew 39% year-over-year organically from a revenue growth perspective, 18% year-over-year growth in terms of surgical needles, 11% year-over-year growth in terms of average revenue per case, 87% of our revenue is new products and 2.1 is the blended average product category sold per case. And so really when you think about that, and you think about all of the images being the same, and you think about capturing all of that data really you're setting yourself up for Spine's first real predictive analytics that's been talked about for years, but not done. And consistent with our increasing average revenue per case, revenue from lateral procedures contributed close to 40% of our dollar growth in the quarter on the strength of PTP, which continues to expand our lateral market share. With the 11% growth of average revenue per case achieved in Q1, we now anticipate a high-single-digit percent rate of expansion for the full year, which compares to the mid-single-digit rate expected previously. So at the end of the day, I think you can assume that, there's a certain amount of COVID impact in the second half, although not certainly materially about half of what we saw last year, and we're not anticipating any here in the second quarter. Please go ahead, sir. And just a follow-up maybe for Todd just on the revenue guide increase, nice to see you talked about a mix shift towards higher ASP proceeded particularly kind of PTP and lateral doing better than expected out of the gate here in 2022, as one of your competitors about just -- when our checks last year suggested that some of the more complex multilevel cases at risk for ICU admission maybe were being postponed at a higher clip than single level case. So I really think it's more about our lateral business, which has a higher ASP than our overall average growing at a faster rate kind of throughout the year than we had initially contemplated in the guide. Please go ahead, sir. And probably what you'll see throughout the year is a bit more linear growth, rather than the history what you've seen is historically we saw EOS revenue be about 35% to 40% in the first half and the balance being in the second half, largely because a lot of that was influenced by distributor sales."
}