{
    "symbol": "ATEC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 10:50:06",
    "content": " Itâ\u0080\u0099s nice 5 years later to be generating $90 million for the quarter, which is a 43% year-over-year growth rate. Itâ\u0080\u0099s our 14th consecutive quarter of greater than 20% U.S. revenue growth, excluding the 11% in the pandemic-ridden Q2 2020, 32% year-over-year growth in procedure volume, 15% year-over-year growth in average revenue per case, $11 million in EOS revenue, with a significant opportunity pipeline up 45% year-over-year, and weâ\u0080\u0099ll get into the blended average of product categories per case with that and the 2.3 and continues to grow. Third quarter total revenue was $90 million, reflecting 43% growth over the prior year and a 7% increase compared to the second quarter. EOS revenue in the third quarter was $11 million, flat compared to Q3 of 2021 on a reported basis and up 7% in constant currency. Third quarter non-GAAP R&D was $10 million and approximately 12% of sales, 100 basis points lower than the prior year. Non-GAAP SG&A was $67 million and approximately 75% of sales in the third quarter, compared to $52 million and approximately 84% of sales in the prior year period. Total non-GAAP operating expenses amounted to $78 million and approximately 87% of sales in the third quarter, compared to $60 million and 96% of sales in the prior year period, delivering a total of 960 basis points of operating leverage year-over-year. Adjusted EBITDA was a loss of $6 million and approximately 7% of sales in the third quarter, compared to a $10 million loss and 16% of sales in the prior year. As sales growth leverage across our business, we expect an adjusted EBITDA loss for the full year 2022 of approximately $28 million, or about 8% of sales, relative to approximately 12% of sales in 2021. Now turning to our outlook for the full year 2022, in line with 40% full year growth rate that we previewed in conjunction with the prerelease of the third quarter financial results, we now expect full year 2022 total revenue to approximate $340 million, which, as a reminder, compares to guidance of $325 million previously. The strength of the growth in revenue per surgery year-to-date, including a 15% growth rate in the third quarter, drive our new expectation for a low double-digit rate of expansion for the full year, compared to the high single-digit percent rate that we expected previously. And so that continues, and I think thatâ\u0080\u0099s ultimately why you see volume up north of 30% and surgeon users up greater than 20% and so you will also see implied there a meaningful growth in kind of procedures per surgeon. So, at the end of the day, year-over-year adjusted EBITDA of negative $6 million is about 7% of sales and improved 870 basis points over the prior year Q3. And I think I would kind of add to that, Drew, if you think about next year, I think the Street is around $400 million in total, representing about a 23% growth over our previous guidance, and presumably that will get updated here post the call. But if you look at where EOS is at today and the $46 million on a constant currency basis is growing north of 20% on a full year pro forma basis, I think it gives us great confidence in our ability to continue to grow that business and to do it in line with what we have talked about in the past."
}