{
    "symbol": "PK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 15:49:05",
    "content": " Looking ahead to 2023, we expect RevPAR at our Reach Resort to likely be flat to down versus 2022, but still well in excess of prior peak levels, while the transformative $70 million renovation of Casa Marina during the second-half of the year is expected to account for approximately 105 basis points of full-year RevPAR disruption and $14 million of EBITDA disruption overall. Please proceed with your question. And then specifically, I mean, one of the things I'm amazed by the performance of your Hawaii assets and it seems like -- and maybe if you can comment a little bit more in your outlook on Hawaii as well because the demand essentially hasn't been there and yet you still are in Hawaii Village at $173 million above EBITDA. And clearly, with cash on balance sheet, I would say it's still -- as part of our overall liquidity of $1.9 billion it's certainly a little more important as kind of we think about paying that down. $725 million, certainly a lot of money, it's going to be certainly a part of the solution, but I wouldn't say that we're looking to pay it off completely today with that cash that we have on our balance sheet. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. I guess I wonder if you could talk a little bit about what you think is going on with business transient because it's just sort of surprising that, that didn't maybe show a little bit more and certainly, you're not the only hotel company where I think we're not seeing as much of that. Please proceed with your question. Please proceed with your question. So clearly, while it remains in the quarter for the quarter, I'd say that's a big difference, clearly, it's a lot of short-term in smaller groups, but you're starting to see through the pipeline, some of the larger groups coming through, planning ahead, a group that might have done something last year is coming back and ultimately being bigger."
}