{
    "symbol": "DNOW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 03:39:05",
    "content": " For example, EBITDA, excluding other costs, for the first quarter of 2022 was $28 million or 5.9% of revenue. We generated $473 million in revenue in the first quarter, up $41 million or 9.5% sequentially. In Canada, revenue grew to $82 million for the quarter, a 14% sequential improvement. Total first quarter 2022 revenue was $473 million, a 9.5% increase or $41 million in growth over the fourth quarter of 2021. On a year-over-year basis, we not only saw strong first quarter 2022 performance with revenue growth of $112 million or 31%. The U.S. revenue for the first quarter 2022 was $334 million, a 10% increase or $31 million higher than the fourth quarter. Year-over-year, U.S. revenue increased $82 million or 33% from the first quarter of 2021. Turning to Canada, for the first quarter revenue was $82 million, up $10 million or 14% from the fourth quarter of 2021. And year-over-year, Canada first quarter revenue increased $24 million or 41%. International revenue in the first quarter of 2022 was $57 million, flat sequentially and up 12% or $6 million compared to the same period of 2021. While the balance, about $2 million, should be considered more temporary in nature as we experienced lower-than-expected health care costs in the first quarter, compounded with the benefit related to fewer payroll days sequentially. We ended the first quarter in a net cash position of $293 million, including zero debt and zero draws in the quarter, resulting in total liquidity of $582 million, comprising the $293 million of cash on hand plus $289 million in additional credit facility availability. Accounts receivable was $341 million, an increase of 12% or $37 million from the fourth quarter, reflecting strong customer demand. Mark talked about how and I think it was the third quarter of 2019, we produced EBITDA of $28 million, but we had hundreds of millions more in revenue and a lot more expense associated with delivering $28 million in EBITDA."
}