{
    "symbol": "DNOW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 15:21:04",
    "content": " Revenue was 72 million for the second quarter, a 12% sequential reduction and up 41% year-over-year as second quarter revenue fared much better than the midpoint of our expected seasonal decline. Our international segment revenue improved sequentially and year-over-year, excluding the impact from foreign currency headwinds as Mark will talk about later, international second quarter revenue increased 19% year-over-year. On a year-over-year basis we saw a strong second quarter 2022 performance spearheaded by revenue growth of $139 million or 35% and elevated our EBITDA profitability to a record setting 8.7% or $47 million for the quarter, an EBITDA level nearly 6x what it was one year ago on solid operational execution with improved gross margins. The U.S. revenue for the second quarter 2022 was $408 million, up 22% or $74 million sequentially, and up $112 million or 38% year-over-year on continued strengthening and rig count persistent depletion of DUC inventory and increased completions activity. Turning to Canada for the second quarter revenue was $72 million, down $10 million, or 12% from the first quarter of 2022 as a result of typical seasonal breakup. However, it's worth noting that this quarter was the smallest second quarter pullback on record, thanks in large part to the enduring efforts of our excellent sales and operations teams executing and winning projects and additional business in the market, which also translated into year-over-year second quarter revenue increase of $21 million or up 41%. International revenue in the second quarter of 2022 was $59 million, up $2 million, or 4% from the first quarter. When excluding the impact from foreign currency exchange rates, second quarter international revenue increased 7% sequentially as the stronger U.S. dollar relative to foreign currencies unfavorably impacted sales by approximately $2 million compared to the first quarter of 2022. When excluding the unfavorable impact from foreign currency exchange rates, year-over-year second quarter international revenue increased 19%. Looking back one year ago to the second quarter of 2021, we have grown quarterly revenue by $139 million, yet only added $4 million in quarterly WSA cost for about 3% of the revenue increase. In the second quarter, the U.S. contributed $32 million in operating profit or approximately 8% of revenue. Canada delivered $6 million in operating profit or approximately 8% of revenue, also a record in absolute profit dollars and percent and looking back at each of the second quarter breakup periods since being public. For the second quarter, EBITDA was $47 million, or 8.7% of revenue our highest since being public. Cash used in operating activities during the second quarter was $29 million, primarily due to about a $70 million buildup in our working capital to support our customers business activities offset with current period earnings. With 2022 full year revenue now expected to grow up to 30% compared to full year 2021, with EBITDA approximating 7% of full year revenue, which would represent a 420 basis point improvement from 2021 or add in approximately $100 million in EBITDA dollars year-over-year. We've been planning some projects, one large one that hit in the second quarter for about $9 million, that good margins again, because we had access to products and we kind of for thought the preposition of inventory to maximize gross margins in the short-term."
}