{
    "symbol": "DNOW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 22:05:02",
    "content": " EBITDA in the third quarter rose to $53 million, up $6 million sequentially, outperforming our guide as we delivered better-than-expected revenue growth on higher gross margins while maintaining WSA as a percent of revenue. This quarter, we also produced $44 million of positive free cash flow, our highest level at this rate of sequential quarterly revenue growth as we grew revenue, improved gross margins, invested in inventory are standing up a new supercenter in the Bakken and added employees to fuel the future. In Canada, revenue was $86 million for the quarter, an increase of 19% sequentially and 26% year-over-year as drilling and customer activity improved. Total third quarter, 2022 revenue was $577 million, a 7% increase or $38 million in growth over second quarter of 2022, despite a $4 million foreign currency headwind. On a year-over-year basis, we saw a strong third quarter, 2022 performance, spearheaded by revenue growth of $138 million or 31%. EBITDA profitability expanded to 9.2% or $53 million for the quarter, over 3 times what it was one year ago on solid operational execution and increased gross margins. The U.S. revenue for the third quarter, 2022 was $435 million, up 7% or $27 million sequentially and up $123 million or 39% year-over-year on continued strengthening rig count, persistent depletion of DUC inventory and increased completion activity. Turning to Canada, for the third quarter, revenue was $86 million, up $14 million or 19% from the second quarter of 2022, with an increase in project activity and several customers moving up deliveries to the third quarter that were originally planned for the fourth. Compared to the third quarter of 2021, Canada's revenue increased $18 million or 26% year-over-year. Year-over-year, third quarter, 2022 international revenue declined 5% or $3 million. Looking back one year ago to the third quarter of 2021, we expanded quarterly revenue by $138 million, yet only added $9 million in quarterly WSA costs or about 7% of the revenue increase as we work to improve efficiencies."
}