{
    "symbol": "OM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 23:10:02",
    "content": " Based on Q3 momentum, we are raising our fiscal year 2022 revenue guidance today to reflect our continued confidence in the strong underlying market fundamentals and demand for Tablo across our acute and home end market. To close on AFN, we came away from this conference incrementally more positive about the tailwinds driving Tablo adoption across three days, our conversations with providers, nephrologists and patients reinforce more than just interest in driving home adoption, but a real call to action, dramatic in center staffing shortages, patient experiences during the pandemic, improved outcomes at home and the comfort patients and providers now have with home health are all factors that replayed in nearly every discussion. In summary, we had a strong Q3 that demonstrated Tablo's value proposition in our large acute and home end markets and we have a high degree of confidence in our team's ability to execute as we round out 2022 and set ourselves up for 2023 to continue to deliver on our promise to dialysis patients and providers. So I think that the dynamics in the home in Q3, I think that they got known as we got there in â\u0080\u0093 on the August call was how many, if any of the patients, the home patients that were in the pipeline in early June would end up waiting for Tablo, and that was a card that we just hadn't turned over in August. And so as we thought about sort of the Q4 guidance, and again, I'll turn it over to Nabeel for the quantitative color, but as we thought about the Q4 expectations for home growth, we really thought about it in the context of more sort of normalized home growth focus just on part two, those new patients in the quarter that would be choosing home for the first time. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. But again today, sort of the dawn of a new day with all of the incentives and all of the tailwinds and you mentioned a new one around staffing shortages really encouraging dialysis providers to push more patients into the home. And yes, I think weâ\u0080\u0099ve all seen and heard the big and even medium sized dialysis care providers talking about their own challenges with staffing shortages in the in-center environment, home, whether PD or HHD is clearly a way that you can serve the same or more patients in a particular location without having to increase your staffing census at the same time. Your line is open."
}