{
    "symbol": "LFLY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 11:06:07",
    "content": "  Operator: Hello, and welcome to today's Leafly First Quarter 2022 Earnings Call. Good afternoon, and welcome to Leafly's first quarter 2022 earnings call. Today's call will contain forward-looking statements, which are made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include statements regarding the services offered by Leafly, the markets in which Leafly operates, business strategies, performance metrics, industry environment, potential growth opportunities and Leafly's projected future results and financial outlook and can be identified by words such as expect, anticipate, intend, plan, believe, seek or will. Forward-looking statements, by their nature, address matters that are subject to risks and uncertainties that could cause actual results to differ materially from expectations. For a discussion of the material risks and other important factors that could affect our actual results, please refer to the risks discussed in today's press release, our annual report on Form 10-K filed with the SEC on March 31, 2022, and our other periodic filings with the SEC. A reconciliation of the GAAP and non-GAAP results is included in our earnings press release, which has been filed with the SEC and is also available on our website at investor.leafly.com. Before I get into sharing some of the exciting progress we've made over the last quarter, I want to recognize the momentum we are seeing in the industry and what it means for Leafly. Over the past several months across North America, we've seen a buildup to the opening of important recreational markets in New Jersey and New Mexico, with New York and Connecticut hinting at the potential to start rec sales in late 2022. This is great for the industry, but also great for Leafly as we open new markets where we can easily scale our technology with few bespoke investments. And because of our content-driven marketplace, we already have a strong foothold across consumers in these markets, and we'll continue to invest as they come online. Perhaps in the biggest nod to destigmatization I've seen, we also have the unique opportunity to ring the opening bell at NASDAQ on 4/20, the unofficial but widely celebrated cannabis holiday. In tandem with this industry momentum, Leafly had a solid start to 2022. Revenue for Q1 was $11.4 million, an increase of 21% year-over-year and in line with our expectations. We saw a 37% increase in the number of retail accounts in Q1 year-over-year, and our retail subscriber funnel remains strong. On a consecutive quarter basis, ending retail accounts grew 3%, reflecting elevated churn in challenging markets like Oklahoma and California and a higher-than-average number of out-of-business accounts. As we've fully transitioned our sales organization in Q1 to a regionalized model, our expanded sales capacity allows us to focus targeted efforts on reducing churn. Our top of funnel retailer acquisition remains strong, and we are positioned well to quickly bring retailers onto our platform, especially in markets that are scaling and in existing markets where license numbers are poised to expand. The cannabis industry operates at a local market level, and our strategies and investments reflect this. When we look across the business, average revenue per retail account, or ARPA, varies from market-to-market. In some of our key and most highly penetrated markets, we are seeing steady ARPA growth. As I mentioned last quarter, our strategy in these markets is to enter at lower price points, expand retail penetration, and drive higher spend from retailers over time. Given the mix of local markets across our platform and our strategic approach, we saw a slight and expected sequential decline in ARPA in Q1. Over time, as we invest in these markets, we are effective at increasing ARPA. We know that pricing power comes through our ability to bring as many retailers in the market onto our platform, and we'll continue to focus on improving penetration at the local level through our regional sales and CSM teams. Over the years, we've educated consumers and increased visibility across the industry before anyone else was publishing about cannabis at scale. With the momentum in cannabis today, we see traditional media publishers introducing more coverage around cannabis, which has helped solidify cannabis' move into the mainstream. That's positive for cannabis, and it has had a direct impact on our SEO traffic, specifically around our top of funnel News and Learn sections. As a result, we ended the quarter with approximately 7.7 million monthly active users, a drop over Q1 last year. We maintained and, in some markets, grew traffic to sections of the platform that generate the greatest value and consumer engagement for our retail and brand partners. But in the short-term, we will continue to optimize our strategy for revenue-generating traffic in prioritized markets and in the long-term, continue to invest in growing top of funnel traffic with unique and elevated cannabis content and differentiated consumer experiences. As we discussed during our first earnings call, following the closing of our business combination with Merida Merger Corp., we continue to make meaningful investments that we expect will have future positive impact as we take a purposeful and disciplined approach to drive both short-term and long-term growth. One, increasing our subscriber base across retail and brand accounts; two, improving our advertising platform; three, reducing friction and enhancing our offerings to our B2B partners; and four, creating an incredible consumer shopping experience. In Q1, the number of brand advertisers on our platform increased by 135% year-over-year. Although we are in the early stages of building out this customer segment, we are already working with top brands across THC-infused, other cannabinoid providers and ancillary products. We've added team members to aggressively go after this market, including hiring an account director for brand sales and with our revamped brand subscription product, now have a strong product that delivers real value for our brand partners. As the overall industry grows and becomes more established, retailers and brands are experiencing increased competition to reach customers. We are early in the stages, but we have already seen steady and strong growth in ad revenue in markets where we have introduced bidding. We are providing this data to the customers through the bidding process, empowering our best partners to make informed decisions about customer acquisition spend. And by opening up premium ad units to bidding, we've been able to give more partners greater access to high-value placements that they might not have had access to previously. The cannabis industry remains an industry full of friction and fragmentation for retailers and brands, particularly in the technology enablement space. This reduces the barrier of entry to working with Leafly and helps drive a simpler client experience with greater ROI as licensed retailers and brands can more easily leverage our traffic, proprietary insights and our technology for customer acquisition, e-commerce and digital advertising solutions. Some of the features we launched in Q1 include a business dashboard, which allows clients instant access to ROI metrics and best-in-class insights so they can regularly see the value they are getting from Leafly. We also introduced smart tool, a collection of best practices that retailers can use to improve their performance on our platform. We continue to invest in our deals engine, which drives increased consumer activation when retailers offer consumer deals and discounts. Looking ahead, we expect our sales and customer success teams to drive increased adoption of the platform tools we offer, including order-enabled capabilities and advertising add-ons. Our focus in 2022 is utilizing our unrivaled proprietary content and data from the past 12 years to provide a level of curation and personalization that increases the value proposition for consumers, and this ultimately produces greater ROI for retailers and brands. You can see this come to life in our recently launched strain quiz, which leverages the data underlying our strains database in a short quiz to match consumers to the strains that deliver the feelings and experience they are looking for, then connect consumers to the stores that offer products with those strains. To continue this theme of end-to-end experience, in Q1, we introduced a new consumer-facing delivery experience to augment our existing strong pickup offering, giving consumers an additional way to shop for cannabis in the way they want. We are in the midst of hyper local marketing efforts in Los Angeles, the largest legal cannabis market in North America, to drive increased adoption of our full suite of consumer-facing products, including our new and improved delivery gateway. Bolstered by our own editorial content, we've appeared across dozens of mainstream media outlets over the past quarter and consistently lead on share of voice as we not only provide color and context to the topic of cannabis and legalization, but also work to destigmatize and normalize its use. I say it often, I am pleased with what our teams have been able to accomplish this quarter and excited by the prospects for Leafly ahead as we continue to invest in areas that will have real and positive impacts on our business. As we detailed in our Q4 call in March, 2022 is a year of continued investment in the business. In addition, we're growing our product and engineering teams to make further improvements to our platform that enhance the consumer experience and provide a strong ROI for our retailer and brand customers. Revenue for the first quarter was $11.4 million, representing a year-over-year increase of 21%. Retail revenue of $9.2 million grew 17% year-over-year, while brands revenue of $2.2 million grew 35% over Q1 of 2021. The growth in overall revenue was driven by both increases in subscribers and ad products, which includes our new sponsored ad product as well as continued success with our auction bidding product. The number of ending retail accounts grew 37% year-over-year to 5,422. On a consecutive quarter basis, our ending retail accounts grew 3%. As Yoko touched on earlier, we saw higher churn in markets like California and Oklahoma, which have regulatory and license challenges. With a newly organized sales team structured by region, we're now more nimble to address market-specific dynamics at the local level. Our strategy to build out subscribers in underpenetrated markets contributed to a lower average revenue per account, or ARPA, of $576, a decline of $109 from Q1 of 2021. In markets with greater penetration, ARPA is significantly higher than our average. As Yoko mentioned, our strategy in new or underpenetrated markets is to build our market presence by offering competitively priced entry-level products. When markets reach a higher level of demand from consumers and we achieve strong penetration, we can introduce ad bidding to retail and brand subscribers and drive ARPA higher. We view our bidding product and more broadly, our ability to build advertising placements that allow for retailers and brands to compete for consumers on Leafly as a key driver for growth. We rolled out bidding for limited ad placements on Leafly in five states in Q1, and we've seen healthy increases in ad placement revenue. And we're excited about our growth in brand subscribers, a growing recurring revenue stream from a new customer base. Total gross margin in the first quarter was 87%, a decline of 100 basis points from Q1 of 2021, primarily driven by higher business platform and website infrastructure costs. Starting in the second half of 2021 and continuing into 2022, we've been investing in the business for long-term growth. These investments are primarily focused on platform, product development and sales and marketing. Under his leadership, we've moved to an org structure that operates with greater efficiency and allows us to develop and deploy product enhancements in a more streamlined fashion. With the changes we're making internally to our engineering team, we expect increased throughput on upgrades and new product releases, which will scale, providing operating leverage over time. Total operating expenses in the first quarter were $17.4 million, an increase of 83% over $9.5 million in Q1 of 2021. G&A expenses were up $4.4 million in Q1, which includes $1.9 million of stock-based compensation expenses as well as the increased cost of operating as a public company. As we laid out on our Q4 call and our Analyst Day last October, 2022 is a year of investment for Leafly. With the completion of the de-SPAC process and capital available on our balance sheet, we'll be investing in both people and product to push Leafly to the next phase of growth. For the full-year 2022, we are reiterating our guidance for revenues between $53 million and $58 million, representing 29% growth over 2021 at the midpoint. As a reminder, this guidance does not factor in any new markets that have not begun legalized sales. Q2 is off to a good start, and we expect an acceleration of top-line year-over-year growth in the second half of 2022. In closing, we've started off this year as planned and are pleased with the investments we're making in the platform, product development, and sales and marketing. These investments will help us bring a best-in-class offering to our consumers, retailers, and brands. With the first month of Q2 behind us, we see great opportunity for Leafly to accelerate growth in the second half of 2022. So on retail accounts, we had good growth in Q4, and we're confident in our ability to continue to add retailers onto our platform. And in many cases, we see the new licensees come back to the platform eventually. So with our new sales reorg in place, we're in a good position to focus on the value we're providing at the local level. And with our local market strategy, we're really focused on adding accounts and providing value within each local market that we serve. 4/21, New Jersey rec markets open. New Jersey, as you know, give priority to medical -- existing medical licensees for first recreational sales. Similar dynamic in New York, where we have over 90-plus percent penetration of existing medical dispensaries. And as you know, that market has made some announcements over the last quarter around how their retail stores will open up with initial priority given to social equity licensees. But with our local market sales teams, we are at the ready when those new licenses are issued to bring those players onto the platform. And one of the things that we're super excited about as it relates to California, not only the fact that it's the largest cannabis market in the world, but our delivery gateway that we launched this -- in quarter -- in Q1 of this year actually really is additive to our existing strong pickup offering. We see that as, notwithstanding some market structural challenges, which we think will write themselves over time, a great opportunity for us to go after. And then, Yoko, you also talked about seeing ARPA growth in nascent markets over time. So what you'll see us do and where you see -- we report ARPA at the aggregate level, is going into markets and focusing on that supplier penetration. But what we see over time is that when you can get to that sweet spot of supplier penetration, then that's a 70% and 80% roughly, and that differs from market to market. But when you can reach those kinds of levels, you match that with the consumer demand, what we do see is, as to Suresh's point, this steady growth over time. We did an integration with Jane, increased supplier penetration, have been able to drive healthy ARPA growth. And then when you can build that competitive dynamic that arises when you have sufficient suppliers on the top platform, it's introducing bidding. And as Suresh mentioned in his commentary, we've seen healthy ARPA increases through bidding that we've launched in Q1. MAU is a measure for us at top of funnel, but we're also looking at these other metrics and performance indicators. And traditionally, we've looked at the top of funnel through our News and Learn section in SEO. But what we're also focused on is, to your point, it's the efficiency of moving traffic on our platform through the funnel and to deliver the greatest value to our B2B partners. So when you're thinking about in what to look for from us, we're going to focus -- we'll continue to focus on delivering that value to our B2B partners, emphasizing growth at top of funnel. But really, it's this emphasis on differentiated content and consumer experiences to attract direct traffic. So like long-term, expect us, we'll still continue to invest in top of funnel, but we'll be purposeful and mindful on spend and how we drive that funnel. They're getting notifications when they've been outbid, and we see this flurry of activity on the platform right before the bidding period expires. So that part of it is now automated, and that's huge in terms of -- think about the human hours that are no longer on the phones taking calls as we're closing in on the last-minute bids. And we're seeing great turnover in those spots, and we're seeing actually increased -- excuse me. The last remaining piece of automation for that is to pull all of this through automation and billing, but that will be secondary because it's really focused on reducing that friction and making bidding easy for our B2B partners. As we said, this is market-by-market, looking for optimal conditions, both from supplier concentration and making sure there are sufficient retailers on platform and looking at sort of that general activity and consumer activity and interest in a particular market. But that's a continued focus throughout the year, and you'll see that built into our projections. Currently, bidding is focused on retailers. And again, that's a function of aggregating sufficient retailers in a market onto our platform to drive that competitive dynamic. It's really early stages for us with brands, but we're very pleased with the progress to-date."
}