{
    "symbol": "LU",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-13 11:14:06",
    "content": " For new business volumes, due to a challenging macroeconomic environment in 2022, we have prioritized asset quality over growth by tightening our customer selection standards and focusing new customer acquisitions in more economically resilient regions as we have seen a better credit performance from customers in these regions, and we have turned away potential customers who do not meet our credit standards. The outstanding balance of customer finance loans has grown substantially from CNY 3.6 billion as of December 31, 2020, to CNY 29.7 billion as of December 31, 2022, representing 188% compound annual growth over the 2 years. Due to a further spike in our credit impairment loss in the fourth quarter, which reflected the impact of a challenging macroeconomic environment for both our customers and operations, we made a net loss of CNY 0.8 billion in Q4, while the full year net income declined 47.5% year-over-year to CNY 8.8 billion. Our credit impairment loss increased from CNY 4 billion in Q3 to CNY 6.3 billion in Q4, reaching an aggregate of CNY 16.6 billion for the full year of 2022. As far as we can see, there are 3 stages in this U-shaped recovery process: stage 1, broader credit policy adjustment we have made during the course of 2022 featured by tightening up of credit standards and focusing on regions and industries showing more economic resilience; stage 2, business adjustment and operating efficiency improvement, which we initiated in Q4 2022 and expect to complete within the next several months, including optimization of direct sales, streamlining of management layers and optimization of the risk-bearing model; and then stage 3, back to sustaining growth and profitability as the economy is returning to normal. The increase in total expenses were primarily driven by the increase in credit impairment costs, while our operating-related expenses actually decreased by 20.8% to CNY 6.6 billion. During this quarter, while platform service fees decreased by 33.5% to CNY 5.9 billion, our net interest income grew 3.2% to CNY 4.4 billion, and our guarantee income grew by 2.2% to CNY 1.7 billion. Furthermore, as we continue to better utilize our guarantee company's abundant capital to bear more credit risk by ourselves instead of by our P&C insurance partners, we generated more guarantee income, reaching 13.6% of our total income compared with 10.3% a year ago. Our other income, which mainly includes account management fees, collections fees and other value-added service fees charged to our credit enhancement partners as part of the retail credit enablement process was CNY 131 million in the fourth quarter of 2022 compared to CNY 769 million in the same period of 2021. Our total expenses, excluding credit and asset impairment losses, finance costs and other losses, decreased by 20.8% year-over-year to CNY 6.6 billion this quarter as we further improved our operating efficiency. Our total sales and marketing expenses, which mainly includes expenses for borrowers and investor acquisition costs as well as general sales and marketing expenses, decreased by 23.4% to CNY 3.7 billion in the fourth quarter."
}