{
    "symbol": "AMSWA",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-08 22:12:08",
    "content": " So revenues for the fourth quarter came in at $34.6 million, an increase of 21% and from last year's quarter of 28.6%. That was driven a lot by subscription fees, which increased 37% year-over-year to $11.1 million, while software license revenue increased 153% to $3.1 million compared to $1.2 million same period last year. Our Cloud Services annual contract value, or ACV, increased 26% to $48.2 million, and that's compared to $38.3 million in the same period last year. So looking at our professional services and other revenue, that also increased 16% to $11.7 million from $10.1 million same period a year ago. Our maintenance revenue declined 5% year-over-year to $8.8 million, reflecting a normal falloff rate for this quarter. Total recurring revenues comprised of subscription and maintenance fees representing 57% of our total revenues in the fourth quarter compared to 60% in the same period last year, and this decline is due to unusually high level of license fees in the current quarter. Our subscription fee gross margin increased to 70% compared to 61% in the same period last year, and that's primarily due to increased subscription revenues and lower amortization of cap software expense. Excluding the noncash amortization of cap software expense of $366,000 in the fourth quarter, our subscription gross margin would have been 73%, and that's versus 70% last year, with the amortization of cap software being $686,000 in the prior-year period. On a GAAP basis, our operating income increased 186% to $5.5 million this quarter compared to $1.9 million in the same period last year. On an adjusted basis, which excludes noncash amortization of intangible expense-related acquisitions and stock-based compensation expense, adjusted operating income increased to 151% to $6.6 million compared to $2.6 million in the same period last year. Adjusted EBITDA increased to 101% to $7.5 million compared to $3.7 million same period last year, and adjusted net income increased 22% to $4.4 million or adjusted earnings per diluted share of $0.13 in the fourth quarter, and that compares to adjusted net income of $3.6 million or adjusted earnings diluted share of $0.11 in the same period last year. So looking at the full fiscal year '22, our total revenues increased 14% to $127.6 million; that's due to a 46% increase in subscription fees to $42.1 million and an 80% increase in license fees to $5.5 million, and a 10% increase in services, partially offset by an 8% decline in our maintenance revenues. Adjusted operating income for fiscal '22 was $17.3 million, representing an operating margin of 14%, and that compares to $7.7 million or 7% operating margin last year. Adjusted EBITDA increased 17% to $21.3 million, and that compares to $12.5 million a year ago, representing adjusted EBITDA margin of 17%. Adjusted net income totaled $16 million or $0.47 per diluted share, and that's up from $10.8 million or $0.33 per diluted share the same period last year. Taking -- looking at the balance sheet, our financial position remains strong with cash and investments of approximately $127.5 million at the end of the quarter, and this is an increase of $22.9 million compared to the same period last year. Included in this is recurring revenue, which is $86.5 million to an $89 million range on our recurring revenue guidance, and this implies a 10% to 13% year-over-year growth in those -- in recurring revenues."
}