{
    "symbol": "AMSWA",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-26 00:34:10",
    "content": " For the first quarter of fiscal 2022 total revenues were $29.3 million, that's a 7% increase from $27.3 million in the same period last year, primarily driven by subscription fees which increased 54% year-over-year to $9.8 million, while software license revenues were $0.5 million compared to $0.8 million last year; and that's all -- that's primarily due to the continued transition to the cloud-as-a-service. Professional services and other revenues decreased 3% to $9.5 million from $9.8 million a year ago; this year-over-year decline reflects an 11% decrease in our TPM, our IT consulting business unit, due to timing of project work and that was partially offset by a 6% increase in our supply chain unit. Our total recurring revenues comprised of subscription and maintenance fees represented 66% of our total revenues for the first quarter, and that's up from 61% in the same period last year. Our subscription fee margin increased to 67% compared to 57% in the prior year period, and that's primarily due to the increased subscription revenue and lower amortization of capitalized software expense. If you exclude the non-cash amortization of cap software expense of $819,000 for the first quarter, our subscription gross margin would have been 75% versus 72% last year since the amortization of cap software was $959,000 in the prior year period. On a GAAP basis, our operating income increased 100% to $1.8 million for the current quarter, and that compares to $0.9 million in the same period last year. As an -- on an adjusted basis, which excludes non-cash amortization of intangible expense related to acquisition and stock-based compensation expense, adjusted operating income increased 49% to $2.6 million, and that's compared to $1.7 million in the same period last year. And our adjusted net income increased 28% to $3.6 million or adjusted earnings diluted share of $0.11 for the first quarter, and that compares to adjusted net income of $2.8 million or adjusted earnings diluted share of $0.09 in the same period last year. They have good intentions, we have good intentions, everybody has worked hard to get a project kicked off on a particular time period, and then they hit a little extra due diligence process from time to time, and that just takes one more cycle and it might cost us weeks or a month or something like that, but not six months, not a year, but it's -- but a week or a month makes a difference if you're talking at the end of the quarter."
}