{
    "symbol": "AMSWA",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-18 20:54:10",
    "content": " We're also pleased to see the continued growth in our recurring revenue stream of cloud services and maintenance, which now represents approximately 63% of total revenues compared to 62% in the same period last year. For the second quarter of fiscal '22, total revenues were $31.2 million and that's an increase of 12% from $27.9 in the same period to last year. The big driver of that is subscription fees, which increased 49% year over year to $10.4 million while licensed revenue was $0.8 million compared to $0.5, the same period last year. Our cloud services annual contract value or ACV increased 44% to excuse me $42.5 million versus $29.6 million a year ago while we added $1.6 million in net new ACV during the quarter, we were short of our internal target as a couple of large deals were expected to close -- that were expected to close were delayed. Our year over year increase reflects a 4% increase in the proven method, our IT consulting business unit that was due to timing of project worked and a 6% increase in our supply chain business unit and our backlog of supply chain implementations increased significantly due to increase in ACV bookings in recent quarters. Our maintenance revenues declined 9% year over year to $9.3 million, which includes a combination of cancellations and cloud conversions, reflecting a normal fall off rate this quarter. Our total recurring revenues comprised of subscription and maintenance fees represented 63% of our total revenues in the second quarter and that's up from 62%, the same period last year. Excluding the non-cash amortization of cap software expense of $690,000 in the second quarter, our subscription gross margin would've been 74% versus 71% the same period last year. Our license fee margin was 75% compared to a negative 23% in the same period last year and that's due to lower costs, such as amortization expense of $258,000 and amortization cap software expense of $174,000 and lower  agent commissions of $61,000. G&A expenses were 18% of total revenues compared to 16% last year, primarily due to higher variable compensation expense, given our strong revenue and adjusted EBITDA performance throughout the first half of the year. So on a GAAP basis, our operating income increased 326% to $2.7 million for this quarter compared to $0.6 million in the same period a year ago. On an adjusted basis, which excludes non-cash amortization of tangible expense-related acquisitions and stock-base come optimization expense, adjusted operating income increased 137% to $3.8 million compared to $1.6 million in the same period last year. Adjusted EBITDA increased 70% to $4.8 million from $2.8 million in the same period last year and adjusted net income increased 173% to $4.2 million or adjusted earnings per diluted share of $0.12 for the second quarter and that compares to adjusted net income of $1.5 million or adjusted earnings diluted share of $0.05 in the same period last year. Taking a look at the numbers year to date, total revenues increased 10% year-over-year to $60.5 million and that's primarily due to a 51% increase in subscription fees to $20.1 million a 5% increase in license fees and a 1% increase in services partially offset by a 9% decline in maintenance revenues. Adjusted EBITDA was $8.4 million versus $5.9 million a year ago period and adjusted net income, totalled $7.8 million or $0.23 per diluted share up from $4.3 million or 13% diluted share in the same period last year."
}