{
    "symbol": "CI",
    "quarter": 1,
    "year": 2021,
    "date": "2021-05-07 15:53:08",
    "content": " The favorable first quarter earnings were primarily driven by strong Evernorth performance, favorable net investment income, and favorable prior year medical cost development, partially offset by non-recurring operating expenses. Importantly, throughout all of this, we continue to see key components of preventive care, utilize the pre pandemic levels for U.S. commercial customer's taken as a whole and excluding prior year medical cost developments, our first quarter medical care ratio was in line with our expectations. Our first quarter U.S. medical earnings were slightly ahead of our expectations, primarily driven by favorable net investment income, and prior year medical cost development, partially offset by non recurring operating expenses. In our international markets business, first quarter adjusted revenues were $1.6 billion and adjusted pretax earnings were $262 million, reflecting business growth, favorable net investment income and foreign currency movements offset by higher claims costs during the period. And with the strength of the U.S. medical first quarter results, we will further accelerate strategic investments to support future growth, thus leaving our full year earnings outlook for U.S. medical unchanged. These favorable first quarter earnings were primarily driven by strong Evernorth performance, favorable net investment income, and favorable prior year medical costs development, partially offset by non recurring operating expenses. You may ask your question. You may ask your question. You may ask your question. You may ask your question. Good morning, it's David. You may ask your question. You may ask your question. You may ask your question. You may ask your question. You may ask your question. You may ask your question. You may ask your question. Good morning, it's David. You may ask your question. Our evolution of our telemedicine and virtual care capability present opportunities to contribute to a variety of these areas to help to support individual customers or patients accessing higher cost healthcare specialists or delivery system partners, helping to drive further leverage relative to the pharmaceutical equation in terms of medication compliance, or alternative lower cost medications, and the ability to merge or coordinate services be the behavioral and pharmacy behavioral and medical are being in that quarterback position with a customer patient from that standpoint."
}