{
    "symbol": "IRTC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 23:51:06",
    "content": " On the pricing front, in November 2022, CMS published the calendar year 2023 physician fee schedule final rule containing payment rates for the 2 main CPT code sets related to long-term continuous ECG monitoring and recording that we used to seek reimbursement for the Zio XT service and the Zio Monitor service. Through our continued focus on improving market access in 2022, approximately 75% of all Medicare and commercial patients eligible for coverage now have a $50 co-pay or less and approximately 25% of all Medicare and commercial patients eligible for coverage will not pay anything at all out of pocket for the Zio XT or Zio Monitor service. Three-year follow-up findings of mSToPS published in PLOS One in 2021, further more demonstrated the active monitoring with Zio XT service led to a statistically significant reduction in the combined primary endpoint of death, stroke, systemic emboli or myocardial infarction versus standard clinical care. We continue to see a steady pace of new account openings thus far in 2023 and we are particularly pleased with the early progress in primary care volumes from recent account openings that continue to validate our belief that the primary care market will, in fact, open up and be a nice contributor to growth for years to come. As a reminder, this new patch is 72% smaller, 55% lighter and 20% thinner than our existing Zio XT form factor, all of which we believe has a positive impact on patient experience and may have an associated improvement in wear times and device return rates. Fourth quarter results demonstrated solid momentum in our core business as revenue grew to $112.6 million, representing 8% sequential and 38% year-over-year growth. There's actually going to be data at ACC that's going to be presented around Zio Monitor as well that demonstrates some of the improved patient experience and wearability factors associated with it, including the return device rate which is a bit better than what we're seeing with the XT product. Our 16% growth expectation would assume that we sort of continue at the current rate over the course of the entire year, getting to 18%, the higher end of our guidance range would assume that around the midpoint of the year, we're seeing ourselves get back into those prior growth realms. And we made some improvements in that take-home model that was putting a bit of pressure on us throughout the course of the fourth quarter once we learned about it and could sort of adjust our approach to those patients and those physicians with a product that was -- we provided better indications for use, how to apply the device, follow-up calls, those sort of things, we were able to see some improvement in that return device rate. I remain convinced that you're going to see this market expand dramatically as we continue to push into the primary care setting, just given how easy it is to use the product, how accurate it is and the downstream benefits that you get with monitoring these patients sooner. It helps address so many of the capacity issues that we're hearing by the specialists, by the EPs, even to the point where there are networks that we're now working with, where we led into those networks by convincing the cardiologist or the EP of the value of Zio and they've been using the product but they see how easy it is they used to where they're actually presenting within their networks to have the primary care physician begin to prescribe the product, have it placed on the patient and then let the cardiologist or the EP do the actual overread which they can do very easily in our Zio suite and help streamline who they're actually spending time seeing versus not. So in the prior year, in terms of the mix between the Novitas and NGS, I can't speak to that specifically off the top of my head but we started off with Novitas and certainly move towards NGS over the course of the year here in 2023, about 25% will be in San Francisco in the first part of the year and the expectation is to move north of 50% in the back part of the year as we hire out resources to do the work in San Francisco, keeping up with the overall volume growth in the business."
}