{
    "symbol": "MIND",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-09 11:43:05",
    "content": " If you would like to listen to a replay of today’s call, it will be available for 90 days via webcast by going on to the Investor Relations section of the Company’s website at mind-technology.com or via an instant replay telephonically until December 16. Information reported on this call speaks only as of today, Thursday, December 09, 2021 and therefore you are advised that time-sensitive information may no longer be accurate as of the time of any replay listening or transcript reading. Before we begin, let me remind you that certain statements made by management during this call may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on management’s current expectations and include known and unknown risks, uncertainties and other factors, many of which the company is unable to predict or control that may cause the company’s actual future results or performance to materially differ from future results or performance expressed or implied by those statements. These risks and uncertainties include the risk factors disclosed by the company from time-to-time in its filings with the SEC, including its Annual Report on Form 10-K for the year ended January 31, 2021. Furthermore, as we start this call, please also refer to the statement regarding forward-looking statements incorporated in our press release issued yesterday. Now, I’d like to turn the call over to Rob Capps. As you may gathered, based on earlier pre-release, we are seeing a noticeable improvement in market conditions, with a growing activity in the marine industries driving a corresponding uptick in our orders. Assets, the favorable trend we observed in Q2 remains intact, with increasing inquiries in order activity spending most of our markets and driving strong sequential top line gains in Q3. As you may remember, from our prior call, we entered an agreement to sell a substantial portion of these assets. We also continue to make good progress on our strategic initiatives, which target growth areas in the marine technology space, such as synthetic aperture sonar, passive sonar arrays, and sensor systems for unmanned platforms. With conditions and activity improving, we have considerable optimism for our business in the coming quarters. However, I would also note that with external factors, such as the new Omicron COVID strain, and supply chain disruptions casting a shadow over economic activity worldwide, our optimism must remain tempered. As I've mentioned in the past, our quarter-to-quarter results can swing quite a bit due to changes or delays in customer orders. That said, we believe the headline fundamentals at the rain market are improving, and we expect this to hold for the foreseeable future. Looking at our third quarter results, consolidated revenues are up strongly both year-over-year and a sequential basis. When compared to last year’s third quarter, our total revenues were up by more than 27%, and on a quarter-over-quarter basis, they were up by 23%. Due to the delivery of some of our pending orders during the quarter, our current backlog of $10 million is down from our Q2 backlog of 11.7, though still up from the 8.2 million backlog posted in Q3 of fiscal 2021. However, we fully expect additional orders in the near future, as customer interest and engagement continues to be quite robust, both in commercial and military markets. Based on engagement with specific customers, we are confident of two significant orders in the coming weeks. We're still seeing strong levels of inquiries and bid activity within our three primary markets, those being marine survey, marine exploration, and maritime security or defense. In the Marine survey space, we have noticed an increase in inquiries and bids for both our single and multi-beam sidescan sonar systems. In the Marine exploration market, our source controller and positioning products continue to lead the market. Although most of our revenue is currently derived from commercial activity, we believe that the defense or the maritime security market represents an outstanding growth opportunity for MIND. We have multiple opportunities for multi beam sonar systems for MCM, that’s Mine Counter Measure applications. As you're already aware, global supply chain disruptions continue to weigh on companies around the world. We noted these challenges even before it became more omnipresent throughout the economy, and are continuing to manage through the bottlenecks that have arisen because of COVID, rising demand and scan supply. The development of our synthetic aperture sonar system, in partnership with our European defense contractor partner continues to progress. The development of our passive solar arrays for anti-submarine warfare  -- and maritime security applications continues to advance as our prototype systems have been deployed, and we continue to add functionality. These arrays are based on our successful ceiling product line, which is widely recognized and well established in the commercial marine market. And as I mentioned earlier, we've also seen a recent increase in inquiries and bids for single and multi-beam sonar systems. We are continuing to develop solutions that address these critical market needs, either through our internal development of new technologies, the application of our existing technology into new products, strategic partnerships, or some combination thereof. As an example, we recently launched a new product in a space what we call the 4K-SVY or 4K Survey. Okay, now, let me walk you through our third quarter financials in a bit more detail before I make some summarizing comments. As I mentioned earlier, revenues from our continuing operations totaled $8.3 million in the quarter, which was up 23% sequentially, versus $6.8 million in the second quarter of fiscal 2022. When compared with our year ago revenues, this was an increase of 27%. Third quarter gross profit from continuing operations was $3.2 million, up from $2.2 million in Q2. This represents a gross margin of 38%, which is also up for the 33% we achieved in the prior quarter. Our general and administrative expenses were $3.9 million for the third quarter of fiscal 2022, which was up from $3.4 million in the second quarter, due to increases in various costs such as employment, travel and professional fees. Now in the quarter, we were able to attain three industry conferences for the first time in almost two years. All that did contribute to some higher cost, it was great to be face to face with customers and to demonstrate first-hand the new strategic direction of MIND. Our research and development expense was about $826,000, which is roughly flat with the second quarter. These costs are largely directed towards our strategic initiatives, such as synthetic aperture sonar, passive sonar arrays, and sensor systems for unmanned platforms, as well as enhancements and upgrades to our other sonar systems. Our third quarter adjusted EBITDA from continuing operations was a loss of $1.3 million, compared to a loss of $1.8 million in Q2. For our legacy land leasing business, which of course is classified as discontinued operations, we realized approximately $2.7 million in Q3 asset sales, with an additional $2 million or so expected to be realized in the fourth fiscal quarter. Beyond this, there is some miscellaneous equipment and certain accounts receivable, which will likely be monetized in the next fiscal year. In addition to the proceeds from the sale of our land leasing assets that I mentioned a moment ago, we also received approximately $9.5 million in net proceeds from an underwritten public offering of our preferred stock, which was completed last month shortly after the close for Q3. These resources combined with the discretionary actions we may take, will give the company versus sufficient liquidity to handle the challenges ahead, while also enabling us to progress in our strategic initiatives and take advantage of opportunities that may arise. So in sum, although difficulties and potential pitfalls remain in the larger macro environment, we continue to hear to the view that on the whole things are improving and the revenues from continuing operations for fiscal 2022 will be an improvement over the prior year, and this trend will continue into the coming year. It's hard to say where those orders will fall in terms of timing because of supply chain bottlenecks, perhaps some lingering customer apprehension as well. Therefore, our baseline expectation will be for Q4 to be roughly aligned with Q3 but with potential for incremental upside depending on order and production timing in the coming weeks. Guy has been instrumental in our transformation, going all the way back to our acquisition of SEMA  over 16 years ago. As we moved from the equipment leasing business into the Marine technology space, we could not have made the progress that we have without Guy. Therefore, I still plan to lean on him for advice from time to time, and I'm pretty sure he'll answer my calls. You talked about Q3 being kind of the base level, as we walk into Q4 because of some supply issues, some bottlenecks that are going on there. I mean, as you know there's always a risk if you have a one order slide a few weeks, which has an impact. But I think generally speaking, that is kind of where we're looking, and looking to grow from that. At just the point I think we wanted to make is, given the environment that we're in the supply chain issues, there is risk out there, and we wanted people to understand that risk. Okay, SG&A you've talked about that front running some of the revenue as you tried to build that up to secure been at the shows those kinds of things. You might see a bit of a swing from quarter to quarter, just as things fall in, but I think it's not going to be materially different going forward. So I think the big thing is we'll just have better leverage, as we see the top line increase. You sign highly confident on the backlog growth, these orders that are coming in. I think they probably will be annouceable, although, what specifics as far as who it is, there might be some issues there. Okay, so that is still something that is we're not…\n We're still in, in but you definitely call the development stage, but towards the latter part of the development stages, we had described that. Given the new costs and the additional preferred, we get some pushback from institutions revenue to cover, that cost now jumps up, probably closer, depending on your variable costs, they're 12 million a quarter is out about right. We're at eight, that implies a significant amount of growth there to cover that additional preferred costs. In some cases, yes. And that's one reason we wanted to do the offering was, we saw the potential need to get out ahead of some of the supply chain issues and be more aggressive in our, in our purchasing. What we didn't want to have happen is, have a big order come in, and that we just couldn't execute on because if we couldn't get to stuff. So that could mean, ordering sooner, putting money down to make sure you're first in line, things like that. In some cases, yes. So the way it sounds, we will see some growth in the military side with orders and that, that, promise of that future growth should be realized in the coming quarters or the coming weeks, really in an order. Yes, we're definitely starting to see more activity more more traction in that area."
}