{
    "symbol": "MCK",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-01 20:24:08",
    "content": " As a result of our third quarter performance and business outlook, we are raising our guidance range for fiscal 2023 adjusted earnings per diluted share from $24.45 to $24.95 to an updated range of $25.75 to $26.15. Consolidated revenues of $70.5 billion increased 3%, driven by growth in the U.S. Pharmaceutical segment resulted from increased specialty product volumes, including retail national account customers, partially offset by lower revenues in the International segment, resulting from the completed divestitures of McKesson's European businesses. Excluding the impact of our European business operations and completed divestitures, gross profit increased 7%, primarily a result of growth in the U.S. Pharmaceutical segment. Operating profit was $1.4 billion, an increase of 9%, driven by a pretax benefit of $126 million related to the early termination of a tax receivable agreement, or TRA, with Change Healthcare and due to growth across North American businesses led by the strong performance in the U.S. Pharmaceutical segment. Moving now to our third quarter segment results, which can be found on Slides 7 through 12 and starting with U.S. Pharmaceutical, where revenues were $61.9 billion, an increase of 13% year-over-year, resulting from increased volume of specialty products, including higher volumes from retail national account customers, branded pharmaceutical price increases and strength in oncology, which included increased patient visits, partially offset by branded to generic conversions. When excluding the impact of COVID-19 vaccine distribution, U.S. Pharmaceutical segment delivered operating profit growth of 7%, driven by growth in distribution of specialty products to providers and health systems, contributions from our generics programs, and improvements in pharmaceutical prescription volumes and oncology visits. In the Prescription Technology Solutions segment, revenues were $1.1 billion, an increase of 9% year-over-year, driven by increased prescription volumes, faster growth in our third-party logistics business and higher technology service revenues. Operating profit increased 7% to $155 million, driven by growth in access affordability and adherence solutions, partially offset by continued organic investments as we position our products and services for sustainable long-term growth. Excluding the impact of COVID-related items, the Medical-Surgical Solutions segment delivered operating profit growth of 25%, driven by growth in the Primary Care business and favorable sourcing activities, which partially offset lower volumes of COVID-19 tests and lower contribution from kitting storage and distribution of ancillary supplies from the U.S. government's COVID-19 vaccine program. During the first nine months of the fiscal year, we made $376 million of capital expenditures, which includes investments in distribution center capacity, automation and regulatory enhancements and investments in technology, data and analytics to support our growth priorities, including our oncology and biopharma services ecosystems. We anticipate corporate expenses in the range of $435 million to $475 million, which includes net losses associated with McKesson Ventures' equity investments, which we recorded in the first three quarters of the fiscal year, and the benefit from the early termination of the tax receivable agreement with Change Healthcare, which was recognized in the third quarter. When excluding the impacts from COVID-19-related items, net gains and losses associated with McKesson Ventures equity investments and the benefit from the early termination of the tax receivable agreement with Change Healthcare, we anticipate operating profit to increase 7% to 11%, above the previous operating profit growth target. Based on our third quarter results and our outlook for the fiscal year, we're increasing and narrowing our guidance range for adjusted earnings per share to $25.75 to $26.15 from the previous range of $24.45 to $24.95. When excluding the impacts of COVID-19-related items, net gains and losses from McKesson Ventures equity investments for both fiscal 2023 guidance and fiscal 2022 results and the fiscal 2022 benefit from the early termination of the tax receivable agreement with Change Healthcare, our adjusted earnings per diluted share guidance indicates approximately 13% to 16% growth over the prior year."
}