{
    "symbol": "MCK",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-01 20:40:26",
    "content": " As a result of our second quarter performance and business outlook, we are raising our guidance range for fiscal 2023 adjusted earnings per diluted share from $23.95 to $24.65, to an updated range of $24.45 to $24.95. As a result of our fiscal second quarter operational and financial performance, combined with our strong financial position and outlook for continued execution in the second half, we are narrowing and increasing our full year fiscal 2023 adjusted earnings per diluted share outlook to a range of $24.45 to $24.95. Consolidated revenues of $70.2 billion increased 5%, reflecting growth in the U.S. Pharmaceutical segment, partially offset by lower revenues in the International segment, which were a result of our European divestiture activities. Operating profit was $1.2 billion, a decrease of 6% due to lapping of prior year equity investment gains within McKesson Ventures portfolio and completed divestitures in the International segment, partially offset by growth in the U.S. Pharmaceutical segment. When excluding the impact related to the distribution of COVID-19-related products and net gains and losses associated with McKesson Ventures equity investments, operating profit increased 6%. Revenues were $60.1 billion, an increase of 12% year-over-year, resulting from increased volume of specialty products, including higher volumes from retail national account customers and market growth, which was partially offset by branded-to-generic conversions. Operating profit increased 3% to $756 million, led by growth in the distribution of specialty products to providers and health systems, partially offset by lower demand of COVID-19 vaccine distribution. Excluding the impact of COVID-19 vaccine distribution, the U.S. Pharmaceutical segment delivered operating profit growth of 5%. In the Prescription Technology Solutions segment, revenues were $1 billion, an increase of 9% year-over-year, driven by growth in prescription volumes in our third-party logistics business and technology service revenues. Operating profit decreased 2% to $141 million driven by higher operating expenses resulting from the timing of increased head count to support customer annual verification activities, which include hub and patient support programs. Revenues were $2.8 billion, a decrease of 9%, as growth in the primary care business was offset by lower sales for COVID-19 tests year-over-year. Operating profit decreased 4% to $307 million driven by lower sales of COVID-19 tests, partially mitigated by performance within primary care distribution. During the quarter, we had net losses of $3 million related to equity investments within the McKesson Ventures portfolio compared to net gains of approximately $97 million in the second quarter of fiscal 2022. During the first six months of the fiscal year, we made $222 million of capital expenditures, which include investment in distribution center capacity and automation and investments in technology, data and analytics to support growth priorities, including our oncology and biopharma services ecosystems. We anticipate corporate expenses in the range of $580 million to $620 million, which includes net losses associated with McKesson Ventures equity investments, which we reported in the first half of the fiscal year. When excluding the impacts related to the U.S. government's centralized COVID-19 vaccine distribution and the kitting, storage and distribution of ancillary supplies, COVID-19 tests and net gains or losses associated with McKesson Ventures equity investments, we anticipate operating profit to increase 4% to 10%. And based on our second quarter results and continued solid operating performance, including the contribution from COVID-19-related items, we are increasing and narrowing our guidance range for fiscal 2023 to a range of $24.45 to $24.95 from the previous range of $23.95 to $24.65. Excluding the impacts of COVID-19-related items and net gains and losses from McKesson Ventures equity investments from both fiscal 2023 guidance and fiscal 2022 results, our fiscal 2023 adjusted earnings guidance indicates approximately 11% to 14% growth over the prior year. When excluding the impact of COVID-19 vaccine distribution for the U.S. government, we anticipate 5% to 7% operating profit growth, which is above the long-term growth target."
}