{
    "symbol": "CRMT",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-18 14:53:27",
    "content": " Before we begin, today's call is being recorded and will be available for replay for the next 12 months. As a reminder, some of management's comments today may include forward-looking statements which inherently involve risks and uncertainties that could cause actual results to differ materially from their present view. For more information regarding forward-looking information, please see Part 1 of the company's annual report on Form 10-K for the fiscal year ended April 30, 2022 and its current and quarterly reports furnished to or filed with the Securities and Exchange Commission on Forms 8-K and 10-Q. Participating on the call this morning are Jeff Williams, the company's President and Chief Executive Officer; and Vickie Judy, Chief Financial Officer. And now, I'd like to turn the call over to the company's Chief Executive Officer, Jeff Williams. Well, hello and thank you for joining us this morning and thank you for your interest in America's Car-Mart. Given the inflationary operating environment and the lack of product at lower price points, we're convinced that we're picking up solid market share and many potential customers are staying out of the market because of affordability concerns. We will remain focused on the things we can control, the initiatives we have in place to allow us to be a much larger, more profitable company over time, so that when headwinds switch to tailwinds, we will be ready to leverage our infrastructure even more. We operate in the high touch, high friction segment of the market and consumers need a lot of support before, during and especially after the sale. Our customers are most certainly feeling the negative effects of the absence of stimulus, combined with high inflation but the job market is strong and wages are increasing and at the same time, car prices are leveling off some. Also specifically, gasoline prices are down materially in the areas we serve and food costs are expected to moderate some. As always, we will support each customer one at a time in the best way possible to ensure that we keep them on the road. A 2% sales volume increase, a 20% increase in the retail sales price and 32% increase in interest income drove a 23% revenue increase over the prior year quarter. This demonstrates the demand for our product even in a tough environment with high overall inflation, high vehicle prices and a softening demand in the overall market. The gross profit percentage was 35.7%, down from the sequential quarter at 36.5%. This decrease primarily resulted from the increase in the average selling price, coupled with the inflationary pressures and increased costs for repair parts, transportation fees, fuel costs and other cost of sale expenses and lower options on wholesale. For the current quarter, net charge-offs as a percentage of average finance receivables was 5.6% and in line with our prior 5-year average and compared to 4.3% in the prior year quarter. For a historical comparison pre-pandemic, net charge-offs were 5.4% for the quarter ended 7/31/'19 and our 10-year average for first quarter is at 6%. Our quality of customer does continue to improve and we remain confident that our customers need the dependable transportation and reliable service that we offer and that coupled with the investments we're making, we believe we'll be able to continue to perform well in a more normalized credit environment. Our accounts 30-plus past due was at 3.6% compared to 3.3% in the prior year quarter and in line with historical quarter's pre-pandemic, 3.8% at 7/31/'19. It is important to note that as our receivables balance grows, a significant portion of the provision expenses related to the allowance reserve on the larger portfolio balance. The average selling price was up $3,050 with a 3.6-month increase in the term compared to the prior year first quarter. Of the selling price increase, approximately 10% is related to the enhanced service contracts that we fully rolled out in early 2021. We continue to adjust our business to more of a sales company that can collect well, while enhancing our digital and our technology in order to serve a larger number of customers over time. At quarter end, our revolving debt was approximately $189 million. Our securitized nonrecourse notes payable was $323 million, with $37 million in restricted cash related to those notes. And as discussed, we expect to be doing another securitization in the third or fourth quarter of our fiscal year. Our total debt, net of cash to finance receivables ratio was 39.7%. As mentioned in the press release, we had some inefficiencies, primarily related to supply chain issues and reconditioning time, parts and shop delays, all while trying to keep the dealership stock with the appropriate mix and quantity of ready units. Our solid balance sheet, our strong operating history and our access to the securitization market should provide us with the appropriate access to capital moving forward. As we fund a growing receivable base with higher retail sales prices and longer terms, the business requires a higher debt level. During the quarter, we grew finance receivables by $84 million. Last year at this time, consumers had received the largest and the last of the stimulus checks. The advance child care tax credits were in the market, enhanced unemployment benefits were still out there in consumers' hands and all of that stimulus is now gone and we're looking at a 9% inflation. With all that said, we believe that we're the best at what we do and we have a long proven track record of working with our customers. We average 629 customers per dealership and we believe that should be 1,000 or more over time. We have the scale, the customer base, the industry expertise and the balance sheet to play some offense in tough markets like this. We're making significant investments doing what we think we need to do, to be a far larger player that can better serve our customers at a high level. We are currently supporting almost 97,000 customers, most living paycheck to paycheck and we will keep them on the road and work with them through life's challenges including pandemics, recession, inflationary periods and other disruptions just like we have for 41 years. So as that average selling price and the average amount financed has increased over the recent quarters, that's where the severity comes into play. Well, we feel like, again, car prices are leveling off and wages are going up. And again, we do expect wages to continue to pick up and be strong and the labor market will be strong and the leveling off of car prices, putting our customers in better cars for better prices moving forward. For the loans that youâ\u0080\u0099re originating today, I know you were talking about kind of the averages of the â\u0080\u0093 like average term and the sales price and so forth. I mean we are -- again, we're seeing some prices level off. We like to put our customers in equity positions, keep them in good positions and keep that term as short as we can and at the same time, not lose good customers and make sure that payment is affordable. And really, as we look forward, we can see some opportunities down the road for some term reductions even as prices move more in line over time. The SG&A expenses, I understand youâ\u0080\u0099re making more investments in the business and itâ\u0080\u0099s up about, I think, 11% year-over-year. So when they're going up for our customers, they're also putting some pressure on wages for our associates as well. And as you know, in this high-touch business, our associates and the service they provide to our customers are very important. So to Jeff's point, we are going to continue to leverage this as we move forward. Again, it's hard sometimes on a quarter-over-quarter basis. Well, a lot of that will depend on, of course, what the Fed does coming up over the next few quarters. I mean, I think there are still expectations that there will be perhaps even three more rate increases this year, as we look forward to the securitization market and what the benchmarks and the spreads are doing in that market. I mean I think there's expectations that, that will increase as well. So, I would expect that there will continue to be some increases in interest expense as we move forward here just based on the market. And then, as I mentioned too, in the environment weâ\u0080\u0099re in now and thatâ\u0080\u0099s growing market share, growing finance receivables, that results in higher debt balances as well. And we expect, once again, as we set our company up to handle more customers and handle more growth and be more productive and leverage SG&A, when these headwinds we're seeing now do switch, we're going to be in a great spot to take advantage of what our company does and what we do so well."
}