{
    "symbol": "IPAR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 00:17:10",
    "content": " If you recall, last year, North American sales rose 140% for the first nine months compared to one year earlier as U.S. customers schedule most of their holiday shipments in the third quarter in anticipation of supply chain problems, while this year, some of the gift set shipments originally scheduled for delivery in the current third quarter didnâ\u0080\u0099t get shipped until the fourth quarter. Pre-COVID, our travel retail business range between 10% and 15% of net sales today, I will say it is around 8%, with still room to grow in 2023 and 2024, but with a major recovery from the near cessation during the worst days of the pandemic, with pent-up demand for vacation travel as well as the resumption of business travel. Moving on to U.S.-based operations, GUESS, our largest brand within the group and our fourth largest brand overall, achieved year-to-date sales growth of 24%. On the flip side, a strong dollar boost gross margins because almost 50% of net sales of our European operations are denominated in U.S. dollars, while almost all of its costs are incurred in euro. As we reported last month, third quarter sales rose 7% to a record $280 million from $263 million in the third quarter of 2021. For our European-based operations, third quarter gross margin was 69.5% compared to 66.6% one year earlier, with a nearly 300 basis point increase attributable to the strong U.S. dollar, favorable mix and our pricing actions, offset somewhat by increased transportation and component costs. For U.S. operations, third quarter gross margin rose 70 basis points to 53.8% from 53.1%, with the improvement due to scale benefits, pricing actions as well as favorable brand and gift set mix. On a consolidated basis, A&P represented 16% and 16.1% of net sales for the 2022 three and nine-month periods compared to 15.3% and 14.2% for the respective periods last year. For European operations, SG&A expenses increased to 42.1% and 42.3% of net sales for the current three and nine-month periods, respectively, as compared to 38.8% and 39.9% for the same period one year earlier. For U.S. operations, SG&A expenses were 41.4% and 40.2% of net sales for the third and nine-month periods as compared to 35.1% and 36.8% in the prior year. Although accounts receivable is up 56% from year-end 2021, it is driven by a record sales, combined with our high level of shipments towards the end of the third quarter as well as some extended payment schedules."
}