{
    "symbol": "IPAR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 15:36:16",
    "content": " For anyone new to Inter Parfums, keep in mind that when we refer to our European-based operations, we are talking about our 73% owned French subsidiary called Interparfums SA, while our U.S.-based operations refer to our wholly owned domestic subsidiaries. Year-to-date, North America, our largest market, achieved sales growth of 8% despite the IT problems by our U.S. distribution subsidiary for European-based products and the strength of the Dollar compared to the Euro. Our fourth largest brand, GUESS experienced first half sales growth of 37%, with the Effect collection last year and Uomo this year, GUESS fragrance and grooming products have captured market share among men. However, a strong dollar increases gross margin because almost 50% of net sales of our European operations are denominated in U.S. dollars, while almost all of its costs are incurred in Euro. For European-based operations, overall gross profit margin was about the same, just under 70% in the second quarter of both 2022 and 2021. In addition, our U.S. sales of European-based products were hampered in the early part of the second quarter by shipping-related issues following a change in the distribution software by our logistics partner. For United States operations, gross profit margin was 100 basis points ahead of the second quarter of 2021 with the improvement due to the 69% increase in net sales, which enabled us to better absorb fixed costs such as depreciation and point-of-sale expenses. On a consolidated basis, SG&A expense for the second quarter rose 24% and represented 44% of net sales, while in last year second quarter, they were 42% of net sales. For European operations, SG&A expenses represented 47% and 44%, of net sales in 2022 and 2021 second quarters, respectively. For U.S. operations, SG&A expenses represented 38% and 36% of second quarter net sales in the 2022 and 2021 periods, respectively. Thus far this year, we've invested slightly more than $80 million or nearly 16% of net sales on A&P as compared to $55 million or 14% of net sales at mid-year 2021. We have in the -- for the six months, we have a 72% increase in sales for U.S. operations compared to a 9% increase for European operations."
}