{
    "symbol": "IPAR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 16:55:22",
    "content": " In 2022, our sales reached $1.087 billion to be exact, resulting in diluted EPS of $3.78 a record year marked by a 24% increase in net sales and a 38% increase in earnings per share. We booked $147 million in sales in the final quarter, resulting in a 22% increase in 2022 North American sales for the full year. Now let's discuss U.S. operations, which achieved sales growth of 58% in 2022, and we have doubled our sales versus 2019 pre-COVID. With the introduction of Alibi and continued sales of brand favorite, Oskaret brand sales rose also by 24% and Abercrombie & Fitch and largely authentic and OA pillars with new flankers, growing sales by 28% and Hollister welcomed Kenyan and Wave brand extensions to grow the brand's fragrance franchise by 16%. For the fourth quarter of 2022 and full year, net sales reflect a negative 10% and 7% foreign exchange impact versus comparable periods in 2021. As we reported in the final quarter of 2022, net sales were $311 million, a 47% increase from the $211 million in 2021, but at comparable foreign exchange rates, fourth quarter sales actually increased 57% from the same period in 2021. For the full year, 2022 net sales rose to $1.087 billion, up 24% from the $880 million in 2021, while at comparable foreign exchange rates, net sales increased 30% from 2021. I will again point out that our U.S. operations were reported sales growth was 58%, removing newly added REMS like-for-like 2022 sales rose 24% with basically new brands adding 38% for the year. For European-based operations, the 2022 gross margin was 68.2%, up from 66.6% 1 year earlier, with the increase attributable to several key factors: First, the net sales of our U.S.-based distribution subsidiary increased 16% in 2022 as compared to '21 leading to favorable mix. For European operations, 2022 SG&A expenses increased 9% from 2021 and represented 48.2% of sales down from 49.4% in 2021 as we're able to leverage our scale. For U.S. operations, SG&A expenses increased 70% from 2021 and represented 39.1% of net sales compared to 36.5% in 2021. In 2022, promotion and advertising aggregated to $212 million, which came to about 19.5% of net sales. In 2021, we spent $171 million on promotion and advertising, which likewise totaled 19.5% of net sales. With regards to accounts receivable, I think you would agree that the 24% increase from year-end 2021 is quite acceptable in light of the record fourth quarter sales levels."
}