{
    "symbol": "IPAR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 16:07:05",
    "content": "  Operator: Greetings, and welcome to the Inter Parfums First Quarter 2022 Conference Call and Webcast. I will now turn the call over to Russell Greenberg, Executive Vice President and Chief Financial Officer of Inter Parfums. Good morning, and welcome to our first quarter conference call. As always, this conference call may contain forward-looking statements, which involve known and unknown risks, uncertainties and other factors that may cause actual results to be materially different from projected calls. These factors include, but are not limited, to the risks and uncertainties discussed under the headings, Forward-looking statements and Risk Factors in our Annual Report on Form 10-K for the year ended December 31, 2021, and other reports we file from time to time with the Securities and Exchange Commission. When we refer to our European-based operations, we are primarily talking about sales of Prestige Fragrance products, managed through our 73% owned French subsidiary, Inter Parfums SA. When we discuss our U.S.-based operations, we are primarily referring to sales of Prestige Fragrance products, managed through our wholly owned domestic subsidiaries. You may recall that on our year-end conference call, Jean mentioned that sales in January and February were well ahead of budget. And as a result, 2022 first quarter net sales rose 26% over Q1 2021, which, by the way, was 37% better than Q1, 2020. For European-based operations, gross profit margin was 66.8% and 65.5% in the first quarters of 2022 and 2021, respectively. For US operations, gross profit margin was 53.9% and 53.2% in the first quarter of 2022 and 2021, respectively. With that improvement due to the significant increase in sales, which allowed us to better absorb fixed costs such as depreciation, mostly of tooling and point-of-sale expenses. And yet, it's a little hard to complain when sales and earnings are at record levels. For European operations, selling, general and administrative expenses represented 37.9% and 37.2% of net sales in the 2022 and 2021 periods. For US operations, SG&A expenses represented 41.5% and 39.9% of net sales in the 2022 and 2021 periods. In the current first quarter, we spent 13.6% of net sales on promotion and advertising versus 11% in the same period last year. But even at 13.6% of net sales, we are still below pre-pandemic levels. In the first quarters of 2019, 2018 and 2017, promotion and advertising represented 15.4%, 15.6% and 16% of net sales, respectively. As compared to last year, we are in a better position to allocate our advertising and promotion spending, such that on an annual basis, we expect to be at approximately 21% of net sales. Our consolidated effective tax rate was 24% and 27% for the first quarter of 2022 and 2021, respectively. After backing out minority interest, we earned $1.10 per diluted share, which was 26% ahead of last year's first quarter. At March 31, inventory rose to $227 million, up from $199 million at 2021 year-end. We closed the quarter with working capital of $484 million, including approximately $265 million in cash, cash equivalents and short-term investments. The $125 million of long-term debt relates primarily to the acquisition of our new Inter Parfums SA corporate headquarters, which is now fully operational. Yesterday, we affirmed our 2022 guidance, calling for net sales of $975 million, resulting in $3 per diluted share. However, we will be in a better position to revisit the subject of guidance once the lockdowns in China are lifted. Our guidance comes with the usual caveats regarding the dollar -- the euro-dollar exchange rate, the COVID-19 pandemic and, of course, the geopolitical situation in Eastern Europe. North America, our largest market, achieved sales growth of 12% despite this IT problems by our U.S. distribution subsidiary. Comparable quarter sales in both Western Europe and Asia Pacific, our second and third largest markets, increased 41%. Our sales in the Middle East increased 27% and in Central and South America, sales rose 38%. With most of our shipment made early in the first quarter, sales in Eastern Europe rose 13%. Finally, Travel retail is making a slow but steady comeback despite stops and starts stemming from regional pandemic recurrences and lockdowns. Strong performance of legacy fragrance and several product launches, notably Kate Spade, Sparkle, Montblanc Legend Red, Coach, Wild Rose and GUESS Do More contributed to the increase in sales. Of course, incremental sales of Ferragamo, Ungaro, MCM and Moncler products factored into our top line growth. First quarter sales in North America will have been considerably better had there not been a bottleneck at our US distribution subsidiary, following a change in the software by its logistics partner that resulted in shipping related issues. Once again, about 80% of our investment in promotion and advertising is devoted to digital ads, social media, like Instagram, Snapchat, Tik Tok and WeChat, influencers in the beauty, music, acting and sports field as well as TV and billboards. As I mentioned on our last call, we are doing more business on Amazon, and we have devoted advertising dollars to that effort and we are very pleased by that return on investment. Scent like fashion is an avenue for self expression, more men are buying and wearing fragrances. Sales of more expensive, higher concentration  and luxury brands are growing rapidly and of course, China, China, China. And you -- I'm sure, I will answer your questions on China. Much is being returned above the lockdowns in China and yes, these closures have been severely hampering sales and exacerbating supply chain problems. That said, the fragrance opportunity in China is immense with only 9% penetration of urban women and 3% of urban men, that is why much of our big spend in the final quarter of 2021 was focused on China. For us, that means, Ferragamo, Moncler, Jimmy Choo and Van Cleef are in great demand. Hopefully soon, lockdowns will lift, and we look for business to steadily rebuild. Moving on, while problems still persist, the actions initiated in 2021 have gotten us beyond the critical point in the supply chain saga. We have been carrying more inventory overall, sourcing similar components from multiple suppliers are doing well in advance of need, utilizing the resources of our new Italian subsidiary, producing closer to where products are sold, all of which have reduced our sourcing and production challenges. I'm very pleased to we got that to a great extent, products consumed in the US are being produced in the US and our Christmas sets, for instance, that will be sold in Europe are being made in Europe. As we relayed on our prior call, we are upgrading our inventory management systems and brought on more staff to address this crucial function. At the start of the year, we raised prices between 3% and 5%. The inflation PRL is a major concern, and I don't look forward to our next price increase in the fall. While some of our customers have tried ordering ahead of the price increase, we've done our best to limit holding. It is hard to speak about the business implications of the tragic war in Ukraine with outstanding heartless, but it's I must. Needless to say, the Russian invasion of Ukraine has negatively impacted our operations in both countries as we adhere to the regulations and sanction, which vary from country to country. Having made shipments to Russia in the early part of the first quarter, we protected most of our Russian accounts receivables with credit insurance and payments in advance is a business condition imposed on our Russian distributor. Despite all the uncertainty stemming from inflation, the war in Ukraine and the temporary China lockdowns, supply chain obstacles, 2022 is poised to be another record year. During the second quarter, a major advertising and promotion campaign is being activated to support this rollout, focusing on the US, the UK and Japan. But most of our new products are brand extensions, including Jimmy Choo Man Aqua, Lanvin Mon Éclat. If you saw Marie Claire’s April 2022 issue, Be Delicious made its list of the best fragrance of all time, while in February of this year, Women’s Wear Daily included  by Donna Karan in its list of the greatest fragrances of all time. We have two types of targets, both with established businesses and start-up enterprises with great potential. As a pure playing fragrance, we have a know-how, talent and commitment necessary to grow a licensor’s fragrance business. We've now got even greater bandwidth with our new Paris headquarters and operations in France, Italy. Please proceed with your question. Sorry, if I missed that, but did you actually say what China, how it performed in the first quarter or in March, like how much it was down in March. In March lockdown more than 60%, in April, we are down also double digit -- high double digits. We do not think that, it's going to improve before end of May. But again, I'm still optimistic because I know that when they reopen, they're going to need a lot of merchandise. Our warehouse in Shanghai, we have a distribution center in the duty free zone in Shanghai is full of products. So as soon as China reopens, I think we'll be back to a strong business. So we don't drop the ball, but it just a setback, because of this lockdown. In 2021, China represented approximately 4% of sales. I'm sure, Russ, maybe look at the question – yeah go ahead, Russ. What I was going to say is we had indicated that Ferragamo in its heyday was generating sales of somewhere close to $80 million, and that got cut in half, which is one of the reasons why we were able to take over the business itself. So that would mean that, the business overall would be somewhere around $40 million, $45 million or so. Our sales were very, very close to that $10 million will have a little over the 10 million mark. And then finally, just this updating of your inventory management system that you mentioned. The implementation is not just the inventory management system, it's our entire ERP system. We are upgrading to a cloud-based system and using third-party programs to assist in inventory management, warehouse management systems, scanning systems and things of that sort for our warehouse. If a project is, as I said, it's been going on for well over a year. It's basically revamping all of our systems, not just inventory management. Please proceed with your question. So for Q1, you remember that we launched -- we had a launch for three brands Coach, Moncler, of course, being number one, Moncler for men and for women. We'll continue with more men's rollout, basically GE shoe man, Aqua. And after that, in the -- starting July, you're going to have the takeover of Dona Karan and DKNY. So it's not a launch, but it's a new business for us, and we're going to start quite strong because we are taking over a worldwide distribution starting July 1. Please proceed with your question. So even though the dollar is much stronger, we have not changed retail price yet. There are certain brands that is more acceptable than others for Boucheron or Van Cleef or  to have a $5 retail price higher, it's not a big deal. But when it comes to more democratic brands like GUESS or Abercrombie, I think we have to be disciplined and be careful because we want to keep this customer. We had -- again, we had a big setback with China, but we know that it's temporary. We have not decreased, for instance, the launches and the rollout that we'll have in China in 2023. So, no, for us, even though we had a setback at the end of March in China, even though we cannot ship any -- I mean, cannot ship a lot of products in Russia, of course, in Ukraine now, we have maintained our sales guidance. And like Russell said in the press release and earlier today, we will, I hope, revisit the guidance for profit and sales towards June and July when we are sure that China has reopened. Just a quick reminder, I will be presenting at the Jefferies Consumer Conference, which runs from June 21st and 22nd in Nantucket."
}