{
    "symbol": "LUMN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 21:31:09",
    "content": " As was the case in the LATAM and the ILEC transactions, the EMEA announcement allows Lumen to receive attractive valuations for the assets and operations, focus our investment in our key growth markets and establish excellent partners in the areas where we've divested these businesses. With divestitures of the ILEC business in 20 states, serving mostly rural customers, the divestiture of the LatAm business, today's EMEA announcement and the divestiture of our legacy Colt business, we've been consistently optimizing our assets to focus on the opportunities in which we have the ability to invest, grow and be a market leader. As Jeff mentioned, since the Level three merger in 2017, we have reduced debt by approximately $16 billion, sold our LatAm business for about nine times EBITDA, sold our ILEC business for approximately 5.5 times EBITDA and announced today that we have entered into an exclusive arrangement for the proposed sale of our EMEA business to Colt for $1.8 billion. If you combine the divested LATAM business, the ILEC 20-state business and the CAF II benefits we received in 2022, which won't recur in 2023, the total EBITDA impact would be approximately $1.4 billion. Using that as a basis and in constant currency and adjusting for the sale of our correctional facilities business in the fourth quarter of 2021, overall business revenue declined approximately 4.3% year-over-year and 2% sequentially. I think that the Lumen team has done a great job transitioning us from a telco to a technology company, interfacing with our customers differently, building the platform that is tightly coupled to the infrastructure, to the fiber that we have and building a platform for Kate and the Lumen team going forward to sell and accelerate the growth in ancillary services and things around our edge cloud, things around security, collaboration, orchestration, all of those."
}