{
    "symbol": "LUMN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 22:12:06",
    "content": "  Operator: Greetings, and welcome to Lumen Technologies Second Quarter 2022 Earnings Conference Call. Good afternoon, everyone, and thanks for joining us to the Lumen Technologies' Second Quarter 2022 Earnings Call. Joining me on the call today are Jeff Storey, President and Chief Executive Officer; and Chris Stansbury, Executive Vice President and Chief Financial Officer. Before we begin, I need to call your attention to our safe harbor statement on Slide 2 of our second quarter 2022 presentation, which notes that this conference call may include forward-looking statements subject to certain risks and uncertainties. In addition, certain metrics discussed today exclude costs for special items as detailed in our earnings material, all of which can be found on the Investor Relations section of the Lumen website. Before turning the call over to Jeff, please be aware that we will not be able to discuss our active cash tender offers for certain of our outstanding debt securities. On today's call, I'll provide some thoughts on our second quarter results as well as our plans for the second half of the year. Chris will discuss the second quarter in more detail, and we'll reserve time after Chris' remarks for your questions. We are excited for the team at Cirion, but we'll certainly miss our LATAM friends and colleagues. Combined, these transactions streamline our focus on the most strategic opportunities for Lumen, which we believe will drive significant long-term shareholder value. Chris will provide more detail on our new business product group formation and what that will mean on a go-forward basis, but I can tell you that our teams are energized by a clear focus on managing products by life cycle. Our reinvigorated approach to product life cycle management will help customers transition to go-forward technologies and allow Lumen to maximize the contributions of more mature offerings, all helping to drive our #1 priority, profitable growth. Our Quantum Fiber build is ramping with second quarter enablements more than doubling since the fourth quarter of last year, and we expect further acceleration in the second half of 2022 and into 2023. Permitting processes for our Quantum Fiber builds haven't improved as much as we would like, and we see supply chain challenges across our business. Beyond accelerating fiber enablement, we're also excited to announce the launch of our multi-gig Quantum Fiber offering, which I'll discuss shortly. Although not yet where we want to be, we remain encouraged by our trends with our second quarter revenue performance improving both sequentially and year-over-year. We saw strength in areas where we are investing to grow such as security, cloud, IP products, wavelengths and fiber broadband, offset by anticipated declines in TDM, voice and other. As we look toward the second half of the year, we see the same macroeconomic pressures as everyone else. We are actively managing through supply chain constraints, which have caused some installation delays, but our strong relationships with our suppliers are proving invaluable in a challenging environment. We are also not immune to the inflation impacting all industries, and we did see increased pressure in the second quarter. That said, we believe the critical nature of our service offerings make them more durable as our customers grapple with what the current economic uncertainty means for their businesses. Customers are certainly being more thoughtful in buying decisions, but we are not seeing any meaningful change in customer cancellations. Those of you who have followed us know, we often see opportunities to win new business with new technologies during economic downturns. Inflation-driven cost increases, particularly labor costs, put pressure on our full year EBITDA guidance. However, we are amplifying our cost management strategies to offset this impact and are maintaining our full year EBITDA guidance based on our current expectations for performance in the second half of the year. But as we complete these transactions, we believe we have meaningful opportunities to continue driving automation, simplicity and efficiency into our delivery model. Just as Lumen is seeking to drive automation, simplicity and efficiency in our business, our customers are also pursuing their own digital transformations. As we all know, today's enterprise customers operate in a very dynamic data environment. Everything is now a connected device, and enterprises generate enormous amounts of data from a seemingly endless number of sources. To innovate and to keep pace with their own market, enterprises need next-generation data-intensive applications to quickly acquire, analyze and act on that data. Whether it's augmented reality, cloud-based gaming, artificial intelligence and machine learning, the use cases driving today's enterprises are predicated on the availability of highly secure, large-bandwidth connectivity and low latency to their data-intensive applications. The fiber-rich Lumen platform delivers on these needs by offering a massively scalable and resilient architecture that, together with the service solutions we provide, help customers as they continue to innovate and deploy the next-generation applications today's markets demand. On the key point of latency, and I've mentioned this before, the Lumen platform can serve 97% of U.S. enterprises within 5 milliseconds of latency in an increasingly all-digital way with APIs and machine-to-machine interfaces. On the enterprise side, we are helping global supermarket chains transition to store-of-the-future models across thousands of U.S. locations. We are leveraging our extensive network assets, along with our network design and consulting expertise, to deliver these complex solutions, including private cloud, MPLS, SD-WAN, LTE backup, fixed wireless and a host of security services with both on-site implementation and day 2 management. Of course, this is just an example within one of the many enterprise verticals we serve. These solutions encompass a wide range of products such as edge computing, Zero Trust networking, unified communications, hybrid VPN and SD-WAN as well as managed network services as these agencies modernize their infrastructure and their capability to deliver services to U.S. citizens while at the same time, they secure and protect critical data and infrastructure against destructive individual and state actors. Our strategic wins, together with broader market demand and the capabilities of the Lumen platform, give us confidence that we are well positioned in our enterprise segment. These larger customer wins, coupled with the improving mid-market sales, provide both near-term and long-term revenue opportunities as we drive toward growth. We are excited to update you on our progress with Quantum Fiber, which is the critical growth engine for this segment. As I mentioned earlier, in just 2 quarters, we have doubled our pace of new Quantum enablements with further acceleration coming. Our Net Promoter Score remains above 50, demonstrating the quality of our product and the easy-to-use nature of our all-digital experience. In select areas, we now operate 3 gigabit per second, $150 per month solution and an 8 gigabit per second, $300 per month solution. Beyond the superior speed, our Quantum Fiber experience provides symmetric service, which is critical for the future applications and use cases. While it's early in the adoption phase of this type of capacity, we know where bandwidth demand is going. These multi-gig offers will enable future consumer and small business use cases such as VR, AR, gaming, work and learn from home, ultra-high-definition video streaming and other high-bandwidth services. The investments we are making in Quantum Fiber are building long-life assets with the capacity to meet current demand and the ability to meet future demand for fast, symmetrical capacity. Coupled with the all-digital experience and excellent customer experience we provide, we expect Quantum Fiber to deliver significant returns for our shareholders well into the future. And with very low market share currently in our copper footprint, we have the ability to grow our embedded base of broadband customers by taking market share. We expect to accelerate taking share as we ramp our enablement and deploy best-in-class add-on capabilities such as network security, WiFi and the multi-gig offerings we announced today. We believe profitable revenue growth is a principal long-term driver of shareholder returns, and we continue putting the right assets to work to drive toward that goal. Our new business reporting categories provide clear line of sight into our efforts to drive revenue growth, enhance profitability and generate sustainable free cash flow. As we invest the capital required to execute on our growth plans, we are also returning cash to shareholders through our dividend while remaining committed to a healthy balance sheet. With that, I'll turn the call over to Chris to discuss our second quarter results in more detail. After closing the ILEC transaction, which is expected early in the fourth quarter, we will provide a pro forma historical revenue view of these product groups. As Jeff discussed, we face some macro headwinds, and we are actively working to address these challenges through cost reduction and other initiatives. With that, I will begin with a financial summary of our second quarter. We are very pleased to have closed the LATAM divestiture to Stonepeak on August 1 for approximately $2.7 billion, and we are on track for an early fourth quarter close of the ILEC divestiture. We continue to see fiber broadband revenue growth, which is helping to improve our Mass Markets revenue trajectory and supporting our expectation for Mass Markets broadband revenue and subscriber growth in the second half of next year. With respect to the RDOF program, we recognized approximately $6 million in the second quarter of 2022. On an adjusted basis, revenue declined 3.4% in the second quarter, an improvement from the 5.5% adjusted year-over-year decline in the first quarter of this year. Additionally, we reduced net debt by nearly $900 million year-to-date and exited the quarter with leverage at 3.7x. In the second quarter, total reported revenue declined 6.3% on a year-over-year basis to $4.612 billion. When adjusted for CAF II, foreign currency and the sale of our correctional facilities business, the year-over-year rate of decline was 3.4% versus a decline of 5.5% last quarter. Within our 2 key segments, Business revenue declined 3% year-over-year to $3.416 billion. When excluding foreign currency headwinds and the sale of our correctional facilities business, revenue declined 2.3% year-over-year and was up 0.6% versus the first quarter of 2022. Adjusting for the CAF II impact mentioned earlier, Mass Markets revenue was down 6.6% year-over-year. Within our enterprise channels, which is our Business segment, excluding wholesale, reported revenue declined 4.2% year-over-year. When adjusting for the impacts of foreign currency and the sale of the correctional facilities business, revenue was down 3.3% year-over-year, an improvement from the 5.1% decline in the first quarter on the same basis. Our exposure to legacy voice and other revenue continues to improve, and we expect the closing of the 20-state ILEC divestiture to provide further benefits for our enterprise revenue mix. On a constant currency basis, IGAM revenue was flat year-over-year. We had strength in our managed security, cloud services, IP and dark fiber services. We've discussed large, complex transactions taking longer to turn up, and I'm happy to report that IGAM benefited this quarter from additional revenue related to a large contract we signed last summer. Normalizing for this sale, large enterprise declined 5.4%, an improvement from the 6.9% decline in the first quarter. Overall, large enterprise growth was negatively impacted by our IT solutions business, which tends to experience quarterly fluctuations. We had growth in cloud, IT solutions and IP services, offset by lower voice and equipment revenue. We are providing a view of our new revenue reporting structure today and will formalize our new reporting starting in 2023, which will provide a pro forma posttransaction view. We are grouping our business revenue reporting into 4 distinct product categories: grow, nurture, harvest and other. Our grow category features products such as IP, wavelengths, security, cloud, SD-WAN, SASE, unified communications and voice over IP. Our harvest products include legacy services such as voice, Private Line and UNEs. The other products are equipment and IT solutions, which tend to fluctuate quarter-to-quarter and are low-margin contributors. As you can see, our grow group is the largest group, followed by nurture, with harvest being the smallest group. COVID had a significant impact on our growth over the last couple of years, but we see that as largely behind us now. Within the nurture group, we see meaningful opportunities to migrate customers to new product sets residing in the grow group, which will continue to dampen the nurture growth rate. Within our harvest group, we will continue to manage the declines as well as take price to retain profitability. This could provide a buffer for some of the decline, but many of the products in this group did not have a migration path back up the group stack. While we have provided 5 quarters of historic revenue for these product sets, you should consider this day 1 of how we are managing our new product groupings. Increasing efficiency to drive revenue growth is our primary goal, and we look forward to providing you with our progression as we continue our transformation journey. As I mentioned earlier, on an adjusted basis, Mass Markets revenue declined 6.6% year-over-year and 1.6% sequentially. In the second quarter of 2021, we recognized $122 million of CAF II revenue. Our Mass Markets fiber broadband revenue within our RemainCo footprint grew by 16% year-over-year, and the second quarter represented more than 16% of our total Mass Market revenue. With the anticipated close of our ILEC sale, our exposure to legacy voice and other services will improve and reduce our annualized voice and other revenue by over $600 million based on our second quarter 2022 results. During the quarter, we added 28,000 Quantum Fiber customers, roughly in line with last quarter as we continue our pivot to a market-based approach and adjust our go-to-market strategy. This brings our total Quantum Fiber subscribers to 858,000 with 788,000 of the subscribers within the 16 retained states. During the quarter, total enablements were approximately 205,000 with approximately 185,000 of those enabled locations in our 16 retained states, bringing the total enabled locations in the retained states to 2.9 million as of June 30 with approximately 270,000 additional locations enabled in the SellCo footprint. ARPU in the retained states was approximately $59, and we see ARPU expansion opportunities with the adoption of in-home WiFi solutions, up-speeding and with today's announcement of the multi-gig speed offerings that Jeff shared. As of June 30, our penetration of legacy copper broadband subscribers in our retained 16 states was less than 13%, highlighting the significant share-taking opportunity as we accelerate the Quantum Fiber build. Within the same footprint, our Quantum Fiber penetration stood at approximately 28%, but we expect that to fall in the near term as we ramp enablements. Our 2022 Quantum Fiber vintage penetration increased 500 basis points to approximately 27% at the 18-month mark, a solid improvement from the 12-month mark and continuing to ramp, supporting our expectations for the longer-term penetration opportunity. Our Quantum Fiber NPS score within RemainCo is greater than positive 50, an indication of the quality, value and superior service that Quantum Fiber delivers. Quantum Fiber is an all-digital prepaid product that features simple pricing with no contracts, helping reduce call center volumes and bolstering our NPS scores. In Mass Markets and across the overall business, we are continuing to see trends towards pre-pandemic levels in our allowance for credit losses, which is reassuring and not having any notable impact to our business. For the second quarter of 2022, adjusted EBITDA was $1.811 billion compared to $2.109 billion in the year ago quarter. When comparing margins to the year ago period, you should consider the $122 million benefit of CAF II support in the prior year period. When adjusting for this impact, our second quarter 2022 margin of 39.3% would compare to 41.4% in the year ago period. In addition, our wholesale-related network expense has increased more than our additional revenue associated with carrier rerates. In the second quarter of 2022, the company generated free cash flow of $668 million. Recall that in terms of special items for 2022, we expect a ramp-up in costs compared to prior years, primarily driven by dedicated third-party costs to support transition services for the divestitures. In closing, we are pleased with our improved revenue results as well as our progress on the Quantum Fiber acceleration. As a reminder, in addition to free cash flow generated from the business, we expect a total of about $7 billion in discretionary cash proceeds, including the recent LATAM divestiture as well as the pending closure of the 20-state ILEC divestiture. In terms of the product categories, we'll continue to look at how much we disclose around that. Obviously, we don't want to disclose competitive information. I can tell you that broadly speaking, if you look at the margin profile of the different buckets, while they differ, it's not drastic. Obviously, on the OpEx side, we'll invest more in grow because we're really trying to get those products moving along. I think for now, this is a good start, but we'll see what we can do around more color going forward. As it relates to capital allocation, I'd just say, look, the discussion on the buckets and obviously getting more aggressive on things like harvest and managing for cash, those are all inputs. I would say, at this point, no change, and we'll continue to monitor that as we go forward. We feel good about the work that we're doing to finalize the divestitures and focus on growth, and we'll keep you updated as we go forward. So I'll try and answer the question, Simon, but it's early to say. We don't see necessarily a slower decision-making to the technology choice, to picking us. But we don't -- we aren't seeing necessarily yet a slower decision-making on picking the technology, picking the winning thing. I mean, it would be very easy to say that they're just going to put things on the back burner. And so if you can give us some sense as to what those big projects are and why you remain confident that they're going to move ahead with it, that would be helpful. You made the point earlier in the call that while you're seeing some inflationary cost pressures, you are identifying ways to cut other expenses and you're keeping your outlook for the year. So back to what are we seeing from customers, I'll take that one first. The -- we see customers -- unlike COVID, when COVID hit, people just said, \"We don't know what's going on. Unlike that, what we see today is people are looking -- customers are looking at their networks and recognizing that they have to continue to transform. So fiber-based services through APIs where they can use edge computing to augment their cloud computing, use edge storage to augment their on-premises storage. They are moving toward those solutions, embedding security into them where they can, as you've heard me say before, be very nimble and adaptive and innovative in the way that they acquire, analyze and act on their data. And in fact, in some -- historically, we've seen that during economic downturns, customers will accelerate some of that so that they can gain efficiencies within their own business. With respect to expense reductions, and Brett, I'm interpreting the question as, did we give up anything as a result of the acquisition -- or the sale, the divestitures that we have, we did delay some of our ongoing transformation because the same people that were preparing for those divestitures were the people that drove our ongoing transformation. We continue to look at everything, and we make sure that we figure out how best to deal with the environment that we've got. And our contract with them expires -- I believe it's April of next year, right around that time. We started months ago working with them and trying to give predictability into our costs, trying to give predictability into our workforce and how we can align jobs and that sort of thing. And so those are the types of things we do on a very regular basis to make sure that we're looking at our cost structure, that we're looking at how do we invest in growth but, at the same time, fund that growth. I wonder if you can talk about any sort of onetimers we should be considering, either in the SG&A or the cost of service side. And then it looks like from this quarter's EBITDA, you're trending at the low end of guidance. The -- if you look at the quarter and just some of the cost pressures that we faced, I'd say that the bulk of it really relates to what other companies are seeing in terms of inflationary pressures on things like energy and labor. So I think near term, those pressures obviously continue. We did have some onetime activity that hurt us a bit as it relates to a little bit on rerates, and then we do have some of our transition costs. So we've gone in, and I wouldn't say that there's any kind of major shift in how we're managing the business. This is, I would say, business as usual in terms of how we respond to macro events like this. So we are working as a team to take cost out, look for things that aren't going to have near-term impacts on our ability to grow, and those are the things we're going after. In terms of being able to do better than that, I think that's really where, again, the new product portfolio focus can help us. I think the harvest teams are looking at a lot of different things that probably don't have an immediate benefit but in the relatively near future could have a benefit, but they're just getting started. So right now, we feel good with the guidance because of our ability to respond to the external environment with the cost cuts. Maybe you could provide some more color, whether that's related to equipment or materials or labor availability. And then secondly, I just wanted to touch on the -- some of the inflation pressures again. Just wondering, in the enterprise outlook, how the pricing equation looks versus the volume equation on growth. But the inflationary pressures that you see, that the rest of the market sees are the same ones that we see, and they come in those 3 main areas. We've got great -- not the inflation -- I'm sorry, the supply chain pressures. So whether that's material vendors or equipment vendors, we've got great relationships with them. We're working through their challenges with them, and we feel pretty good about that. And we'll continue to stay very focused on that, working closely with our large suppliers and our large vendors. So for example, I mentioned CWA, but one of the things that we've also done with our employees is we brought -- we plan to bring all of the Quantum Fiber splicing in-house. And Eric, to the second question on the pricing environment, look, I think the pricing environment is favorable right now. First, I guess, Chris, I think last quarter, in preparation for retooling how the reporting for the business segment happened, there was a conversation about KPIs and the idea that one of the missing links between the market and your guys' internal view of the business is that we don't have a buildup to get to these revenue categories. I guess the second question would just be on broadband, kind of 2 subfactors in there. One, the transition from the EBB program to the ACP program, a little less money out there, a little less government stimulus helping the broadband segment; and then fixed wireless access looking like they're going to come in with 100% market share in broadband this quarter. So David, I'll certainly spend more time looking at this. So I think this was a first big step, and we'll certainly continue with that as we go forward. I do -- and I base this off of my previous experience, I do want to be careful about telling too much to our competition about where and how we make money. I think that's -- in a lot of ways, that can provide more harm to Lumen's shareholders than benefit. We'll certainly try to give more color, but I do -- I don't want to overpromise on that at this early date. With respect to stimulus and what is that effect on the broadband -- the transitioning from one stimulus program to another one investment program, subsidy program, we -- it's too early to say. We do think there are opportunities for Lumen and Quantum Fiber to engage with those government programs, to make sure that we're bringing our capabilities to the largest footprint that we can. If you look at our Quantum Fiber build, we're focusing in on areas where we have network advantage, where we have scale advantage and where we can invest in dense ways to make sure that we have the low-cost advantage on building out networks. With respect to fixed wireless access, I don't know if you're meaning in Enterprise or if you're meaning in Mass Markets. In Mass Markets, I'd love to compete with fixed wireless access. The fiber wins, we announced this morning that we're going to build -- that we have the capability. On the platform that we're putting in the ground today, the platform delivers 8-gigabit solutions, 3-gigabit solutions. We can go to where our customers need us to go, and I think fixed wireless access runs out of scale much quicker than that. If you look at the Enterprise side, I have some of the same comments, but I see it more as an opportunity for us as we do campus area networking for our customers. I can only really speak for Lumen, but I'll try and be as complete in my answer as possible. If you look at Lumen, we have -- our vendors, our off-net providers have been raising our rates to market rates as they can contractually. And we've been dealing with it, shielding it from our business by being very aggressive in our off-net to on-net transitions. And so since -- certainly, since the Level 3 transaction but really long before, we have been very focused on making sure that we move off-net to on-net and manage our costs that way. And so we'll continue to do that, and we've seen that. We do the same thing in our business, and we'll continue to do that. I would just add really quick, just a nuance here that wholesale as well as other in our new classifications were impacted by an IT solutions contract. First, Chris, just on that last $25 million you mentioned. And that's why we -- as we mentioned in the prepared remarks that IT solutions and equipment, we're pooling into that other bucket because they are spiky. And then earlier in the call, you also talked about how there are certain costs that you're incurring for the transition that you then bill to customers. I see that there's, I guess, a $30 million net income reconciliation that you have in your supplement. And what it is, is that where we have non-100% dedicated resources, they're doing their day jobs for Lumen, but they're also, if you will, part-time or part of their time on supporting transaction service agreements. We'll adjust that out in adjusted EBITDA, but then we recover it in other income. And finally, in the past, you've given some rough numbers for the contribution from the LATAM assets and the Apollo assets. You've signed a lot of deals within the public sector lately, and some of your peers are talking about pressure in that segment. And maybe a rough estimate of what percent of your enterprise -- large enterprise comes from the public sector, that will be helpful. With respect to government, look, we don't give out the percentage of any of those types of things for the reason Chris mentioned a minute ago, because we don't want to educate competitors in that sort of thing. And if you look at the deals that I mentioned, USDA, the Border and Protection agency, USPS, just looking at those deals, those are all new to us that we took share from somebody because those are not new deals themselves. So if you look at our business, we are a share taker in the government. And it's because of the quality of the products, the Lumen platform and the excellent team that we have supporting the government and the track record that we have supporting them. I think it's represented in our large enterprise customers, too, that I feel the same way for them that, yes, sometimes others look to large enterprises declining, and we certainly have challenges with it as well. With respect to cable, they'll always do something to kind of lead and preempt some overbuild and overcapability. Once we get our Quantum Fiber product in front of them, I think that we'll more than hold our own. When you have multi-gigabit symmetrical capacity with layered-on capabilities, I think we'll -- anything they do in the meantime won't really matter. I mean, your -- some of the declining areas are pretty high margin revenue, but you're also sort of presumably the -- on the wholesale side, you're ongoing saving money there as you continue to build out the fiber network. Right now, you're running margins sort of, for example, above AT&T's business or consumer broadband segments. I think we will give you, as I just mentioned a few minutes ago, a good RemainCo footprint P&L and how those financials play out once we're closed with the divestitures. What I would say is that as we go forward, though, with our growth opportunities in both segments, we feel good about where our margin profile is and our abilities to grow top line as well as EBITDA. James, the other thing is we believe that we're transforming our business, and a big part of that are reductions in our cost structure and improvement in our customer experience. Our business is evolving, and we are very good at evolving with it and modifying the way that we deliver our services. Operator, we've got time for just one more. But we're a fiber-based company, and that is the core of who we are and what we do. Those -- a lot of our business is lumpy, but fiber infrastructure tends to be lumpier than most. But it's who we are, and we're really, really good at it. And on the second question, look, I mean, broadly speaking, this is not true for every product, but broadly speaking, if you look at the harvest category, those are products that really aren't being sold anymore, certainly not in any major quantity. So that really becomes a focus on how do we maximize the long-term value of existing customers, and that can be through cost management as well as pricing. So it's a complex thing to go after, but we've got the right people to tackle that. As it relates to incentives, I mean, again, I'd say that the whole organization is focused on growth. We'll constantly look at how we incent ourselves and our teams to make sure we maximize that, and that's certainly something that we do every year as we plan for the next year. But I think the real benefit of the buckets is a sharper focus on, for lack of a better term, who gets what. And I think that clarity and focus is a benefit to the organization, and I think we'll see that in future results as we go forward. Look, in closing, this has been a very active year for us. In addition to seeing the growth across multiple strategic enterprise product offerings, we closed the LATAM divestiture."
}