{
    "symbol": "LUMN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 21:12:02",
    "content": " I would now like to turn the conference over to Mike McCormack, Senior Vice President, Investor Relations. Thank you and good afternoon, everyone and thank you for joining us for the Lumen Technologies fourth quarter 2022 earnings call. Joining me on the call today are Kate Johnson, President and Chief Executive Officer; and Chris Stansbury, Executive Vice President and Chief Financial Officer. Before we begin, I need to call your attention to our Safe Harbor statement on Slide 2 of our fourth quarter 2022 presentation, which notes that this conference call may include forward-looking statements subject to certain risks and uncertainties. In addition, certain metrics discussed today exclude costs for special items as detailed in our earnings materials, all of which can be found on the Investor Relations section of the Lumen website. Good afternoon, everyone and thanks for joining us today. In a few minutes, Chris will cover our fourth quarter results and discuss 2023 outlook measures. And while itâ\u0080\u0099s only been 3 months since I joined Lumen, I already feel at home. I have had the opportunity to get to know many of our employees, customers and partners. And I have spent time understanding our business processes, our proprietary gifts and our go-to-market capabilities. That said, there is hard work ahead for our team as we make significant changes to how we serve our customers and how we execute for better financial results. As with any successful transformation, itâ\u0080\u0099s essential to get the right talent and I am delighted to report the addition of three seasoned technology executives to the Lumen team. Sham Chotai has been appointed Executive Vice President of Product and Technology, running our newly integrated product development and IT organizations. Ashley Haynes Gaspar has been appointed Lumenâ\u0080\u0099s Executive Vice President and Customer Experience Officer, running our marketing functions as well as customer success. With the addition of these three executives to the team, we infuse deep digital transformation leadership, product development and innovation muscle, marketing and customer lifecycle thought leadership and enterprise selling expertise, all essential components of our transformation. As such, over the past 3 months, we have spent considerable time with employees, customers and partners, drafting and rolling out a crystal clear strategic plan, what we are calling inside the company, the Lumen North Star. In short, our North Star to find who we are, who we serve, our proprietary gifts that yield a competitive advantage, our targeted success metrics, and of course, our aspirational culture. It starts with our mission to digitally connect people, data and applications quickly, securely and effortlessly. The first part, connecting people, data and apps, thatâ\u0080\u0099s our core DNA and positions our world class network as the crown jewel of our portfolio. The three words at the end of that mission statement, quickly, securely and effortlessly, thatâ\u0080\u0099s really what our customers are demanding as we solve their core problems such as delivering cost effective operations, securing their data and apps, innovating for their customers and helping their employees thrive. A big part of our North Star plan is a detailed economic model that provides some sensitivity analysis around our Grow, Nurture and Harvest revenue categories. As a result of this work, we have established five core priorities for Lumen. And as such, we have been forced to drive operational efficiency to ensure we achieve the synergies and the value intended from combining these entities. Reorienting our people to focus on understanding customer problems and shaping our core intellectual property in connectivity, security and edge cloud to solve those problems will be a material mindset shift. It will require deep skills building, a significant part of our culture development priority, which I will talk about shortly. But more than just a mindset shift, delivering on our desire to become a customer-obsessed company requires innovating and investing for growth, our second core priority. As such, we are reshaping our organizational structure by combining our product development teams with our IT teams for greater speed and agility. Now, I think itâ\u0080\u0099s worth spending a minute on this concept of growth operating system. Lumen has been focused on driving operational efficiency, as I said, in our scaled businesses. But to grow, we need to become great at innovating and establishing new to big businesses. We want our teams to act like entrepreneurs, collaborating with our customers and the Lumen teams to solve problems that our customers experience. And at the same time, much like in the VC world, we will foster this innovation in an environment with important guardrails, including a growth board, executive sponsorship and co-founder teams to ensure we are pursuing and maximizing the value of high potential projects. This means performing extensive testing with our customer base, bailing fast on many concepts, but recognizing the high potential of others and quickly allocating capital accordingly to maximize growth. And while I just shared our intention to develop net new capabilities that enhance the value of our network, I also want to emphasize that we will continue to invest in our world class network. And we will continue to invest in our fiber infrastructure to meet the demands of our sophisticated customer base who are dealing with complex business problems, coupled with a workforce that now demands remote work flexibility in the post-pandemic world. As we execute and pivot towards growth, our third core priority will be to ensure we have the complete go-to-market capability in place to enable us to compete in todayâ\u0080\u0099s technology market. The first group includes large customers in the public sector, large enterprise, and upper mid-market channels. And to serve this group, we aim to offer scalable solutions with a higher level of personal engagement in a robust set of managed service offerings. To serve this group, we will offer a simplified product selection with a user-friendly digital platform for easy ordering and seamless interactions. To support our first three priorities of developing customer obsession, innovating and investing for growth and building a reliable execution engine, we are going to lean heavily into the fourth to radically simplify our company. First, we will focus on doing fewer things better. That means shutting down subscale or non-accretive businesses, which includes no longer selling products or services that donâ\u0080\u0099t directly enhance our value to customers or benefit Lumen and its shareholders. We will ensure all resources are aligned to promote the programs and projects that support our mission to digitally connect people, data and apps quickly, securely and effortlessly. The second form of simplification will come as we build the digital enterprise, consolidating systems and modernizing our IT infrastructure to support effortless employee and customer digital experiences. We know that the cultural common denominators of companies that successfully transform in the digital era include clarity, customer obsession, courage and a growth mindset. At Lumenâ\u0080\u0099s straight from the tap, we are committing to clarity in everything we do. We need to do a lot of things, some basic and some quite complex, to position ourselves to take advantage of the opportunity that lies before us. We will continue to move with great speed, but also very thoughtfully and collaboratively, leveraging our customer and partner relationships to guide us. Before we move on to our discussion of results and the 2023 outlook, itâ\u0080\u0099s important that I talk about a couple of items as we enter 2023. First, on EBITDA and CapEx, we are leaning into our growth and optimization priorities and Chris will provide financial details of these initiatives shortly. As we have said previously, we hit the pause button during the fourth quarter. Now to be frank, it was more of a stop button than a pause button, which impacted our Quantum metrics for the quarter. By focusing on all metrics and not just the location enablement goal, we have established a higher IRR, more predictable long-term outcome for this exciting project. And to that end, we made an important change during the fourth quarter to separate our operational activities like planning, engineering and all field operations between mass markets and business. Maxine Moreau, our President of Mass Markets, now has top to bottom operational and P&L responsibilities. This is a significant change internally that I expect will improve our Quantum deployment pacing, but it will take time to reach scale. My expectation is that later this year, you will see significant improvement in our execution on enablement. And with that, I will turn the call over to Chris to discuss our fourth quarter results. Thank you, Kate and good afternoon everyone. To start, I hope you had a chance to review the 8-K we filed on January 27, which provides modified financial information back to first quarter of â\u0080\u009821, removing the impact of the ILEC and LATAM businesses as well as the impact of the CAF II program. The 8-K also outlined the new business sales channel reporting structure for 2023 reporting, which collapsed IGAM into large enterprise and pulled public sector out of large enterprise. Later in my remarks, I will address our outlook for full year 2023, but near-term, we continue to face macro headwinds. In addition, we are actively working to offset dissynergies, resulting from the divestiture of our 20-state ILEC business as well as our LATAM business, but those headwinds are likely to persist through this year. Despite these near-term pressures, this is an exciting time for Lumen and our team. This will require internal systems and process investments to solidify our platform, pivot to a position of playing offense and enable us to grow. With that, I will move to the financial summary of our fourth quarter results. I will be referencing results on a modified basis, which aligns with the 8-K disclosures mentioned earlier and removes the impact of the divested businesses that closed during 2022 as well as the impact of the CAF II program. Overall, business revenue declined approximately 4.2% year-over-year and 0.3% sequentially on a constant currency basis and after adjusting for the sale of our correctional facilities business in the prior year period. After paying all taxes owed on the 2022 business divestitures, we reduced estimated net debt by approximately $10 billion during 2022. And during the quarter, we repurchased 33 million shares of common stock for $200 million. Moving to a more detailed look at revenue, I will be referencing all revenue growth metrics on a modified adjusted basis, where applicable, to remove the impacts of foreign exchange and the correctional facilities business sale in the fourth quarter of 2021. On that basis, our fourth quarter total revenue declined 5% year-over-year to $3.8 billion. The benefit related to the correctional facilities business was about $3 million in the fourth quarter of â\u0080\u009821, while the impact of FX year-over-year was a headwind of approximately $20 million. Within our two key segments, business revenue declined 4.2% year-over-year to $3.005 billion and Mass Markets revenue declined 7.6% year-over-year to $795 million. Within our Enterprise Channels, which is our business segment, excluding wholesale, revenue declined 5.9% year-over-year. As I previously noted, in the new reporting, we will be providing, starting this quarter, we have collapsed IGAM and large enterprise into the large enterprise channel and have moved public sector to its own channel. Now representing our largest enterprise channel, large enterprise had improved revenue trends both year-over-year and sequentially and was our strongest performing enterprise channel. On a sequential basis, public sector revenue declined 0.9%. Mid-market revenue declined 6.6% year-over-year, with VPN and voice, the most significant headwinds. As I move to our business product lifecycle reporting, I will be referencing percentage changes on the same modified adjusted basis I referenced earlier. As Kate mentioned, our North Star plan incorporates a detailed economic model with plans to disrupt legacy declines and help us innovate for growth. Grow now represents over 36% of our business segment, up from 34% in the prior year period and carried an approximate 84% direct margin this quarter. For added color, Grow products represented the majority of our enterprise sales in the fourth quarter, which will continue to improve our mix of revenue going forward. This will take some time, but we believe we have real opportunity here with our outside-in focus that Kate mentioned earlier. The decline was driven by VPN and Ethernet, and Nurture now represents about 31% of our business segment and carried an approximate 68% direct margin this quarter. Our Harvest team continues to work hard to manage to a lower rate of decline within this product set, which is helping to extend the life of these products. In addition, as with our Nurture products, we are managing customers back to Grow and Nurture products. Harvest now represents approximately 26% of our business segment, and carried an approximate 76% direct margin this quarter. As I mentioned earlier, total Mass Markets revenue declined 7.6% year-over-year and 2.8% sequentially. Our Mass Markets fiber broadband revenue grew by over 18% year-over-year, and in the fourth quarter, represented approximately 19% of Mass Markets revenue. As Kate discussed, we have made significant changes in how we are approaching the Quantum Fiber opportunity. That said, our location and subscriber results were impacted by the pause we had in place through our evaluation. This change in strategy will continue to impact Quantum metrics until we get to scale with our new plan, which we expect to occur late this year. During the quarter, total enablements were approximately 97,000, bringing the total enabled locations to over 3.1 million as of December 31. During the quarter, we added 19,000 Quantum Fiber customers, and this brings our Quantum Fiber subscribers to 832,000. Fiber ARPU was stable sequentially at approximately $60, but weâ\u0080\u0099ve seen accelerating year-over-year growth each quarter during 2022. As of December 31, our penetration of legacy copper broadband footprint was less than 12%. Our Quantum Fiber NPS score was greater than positive 50 again this quarter, an indication of the quality, value and superior service that Quantum Fiber delivers. As Kate mentioned, we have recalibrated our addressable footprint to ensure we are generating healthy returns for our shareholders. Based on that recalibration, we are targeting 8 million to 10 million locations for the overall build or roughly 5 million to 7 million incremental locations over the next few years. We continue to monitor how the economic environment is impacting our customers, and we have not observed any discernible changes in customer payment patterns. For the fourth quarter of 2022, adjusted EBITDA was $1.393 billion compared to $1.496 billion in the year ago quarter. As I mentioned earlier, we are seeing cost pressures from inflation in addition to our OpEx investments to drive growth. Special items this quarter totaled $583 million related primarily to a non-cash loss reported upon the designation of our EMEA business as held-for-sale and transaction and separation costs, partially offset by a gain on the sale of our ILEC 20-state business. Our fourth quarter 2022 EBITDA margin was 36.7%, down slightly from 37.2% in the year-ago period. Additionally, in the fourth quarter of 2022, the company generated free cash flow of $126 million. Our reported net debt was $19.5 billion as of December 31, 2022, and our expected estimated net debt stands at $20.4 billion. Our expected estimated net debt reflects our utilizing cash on hand to settle the tax obligations related to the divestitures we closed in 2022, which totals $900 million to $1 billion. Given the investments that Kate identified, we anticipate leverage to rise to between 4 to 4.3x in the near-term. For the full year 2023, we expect adjusted EBITDA to be in the range of $4.6 billion to $4.8 billion. When bridging to our full year adjusted EBITDA guidance, in addition to the CAF II completion and divested business EBITDA, there are a few other drivers to keep in mind. Combined with dissynergies, we expect a headwind of between $200 million to $250 million this year. As Kate discussed, over the next couple of years, we will be aggressively investing both OpEx and CapEx to position ourselves for long-term sustained success. The focus of these investments will be to enable growth, improve customer experience and simplify how we operate. These investments will include a number of items such as digitization, ERP, Network as a Service and IT simplification. Importantly, we expect our revenue and EBITDA to stabilize as we exit 2024 with growth thereafter. For the full year 2023, we expect total capital expenditures in the range of $2.9 billion to $3.1 billion. Additionally, we expect to enable an incremental 500,000 Quantum locations in 2023 as we emerge from our project reevaluation. We anticipate a cost per enablement of $1,200 in 2023. Lastly, our capital expenditure guidance includes $35 million to $65 million related to rebuilding efforts in the wake of Hurricane Ian last fall. In total, our 2023 free cash flow will be impacted by $435 million to $615 million related to our growth and optimization investments as well as the impact of Hurricane Ian recovery efforts. Additionally, the cash tax is due on the 2022 sale of the ILEC and LATAM businesses, are being paid out of the cash proceeds from those deals and are excluded from our free cash flow guidance. As a reminder, our first quarter typically has seasonally higher expenses related to timing of bonus payments and other prepaid expenses. In terms of special items for 2023, we expect a significant ramp-up in costs compared to prior years, primarily driven by dedicated third-party costs to support transition services for the divestitures. In closing, we are positioning Lumen for growth. Weâ\u0080\u0099re making tangible progress internally, and weâ\u0080\u0099re investing in ourselves over the next 2 years to deliver on our longer-term goals. We look forward to sharing our progress with you as we execute on our plans, and we will provide more detail around those plans and expected financial performance at our Investor Day in New York City on the afternoon of Monday, June 5. So first and foremost, 2023 is a reset year. The first is injecting energy into the growth engine in the form of marketing, in the form of disciplined sales approach at the high end of the market, really an execution focus and mindset with some of the new leaders that Iâ\u0080\u0099m bringing in. So Iâ\u0080\u0099m excited about that, and I think that we will get some early traction in the form of things like funnel and pipeline. I think that the story of 2-year stabilization is really, as we go into â\u0080\u009824, weâ\u0080\u0099re going to have sort of the green shoots to show you more explicitly. With respect to your question about BEAD, our projection this year is â\u0080\u0093 or our projection for about 8 million to 12 million enablements in total doesnâ\u0080\u0099t include any BEAD funding. So we really donâ\u0080\u0099t know how that story is going to pan out, but it does represent a potential upside to our story. Where â\u0080\u0093 I talked about changing mindset to really obsess about customers, thatâ\u0080\u0099s about finding new problems and addressing them with both our existing capabilities as well as building a capability to address those problems with net new capabilities, either build, buy or partnering. But they are doing all of that in the hybrid world, which basically hybrid meaning, working from home or working from the locations that have been in place for years. As all of that changes the complexity of their networking solution needs is changing as well, and that represents a huge opportunity for us. The â\u0080\u0093 in terms of what the spending is focused on, we talked about it a bit, but weâ\u0080\u0099ve got to digitize more of what we do end to end, so that, that customer experience is more seamless and self-serve wherever possible. Weâ\u0080\u0099ve got to continue to simplify and really stop doing some things, automate some things, which will allow us to get it to dissynergies, but makes us easier to do business with. And then beyond that, weâ\u0080\u0099ve obviously got to invest in things that are going to drive growth, things that would allow us to enable network as a service, for example. So thatâ\u0080\u0099s whatâ\u0080\u0099s in there, but none of those things will be complete this year. As it relates to why we think we can get to revenue and EBITDA stabilization by the end of next year, I want to be really clear. So when Kate talked about growth OS, thatâ\u0080\u0099s extra. But with what we have today, I think we can very accurately say that from a product and sales standpoint, we were not executing as cleanly as we could have. If I can follow-up and forgive me this â\u0080\u0093 I donâ\u0080\u0099t mean to sound disrespectful at all, but weâ\u0080\u0099ve heard from Lumen and the predecessor companies for 12 years about the new changes and plans and how things are going to turn around. And I know you have an Analyst Day coming up in June, and youâ\u0080\u0099ve only, really, as a team, been together for a little while. And I think that, thatâ\u0080\u0099s a really important shift. I think when you think about the pivot to growth, you need to think about Lumen as a collection of companies that was trying to drive synergy from a bunch of mergers, and was inwardly focused on driving operational efficiency. Every dollar of revenue looked good because as a potential contributor to EBITDA, and every dollar of cost take-out look good. And we hadnâ\u0080\u0099t been in a position to invest in our go-to-market engine, everything from marketing to sales and sales support and customer success. And the leaders that Iâ\u0080\u0099m bringing in from technology, combined with the leaders that are already here at Lumen that really know this business, the combination is going to be incredibly powerful. And Kate, congrats on the new job, and welcome to the mosh pit. I guess, Chris, youâ\u0080\u0099ve been talking about disrupting legacy declines. And then Kate, you talked about a priority being radically simplifying. Look, the historical motion, I think, broadly in telecom is sell things until they die. And I want to be really loud in saying cannibalization is good because if you can keep that customer for longer and you can manage that migration, youâ\u0080\u0099re going to be much better off. So what weâ\u0080\u0099re talking about is aggressively managing end-of-life products, moving customers up the stack. Think about things like customers who are nearing the end of a VPN contract who donâ\u0080\u0099t want to renew, but there is IP and ways out there, and we can wrap security around it. In the near-term, we knew that there were index funds and other investors who relied on that dividend to have an ownership position in Lumen. And David, do you want to â\u0080\u0093 you asked a question about simplification. Kate, the question was within the confines of the â\u0080\u0093 I think, the fourth priority like radical simplification of the business, I think the streamlining of processes and that sort of thing, I think, is kind of one side of the interpretation of what that might look like. I mean the two sort of pieces of it, as I discussed, was going to be understanding how we could do fewer things better, I think, is what I said. And with this mindset around simplification of our product portfolio, weâ\u0080\u0099ve had a proliferation of SKUs. And when you think about the proliferation of IT systems through all the mergers to support those SKUs, both sides of the equation, simplification of what we sell as well as how we sell it, thatâ\u0080\u0099s the winning formula. Regarding the overall strategy, I think if you keep coming back to our mission statement, to digitally connect people, data and applications quickly, securely and effortlessly, anything that we do will strategically map directly to that statement. Thanks for taking my questions and echoing the congrats, Kate. I believe I heard itâ\u0080\u0099s been a 500,000 enablement. In terms of the guidance range, I would say that the pieces that I spend more time being concerned about are the things, frankly, that are beyond our control, things like the inflationary environment and just the broader macro. So, I would say thatâ\u0080\u0099s probably the biggest piece of the variability. I can tell you that the guidance is mapped directly back to things like sales quotas, and the way we pay people for performance has changed as well. As it relates to the Quantum piece, I mean I think your point is a valid one, and thatâ\u0080\u0099s obviously I think a risk. But â\u0080\u0093 and frankly, I think you can even see it in some of the penetration numbers from 2021. We need to make sure that we remain focused on those large metros that we have talked about and that we stop being so focused on a cost per enablement and on a number of enablements and more around making sure that in those markets that we are serving, that customers are going to want our product. And so I think even though this is a little bit painful in the near-term, we are seeing really good performance on our planning yield, meaning when we plan a market and it goes to engineering and then it comes out of engineering that we have been able to accurately estimate the cost so that we can proceed to construction rather than having to go back to planning all over again. So, we are seeing some really good activities internally. But I would much rather have this conversation today than one 5 years from now, where we hit $1,000, and we hit the 10 million enablements, and then you guys are asking me where the annuity stream is on all that fiber. And my own opinion, our opinion, is that I think you are going to see that from some of the overbuilders in markets that are building for the sake of building rather than really having a returns mindset around it. So, the reason you see in total organic declines is that we have harvest and nurture buckets that are declining at high-single digit rates. But when you look at our direct margins, itâ\u0080\u0099s actually beneficial to us when we move into the grow products. So, itâ\u0080\u0099s really about managing that migration because we still have roughly two-thirds of the business thatâ\u0080\u0099s declining at very high rates and how do we supercharge the grow bucket. So, the starting â\u0080\u0093 the performance itself isnâ\u0080\u0099t where we want it to be, but the starting point is actually pretty strong. So, I would say thatâ\u0080\u0099s one thing. The second thing is, obviously, we are in a tough macro environment where everybody is being very thoughtful about the money they spend. So, if you think about us doing a reset, we are doing it in a tough environment. So, I think both of those things combined are really whatâ\u0080\u0099s driving that. Look, I donâ\u0080\u0099t want to get too scientific around that because we obviously have a lot of variability. For example, in our OpEx quarter-to-quarter, we have higher OpEx in the summer when itâ\u0080\u0099s hotter and we are doing more construction. And I think over time, we would like to be able to show you guys that the decline rate is slowing. Again, itâ\u0080\u0099s a 2-year journey until we get to stabilization. But I would watch that over time, and I think thatâ\u0080\u0099s the best way to measure our success. And are you entering 2023 with a better backlog, just given some of the announcements that you have had over the past number of months, particularly in the public sector. So, to address your question about whatâ\u0080\u0099s happening in the enterprise business, the first thing is from a public sector perspective, you are absolutely right. We have a healthy backlog, and we are excited about seeing a lot of that convert this year. And regarding enterprise decision-making, I think with the macroeconomic environment, we all see sort of more approvals required for purchases of technology. So obviously, there is corporate overhead that doesnâ\u0080\u0099t go away when you sell off big chunks of EBITDA. Now, I will say that as we were talking about dissynergies last year, we actually thought they would be a little bit higher than where we are calling it for this year, and thatâ\u0080\u0099s because we have got some other cost savings initiatives going on internally that we think can start to eat away at that. And one other follow-up, on the net debt leverage, you mentioned it could be 4 to 4.3. And quite frankly, that excludes any assumption on the EMEA deal closing, because right now we are assuming that doesnâ\u0080\u0099t happen until early next year. So, when that closes, obviously, those â\u0080\u0093 given where leverage is, we said that we would â\u0080\u0093 from a capital allocation standpoint, focus on growth and then manage leverage and buybacks dynamically. Obviously, with an exit leverage ratio that high, those proceeds would be focused on debt reduction, and that would bring us back down. But operationally, yes, we would expect that, that leverage is peak as we exit this year because we are doing, obviously, the spending that doesnâ\u0080\u0099t give us all the benefits from that spending until we go forward and then some continued spending next year. If you can give us some color on that, that would be great. We have a lens towards customer satisfaction, customer experience, and thatâ\u0080\u0099s driving our prioritization and how we actually do the planning as well as whatâ\u0080\u0099s the level of difficulty and how much will â\u0080\u0093 how much can we do that will impact things in the short, medium and long-term. So, we are right at the planning stages of building the framework to be able to give you more clarity. The simplified â\u0080\u0093 doing less and doing it better is the focus, obviously. When we talk about businesses that donâ\u0080\u0099t accrete to the North Star, whenever we have customers, whenever we have revenue, whenever we have EBITDA, we have to be very thoughtful and use a product life cycle framework to evaluate how to move these customers to modern technologies and how to create a great customer experience in doing so, where they can get the benefit of more of our capabilities than maybe some of our partners as well. And Frank, I would only just add one quick thing there because I know you have been at this game a lot longer than Kate or I have, and that there has been a lot of disaster scenarios with billing systems so I want to address that head on. Part of what we are doing is really determining where we want the endpoint to be, because quite frankly, there â\u0080\u0093 in some cases, there is going to be no business case for integrating old billing systems if the products that are supported by those billing systems are maturing out from a product life cycle standpoint. So, in the near-term, itâ\u0080\u0099s really about simplifying what the customer sees, which may not deal with the front end. And then where we can deal with the front end in a seamless way, we will, or we will just migrate to the new thing as we build going forward. So, itâ\u0080\u0099s complicated, as you well know, but we are not blindly running into a billing replacement program. Kate, your predecessor, Jeff, used to emphasize profitable growth and free cash flow per share as kind of the financial measures, he was most focused on. And I was going to say then for Chris, with respect to the growth and optimization spending, I think you said itâ\u0080\u0099s a 2-year journey in terms of spend. Look, there are two key measurements for success that we are holding ourselves accountable to in the North Star plan. And by the way, there is a one-to-one correlation between a great customer experience and a great employee experience, right. Now that said, thatâ\u0080\u0099s at the highest level. We have spent considerable time mapping the KPIs and the measurements, both financial and operational, to our mission statement to digitally connect people, data and applications quickly, securely, effortlessly. Those descriptors quickly, securely effortlessly, there are literally hundreds of metrics that we are going to be thinking about as we transform operations, as we intensify go-to-market, as we build all of the engines to execute for this company in a reliable way. And we have done so for our Business segment, for our Mass Market segment and for corporate as well. And as it relates to the spend profile over the next couple of years, I would assume itâ\u0080\u0099s relatively flat from year-to-year. And really, the key thinking behind that, Nick is, there is only so much we can do at once. If we could do more now, I would so that we get to the finish line faster. But from an organizational capacity standpoint, particularly given the fact that we are still providing service agreements to the two divestitures last year, we are working on another big one this year, we just got to be careful. So, I would assume that next year, from a CapEx standpoint on those growth initiatives and simplification, it just looks a lot the same as this year. Thanks for taking the question and welcome, Kate, to the team. So, the harvest bucket declines have been aided, in part, by rerate activity. That â\u0080\u0093 the benefits of kind of shifting more into growth, I would say, really havenâ\u0080\u0099t started yet. So, I would say that, thatâ\u0080\u0099s yet to come. As it relates to nurture, there is really not been much in the way of rerate activity there. And nurture is probably the harder of the two because if you think about something like VPN, we have a lot of customers that like the VPN they have or they have recently signed VPN contracts because it meets their need today. So, we have got to get a little more clarity around what we think those longer term growth rates can look like. I think itâ\u0080\u0099s a little early to share that, but thatâ\u0080\u0099s something we would certainly provide some more color on at the Investor Day. Jen, we have got time for just one more question. If I go back to the deck, can you talk about sort of the updated fiber addressability opportunity, the 8 million to 10 million locations. When thatâ\u0080\u0099s complete, that would still represent, I think a little less than half of the locations that are in your landline footprint at this point in time. The â\u0080\u0093 when you look at our existing footprint, we have obviously still got a lot of areas that are rural. And as we have said, our plans for Quantum are dense urban areas and major metros. As it relates to those areas, though, they â\u0080\u0093 their overall performance has been more stable than the 20 states that we have sold. But at this point, those are assets that are attractive to us, and we will continue to manage them closely. So, I just want to say thank you for the warm welcome for everybody. The investments we are going to make over the next couple of years are the right ones to position us for our very, very bright future."
}