{
    "symbol": "JD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 11:05:24",
    "content": " We have been able to play an important role in the industry and China's economic development, as we continue to fully leverage our unique business model and supply chain capabilities to provide consumers best-in-class services, and help our up and downstream partners to enhance their operations. JD Retail's fulfilled gross margin was up 53 basis points year-on-year to 8.2% in Q4, the highest level achieved in all our promotion seasons since inception, mainly driven by our efforts to optimize cost and efficiency and the improving economy of sale. For the full year of 2022, JD Retail's fulfilled gross margin was up 42 basis points to 8.2% and operating margin was up 68 basis points to 3.7%, both at record high levels on an annual basis. On a full year basis, JDL's operating margin reached 0.4% in 2022, achieving its breakeven target for this year, despite the unfavorable impact from the external environment, including additional core costs and operating deleverage. First, I want to stress that JD's business philosophy in our 20 years of development, centered on cost efficiency and user experience, by continuously optimizing cost and efficiency, we are able to create superior product clients and services. And last I want to stress that of China's largest supply chain-based technology and service provider JD's capabilities and the competitiveness exist in our years accumulation of our supply chain capabilities, our joint efforts used together and a winning situation with our business and brand partners and our long-term user forecast business philosophies instead of a just providing giving some benefit on the superficial level. And also when we talk to our brand partners, we also received their demand to work with JD to help them to optimize their business based on on-demand business model and leveraging JD's platform, our user base and our Big Data, et cetera, to provide them better support on the marketing side and the efficiency of our product supply."
}