{
    "symbol": "JD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-23 12:43:06",
    "content": " Despite all that, JD managed to help its users and partners to through difficulties and continue to outpace China's overall retail industry whilst delivering steady improvement in operating efficiency and margin. In Q2, our annual active user base remains strong, mainly driven by healthy user growth in our form JD retail business, which recorded a substantial net position of over 10 million users and double-digit percentage growth on a year-on-year basis. Seamless integration of all three networks overcome the pain point of a single network and not only ensures the reliability of JD's own supply chain, but also drive digital transformation and efficiency improvement, both up and downstream industry players, supporting the high-quality development of China's real economy. Also, with strong capabilities in supply chain, B2C sales and user management, JD is also to establish more comprehensive cooperation with partners to help them efficiently adapt to the market changes and meet consumers' instant needs in various scenarios, thus leading the retail industry's cost optimization and improvement in efficiency and user experience. And I don't need to elaborate a lot on the reasons, and there are different impacts of the macroeconomics and the COVID resurgence, but leveraging on JD's supply chain capabilities and our staff user quality were less affected compared with all industry. And on the different categories, they are reflecting different conditions, for those categories that are closely related to the essential products, for the livelihood such as consumer products, home appliances, and health-related categories, as well as JD's omnichannel business and or intra-city retail business, they're seeing a quick growth. First is user experience; and second, our building of the supply chain capability; and third, it's a large base for us to continue to improve our cost and efficiency; and fourth is our investment in technology; and fifth, we continue to develop innovation business under -- in a disciplined approach."
}