{
    "symbol": "JD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-18 12:53:09",
    "content": " Facing the complex dynamics, JD has been making full use of our supply chain capability and a resilient business model, which we built over the years as we strived to provide best possible service to customers, raise operating certainty for real economy participants, while at the same time, delivering steady business growth of our own. Overall, JD is dedicated to build an online marketplace ecosystem, where merchants can thrive with lower entry barriers and operating costs, better traffic allocation and marketplace rules as well as higher operating efficiency driven by the best of JD's supply chain, logistics and the technical capabilities. Notably, both the number of JDL's external customers and external revenue delivered double-digit year-on-year growth with the latter contributing nearly 70% of its total revenue in Q3. Also, as we continued to expand gross margin for most categories and remained disciplined in OpEx, JD Retail's operating margin was up 115 basis points on a year-over-year basis to 5.2% in Q3, above the 5% mark for the first time since the founding of the company. Excluding the impact from the consolidation of Deppon, JDL's revenues were up 16% year-on-year, mainly driven by the resilient growth in revenues from external customers, which also saw acceleration on a sequential basis. We believe it's vital, especially in a time of uncertainty, to stay focused on delivering better operating efficiency, lower cost and best-in-class user experience, which represents the essence of the retail business and the bedrock of JD's long-term success. But also, I'm proud to share with you, according to China's Post Bureau service recently, in terms of the service experiences, JD Logistics stands number one among this industry, which once again validated our efforts made in our supply chain capability building to help us to stand out and gain consumers' trust in this difficult time."
}