{
    "symbol": "MTB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 12:23:04",
    "content": " In terms of capital, we restarted common share repurchases in this year's second quarter and have now repurchased $1.2 billion in common stock, representing 4% of outstanding shares. And the trend has grown stronger each quarter as we generated pre-tax pre-provision net revenue of more than $1 billion in the third quarter of this year, representing 9% positive operating leverage compared to the linked quarter. On a GAAP basis, M&T's third quarter results produced an annualized rate of return on average assets of 1.28%, and an annualized return on average common equity of 10.43%. M&T's net operating income for the third quarter, which excludes intangible amortization and merger-related expenses, was $700 million compared with $578 million in the linked quarter. Taxable equivalent net interest income was $1.69 billion in the third quarter of 2022, an increase of $268 million or 19% from the linked quarter. Looking at the loans by category, on an average basis, compared with the second quarter, commercial and industrial loans and leases increased $504 million or 1% to $38.3 billion, with $458 million or 2% growth largely coming from core commercial banking clients and $353 million or 17% growth in average dealer floor plan balances. During the third quarter, average commercial real estate loans decreased by $946 million or 2% to $46.3 billion. Average interest-bearing cash balances decreased by $8.9 billion to $30.8 billion during the third quarter of this year, due largely to the decline in deposit balances and the cash deployed to purchase investment securities. Net charge-offs were $63 million in the third quarter, compared to $50 million in this year's second quarter. And we're probably looking at deposit betas in the quarter that maybe are 50% to 100% up from where they were in the last quarter, which I think will remind you the that's in the kind of the 10% range. My first question is just going back to the dynamics of the third quarter net interest income, you mentioned a smaller balance sheet from some of the rebalancing in deposits, but also I think your commercial real estate yields are probably less â\u0080\u0093 had a lower beta than investors were expecting. How we should expect that hedge book to impact the loan beta in the fourth quarter and how your hedging strategy, I believe there's $10 billion in notional that set to expire at the end of first quarter."
}