{
    "symbol": "MTB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-20 15:06:08",
    "content": " With strong NII growth and effective expense management, M&T generated positive operating leverage, as pre-tax pre-provision net revenue increased by more than $300 million versus last quarter. M&Tâ\u0080\u0099s net operating income for the second quarter, which excludes intangible amortization and the merger-related expenses, was $578 million compared with $376 million in the linked quarter. Taxable equivalent net interest income was $1.42 billion in the second quarter of 2022, an increase of $515 million or 57% from the linked quarter. The legacy M&T Bank net interest income increased $95 million sequentially, inclusive of the $138 million impact from higher rates on interest-earning assets, an $8 million increase from 1 additional day in the quarter partially offset by a $22 million decline and the benefit from cash flow swaps and a $16 million decrease in interest received on non-accrual loans and a $9 million decline in interest income and fees related to PPP loans. Compared with the first quarter of 2022, average loans outstanding increased by $35.4 billion or 38% due primarily to the $35.5 billion average impact of the Peopleâ\u0080\u0099s United loans. Looking at loans by category, on an average basis compared with the linked quarter, commercial and industrial loans increased by $14.5 billion or about 62%. Legacy M&T C&I average loans increased by about $1.2 billion, with strong growth in middle-market C&I loans and average dealer floor plan balance growth of $209 million. Average earning assets, excluding money market placements, which is inclusive of cash on deposit at the Federal Reserve increased $50 billion or 50% due largely to the $46.7 billion average impact of Peopleâ\u0080\u0099s United and growth in legacy M&T average investment securities. These include a $2 billion increase in investment securities, a $1.5 billion restructuring of some Peopleâ\u0080\u0099s United high cost deposits, notably broker deposits, a $3 billion decline in escrow and mortgage warehouse related deposits, reflecting lower levels of activity associated with the rising rate environment, a $500 million reduction in trust demand deposits resulting from lower levels of capital market activity compared with the first quarter, and a $2 billion drop in municipal deposits. With that background, average core customer deposits, which excludes CDs over $250,000 increased by $45 billion or 36% compared with the first quarter. Legacy M&T trust income increased about 4% due largely to about $10 million from the recapture of money market fee waivers and $4 million in seasonal tax preparation fees, partially offset by the impact of lower market valuations on assets under management and administration. Operating expenses for the second quarter, which exclude the amortization of intangible assets and merger-related expenses, were $1.16 billion and included about $259 million in expenses from the operations of Peopleâ\u0080\u0099s United. Tangible common equity totaled $15.3 billion, increased 33% from the end of the prior quarter due largely to the impact of the Peopleâ\u0080\u0099s United merger. As previously noted, the Board of Directors authorized a new repurchase program for up to $3 billion of common stock, which replaces the previous $800 million repurchase program, under which $600 million of M&T shares were purchased in the second quarter. Now turning to the outlook for average loans, when compared to standalone M&T full year 2021 average loan balances of $97 billion, we continue to expect average loan growth for our combined franchise to be in the 24% to 26% range. And so I guess, think about permanent mortgages, down slightly, construction mortgages down a little bit more over the course of the year, which probably takes in dollars maybe $1 billion down, call it, 1%, 1% to 2%, offset by growth in C&I."
}