{
    "symbol": "MTB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-20 15:42:06",
    "content": " M&T's net operating income for the first quarter, which excludes intangible amortization and the merger-related expenses, was $376 million compared with $475 million in the linked quarter. Compared with the fourth quarter of 2021, average interest earning assets decreased by some 4% or $5.8 billion, reflecting a $5.6 billion decline in money market placements, including cash on deposit at the Fed, partially offset by a $920 million increase in investment securities. Looking at the loans by category on an average basis compared with the linked quarter, commercial and industrial loans increased by $976 million or about 4%. As is typical for M&T's first quarter results, operating expenses for the recent quarter which included approximately $74 million of seasonally higher compensation costs relating to the accelerated recognition of equity compensation expense for certain retirement-eligible employees, like Don MacLeod. To help you understand the outlook for end-of-period growth or how the outlook for end of period loan growth ties into growth in average -- the average balance sheet when compared to stand-alone M&T 2021 average balances, we expect average loans for the combined franchise to grow in the 24% to 26% range when compared to stand-alone M&T full year 2021 average balances of $97 billion. While higher rates are expected to pressure mortgage originations and gain on sale margins, growth in trust revenue should benefit from the recapture of money market fee waivers sooner than previously anticipated.We expect noninterest income to grow in the 11% to 13% range for the full year compared to $2.2 billion in 2021. But as rates move, assuming they move as anticipated, at some point, you'll see those lines cross and that portfolio will stop shrinking -- and then on a combined basis, it will start to grow, but that's probably not -- the growth part is probably not until late this year, early next year would be my guess just based on our past experience and where the forward curves are. And so if you think about what we've seen in the last quarter, with -- if you try to cover asset sensitivity and reduce it solely through the securities portfolio and fixed rate product to the extent that's held and available for sale, then you have equity risk as rates continue to rise, whereas when we do it through the hedging, it's more equity efficient."
}