{
    "symbol": "NBR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 16:47:03",
    "content": " Adjusted EBITDA in the second quarter totaled $158 million, a 21% increase over the first quarter. Revenue from operations for the second quarter was $631 million compared to $569 million in the first, an 11% improvement. US drilling revenue increased by 16% to $253 million, Lower 48 revenue grew by more than 20% on higher rig count and an increase of over $2,500 in average daily revenue, an 11% increase from the first quarter. Revenue of $296 million improved by $17 million or 6%, reflecting an increase in rig count of 2.3 rigs in Saudi Arabia and Latin America. Total adjusted EBITDA for the quarter was $158 million compared to $131 million in the first quarter, an increase of almost $28 million or 21%. For the third quarter we project our Lower 48 margin at $10,400 to $10,600 per day as we continue to roll our rigs under contract with higher pricing. Our International Drilling segment delivered EBITDA of $82.4 million, an improvement of $11.2 million or 16% over the first quarter results. Drilling Solutions EBITDA continued on its upward trajectory delivering $22.8 million, up 13.8% from the first quarter. Cash generation exceeded our expectations in the second quarter adjusted free cash flow reached $57 million, a $96 million improvement compared to the first quarter. For the full year, we are still targeting capital spending of $380 million, of which, $150 million to support the SANAD new build rigs. So that's why we've said that I think new builds should be a very far distance away, because the cost of a new build we estimate plus $30 million with the metrics identified, which would require day rates in the mid-40s. I mean, it just seems to me, and I know you don't want to give forward guidance too far out, but there's -- it seems very -- nothing else changes from a macro perspective that you guys could comfortably be north of $15,000 day cash margins by second half next year. We're trying to maintain our cost structure even though there's a lot of pressure on it right now, as activity goes up we will try to be vigilant about adding to our body count, etcetera, all because I'm keenly aware of the macro there and I want to make sure I'm not locked into something and I'll respond to it with the same speed and swiftness I did in the last downturn that you saw in the first quarter, we did cuts dramatic compared to most of our competitors as well where we took 20% out of the SG&A, etcetera, we responded really quickly."
}