{
    "symbol": "EBIX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 15:45:23",
    "content": " On a constant currency basis, our Q3 2022 revenues grew by 43% year-over-year to $274.8 million. Exchanges, including EbixCash and our worldwide insurance exchanges continue to be Ebix's largest channel, accounting for 92% of Q3 2022 revenues. The main contributors to the strong growth in Q3 2022 were the company's EbixCash travel and foreign exchange outward remittance revenues that grew a combined 145% year-over-year, EbixCash payment solutions revenue, primarily prepaid gift cards growth of 39%, EbixCash BPO revenues year-over-year growth of 42%, Latin America revenue year-over-year growth of 5% and U.S. Annuity revenue growth of 16% year-over-year and e-learning revenue year-over-year growth of 110%. Our EbixCash exchange revenues, excluding our prepaid gift card business, generated 82% year-over-year growth in revenues in Q3 2022. In total, our travel, foreign exchange, outward remittance, inward remittance, e-learning and financial technologies businesses combined grew revenues by 86% year-over-year during the third quarter of 2022. Despite this reality for a global company like Ebix, our GAAP revenues increased 35%, while constant currency revenues grew 43% year-over-year in Q3 2022. On a year-to-date basis, as of September 30, 2022, our GAAP revenues grew 9.2% year-over-year to $795 million, while our constant currency revenues grew by 14% year-over-year. EbixCash's payment solutions business, which is primarily comprised of our prepaid gift card revenues and which have very low margins, increased 39% year-over-year in Q3 2022 as compared to Q3 2021. During the year-to-date period of 2022, we had the following major cash uses, $33 million of cash interest paid, $29 million for income-related taxes paid globally, a combined $18-plus million expended on CapEx and software development costs, $23.5 million used to reduce the principal outstanding on our corporate credit facility and $7 million for our dividend payments. For the year-to-date 2022 period versus the similar period in 2021, Ebix paid an incremental $14.4 million in cash taxes and $8.9 million in cash interest while also investing an incremental $8.5 million in the company in the form of CapEx and software development costs. Q3 2022 revenues from travel, foreign exchange, remittance, financial technologies and e-learning were 26% lower than Q4 2019 revenues, the last quarter prior to the beginning of the negative COVID-19 impact on Ebix. Our core exchanges comprised of life and annuity, health, illustration, P&C, CRM, and certificate tracking businesses are collectively up approximately 4.5% in Q3 2022 compared to the same quarter last year. The year-over-year EbixCash GAAP revenue growth of 82%, excluding the prepaid cards business. The company's financial discipline can be gaged gated from the fact that over the last 2 years, since September 30, 2020, the company has made cumulative cash payments aggregating $229 million just for cash taxes, shareholder dividends and lender principal and interest payments only. It's not -- it's obviously not lost on us that hypothetically, if we were able to generate enough cash infusion in the form of minority equity in Ebix international subsidiary or subsidiaries, for example, through the EbixCash IPO, then Ebix could have no net interest payments to account for on a worldwide basis, and our EPS could then be a number well north of $1 in a quarter."
}