{
    "symbol": "EBIX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 17:02:05",
    "content": " On a constant currency basis, fiscal year 2022 revenues grew to $1.1 billion, an increase of approximately $113 million or 11.3% over 2021 revenues. The increase is primarily due to growth in the EbixCash business, as well as our year-over-year growth in the company's core life and annuity exchange platforms, BPO and IT outsourced services originating in India, foreign exchange business, travel business, e-learning and financial technologies businesses, and growth in revenues in nine of the company's 11 major geographies. On a constant currency basis, Q4 2022 revenues increased 5% year-over-year and would have been $23.8 million higher in the quarter but for foreign exchange rate changes during the quarter. In Q4 2022, Insurance Exchange revenues worldwide decreased year-over-year by 2%, but grew around 1% on a constant currency basis, while Risk Compliance Solutions revenue increased 14% year-over-year in the fourth quarter of 2022, and EbixCash revenue increased 7% year-over-year in the fourth quarter of 2022. Excluding the Prepaid Gift Card revenues, EbixCash revenues increased year-over-year by 30%. On a constant currency basis, RCS revenues for fiscal year 2022 increased by 11% as compared to 2021, while EbixCash's revenues increased 14% year-over-year . In 2022, the 5.5% revenue growth year-over-year was driven by growth in EbixCash's Travel, Foreign Exchange and Outward Remittance businesses, which on a combined basis grew 118% year-over-year. Employee-related expenses for salary and benefits increased $4.1 million in Q4 2022 versus Q4 2021, while rent expense increased $3.5 million year-over-year in Q4 2022, as the Company continues to reopen international airports and ports of entry locations as the negative impacts from COVID-19 subside. During the year-to-date period of 2022, we had the following major cash uses: $33.2 million of cash interest paid, $24 million for income-related taxes paid globally, a combined $21.5 million expended on capital expenditures and software development costs, $23.5 million used to reduce the principal outstanding on our corporate credit facility, and $9.3 million for dividend payments. In 2022, the company generated $142.8 million of EBITDA plus non-cash stock comp expense, that's an increase of $3.2 million or 2% over 2021 levels. Q4 2022 revenues from travel, foreign exchange, remittance, financial technologies, and e-learning businesses at EbixCash were 27% lower than Q4 2019 revenues, which is the last quarter prior to the beginning of the negative impact from COVID-19 on our Company. The Life and Annuity Exchanges, including Life and Annuity order entry, illustration, CRM, and underwriting exchanges were up 4% in Q4 compared to Q3, up 7% in Q4 compared to the same quarter in '21, and up 5% on a full year basis comparing 2022 to 2021. On a constant currency basis, Q4 '22 revenues increased 5% year-over-year and would have been $23.8 million higher in the quarter, but for foreign exchange rate changes during the quarter. Excluding the Prepaid Gift Card revenues, EbixCash revenues increased year-over-year by 30%. And then really the second one is temporary differences around, in the Trump tax act, there is a section 163J provision which limits your business interest expense deduction and I'm not going to quote absolute numbers, but it's about 30% of your adjusted taxable income and given the increased amount of interest expense we've had that differential year-over-year from 2021 to 2022 increased our taxable income by close to $8 million, just that one item."
}