{
    "symbol": "CNXN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 20:50:26",
    "content": " As a result, net sales declined by 8.5% to $732.5 million compared to Q4 2021. Operating income in Q4 was $23.9 million, a decrease of 23.6% or 3.3% of net sales compared to $31.3 million or 3.9% of net sales in the prior year quarter. Net income in Q4 was $18.8 million, a decrease of 15.9% compared to $22.4 million in the prior year quarter. For the full year, we delivered record results, including an 8% increase in net sales to $3.1 billion, 13.3% growth in gross profit to $526.2 million and diluted earnings per share of $3.37, which represents a 27.2% increase compared to 2021 full year results. In our Business Solutions segment, our Q4 net sales were $280.7 million, a decrease of 7.5% compared to a record and tough compare of $303.5 million a year ago. In spite of this decrease in net sales, our gross profit in the Business Solutions segment was $60 million, an increase of 3.6% from a year ago. In our Public Sector Solutions business, Q4 net sales were $117.3 million, a decrease of 9.4% compared to $129.4 million a year ago. Sales to the federal government increased 46% year-over-year compared to the prior year, while sales to state and local government and educational institutions were $79.6 million, a decrease of 23.2% compared to the prior year. Gross profit for the Public Sector segment was $17 million, a decrease of 8.8% compared to Q4 â\u0080\u009821. In our Enterprise Solutions segment, Q4 net sales were $334.5 million, a decrease of 8.9% compared to $367.3 million a year ago. Gross profit for the Enterprise segment was $47.3 million, a decrease of 6.2% compared to the prior year quarter. On a dollar basis, SG&A increased by $4.7 million compared to the prior year quarter as a result of an increase in the cost of labor and ongoing investment in resources to strengthen our sales, technical sales and services organization. Q4 operating income was $23.9 million, down 23.6% this quarter from $31.3 million a year ago. Net income for the quarter was $18.8 million, a decrease of 15.9% from $22.4 million a year ago. Our trailing 12-month adjusted earnings before income taxes, depreciation and amortization or adjusted EBITDA was $139.3 million compared to $113 million a year ago, an increase of 23%."
}