{
    "symbol": "SOL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-07 23:20:02",
    "content": " In Q2, European power purchase agreement or PPA prices for solar projects increased by 19% from the previous sequential quarter, and the 47% year-over-year. And will set the foundation to drive the solar industry towards its goal of 30% of the U.S. electricity generation by 2030 by 4% today, We believe this favorable regulatory movements in solar industry will drive up our revenue and margin opportunity of our pre NPP projects pipeline across Europe and North America. We are also building IPP projects and looking for M&A opportunities across Europe to take advantage of our higher solar PPA prices, and the favorable regulatory environment. Revenue for the quarter was primarily driven by our China IPP assets as well as the sale of three NTP projects in U.S. GAAP gross margin for the quarter was 45%, above our guidance range for the full year, as revenue mostly was attributed to high margin IPP assets. And I kind of -- I'm thinking that's maybe also sort of related to back, Yumin, when you took over as CEO at the end of 20 -- at the tail end of 2019, you guys shifts -- you shifted or you announced and doubled down and emphasized a much greater focus and strategy around NTP sales, versus CoD sales because that allows you to get better gross margins. Another point on IPP front that the literally we start our light IPP strategy about six months ago, when we look at the energy price, PPA price or merchant price in Europe is going sky high, then our team has done a thorough analysis, we believe that the -- although we can monetize our projects in the countries in a very high margin, but in literally speaking, we could recycle or receive the same return in less than two years, when we run those projects under our IPP portfolio. And just would you get a higher gross margin, because you're getting, I guess, higher gross margin in second half of '23, and maybe '24, because you're getting electricity production, your higher margin IPP sales, but in maybe the first half of '23, you're getting lower than what the kind of rubbing you'd get otherwise, because you're hanging out, you're investing in EPC effort in developing these projects, but you're not just flipping them and monetizing them."
}