{
    "symbol": "SOL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-01 19:33:02",
    "content": " Revenue grew 86% year over year to $28.9 million, gross margin was 29.6% and net income was $3 million compared to $711,000 a year ago. These results were driven by solid performance of our project pipeline and our IPP solar assets in the U.S. and China and the recently acquired 50 megawatt solar farm in Branston, U.K. We closed acquisition of Branston on September 30, the total transaction value was $41 million, of which $20 million was cash and $21 million was nonrecourse project finance. In fact, we have already signed attractive multiyear PPA for Branston project through March 31, 2017, which we estimate will provide over $25 million EBITDA by the end of 2026. Because of the shift from sale to IPP, we will forego over $20 million revenue and $5 million to $6 million of net income in Q4 2022, but will gain significantly higher lifetime revenues and stable cash flows. Due to the strategic shift in Poland and Hungary and approximately $6 million of unexpected negative foreign exchange impact, we now expect our 2022 full year revenue to be in the range of $85 million to $90 million. For Branston, Emeren and 110 megawatts of IPP projects in Poland and Hungary, we have good visibility into 2023 and expect this assets to contribute approximately $35 million to $40 million revenue and $10 million to $15 million EBITDA. Revenue was $28.9 million up 252% sequentially and 86% year over year, largely driven by our project development business in the U.S., strong EPC revenue in Poland and IPP solar assets. Net income attributable to ReneSola Power common shareholder was $3 million, diluted earnings per ADS was $0.04 compared to diluted net loss per ADS of zero in Q2 2022 and diluted net income per ADS of $0.01 in Q3 2021. Cash used in financial -- financing activity primarily related to $42 million share repurchase transact on September 2, 2022 with ReneSola Singapore. We now expect full year 2022 revenue to be $85 million to $90 million, gross margin to be 25% to 30% and net income to be $7 million to $8 million. For the first 100 megawatt in remaining part of the 100 megawatt in Poland and Hungary, we expect the equity portion of about $30 million and additional 40 to 50 megawatts that will take another $10 million to $20 million. But in 2023, we expect we'll continue working on the necessary EPC activities, at the same time build our 100 megawatt in Poland and Hungary and continue doing either self-built or -- self-develop and built 40 megawatts or more or acquire a couple of smaller size M&A -- through M&A, acquired a couple of smaller sized operating projects in Europe. Those three, as I mentioned, will contribute around $40 million top line revenue and also about $10 million, $15 million EBITDA in the year of 2023. And by the way, less than four years we already used a pretty conservative PPA price in merchant curve estimate in the Europe, not really counting those $300, $400, $500 per megawatt hour. You are right, the COD payment normally is $1 million to $1.1 million per megawatt in Europe or in the U.S. a little bit different, when you put the structure of that equity into it."
}