{
    "symbol": "TGAN",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-13 11:36:04",
    "content": " Transphorm is one of the only companies to have ramped GaN in broad market segments from lower power, adapters and fast chargers to help our data center, mining, communication infrastructure, broad industrial, renewables, UPS and impactive design-in for automotive. Among the variety of GaN solutions, looking at the key attributes, what makes Transphorm gallium nitride attractive for customers versus competing solutions like e-mode GaN or the so called e e-mode IC GaN, are -- is the ability to be flexible, which means ease of use, compatible with standard drivers, no extra bond components or shrubbery to interface the GaN FET, the ability to go to higher power and ability to do so very reliably. Our success at higher power comes from, again, the inherent robustness and stability of TGAN's FET architecture that allows us to be offered in industry standard, thermally robust packages, like the TOs, which today's other solutions with GaN sometimes find difficult to do due to their inherent weakness. These benefits include key impact areas like faster charging by packing more power in a smaller footprint, also giving more compact and lightweight systems, which, coupled with higher efficiency and lower losses inherent to the GaN, translate to increased driving range, improving battery efficiency. Silicon carbide has been doing that for last decade or so and is doing very well in the market today, but that is where, again, with our inherent performance advantage like this 25%, 35%, 38% loss reduction that we showed the inherent fundamental performance of GaN, coupled with our partner ecosystem and the quality reliability, Gen4 AEC announced today. And one of the key things enabling that for us is this -- which is unique to GaN with this totem-pole -- so called totem-pole architecture, which is a typical architecture used in GaN in those classes of power supplies and Transphorm also has a very strong intellectual property position in that area."
}