{
    "symbol": "G",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 01:33:10",
    "content": " As we had expected, strong demand for our Data-Tech-AI services was the primary driver of our 12% constant currency year-over-year top-line growth for the quarter while Digital Operations services delivered steady performance. Specifically, during the second quarter of 2022, we delivered total revenue of $1.089 billion, up 12% on a constant currency basis. Data-Tech-AI services revenue of $489 million, up 22% on a constant currency basis; Digital Operations services revenue of $601 million, up 5% on a constant currency basis; adjusted operating income margin of 16.9% expanding 190 basis points from the first quarter; and adjusted diluted earnings per share of $0.70 cents, up 6% year-over-year. During the second quarter, Data-Tech-AI services grew 22% year-over-year on a constant currency basis fueled by the ongoing momentum we are seeing in our emerging services like supply chain management, sales and commercial and risk. Data-Tech-AI services contributed 45% of total revenue for the quarter, up from 44% in the first quarter of this year, and 42% in the full year 2021. Digital Operations services continued its steady growth, increasing 5% year-over-year on a constant currency basis, broadly in line with the first quarter of this year, and up from a decline of 1% in full year 2021. Data-Tech-AI services revenue, which represents 45% of total revenue increased 20% year-over-year, or 22% on a constant currency basis, largely driven by our cloud based data solutions across notable focus areas including supply chain, sales and commercial and risk. Digital Operations services revenue, which represents 55% of total revenue increased 3% year-over-year or 5% on a constant currency basis, primarily due to deal rounds from recent wins. From a vertical perspective, financial services increased 17% year-over-year, largely due to fintech and digital banks, where we're helping them navigate various regulatory challenges and scale their operations as well as continued demand for our risk services with traditional banks. Given our year-to-date performance and the positive impacts from strategic actions we outlined earlier, we now expect our full year 2022 adjusted operating income margin to be towards the higher end of our prior 16% to 16.5% outlook range. For example, by IDC for our proprietary and unique data and analytics certification program DataBridge as the largest upskilling data program of its kind in the world with more than 58,000 employees trained; by Everest Group as a leader in its 2022 supply chain management services, advanced analytics and insight services, as well as Financial Crime and Compliance Operations PEAK Matrix; by ServiceNow, as its 2022 Financial Services Global Partner of the Year; by HFS recognizing our experienced business Rightpoint in the Winner's Circle of its Top 10 Employee Experience Services, 2022 and #1 for outstanding voice of customer; and finally by Microsoft, naming Rightpoint, as it's 2022 US Partner of the Year for Employee Experience, and runner up for its Worldwide Partner of the Year for Employee Experience."
}