{
    "symbol": "G",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 23:11:11",
    "content": " Global Client revenue of $973 million up 15% on a constant currency basis, adjusted operating income margin of 15%, expanding 60 basis points from the fourth quarter and adjusted diluted earnings per share of $0.60, up 2% year-over-year. Global Client revenue was up 15% year-over-year on a constant currency basis, led by continued strong performance from our analytics, digital and consulting businesses that make up Transformation Services, which grew 29% year-over-year and now represents 37% of total Global Client revenue. Global Client revenue, which represents 91% of our total revenue, increased 14% year-over-year or 15% on a constant currency basis, largely driven by continued strong demand for Transformation Services that was up 29% in the quarter as well as a 7% growth in intelligent operations, primarily related to deal ramps. As a reminder, our higher-than-normal adjusted operating income margin levels during the first quarter of 2021 largely resulted from lower travel expenses and the deferment of certain planned R&D and sales and marketing investments for the second half of the year, reflecting the impact of COVID-19. Our effective tax rate was 23.5%, down from 24.1% in the same period last year, primarily due to new lower taxes in certain jurisdictions we operate in the fourth quarter of 2020 – the first quarter of 2022 as compared to 2021. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I think the fact that we often enter these conversations with change agendas, digital technologies, all the acquisitions we have done, I have to say, and I named a number of them in the recent few years have made a big difference to the way we engage with our clients, some of the examples I gave, where our Rightpoint experience team comes in and helps along with our team, really improve the experience of users and customers."
}