{
    "symbol": "MEG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 14:59:03",
    "content": " Second, our organic revenue growth outperformance in core services helped to mitigate the impact of the anticipated $125 million decline in CTEH COVID-19-related revenues from 2021 to 2022. This decrease in revenues was driven by significantly lower CTEH revenue, partially offset by organic growth in our measurement and analysis segment, and the remainder of our Assessment, Permitting and Response segment as well as the positive contributions from acquisitions. Operating segments adjusted EBITDA as a percentage of revenue was 20%, which was lower than the prior year as a result of business mix and the acquisitions of environmental standards, environmental intelligence and Horizon all of which operate at lower margins than our other businesses in this segment. In our Measurement & Analysis segment, revenue increased 12.5% to $172.4 million, primarily attributable to strong organic growth as well as acquisitions. In our Remediation and Reuse segment, revenues increased year-over-year to $184.8 million, reflecting strong organic growth related to the increase in demand for our PFAS water treatment technology and biogas services, as well as revenues from acquisitions. Based on the solid traction in our core business through 2022 and into 2023, we are initiating a full year growth outlook for revenue to be in the range of $550 million to $600 million. We expect CTEH to be within its estimated $75 million to $95 million run rate, which is approximately $20 million to $40 million lower year-on-year, primarily due to the expected cessation of COVID-19-related services in 2023. Within our consolidated adjusted EBITDA outlook, we expect to see margin expansion and mid-teens EBITDA growth in our core business operating segment's adjusted EBITDA. Since 2020, our core business revenue has grown organically at a compounded annual growth rate of 18% with an additional double-digit percent organic growth expected in 2023, well above our pre-IPO levels. Inclusive of acquisitions, but excluding discontinued services, our core revenue is expected to be at a 29% compounded annual growth rate from 2020 through 2023. Although core business operating segment's adjusted EBITDA margins declined from 2020 to 2022, as a result of investments in operating infrastructure, particularly in our water treatment and biogas businesses, business mix, driven by lower margin acquisitions and higher investments in start-up activities, margins are expected to increase in 2023. And they had -- even with the $125 million drop, you can see their overall reduction was less than that, and that's because the core business for CTEH, their core response and  business has really started to pick up nicely and certainly has done so, so far in 2023."
}