{
    "symbol": "MEG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 07:14:04",
    "content": " The revenue decrease was partially offset by organic growth in our Measurement and Analysis, and Remediation and Reuse segments as well as the positive contributions from acquisitions, which added $7.5 million to the quarter. The primary driver of revenue growth in the year-to-date period was organic growth in our Measurement and Analysis, and Remediation and Reuse segments as well as the positive contributions from acquisitions, which added $19.9 million to year-to-date revenue. The year-over-year change in consolidated adjusted EBITDA dollars and as a percentage of revenue for both periods was driven by business mix, the cyber attack in June, which temporarily disrupted certain of our labsâ\u0080\u0099 ability to operate in both June and July, our continued investments in operating infrastructure in our biogas and water businesses and higher variable costs impacting travel, field and lab supplies and other direct costs. As we've reiterated on recent calls, the normalization of our CTEH revenues was expected as the demand for our pandemic-related services has waned following the reduction of COVID-19 testing and prevention requirements in the U.S. Operating segment adjusted EBITDA as a percentage of revenue was 21.2%, which was lower than the prior year quarter as a result of the acquisitions of Environmental Standards earlier this year and Environmental Intelligence and Horizon in 2021, all of which run at lower margins than our other businesses in this segment. In our Measurement & Analysis segment, revenue increased 12.9% to $43.8 million, primarily attributable to organic growth as well as acquisitions completed in and after the end of the third quarter of 2021. And finally, in our Remediation & Reuse segment, revenues increased 32% year-over-year to $40.1 million, reflecting a significant increase in demand for our PFAS Water Treatment services and organic growth in our biogas business, partially offset by the exiting of discontinued O&M contracts. A slight decrease in remediation and reuse adjusted EBITDA as a percentage of revenue to 17.5% was primarily a result of business mix and our continued investments in the operating infrastructure of our biogas and water treatment technology businesses, which temporarily impact margins. And so as we think about getting from $500 million to $600 million of revenue to $1 billion, a lot of what we talked about in terms of the corporate investments we made this year, right, which were a function of our accelerated growth, we think will position us well in a similar way over the next couple of years. Yes, it's a great question. Yes, it's a great question."
}