{
    "symbol": "SUNW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 18:34:07",
    "content": " In summary, it was a year of significant organizational change and transformation, one that culminated in strong fourth quarter revenue growth of more than 70% versus the prior year period, given sustained market share gains across both our residential and commercial segments. Our Residential Solar segment, which represented 83% of total for fourth quarter revenue, delivered strong year-over-year growth in revenue, new installations, originations and backlog as recent investments in our direct sales force have contributed significant ongoing market share gains. Within Residential, our direct sales channel represented a record 27% of fourth quarter revenue, up from 5% in the prior year period. Beginning with a summary of our full year financial performance, Sunworks generated total revenue of $161.9 million in the full year 2022, an increase of 60% versus the prior year period, driven by increased contributions from a Residential Solar segment and a full year of benefit of the Solcius acquisition, which closed in April of 2021. In the fourth quarter 2022, we generated total revenue of $53.6 million, an increase of 69% versus the prior year period, due mainly to higher installation volumes within our residential segment together with higher order intake from prior periods and elevated backlog within our commercial segment. Turning to a review of our Residential Solar segment, which is our Solcius business, fourth quarter segment revenue increased 70% year-over-year to $44.4 million, driven by growth across all sales channels. Direct sales represented approximately 28% of total revenue installed in the fourth quarter, versus approximately 5% in the prior year period. Total residential backlog increased 38% on a year-over-year basis to $54.6 million as of December 31, 2022, driven by growth in direct originations. Hey, guys, thanks for taking the questions. Hey, guys, thanks for taking the questions. So we really are pushing this business to be in excess of $50 million of revenue on an annual basis or at least on a run rate basis, that's once we're into that $50 million to $60 million range, we're starting to think about being positive EBITDA as a segment."
}