{
    "symbol": "SRI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 08:19:00",
    "content": " We are raising our midpoint adjusted gross, operating, and EBITDA margin expectations by 25 basis points to account for the continued impact of pricing actions taken in the first quarter. Consistent with our expectations, first quarter gross margin declined by 170 basis points, relative to the fourth quarter of 2021, primarily due to continued and incremental supply chain-related costs net of customer recoveries. Adjusted operating margin improved 260 basis points relative to the fourth quarter of 2021, primarily due to the favorable impact of engineering recoveries related to the timing of customer funding and lower SG&A costs. Overall, we expect to improve margins and reduce margin risk in 2022 due to the actions we took in the first quarter and will continue to take to offset incremental supply chain-related costs as necessary. The improvement in margin performance is primarily due to pricing actions taken in the first quarter offsetting incremental material costs, reduced SG&A costs and favorable net engineering costs due to timing of customer recoveries. As discussed during our fourth quarter call in 2022 we expect Control Devices sales and operating margin to continue to improve sequentially throughout the year, as we take advantage of incremental volume and execute on our initiatives to offset incremental material costs. Electronics first quarter sales were approximately $108 million, an increase of 12.2% versus the fourth quarter of 2021, which was primarily driven by higher sales in our off-highway vehicle end markets, and continued ramp-up and expansion of our digital driver information systems. Adjusted operating loss improved by approximately $2 million, relative to the fourth quarter of 2021, an increase of approximately 240 basis points primarily due to pricing actions taken in the first quarter, as well as favorable net engineering spend due to the timing of customer recoveries. Adjusted operating income improved by approximately 190 basis points relative to the fourth quarter, primarily due to lower direct material costs, as a result of favorable mix and lower cost of imported materials, as a result of the strengthening of the Brazilian reais against the US dollar during the quarter."
}