{
    "symbol": "SRI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 22:42:58",
    "content": " Our updated full-year guidance implies fourth quarter midpoint revenue of $239 million or approximately 11.5% growth relative to the third quarter, and midpoint adjusted EPS of $0.24 or a $0.21 improvement relative to Q3. Our guidance also implies fourth quarter adjusted EBITDA margin of approximately 8%, which would be a 240 basis point improvement over the third quarter and a 670 basis point improvement over the fourth quarter of last year. Excluding the impact of foreign currency, third quarter adjusted gross margin improved by 480 basis points, adjusted operating margin improved by 620 basis points and adjusted EBITDA increased by 580 basis points or $12.7 million relative to the second quarter of 2022. Based on these forecasts, we continue to expect sequential revenue improvement in the fourth quarter with our midpoint revenue guidance implying 11.5% growth over the third quarter or approximately 2.5x our weighted average end markets. Our updated guidance implies fourth quarter performance to be approximately  to $0.27 per share, an adjusted revenue growth of over 11.5% relative to the third quarter. Operating margin increased by approximately 360 basis points versus the second quarter of 2022, primarily due to lower material costs driven by favorable sales mix and well-controlled operating expenses. Operating income, excluding the unfavorable impact of foreign currency of $200,000 improved by approximately 690 basis points relative to the second quarter of 2022 due to lower material costs as a result of continued cost recovery as well as a continued focus on variable cost control. Stoneridge Brazil's third quarter sales, excluding the unfavorable impact of foreign currency of $900,000 increased by $1.4 million or approximately 10.3% relative to the second quarter of 2022 due primarily to higher sales in the local OEM business. Adjusted operating income, excluding the unfavorable impact of foreign currency, increased by approximately $1 million or 620 basis points relative to the second quarter. Our updated guidance implies fourth quarter performance to be approximately $0.21 to $0.27 per share, an adjusted revenue growth of over 11.5% relative to the third quarter."
}