{
    "symbol": "SRI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 13:27:02",
    "content": " As a result of continued success in our core products, this morning, we are updating our long-term financial targets to include strong backlog growth, our expectations of significant top-line outperformance relative to our end markets and substantial market expansion through our 5-year plan. Our 5-year awarded business backlog grew by 6% in 2022 to $3.6 billion, supporting a 5-year compound annual growth rate of more than 7.5%, resulting in a targeted revenue of $1.3 billion to $1.5 billion and targeted EBITDA margin of 11.5% to 13.5% by 2027. That said, our guidance reflects customer forecasted take rates, resulting in approximately $6 million of sales related to the North American program this year, again, at a take-rate of approximately 10%. Control Devices fourth quarter sales declined by $3.5 million versus the third quarter, due to reduced customer production volumes in North America and China, partially offset by incremental revenue from the ramp up in production of actuation programs and incremental price. Full-year sales were $475.4 million, which was an increase of approximately 24%, compared to the prior year, primarily driven by the continued ramp-up of several key program launches, including the first MirrorEye program and the ramp-up of large programs related to our digital driver information systems. Electronics is well-positioned to take advantage of significant future growth and margin expansion as a result of a strong product portfolio, a substantial backlog of awarded programs, a focus on an efficient long-term cost structure, and continued expansion of our opportunities related to the MirrorEye platform. Based on current IHS forecast, we are expecting market production to drive approximately $10 million of growth or 1.2% in our weighted average end markets year-over-year. We are expecting contribution margins aligned with our historical averages of 25% to 30% on roughly $117 million of non-price revenue growth in 2023, resulting in $0.87 of incremental EPS this year. Our contributions on incremental revenue, our ability to leverage our existing fixed cost structure and our continued focus on material cost improvement, price and supply chain strategy provide a strong foundation for the long-term target of $1.3 billion to $1.5 billion of revenue and an 11.5% to 13.5% EBITDA margin by 2027. And we expect that level of growth to continue, obviously, as we are increasing the forecasted take rates on the second European launch substantially, almost double, and obviously, have a relatively lower take rate on the first North American program currently forecasted that we rightfully saw we're optimistic around given what we're seeing in other OEM products or our first OEM program and the MirrorEye retrofit momentum in North America."
}