{
    "symbol": "GIPR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 11:38:11",
    "content": " Replay information is included in our second quarter earnings release issued on Friday, which can be found on our Investor Relations section of the company's website at gipreit.com. David will provide an overview of the company's growth strategy, business and capital markets activities. Today's conference call includes forward-looking statements that reflect the company's current views with respect to among other things are planned acquisition activity, anticipated market size, future events and financial performance. We ask that you refer to our most recent filings with the SEC for important factors that could cause actual results to differ materially from these forward-looking statements and projections, including the risk factors included in our Form 10-K for the 2021 fiscal year filed with the SEC. For those of you not familiar with company Generation Income Properties is a NASDAQ listed real estate Corporation, formed in 2015 to opportunistically acquire and own retail, industrial and office net leased properties located in densely populated submarkets, with a focus on investment grade credit tenants. We differentiate ourselves by specializing in underwriting primarily investment grade tenants, with remaining primary lease durations of under 10 years, coupled with strong real estate fundamentals. We believe this combination typically correlates to a higher probability of tenants either maintaining their current tenancy beyond their lease expiration, or the opportunity to re-tenant the asset in future years. We focus on this segment because in our view, shorter lease terms provide flexibility to potentially realize attractive rental rate increases higher long-term values and resilience to economic fluctuations. During the second quarter, we focused on stabilizing our portfolio from both the creditworthiness and long-term debt perspective in, order to help us better navigate the uncertainty that is prevalent throughout today's markets. As mentioned, our current portfolio consists of 13 assets with a gross asset value of approximately $61 million and is made up of primarily investment grade credit tenants. In fact, 92% of GIPR's portfolio in terms of annualized based rent is investment grade made or equivalent, which we believe is the highest proportion of investment grade tenants in our peer group. We've also continued to be diligent about the internal growth of our portfolio, and we're happy to report that we're maintaining the contractual increases of annualized base rents that are within 92% of our portfolio. We have either fixed increases in our rental rates or what has worked to our shareholders benefit this year, Consumer Price Index CPI increases with the primary lease term. For instance, our asset that is tenanted by Irby Construction and guaranteed by the investment grade credit of Quanta Services, a New York Stock Exchange company with an approximately $19 billion market cap had a 7% increase in their rental rate in the second quarter, due to the uncapped CPI increase in their lease structure. As announced, GIPR replaced short-term debt with long-term debt for approximately $13.5 million from Valley Bank in the second quarter of this year. We accomplished our goal of securing long-term stabilized debt at what is today a below market interest rate of 3.85% to provide us with tenure debt for seven of our properties, all of which have debt maturities beyond the primary lease term for each asset. As of today, approximately 85% of our portfolio is encumbered by debt where the maturity exceeds the primary lease expiration of the assets, and we have no mortgage debt expiring until mid-2024. Early signs that may be underway include sellers focusing more acutely on buyers with a high certainty to close versus, for example, 1031 Exchange buyers who tend to be more fickle, but we're essentially driving the market for the last several years. And speaking of our future in the initial days of the third quarter of 2022, we entered into agreement with our largest limited partner Unit Holder whose partnership contributed two assets totaling roughly $19 million in value to our portfolio in 2018. To redeem approximately $1.2 million in LP units to common shares with the balance in cash, which we, believe is a testament to his confidence and continued support of GIPR for the long-term. Most of the outreach to us centered on groups with an interest in learning more about our company, our investment thesis, and our long-term growth plans. As David mentioned, GIPR's high credit quality tenant base and well located real estate assets continue to keep our portfolio relatively insulated from shifting economics. GIPR's weighted average remaining lease term is 5.8 years, reflecting our short-term lease thesis. And we recently modified this commitment to increase up to $50 million based on certain equity criteria, and we plan to use that commitment for future purchases. Total revenue from operations was $1.4 million during the quarter, which represents a year-over-year increase of 40% driven by the acquisition of properties, an increase in recoverable expenses and contractual rent increases. Net operating income was $1.1 million as compared to $824,000 during the same period last year, a 28% increase. During the quarter, we incurred approximately $107,000 in debt deal expense related to acquisition costs incurred from a portfolio of assets we are no longer pursuing. Net loss for the quarter was $917,000 as compared to $318,000 for the same period last year, which is directly attributable to the increase in expenses mentioned previously. We have successfully secured long-term financing for all of our mortgage debt, converting all of our rates from variable to fixed, and have structured our debt maturities to not only manage cash requirements, but also hedged against the continued expected increases in interest rates. And finally, our acquisitions and underwriting team are in a great position to continue growing our asset base, build upon the relationships made in the quarter to uncover new opportunities and continue to provide a strong pipeline for us to execute on throughout the second half of the year. Before opening the call for your questions, I wanted to remind you that the name Generation Income Properties was derived from our ethos of generating income, not just for today, but for the generational long-term. Most of our assets have been purchased above 7% and anything in our pipeline, we're looking at that cap rate or higher. Okay, so that's 6.5% number that's, that's probably for properties that have - higher longer lease term than your target properties, right? That's right, the research that I've read, that's for all available net lease properties."
}