{
    "symbol": "TPG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 11:39:08",
    "content": " This growth was driven by significant fundraising activity across our business, led by first closings in the quarter for several of TPG's flagship funds, including TPG Capital Partners, healthcare partners and rise. For the quarter, our capital funds generated total realizations of approximately $2 billion, including the partial sale and recapitalization of TPG Asia's investment in Greencross, Australia's largest pet care company. Our real estate platform, which ended the second quarter with $20 billion of total AUM and had a substantial realization in the quarter, the sale of the remaining assets in ICON, which was our warehouse and logistics development venture in the U.K. On the deployment side, the real estate platform continues to add new investments at a measured pace, primarily across our student housing, rental housing, and life science themes. Additionally, proforma for the recent activation of our next flagship Capital and Healthcare Partners funds, which I'll discuss momentarily, our fee earning AUM is now $73 billion, which is a 39% increase, compared to the second quarter of 2021. Our after-tax distributable earnings were $162 million, which was more than 3x the pro forma year ago quarter, driven by the growth in FRE and by realized performance allocations of $60 million in the second quarter. Your line is open. So, we wanted to start on fundraising and it was nice to see the $7 billion closure   and almost $2 billion for Healthcare 2 in the quarter, especially given some of the emerging challenges, but I want to circle back to Jack's prepared commentary on extension, I think was the word he used. Your line is open. Your line is open. To give you a sense, there's three things that we're focused on, first of all, in our existing portfolio, probably 60% to 70% of what we've deployed was deployed, assuming these incentives weren't in place and it has a very positive effect on that deployment, but more importantly, repeat, which is someone who scores the bill basically expects this bill to drive $3 trillion of investment in the climate space. Your line is open. Your line is open. Your line is open."
}