{
    "symbol": "KBNT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 18:49:09",
    "content": " Joining us for today’s call, are Kubient’s Founder, Chairman, Chief Executive Officer, Chief Strategy Officer, and President, Paul Roberts; and Chief Financial Officer, Josh Weiss. During this call, we will be making forward-looking statements, including statements related to future events or to our future financial performance, and involve known and unknown risks, uncertainties, and other factors that may cause our actual results, levels of activity, performance or achievements to be materially different from any future results, levels of activity, performance, or achievements expressed or implied by these forward-looking statements. Listeners should not place undue reliance on forward-looking statements since they involve known and unknown risks, uncertainties, and other factors which are in some cases beyond our control and which could and likely will materially affect actual results, levels of activity, performance, or achievements. Any forward-looking statement reflects our current views with respect to future events and is subject to these and other risks, uncertainties, and assumptions relating to our operations, results of operations, growth strategy, and liquidity. These statements are subject to known and unknown risks, uncertainties and assumptions that could cause actual results to differ materially from those projected or implied during the call. Furthermore, listeners are referred to the documents filed by Kubient, Inc. with the SEC, including our Annual Report on Form 10-K filed with the SEC on March 31, 2022 with the understanding that our actual results may be materially different from what we expect, which include these and certain other important risk factors. Also, note that the forward-looking statements on this call are based on information available to us as of today’s date. Except as required by law, we assume no obligation to publicly update or revise these forward-looking statements for any reason, or to update the reasons actual results could differ materially from those anticipated in these forward-looking statements even if new information becomes available in the future. Please refer to Kubient’s SEC filings, specifically its Registration Statement on Form S-1, initially filed on December 12, 2020 for more detailed description of risk factors that may affect the company’s results. During the call today, management will discuss adjusted EBITDA and non-GAAP financial measures, and the company’s press release and filings with the SEC, both of which are posted on the Company’s website. As you’ve seen from the earnings release that was issued earlier this afternoon, we started the year off with a strong Q1 top line figure. For the first quarter, our net revenue was $1.2 million, which represents a 39% increase from the prior quarter and a 76% increase year-over-year marking one of the strongest quarters we’ve had in a while. Although we successfully delivered approximately 1.2 million in total Q1 revenue via the audience cloud and to be managed services, subsequently strongly surpassing our revenue targets for the quarter; all of us at Kubient are aware of the need to preserve capital while we strategically explore M&A opportunities. We have already begun pulling back on certain non-essential positions, and evaluating whether other divisions within our business might be streamlined further in order to conserve with the company’s resources. To provide additional context, we have eliminated half of our prior headcount, which directly translates to savings in our operating expenses, and subsequently presents us with more promising financial results looking ahead. We’ve spent a great deal of time and energy building out an effective and proprietary solution that we think is going to properly address the overhanging fraud and efficiency related troubles plaguing the advertising market, and as a result, have decided to optimize them our employees to alleviate the overhead expenditures. Nevertheless, we still plan to maintain our current client roster and existing partnerships and believe that we can still conduct operations and generate strong revenues even with a more streamlined workforce. We host a fully built out supply side platform with the direct publisher integrations and a proprietary solution to remove the crippling ad fraud issue, which we believe will be the direction the ad tech industry is headed. As such, we will continue our search for synergistic businesses, both large and small, that might bolster both the supply and demand side of our business with a focus on bolstering our technology offering to the public and our valued customers. Beyond our continued efforts with regard to potential M&A opportunities, we’ve kept our focus on expanding our organic growth opportunities to provide services to the wider advertising community. We’ve seen new fruit come to the bear on the partnerships growth front, namely PubMatic and Yahoo recently decided to work with Kubient as demand side partners in addition to their current supply side integrations. While we celebrate these partnerships, there’s still work to be done to extract revenue and additional growth with these partners. Now, I’ll hand the call over to Josh who will provide additional color on the quarter from a financial perspective. Now to our financial results for the first quarter ended March 31, 2022. Net revenues for the first quarter of 2022 were approximately 1.2 million compared to approximately 780,000 in 2021. With that said, we only recognize net revenues of approximately $48,000 from this customer in the first quarter, when in reality, we provided additional services of approximately 1.1 million. As of the second quarter, we received approximately $600,000 of payments and expect to recognize revenue in future periods related to the contract for any payments received in excess of the loss accrual which I will discuss shortly. Regarding the additional line item, we recognize the loss accrual of $790,000 for media costs incurred in February and March 2022, which relates to the services performed from the affirmation customers stated at the beginning of my remarks. GAAP net loss attributable to common shareholders was approximately $3.6 million loss, or $0.25 loss per share, compared to approximately $1.8 million or a $0.14 loss per share in the same period last year. Adjusted EBITDA a non-GAAP, measure increased to approximately 3.6 million EBITDA loss compared to an adjusted EBITDA loss of approximately 1.5 million in the same period last year. During this period of capital conservation, and consolidation of labor forces, we feel strongly that our proprietary technology, dedicated labor force and new strategy will mitigate these temporary headwinds facing Kubient. Now, I’ll turn it over to the operator for Q&A. So we really want to bring the burn down rate significantly looking at the current headcount we had, what roles could potentially be duplicative and how do we really conserve the cash that we have on hand, we think that’s a just a tremendous asset for us. And with the environment, the way it is, we don’t really know what the environment would be like to go out and potentially have to raise more capital in the future. So like I mentioned, we’re going to protect that money we have on our balance sheet at all costs. So we’re looking at the sales tech, and really the tech driving what we’re doing day to day. And so I guess, given this margin environment, I think it does make sense to pull back and streamline costs given the tight environment but what I do want to do -- on the positive side is your revenue was outstanding at relatively speaking at 1.2 million pretty big jumps 76% year-over-year. So it is driven a lot by the partnerships that we’re able to secure both, as prior to MediaCrossing Aqua-hire, along with the Aqua-hire of MediaCrossing. So we mentioned earlier that platforms are starting to work with Kubient on both the supply and the demand side, which is a very positive reaction to working with us, because what they’re seeing is yes, we can bring them very good audience. And on the MediaCrossing side what we’re learning is that their team and being able to explain the benefits of Kubient and why removing fraud is so impactful, we expect to see additional revenue come in via some of those partnerships. Because typically, how it works is someone will shift some of their budget into Kubient and they’ll see a greater return on that media dollar. So it’s a lot of testing, learning, increasing budget, testing, learning, increasing budget. So if you look at ad tech as a whole, there’s maybe 10 real players in the industry. So when we go and we speak to a direct brand, and they say, well, we buy all of our media through Google, we buy all of our media through MediaMath, for example, we have to be able to integrate directly into those platforms in order to see those revenue dollars flow through our audience marketplace. If we don’t have established relationships with all of these players, we’re going to basically handcuff ourselves from generating revenue with those partners. We’ve already built our entire media buying on Google, for example. If we’re not integrated fully into Google, we have no way of accessing those budgets. So the fact that we did this work, and it took a very long time to do, but having relationships with Yahoo, with Pubmatic, with Google with MediaMath, is critical for our sales team when they go out and they talk about cut, when they talk about the audience marketplace. I know you don’t provide guidance, can you may be just directionally comments on how you would expect your revenues to kind of to move. The reality is with COVID and the change in spending habits it’s gotten much harder, both industry wide and internally with Kubient to kind of say okay, Q1 is going to look like this, Q3 is going to look like this. So we’re preparing and like I said earlier, we’re kind of circling the wagons and holding on to cash in case there are some bumpy quarters. But I do believe with the economy the way it is, with the lingering effects of COVID it’s a little bit hard to go back to that old model of Q1 a little soft, Q4 is a little strong. Okay, that’s a very helpful answer. At this time, this concludes the company’s question and answer session. If your question was not taken, you may contact Kubient’s Investor Relations team at kubient@gatewayir.com."
}