{
    "symbol": "SILC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 06:20:25",
    "content": " If you have not received it, please contact Silicom's Investor Relations team at GK Investor and Public Relations at 1-212-378-8040 or view it in the news section of the company's website, www.silicom-usa.com. Mr. Ehud, would you like to begin, please? Before we start, I would like to draw your attention to the following safe harbor statement. Actual events or results may differ materially from those projected, including as a result of our increasing dependence for substantial revenue growth on a limited number of customers in the evolving cloud-based SD-WAN, NFV and Edge market, the speed and extent to which solutions are adopted by these markets, the likelihood that we will rely increasingly on customers which provide solution in these evolving markets, resulting in an increasing dependence on a small number of larger customers. Difficulty in commercializing and marketing Silicom’s products and services, maintaining and protecting brand recognition, protection of intellectual property competition, destruction to our manufacturing and development along with genuine disruption to the entire world economy right into the spirit of the novel Coronavirus and other factors identified in the documents side by the company with the SEC. In addition, following the company's disclosure of non-GAAP financial measures in today's earnings release, such non-GAAP financial measures will be discussed during this course. Such non-GAAP measures are used by management to make strategic decisions, focused future results and evaluate the company's current performance. Unless otherwise stated, it should be assumed that financial discussing this conference call will be on a non-GAAP basis. And for reconciliation of non-GAAP to GAAP financial measures is included today's earnings release, which you can find on Silicom’s website. And with that, I would now like to hand over a call to Shaike. Over the past six years as part of a carefully structured long-term transition plan, I have worked closely with Liron, and I have every confidence in his ability to capitalize on our strong market position and bring Silicom to the next level in its long-term development. Liron has served in key executive roles within our company, currently as CEO and COO of our North American subsidiary, Silicom Inc. Liron was the visionary behind Silicom’s edge networking solutions strategy, and was instrumental in driving the company to its leadership position in the SP1 edge platforms market. While I will continue to work very closely with Liron as part of my new role, I wish him much luck in the new position. We are all the more pleased to continue demonstrating growth despite the continued background of significant component shortages and tight supply chains, which are significant headwinds, and the impact is being strongly felt across our entire industry. It is clear that given the continued high market demand, which is well in excess of supply, analysts do not expect the shortage to abate during the current year. We continue to play significant effort into maximizing what we're able to manufacture and deliver, meeting as much of the high demand for our products as possible. And indeed, the exceptionally strong market demand is broad and is across our full product range. This includes our server adapters, SD Wan/ edge devices, as well as in 5G/ O-RAN products. Given such high market demand, and record backlog levels on one hand, and the component shortages on the other to support expected product sales we took, we took the strategic decision to significantly increase our inventory levels. As you may notice, our inventory today stands at about $95 million, which is an increase of almost $20 million in one quarter. It allows us to serve our existing customer base, delivering products which are not easily available today, while attracting new customers and new business. I believe that in today's market, this strategy will provide the highest long-term return on our existing cash position. We continue to capitalize on the trends of disaggregation and decoupling, which are among the most significant positions of IT architecture in recent history. Our ongoing success in SD1 makes us optimistic about our potential in the 5G O-RAN market, which have been endorsing the disaggregated and decoupling approach. Our existing wins our highest ever backlog, combined with a potential opportunities in our pipeline underline our optimism that our achievements so far are just the tip of the iceberg. In February, we added a new Tier 1European telco customer to our growing list of top tier telco clients. This new customer selected a customized version of our edge networking platform and placed a $1 million purchase order, forecasting a ramp up to an annual approximate run rate of $5 million per year. We won this design win through our partnership with a leading provider of SD1 software, we chose our hardware as the highest performance complement to its next generation offerings. This follows our May 2021 design win with a global telco giant Telefonica, and a few other design win with US tier 1 telcos and service providers. The win confirms our strong positioning the SD1 ecosystem, and demonstrates the competitive advantages of our Edge Network Solutions. Strategically, it emphasizes the value of our strong cooperation and partnerships with many SD1 software vendors in the current era of hardware and software decoupling. Last month, we announced a major edge networking design win from an existing customer, a leading US communication service provider for customized high runner edge networking products. We delivered $3 million in equipment for the project first phase, and received second phase purchase orders, totaling a further $3 million to be delivered this year. This is another demonstration of the proven ability of our edge products to increase network throughput and decrease latency, which are key differentiating advantages for us. We have already been living under the issue for a year and our achievements have continued revenue growth, stable gross margins and continued profit growth. One, as you've seen, we have leveraged our strong balance sheet to build up our inventory of raw materials. These are backed by customers’ existing POS and commitments, buying available stock of components, both from the vendors and in the free market and expediting delivery, if need be. And finally, we've been redesigning our products to use more available components to achieve optimized availability. Obviously, when designing new products, our current initial criteria is optimizing for component availability. Despite this, given that our experience and success in dealing with the issue, combined with a very strong market demand for our connectivity solutions and our broad range and increasingly large design wins, all support our expectations for continued solid double digit growth rate for 2022 and beyond. For the second quarter of 2022, we expect revenues at between $33 million and $35 million, which at the midpoint represents growth of approximately 12% over that of the second quarter of 2021. I would like to note that these growth rates represent our estimate as to the level of our success in indeed mitigating the component situation, has been no such situation, our forecast would have been much higher. In summary, we remain very pleased with our performance to date, and 2022 has started well. Even despite the shortages, we continue to stand by our expectations that given the current strong demand in the market, we expect to see double digit compounded revenue growth for the coming few years, which will accelerate once the global supply chain issues are finally resolved. Furthermore, our backlog is at the highest level it has historically been for Silicom, and all these providers with strong revenue visibility over many quarters and years. More broadly, our focus on some of the fastest growing markets in the networking space, which are developing out of the trends, which we had correctly predicted and positioned ourselves for, as well as our current long and deep pipeline makes us further optimistic. During the last 12-month, our top three customers together accounted for about 30% of our revenues. I will be presenting the rest of the financial result on a non-GAAP basis, which excludes the non-cash compensation expenses in respect of options and RSUs granted to directors, officers and employees, acquisition related adjustments as well as lease liabilities, financial income. Gross profit for the first quarter of 2022 was $11.1 million, representing the gross margin of 34.5% in the upper half of the range of our gross margin guidance of 32% to 36% and compared to a gross profit of $10.1 million or gross margin of 34.7% in the first quarter of 2021. Operating expenses in the first quarter of 2022 were $7.7 million, compared to $7.1 million reported in the first quarter of 2021. Operating income for the first quarter of 2022 was $3.4 million, an increase of 12% compared to operating income of $3 million, as reported in the first quarter of 2021. Now turning to the balance sheet, as of March 31, 2022, the company's cash, cash equivalents and marketable securities totaled $43.1 million with no debt, or $6.47 per outstanding share. During the quarter, we further executed on our third $15 million dollar share buyback plan, which we started on May 4, 2021. During the first quarter, we purchased approximately 78,000 shares at a total cost of $3.3 million. Well, obviously we do not see any improvement for now in the component situation, which is, was very bad and is very bad. However, as I've mentioned before, we have taken steps ahead of time, mostly in terms of creating inventory, which would help us with the deliveries with customers. So again, we would have challenges, it's not going to be simple and well, not only it's not going to be simple, I'm pretty sure that we would not be able to deliver to our customers everything they are after. However, I think that looking at overall industry situation, then we are relatively in a good place, still challenging, but relatively in a good place. Well, first of all, I would say that, indeed, this is our strategy. Obviously, once we're doing that, we're careful looking at every other parameter within the company to be able to do that, but we are taking advantage of our strong positioning, I would say. And the strategy remains like that, which means we would continue to take on the inventory, which by the way, is committed, as I mentioned, I mean, we have the largest ever backlog position ever in the history of the company. The only disruptions and challenges that we're feeling is these days in the supply chain, which obviously creates challenges in deliveries, but from a business perspective, getting new design wins, getting new POS et cetera. Well, first of all, as you could note, most, I believe, approximately 70% of what we're selling is to the United States. So I wouldn't say that there was no impact at all, but it is not something which is impacting our business. And then lastly, on the CEO transition seems like Liron been instrumental to the SD WAN strategy. Well, I believe that, at least, I mean, talking to Liron, I believe that we are -- you are not going to see any change in strategy, it seems to me that the Liron believes in the same strategy that I believe that the Board of Directors believed in. And I think that the timing is even perfect, because right now, with this huge backlog that we're having, and a lot of things to execute, I think that these are areas that he could be much better than me. This has been a long process, six years process that we structured very carefully for him to learn every part of the company has or his impact on the strategy is already within our current strategy. So I would say more of the same strategically, probably better results. And I guess one more, if I may, could you just touch on, obviously, the shekel has been plummeting recently. In quarter one, indeed, we had a positive effect of exchange rate differences, not significant amounts, but still a minor positive effect compared to negative and sometimes quite significantly negative effect in previous quarters. Before I ask Mr. Orbach to go ahead with his closing statement, I would like to remind participants that a replay of this call will be available by tomorrow on Silicom’s website, www.silicom-usa.com."
}