{
    "symbol": "HAIN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-03 11:37:02",
    "content": " Our growth brands, which make up almost 70% of our total company sales were up slightly in the quarter versus a year ago and up 12.6% versus two years ago. Elaborating further on our momentum and growth algorithm that we unveiled with Hain 3.0, we're very encouraged by the strong momentum on consumption in the US business with our growth brands now up more than 16% in the most recent four weeks ending January 23 and 31% versus two years ago. Second, despite the supply chain challenges and highly inflationary environment impacting the entire industry, our overall adjusted EBITDA margin improved versus the prior year, and our International business delivered another quarter of adjusted EBITDA growth. As we overlap last year's COVID demand surge and a Brexit-related demand pull forward, second quarter consolidated net sales decreased 10% year-over-year to $477 million. While second quarter adjusted EBITDA decreased 5% versus a year ago to $5 9.3 million, adjusted EBITDA margin increased by 66 basis points year-over-year to 12.4%, primarily driven by the previously mentioned reduction in SG&A costs. The turbocharge category delivered close to 20% net sales growth versus the prior year period and 23% growth versus Q2 fiscal year 2020, driven by the strong performance of our snacks business. After adjusting for currency movements and divestitures, net sales for the quarter were down about 6% versus the prior year period, driven by softness in our daily food exports to China and the lapping of the Brexit-related volume pull forward in Q2 of fiscal year 2021. We grew adjusted EBITDA by close to 7% versus the prior year period, and adjusted EBITDA margin improved by 390 basis points to 17%, driven by higher gross margins and lower SG&A expenses from lower labor-related costs and third-party expenses. Capital spending for the second quarter was $10.2 million or 2.1% of net sales, which reflected lower spending than expected given supply chain challenges and labor availability. We expect our second half to deliver adjusted top line growth versus prior year in the mid- to high single-digit range, driven largely by the performance of our North American business. For additional context to our financial performance in the second half of the year, the company expects sequential improvement to its adjusted EBITDA growth performance throughout the quarters of fiscal year 2022 with Q4 of fiscal year 2022 anticipated to deliver the highest adjusted EBITDA growth versus the prior year quarter given the full implementation of all pricing activity by that time and a prior year fourth quarter that was already impacted by the supply chain challenges that have continued throughout this year. Please proceed with your question. And remember, last year, we also had a challenging fourth quarter, which we get to overlap this year, which will also be helpful in terms of driving that EBITDA growth\n Mark, if I may, I would also like to add that we have a quite strong visibility to our cost of goods going forward for the second half. Please proceed with your question. It's significantly inflationary versus a year ago and versus our original plan and even the first quarter earnings, it's added about $10 million of cost, some of which happened in Q2 and the rest of which will happen in the second half of the year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}