{
    "symbol": "HAIN",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-09 11:25:04",
    "content": " Looking at the reporting segments, North America adjusted net sales were down 1% compared with year-ago and up 8%, versus fiscal 2020. In International, we delivered another strong quarter with adjusted net sales up 2% versus year ago, and 14% versus FY2020. The turbocharged group comprised of meat-free nondairy beverage and snack brands, grew adjusted net sales 5% year-over-year and 20% versus two years ago. Foreign exchange benefit first-quarter net sales by 2% while divestitures and brand discontinuations reduced net sales by close to 11% When adjusted for these 2 factors, net sales were flat versus prior year, exceeding Q1 guidance of a low to mid-single-digit decrease on an adjusted basis. First-quarter adjusted EBITDA decreased 14% versus a year ago to $47 million, slightly better than our guidance of a mid to high-teens EBITDA decrease. On the top-line, reported net sales for the first quarter decreased 5% year-over-year to $265.5 million, mainly due to the lapping of elevated at -home food consumption and strong hand sanitizer sales in the prior year period due to COVID -19. In the targeted investment category, our tea and baby food products delivered mid-to-high single-digit growth versus prior year, with tea also delivering north of 20% growth versus the same period two years ago. While these last 2 quarters has presented multiple operational challenges, we have been able to maintain relatively strong customer services in the U.S.  From a profitability perspective, adjusted gross margin for our North America business decreased by 476 basis points, driven by the supply chain challenges already discussed, partially offset by our pricing actions taken late in the quarter, and productivity initiatives. Foreign exchange increased sales by 4% while divestitures reduced sales by 19% after adjusting for currency movement and divestitures, net sales for the quarter were up about 2% versus the prior year period, and up 14% compared to the first quarter of 2020, the most recent pre -pandemic period. Sales increased behind high growth on our Ella's kitchen, baby food, and Jill Soup businesses in the U.K..  Our growth category of brands delivered 24% growth in constant currency versus the same period 2 years ago, driven by the strength of our plant-based, non-dairy beverage, and Ella baby food businesses. From a profitability standpoint, we grew adjusted EBITDA by 21% versus the prior year period, and adjusted EBITDA margin by 487 basis points to 17%, despite facing global supply chain challenges and not yet having taken pricing to cover inflation, which went into effect in the second quarter. Compared to fiscal year 2021, we expect low single-digit adjusted net sales growth, reflecting a small benefit from currency of about 20 bps and a 600-basis points headwind from divestitures, modest adjusted gross margin expansion, and mid-to-high single-digit adjusted EBITDA growth. Given the timing of the price increases hitting the market, confirm incremental volume-generating events in the second half of fiscal year 2022, and the higher inflationary environment than initially forecasted, we expect the following: net sales to be down low single-digits on an adjusted basis in the first half of fiscal year 2022, and improvement over our initial first-half guidance announced by mid-to-high single digits in the second half. To note, during Q2 fiscal year '22, we're overlapping a Brexit related volume pull forward that benefited net sales growth in Q2 fiscal year '21 by about 4%, and adjusted EBITDA to be down mid-single-digits in the first half of fiscal year 2022 and up-low double-digits in the second half."
}