{
    "symbol": "WASH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 14:32:03",
    "content": " As Ned mentioned, net income was $18.7 million or $1.08 per diluted share for the third quarter as compared to $20 million or $1.14 for the second quarter. Net interest income amounted to $42 million, up by $4.5 million or 12% from the preceding quarter. Non-interest income comprised 27% of total revenues in the third quarter and amounted to $15.8 million down modestly by 49,000 or point0.3% from Q2. September 30, end of period assets totaled $6.3 billion down by $327 million from June 30, largely due to market depreciation. To date, we have been informed of client withdrawals of $412 million, with related annual revenues of about $2.4 million or 600,000 per quarter. Our mortgage banking revenues totaled $2 million in the third quarter down by 35,000 or 2%. Mortgage loans sold totaled $75 million in the third quarter, down by $4 million or 6%. Our mortgage origination pipeline at September 30 was $165 million down by $69 million or 29%, from $234 million at the end of June. Regarding non-interest expenses, these were up $2 million, or 6% from the second quarter. Salaries and employee benefits expense increased by $1.2 million or 6%, reflecting adjustments to performance based compensation accruals to remaining linked quarter increase in non-interest expense reflected modest increases across a variety of other categories. In the third quarter, total commercial loans increased by $186 million or 8%. Investment securities were down by $38 million or 4% from June 30, a temporary decline in fair value in routine pay downs and mortgage backed securities were partially offset by purchases of debt securities. Total shareholderâ\u0080\u0099s equity amounted to $432 million at September 30, down by $44 million from the end of the second quarter. As mentioned during our July earnings call, in the third quarter, we repurchased approximately 19,000 shares at an average price of $47.79 and a total cost of 896,000 under our stock repurchase program. The third quarter provision for credit losses was a charge of $800,000 compared to a negative provision or benefit of $3 million in Q2."
}