{
    "symbol": "WASH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 11:01:02",
    "content": " As Ned mentioned, fourth quarter net income was $16.6 million or $0.95 per diluted share. Net interest income was $41.3 million, down $700,000 or 2% from the preceding quarter. On the funding side, average in-market deposits increased by $84 million, and average wholesale funding sources rose by $220 million, the rate on interest bearing liabilities increased by 78 basis points to 1.64%. This comprised 25% of total revenues in the fourth quarter and amounted to $13.8 million, down $2 million or 13% from Q3. December 31 end of period AUA totaled $6 billion down $361 million or 6% from September 30, reflecting net client asset outflows of $673 million, partially offset by net investment appreciation of $312 million. Mortgage banking revenues totaled $1.1 million down by $944,000 or 46%. Total mortgage originations were $268 million down by 11%, and we placed 85% of mortgage originations into portfolio compared to 74% in the preceding quarter. Our mortgage origination pipeline at December 31 was $102 million, which was down $62 million or 38% from the end of September. Total loans were up $261 million or 5% from September 30, and by $837 million or 20% from a year ago. In the fourth quarter, total commercial loans increased by $70 million or 3%. Within this category commercial real estate loans increased by $66 million with additions of $146 million, partially offset by payments of about $80 million; and C&I increased by $4 million as new volume of $48 million was offset by payments of $44 million. Residential loans increased by $179 million or 8% from September 30, and by $596 million or 35% from the end of 2021. The fourth quarter provision for credit losses was a charge of $800,000 consistent with Q3 and reflects loan growth continued negative trends in forecast of macroeconomic conditions, and strong asset and credit quality metrics. It looked like you had $600 million leave with those full relationship people, and there's another $55 million coming this quarter, it sounds like. Ron, I think you said you're expecting $250 million to $255 million here in the first quarter. But looking back at my notes from last quarter, I think the guidance was like $285 million to $290 million for the fourth quarter, and it came -- you guys came in at $265 million."
}