{
    "symbol": "WASH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-25 14:21:05",
    "content": " Commercial loans, net of PPP, declined by $12 million in the quarter as new originations and advances of $110 million were more than offset by payoffs and paydowns of $122 million. As Ned mentioned, net income was $16.5 million or $0.94 per diluted share for the first quarter. Net interest income amounted to $35.1 million, down by $2.6 million or 7% from the preceding quarter. Additionally, there was $2.2 million of commercial loan prepayment fee income in the fourth quarter, which had a 16 basis point benefit to the margin. On the funding side, average in-market deposits rose by $216 million, while wholesale funding sources decreased by $176 million, and the rate on interest-bearing liabilities declined by 1 basis point to 0.33%. March 31 end of period, assets under administration totaled $7.5 billion down by $291 million or 4% from December 31, largely due to market depreciation. Our mortgage banking revenues totaled $3.5 million in the first quarter, down by $831,000 or 19%. Realized gains on sales of loans were $3.3 million down by $2.4 million or 42% from the preceding quarter, reflecting lower sales volume and a lower sales yield. Mortgage loans sold totaled $130 million in the first quarter, down by $67 million or 34%. Mortgage loan originations amounted to $271 million in the first quarter, down by $92 million or 25%. Loan related derivative income was $301,000, down by $1.7 million from the preceding quarter, reflecting lower commercial swap volume and income from bank-owned life insurance totaled $601,000, down by $543,000 from the preceding quarter due to the recognition of $526,000 of life insurance proceeds in the fourth quarter. Regarding noninterest expenses, these were down by $4 million or 11% from the fourth quarter. Excluding the impact of these penalties, noninterest expense was down by $1.3 million or 4% from the fourth quarter. Salaries and employee benefits expense decreased by $522,000 or 2% in the first quarter, reflecting volume-related decreases in mortgage originator compensation expense and lower performance-based compensation accruals. In the first quarter, total commercial loans decreased by $37 million or 2%, which included a net reduction in PPP loans of $25 million. Excluding PPP, commercial loans decreased by $12 million or 1% from December 31. C&I loans, excluding PPP, decreased by $1 million as payoffs and paydowns of $22 million were essentially offset by new volume in the quarter. End market deposits were up by $261 million or 6% from December 31, concentrated and money market accounts and were up by $713 million or 18% from a year ago. And in fact, in the first quarter, we -- we have, in addition to the funded loans that we talked about earlier, we closed another $27 million of construction loans in the quarter that just haven't funded. Damon, please go ahead. Yes, Laurie, this is Mark. Yes, Laurie, this is Mark. But we’ve calculated every 25 basis points is about -- and this is an estimate, it's about $1 million of net interest income …\n Annualized. Damon, please go ahead. So, the 5% growth is off of a base from last year on the reported, which was like $135.5 million or like kind of the operating when you take out the FHLB and some other charges, which was closer to like $128.5 million?"
}