{
    "symbol": "WASH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 13:40:08",
    "content": " I'm pleased to report that Washington Trust posted solid second quarter results with a net income of $20 million or $1.14 per diluted share, compared with $16.5 million or $0.94 per diluted share in the prior quarter. As Ned mentioned, net income was $20 million or $1.14 per diluted share for the second quarter, and this compared to $16.5 million or $0.94 for the first quarter. Net interest income amounted to $37.5 million, up by $2.4 million or 7% from the preceding quarter. Noninterest income comprised 30% of total revenues in the second quarter and amounted to $15.9 million, down by $1.3 million or 8%. June 30 end of period, AUA balances totaled $6.7 billion, down by $843 million or 11% from March 31, largely due to market depreciation. Our mortgage banking revenues totaled $2.1 million in the second quarter, down by $1.4 million or 41% from the first quarter. Mortgage loans sold, totaled $80 million in the second quarter, down by $50 million or 39%. Note however, that overall loan origination activity was strong and amounted to $350 million in the second quarter, up by $79 million or 29%. Our mortgage origination pipeline at June 30 was $234 million, up by $24 million or 12% from $210 million at the end of March. Salaries and employee benefits expenses decreased by $621,000 or 3% in the second quarter, reflecting lower payroll taxes and a reduction in share-based compensation expenses. Excluding PPP, loans increased by $207 million or 5% from Q1 and were up by $325 million or 8% from Q2 2021. In the second quarter, total commercial loans decreased by $14 million or 1%, which included a reduction in PPP loans of $11 million. In the second quarter we repurchased 175,000 shares at an average price of $48.93 and a total cost of $8.6 million under our stock repurchase program, including third quarter repurchases we are at a total of 194,000 shares at an average price of $48.82 for a total of $9.5 million. The second quarter provision for credit losses was a negative $3 million, compared to a $100,000 positive provision in the preceding quarter. So finally, we consider share repurchases with which we just returned $9.5 million to our investors, which is an amount in excess of our second quarter dividend. That said of the $227 million, we think of about 20% of it is on the higher risk side because it might be a single tenant."
}