{
    "symbol": "APH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 18:53:03",
    "content": " Relative to the second quarter of 2021, sales in the Harsh Environment Solutions segment were $790 million and increased by 14% in U.S. dollars and 16% organically. We're especially pleased to deliver strong profitability in the quarter with operating margins reaching 20.7%, and that's 70 basis point increase from both prior year and prior quarter, and we achieved these operating results despite facing a wide range of operational, inflationary and supply chain challenges as well as the COVID shutdowns in China that Craig mentioned. As we look into the third quarter, we expect sales to increase modestly from these second quarter levels, and we continue to be very pleased with the strength of the company's broad position across the military market. The commercial aerospace market represented 3% of our sales in the quarter, and our sales increased by a very strong 32% from prior year and 36% organically as we benefited from the continued recovery in global aircraft production. Sales in the quarter grew 13% in U.S. dollars and 15% organically, and this was driven by broad-based strength across most of our industrial end markets, including especially the battery and electric heavy vehicle applications, oil and gas, medical and rail mass transit. Sales in the second quarter grew 23% in U.S. dollars and 29% organically, and this was driven by broad-based strength across most automotive applications, with particular strength once again in sales into electric and hybrid electric vehicle applications. The mobile networks market represented 5% of our sales in the quarter, and sales grew from prior year by 9% in U.S. dollars and 6% organically as strength from products sold to network operators, together with the benefit of acquisitions, more than offset a moderation of our sales to wireless equipment manufacturers. I think we have a really strong outlook here given the real strength that we saw in the second quarter, given the continued momentum that we have across the company. And as I mentioned in my prepared remarks, I think, at this point, coming into the second quarter, we really have, we believe, had a meaningful progress on really offsetting a good portion of the inflation and supply chain and other costs that we've seen over the past year. I mean one thing I would just clarify, we -- I talked about the fact that we see in the second quarter some moderation on a sequential basis, that would still reflect very strong year-over-year growth in the auto market on a year-over-year basis. So the conversion, the strong sequential conversion you see here in the second quarter is really kind of catch up, I would say, for pricing -- for inflation that we've seen over the course of the last year, and that will continue to hopefully catch up on as we expect to here in the third quarter."
}