{
    "symbol": "MRVL",
    "quarter": 2,
    "year": 2023,
    "date": "2022-08-25 18:18:04",
    "content": " In the second quarter of fiscal 2023, the Marvell team drove another record level of revenue at $1.52 billion, growing 41% year-over-year and 5% sequentially. In data center, year-over-year, we are expecting revenue growth of over 20%, driven by our cloud end market. Turning to our carrier infrastructure end market, revenue for the second quarter was well-above our forecast at $285 million and growing 45% year-over-year and 13% sequentially. Looking ahead to the third quarter of fiscal 2023 for our carrier end market, we were expecting year-on-year revenue growth in the mid-20% range, driven primarily by our wireless end market. Moving on to our enterprise networking end market, revenue for the second quarter was $340 million, growing 53% year-over-year and 19% sequentially, better than our guidance driven by improvements in supply. Year-over-year, our auto business, driven by higher adoption of Marvell's Ethernet technology continued its strong growth trajectory with revenue doubling. Looking to the third quarter of fiscal 2023, we are projecting revenue growth to remain over 40% year-over-year and grow in the mid-teens sequentially on a percentage basis for the combined auto and industrial end market. Moving on to our consumer end market, revenue for the second quarter was $164 million, declining 1% year-over-year and 8% sequentially. On a year-over-year basis, we expect revenue from the consumer end market to decline by approximately 10% due to softness in consumer HDD demand, partially offset by continued growth in our SSD business. In the third quarter, at the midpoint of the range, we are guiding our revenue to grow by 29% year-over-year, and we expect operating leverage in our business model to drive non-GAAP EPS at the midpoint of guidance to grow by 37% year-over-year. When you -- as you think about next year, when you look at the broader supply chain and you actually focus in on the leading edge technology types of components that are required, whether that's advanced packaging and substrates, some of the advanced node process technology and just some of the complex nature of the products we're dealing with, those we have to manage very carefully. And then the final part is with respect to the outlook next year, I think the biggest thing to take away really is at the highest level, we're ahead of plan on where we thought we were if I went back to our Analyst Day back at the end of 2021, we're on the $6 billion annualized revenue run rate. Yes, a couple of things. So you can even see it in the short term where like, for example, we've got constraints in cloud this quarter, but enterprise and automotive, when you look out to next quarter are doing extremely well, and thatâ\u0080\u0099s because of our diversification of our model, all focused around data infrastructure, by the way So while there may be lumpy 'parts' of our business from time to time, that is by design, how we've architected the business model of Marvell. Yes, a couple of things. And certainly, for somebody that's got a lot of market share in a given end market that had a run rate business, that had been going on for a while and it got inflated because of inventory growth over the last few years, one would get concerned. But I think for high complexity, there's just such a move in the industry, companies like Marvell and a lot of our large peers who more and more are just producing tremendous amounts of compute power and high-performance computing broadly, whether it's in networking or custom-silicon or CPUs or GPUs, you name it, it's all going to this complex technology, and that's where we have to just continue to be tactical and keep our heads down and match supply and demand and get what we need."
}