{
    "symbol": "MRVL",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-02 18:11:04",
    "content": " In our data center end market, revenue for the fourth quarter was $498 million, declining 13% year-over-year and 21% sequentially. For the first quarter of fiscal 2024, we are expecting significant growth in our wireless business with revenue projected to increase by approximately 25% sequentially driven by 5 G deployments in multiple geographies and our customer-specific product ramps. Revenue for the fourth quarter was $366 million, with a strong 39% year-over-year growth, driven primarily by higher content and growing share of our merchant products, which drove the vast majority of our revenue in this end market in fiscal 2023. But when you add it all up, basically, and you look out over the next few quarters, we do see growth in the second quarter and then as a result of really what we believe will be the inventory digestion and the normalization in the back half plus continued strength in things like 5G and automotive and then also our cloud optimized ramp. So I think if you look at the year-on-year, the much bigger portion of storage, as Willem just walked through, if you think about all the other product lines, right, this include optics as well as some of our networking products within data center, that's where we're seeing a much smaller decline in Q1. And then on the third point, which is just, all we were pointing out on the architecture stuff was that, as we see the growth in AI-based systems and AI-based clusters and AI-centric data centers, we think longer term, I mean, that's now outside the window we're talking about here, whether it's this year or next year, that, that's going to be a significant growth trend and that's going to require both cloud-optimized silicon as well as our high-speed optics. No, I think Srini, I think the big issue, especially with maybe some of the more larger incumbent players that have large carrier communications businesses, especially in the wireless area, they tend to be -- have a combination of some legacy, let's call it, like 4G LTE type of solutions, and then they've got new 5G chips that are ramping up, and then there's some mix of the two. And certainly, we're happy with the growth we're seeing, and we think that that's -- overall, this year is going to be a growth year for us in 5G. I think it -- and I was reflecting back, looking at where we were back, let's say, in 2020, during the pandemic, we were in the process of combining with Inphi and I sort of look a few years later, and I think in fiscal 2023, we -- ourselves, Inphi and also, by the way, the Innovium team we brought in, really everybody executed extremely well."
}