{
    "symbol": "MRVL",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-01 19:49:12",
    "content": " In the third quarter of fiscal 2023, the Marvell team drove revenue to $1.54 billion, a record for the company, growing 27% year-over-year and 1% sequentially. In our data center end market, revenue for the third quarter was $627 million, exceeding guidance with better-than-expected results from our cloud business. On a year-on-year basis, our data center revenue grew 26% with our cloud business driving all the growth with multiple product lines contributing to strong results. As a result, for the fourth quarter of fiscal 2023, we are expecting our data center revenue to decline year-over-year approximately in the mid- to high teens on a percentage basis and sequentially decline in the mid-20% range. Revenue for the third quarter was $376 million, growing 52% year-over-year and 10% sequentially. Revenue for the third quarter was $84 million, growing 26% year-over-year and 1% sequentially. Looking to the fourth quarter of fiscal 2023, we are projecting strong growth for our overall auto and industrial end market, expecting revenue to grow approximately 30% year-over-year and in the mid-20% range sequentially. Revenue for the third quarter was $178 million, declining 2% year-over-year and growing 9% sequentially. Revenue in the third quarter was $1.537 billion, within our guidance range, growing 1% sequentially and 27% year-over-year, driven by growth from our data infrastructure end market. During the quarter, we generated $411 million in cash from operations, reflecting our strong earnings offset by continued working capital investments to support our top line revenue growth, including $94 million in payments for long-term back-end and substrate capacity agreements. I'd say the first point is we feel very good about the new products that are ramping up and the growth drivers that we've articulated, whether it's cloud optimized silicon, switching, electro-optics, things like that in the data center, 5G, obviously, continued momentum there with additional regions like India ramping next year plus content gain rolling through and then automotive continuing to grow. But it seems like if you net all that out, maybe it's kind of the $600 million per quarter baseline in data center and then you can add the $400 million for the cloud optimized silicon next year. I was wondering as you think about some of the inventory digestion that needs to occur across some end markets, as you contemplate that and plan with your foundry suppliers for next year, is there -- could you just maybe just talk about some of the discussions you're having in terms of the ability to perhaps limit some of the cost inflation from the foundry side and whether that -- if they can share that cost with you going forward such that perhaps less of an onerous task for you to pass it along to your end customers. Part of it is, if you remember, Ross, we went from talking about the $400 million and $800 million to actually talking about, call it, $400-plus million $800-plus million because we had gotten additional design wins that created a little bit of a buffer as well because I think even if we hedge it for next year and the volumes don't quite achieve what we would have thought, we actually had one additional business that gives us some comfort around that."
}