{
    "symbol": "VIST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 21:08:04",
    "content": " Oil production was up 70% year-over-year, boosted by a solid well performance in Bajada del Palo Oeste and especially in our two-well pilot in Bajada del Palo Este. Total revenue in Q2 2022 were $294.3 million, a 78% increase compared to Q2 2021, driven by higher production and stronger realized oil prices. Our production growth kept us with the strong realization prices and continued focus on efficiency has driven up adjusted EBITDA to $202.1 million for the quarter, doubling year-over-year and implying a solid adjusted EBITDA margin of 69%. With 47 wells tie-in today, producing an average 5% above our type curve, we continue to see solid performance in our core development in Bajada del Palo Oeste. Total revenues in Q2 2022 were $294.3 million, a 78% increase year-over-year, driven by oil production growth and substantial improvement in realized oil prices. We expect the production grow in the second semester to continue dilutive fixed cost, allowing us to deliver the total lifting cost of $7.5 per boe for the full-year in line with our guidance. Cash flow used in investing activities was $102.9 million, mostly driven by the drilling and completion activities in our two development projects, Bajada del Palo Oeste and Aguada Federal, which accounted for approximately $100 million. Your line is open. Thank you very much. Your line is open. Your line is open. Thank you very much. And the other thing that has not mentioned that complete the program is in Q1, which we drill two wells in Bajada del Palo Este and we have two additional wells to drill in Bajada del Palo Este in the second half of the year. Thank you very much. Your line is open. We are connecting Aguada Federal with Bajada del Palo Oeste, that is giving us additional flexibility thatâ\u0080\u0099s why we are adding more wells in Aguada Federal and of course, we will be ahead of doing whatever we have to do to develop both Aguada Federal and Bajada del Palo Oeste by the way that it give us a very good surprise since the well that we drill there has confirmed that the Western side of our â\u0080\u0093 our Eastern side of Bajada del Palo Oeste is good. Your line is open. Thank you very much. Thank you very much. Your line is open."
}