{
    "symbol": "VIST",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 17:42:04",
    "content": " Oil production was up 35% year-over-year, boosted by solid well performance in Bajada del Palo Oeste. Total revenues in Q1 2022 were $207.9 million, a 79% increase compared to Q1 2021, driven by the production increase and stronger realized prices. Capital expenditure for the quarter was $80.6 million, reflecting drilling activity in two pads and the completion of our first two wells in Bajada del Palo Oeste. During Q1 2022, we generated positive free cash flow of $33 million, driven by robust cash flow from operations. Production growth continues to be driven by our flagship development in Bajada del Palo Oeste, which now represents 70% of our total oil production. During Q1 2022, gas production increased 9% year-over-year, mainly driven by associated gas from Bajada del Palo Oeste. As shared with the market last week, we are excited with the successful results of our first two wells in Bajada del Palo Oeste, corresponding to pad number 11 next to our flagship development in Bajada del Palo Oeste. Lifting cost per boe was $7.8 up 3% year-over-year driven by the acquisition of Aguada Federal and Bandurria Norte and partially offset by the incremental production from Bajada del Palo Oeste, which continues to absorb our fixed cost base. However, driven by the cost saving in Aguada Federal and Bandurria Norte in combination with the incremental volume from Bajada del Palo Oeste we forecast a lifting cost of $7.5 per boe for the full year and this is in line with guidance. Adjusted EBITDA improved 9% sequentially even though it does not include operating income generated by the JV with Trafigura, which added approximately $4.5 million in Q4 2021. In Q1 2022, we tied in our first two wells in Bajada del Palo Este, which showed robust production levels. The 24 wells that we are going to tie in are two from Bajada del Palo Este, 16 from Bajada del Palo Este, four from Aguada Federal that are DUCs so these are wells that are already drilled that we are going to basically complete and tie in and two from Águila Mora."
}