{
    "symbol": "CWT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 21:28:09",
    "content": " Our general rate increases, this is the step rate increase in California and changes in the rates in other states, added $6.9 million, so that's a very positive element for the year and that is partially offset by changes in wages, depreciation, interest, and other operating and maintenance expenses that we would normally expect given the passage of time and inflation. And just as a reminder for Slide 14 and 15, we've made no changes to these slides and we wouldn't expect to make changes until we had a significant event coming out of California regulation or any new project that we announced and so you'll see Slide 14, the capital spending targets, shown there, those are relative to the California General Rate Case request, no changes, except for the update on the year-to-date figure, and the same with the rate base, that rate base is relative to the California General Rate Case request plus the rate base in our other states. I would say, Ben, in a lot of ways it's gotten worse and it's just the lead times that we're seeing to order, I can't capital inputs, but you know there -- it's pipes, it's valves, its fittings, we just finished the study internally and as we were pulling the report together over the last two weeks, the lead time for ductile iron went from eight to 12 weeks to 26 weeks, and so if you think about the number of capital projects that we do on an annual basis and the timeline to do design, permitting, and then procurement, that procurement piece what order -- pre-ordering going out that far out now, it has the real potential to slow us down a little bit. So when we do our rate case planning and look at where we're driving to for the next three, six, nine, 12-years, we try to take affordability under advisement, and I think that's really kind of paid off for us, because the last part of your question was, you're talking about customers who might be intervening in our rate case, and we have a couple of intervening parties in this current rate case, there are two cities and they've always kind of been involved, but they've been pretty silent the last couple of rate cases."
}