{
    "symbol": "RLMD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 09:39:09",
    "content": " During today's call, I will review our recently achieved milestones and provide an update on the anticipated time lines associated with the multiple expected clinical trial readouts from REL-1017, our lead product candidates that we are currently studying as a paradigm shift in novel treatment for patients with major depressive disorder or MDD. As I said earlier, we continue to anticipate the completion of enrollment in RELIANCE III, the ongoing monotherapy single-agent registration of Phase III trial with the last patient enrolled before the end of August, followed by the top line data readout shortly after the completion of the four weeks treatment. Your line is open. Thanks for taking my questions. Thanks for taking my questions. Your line is open. Your line is open. Thanks for taking my questions. Everybody is looking for new approaches to treat depression because everyone in the field understands that only so much remission is really truly achievable for so many patients and patients tend to -- maybe not the best term, but they do tend to grind through a lot of different treatments to try to get to the one that offers the benefit. But when I look back at where REL-1017 is, I just given particularly the Phase II data that I've had a chance to dig in on that data suggests that this drug has the opportunity to truly provide fast antidepressant relief to patients who they've been looking for that since the -- probably the second year of the SSRIs being on the market when everyone realized that it really did take a month or more to get any type of a benefit. So I think the prospects for our drug are very positive based upon that as long as the Phase III data comes close to what we've seen in Phase II, I think we've got a wonderful opportunity to really get patients into a much better situation. Your line is open. Your line is open. Your line is open. Thanks for taking my questions."
}