{
    "symbol": "RLMD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 11:27:01",
    "content": " And so from the sites, the raters, the -- looking at the profile of the patients that the safer interview that should support like patient selection that would exclude patients that are not affected by depression and to like, support, be sure that the patient, the compliance that the patient, say, the drug, there’s a little video that is uploaded every day, showing that the patient is taking the video, sorry, he is taking the tablet, reading a statement, free every madness  interview that the patient has to read the state that is half 50% chances to be on placebo upon that reduces the placebo effect. If the data in Phase 3 monotherapy will be even anywhere close to the Phase 2, then we do believe, I do believe we have a good chance, because you go against drugs that have an effect size about 0.3 and they work in about 30% to 40% of the patients take a month at least to show any efficacy and they are not exempt from side effects. Please proceed with your question. Please proceed with your question. So that’s one we feel comfortable -- confident that will show good results, right, based on Phase II and based on everything we have done to make the Phase III to be a high quality 2022 standard for depression. Please proceed with your question. So it’s -- right now, even if we won’t have the -- like the bandwidth and the capacity to go through a serious due diligence process with any potential partners, so I think we will postpone everything at least after the first Phase III readout. Please proceed with your question. Please proceed with your question. So REL-1017 should show in -- if it’s -- the patients start to take it early enough, takes it for long-term, could potentially -- and they use a conditional here because we don’t have the data, but based on the mechanism, could potentially improve the brain functionality, not only -- not to damage it. Please proceed with your question."
}