{
    "symbol": "LNC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 16:49:09",
    "content": " In addition, we separately incurred a $634 million GAAP goodwill impairment charge in our life business, primarily driven by variable universal life or VUL equity market impacts and the use of a higher discount rate. The remaining 25% of this year's projected RBC decline is attributable to a variety of factors, including higher capital allocation to fixed annuity sales and stable value offerings within our retirement business as well as the impact of group's pandemic claims and lower fees in our annuity business. However, this year's market movements, specifically the declines in equity markets and the increase in interest rates had negatively impacted both equity and bond fund returns, resulting in lower fees on assets under management and consequently reduced capital generation. Starting with the results of this year's assumption review, which in total reduced our earnings by $2.1 billion with $2 billion of that impact in adjusted operating income with the balance below the line. Turning to the Life business which had a negative impact of $2.2 billion, driven by 4 primary factors: First, rate increased settlements with 2 reinsurance partners in 2022, drove an unfavorable impact of $81 million. This year's expected 67-point drop is driven by a number of items of which 75% came from life insurance, including the expected fourth quarter statutory charge, smaller but continuing pandemic claims and negative cash flow generations. Not including the impact of the prior year quarter's $94 million legal expense notable item, G&A expenses net of amounts capitalized were up 11% and as we experienced a number of onetime expenses that added roughly $30 million to G&A in the quarter. Operating income, not including the impact of the annual assumption review was $232 million compared to $343 million in the prior year quarter. Adjusting for notable items in both periods, operating income declined 32% from the prior year quarter due to a 19% decrease in average separate account values and alternative investment results that were $18 million less favorable than the prior year period. In the prior year quarter, we reported operating income of $93 million, which included a $26 million net unfavorable impact from last year's annual assumption review and $19 million from a legal expense. Group Protection reported operating income of $37 million compared to an operating loss of $32 million in the prior year quarter, which included a $16 million net favorable impact from last year's annual assumption review. Excluding pandemic-related claims and the impact of last year's assumption review, the loss ratio improved 20 basis points year-over-year, driven by lower new group disability claims offset by slightly higher group life mortality. So in particular, when you think about all the levers that we can pull around our organic capital generation, and you all know that we have had strong capital generation in the past, and so the actions underway in particular, around the new business capital allocation, which is so critical, which will clearly support us immediately as well as some of the other solutions that we are looking at, for example, around our VUL portfolio and also what we're implementing as it relates to overall VA. We are also, as I mentioned in the script, focused on ways that potentially we can even further continue to make progress as it relates to some of the external potential capital generation options."
}