{
    "symbol": "LNC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 15:42:09",
    "content": " To this end, we have taken quick actions and made substantial progress in the last quarter to rebuild capital and our ongoing pace of capital generation, including raising $1 billion of preferred capital, further improving our new business capital efficiency, fully repositioning our VA hedge strategy, putting a partial tactical hedge on our VUL in-force, continuing to implement our Spark enterprise-wide expense initiative, enhancing the profitability of our group business and seeking to unlock the value of our in-force book. Across Retail Solutions and Workplace Solutions, we are focused on delivering a more capital-efficient product mix, which will continue to produce a robust level of sales, while requiring approximately $300 million less in new business capital this year. In addition, as we focus on improving profitability as well as future capital generation and earnings growth potential, we continue to make substantial progress in the implementation of Spark, our enterprise-wide expense initiative expected to contribute run rate savings of $260 million to $300 million by late 2024. As we focus on these capital and profitability improvement actions that will positively impact distributable earnings in 2023 and beyond, we are also experiencing headwinds, which we have discussed in the past, such as near-term capital market impacts, pressure on the life business and higher inflation driven expenses that Randy will discuss further. Retirement Plan Services reported operating income of $49 million compared to $57 million in the prior-year quarter, with the reduction primarily driven by the impact of lower equity markets on fees and alternative investment income, partly offset by higher spreads. Your line is open. And the other thing that I want to mention here is that in addition to the $300 million, and I highlighted this in my upfront comments, but I really want to stress that we've got the expectation of robust level of sales across all four businesses -- excuse me, with the expectation of freeing up $300 million in terms of capital efficiency. Your line is open. And then the other piece that I want to highlight, again, is that while we're going to see $300 million of capital efficiency improvement in '23, we're also expecting, as we go forward, to be able to see an improving contribution to distributable earnings of that sales mix that will continue to grow over time. Your line is open. One is we focused and highlighted today on the fact that we're rebuilding capital, we're improving ongoing capital generation, and to your point, we are making sure that we are also preserving and really investing in the future of the franchise, and that includes allocating a significant portion of our overall organic capital generation into that new business that will provide us with that profitable growth. Your line is open. I think inside of the amount of capital we expect to allocate to new business, which, as we mentioned, we expect to be $300 million lower next year, are a lot of actions, as Ellen mentioned, is more than just a flow reinsurance deal, including the mix of sales. Your line is open. Your line is open. Your line is open."
}