{
    "symbol": "TIPT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 10:43:22",
    "content": " Finally, our mortgage business produced positive returns in the first half, driven by mortgage servicing fees and value appreciation on our MSR asset, while volumes and margins have compressed in the beginning of 2022, over the past 2 years, the business has grown retained earnings substantially, and we now hold an MSR asset worth $41 million on our balance sheet. For the quarter, we incurred a net loss of $22 million, driven primarily by the previously mentioned tax expense, along with unrealized losses on investments as compared to gains in the prior year period, partially offset by growth in insurance and shipping. Book value per share of $10.75 increased by 2.7% compared to the prior quarter, primarily as a result of the gain on investment in Fortegra, which was partially offset by unrealized losses on our fixed income securities driven by the higher interest rate environment and the strengthening U.S. dollar. Adjusted net income increased to $40 million for the first half, representing a 42% growth rate over the past 3 years. Fortegraâ\u0080\u0099s capital and liquidity remained strong, with $325 million of stockholdersâ\u0080\u0099 equity, strong cash flow from operations and a debt capacity of nearly $200 million, all of which put the business in a solid position for future growth. Given elevated charter rates and strong demand for shipping assets, we believe the fair value of our remaining 2 vessels is in excess of our second quarter net book value of $34.5 million. Based on the transaction multiple of trailing 12 months adjusted net income implicit in Warburgâ\u0080\u0099s investment, Tiptreeâ\u0080\u0099s retained ownership of Fortegra on an as-converted basis represents approximately $744 million or $19.85 per diluted Tiptree share. Warburg is invested in a value that, as you state, conservatively implies that Tiptree shares are worth over $25 a share, yet your share price is â\u0080\u0093 remains, like Walter said, 40% of that fair value and your trading price isnâ\u0080\u0099t up much from when you pulled the IPO. Itâ\u0080\u0099s a lot of money, again, $25 million in corporate expense, where Fortegra is generating 90 â\u0080\u0093 maybe itâ\u0080\u0099s 100% of the â\u0080\u0093 actually 90% plus profit."
}