{
    "symbol": "KLAC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-27 19:15:08",
    "content": " Before summarizing KLA's results for calendar year 2021 and for the December quarter, I'd like to first acknowledge and thank the global KLA team, the dedication and hard work of our teams never wavered, despite challenging conditions, delivering for customers and managing around a complex global supply chain during a period of unprecedented industry shortages. KLA's strong results demonstrate our track record of relative strength and revenue growth and superior financial performance, compared with semiconductor industry peers in a dynamic and growing wafer fab equipment industry, as well as the long-term value created by employee and consistently refining our KLA operating model. To make this happen, KLA continues to prioritize and invest in R&D, which totaled $1 billion in calendar 2021, double the level of five years ago and growing at a 15% compound annual growth rate. With EPC, KLA is diversifying our market leadership with a portfolio of solutions addressing fast-growing new markets in the electronics value chain, including RF, specialty semiconductors, automotive, PCB, advanced packaging and display; fourth, service revenue grew 14% in 2021 to $1.8 billion and continues to sustain a growth rate above its long-term target of 9% to 11%. Given the rapid growth of the business over the last couple of years and our revenue expectations going forward, we expect the company's operating expenses to continue to grow as we invest in global infrastructure and systems to scale the KLA operating model, as well as new product development programs and volume dependent resources to support our business expansion. While operating expenses are modeled higher going forward as we will make the necessary investments to scale our business to support our long-term structural industry growth thesis, we will continue to size the company based on our target operating model, which delivers 40% to 50% incremental operating margin leverage on revenue growth over a normalized time horizon. Revenue for the Semiconductor Process Control segment, including its associated service business, was $2.05 billion, up 49% compared with the December 2020 quarter and up 15% sequentially. Given current expectations for growth in WFE and other electronics markets, we feel confident in our ability to grow throughout the year with total company revenue growth exceeding 20% and semiconductor process control systems revenue to outperform WFE growth again. To provide some color for the calendar year, given higher revenue volume, product mix expectations across our various segments offset by expected cost pressures within our supply chain, we are modeling gross margins to be approximately 63% for the year, plus or minus 50 basis points. And as we look at it and walk through what we expect to see moving forward, we think the March quarter sets up as the bottom, and we expect -- given the guidance we gave that we would see growth through the year and expect the company to be somewhere in excess of 20%, as we said in the prepared remarks. You’re right, as you look at the March quarter, what's declining is Semiconductor Process Control revenue quarter-to-quarter, we're actually expecting some growth in our EPC business and every quarter service grows."
}