{
    "symbol": "CTVA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 13:10:04",
    "content": " Volume growth in Crop Protection of 16% was driven by strength of new products, which delivered approximately $400 million of sales growth year-over-year, an increase of more than 60%. With the backdrop of our strong first half performance, weâ\u0080\u0099re raising our reported net sales guidance to be in the range of $17.2 billion to $17.5 billion for the year, representing 11% growth at the midpoint and includes an approximately 2% to 3% currency headwind. We now anticipate $500 million of year-over-year improvement in sales from our new Crop Protection products, an increase of $200 million over our original annual assumption driven by strong demand in every region. And as we focus on the second half of the year, we expect pricing and productivity to more than offset cost headwinds, which are driven by Crop Protection raw material costs, Seed commodity costs as well as freight and logistics. A lower share count driven by the $600 million of share repurchases completed in the first half of this year, coupled with strong operating earnings is driving an expected 17% increase in operating EPS year-over-year. We went out with a, I think, Iâ\u0080\u0099d say, a bold approach to pricing this past year, and we were able to deliver 7% globally and really 7% for each of our major craft categories in the first half, corn, soybeans and our oilseed products. And so, the new products plus the Spinosyns capacity as it comes on line over the next couple of years, what youâ\u0080\u0099re going to see from us is that weâ\u0080\u0099re going to continue to sell the higher margin differentiated type solutions to farmers, and that should -- continually to improve our business. And itâ\u0080\u0099s really, again, associated with an outcome of our portfolio reviews, our strategic review as well as looking at our overall cost structure and we think doing the right thing to set us up not only as you would suspect, for 2023 and as Chuck referenced, but really is taking a view over the, if you will, the midterm -- a multiyear midterm look at how to best position the Company going forward."
}