{
    "symbol": "CTVA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 12:41:08",
    "content": "  Operator: Good day, and welcome to the Corteva First Quarter 2022 Earnings Conference Call. Good morning, and welcome to Corteva’s first quarter 2022 earnings conference call. Additionally, Tim Glenn, Executive Vice President, Seed Business Unit; and Robert King, Executive Vice President, Crop Protection Business Unit will be part of the Q&A session. Further, the company continued to drive penetration of our leading pipeline with new crop protection product sales of approximately $480 million, a nearly 60% increase over prior year. This was led by products like the Enlist soybean system, which continues to gain traction in the market, given superior performance and grower confidence. Market demand is solid, evident by the strong position of our order book and growers are investing in their crop through top technology to maximize yield. We expect these trends to continue through out the year, given current commodity prices and the fact that productivity on the farm from top tier seed genetics in yield advantage Corteva products is the best way to manage inflation. Tim Glenn, who is an ag veteran with tremendous experience to capture the value of our market-leading seed franchise. And I'm excited to welcome Robert King to Corteva, given the experience he will bring to the crop protection business to maximize our operational effectiveness in growth potential. We expect record demand for grains and oil seeds in 2022, which we believe will keep commodity prices at elevated levels. Recent volatility has increased due to several factors surrounding production, including the impact on global food supply from Russia's war on Ukraine. Corteva recently announced our decision to exit Russian operations while also committing to donate commercial seed to countries affected by these issues to help ease food security risk, whether is another factor impacting production in key markets like Brazil and the U.S. Dry conditions in Brazil have led to yield and seed production impacts, which in turn impacts supply in that market and keep seed availability tight. Despite a slow start to the planting season in the U.S., which shifted some U.S. seed deliveries into the second quarter, farmers are very motivated to get the crop in the ground. As Chuck said, as you can see from the numbers, we've started the year strong. Crop protection volume growth was driven by strong early demand in North America and the strength of new products, which delivered approximately $180 million of sales growth year-over-year. In North America, organic sales were up 15% driven by crop protection on early demand for herbicides, including Enlist. Seed volumes were down versus prior year, primarily due to seasonal timing of U.S. Pioneer brand corn deliveries, both segments delivered notable pricing gains, a testament to the demand for our technology in our ability to price for higher input costs. In Europe, Middle East and Africa, organic sales increased 12% compared to prior year driven by strong price execution. Local pricing helped to mitigate currency impacts, which was a 13% headwind in the region due again to the Turkish lira and the euro. Demand remains high for new and differentiated products, including Arylex herbicide and Inatreq fungicide driving 6% crop protection volume growth year-over-year. Speaking of Ukraine, demand was strong in military free areas for both crop protection and seeds. Farmers continue to plant crops and per local estimates, we expect more than 70% of Ukraine’s spring crops will be planted. In Latin America, we delivered 26% organic growth with double digit volume and price gains. Pricing increased 12% compared to prior year driven by our price for value strategy, coupled with increases to offset rising input costs. Seed volumes increased 11% despite tight supply driven by Brazil safrinha, while crop protection volumes increased 16% on demand for new products, including Isoclast insecticide. Crop protection organic growth of 13% was led by continued demand for new and differentiated products, including Rinskor herbicide and Zorvec fungicide. First quarter operating EBITDA increased by $130 million to over $1 billion, as that previously covered strong customer demand drove broad-based organic growth with price and volume gains in all regions. On costs, we incurred approximately $200 million of market driven cost headwinds in the quarter driven by higher seed commodity costs, crop protection raw material costs as well as freight and logistics. The company realized $80 million in productivity savings in the quarter, which helped to partially offset this impact. Setting back, focused execution by the organization to meet increased customer demand and effectively managing cost headwinds through pricing and productivity resulted in almost 100 basis points of margin improvement for the quarter. Let’s go now to Slide 9, I’d like to expand a little bit more on what we’re observing in the current marketplace. Starting with our current planted area assumptions, we are aligned with USDA estimates for a 4 million acre reduction in corn, or approximately a 4% decline and a corresponding increase in soybean acreage. Additionally, on planted area assumptions, an important reminder, 1 million acre shift in the market from corn to soybeans in the U.S. represents an approximate $10 million earnings headwind to Corteva. And as Chuck mentioned, we’re closely monitoring the pace of planting given the slow start in the U.S. Inflation remains a challenge as we face pressure from rising costs in commodities, energy and raw materials, operational levers, such as pricing and productivity actions are key for us to keep pace with these higher costs. Looking at the second half of the year, the Brazilian real is our largest foreign currency exposure. And while we’ve largely hedged the BRL with a rate around 5.50, we do have some sensitivity to currency movements and would see a partial benefit from a strengthen BRL. Now, given this backdrop, let’s turn to the discussion regarding our outlook. As Chuck covered earlier, we’re affirming our full year revenue and earnings guidance for 2022. And as shared last quarter, we expect net sales for the year in the range of $16.7 billion to $17 billion. We remain on track to deliver between $2.8 billion and $3 billion, a 13% increase over prior year at the midpoint. For the first half, we expect mid single digit operating EBITDA growth given the disproportionate waiting of cost headwinds recognized in the first half. And lastly, we’re adjusting our operating EPS guidance to arrange of $2.35 per share to $2.55 per share, represents approximately 14% growth over prior year at the midpoint. First of course, market demand is strong and combined with solid execution, it’s led to a great start for Corteva, including impressive margin expansion in the quarter. Finally, the company has taken very important steps in its strategic roadmap to accelerate operational performance and drive continued operating EBITDA margin expansion. More to come on this, and we believe these strategies will further differentiate Corteva and position us to deliver increased value in years to come. And finally, on Slide 11, we’d like to provide an update about a significant upcoming event. We’re excited to announce that our 2022 Investor Day will be held on September 13 at our Global Business and R&D Center in Johnston, Iowa. The management team will provide updates on the company’s strategy, our financial framework, along with a special showcase on innovation in our pipeline. And then secondly, I’m assuming you’re looking for less corn and maybe more soy at this point, depending on what happens over the next couple of weeks. And then lastly, how should we think about the corn and seed pricing in the U.S. for 1H is what we saw in the first quarter, corn up 6% and soy looked like it was probably negative. So look, let me give you a couple opening comments and then I’ll turn it over to Tim to talk about your specifics around the split between Q1 and Q2, first half, second half. That is impacting our results when it comes to the seed business, certainly for quarter, because of some weather delays here in North America, but also in Europe. We did mention in the prepared remarks, we’ve got a strong – a very strong order book, and Tim can walk you through that. I just want to remind though, the group here though, that if you look at the longer-term value catalyst that we have, the Enlist seed platform is really performing very well beyond our expectations. We’ve got very good demand across the channel in that we are now selling it in North America, Latin America and Europe. So, obviously, as you mentioned and Chuck said, we’re out to a slower that we’d like in terms of the pace of planting across North America, really and it’s wet, cool conditions that have driven that. And so whether they’re going to plant corn, whether they’re going to plant soybeans, whether they’re going to plant cotton, there’s a strong incentive for them to, to get that crop in the ground. And at this point in time, we’re not seeing a switch between corn and soy in terms of farmers switching the crop they intend to plant. And so I think as the weather starts to open up here, we’re going to see huge push forward in terms of planting activity. And so from that standpoint, what we’re doing is we’re staying close to our customers, helping them navigate the decisions that they’re facing in the marketplace, so that they can make the best choice for their operations and we’re there to help meet their needs. In terms of pricing, we did have a strong start to the year, both globally and within North America. And in the first quarter we saw global seed prices up around 8%, corn around 8% and actually global soy was around 6%. And again, farmers have been motivated to plant the best products they possibly can, high performing hybrids in the case of seed. And clearly, I would also emphasize, we’ve got a long disciplined approach for managing price with our customers. In terms of seed margins, what we’ve seen is clearly some margin compression on the seed side. In terms of those headwinds first, we had a higher than expected currency primarily out of Europe about $90 million at the EBITDA level on seed. And I guess, I’d pass it over to Dave and anything you want to add in terms of that equity holding. But Vincent for your benefit and everybody, it’s over 200 basis points when you do the walk. So regarding the equity investment, we had a loss in the quarter of mark-to-market on a – this compares to first quarter of 2021 that represented an impact of almost $30 million or as Tim said about 100 basis points. Chuck and Dave, I think you guided Q2 being a little bit below consensus, referring the full year. And I think Corteva has had a real solid start to the year and demand, we are expecting to continue to be strong through the remainder of this year and well into 2023. The other thing we like is the execution of the overall business is now – our execution has been steady despite the supply chain challenges, the cost pressures we’ve outlined. We’re sitting here in the early days of May, the season’s a little later than last year. I think probably the starting point is what we shared on the call, which is consistent with what we originally provided by way of the 2022 guide, which is given the – call it the slope of the cost curve over the course of 2021. What we’re seeing is that those costs ramped and particularly by the way into the second quarter of this year, we see that ramping, accelerating a bit and that’s built into our guides. So on a year-over-year basis, we see the first half revenue, like we said, high single digits growth, but EBITDA more in the range of mid single digits growth. Again, that’s consistent with the guide that we’ve provided to you – provided to you previously. And that relationship is again, just related to the comps in terms of the period over period, or year-over-year change, particularly on the cost curve that we’ve seen. And that’s again, reflective of what we see and anticipate in terms of ongoing inflation and pricing to offset those cost impacts. And despite those inflation headwinds, we anticipate to be in that range again, that we guided to in terms of the full year EBITDA. No, I think Dave you’re right. Clearly there’s strong incentive for continued growth in the soy area in Brazil, and we expect that possibly at the expense of first crop corn, but we expect that second crop corn, which is the largest market and most important market in Brazil right now to grow nicely as we go into the 2023 cycle. When you take a step back on your CP business and you look at the growth of – some of the higher margin, newer products, Arylex, Rinskor, Zorvec so on and so forth. Yes, I’ll have Robert comment on the specifics and we’re very pleased with the trajectory that we’re on, so maybe just the few high level comments. And it’s really from customer demand really asking around the latest technology, the new products to drive productivity on the farm. And with that, they’re going to need technology. And our pipeline, as we’ve talked about is growing quite rapidly with our new products. And so when we look at it, we think what’s happening in our business is you’re starting to see and it’s early days, but you’re starting to see the impact of our new product portfolio on our bottom line. And so you’ll start to see the impact of that incremental capacity and of course, margin that will follow with it late this year and into 2023. So we like the setup in the portfolio for the CP business, and that’s what I think you’re starting to see in the results. Now when you think about the inflationary response and how we manage price, but I’d also say productivity in that business. Just getting started overall, we do see high demand strength across the board for our technology. Supply chain held up – this quarter held up very well, actually, moving more than 18% of volume on a year-over-year basis. As we look into – as we continue to look forward and for the first quarter, pricing gains across the regions really reflect our ability to use price and productivity to offset higher costs. But nevertheless, can you provide some thoughts on three bridge items your productivity goal, your net foreign exchange as it’s tracking today, and then the cost headwinds that you foresee in both seeding crop protection for the year. I mentioned that just a little bit earlier, it’s sort of embedded in what we’ve assumed in our guide. I think the most important thing is the fact that that we see inflation continuing, and that impact is going to be particularly felt in terms of our costs. So that $16.7 billion closer to the $17 billion in terms of the full year outlook, it’s really based on inflation and then pricing. So, that’s really sort of fundamental. So if you looked at that EBITDA bridge, it’s really those two items that are increased on a prior guide to now update here at the end of the first quarter. If you look at the total Corteva, as you know, it was about 225 basis points of impact in the first quarter. One is just, again, the comparables compared to the prior period, which get a little bit easier on the currency side. Number one, again and Robert emphasized this and his response to the earlier question is that we are – because of our advantage technologies, we are able to price against the costs that we’re seeing in the marketplace. That’s very, very important. And we expect, again, those costs headwinds to continue over the course of the year. The reality is, you’ll see this in the financial backup to our earnings release, the SG&A, we’ve been able to hold flat on a period over period basis, which is I think quite impressive. We’re also managing if you will, the below the line to support costs as we look over the course of 2022. And by the way, something that we think is also going to serve us well, as we set up for 2023. So in terms of COGS, obviously price is one of the most important factors that impact seed COGS. And it's not as simple as saying the commodity prices were X and now they're Y and extrapolating that because there are a number of factors, including the hedging approach that we have that have an impact on that. And obviously, we're in the same situation as farmers in terms of wanting to get that in the ground. And finally, we're developing our market offer in terms of price and programs and so very way too preliminary to get into the specifics around that. And so we have products that growers want and we have strong execution in the field and we know that our – the levers – the key levers that we have to deal with those escalating commodity prices, clearly productivity is a big part of that. We're confident that as we go into 2023, we will be able to cover our cost headwinds in terms of commodity, either through productivity or pricing, and that it will be accretive to our underlying margins for seed. When you look at our portfolio and what we're doing, you're beginning to see the new products starting to show up in the marketplace. So in terms of what would we see moving forward, we're working heavily on the robust pipeline to continue to move this forward. So overall, we're going to continue to balance this thing moving forward with price and productivity for the rest of the year in the crop protection area. No, I think just to build off that Robert, I mean, clearly we got a very strong preference for customers, again, the products that are going to make them money and we always have a strong mix, it's on the premium side and I think that's reinforced here. The other element that we're looking at as we go into 2023 is, what's the mix of crops that are going to be planted as well. And we would anticipate that that'll continue to shift as we go into 2023 and will be somewhat dependent upon what ultimately gets planted in 2022, but also what's produced in other parts of the world. And as you sit here today, you would say that the mix for 2023 is maybe favoring corn a little bit more than what we saw as we came into 2022. Really, if you look at crop commodity prices, what it's telling us is that the world needs to produce more food. And so, there seems to be a shift underway to take the top technology in terms of genetics and traits for seed. In fact, if you look at the U.S. farmers, the predictions are that this year would be a record revenue year for U.S. farmers. So there's high motivation as Tim mentioned to get that crop in the ground and then to protect and grow that crop and I think what you're going to see that, that we're very well positioned as an integrated company to catalyze it on that trend, but also to help farmers drive productivity sustainably. Chuck, maybe just one other thing, Robert, maybe just one other thing and then sort of embedded in our responses, part of the question obviously had to do with the cost and over time inflation outlook, our expectation when you look at the leading indicators, all of those are pointing to continued inflation. And we're seeing that in terms of delivery, in terms of the results that we're achieving as well, particularly when you think about all the geopolitical pressure and other things are going on in the world. Yes, would like to drill into seeds a little bit more here. So in terms of mix of products, what I would say is the price level we're capturing is very similar to we would have taken to the marketplace in terms of our price card movement as we came into the year. And I would say generally not, you have these modest shifts on a year-to-year basis in terms of our trait mix, question on genetics, absolutely farmers are always looking to plant new and better genetics. And so typically think about our turnover every year in our lineup, we have 20% to 25% of our seed lineup would be new and improved genetics. And as Chuck said, as Dave said, that productivity that farmers are striving for in their operations, largely that's going to come from those new and improved genetics. So I'd say that is clearly something we're seeing this year, but we see that every year, just because it's that pursuit of that next level of productivity. So it is a great start to the year, I think very consistent what we expected. And we were able to capture the value and feel very good about where we sit there, in terms of Europe specifically on the price side, very limited seed in EMEA would be transgenic, very small amount in Spain would be transgenic. I would tell you to some extent, Europe is a little bit impacted because the Turkish Lira and so you're getting a little bit more pricing there because we're aggressively pricing that severe devaluation that we faced in Turkey and so that's skewing the numbers in Europe a little bit there, but the same approach to capturing value for our high performing genetics is very good. And we feel good as we roll out of North America and move into the rest of the world for the rest of 2022, that we're going to continue to see that caught mid single-digit, good, strong mid single-digit growth on seed throughout the year. And I would say as we sit here today, again, with a relatively small amount of the crop planted, we're holding to that original guide around at least 40% of the U.S. soy acres will be planted with an Enlist E3 variety. So that holds steady and why we can't update that right now is we only have so much visibility to what the 100 licensees are in the marketplace, what they're ultimately selling, and we'll have a much better understanding of what ultimately when in the ground is we get past the midyear and after the planting season. We're over 80% treated with the Enlist herbicide, so really high utilization. And we can confidently say, when you look at the seed adoption, as well as utilization of the chemistry, it's become a very trusted option for growers and growers see it as a go-to option. Your question around genetics and where we're headed here, I mean, this is going to be a really important season for us and we're going to be doing extensive demonstration trials of a new class of Corteva developed E3 varieties that we anticipate ramping up for 2023. So the question is – your point is when are you going to see it, I think you're going to start to see that in terms of demonstration in 2023 or 2022 in the field in anticipation of a significant move in 2023. And again, once we get through the planning season, we'll be in a better position to update that 40% number for planting of E3 seed, but feel very comfortable that, that we'll be at least at that level and again, at that high utilization on the chemistry system. I mean, in the market more generally, we're seeing fragmentation sort of where certain products are up, like very significantly and others more modestly in the normal kind of mid single-digit range. As you look at where we are, and as we're moving forward here, we're in improvement process, our new products are starting to show up. We just talked about quite a bit and this mix is helping us not only with the farm productivity, but with the value that you're seeing and it's getting pulled forward. So their mix would be a little bit different, but we've got new products coming on like the Spinosyns we talked about earlier. And since last conference call, you guys have made the move to one single headquarter in Indianapolis, you've spoken about the new organizational structure and also mentioned that optimizing the costs – support costs and so forth. So the work that we're focused on right now is really, we're going to provide a little bit more clarity in September on the strategic direction, but I'd say it's tweaking. So that effort is well underway right now, we're looking at the global portfolio, we're looking at where we operate around the world and we're trying to make the decisions on how do we enhance performance and drive speed of business. And by the time, we get to the September Investor and Innovation session that we're planning, we'll be able to give you at least a view on the operational and financial journey that we believe the company will be on. So this isn't about all of a sudden Pioneer's going to be in the game with Enlist 3, our overall reach in the soy market with our brands is somewhere in the – call it in the mid-30s would be what our brand share is. So clearly, we've got a strong reach in the marketplace with our owned seed brands and we've got over 100 licensees that are in the marketplace selling Enlist E3. So it's a material move and as we ramp up our proprietary genetics, it's going to have a strong impact, not just in terms of I think the performance of our products and the experience that our customers receive but it's also going to have a very positive impact on our financial performance as well."
}