{
    "symbol": "EA",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-01 19:31:06",
    "content": " We expect that we will grow but we also want to be very thoughtful, focused and deliberate as we move through this environment because if it gets really bad, I don't think anybody is immune, but I think what we've demonstrated is that we're unbelievably resilient and why we're focused on building incredible games and driving deep engagement with our community, which so far is working really, really well for us. And as we think now about -- even if we go back as far as creating things in The Sims and only in Battlefield moment and sharing highlights from FIFA, and now the ability for players to come in and move things around in the world as a first step, create new things and put them into the world as a second step and really create new aspects of these worlds as a third step what we see again is that more than half of our community engages in player-created content. And while that's a relatively small investment for us today, it does represent a pretty significant upside to the expansion of what we're able to do with our global network of players and fans around the world over the course of the next 3 to 5 years. So you shouldn't expect some giant new incremental spend, but you should expect us to continue to move investment around our company and where we feel like there are really big upside opportunities in the area of global online communities, in the area of interactive storytelling, in the area of hiring the power of our network beyond the bounds of a traditional gaming experience and where we believe that we have very strong likelihood of success and growth, we will invest behind those things. As you then think about what our teams do in the context of innovation and creativity in modes, and this is our biggest FIFA yet and we're delivering across all of the key leagues and teams and competitions in the world, and we're doing it at incredibly high quality, and we're really working closely with our fan base to understand how they want to experience interactive football through our game around the content that they love the most. And for other franchises like Skate, and certainly, as we think about the future of Sims, it's how do we hold on to all of the goodness of the existing franchise and layer in new modalities and extensions of how you play these games for a growing and changing and evolving diverse community around the world."
}