{
    "symbol": "EA",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-31 21:06:03",
    "content": " Second is, the game while it really engaged the core deeply, and it actually attracted a lot of new users, which we think speaks volumes for the future success potential of the franchise, it didn't retain the more casual user at the rate that we needed it to, and in a game that relies a lot on team play and competitive play, liquidity of the overall player base is really, really important as you think about the future experience of players over time. We need to be thoughtful about the nature of the core game mechanics and the retention mechanics that we build into the game over time, and most importantly, as we look at the mobile market, the biggest new launches that are seeing the most success are the ones that are deeply connected to the broader franchise, where there's not always cross play, but it's certainly cross progression and a feeling that they are part of a single unified community and a single unified game experience. And certainly as we had those learning from Apex Mobile and we were developing into Battlefield Mobile, we anticipated that while Battlefield had also been in development for some time and was making good progress, given the construct of that game, it also was probably going to run with some of the same challenges, and rather than continue to push against that, we wanted to come back, take a breath, reset and really think about the broader franchise strategy and allow the leadership to build a true cross platform immersive game experience around a reimagined battlefield in the future. While it might be â\u0080\u0093 it might make sense to kind of draw a broader narrative, I think for us as we look at it, we launched a number of titles in Q3 and Q4 certainly with Dead Space and Need For Speed and NHL some of our smaller titles, and FIFA and Madden, we've launched an incredible amount of titles on time and at tremendous high quality. It was the incredible titles that our teams launched, and certainly with what we did in the core FIFA franchise was our biggest and most innovative FIFA yet, with all that we did in and around FIFA Mobile, which was up triple digits, and all the new event content we put into FIFA online and how we really tied that community together into a global football ecosystem, you know interwoven into the fabric of football fandom, that's a really important part of growth. In terms of the FIFA math associated with the license fees, you know the way that I would encourage you to think about it is that, in FY â\u0080\u009924, it's such an important transition year for what is, our biggest franchise, and our focus is really about making sure that we build the greatest experience in terms of bringing the players along with us in the journey. As we've discussed our strategy and how we are thinking about the future, itâ\u0080\u0099s really around how the mobile platform can contribute to the overall connected ecosystems of franchises and what we're seeing, as in Andrew mentioned, as players play on the go, as Gen Z and Gen Alpha market, you know addressable market expands as every year goes by, itâ\u0080\u0099s going to be very important for us to show up on the right platforms for the right moments and right experiences. And that's how we're really looking at the incredible assets that we have around casual creator games for our Sims products, our sports games and really dial that up to connect into the ecosystems, because they can be a meaningful contributor of new players, engagement and connection into a high def experience. But as I talked about, in particular the things that led to the our performance in Q3 and the extension of that into Q4 were specifically related to high quality launches and the pattern I would say of recognition of what we would expect in terms of return, versus launches of that caliber, and that was very specific to the titles that launched on those dates in the quarter, as well as just the macro, I would say market gravity that we saw across smaller titles throughout the quarter."
}