{
    "symbol": "CTO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 13:53:05",
    "content": " Overall, if we take a step back and look at how our portfolio has evolved since the beginning of the year, we've been able to trade out of office and single-tenant assets and reinvest into properties anchored by tenants such as Whole Foods, HomeGoods, Publix REI, Raw Stretch for Less  and Best Buy, while further diversifying our overall tenant exposure and giving our portfolio more long-term upside through lease-up of acquired vacancy and retenanting units that currently have below market rents as they become available. From a leasing perspective, we signed 7 new leases in the quarter, totaling 43,000 square feet at an annual average rent of over $36 per square foot, more than half of those lease square footage is for existing vacancy acquired when we purchased the property and the largest of the new lease something that's our property in Winter Park, Florida, where we now lease the entire top floor. As a result, we adjusted net income per share and NAREIT defined FFO per share, to remove the interest expense associated with our convertible notes and we added approximately $3.1 million shares to our diluted weighted average share count, to reflect the impact of our convertible notes, as if they were converted at the current conversion ratio, as of the end of the third quarter. As we previously discussed, in July, we completed our 3-for-1 stock split effective July 1, within the quarter we issued approximately 566,000 shares of common stock through our ATM program, for total net proceeds of $12.3 million, at an average issuance price of $22.02 per share. Your line is now open. And one moment for our next question. Your line is now open. And one moment for our next question. Your line is now open. And one moment for our next question. Your line is now open. And one moment for our next question. Your line is now open. And one moment for our next question. Your line is now open."
}