{
    "symbol": "LEVI",
    "quarter": 1,
    "year": 2023,
    "date": "2023-04-06 13:27:10",
    "content": " In our direct-to-consumer business, growth accelerated to 16% in constant currency, with record DTC sales, representing 42% of global revenues, three points ahead of last year. Beginning with the Levi's brand, we grew market share again this quarter, achieving share leadership in the U.S. amongst the key 18- to 30-year old target consumer group, and we continue to grow share in women's denim bottoms closing the gap to the number one position. Q1 net revenues were up 25% on top of 50% growth last year and revenues for the 501 this year are expected to reach close to $800 million, which is nearly 70% higher than pre-pandemic on a reported basis. Our global DTC business delivered a record quarter, up 16% versus a year ago, driven by positive comp sales and traffic growth across brick-and-mortar mainline and outlet stores in all geographic segments as well as e-commerce. As a result, our U.S. wholesale business grew low single digits on top of last year's strong 25% growth. Our tops business grew 4%, following 16% growth last year with strong performance in our DTC channel, up 12% for both women and men. Our direct-to-consumer channel sequentially accelerated with net revenues up 16%, driven by broad-based positive comp sales growth on top of extremely strong first quarter comp sales last year, driven by higher traffic, and higher volumes across geographies, including in the U.S. and Europe. Adjusted reported gross margin was 55.8%, 360 basis points below last year's record 59.4% and but 120 basis points ahead of 2019 pre-pandemic levels. Adjusted SG&A expenses in the quarter was $757 million, up 7% from last year, driven primarily by a four-wall investment in support of the higher DTC sales and A&P investment to support our 501 marketing campaign for which the spend is skewed to the first half of the year. As a result for the year, we expect nearly 60% of Levi's brand revenue coming from international and DTC as a mix of our total business in the mid 40% range. As I mentioned last quarter, we continue to expect '23 to be a tale of two halves, with the first half weaker and the second half considerably stronger given a number of factors including the year, we are lapping promotional levels, record cotton prices impacting COGS in H1 and supply chain disruptions progressively getting better. Q2 gross margin is expected to meaningfully improve versus Q1 as a result of a higher contribution from DTC, but will be down slightly to last year's and we continue to expect SG&A to be up mid-single digits relative to a year ago. In respect to the full year, given the higher levels of promotion than we previously anticipated, we now expect full year gross margin to be down approximately 50 basis points versus prior year's 57.5%. So as you think about the year, annual expectation on gross margin, I think we're going to be about relative to last guidance about 70 basis points down at the end of the year and that's largely driven by higher promotion levels, which we expect offset by better channel mix. So that's why we think there is progression in gross margin getting us back to slightly over 57% as we close the year, plus I think the promotional environment gets better."
}