{
    "symbol": "NX",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-10 14:06:02",
    "content": " On a consolidated basis, we generated net sales of $261.9 million during the first quarter of 2023, which represents a decrease of 1.9% compared to $267 million during the first quarter of 2022. Net income decreased to $1.9 million or $0.06 per diluted share for the three months ended January 31, 2023, compared to $11.2 million or $0.34 per diluted share for the three months ended January 31, 2022. After adjusting for one-time transaction and advisory fees, net income decreased to $6.1 million or $0.18 per diluted share for the quarter compared to $11.3 million or $0.34 per diluted share for the same period of last year. On an adjusted basis, EBITDA for the quarter decreased to $20.5 million, compared to $24.4 million during the same period of last year. Now for results by operating segment, we generated net sales of $153 million in our North American Fenestration segment for the first quarter of 2023, which represents growth of 4.3% compared to the first quarter of 2022. We generated net sales of $54.7 million in our North American Cabinet Components segment in Q1 of 2023, which was 12.3% lower than prior year. Our European Fenestration segment generated revenue of $55 million in the first quarter, which represents a decrease of 6.7% year-over-year. Cash provided by operating activities improved significantly to $3.1 million for the first quarter of 2023, compared to negative $21.7 million for the first quarter of 2022. Guidance and modeling assumptions for fiscal 2023 are as follows: Net sales of $1.12 billion to $1.16 billion, adjusted EBITDA of $130 million to $142 million, depreciation and amortization of approximately $42 million to $43 million; SG&A of $120 million to $125 million, interest expense of $8 million to $8.5 million a tax rate of 25%; CapEx of $30 million to $35 million and free cash flow of $50 million to $55 million. By segment for the second quarter of this year compared to the first quarter of this year, we expect revenue to be up 3% to 5% in our North American Fenestration segment, down 6% to 7% in our North American Cabinet Components segment and up 12% to 14% in our European Fenestration segment."
}