{
    "symbol": "SO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 17:23:08",
    "content": " At this time, I would like to welcome everyone to The Southern Company Second Quarter 2022 Earnings Call. I would now like to turn the call over to Mr. Scott Gammill, Investor Relations Director. Good afternoon, and welcome to Southern Company's Second Quarter 2022 Earnings Call. Joining me today are Tom Fanning, Chairman, President and Chief Executive Officer of Southern Company; and Dan Tucker, Chief Financial Officer. Let me remind you, we'll be making forward-looking statements today in addition to providing historical information. Various important factors could cause actual results to differ materially from those indicated in the forward-looking statements, including those discussed in the Form 10-K, Form 10-Qs and subsequent filings. In addition, we'll present non-GAAP financial information on this call. Reconciliations to the applicable GAAP measure are included in the financial information we released this morning as well as the slides for this conference call, which are both available on our Investor Relations website at investor.southerncompany.com. At this time, I'll turn the call over to Tom Fanning. Good afternoon, and thank you for joining us today. As you can see from the materials we released this morning, we reported strong adjusted earnings results for the second quarter, meaningfully ahead of the estimate provided last quarter. The economies within our Southeast service territories remain strong, and we believe we are well positioned to achieve our financial objectives for 2022. Before turning the call over to Dan for a more detailed look at our financial performance, I'd first like to provide an update on the recent progress at Plant Vogtle units 3 and 4. The projected completion timeline forecast for both units remains within the ranges we provided the last 2 quarters, although at the end of those ranges. At Unit 3, we continue to progress with all necessary systems turned over from construction to testing, all inspection records related to ITAACs complete and then submittal of 51 ITAACs since our last earnings call, including 2, which were just filed this morning. Concurrent with our final ITAACs submittals, we plan to submit the all ITAAC complete letter to the NRC for Unit 3. This submittal should position us for receipt of the historic 103G finding from the NRC a few weeks later, documenting that license acceptance criteria for Unit 3 have been met. Upon receipt of the 103G finding from the NRC, no further NRC findings are necessary for Southern Nuclear to load fuel or begin the startup up sequence. Receiving the 13G letter is an important milestone, but there's still more work to do before we load fuel. In the weeks ahead, we will be focusing on testing and surveillance, demobilization, finishing work and documentation. To support an in-service date at the end of the first quarter of 2023, we will need to complete this work and load fuel by the end of October. Electrical production, in particular, electrical terminations continues to be a key area of focus. We continue to add resources on site for this work, and we have a plan for transitioning electrical field engineers from Unit 3 as we continue our focus on increasing productivity and ensuring first quality first times to support the upcoming testing and long-term operations. Timely Unit 3 fuel load and start-up, along with a sustained improvement in Unit 4 electrical production over the next several months is necessary to support our December 2023 in-service objective. At the end of the second quarter, Georgia Power recorded an after-tax charge of $39 million, including replenishment of contingency and estimated incremental co-owner sharing impacts. Dan, I'll turn the call over to you. Thanks, Tom, and good afternoon, everyone. As Tom mentioned, we had a very strong quarter, with adjusted earnings of $1.07 per share, $0.23 higher than last year and $0.27 above our estimate. The primary drivers for the increases compared to last year and our estimate are higher revenues associated with higher usage, changes in rates and pricing and warmer-than-normal weather at our regulated electric utilities. These revenue effects were partially offset by higher interest expense and depreciation, along with higher nonfuel O&M, consistent with the rising cost environment and our long-term commitments to reliability and resilience. In the second quarter 2022, weather-normal retail sales were 2.3% higher than the second quarter of 2021. This increase reflects stronger sales across all 3 customer classes, as we continue to see expansion across our Southeast electric service territories. We also continue to see robust customer growth with the addition of 12,000 residential electric customers and 7,000 residential gas customers during the quarter. We remain encouraged by these trends and are continuing to monitor the potential impacts of supply chain constraints, labor force participation and inflation pressures on our outlook. Economic development within our service territories remains robust, with Alabama seeing a 10-year high in jobs and capital investment announcements during the quarter, led by announcements from Hyundai, Novelis and Airbus. Additionally, recent electric vehicle plant announcements in Georgia from Hyundai and Rivian represent the largest economic development projects in the state's history. These 2 projects alone are expected to create nearly 16,000 jobs and over $10 billion of capital investment across the state. As we highlighted last quarter, the Port of Savannah continues to show strength, with the container volume growth seen during the first quarter accelerating in the second quarter as a result of U.S. consumer demand and the diversion of vessels from other ports driving record cargo levels in June. We remain encouraged by the level of economic development within our service territories, and we continue to partner with each of our states to attract new businesses. With our solid adjusted results through the first half of the year, we are well positioned as we head into the peak electric-load season. And consistent with historical practice, we will address earnings for the year relative to our EPS guidance after the third quarter. Before turning the call back over to Tom, I would like to briefly highlight Georgia Power's 2022 Integrated Resource Plan, or IRP, which was unanimously approved by the Georgia Public Service Commission last week. Recall, Georgia Power files an IRP every 3 years, outlining the company's plan to continue delivering clean, safe, reliable and affordable energy to its 2.7 million customers over the next several decades. The approved plan includes the addition of 2,300 megawatts of new renewable resources as part of Georgia Power's long-term plan to double its renewable generation by adding an additional 6,000 megawatts by 2035. The plan also approves the addition of over 750 megawatts of battery energy storage projects, the retirement of over 1,500 megawatts of coal by 2028, and the continuation of existing grid investment in ash pond closure programs. Additionally, the approved IRP continues Georgia Power's hydro modernization program and authorizes initiating a license renewal application for Plant Hatch, each of which will extend the lives of these important carbon-free energy resources for the benefit of customers. Tom, I'll now turn the call back to you. For more than 5 decades, Southern Company's world-class research and development organization has remained at the forefront of innovation to build the future of energy today. Last month, Georgia Power and Mitsubishi Power, along with the Electric Power Research Institute, successfully blended 20% hydrogen fuel at Georgia Power's Plant, McDonagh, representing the world's largest hydrogen fuel blending demonstration project to date on an advanced-class gas turbine. Additionally, in Alabama, Southern Company continues to manage the National Carbon Capture Center for the Department of Energy, which recently surpassed 128,000 hours of testing, and has expanded its focus on advancing carbon capture for natural gas-powered generation, carbon utilization and technology-enhanced solutions such as direct air capture. In fact, a low-carbon concrete technology developed by Carbon XPRIZE winner, UCLA and CarbonBuilt, recently achieved its first commercialization deal bolstered by successful testing at the center. In closing, I'd like to take a moment to highlight Southern Company's generating fleet and power delivery system, which performed exceedingly well through June's extremely hot weather. During what was the second hottest June in 50 years, we were able to maintain sufficient generating capacity reserves across daily peaks, including 6 days, which peaked over 40,000 megawatts, and an all-time peak load of 41,376 megawatts on June 15. Delivering these results requires effective long-term planning that is best facilitated in a vertically integrated, state-regulated markets, coupled with real-time coordination between our plants and our system operators. And I'd be remiss if I didn't recognize the performance of our covered workers who, once again, performed during these times of duress in an exemplary manner. Operator, we're now ready to take questions. So just got two quick ones for you, Tom. Just on the IRP, obviously, a decision on the Bowen plant was pushed out to $25 million do you sort of think is kind of the most viable pathway forward there at 1,800 megawatts, it's sizable. I think the beauty of how we work with the commission and the staff and, frankly, all of our stakeholders is something that allows us to respond to the kind of exogenous factors that really impact us from a tactical standpoint. Obviously, fuel markets have changed, inflation has changed, supply chains have changed. One, is to think about keeping generation in the northern part of our state. Were we to continue to shut down those units, you would need to think about replacement. Obviously, gas is an option North. As you know, our big answer on renewables across the system is most likely solar, not wind, just we don't have the climate to do widespread wind. And maybe these tall turbines will come to fruition or not, who knows. So failing that, putting more solar in the south part of the state with a much better terrain does make sense. In order to locate more generation in the state in order to balance the needs in the North, we'll need to build significant transmission. And then just lastly, on Vogtle with sort of 8 months left to hit your Unit 3 target, you have 4 ITAACs, the NRC letter, likely doesn't seem like it's a major hindrance and then you have fuel load expected in November. We're guiding you all to say that we feel comfortable within the range that we've laid out, I guess, 2 calls ago. We have 2 ITAACs remaining, not 4. And I believe we'll finish those in days, not weeks. Then we'll file concurrently for the letter requesting the 103G, letter to be issued by the NRC. We think the NRC has plenty of capability to handle that within their time frame, which I think is we've laid out at a max of 17 days. Really, I think the greater pacing factor to fuel load is now not ITAACs, it is the rest of the work we need to finish on our own to begin fuel load and then begin the initial operation of the plant. As I mentioned before, and Dan can help me here, too, there are 4 kind of big categories we're thinking about in terms of the scope of that work. And then the final one we've talked to you about is documentation, getting the paper right. Simple examples of some of those things, demobilization is taking down things like scaffolding, and taking any of the spare parts that we have laying around the site and moving those off so that, at the end of the day, the work rooms and everything within Unit 3 will meet nuclear standards in terms of operations. I think that's a great example of demobilization and scaffolding, temporary lighting is a similar example. Testing and surveillance activities and documentation, I think those are pretty obvious part of the finishing work, really gets to what Tom alluded to, but it's doing coatings, it is getting particularly containment to this pristine condition to get ready for fuel load. So it's those activities that, frankly, have a logical sequence to them, and it just takes time to work through. There's nothing unusual about the work ahead, we needed to finish the safety-related ITAAC, and now we finish that stuff. Look, the whole exciting transition we have here is moving this plant from transition to operations, and we have line of sight to that now. Tom, good to hear you. Any thoughts on you've been very right about this not happening, and now certainly, there's a chance that it might. And let's just kind of replay the cards as we've worked relentlessly on the hill, whether it's Congress or in the administration and, frankly, our stakeholder groups, environmental, et cetera, the deal physics were getting tough because we were entering this period of inflation. And so the idea of spending more money in light of inflation pressures, and I guess the latest announcement was 9% or so, is really something that is concerning. And so the way that you get to promote this kind of bill is to include within it, pay-fors that will offset whatever inflationary pressures may arise from the increased spending. And as you can see from the proposal right now, and let's leave it as a proposal, there's an additional, I don't know, $300 billion of pay-fors. So hopefully, it speaks to the need to not make this an additional log on the inflationary fire. But if you look at our numbers, and I leave this to Dan or whatever, who kind of did a nice summary in the script, we're not seeing any indicators of recession right now. But certainly, the historic numbers that bring us up to date for the quarter are way better than what we expected. Further, when you look at the data Dan referenced with respect to our headlights, if you will, our economic development activity, you're talking over 300% of job growth in the backlog, and you're talking nearly 700% of capital investment. And you're talking about things like Rivian and you're talking about more EV development, and you're talking about data centers. He does his economic roundtable, just got through with it. And maybe that's cautious in the first part of 2023, Dan, why don't you give us a burst on the roundtable. So just as a reminder for folks, we've done this for over a decade. And what we do a couple of times a year is bring in folks from regional universities, large financial institutions and then, frankly, a lot of representation from a cross sector -- or a cross-sector representation from our customer base. We had manufacturing companies, ones that get involved with housing. And to Tom's point, there was this backdrop of, yes, a recession is looming, but a very clear acknowledgment that what you may find yourself in is a place where there's very clear geographic or regional differences as you enter into that period and endure it. We're in terrific shape. But everything we see now every indication, and if you look at Slide 10 of our deck and how sales manifested during the quarter relative to what we expected. We're in terrific shape. And even those industrial results, Dan, included 2 pretty big plant closures, one Olin Chemical and the other one was...\n Resolute, a newspaper manufacturer that was in Georgia. And so absent those guys, , I mean, it would have been certainly higher than 3.7%. Now, I will say, we do see inflation and particularly in the food and energy markets, and that hurts our customers. I would argue that the Southeast, given our strong foundation, is going to be better able to weather this than many places else in the United States. I think the conclusion of the people that have come up with this legislation is also that this is an inflationary by its structure and the tax increases, which don't impact us very much, and I'll speak to some of the pieces of this legislation and how in respect Southern, probably aren't going to be enough to tip very further into recessionary territory. With respect to Southern, good having -- this looks really good. When you look at the energy security and climate change pieces of the legislation, the $369 billion or so, it's very helpful to us. To us, our favorite kind of renewable over the years, we call it one time, we were the largest owner of solar in the United States. And when you look at the Georgia IRP, solar plays an important part in our future. Here's the big thing, though. If I had to write a headline on all of those benefits, I would say that this is really beneficial to our customers and should reduce the cost of the transition from the fleet today to the net-zero long-term strategy in the future. The tax credits in there for purchase of electric vehicles, whether they're used or new. There're some other things in there for hydrogen, a variety of other things. I'll probably leave this for the guys in the boiler room after the call, but I am prepared, Steve, with examples that will show you that the difference between tax taxes and book taxes to us is almost nothing. A company as big as ours with $23 billion of revenue and all that other stuff, the difference is in taxes paid is just really small like 0.5% kind of as an estimate. It's almost you can't see it, $5 million, $10 million. Now of course, as that travels over time depends on a host of factors. No, I think we just see if Steve has any follow-ups. I don't know how involved she has been so far on the creation of this agreement, frankly, between Manchin and Schumer. In the house, let's not even put that in the wind column just yet because I know that a lot of the House Democrats have had a lot of, I don't know, requests, desires for a change in tax policy, including things like a surtax on the wealthy, including SALT relief, the state and local tax relief. So there's a lot on the Democrat side in the house that's not in this bill, that still has to be negotiated. And we'll get to our next question on the line from Julien Dumoulin-Smith, Bank of America. Julian, I don't think we expect anything in the near term there. I think, as this plays out, I wouldn't be surprised to move to business court in Georgia, and the resolution could be second half of '23. The one near-term data point, Julian, is there is an August 27 date by which we'll know whether MEAG plans to tender their portion is what we've heard from  and MEAG still needs to work through their process and let us send one way or the other. And then actually, -- let me ask you this. Yes, man, certainly, going to the PTC, certainly makes it more competitive, more attractive for our operating companies to own this stuff. And of course, Southern Power can compete for the new megawatts of particularly solar in the state. So on the margin, everything that we see in this potential settlement looks good for us. Like I say, I mean, with the administration, with any stakeholder, with Congress for months. I just think, on the margin, this is good stuff for us. And to be extra clear about this, the solar PTC sort of opens up the window of eligibility, especially given how punchy ITCs can be, not just for Southern Power, but more specifically here for Georgia Power. For all of our regulated utilities, they're always going to make the economic choice for customers and what the PTC does is make cell phone that much more economic. We're keeping our eye on that, and we think we have that spoken for. We measure our churn statistics virtually every day, report every week, and they're within our expectations right now. I think the interesting issue there will be, you may remember us talking a lot about attracting electricians. I think the more important point for us is as we wrap up work on 3, it frees people from 3 to move to 4. Those are necessary to achieve the ramp-up schedule that we expect to see, oh, I don't know, over the next 10 to 12 weeks or so. I think it's this idea of advancing on 3, freeing people up, moving those resources to 4 and increasing our productivity. Settlement is always an option, but, boy, we don't want to get in front of that horse. As you may remember, the official schedule calls for prudence to begin on fuel load for Unit 4. Yes, we could settle in advance of that, but I'm not going to front-run that issue here. Just wanted to touch on the guidance a little bit here, if I could. So look, as we always do, we'll narrow down our year-end expectations during the third quarter call. So we're going to take every opportunity we have to fix the roof while the sun is shining, if you will. And if you look at our history of O&M spending in the electric business, there's almost never such a thing as a normal year. And then conversely, in those years, that inevitably happen where weather or economic activity are below our expectations or even recently a pandemic, we have the flexibility to curtail in those years knowing what we've done in years prior to get ready. And the system remains in great shape to serve customers, and our financial results are a lot less volatile than they might have otherwise been. Additionally, and very importantly, many of our regulatory frameworks have backstops whereby better-than-expected results accrue to the benefits of our customers through the various rate or rebate mechanisms. So I would just say, stay tuned to the third quarter, but know that we're doing everything we can to improve and derisk future years. No, I mean just a little bit of clarity to that, too. I mean we, what, $0.37 up on the first 6 months. We're not going to be $0.37 over at the end of the year, right? I mean, I'd be disappointed if we weren't improved in the range or whatever. But the performance so far -- Yes, we're doing great. And then just one last one, if I could. As you talk about the news last night out of D.C., but any thoughts with regards to regulated nuclear eligibility for PTC here that you might be willing to share with us? So really, the application of Vogtle 1 and 2 fairly are hatch slim to none. Tom, Dan, a question for you. You know what, but, I think that while some people have been breathlessly optimistic about hydrogen and I would argue we're doing the most research and the most kind of real money behind our words. We think hydrogen has a great place, particularly in blending with kind of methane fuels as we're demonstrating here in McIntosh. So we're looking at, as we add safety-related pipeline replacement programs in Southern Gas, is it suitable to think about moving hydrogen through those facilities. Yes, I was going to say, Michael, just along the same lines as what we've been talking about on the call around renewables and what this agreement with Manchin and Schumer may -- how that may benefit renewables something similar may be needed for RNG since you asked about that, to make it equally affordable for customers. Dan, I don't know. We're kind of looking at each other, going I don't know. I mean when you said material, it's hard to see it being material in the near term. I really think hydrogen is a good idea, but it's probably in the 30s. We provided the guidance plus 3 months, plus 6 months. So as we begin fuel load and start-up of 3, the same kind of personnel that will be devoted to that activity will also be devoted to HFT in Unit 4. There can be overlap there, particularly, say, in the second half of start-up, maybe the last 25% of start-up. If the same personnel are starting to get freed up in the second half by February, by January, somewhere in there, that would suggest you could accelerate hot functional test on 4 from the calendar that we're showing you on Page 6. And to the extent we're successful on accelerating 3 prior to March, or have the people available at the end of startup of 3 prior to March, we can start hot functional testing sooner than the critical path we indicate on Page 6. That really is, I think, what is mostly behind our comments on schedule right now. So...\n Well, I mean I almost describe it this way. Right now, we believe we're reasonably comfortable within the ranges. And then I guess when you gave these in-service date ranges, you also kind of talked about like $4 to $4.30 of EPS in 2024. Look, we are where we were, but the reason we put out a range, Nick, is because there's -- it was 3 years away, and there's a lot of moving parts. So, look, you see what's happening around inflation and interest rates. And as those things get buttoned up, and we get closer to 2024, we'll narrow in on exactly where within that range we are. The biggest change, I guess, Dan, that we see of interest rates, particularly cost of -- interest costs at the parent. But I would say that it is a range, and Dan mentioned, we'll tell you where we are within the range. But within that expectation as a result of the Georgia rate case, anything to do with the economy, a recession, a host of variables. But everything we know right now, we're still within the range. So obviously, I mean, there's a lot to like here for utilities, generally speaking. But sort of when I compare this to sort of the build back better version of the plan, there's no direct pay for utilities, doesn't look like utilities are eligible for that. And then obviously, you have the 15% minimum tax, which you guys talked to is not a material impact for you, but EEI has visually kind of oppose that, if you will. And there are still uncertainties out there, as I mentioned in response to Steven Fleishman's question. There are things here that so many people wanted this thing -- and , there are still many unknowns as to whether we can get this across the finish line. This is a great thing for us, and I broadly would say for the industry. Adding something else at this point, I think, is a bridge too far, in my opinion. And I think, the inside the beltway people are kind of talking to each other with the frame of mind that don't let the perfect get in the way of the good. This is pretty good, and we hope it crosses the finish line. Yes, Durgesh, again, we don't want to get ahead of any of the process. There is a calendar in the slide deck, Slide 25. So really, the process will start in earnest in mid-September with hearings. I think the only other thing I would say is just as a reminder, this rate case is largely a continuation of all the elements of the 2019 rate case. It's 2019, 3 years later. What I'd add, reference the NERC report that warned the industry that half of the United States would be under duress with our energy future. And then you're stressed further by this unusual weather we're having, whether that's part of climate change, et cetera, the tails appear to be flatter, our system has performed beautifully. And I think, given our relative price position in the United States, given the resilience of our system, I think the decisions of the commission in the past and the company had been excellent in respect to benefiting customers long term here in the Southeast. And it's no secret why a lot of data centers in some of these big economic development projects, Rivian and others, are coming because of the price, because of the resilience, because of the long-term stability. And I'm afraid I'm going to be following sort of Durgesh and Steve's approach here, just if possible. I mean I am unable to read all the legislative tech, but it looked to me like it was a little bit broader than that. As it's 700 pages to get through and understand the details, and this is based on our high-level review of similar provisions in BBB. And so when you have a regulated nuclear plant that operates in a constructive jurisdiction and is recovering its costs on a regular basis, it's unlikely to truly benefit from something that's intended for troubled financially nuclear units. And then also just in terms of the mechanics, the 15%, I assume that, that applies to all corporations within that large category or what have you. I mean, you mentioned the SALT and all those other things that people -- I am sorry, go ahead. No, I mean, I think you're absolutely making a good point. Well, if it's good for us, who isn't it good for, and they certainly will weigh in. So we're not hurt by it, other people are. My sense is these, next 2 will be done in a matter of days, not months or weeks. And son of a gun, we're poised to turn this thing over to operations and look forward to fuel and so forth, that will remove a great deal of risk, I think, from our portfolio going away. We still have to improve particularly our performance in electrical, particularly in the terminations area. So look, I think we're as well poised as we can be. Dan mentioned the blessing of the good performance that we've had to date, $0.27 over versus our own estimate, gives us the flexibility to deal with problems in the future, including rate pressure. I know you all have to make your bets, and we have to do the same in terms of allocating capital. Ladies and gentlemen, this concludes the Southern Company Second Quarter 2020 Earnings Call."
}