{
    "symbol": "GTLS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 15:42:08",
    "content": "  Operator: Good morning and welcome to the Chart Industries, Inc. 2022 First Quarter Results Conference Call. A telephone replay of today's broadcast will be available following the conclusion of the call until Friday, May 6, 2022. Before we begin, the company would like to remind you that statements made during this call that are not historical, in fact, are forward-looking statements. I would now like to turn the conference call over to Jill Evanko, Chart Industries CEO. We're going to try to save it for next week's investor day, which is next Thursday, May 5. Starting on slide three, the quarter included our sixth consecutive record quarter of backlog, our highest ever quarter of orders, and our continued progress of closing the gap of pricing and cost which has demonstrated through our sequentially improving margin profile, as well as our continued completion of various acquisition integrations and capacity extension projects. You will see this reflected in our addbacks to earnings per share excluding the mark-to-market gains and losses of our inorganic investments net of FX, are down 42% when compared to Q4 2021. Demand for our products, in particular LNG and other energy solutions and equipment accelerated as a result of the Russia Ukraine conflict that began February 24, our last earnings call. We have seen an increase in actual orders, as well as inquiries from both public and private sector entities surrounding the need for infrastructure to access molecules to support energy security, independence and resiliency, all with the backdrop of the requirement for alternative sources of supply and continued focus on sustainability. Slide three provides some examples from the past 45 days of actions taken by governments and private industry to support this energy independence, resiliency, security and sustainability. These themes were in part reflected in our record orders of $636.8 million in record backlog of just about $1.5 billion, but perhaps more meaningfully reflected in our growing pipeline of commercial opportunities, the largest pipeline we have ever had. On slide four, you can see that these records were not just driven by one segment or product category on the left hand side of the chart. Total company backlog increased over 50 when compared to the same quarter in 2021 and Cryo Tank Solutions, specialty products and heat transfer systems backlogs were each up 49%, 55% and 77%, respectively. But before we get into those specifics, let me take a moment to share a few other noteworthy highlights from our first quarter, some of which are shown on the right hand side of the slide, a few to point out specifically around the hydrogen side of the business. While much of the past few months have been around immediacy of natural gas and LNG, there has not been a slowdown in the focus and action surrounding more sustainable and ESG oriented answers. For example, we completed a memorandum of understanding with a major industrial gas customer for liquid hydrogen equipment globally, which adds to the continued expansion of our hydrogen installed base in a variety of different geographic regions. Additionally, we see China as a meaningful future hydrogen region, with an announcement in March from their National Development and Reform Commission that China aims to produce 100 to 200,000 tonnes of green hydrogen a year and have 50,000 Hydrogen fueled vehicles by 2025. While the end product is an alternative liquid fuel, there are situations where the hydrogen needs to be stored and transported from the production site to the SAF producers plants. And these 30 are part of the 419 potential customers we are currently working with for liquefaction, storage, transport, and end use hydrogen solutions. Just as a point of reference, two years ago this month, we were talking with approximately 30 potential hydrogen customers. In one year ago this month, we were talking with 214 of them. We've increased the number of individual customers that we have sold hydrogen technology or equipment to by 70% in the past six months, further evidence that there continues to be on-going support of hydrogen as a key part of the energy transition. Now turning to slide five, you can see our $636.8 million of all time record orders. When backing out the $228 million of big LNG orders received in the first quarter, we booked over $400 million of non-big LNG orders, which included new fortress energies order for FastLNG2. We also booked 65 individual orders each greater than $1 million in magnitude, twice as many of those as we booked in Q1 of 2021 and making this our fourth consecutive quarter with this metric being over 60 individual orders per quarter. I just shared our record orders and backlog which is included on slide six, sales of $354 million was our highest first quarter sales in our history, an increase of 22.7% when compared to the first quarter of 2021. All four segments sales increased more than 14% over that same period, with specialty products leading the way on a year-over-year increase of 39%. Some of these we anticipate to continue throughout the remainder of the year, such as additional logistics, transport and freight costs. Others we anticipate will improve in the second half, including China COVID impacts electricity and gas costs and our European shops as weather improves, and manufacturing inefficiencies of previously outsourced products brought in house as we leverage the synergies from our recent acquisitions. And still others were truly one time in Q1 such as inefficiencies from robotic cell repair, which is now completed and the repair of our collapse storm sewer in Minnesota. You can review slide eight specifics on your own, but the takeaway is that our add backs excluding mark-to-market net of effects were sequentially 42% lower in the first quarter than they were in the fourth quarter of 2021. We do not anticipate refinancing costs this year, and some of our organic capacity comes online throughout 2022. Our first quarter of 2022 reported non-diluted EPS of $0.28 included a negative impact of $0.11 from the quarter’s mark-to-market of our inorganic investments net of tax, as well as operational onetime costs related to restructuring, start-up capacity and deal and integration totaling $0.26. When adjusting for these items, adjusted non-diluted EPS was $0.65 as shown on slide nine. Material cost and availability is by far our highest on-going concern, and we focus our discussion on the three main material inputs in our business, aluminum, stainless and carbon steel. Throughout 2021, we strategically decided to increase our on hand inventory balance, as a result of increases in material costs and a frequently discussed availability challenges of materials. Given the uncertain supply chain and material cost environment that worsened as a result of the Russia Ukraine conflict, we've chosen to continue to strategically build safety stock of key raw material inputs, especially given our ability to source these globally while attempting to procure them at lower cost points in the market. Because we did build safety stock last year, we are able to monitor pricing and purchase at better entry points based on the material price indices. We did this in the United States for stainless steel in early February at the prior month's fixed cost, which has proven to be a near term success. We like most companies are not immune to the well documented supply chain disruptions, yet there's nothing meaningfully new to discuss on this topic shown on row two. Row three is the continued Force Majeure, we are under from our United States gas suppliers to our manufacturing plants. We expect that the situation will improve in the summer yet we are planning for the worst case of continuations throughout the remainder of the year, which is included in our current outlook. On slide 11, I'm going to skip to row six as rows four and five are currently in decent shape. Also, we anticipate the second quarter to have some logistics headwinds in our China facility, less specific to our shop, but more so as a result of Port congestion, the worst that has been in six months in the South China hubs as well as growing backlog at Shanghai. Slide 12 is the same information that was shown on the last earnings call, 2021 pricing actions taken. So now moving on to Slide 13, what actions we've taken year-to-date 2022. As you've heard, material costs and other hyperinflationary trends continued throughout the first quarter. In the first quarter, we had our long term agreement index adjusted price updates, all standard price list had pricing adjustments, specific regions had increases based on material cost in that region. Our 15% market conditions surcharge was in effect the entire first quarter 2022 for non-contrast customers, and we increase the surcharge after the material cost changes did not temper but rather increased. The left hand graph on the slide shows the global container freight index for the past three years, from January of 2021 to January of 2022, you can see the dramatic increase in freight costs of over 300%. Now turning your attention to the right hand graph, which is our delta between freight cost and freight we pass to our customers. On slide 15, you can see our anticipated CapEx for 2022, which is unchanged from our prior guidance in the range of $50 million to $55 million for the full year. And finally, we plan to share our next series of CapEx projects for 2023 through 2025 that are invested in next week. Now, we don't always time our capacity expansion perfectly. This adds flexibility for a variety of core sizes as well as adding a location that's close to New Iberia, Louisiana for ease of transport of the brazed corps  to our water adjacent cold box facility. Also making great progress is our Sri City, India expansion on slide 17, primarily for tanks and potentially trailers, already partially in use as of this month, expected to be 100% operating in July of this year. As a reminder, we looked record orders in India as a whole last year. As I mentioned previously, each segment sales were up 14% or more when compared to the first quarter of 2021. Both reported and adjusted gross margin as a percent of sales sequentially increased not just for charter as a whole, but in each of our four segments compared to the fourth quarter of 21. So slide 19 is our menu of Clean Solutions that you've seen on numerous occasions for the Nexus of Clean, Clean Power, Clean Water, Clean Food and Clean Industrials. While much of the past two months has been around immediacy of natural gas and LNG, there has not been a slowdown in the focus on action surrounding more sustainable and ESG oriented answers. Turbine had the highest order quarter in 5 years, while Earthly Labs had historical record high orders, including orders with 12 new customers. One of the very exciting parts of the chart water business from my perspective, is seeing the cross selling between our core food and beverage customers, blue and green and AdEdge’s water customers, Earthly Labs, small scale Capture Carbon breweries, wineries, and distilleries and our larger scale Carbon Capture business SES. Since Early Labs joined us in December of 2022, and coupling up Food & Beverage water solutions and small scale Carbon Capture, we've had 28 cross selling opportunities between these businesses already with total order potential greater than $40 million if each comes to fruition. In this month, we launched our sustainable brewery solutions package, an all-encompassing approach to beer brewing operations. In January of this year, we had 199 potential CCC or SES cryogenic Carbon Capture customers. As of the first week of April 2022, we had 252 and have sent 148 proposals out we're under 81 NDAs for SES large scale Carbon Capture technology. This past quarter, there's also been an all at once interest in our gas by rail offering as seen on slide 21. We shared last quarter that was the first time in our history where the three facets of our LNG offering were all increasing at the same time, those three being big LNG, small utility scale LNG and LNG equipment. This quarter’s macro environment, as I laid out at the outset of the call, coupled with a few charts specific wins is driving the opportunity even higher. You can read the macro bullets on your own, but let me add a little bit of color to the right hand side of the slide. Modular midscale approach to export terminals is gaining traction beyond the U.S. Gulf Coast, including in regions such as South Africa, which is different than before when are larger IPSMR Process opportunities were typically solely North American .IPSMR and IPSMR Plus continue to receive qualification by LNG operators including international companies, most recently qualified by TotalEnergies for their upcoming projects. Couple this with our on-going differentiation via many international patents, and our latest process patent which we had announced on our last call. Our process lends itself to retrofitting for increased gas output in brownfield locations, and IPSMR efficiency leads to lower CO2 per tonne of LNG. Three main contributors; first, the resurrection of more big LNG projects. Second, the addition of specific international liquefaction opportunities and third, the increase in potential floating projects. For example, just yesterday, the Magnolia LNG project for which we will have content. I'd also point you to the second from the bottom row on the lower chart, showing the doubling of floating LNG projects in our bid pipeline. And while the order potential size of small scale LNG hasn't dramatically increased, the number of in dollar amount of projects that we think move ahead this year certainly has. Looking some of these opportunities in the coming few months could drive the potential to reach the higher end of our guidance range, as shown on slide 24. Our anticipated 2022 full year sales outlook is in the range of $1.725 to $1.85 billion, with associated non-diluted adjusted EPS of $5.35 to $6.50 on approximately 35.83 million weighted shares outstanding. We want to reiterate again that our sales timing is expected to sequentially increase throughout the year with big LNG revenue, primarily in the latter part of 2022. And I'd say latter half, latter part we debated semantics on that, but suffice it to say that there's nothing meaningful from big LNG revenue in Q2. Recently, key customers from our HLNG vehicle tank products lowered their 2022 purchasing forecasts as a result of the macro economic challenges in the vehicle industry, citing specific, specifically the second quarter 2022 impacts. As we said previously, we do anticipate the first half of 2022 will continue to have a margin drag from historical levels from the on-going macro challenges but increasingly be offset as the year progresses, by the positive impacts from the actions that I've laid out today. Now with big LNG orders booked and anticipating additional big LNG orders later this year, our 2023 through 2025 outlooks all increase meaningfully. As I mentioned earlier in the call, we made the decision to continue our strategic safety stock inventory build and in turn this resulted in lower free cash flow for the first quarter of 2022. It allows us to meet our customer’s on-going delivery timeliness and record demand levels, thereby continuing to secure additional business. Even with these challenges in this strategic decision, our net cash used by operating activity activities was only negative $22 million, and when adjusted for unusual items was positive $8 million. This included an increased inventory  in the first quarter of 2022 driven by the strategic sourcing decisions we made to add the safety stock, the increases in material costs and the purchasing of material for our larger projects that were booked in the fourth quarter of 2021 and the first quarter of 2022. So even considering the inventory headwinds, we do continue to anticipate that with the payment schedules for big LNG projects work in backlog. This month, we did release our third annual sustainability report, which we're very proud of highlighting the meaningful progress we have made toward our 30% carbon emission reduction target by 2030 as well as all progress on all of the elements of our ESG activities. Last year, we reduced our GHG intensity metric by about 14%. Last year, we instituted an ESG component to our short-term incentive awards. Part of ESG is safety as our number one priority, including as of the end of March 2022, having our lowest ever 12-month total recordable incident rate. I've shared on new -- agents that cryogenics is not easy, not the process, not the technology design or manufacturing of these types of solutions. Our biggest safety advocated chart and I would go so far as to say in the cryogenic industry is Tom Drube, one of our very own engineering fellows and Vice President of Engineering. This month Tom received the distinguished Charles H. Glasier Safety Award for 2022, which is presented annually by the Compressed Gas Association or CGA to an individual in recognition of their safety leadership in the industrial gas industry. And I would say generally speaking on these larger projects as a whole historically, we given the size of them, the ability to run them through our shops where shops are set up and the absorption impacts, they are higher than our average target gross margin. In terms of the current state of affairs, we've been very conscious around ensuring bid validity timing with respect to material cost, which is an important piece of ensuring that we maintain the appropriate margin levels ourselves. And then in conjunction with that, given the difficulty of getting material and the higher prices of it, working with those operators, either directly or via the EPC to ensure that they understand what that material cost looks like and when is the right time to buy that is which in turn does change that cash flow profile for us to be more tilted toward the front end. I would say that it as a whole, on all of these projects were never upside down on cash flow with respect to material. And that same discussion applies fairly smaller scale side to, there could be some exceptions on the smaller scale side, just depending on what project it is, or if it's a new, new application. And then in terms of pricing as a whole, we were very transparent with the customers on these big projects where, this is the material cost environment that we're in. And so it's not, it's not us trying to grab a massive share of additional price. It's, hey, this is the cost of materials right now. So I'd say as a whole, we've been able to all in all, maintain, if not improve a little bit, both the cash and the in the pricing side. And then maybe just as a follow on to that, you're talking about better margins as we go through the year. So – meaningful, there's, there's two pieces of the answer to that question. Well, there's obviously many more than that. Two being, the backlog burned off of the lag from last summer and the second and third quarter of last year. And then the second being the timing around some of these midscale, small scale and larger projects, which we had a chunk of, and those are the types of projects that had material bid validity. And so we were able to, to really get a meaningful mix as those start to take hold in the second half. But really, the biggest increase is going to be Q2 to Q3. And then we'll see that that level exit the year, maybe a little bit better in Q4, that'll really just depend on how some of the bigger LNG projects revenue recognition between Q3 and Q4 plays out. Hey, I was wondering if maybe you could expound a little bit in terms of what you're seeing for demand on the LNG equipment related equipment. Once it gets to the what the LNG gets to the other shore, the downstream LNG equipment, and in particular, what you're seeing in Europe. For demand, I know you mentioned in the press release from a European government organization, I think it was tens of millions of dollars worth of equipment orders, I assume that was LNG related. And I would say that on, I think it was slide 23. In the deck where we laid out, we kind of split the big LNG export terminal opportunity increase in the smaller scale. We haven't seen a material increase yet in orders with respect to re-gas terminals, where we're seeing more of that activity is on the infrastructure side itself. So again, around transport, fueling stations is another one that we continue to see high level of inquiry on. I think we're just starting to see, to see that happen. The biggest discussion, there's two, two parallel paths of discussion happening in particular with the EU Member States. And so we're seeing that manifests itself both through the equipment side on natural gas, but also through some of these alternative energy discussion points. Is it Q3, Q4, so it's very, very fair to still state that as the target. I guess first question, I'm going to stick on the LNG theme. Obviously, you're going to have some pretty strong or you've had some pretty strong LNG orders so far this year. You've talked about the three larger orders on your Stage three, VG Plaquemines and Driftwood this year. But if we look past this, and you've probably had discussions are on-going discussions. But could you talk about the timing of more big LNG orders here in the U.S and maybe I don't know, size, MTPA, or anything you want to kind of frame for us once we get past these three orders? Yes, that's, that's a really good point that let me address with some specificity here. So, and I would piggyback I think Lorenzo of Baker Hughes commented 100 to 150, MTPA coming, starting construction in the next couple of years. And from there, some of these projects might actually, if there is potential that some of them aren't even after the three that we talked about publicly, they could maybe fall in the middle there, but let's just talk about them as after those three. So some of them are building upon existing projects in the United States, you would know the ones that are operating currently. But I think one of these on U.S., maybe in the in the eighth MTPA range outside of the U.S. has the potential to move ahead. And then you've got some more work on CP2, that's identical with couch pass two, I think that certainly is one that moves ahead in the coming couple of years. And then you've got some of these other guys that are on the U.S. Gulf Coast, ranging typical ones that I would say there are going to be in the 10 MTPA to 15 MTPA range. But certainly a positive was just my comment about like Magnolia and Texas LNG, but I'd put that in more of the second tranche. That second tranche is pretty big, too, in my opinion, which is a little bit different than what we had believed before, if we had believed that there would be this group in this cycle, and then there'd be a hiatus and maybe there was another cycle in 27, 28, we now view this as they're going to continue to stack on themselves, which, without that hiatus in the middle of the decade. Can I kind of follow up real quickly on that one question, you said at MTPA for on a international project. Would that one be modular as well, where they kind of be larger stick projects. There's a couple of these internationally that have changed direction now to modular midscale from their original thought process, and we're pretty far along in those discussions. So the demand side is in line, I think somebody offline had asked me a question about hydrogen orders at 30 million. So the demand side, we expect to continue to grow in specialty sequentially and build off of the starting point there. From the profit side, what -- the first quarter really the biggest impact on specialty origin perspective was each LNG vehicle tanks. And then you've heard these truck makers indicate that they're, they're not able to get semiconductors. So we expect to sequentially step that out as the year continues on with, let's see, gross margins, increasing sequentially every quarter, the second half is stronger than the second quarter, because of the timing on our liquefaction. But when you get customer that's fairly, that's very well established in terms of handling and building larger scale, hydrogen, that's, that's even more impactful, I would say in the near term to our hydrogen outlook. Obviously, we can't tell you which customer and we don't want to give away any competitive Intel on their behalf. So obviously, all the majors play in the U.S., it goes to Asia, and my comment around expectation for China hydrogen to expand, this would be something that we would expect this particular player to, to do in that region, Europe, and North America, including Canada. So all-in-all that this covers all the equipment that we provide, and that includes Brazed Aluminum Heat Exchanger core, which is a really, really big win for us. When you look back historically, we didn't typically serve any of these larger customers on the brazed side. There were incumbents like Sumitomo and Kobe, and since a couple of years back when the Sumitomo challenges were in play, we've taken this market advantage to try to have our offering at least get tried in the field. And it's a win for us on getting our equipment into more variety of geographies, all of which require specific equipment certification on the hydrogen side. It is fair to say that we have a variety of agreements at various stages on hydrogen, on Carbon Capture, on general products. So yes, it's very fair to make that statement. And certainly what they had discussed publicly, just curious, given the acceleration of the size and the timing of this, and that this cycle probably goes longer. Yes, I think I concur with everything you summarized there, in particular, that it was a surprise to us as well to have that six of the 18 come our way. So early this year, we had anticipated that we might get it in this year, but certainly not early in the year. With that said, I think the size of these and as you pointed out, the continuation of them in order without the typical cycle going down and stopping and starting back up, I think you're going to see a more steady state of construction over the coming decade. With that said, the, my prepared remark of we aren't very good at timing capacity extensions, but we got pretty close on this is, is proving to be very beneficial in the ability to take on more of these projects of all sizes. The other thing that is helping in this in terms of speed is we've done so many of these that we can do them in a very, very short lead time. And if the lead time we quote isn't short enough, and a customer says I need it a month or two or four sooner, we're able to make that happen. And couple that with this pulse of expansion gives us a lot of confidence in our ability to continue to serve the specialty markets that also require brazen aluminum heat exchangers for faction, whether that's helium or hydrogen or biogas. They're proven in the field, and the capacity that we have allows us to be flexible and work with the customer to meet their schedule. I wanted to get to something that didn't really come up much, but seems like it should be increasingly a thing as we're seeing a lot of oil and gas development or drilling and rig counts going up and everything. But in short, the answer is yes, we're starting to see some green shoots on those more traditional, whether it's pet cam or nat gas processing, certainly many more in play and moving. Yes, the last the last couple of quarters, we've definitely seen that in the order book. And we've seen a couple of big bigger projects bigger, kind of an 8 to 12 range for these types of applications. So I think this year, I think I think you made a good point this year, we could see that as an increase that we've very conservatively built the year out in terms of our current outlook. You'd mentioned, I think you said 30 Hydrogen liquefaction plants that you're, I guess quoting on at the moment. So we had, we didn't we did not originally anticipate that we would have a hydrogen liquefier order in Q1. I will be extraordinarily disappointed in our hydrogen commercial team, if we don't have a liquefier book in Q2. I think that you're going to see quite a bit more activity in the second half of the year, because you're starting to get more capital into some of these projects that are individual projects, so starting to separate from the larger guys who are more established and doing repetitive projects. Now you're starting to see some other entrants in the space that are getting to the point of being fully funded, and starting construction, and they want to start getting online taking advantage of being a producer. So I think one big challenge to the commercial team to in Q2, but realistically, I think you get one in Q2, and then the second half, you see, you see two or three. In flight at any given moment, we have a very detailed plan on that which we'll share a little bit of some of this competitively strategic that we don't want to share. This year, we've got the breathing line coming on early next year. So for example, we already had base load volume in our Germany trailer facility expansion, and then you throw that tens of millions of dollars of European government order on top of that, and it says, okay, this is a payback of sub one year. That's our thinking on how we approach it, so that we don't get behind the APR. And typically, these expansions take about 12 months for us to complete if they're rooftop. So our next tranche of expansions, there will be let's see, one to two that kick off later this year. So all-in-all all said it's a step approach of timing of these projects, which also allows the team to execute flawlessly and still deliver on time, not miss any potential orders. If I stripped that out, we're kind of like one seven to one eight, for the non-big LNG revenue this year. Yes, I think our expectation in Q2 that we would be certainly 0.5 range on book-to-bill and then it steps up in the second half with some more of these mid, mid small-to-mid projects that are non-big LNG liquefaction projects so you'd expect that to be closer to more similar to 1.1 to 1.13 book-to-bill in the second half. And then the next one, just I know you don't want to guide specifically to quarterly results or anything, but just maybe to give us a little bit of a steer so. I mean, I'm thinking maybe revenues up in the ballpark of 10%. Yes, it's interesting, because you can, what is sometimes lost in how we communicate the market is that there's a lot of different products that go into the Food & Beverage market as an example. So when we talk Food & Beverage specifically, that's excluding like Earthly Labs, small scale Carbon Capture, because we capture that through the Carbon Capture side of the business, but you're still hitting the Food and Bev customers. For you'd have national account applications, like I referenced Chick-Fil-A, those types of customers and the products that go into them. What we like about how the year is setting off is you have a combination of folks that hadn't done much during the COVID shutdowns on the restaurant side, combined with quite a bit of infrastructure and franchise build this year. And so we see the setup that Q1 was really good Food & Bev wise, was quite surprising to us, actually, in terms of the order book. So we were selling the smaller unit, which is the OIC , now we're starting to sell the LM, which is a larger unit and is six times the cost of the smaller unit, it obviously has value that goes along with that. And we're able to we sold the first one of that last quarter, we're seeing an abundance of interest in that. So to hit the Food & Bev answer, you're going to have to look both at Food & Bev and Carbon Capture. While we're just talking, we focused in on the one that we expect to potentially move to order later this year. On the initial one, it's going to be kind of 35 million to 40 million in terms of, of headline price for that order. And I like that, because once you have the first design with them, then it's really easy to replicate. It's easy for us to manufacture and in turn, that the efficiencies that we get will partially share that with customer, but we'll also see that margin profile increase. The other thing I want to ask you about was on slide 23, highlighting how basically the big LNG pipeline for you has more than doubled in terms of number of projects and multiply it by more than that in terms of your potential revenue content over the next several years of bookings. But what we hear around the neighborhood is that B and C is probably going to be on the critical path in terms of their capacity, bottlenecks to prosecute that much activity in that shorter timeframe. So all-in-all, I think the short answer is absolutely, we think that we can take on much more of this work ourselves and deliver in 12 to 14 months on a on a braze in a cold box. And it could be shorter, depending on the size of the core, it could be longer if it's much larger. And then without going into a ton of detail we've got some work underway on the very near term, additional capacity on the cold box footprint. Yes, no, I got you on the chart side that was really, thinking more on the EPC capacity, probably more sensitive to labor, pinch, etcetera. Yes, I think, first of all, the modular move helps that problem dramatically. So that's, that's a positive, because instead of having a stuffy stick built at site, you can do it with meaningfully less people at the location itself. What we're hearing is, depends on which EPC, it depends on which project, but we still talk to a ton of the EPCs on a regular basis, and no one is telling us we don't want to go bid with you. So they're still looking and willing to and able to meet schedules, whether it's a small scale hydrogen liquefier that they're getting together with us on or one of these larger projects. So where are these things are put together at respective fab yard coast, we're definitely seeing the interest in having multiple fab yards by some of the end users. So not having that constraint be okay, my whole projects dependent on fab yard one. So spreading the wealth, I think is going to be a trend that you're also see in the market. Back to Europe, and specifically, the green hydrogen build out. And that isn't that's in Europe, but also in other locations and other geographies they think are paying more attention now to I can't say that I'm going to do this in 2030, or 2040. More of an in-house question, I think the last four months is the longest period while you've been CEO, that Chart has not done an extra M&A deal. We had, we had a view back in late 2020, that there was a 12-month window of getting deals done that fit really closely into our portfolio. So deals we were getting first looks that you've certainly seen other companies go by that we said, either piece of this that we don't want, and we'd have to figure out how to get rid of it, or that's a outside of our discipline, valuation profile in terms of returns, all kinds of different reasons. So it's been it's been on purpose for the way that the market has shifted, but also for absorbing and integrating the acquisitions that we have. Now, the second part of my answer is, it's, it's deliberate, but it's not permanent. And next week, we're going to talk through specificity around the three or four key areas that we're still opportunistically looking at potentially inorganically spending some money in. These deals that we are looking at are very similar in profile, meaning headline price, so there's not a big deal, you go out and spend a billion dollars and have the company turn into a water treatment company as a whole. That's not the approach, we're going to stay with the PacMan approach that we've taken to date. Have we, first quarter we went live on JD Edwards, which is our universal global computer system, at both cloud technologies as well as AdEdge. And so getting these integrations under our belt really gives us the opportunity to leverage both the sales and the cost synergies, and we expect that we expect to continue to do that in the first half of this year. Yes, so the IPSMR process technology differentiation, I talked a little bit about how it's proving to be useful on the heavy hydrocarbon removal side on the floating LNG side on the retrofit for brownfield sites. Where in translating all of that to why, which I think is your question, is it the modularity and the way that the process design works with the equipment makes it really suitable for smaller plot sizes and so if you have a different shape or a smaller piece of land IPSMR is very good for that. We also have seen the ability for IPSMR and IPSMR Plus, which by the way, Plus is something that you could actually retrofit IPSMR with the Plus at a future point in time, where you have the ability to get more if you say, I'm doing a 1 million tonne per annum liquefier, you can actually get 1.4 million tonnes per annum of gas out of that same liquefier using IPSMR. Now, there's a lot of technical details to make that happen. So I'd say, all-in-all, I think our potential for market share on the modular midscale side. So I'm excluding the base loads, which aren't really even happening anymore. And then I'm executing the small scale also, because I think that's a different answer. The modular midscale, it’s either to be the potential to be 40 to 50 market share in that space. On a small scale, I think it's a meaningfully higher number, because there's less competition on the small scale side. Yes, so certainly, we think right now, organic and inorganic investment for profitable growth is, is the right way to spend to spend our money. You're seeing us do more organic of late, which is with respect to the capacity projects that we've described. The inorganic, is it a sub bullet primarily, because there's nothing we have to have into our portfolio, we're, we're super pleased with this portfolio that over the course of time has come together. And that's really been through our own R&D group, as well as the inorganic side. And again, those would be at similar valuation or headline prices that you've seen us do over the last 18 months. We do expect as we get paid for the big LNG work that accelerates our ability to pay down debt, and get to a point where we would actually anticipate we get to a point, to be certainly sub one leverage ratio. So I think that there's a potential for that conversation in the in the near to medium term horizon, but certainly in the current state, the investment for growth and debt pay down are our top allocation priorities. Hi, I want to pick up on audience Ati and Paul's questions overall. Let's see a real quickly back to the envelope I've got certainly 60% of these are, would be in conversation, for the potential to be IPSMR. So if you wanted to peel the onion back, I think you'd have to risk adjust the ones that the incumbent has their process on their existing locations. The second question on the international opportunities, I mean, those were, those are wholly additive to our position from where we were a quarter ago, if we get. And I feel like we're very well positioned, these the international expansions, or new builds are a little bit slower in terms of moving forward. But those types of projects are similar, if we are to get IPSMR would be similar in size to some of the U.S. Gulf Coast work that we do. And then the hydrogen question versus LNG and whether the hydrogen opportunities would be I guess I could answer it, or I can answer it two ways. Either way, I'd answer it is we believe hydrogen is additive and not a displacer. Two things that we're talking about, at least in the first half of this decade. I think over the course of time, how those how that line crosses, I don't have a guess right now, it's too early to tell in terms of the evolution of the hydrogen economy. Yet the hydrogen folks that are working with us, a lot of the 419 are, have absolutely nothing to do with the LNG side. But we're starting to also see a little bit of a subset of LNG players say, let me contemplate doing a mix. So I think that's probably step two, maybe step three, later this decade. How easy it is, let's, let's describe it maybe that we have looked at this for multiple different customers. And in the context of what are the critical points to design into LNG today to be able to potentially blend in many cases, it's up to 25% or 30% hydrogen. In many cases, that's going to be different metallurgy, and we can accommodate multiple molecules. So it's a fairly it's not a one company answer, it would have to be an interconnection points on various different companies that could work together on that. But again I don't think that's a 22, 23, 24 type of timeframe."
}