{
    "symbol": "GTLS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 13:57:04",
    "content": " While the deck has numerous updates that can be reviewed at your convenience, our formal remarks today will focus on our 2023 outlook, our record fourth quarter and full year 2022 results, the current operating environment, numerous tailwinds that both Chart and Howden are experiencing, and the status on the closing of our pending Howden acquisition. Not only do we as Chart have our largest commercial pipeline for the next two years, we also have started 2023 very strong from an order perspective, with over $285 million in orders in January alone. Both teams remain laser focused on execution and Howden, like Chart, continued to experience strong demand from numerous macro tailwinds in their end markets in the fourth quarter of 2022 and into the first quarter of 2023. When adjusted for one-time items related to the gain for the revaluation of our investment in Svante following its sale of securities to additional investors including Chevron, share-based compensation and the non-recurring costs reflected in adjusted operating income, adjusted EBITDA for the fourth quarter of 2022 was $97.5 million or 22.1%. Contributing to these 327 were fourth quarter of 2022 orders from new customers, including energy vault, an order from Yarmouth, Massachusetts for the first ever Flourosorb water treatment solution in the State of Massachusetts, and a pre-FEED study order for SES cryogenic carbon capture technology for Carmeuse and a European  in the lime industry, an industry that we anticipate will quickly begin to implement carbon capture utilization and storage solutions. I think it's showing up in our order book to date more so in CCUS than it is in hydrogen, but that we would expect to see that accelerate in 2023, in particular, as customers that are not your traditional hydrogen users, like your industrial gas guys, but more of the hydrogen specific customers, digest how the credit system and the stimulus funds work, whether you can stack the credits if you do multiple different combinations of CCUS and hydrogen together as an example, as well as the IRS requirements and how that works with the IRA. And what we like about the combination, as well as all the numerous things we've already said is, to Joe's point, when you're selling a full solution project to renewable customers, that full solution is different than a component sale of OEM on the specialty side, and we love the ability to pull through the digital elements and the footprint of service and repair the opposite way through to the Chart business that we didn't have as strong of a position as they do."
}