{
    "symbol": "JBL",
    "quarter": 2,
    "year": 2023,
    "date": "2023-03-16 12:33:04",
    "content": " Now turning to the segments, revenue for the DMS segment was $4.1 billion, an increase of 8% on a year-over-year basis and in line with our expectations, while core operating margin for the segment came in at 4.6% as expected, as a result of strong returns in auto and health care, offset by weakness in consumer markets. Revenue for our EMS segment came in at $4.1 billion, an increase of 7% year-over-year, while core margins for the segment was 5.1%, up 110 basis points year-over-year reflecting solid leverage on strong revenue growth. Through the first two quarters of FY 2023, the team delivered strong year-over-year growth in revenue, core operating income and core earnings per share, while also expanding core margins by 20 basis points compared to the first half of FY 2022. We continue to expect areas of our businesses benefiting from strong long-term secular growth trends like electric vehicles, healthcare, renewable energy infrastructure, 5G and cloud to drive solid year-over-year growth. We expect our improved mix of business will drive incremental operating leverage, thereby giving us the confidence to raise our core margins by 10 basis points to 4.9% for FY 2023 on revenue of $34.5 billion. Your line is now live. EBIT has grown from December by about $25 million, but on the other side of the coin, interest costs have gone up as well, our business -- our operating business, our secular trends, all the end markets that we perform in, thatâ\u0080\u0099s actually going really well. If I could add a comment, listening to Mikeâ\u0080\u0099s response, with everything we got going on, the macro the way it is today, if you think about the back half of the year and again, adding to what Mike said, our DMS margins for the second half are going to be in the range of 5%, which is right where they thought -- we thought they would be in September, and by the way, thatâ\u0080\u0099s with consumer getting hit pretty hard, at least temporarily. Your line is now live. Your line is now live. Parts of wireless infrastructure and cloud remains strong, and then, again, on the income line, I would say, itâ\u0080\u0099s a combination of just tremendous execution, customer care, and again, our -- the overall EMS portfolio, although, we report it in four different sectors, just has an endless number of customers and I think that diversification plays into that as well. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}