{
    "symbol": "JBL",
    "quarter": 1,
    "year": 2023,
    "date": "2022-12-15 12:18:09",
    "content": " Revenue for the DMS segment was $5.1 billion, an increase of 8% on a year-over-year basis and ahead of our plan from September, while core operating margin for the segment came in at 5.2%, slightly below expectations as upside strength in automotive and healthcare was offset by operational inefficiencies associated with mobility in China. Revenue for our EMS segment came in at $4.5 billion, an increase of 18% on a year-over-year basis, while core margins for the segment was 4.3%, up 50 basis points year-over-year, reflecting solid operational execution on strong revenue growth. We're also expecting double-digit year-over-year growth in our healthcare business, which continues to benefit from an outsourcing of manufacturing trend and has historically been recession resistant with long product life cycles accretive margins and stable cash flows. In summary, we feel the outlook for our business is solid and expect demand across many of our end markets to remain strong with year-over-year revenue growth at an enterprise level to be approximately 3% for FY '23 despite an assumed economic slowdown in the second half of the fiscal year. I think for the quarter, so if we backward look to September, October, November with the kind of zero COVID policy, everything that was in the media around China and then kind of our exposure to that and our experience with that, in very round numbers, I would say that the kind of overall China COVID activities probably impacted Q1 by about $10 million, give or take. I think on one of the slides again that we showed, you can see our cloud business or let's just say, cloud and 5G is now $6 billion, give or take. And whether it's running our business in each sector of our business, in a different way based on what customers need, whether it's our execution, whether it's overall cost management, I think when we sat here in August, September, and we're taking a hard look at the year. I mean, as we sit here today, one could look at it and go, why would you guys take the numbers up, if you're somewhat cautious about the back half of the year or gosh knows what's going to happen in '23 based on what the U.S. Fed is doing in the markets, et cetera, et cetera. I would also -- why we're on the topic of the year is, let's not be -- let's be sure it's not lost on us, the hard work and the complementary work that our EMS team is doing in terms of their business and margins for the year as well."
}