{
    "symbol": "SMPL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-04-06 11:28:02",
    "content": "  Operator: Greetings, and welcome to The Simply Good Foods Company Fiscal Second Quarter 2022 conference call. I am pleased to welcome you to The Simply Good Foods Company earnings call for the second quarter ended February 26, 2022. During the course of today's call, management will make forward-looking statements that are subject to various risks and uncertainties that may cause actual results to differ materially. Note that on today's call, we will refer to certain non-GAAP financial measures that we believe will provide useful information for investors. Due to the company's asset-light strong cash flow business model, we evaluate our performance on an adjusted basis as it relates to EBITDA and diluted EPS. Today I'll recap Simply Good Foods' second quarter results, and I'll provide you some perspective on the performance of our brands. In the second quarter, we delivered strong net sales and earnings growth that exceeded our expectations, and position us well to deliver on our full-year objectives. U.S. retail takeaway in the quarter was in line with our expectations, and similar to Q1, despite the surge in COVID cases from the Omicron variants. Price increase instituted in our fiscal first quarter of this year is tracking in line with our expectations, and was a high single-digit percentage point contribution to our sales growth. Net sales increased 28.7%, driven by retail takeaway and the timing of shipments. As is typically the case, this time of year, trade inventories grew during the quarter in support of seasonal in-store merchandising. We also estimate that the storms that negatively impacted sales in the year-ago period, was about a two percentage point benefit this quarter. Adjusted EBITDA in the second quarter increased 27.1%, to   million primarily due to the sales growth and G&A leverage. As expected, gross margin declined 250 basis points versus the year-ago period. And while still with challenging supply chain operating environment, customer service performance improved during the quarter. While we're not at target service levels, our performance has improved during the first-half of the year. We are focusing on driving sales and earnings growth, and competing effectively while navigating a challenging supply chain environment. As such, due to lingering supply chain cost inflation, which we expect to continue into fiscal 2023, earlier this week, we notified customers of a price increase effective in our fiscal fourth quarter. Additionally, in March, we entered into an agreement to license the Quest frozen pizza business to Bellisio Foods, which has held the license for Atkins Frozen Meals for several years. Total Quest retail takeaway and measured channels in Q2 was up 40.1%, and outpaced the Active Nutrition segment growth of 20.5%. We estimate the U.S. retail takeaway and unmeasured channels, primarily e-commerce and specialty increased low double-digits on a percentage basis versus last year. As expected, due to strong performance in the year-ago period, the growth rate in unmeasured channels moderated. The year-over-year increase benefited from improvements in the mass and club channels, as well as continued total buyer growth. Atkins growth and total buyers in the quarter remained strong, up double-digits on a percentage basis versus the year-ago period. However, the by rate remains mid single-digits below historic levels due to fewer snacking occasions from the high correlation between consumption of Atkins bars and the workplace. In Q2, bar consumption was up modestly versus prior year. In Q2, Atkins all other retail takeaway increased 9.8%, driven by cookies, and contributed about 2.6 percentage points to Atkins total brand retail takeaway growth. We're particularly pleased with Q2 mass channel retail takeaway of bars and shakes, which increased 7% and 10% respectively. Amazon Atkins second largest customer, Q2 retail takeaway increased about 20% on a percentage basis versus the year-ago period. Let me now turn to Quest, with Q2 retail takeaway increased 40.1% in the measured IRI MULO C-store universe, and outpaced the Active Nutrition segment. Growth versus year-ago period was driven by an increase in household penetration, a rebound in bars, and success in new product forms. Quest bars Q2 retail takeaway increased 22%, driven by higher shopper trips versus the year-ago period in C-stores and mass channel. Recall, Quest bars are about 55% of total Quest measured channel retail sales. The snackier portion of Quest products, about 40% of total Quest U.S. retail sales continued to do well, and increased 88% in Q2, driven by continued strong growth of chips, cookies, as well as confections. Increased foot traffic in the mass channel and convenience stores are solid, driving combined Q2 POS growth in these channels of nearly 45%. As expected, due to strong performance in the year-ago period, the growth rate moderated from previous quarters. Over the remainder of the year, we anticipate that retail takeaway will continue to be solid. Although, as we mentioned previously, the growth rate in the second-half of the year is more challenging due to more difficult year-over-year comparisons. Due to the timing of Q2 shipments discussed earlier, we expect net sales growth in the second-half of the year to be less than the retail takeaway increase. Additionally, given the unknown timing of when employees will return to the office, and the unpredictable nature of COVID-19 over the remainder of the fiscal year, we don't anticipate any meaningful improvements in workplace mobility. Therefore, there is no meaningful change to our fiscal 2022 supply chain cost inflation or gross margin outlook. We're executing well against our plans, and we believe we are in a position to deliver another year of solid net sales and adjusted EBITDA growth as a path to increasing shareholder value. North American net sales increased 31.5%, and was primarily driven by volume. As Joe stated, we estimate the pricing was a high single-digit percentage point contribution to our sales growth. Core international net sales growth was 6.1%, and the European business exit was a 1.5 percentage point headwind to total company net sales growth. Moving on to other P&L items, gross profit was $108.5 million, an increase of 20.2%. The gross margin decline was driven by the previously discussed supply chain cost inflation, partially offset by pricing and favorable product form and retail channel mix. As Joe mentioned, over the remainder of the year, we have good visibility into our cost structure and our input costs are largely covered. In the second-half of the year, gross margin is greater than the Q2 seasonal low, and is anticipated to be in the 37.5% to 38% range for Q4 greater than Q3. G&A expense excluding integration and restructuring expenses, as well as stock-based compensation increased 4.8% to $22.9 million. We anticipate solid G&A leverage this year and expect leverage to be higher in the second-half of the year, due to the timing of when we began to accrue incentive compensation in fiscal 2021. In the second quarter of fiscal 2022, the non-cash charge related to the re-measurement of our private warrant liability for $12.7 million in the year ago period. Gross profit was $225.1 million, an increase of 22.1%. Adjusted EBITA increased 31.2% to $120 million, primarily due to the higher gross profit. This excludes charges of $6.1 million related to integration expense related to integration costs, restructuring expenses, stock based compensation and other expenses. Moving to other items in P&L, interest expense declined $4.7 million to $11.6 million due to the re-price of the term loan and the pay down of the term loan debt. Turning to EPS, second quarter reported EPS was $0.18 per share diluted compared to a loss of $0.27 share diluted for the comparable period of 2021. In addition to the previously mentioned warrant liability impact, in Q2, depreciation and amortization expense was $4.8 million and similar to the year ago period. Stock based compensation of $3.1 million increased $0.6 million versus last year, and costs associated with Quest integration and restructuring was $0.3 million versus $2.2 million last year. Adjusted diluted EPS, which excludes these items, was $0.36, an increase of $0.11 versus the year ago period. Year-to-date reported EPS was $0.40, and adjusted diluted EPS was $0.79. Additionally, the calculation of adjusted diluted EPS in Q2 assumes fully diluted shares outstanding of $102.4 million versus $100.4 million under GAAP. Moving to the balance sheet and cash flow in the second quarter and net cash provided by operating activities was $37.7 million, an increase of 53% versus the year ago period. Year-to-date, net cash provided by operating activities was $30.3 million. As of February 26, 2022, the company had cash of $51.5 million. During the second quarter, the company repurchased $20.4 million of its common stock at an average cost of $35.68 per share. As of February 26, 2022 approximately $27.5 million remained available under the existing stock repurchase authorization. We anticipate GAAP interest expense to be about $23 million, including non-cash amortization expense related to the deferred financing fees. This is less than our previous estimate of about $25 million, due primarily to the re-pricing of our term loan. Capital expenditures in the second quarter and year-to-date period was $1.6 million and $6.3 million, respectively. In the second-half of the year, we have marketing customer programming and innovation plans in place to continue to drive sales growth and retail takeaway. Looking at the key metrics of our updated full-year fiscal 2022 outlook, we expect net sales to increase 13% to 15% versus last year. This includes a two percentage point headwind related to the European business exit, and the licensing of the Quest frozen pizza business. As we stated earlier, we continue to anticipate supply chain cost inflation and expect gross margin to decline about 250 basis points versus last year. We continue to expect that marketing expense will increase versus last year, although at a lower rate than the net sales increase. Additionally, we anticipate significant G&A leverage and the decline in interest expense should result in adjusted diluted EPS growing faster than adjusted EBITDA, a couple of things to note in the second-half of the year. And as we stated in January, we anticipate year-over-year performance across key financial metrics to improve from the third quarter to the fourth quarter. A strong balance sheet and cash flow generation enable us to invest in our business, evaluate M&A opportunities, and opportunistically buy back shares of our stock at the path to increasing shareholder value. We appreciate everyone's interest in our company, and we're now available to take your questions. Hey, good morning, folks. So, I mean the high-end of the guidance is around 6.5% net sales growth for the back-half. So, that's about two point negative impact of the second-half. Some of it was, we exited the year a little bit light, we built some of that back in Q1, more in Q2, we had some key customers who wanted the shipments earlier than normal. And then, don't forget, we had that storm, Texas storm last year that ripped through the country right at the end of our Q2 last year. So, there's probably at least five or six points of that de-load that's going to impact the second year. So, if I take the high-end at 6.5, I add the two points to get to kind of an organic 8.5, and then there's a five or six points of a de-load. And the statistics on Quest, 55% now bars, correct me if I'm wrong, but I think if we rewind the clock to maybe 2018 or so, it was around 80% bars-driven. Well, let's -- you know, if we consider, Jason, bars and shakes, is our core business on both brands, we've already replicated it on Atkins, our confection business is about 25% of the Atkins portfolio. We just shipped, started chipping chips, too early to call, but now we've got enough consumer data surrounding our salty snack business to know that the consumer base for Atkins will find -- we'll find the product pretty appealing. And in fact, we think as a percentage of our portfolio, kind of the all other forms, the non-bar and shake forms will continue to become a larger and larger piece of the portfolio. Please proceed with your question. Highly confident that we're going to get the ingredients, we are over 90% covered now for the year. Two years ago, we had leverage over four times when we purchased Quest. So, we ended this quarter down to 1.6 times, obviously a very, very comfortable place to be to do M&A, potentially continue to pay even more debt down or to opportunistically buy some shares. Basically, we saw the stock pullback just with the craziness, the stock market; we bought the $35 range very attractive prices in our view. Please proceed with your question. Just wanted to ask about the incremental pricing, I guess firstly, I think originally the expectation for the year was, call it, I don't know, maybe 6% or plus. And then, now there's another -- something in another round coming in, and maybe kind of squeaks in some time towards the end of Q4. First, we're sitting at gross margins, 250 basis points erosion this year in gross margin with a stated target of trying to have gross margins around 40%. So, we're in the middle of the year, and below our own expectations. And our pricing this year plus cost savings, were insufficient to hold gross margin. As we look at the environment, as we said in our prepared remarks, as we look at the environment into fiscal year '23, cost inflation is going to continue based on our view right now. So, the combination of where we are today didn't take enough pricing this year, the environment that we see as we move into fiscal '23 continued to be inflationary, you know, caused us to move forward and take a second price increase. That price increase will have minimal impact on this fiscal year, and in fact is more about as we move into the first-half of next year. And then, just kind of a general question for you, Joe, I know, you know, now for some time, you've been kind of factoring in no real improvements and consumer mobility, which I fully understand, but for sitting here now, early April, I guess, kind of the direct question, is there -- things I'll have, is there anything that you've seen kind of coming through March, already, that could suggest some positive potential in terms of increased mobility expectations, or again, it's just like way too early to tell, and you just kind of find keeping it flat on go-forward? So I would have told you, I thought, when we're sitting in October-November, we're in pretty good shape from a COVID. You know, the variant hit, 20 million people had reported cases of the new variant, and we weren't locked down, but we certainly weren't -- people weren't out and about like they were prior to that. So, we're really reluctant to declare victory on COVID and to say that companies will go back to closer to what they were prior to in the pre-COVID period, just because it's been very, very difficult to predict it. Q2, so the business that's been the most effective has been Atkins bar business, and in Q2, we actually saw -- Q1 to Q2, we saw improvements in by rate on bars. Certainly not back to full potential, certainly a lot of opportunity, but as company started to go back to work, the number of a bar snacking occasions went up, and we saw the by rate on Atkins bar improve, certainly not where we want it, certainly not where it can be. So, again, I would I think conservativism, as we think about the second-half of this year is appropriate, given what we've experienced over the last two years, and it appears this correlation factor on snacking and work on bars, appears to in be correct. So, we feel pretty confident that as companies go back to more the way they look like pre-COVID, our bar business is certainly got to pick up. Please proceed with your question. Our points of distribution on both brands up significantly since the beginning of the fiscal year, I don't think John, it's coming from expansion of our category into other space. I think it's just, I think it's competitive pickup, right. So, I don't think it's that. And for the most part, I think it's there are two factors that been driving distribution gains, I think during COVID, retailers understood the importance of bigger brands, kind of key flagship brands in the category to attract foot traffic to the category. And then, I think we have a pretty good innovation pipeline, so, enough new items, interesting new items to gain incremental space. And then, just as a follow-up, coming back to Jason's question, on the cookie side, I think Atkins is run rating something like north of $20 million annualized Nielsen right now. And that approximates what Quest did in its first year, I think going back to 2018. Yes, cookie, your analysis on cookies is consistent with ours on the opportunity size, we are facing some constraints in cookie production right now due to staffing issues at the co-man but we're managing around those on both businesses, frankly, but I don't expect that to be a long-term drag on the business. So, that is telling us we got ourselves a lifestyle brand, transcends in one particular form, and then, we've got a suite of products that hit a lot of different lead states in used occasions, which is a pretty powerful thing and very consistent with what we've experienced on Atkins. So, we're very optimistic, our pipeline is full of technology and products that's going to enable us to continue to explore these other snacking lead states and products. Please proceed with your question. Hey, good morning, folks. Yes, it's -- I mean, it's -- if you look at the POS growth, it was about, in North America is about 19% and the North American business grew around 30%. And then, you guys raised -- \n Just so we're clear, some of that inventory was make-up for low inventory levels going into the year. We have a growing business, so weeks of inventory, customers try to keep the weeks of inventory pretty consistent, but as you grow the size of the business, weeks of inventory gets bigger for one week gets bigger. So, as we've provided our guidance for the second-half of the year, we gave our best estimate of how much is going to stick and how much of it is in fact just timing and the shipments have come out in the second-half of the year. Yes, I mean, we -- again, we ended the year low just for if you remember our fourth quarter of the summer of last year, that's when all the supply chain logistic issues were starting to occur with us and in our peer group. So, we struggled to get to fulfill orders and get orders out the door, so we ended August with lower, they're not bad, but lower than normal retailer inventory. So, we built some of that back in Q1, we build it more back in Q2 and because of some of the just short-term shifts in customer requirements from March into February, we probably added a week or two of them into our works, typically in the four to six weeks of inventory for a retailer out there. Again, like Joe said, most of that's going to come out in the second-half, always hard to tell where you're going to land the year, but we've made our best guess we'll probably keep a little bit out there, but some of -- most of it will come out. There's some thought out there that your gross margin outlook might be conservative and given your raising sales this year slightly 1% at the midpoint, but you held gross margin guidance. Commodities have not obviously as you've seen not pulled back, but were covered for the year, we feel very, we felt competent in January we feel now even more confident that, that minus 250 is a pretty good number. Please proceed with your question. Yes, first of all, consumer response to our price increase in September has been -- the elasticity has actually been lower than what we projected. I would say one of the metrics that we're looking at right now as you're starting to see the emergence of private label again, which tells you to consumers are starting to get a little bit more price sensitive, and I think it has to do with the current economic environment, gas prices, high ground war in Europe that people are concerned about. So, as we think about, as we think about pricing, obviously, we're concerned, we're always concerned about a pricing environment where consumers are feeling less than positive given the current financial situations. That said, you have to do what you have to do and in this case, we've got to maintain our margin, so we're pricing the cover to commodity cost, and we'll be conservative in our estimates of what we think the elasticity will be as we move forward. So, as we look at elasticities there's no in both of our businesses, there's no competitor, and there's no private label that we have to worry about price gaps do, it's absolute price point drive. And I've been in categories where that is clearly not the case, which is not prevalent to private labels not well penetrated here has had a great deal of difficulty over the years trying to be successful. Please proceed with your question. I mean, look, long-term our model is we're going to maintain marketing investment with sales growth. Obviously, the last couple of years, we've exceeded that we've been able to maintain gross margins. And build up our investment and quite frankly, in Quest, where when we bought the business was about 6, 6.5% of net sales. So, we've exceeded marketing spend as sales growth this year, with a little bit of pressure on margins, we've pulled back. We have not -- we decided not to maintain marketing growth, a little bit lower than what our sales growth is just to kind of manage some of the bottom line margin. As I mentioned, we're still going to grow in mid to high single-digit growth rate. So, it's still pretty healthy growth. We spent a lot in the fourth quarter last year, so we were jumping off high base, so we have a lot of -- we feel very comfortable with the amount of spending we have. And quite frankly, if we can get some upside to the second-half, and we can maintain the margins as you know, we will not hesitate to spend some incremental marketing in the fourth quarter if a P&L allows us but going forward, growing with sales is kind of the model that we predict. So, when we know we've got good return for the investment, we're leaning in where we know we don't have good return, we're pulling back, so you can expect us just from a principle standpoint. So, both in the absolute level of spending as well as what we're spending on, it's always returned based. Since we've been public, we're steadily increasing marketing support, because the return has been good. You didn't feel any outright urgency for M&A, but you continued to search for a right asset at the right price. I guess just an update on your thinking there and specifically what we were talking about kind of valuation expectations of sellers and then having been frothy over the past several quarters, there was some discussion about whether the current, just market backdrop was going to reset people's expectations, just any sense if you're seeing a movement there. The conversations typically start with we're going to IPO the business, but if you give us 30 times earnings, we might sell it to you, right. So, those kinds of conversations, given what's going on in the IPO market, what's coming, what's going on with equity values. So, I think the environment as we move forward, is getting a little bit more conducive to getting some deals done. Please proceed with your question. Is across the portfolio differs whether product form or brand a bit, but the last price increase was about a weighted average of about 8% and this one's similar. And the price increases we're taking, but we feel very, very good about the pricing actions we've taken. Yes, Pamela, if you're a competitor buying dairy proteins, you better be taking pricing, because the marketplace are historic highs and they don't appear to be coming down off those historic ties -- historic highs anytime soon. So, if you're not taking cumulatively double-digit or more pricing, you're not keeping pace with the cost coming into your into your products. But retailers are trying to protect consumers and so you run the gauntlet with retail or any price increase, right, so, and they're dealing with this across the board throughout their store, all the buyers are dealing with it. So, we'll see how it's more difficult the same or easier than the first one, but I expect retailers to continue to behave the way they behave, which is they want you to justify your price increase based on actual cost change. And one last question on different topics, just in terms of the divergence that you pointed to in the bars performance, it sounds like Atkins was impacted by lower mobility because of Omicron, but Quest bars benefited from more shopper trips. So, channel mix, Quest has a very large and small format, convenience store business that collapsed during COVID, right. So, people just weren't going into convenience stores, gas stations to buy bars that business has come back and is robust and is growing. Also, if you just -- you can't look at this category as generic bars, the consumer benefits are very different, Quest is about active protein for your active lifestyle. If you think about the second quarter, people were basically sheltering in home because we had 20 million plus people with COVID. I think right now, if you just look at what's been going on recently, with the economy, with gas prices, people aren't feeling particularly positive about the future, hard to think about a lifestyle change and start eating healthier, and maybe drop a few pounds when you don't feel particularly good. We were chatting about this yesterday, Todd and Mark come from the confections business, and their experience was when people aren't feeling good, they eat a lot of chocolate. Right, and I think we're seeing a little of that in the Atkins business too but correlates to being at work, because the snacking occasions for bars are more work based. And it's hard to think about the lifestyle change, when you're not feeling particularly positive about the future right now. So, I think it's a combination of category and channel mix. Please proceed with your question. We like the category we're in, we like snacking in our aisle, we feel that deployment of resources against that is our biggest, our highest leverage opportunity. It's not a part, it's not our core strength in supply chain, customer relationships, category innovation. So, we just thought it was a business better to put into the hands of a partner, who's done a terrific job with our meal bar business on Atkins. So, for us, it's more about focusing on the categories that we believe our greatest growth prospects and less about a broad scale licensing, licensing thinking across the portfolio. And then, you were talking a little bit about some of the consumer behavior shifts, where people maybe aren't feeling quite as great, but you kind of pair that against potentially needing to focus on weight management more now than ever. So, we've had since the summer, COVID summers at 2019, 2020, we've seen double-digit growth in buyers on Atkins, so high end, so the net takeaway of that high interest in the brand, interest in low carb lifestyle, interested in weight management. And the second quarter was no different, double-digit growth of total buyers, we're bringing in new buyers and they're sticking around in loyalty. Our challenge in the business and I think that continues because if you look at the macro trends on the go, snacking, health and wellness interested in weight management all tailwinds for us, and they've been tailwinds for us for a decade, right. So, if you just step back, when you talk to people about weight management they go, it's kind of episodic, it's kind of, it ebbs and flows. And it's because 50% of Americans are obese, about equal number are Type 2 diabetes, or Type 1 diabetics or pre-diabetic, right. The challenge of the business has been for us by rate, and I think the challenge of the business as you're trying to get people to make lifestyle change, right. So, short-term, hard to get people to think about lifestyle change when the world is kind of upside down on them, and I think that you understand that. So, I think we're -- I think the business performance is being short term affected by that, the long-term trends are undeniable, right, that people have to change how they eat because the path that we're on is not a healthy one, by the way the healthcare costs are mind boggling for people that are overweight and diabetic, right. Yes, I mean obviously, 40% the target, the question is when, I mean it's really hard to predict very early on what FY '23 is going to look like from a cost perspective. Prices continue to be little bit dynamic, and just got exacerbated by the Ukraine-Russia ground war, and they just kind of took off again, at that short term, is that going to stick for a while very hard for us at this point, to predict. So, again, we're not going to comment on what gross margins are going to be next year. But we'll come back later, as we get closer to year-end, and give you a little bit more color on gross margin. But right now too hard to tell, but very clear, 40%, we believe is a competitive advantage, allows us to invest heavily in our business, allows us to have strong bottom line margins. Please proceed with your question. And I'm sure that you've probably gone back and studied this, but you didn't own these brands, or run them in the last economic recession, which is what 12, 13 years ago. So, if U.S. goes into economic recession, how did the brands perform and what would you do or not do maybe you don't do anything differently than what you're doing today with a very weak U.S. economy? Yes, I think we've been looking for proxies, I think the best proxies to look for on how that businesses would behave in a recession are confections, quite frankly, small indulgences, snacks, right, which tend to do pretty well during recessions. So, our view going into this thing is people will continue to invest in themselves, and low ticket items, in order to make their lives a little bit better. Yes, and don't forget, we're -- on both brands the consumer is a pretty upper middle-class kind of consumer."
}