{
    "symbol": "KPLT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 15:14:04",
    "content": " As a reminder, today's call is being recorded. With me today are Orlando Zayas, Chief Executive Officer; Karissa Cupito, Chief Financial Officer; and Derek Medlin, Chief Operating Officer. We issued our earnings release and corresponding investor presentation this morning, and we will be referencing these during the call. Before we begin, I would like to remind everyone this call will contain forward-looking statements regarding future events and our financial performance including statements regarding the anticipated occurrence and timing of prime lending tightening and impact on our results of operations. our growth opportunity, the timing and impact of our growth initiatives on our future financial performance, the impact of our new executive hires and brand strategy. These should be considered in conjunction with the cautionary statements contained in our earnings release and the company's most recent periodic SEC reports, including our Form 10-Q for the quarter ended March 31 and 2022 and the subsequent periodic and current reports we file with the SEC. These statements reflect management's current beliefs, assumptions and expectations and are subject to a number of factors that may cause actual results to differ materially from those statements. Except as required by law, we undertake no obligation to publicly update or revise any of these statements, whether as a result of any new information, future events or otherwise. During today's discussion of our financial performance, we will provide certain financial information that constitutes non-GAAP financial measures under SEC rules. These include measures such as adjusted gross profit, adjusted EBITDA and adjusted net income. Reconciliations to GAAP measures and certain additional information are also included in today's earnings release, which is available on the Investor Relations section of our website. The challenging macro environment for both our retailers and our consumers continued into Q2 2022, including inflationary pressures and shifts in spending away from durable goods which impacted our gross originations, revenue and lease portfolio performance for the quarter. Despite facing these near-term macro headwinds, we are confident in our long-term ability to weather these challenges and remain focused on capturing new volume opportunities from a very large addressable market in order to create value for our shareholders. Some of the key highlights from the second quarter include: We added 42 merchant partners; two, our satisfaction metrics remain strong. Our Net Promoter Score was 60% as of June 30, 2022, and our repeat customers made up 52% of our Q2 2022 originations. Three, we hired the final open strategic leadership position that we had laid out in our growth plan, our Chief Revenue Officer, Reed Burke. And Four, we launched a new brand platform that we believe differentiates ourselves in the market and is centered around the core philosophy that drives our company, seeing the good and people is good for business. As part of this new brand platform, our brand logo and colors were refreshed, which you'll see in our investor presentation. Five, we continue to be focused on identifying core efficiencies and cost savings opportunities. I will now turn the call over to Karissa, our CFO, who will provide more details on our financial performance. As detailed on Slide 5, Q2 results reflect a difficult macro environment for both our retailers and consumers, which resulted in decreased originations and weighed on our key revenue drivers. Rampant inflation, widespread weakness and durable goods spend, along with our continued tighter underwriting decisioning drove the decline in gross originations year-over-year. Total revenue was $53 million, which was down 32% year-over-year. Adjusted gross profit, which is detailed on Slide 12, is lower by $5.4 million year-over-year. Excluding bad debt expense, which we no longer record due to the adoption of ASC 842, operating expenses were down $6.1 million. As a reminder, in the second quarter of 2021, we incurred approximately $12 million of stock comp and bonus expense in conjunction with the closing of the SPAC merger. Removing this merger-related stock comp and bonus expense impact, compensation costs were up approximately $3.7 million year-over-year, which is due to a combination of increased payroll costs from the investment growth hires that we have made as well as $1.9 million in stock cost expense recognized during the quarter. Looking forward, we will continue to focus on opportunities to lower operating expenses while maintaining the resources needed to drive future growth. Impairment charges related to property held for lease as a percentage of gross originations was 9.2% in Q2 of '22, which reflects the continued challenging macroeconomic conditions our customers are facing, specifically related to the current inflationary environment. High inflation, especially on gas, food and housing costs significantly impacts our consumer base and has pressured lease performance. As we discussed last quarter, we anticipated this metric returning to pre-COVID levels, and we have continued to tighten our underwriting model throughout the first half of 2022. As we move forward through this challenging environment, we will continue to make adjustments as deemed necessary to our underwriting model. We continue to anticipate that credit will inevitably tighten across the credit spectrum, including prime lenders, and as a result, we believe new higher income customers will seek out our offering. While we have not yet seen an impact from the prime lenders tightening above us, we are seeing early signals that lead us to believe that the tightening will eventually occur. Should this prime tightening happen as we expect, we believe this will positively impact both our lease portfolio performance and our origination volume. Looking at the expansion category of this slide, we continue to execute on initiatives that we committed to as part of our strategic growth plan. To date in 2022, we have increased the breadth and depth of our leadership team adding key strategic positions such as Chief Marketing Officer, Chief People Officer and VP of Strategy. We are excited by the new structure, process and methods that our VP of Sales, Marina Reis who started at the beginning of 2022, as implemented in a short tenure here. This new process resulted in 42 new merchants this quarter, the highest quarterly total in the company's history. We believe that this is an important milestone for our company as we have aligned our brand to our core mission humanizing the way underserved consumers get the things they need with payment solutions based on fairness, transparency and dignity. Looking to the remainder of the year, we are currently in beta testing stage for several new exciting product enhancements and technical capabilities that we expect to launch in the second half of the year. In addition, we are also working on enhanced risk modeling and data analytics that we believe will improve our approval and conversion rates and drive incremental originations and sales for our merchant partners. In summary, our Q2 financial results reflect continued challenging macro trends that persisted throughout the quarter. This includes continuing to execute on our strategic growth plan, onboard new merchants, prudently manage our lease portfolio and identify operational efficiencies and cost savings opportunities. As we look ahead at the second half of 2022, we remain confident that our company is well positioned to take advantage of the positive long-term trends in digital commerce and alternative payment solutions. So we hired a new VP of Sales who runs the SMB group, Marino Ruiz starting in January. And so he's basically building that now and so we are seeing greater adoption from the small, medium size. They came to us because of our technology and ease of use and the Affirm Waterfall, and we're excited about retailers like that, that we're drawing in because they are the types of retailers that see e-commerce as the future, and they're growing their business, and we're helping them grow along with them. Notably, Katapult's continued to tighten underwriting, but most prime players in the space have yet to take similar actions. Yes, I mean, at this point, we are seeing that our consumer -- our end consumer is the one being impacted most by inflation, higher gas prices, grocery prices. I do think we are starting to see early signals, which you mentioned in the remarks that we had before that there are certain signals that we're starting to see from the prime and the credit environment overall that are giving us a little bit of hope and anticipation that the prime lenders will tighten above us. We've not seen that yet, but I think once that happens, we will start seeing a better quality consumer coming to us in terms of their credit and could also help with our gross origination volume as well as our lease portfolio performance. So I guess my question, you mentioned the 42 new merchants that you picked up in the second quarter, and that was all-time record. So just like Orlando mentioned, we are seeing the flywheel of our SMB business being the most consistent and improving in the productivity of that organization led by Marino. And so most of those are in that SMB space, and we are seeing categories continuing to expand outside of appliances, furniture and auto, those being our main areas, and those are areas that we focus in, because those are the essential items that everyone needs. Like Orlando mentioned, we do have some other activity that we're excited about, not ready to announce today, but we are seeing, in general, that as there has been constraints on consumer spending and on retail that our sales productivity, both our message, our offering and how we can help drive growth for retailers is really resonating. They reported results recently and their sales weren't down as much as your GMV was, which would imply that you might have lost some market share, given the fact that they account for 2/3 of your GMV. In terms of the Wayfair numbers, yes, their sales were down less than our sales, but that's not contemplating the underwriting tightening. While we face difficult economic macroeconomic times now and ahead, we are confident that the team and technology we have built will allow us to gain market share through the rest of this year and into 2023."
}