{
    "symbol": "KPLT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 09:42:10",
    "content": "  Before we begin, I would like to remind everyone this call will contain forward-looking statements regarding future events and our financial performance, including statements regarding our market opportunity, the impact of our growth initiatives on future financial performance, the timing and gross origination and scale potential of our exclusive partnership with Sears, adoption and success of our mobile application and virtual credit card solution, Catapult Pay, and anticipated occurrence timing and impact of inherent levels and prime lending tightening. As our exclusive new partnership with Sears, we are currently working to complete both in online integration and support their e-commerce business, as well as full custom integration in the existing in-store point-of-sale system for rollout to their 140-plus stores across the U.S. Additionally, under the partnership, shoppers who apply, but do not qualify for credit through the Sears prime financing provider both in-store and online will automatically be considered for eligibility to receive a Katapult lease purchase preapproval offer. This is something that we've been working on for some time really with the aim to respond to what we're hearing both from retailers and from consumers about how can we make the customer experience better, how can we open up the opportunity for repeat transactions and recurring and higher engagement, as well as giving the Katapult community a larger set of retailers to respond to. And the early numbers that we're seeing are really exciting just in terms of average order value, our consumers are behaving just like they have been and other form factors and in the digital experience, we were already mobile enabled and mobile forward thinking, but with the Mobile App and this new capability, we're seeing very similar sort of customer behavior. But what's really exciting is to see the level of engagement, the higher and the faster repeat rate, as well as the encouraging signs as they're finding new buying opportunities from new SKU categories of someone who may have came in, found a mattress with us and is now very easily able to find a purchasing option at a Best Buy or at a Tractor Supply or at something similar to that."
}