{
    "symbol": "HSBC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 17:23:02",
    "content": " Adjusted pre-tax profits in the quarter increased by $1 billion or 18% to $6.5 billion, reflecting a strong net interest income performance of $8.6 billion, that's up $2 billion on last year's third quarter. Adjusted revenue was up $3.1 billion or 28%, as the positive impact of rate rises were reflected in our strong net interest income performance. And non-interest income of $5.7 billion was up $600 million, or 13% on last year's third quarter, despite a $400 million insurance marketâ\u0080\u0099s impact charge in the quarter. On Slide 5, net interest income was $8.6 billion, up $2 billion versus last year's third quarter, this was primarily driven by higher rates and were strong across all regions and businesses. Relative to the second quarter, we are upgrading our assumptions on a like-for-like 2023 revenues by around $1.5 billion on a constant currency basis, including $1.2 billion for FX movements, and at least $1.3 billion of planned higher cost of funding for the trading book, with this benefit being reflected in higher trading income in non-interest income, and as dollar for dollar with lower net interest income. The FX movements have a similar impact on costs with 2021 adjusted operating costs of $32 billion, translating to around $30 billion using year-to-date average FX rates and around $29 billion if you were to use September average rates. On the next Slide, non-interest income was $5.7 billion up 13% against last year's third quarter. So relative to the second quarter, we think we're guiding like-or-like revenue guidance up by at least $1.5 billion even though the net interest income guidance was down by $1 billion. Your line is open. Your line is open. Your line is open. Your line is open. I actually had a couple, just to triple clarify on the cost target for next year, the base of which, the 0.2% growth comes from is the $29 billion FX adjusted, not the $30 billion, that you have as year-to-date FX average rate, is that correct? But yeah, to keep that in context, $12 billion is on a $1 trillion loan portfolio, so it's just over 1% of total exposure we have as a bank, but Noel, I don't know if you've got other comments. Your line is open. Your line is open. Your line is open. Just on the comments on the math of four times nine to get to 36, I think you do need to add the $1.3 billion on top of that for the switch into trading income that is an uplift in the guidance that we're giving and in addition to that annualized rate of $36 billion. And one thing I would say to you -\n If you think of that, I mean, taking aside if you think about the trends in non-interest income this year, I mean I think you do need to add back about $1billion like-for-like on insurance MCU."
}