{
    "symbol": "HSBC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 07:30:05",
    "content": " Our net interest margin was up seven basis points in the quarter, our highest quarterly NIM since the second quarter of 2020 and implied consensus policy rates have further strengthened since full-year results with further positive implications for our net interest margin and net interest income in 2022 and 2023. Revenues were up 9% on last year's first quarter, lending grew by $6 billion, or 11% with a strong Commercial Banking performances, the standout. Turning to Slide 5, I've touched on most of this already, adjusted net interest income was up 10% at $7 billion in the quarter, reflecting both rate rises and balance sheet growth. While Global Banking and Markets revenue was down 4%, this was mainly from lower revaluation gains and principal investments, Markets and Securities Services revenues were down 2% against the strong first quarter last year underpinned by good performance in FX, up 15%, Global Banking was up 4% reflecting our different business mix to many peers with GLCM revenues up 21% from higher rates and volumes. On Slide 7, net interest income was $7 billion, up $483 million versus last year's first quarter. Thank you very much. Thank you very much. Your line is now open. Has anything changed in terms of the balance sheet structure that would mean that just in terms of tend to check in that wouldn't be achievable again or is that a good target to think about and just on a related question to rate, can I ask if you're thinking more over the medium term, how comfortable are you that through the cycle 30 basis point not guidances right for a world where policy rates are close to 3%. Thank you very much. Your line is now open. Could you maybe you sort of talk us through in a bit more detail this sort of the impact of these OCI movements on the capital ratio, and how you might expect that to impact to reverse over the next four to six quarters because I guess my concern is that consensus forecast may have already factored in the benefits of higher interest rates based on your sensitivity disclosures and the forward curve, but not factored in the negative impacts that you're now flagging on the capital ratio. Yes, rolling forward, it's not the unwind of just a repeat to what I was saying with Jason, it's not the unwind of the fair value losses that benefits net interest income and capital, it's the impact of those higher rates on the 80% of the book roughly, that's not hedged. Your line is now open. Your line is now open. I would take it from all the comments we've been saying today, we think we're back into a cycle of much higher returns, which should drive continued core Tier 1 improvement and therefore help mitigate some of the impacts that we've seen this quarter. Your line is now open. Thank you very much. Thank you very much."
}