{
    "symbol": "HSBC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-01 15:37:09",
    "content": " Despite the uncertainty in the macroeconomic environment, we're expecting at least $37 billion of net interest income in 2023, which is a significant uplift on the $31 billion plus we expected in 2022. On Slide 17, net interest income was $7.5 billion, up 20% against last year's second quarter on an adjusted basis. Based upon current FX on the consensus rates outlook, we now expect net interest income of at least $31 billion for 2022 and at least $37 billion in 2023, as we return to a more normalized rate environment. We're also on track to achieve the top end of our three-year $5 billion to $5.5 billion cost savings target and now expect to see a further $1 billion of cost savings from this program flow through to 2023, which will be a material mitigant against the higher inflation that we're seeing. We expect core Tier 1 to recover materially in the fourth quarter back towards 14%, given additional capital management actions we're now taking and then be back within our 14% to 14.5% target range during the first half of 2023. We're seeing strong revenue growth, up 12% on a year ago with continued cost discipline, where we've achieved a 12% operating jaws this quarter. Based upon the normalization of interest rates, with at least $37 billion of net interest income in 2023 and the continued core operating performance improvement we're driving, we're raising our expectations for 2023 and beyond, our return on tangible equity of at least 12%. So the work we have done over the past few years to tightly control costs, reduce capital allocated to low-return, domestic-orientated businesses, and increase investment in higher growth, higher return geographies in Asia and in businesses such as wealth will allow us to demonstrate the value of our international strategy much more clearly, as is evidenced in our forward guidance of at least 12% returns in 2023 and beyond. We're managing costs tightly, and we expect at least $37 billion of net interest income next year as rates normalize. We think if you were to break out the Asian subsidiary, there's a significant risk that the rest of the group would derate from a ratings perspective, one-notch downgrade on that $100 billion we think is a 25 basis point to 50 basis point impact per annum."
}