{
    "symbol": "GBLI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 13:11:07",
    "content": "  Operator: Good day, and welcome to Global Indemnity Group LLC's First Quarter 2022 Earnings Conference Call. I would now like to introduce Stephen W. Ries, Head of Investor Relations. Some of the forward-looking statements can be identified by the use of forward-looking words, including, without limitation, beliefs, expectations or estimates. We caution you that such forward-looking statements should not be regarded as a representation by us that the future plans, estimates or expectations contemplated by us will, in fact, be achieved. Global Indemnity Group LLC is not under any obligation and expressly disclaims any such obligation to update or alter its forward-looking statements, whether as a result of new information, future events or otherwise. In addition to Steve Ries, Reiner Mauer, our COO, Jonathan Oltman, President of Insurance Operations, and Tom McGeehan, our Chief Financial Officer are also in attendance. I’m very pleased with their underwriting results in the first quarter as we execute our strategic plan to grow our existing core businesses, as well as substantially widen our small business commercial casualty product offerings. Our commercial specialty segment grew by 16.7% to 104.3 million driven by growth in our Penn-America binding small business, which grew 26.9%. A new small commercial casualty businesses, environmental, excess casualty and professional that build out their teams in an established solid market footholds. Most recently, we were very pleased to announce the hiring of Matt Carroll to lead our new InsurTech business. We have two existing profitable InsurTech businesses today, collectibles and Vacant Express those service foundation for this new business that Matt has been charged with building and growing. Reinsurance had strong growth, gross written premiums in first quarter '22 were 41.4 million compared to 22 million prior. As noted on the priorities earnings call, this is due to increase in participation. In addition, we wrote several smaller casualty treaties and grew our excess professional reinsurance business by 11%. Farm, ranch and equine grew by 8%. The equine mortality book, which comprises about 15% of this book grew by 39% compared to 2021. We continue to focus on driving profitability in this book and improving results from non-cat property, primarily fires. We have identified a specific risk characteristics, driving these on profitable counts and have been actively non-renewing these risks. Gross written premium invested in lines shrank from 31.3 million in 2021, 22.6 million in 2022. Very little businesses retain as the net written premium was only 700,000. Unwriting income also had good results, the combined ratio improved from 101.2% in 2021 to 95% in 2022. It has fees incurred in first quarter '22 were 4.3 million, compared to 16.9 million in 2021. In 2021, 45% of net written premium was casually business compared to 64% in 2022. We will continue to push towards our goal of 70% casualty business, which will be supported by growth in our three new casualty businesses throughout the year. To support the company's long-term business plan that we unveiled at last year's investor conference, beginning in May 2021, the company embarked on a program  liquidity, investment flexibility, buffer market volatility and balance sheet solidity. The first step in this regard was shortening the 4.5-year duration, a company's fixed income securities portfolio, the three years, which was achieved by August of 2021. Then in August of 2022, the company liquidated the entirety of its 76 million, but we traded common stock portfolio. Finally, in April 2022, the company further shortened the duration of his investment portfolio to under two years to retire 100% that was outstanding indebtedness. Well, again, when the interest rate environment becomes more stable and we have more certainty on how we perceive inflation and interest rates to perform on a going forward basis. At that point, we would be a little more comfortable, extending. So if you look at what the yield you mentioned, you're getting on those new securities, new money you purchased in the process of purchasing. We identified 390 million for sale, sold most of it. But we're seeing yield, we're getting yields on that money right now at approximately 3.2%. So to get to like about 100 basis points, which is good. And staying with your investments, other investments, as investments or other invested assets, which are kind of more debt related, understand funds, limited partnerships. And I understand there was at least partially, they are reported in one quarter lag. Well, the reason we're in those investments is that we do want to get some extra return. Now, of the alternative investments, we have $100 million of the alternatives. On the balance sheet, we were showing 147 million in total, but a little more than 100 million of that is in a floating loan fund. Approximately 97% of what that fund investing are mainly first lien loans, not all 97%. The loans are, as I said, 97% are floating rate. Right now, those yields are in about the 4.5% to 5% range. As interest rates go up, we would expect the returns on that fund to go up. So supply chain problems, Russia and Ukraine war, rising prices of oil and inflation in general and in that particular market, there was a -- I don't want to call it a flight to quality for the low market. And it caused in for that particular fund, a temporary what we believe to be a temporary decline in the market value of that fund. So for the $100 million that we had invested in that fund in quarter one, we actually, again, solely because of market value, no defaults, that we actually had negative income of that fund of approximately $400,000 for the quarter. So what you're seeing for that fund, what I just said is accurate. The other three funds, they are one invest in real estate debt, one invest in distressed debt and there's another one that is run off that we've been in for years that when Europe had Basil three hit, and the banks had loans off of their balance sheet, we are in a fund variable we still run-off at this point it's in its harvest phase. On our alternatives in total we would like to make more than 5% this year in our projections, we have these performing somewhere in the 5% to 6% range. No guarantees on performance, but that's where we have been. Thank you very much. And any kind of indices -- market indices, you would suggest for us to look at as a potential benchmark for the performance of this portfolio. At this time, that's something that we will be readdressing as we go forward. Obviously, we were on a Barclays bond index before, the duration shortening is something where our investment mix currently is -- really it's not in proportion to the benchmark. And as I said, as we look at inflation and interest rates on a going forward basis, there's a high -- I don’t want to say high likelihood that there is a likelihood that we will be considering different benchmarks to pattern our portfolio against. Right now, it's really that we're managing to short durations and looking for yield opportunity. Thank you very much. I'm hoping to get more color on what you're broadly seeing in the ENS market, is the competition kind of picking up, is it pricing momentum and submissions are still going strong. From your commentary, I understand that that's still the case. I mean, we're premium coming into the ENS. As I mentioned, our programs went up substantially to 12.2%. And then, the growth opportunities that we're seeing. And how much actually this new lines, new city lines -- three new casualty lines, how much did they contribute to premiums in the quarter. This is not material in the first quarter, if you looked at, when they kicked off, just to give a little flavor. We see then as being material businesses, I'm not ready to put a number on them at this point as far as forward-looking. The league, they'll be -- we really see the first year, we're building the businesses off the second year on any new business. Your reinsurance renewal is coming up on June 1, I believe for your property catastrophe treaty. And with that, we've seen the ability with a real cost savings as well. And then, in your press release -- another question from your press release. Prior year development, I understand there was a very small looks like about 0.1 million in your continuing operations. And in discontinued, we had a program, we only assumed business for one-year, but it was a multi-year policy. So any reserves we've released, we actually had to up our contingent commissions by exactly the same amount. When you look at our 3 million reserves release to the net of contingent commissions, we had about $1 million of what I would call is positive contribution from prior year results to our numbers this quarter. So it's a 1 million net favorable –\n Positive, yes. We've quoted, I think on prior calls right now that we would expect on a normal year right now, we'd be somewhere in the $17 million to $20 million range $18 million to $20 million range. I remember that during your Investor Day last year, you suggested that you would need about 150 million of additional capital to fund the growth over the next five years. One, we solved, obviously the renewal of rights to our special property. That helped free up by the end of this year, we believe that that was going to give us back over $60 billion of capital. And we believe with some of the things that we're doing with our company that is, we become -- I'll call it a more seasoned debt issuer, that as we go forward, if there is a need to raise additional capital, we would hope to do so at a less expensive price to what the current debt was that was outstanding. Again, we'll be closely monitoring our growth, our reserve levels, our catastrophe exposure, all the things that drive our capital needs Julia. And like I said, the most significant -- one of the most significant things that happened was the sale of the renewal rights. And as we go forward, if we do have a need for capital, we'll be well in front of it, and we will think about the way of raising capital that we believe benefits, Global Indemnity the best. So again, we've now been in the market twice. So hopefully, if we go back out the next time we'll and we're doing some really good things with the company. So we feel really good about the book, we feel good about the volatility that we've been able to reduce all things that should be positive if we have to go to the markets to raise or issue debt again. I mean, we were possibly looking at, we just did a shoe study really across our books on both pricing and reserves. And it's something that on the property side, especially, we see the cost of goods, which we said in our last call  in the fourth quarter, that's where we're getting this point, it's a double-digit increases to address. On the casualty side, we're a little less exposed based on the type of business that we write. We have lower limits in place, and we're not quite as exposed to social inflation. Can you talk a little bit about -- I confess, I'm not as familiar. So I understand there is one big casualty quarter share, right, which you increased participation in. So this year, we actually kept the participation percentage the same, but with the rise erasing cap, that drove most of the increase there. Tom, I don't know if that number, but that was probably about 90 million. We have some smaller -- about one treaty is, what comprises most of it. But it gives us a nice diversification of the type of business that we'd write spread out, really spread out. So it really gives us and then as a rising rate environment, the type of business that we want to be involved with. I was just going to say that we asked them, in addition to that, we have some excess professional liability business we've had for many years. So, example, we took out reinsurance in our three new businesses, and I thought we got there. On the expense ratio, I think there was some kind of increase. Now, what we had said before in the prior call, Julia, is that we're investing in some of our new businesses. And obviously, we're transitionalizing half of the renewal rights. So we originally based in comparison to 2021, we had expected that at our expense ratio over the course of this year, we've actually increased by 1.5% to 2%. And then after the new businesses are up and growing and we continue to get growth in our other businesses and we complete the transition of the specialty property renewal rates that we would start seeing improvements of approximately 1% per year thereafter. So what you're seeing is, some of those factors in play right now. Thank you very much. No further questions at this time, I'll turn it over to Stephen Ries for any closing remarks. Ladies and gentlemen, this concludes today's conference call."
}