{
    "symbol": "AMTB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 13:07:05",
    "content": " Total deposits were $6.2 billion, up by over $511 million compared to last quarter and more importantly, core deposits increased by $505 million this quarter, compared to the first quarter of 2022, as the company continued to seek new sources of deposits. During the second quarter of 2022, we received a total of 285 applications and funded 253 loans, excuse me, totaling $118.6 million. Net charge-offs during the second quarter of 2022, totaled $4 million compared to the $3.8 million in the first quarter of 2022 and $1.8 million net charge-off in the second quarter of 2021. Non-performing assets totaled $31.7 million at the end of the second quarter, a decrease of $25 million or 44% compared to the first quarter, a decrease of $89 million or 74% compared to the second quarter of 2021. Domestic deposits, which account for almost 60% of the total deposits ended at $3.7 billion, up $542 million or 17% compared to the previous quarter. Foreign deposits, which account for 40% of the total deposits totaled $2.5 billion, slightly down by $31 million or 1% compared to the previous quarter. Core deposits, which consist on total deposits excluding all time deposits were $4.9 billion as of the end of the second quarter, an increase of $505 million or 11% compared to the previous quarter as the company continue to add additional sources of deposits during the period, such as funds from escrow accounts and municipalities. Offsetting the increase in total deposits was a decrease of $19 million or 1.5% in non-interest-bearing deposits, compared to the first quarter of 2022. Customer time deposits compared to the prior quarter, decreased $14 million or 1.5%, as the company continue to focus on increasing core deposits and emphasizing multiproduct relationships versus single-product higher cost time deposits. Brokered time deposits increased slightly by $20 million or 7%, compared to the previous quarter, as the company saw the opportunity to extend duration on this funding and lock in lower financing cost, given the expectation of additional market rate hikes for the upcoming quarters. Coming to Slide 16, non-interest income in the second quarter of 2022 was $13 million, down $1 million or 8% from the $14 million recorded in the first quarter. However, the decrease was partially offset by higher mortgage banking fee income for about $1.8 million, net unrealized gain on derivatives valuation $4.9 million, and the absence of a net loss of $0.7 million on the early extinguishment of FHLB advances incurred in the first quarter of 2022. Amerant's assets under management totaled $1.9 billion as of the end of the second quarter 2022, down $261 million or 12% from the end of the first quarter. Turning to Slide 17, second quarter non-interest expense was $62 million, up $1.4 million or 2% from the first quarter and up $11 million year-over-year."
}