{
    "symbol": "AMTB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-21 14:26:05",
    "content": " We will turn now to slide four and you can see that our core PPNR was $30.3 million, up nearly 56%, compared to the $19.4 million reported in the previous quarter. At the end of the third quarter, total gross loans were $6.5 billion or up 11%, compared to the $5.85 billion at the end of the last quarter. Loans held for sale as of the end of the quarter totaled $58 million, compared to $121 million as of the second quarter 2022. The allowance for loan losses at the end of the third quarter was $54 million, an increase of 3.2% from the $52 million at the end of the previous quarter. Net charge-offs during the third quarter totaled $1.3 million, compared to the $4 million in the second quarter. During the third quarter of 2022, the company charged off $1.7 million related to multiple consumer loans and $0.2 million in connection with two commercial loans. Non-performing assets totaled $25 million at the end of the third quarter, a decrease of $6.6 million or 21% compared to the second quarter and a decrease of $68 million or 73% compared to the third quarter of 2021. Total deposits at the end of the third quarter were $6.6 billion, up $385 million from the previous quarter. Important to highlight that domestic deposits now account for 63% of our total deposits, totaling $4.2 billion as of the end of the third quarter, up $444 million or 12% compared to the previous quarter. Foreign deposits, which account for 37% of the total deposits totaled $2.4 billion, slightly down by $59 million or 2.4% compared to the previous quarter. Our core deposits, which consists of total deposits, excluding all time deposits were $5.2 billion as of the end of the third quarter, an increase of $253 million or 5.1% compared to the previous quarter. The $5.2 billion in core deposits included $2.1 billion in interest-bearing deposits, which increased $127 million versus the previous quarter, $1.7 billion in savings and money market accounts, which increased $100 -- more than $100 million versus the second quarter, $1.3 billion in non-interest-bearing demand deposits, which were up $20 million versus the previous Q. Net interest income for this reporting period was $70 million, up $11 million or 19% quarter-over-quarter. Moving to slide 14, non-interest income in the third quarter was $16 million, up $3 million versus the previous quarter and 23% from the $13 million in the second quarter. The increase was driven by; positive valuation on marketable securities holdings of $1.5 million in the third quarter, compared to a negative valuation of $2.6 million in the second quarter; an increase of $1.8 million in fee income from client derivatives; an increase of $0.2 million in total brokerage and advisory fees, primarily driven by higher securities trading coming from the fixed income side from our customerâ\u0080\u0099s portfolio. The increase was partially offset by lower mortgage banking income of $2.3 million, the absence of net unrealized gain on derivatives valuation of 0.9% in the second quarter. Amerantâ\u0080\u0099s asset under management totaled $1.8 billion as of the end of the third quarter, down $57 million or 3% from the end of the second quarter, which comes as no surprise given the lower market valuations in equity and fixed income markets. Third quarter non-interest expenses was $56 million, down $6 million or 10% from the second quarter. Excluding these items, core non-interest expenses were $54 million in the third quarter of 2022. The quarter-over-quarter decrease was primarily driven by the absence $3.2 million related to an OREO valuation in New York, $1.6 million impairment charge related to the closing of a banking center, as well as lower expenses in connection with the upcoming transition to FIS by $2.5 million, lower advertising expenses by $1.2 million, and severance and other compensation expenses by $0.8 million. The decrease in non-interest expenses was partially offset primarily by higher salaries of $0.7 million, resulting from new hires and $1 million of consulting fees in the third quarter in connection with the engagement with FIS. Any more color on the degree of step-up that we could see in the fourth quarter and I guess in the third quarter, it looks like that the NII improved $11 million sequentially and the margin stepped up 33 bps."
}