{
    "symbol": "AMTB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-20 13:45:29",
    "content": " Net income attributable to the company was $18.8 million, down 10.3% quarter-over-quarter driven by the recording of a provision for credit losses of $20.9 million which includes a one-time $11.1 million provision expense in connection with the adoption of CECL, as well as some other items which Carlos will cover in further detail in the coming slides. In the fourth quarter, we recorded a one-time day one $18.7 million adjustment to retained earnings with a corresponding after-tax cumulative effect of $13.9 million to account for the CECL impact as of January 1, 2022, and a day two $11.1 million adjustment to provisions to account for the CECL impact for the year ended December 31, 2022, including loan growth and changes in macroeconomic conditions during the year. Non-performing assets totaled $37.6 million at the end of the fourth quarter of 2022, an increase of $12.5 million compared to the third quarter and a decrease of $22 million compared to the fourth quarter of 2021. Note that domestic deposits account for 66% of our total deposits, totaling $4.6 billion as of the end of the third quarter, up $455 million or 11% compared to the previous quarter. Our core deposits, which consist of total deposits excluding all time deposits were $5.3 billion as of the end of the fourth quarter, an increase of $114 million or 2.2% compared to previous quarter. The $5.3 billion in core deposits includes $2.3 billion in interest-bearing deposits, which increased $154 million versus the previous quarter, $1.6 billion in savings and money market deposits, which decreased $88 million versus previous quarter as opportunity cost of customers increases with interest rates, and $1.4 billion in non-interest bearing demand deposits, up $49 million versus previous quarter. Amerant assets under management and custody totaled $2 billion as of the end of the quarter, up $184 million or 10% from the end of the third quarter, primarily driven by an increase of $127 million in net new assets as we continue to execute on our relationship-focused strategy, as well as $67 million from an increased market valuation. We consider $2.4 million of our non-interest expenses as a non-recurring item, an increase compared to the $2 million in the third quarter of 2022 primarily driven by severance-related expenses, as I mentioned before, and also due to conversion expenses. Thank you, and one moment for our next question. Your line is open, please go ahead. We started estimating and itâ\u0080\u0099s probably in the $500,000 to $1 million a year - thatâ\u0080\u0099s preliminary expectations what we have, but again you have to have a four quarter average going north of the $10 billion in order for all these changes to kick in, so weâ\u0080\u0099ll definitely keep an eye and as we get closer, weâ\u0080\u0099re definitely going to do any type of GAAP analysis to understand. Thank you, and one moment for our next question. Your line is open, please go ahead. Thank you, and one moment for our next question. Thank you, and one moment for our next question. Your line is open, please go ahead."
}