{
    "symbol": "AMTB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 14:53:03",
    "content": " We're also pleased to report that based on the company's first quarter results on April 13, 2022, our Board of Directors approved a $0.09 per share dividend payable on May 31, 2022. Our total gross loans were $5.72 billion, up from the $5.57 billion last quarter even with the headwinds of $253 million in loan prepayments and the sale of $57.3 million from our former New York City loan production office that were classified as available for sale. Total deposits were $5.69 billion, and they were up $16.8 million compared to last quarter. And more importantly, core deposits increased by $150.4 million this quarter compared to the fourth quarter of 2021 as a result of our continued deposits first focus. Our core PPNR was $17.9 million, down by 5.5% compared to the $18.9 million reported in the previous quarter. As of the end of March, the valuation of securities under AFS designation have dropped almost $40 million after tax as a result of more than 180 points increase in the long term interest rate recorded in the last quarter. Loan portfolio highlights in the Slide 10 will show a total loan growth of $5.7 billion in total, up 3% compared to the last quarter. Consumer loans as of the end of March were $486 million, an increase of $62 million or 15% quarter-over-quarter. The allowance for loan losses at the end of this quarter was $56 million, almost 20% down from the $70 million at the close of the previous quarter. Non-performing assets totaled $56.7 million at the end of the first quarter of 2022, a decrease of $2.8 million or 4.7% compared to the fourth quarter and a decrease of $33 million or 37% compared to the first quarter of 2021. Total deposits at the end of the first quarter were $5.7 billion, up $61 million from the previous quarter. Domestic deposits, which account for 56% of the deposits totaled $3.2 billion, up $43 million or 1.4% compared to the previous quarter. Foreign deposits, which account for 44% of the deposit totaled $2.5 billion and they were slightly up by $18 million over the quarter. Core deposits, which consist in total deposits excluding all the time deposits, were $4.4 billion as of the end of the first quarter, an increase of $150 million or 3.5% compared to the previous quarter. This amount includes interest bearing deposits of $1.5 billion, savings and money market deposits of $1.6 billion and non-interest were in deposits went to $1.3 billion compared to the $1.2 billion in the previous quarter, which is reflective of our execution to prioritize this type of funding. During the first quarter of 2022, we repaid $180 million in short-term advances from the FHLB and borrowed $350 million in long-term advance and extended duration of this portfolio and fixed them at a lower cost than previously borrowed funds. Non-interest income in the first quarter was $14 million, down $63 million or 82% from the $77 million we recorded in the fourth quarter. Amerant’s assets under management totaled $2.1 billion as of end of the first quarter, down $92 million or 4.1% from the end of the fourth quarter, which was primarily driven by lower market valuations. Turning to slide 17, first quarter non-interest expenses was $61 million, up $5.7 million or 10.4% from the fourth quarter and up $17.2 million year-over-year. Excluding these items, core non-interest expenses was $54.2 million in the first quarter of 2022. The quarter-over-quarter increase was primarily due to higher non-interest expenses primarily in connection with the estimated contract terminations resulting from the company's transition to a new technology provider, though this was partially upset via savings for an FTE reduction; evaluation expense recorded in the change in the fair value of new year loans available for sale; rent expenses related to the leasing of the company's headquarter building, though this mostly offset by the income received from the sub-leasing of the property; increasing marketing expenses in connection with the company's efforts to increase brand awareness; severance expenses in connection with restructuring of the business line; and last, we had increased commission bonus payment primarily related to residential mortgage loan origination. Now the increase in non-interest expenses was partially upset by lower salaries and variable compensation costs, which were driven by a lower number of FTEs in the first quarter, as we mentioned before, resulting from the agreement with FIS; decreasing legal fees, primarily due to the absence of additional expenses incurred in fourth quarter 2021 related to the cleanup merger and other special transactions; lower depreciation and motorization expenses resulting from the sale of the company's headquarters. What’s interesting to see Michael over the quarter the increase on the C&I, which accounted for almost $130 million that was -- that’s accretive to the yield and the overall performance of the loan portfolio. So $54 million core that we reported this quarter, it's considerably higher compared with the run rate that we will face from now on."
}