{
    "symbol": "BTI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 20:43:01",
    "content": " We grew New Category revenues by 25% in constant currency and we have delivered more than a 50% reduction in New Category losses, alongside a continued increase in New Categories investment to a total of GBP1.1 billion in the first half alone. In the first half, we delivered revenue growth of nearly 4%, driven by new category growth of 45% and continued strong combustible price mix of 5%. I'm particularly pleased that for the first time revenue growth in all three categories exceeded strong volume growth, with the growing equity of our three global drive brands enabling us to take pricing in all three categories. In Vapour, we continue to extend our value share leadership position with Vuse achieving 34.7% value share in the top five markets, up 1.2 percentage points, despite the rapid growth in disposables. In Europe, which represents around half of global THP industry sales, Hyper continues should drive strong momentum with glo revenue growth of nearly 90%. Adjusted profit from operations was up 5.5%, driven by a material improvement in New Category profitability, continued strong pricing, and efficiency gains from factory and salesforce rationalization. We are delivering on the operational priorities we set three years ago, and we are continuing to deliver robust financial results, driven by: continued strong growth and improving profitability in New Categories, the resilience of our combustible business, continued savings driven by Quantum and strong cash generation. And we are demonstrating last year with a growth of 50% in â\u0080\u0093 51% in revenue and 45% in the first half of the year with a total number now of consumers of 20 million with a growth of more than 2 million in the first half of the year, which is even better than last year, that we are absolutely capable of driving our growth and that we have very strong brands. Thank you very much. First of all, thank you very much for recognizing that we have a very strong position on our combustible business and as I always said the three priorities for the company is value in combustibles step change in new categories and simplifying the business. Thank you very much. Thank you very much. Thank you very much. As we said, we did in 2021, we'll do in 2022, step change in new category, 51% growth last year, 45% on a bigger base in 2022 and Â£1.5 billion that is -- was Â£1 billion then went to Â£1.5 billion and now we say that we will deliver more than that."
}