{
    "symbol": "HSBC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 09:26:02",
    "content": " Three years ago, the fair criticism of HSBC was that unprofitable or subscale businesses and clients were dragging down good profitability from our international proposition and from the profits generated in Hong Kong and the U.K. And we expect to have substantial distribution capacity for higher dividends, more buybacks and potentially a special dividend in early 2024. On this slide, you can see that reported net interest income was at $9.6 billion, up 41% on last year's fourth quarter. The exposure booked in Hong Kong reduced by around 20% in the second half of the year from $11.7 billion in -- at Q2 to $9.4 billion, and this is primarily due to repayments. And finally, on the proceeds generated by the planned sale of our Canada banking operations, subject to the completion of the transaction, of course, we anticipate 3 potential uses: one, a special dividend of $0.21 per share, which will be the first priority use; two, we'll consider additional buybacks over and above any existing buyback program; and three, we'll retain capital as required within the business. Considerations of buybacks have been brought forward to the quarter 1 results, and we have signaled to $0.21 per share special dividend as the first priority use of proceeds generated by the planned sale of HSBC Canada, all followed by increased investment in growth and further buybacks in '24 and '25, subject, of course, to continued strong capital levels. The one thing I just want to call out in Hong Kong to be mindful of is HIBOR, which is obviously a leading indicator of NII performance in Hong Kong is moved all the way to 5.3%, 5.4% and dropped all the way to 2.4, where I think it's around 2.9 today. Of that $2.5 billion, $1.3 billion was generated in Q4, obviously, with the rate level with the assumption that the money -- the bank lends to the trading books in Global Banking and Markets stays where it is today and the rates stay where they are today, then it is not unreasonable to assume you can annualize the Q4 $1.3 billion for the full year 2023. The second one is, yes, fee income has been subdued in 2022, particularly in wealth and we explained the situation in Hong Kong earlier as well as in the capital markets and advisory activities in Global Banking and Markets, both of which do seem to reverse at least the first month of this year has been much more optimistic."
}