{
    "symbol": "MUFG",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-18 09:55:01",
    "content": " On the other hand, line five, net gains and losses on debt securities decreased by over ¥250 billion year-on-year, mainly due to loss on sales of foreign bonds in the fourth quarter when US interest rate rose, as a result of portfolio realignment to improve profitability in the following fiscal years and beyond. Next, line nine, net gains and losses on equity securities increased by ¥184  billion year-on-year, thanks to sales of equity holdings under steady stock markets. And lastly, line 15, net extraordinary gains and losses as reported in the second quarter financial results briefing extraordinary loss of ¥129.7 billion was recorded in the fourth quarter due to the implementation of new methodology of impairment loss recognition linked to fixed asset allocation of each segment, resulting in a full year loss of ¥47.7 billion. On the other hand, as I explained earlier, profits in Global Markets Business Group decreased, mainly due to the loss on sales of foreign bonds in the fourth quarter, but was partially offset by gains on equity securities that are not included in net operating profit. We expect credit cost to be almost the same level as in fiscal year 2021 taking into account factors such as decreasing gains of equity securities as the recording of valuation losses on bonds related to sale of MUFG Union Bank, we have set a target of ¥1 trillion as profits attributable to owners of parent. From this perspective, global markets business group plans for profit increase in FY 2022, but slightly lower than in the past as fiscal year 2021 had an unplanned loss of about JPY 140 billion on foreign bonds and approximately JPY 25 billion to JPY 30 billion loss in sales and trading in overseas securities subsidiaries. Thank you very much. My second question is you have set a target of JPY 1 trillion in profits attributable to owners of parent for fiscal year 2022, but I think there are many special factors in this fiscal year's plan below net operating profit. Since net operating profit for the entire customer segment is expected to increase by JPY 50 billion year-on-year, the plan aims for an increase of JPY 80 billion after taking into account the impact of the sale of MUB. In the footnote on Page 1 of the financial highlights, it is stated in small letters, approximately JPY 270 billion of unrealized losses associated with securities and loans to be sold will be recorded for the first quarter in FY 2022, as other non-recurring losses, et cetera, which are not included in net operating profits. But for the ¥300 billion total credit costs below net operating profit in fiscal year 2022, the loss on valuation of loans related to the sales of MUB business is expected to be approximately ¥40 billion. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. To explain what constitutes the number, I think it will be confusing just to take out the gain on sales so, the held-to-maturity securities, unrealized losses associated with securities and loans mentioned earlier is recorded in the P&L as reversal gains of ¥120 billion."
}