{
    "symbol": "SMG",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-01 14:10:06",
    "content": " Your line is open. Your line is open. Your line is open. Is it -- are you saying organic sales growth for the U.S. consumer business should be up in the high-single digits this year and maybe shipments are not down that much, and with that sort of outcome, would you expect margins to be able to re-expand in the U.S. consumer business or is the commodity impact and the other things that you are seeing still going away? The performance of the team, the costs that have come out of the business, the efficiencies that we are running have put us and you saw it in the gross margin line as well in a good position to start to begin to think about how you recover back to those sort of early 30s, mid-30s type margins in U.S. consumer that Mike like to talk about and that is going to be a combination of higher volumes coming out of the production facility. Your line is open. Your line is open. Your line is open. So I think we had a good quarter and for those people who know us well and you do, it was a, I think, a lot of last year, I think, we take a step forward and it felt like get two steps backwards that just things were and the great thing about this company is that the company -- this is a company that with a challenge operates well as a group. Your line is open. And then, letâ\u0080\u0099s say, over the next two years, you generated this billion free cash flow EBITDA has improved, because raw material prices have come off and leverage is closer to 4x and then what happens, like, will the excess free cash flow then start getting back invested again in cannabis ventures, because you still believe in the long-term thesis, are you...\n Well, that has -- thank you for the trap. Your line is open. We said $1 billion of free cash flow generated over two years beginning last, I think, Q3 and then we also said under 4 times by the end of 2024, so not by the end of this fiscal year. Your line is open."
}