{
    "symbol": "LESL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-05 20:21:04",
    "content": " I'm going to discuss three things today: number one, the overview of our Q3 results and underlying performance drivers; number two, the execution challenges in one of our distribution centers that was the primary driver of our Q3 sales and margin shortfall, and the steps we have taken to correct the issue; number three, supply chain challenges and increased industry promotions, which also impacted results for the quarter. This increase is on top of our calendar-adjusted comparable sales growth of 19.4% in the third quarter of fiscal 2021, and represents comparable sales growth on a two year stack basis of 26.9%. On a two year stack basis, we generated comparable sales growth on a calendar-adjusted basis of 21% for residential pool, 78% for PRO pool and 33% for residential hot tub. Gross profit increased 7.0% or $19.9 million when compared to the third quarter of fiscal 2021, and gross margin rate decreased by 250 basis points to 45.1% from 47.6% in the prior year. Total distribution costs increased by $5 million when compared to the prior year period, and we estimate the incremental expense due to the issues at our New Jersey distribution center totaled approximately $3 million during the quarter. SG&A increased 12.1% or $14.2 million when compared to the third quarter of fiscal 2021, and decreased as a percentage of sales by 15 basis points. Gross profit increased 12.1% or $49.5 million when compared to the prior year period, and gross margin rate decreased by 160 basis points to 42.0% from 43.6% in the prior year period. On inventory, we ended the third quarter of fiscal 2022 with $361 million, up $137 million or 61% compared to $224 million at the end of the prior year quarter. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions."
}