{
    "symbol": "MAT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 21:40:02",
    "content": " Overall, the first half of the year was an outstanding period of growth for the company, with gross billings up 23% to over $2.5 billion, a new record level for Mattel and adjusted operating income more than doubling to $212 million. Looking at gross billings in the second quarter in constant currency versus the prior year, the company achieved strong growth of 24%, with increases in each of our leader categories: Dolls, Vehicles and Infant, Toddler and Preschool, as well as in our challenging categories overall, driven by Action Figures. Adjusted operating income was $121 million, up 82%, with the benefit of top line growth partly offset by the gross margin decline. Adjusted EBITDA increased by $55 million or 42%, benefiting from top line growth. We are reiterating our 2022 guidance for net sales growth, adjusted EPS and adjusted EBITDA, while adding the expected impact of currency translation on net sales and updating for a slight improvement in projected adjusted gross margin. Adjusted SG&A expenses were $343 million, an increase of 3% due to capability-building investments and market-related pay increases, partly offset by lower incentive compensation and optimizing for growth savings. Adjusted operating income increased by 82% or $55 million to $121 million, benefiting from the flow-through of top line growth, partly offset by the decline in gross margin. Looking ahead, we are also reiterating our 2023 goals to achieve high single-digit net sales growth in constant currency and an adjusted operating income margin of approximately 16% to 17% of net sales. Our 2023 EPS goal is to exceed adjusted EPS of $1.90, with the expected benefit from top line growth, margin expansion and utilization of improved free cash flow. And lastly, what I would say is that over time, we continue to expect the combination of pricing and cost savings will more than exceed the impact of inflation and contribute to margin expansion and help us get to our 2023 goal of 16% to 17% adjusted operating income margin."
}