{
    "symbol": "MAT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 18:38:03",
    "content": " Looking at key financial metrics in the fourth quarter as compared to the prior year, net sales declined 22% or 19% in constant currency. Looking at key financial metrics for the full year as compared to the prior year, net sales were flat or up 3% in constant currency with growth in gross billings in all four regions. Additionally, there are two significant factors that will impact our 2023 performance. With that context, in 2023, we expect Mattel full year net sales in constant currency to be comparable to 2022 and for adjusted EBITDA to be in the range of $900 million to $950 million. With that context, while POS increased by mid-single-digits in the fourth quarter, net sales were $1.402 billion, down 22% compared to the prior year or down 19% in constant currency. Adjusted EBITDA declined by $39 million or 4% to $968 million, primarily due to the lower adjusted gross margin partly offset by lower adjusted SG&A. Looking at gross billings in the fourth quarter by category, Dolls was down 24% with declines in Barbie and American Girl, partly offset by growth in Monster High and early shipments of Disney Princess and Disney Frozen. Additionally, there are two significant factors that will impact our 2023 performance. With that context, we expect full year net sales in constant currency to be comparable to the prior year with growth in the Dolls and Vehicles categories, offset by declines in Infant Toddler and Preschool and in our Challenger categories in aggregate, primarily due to action figures as we lap theatrical tie-ins in 2022. In terms of phasing, sales and earnings are expected to be down significantly in the first half as we wrap 20% top line growth last year, and further reflecting anticipated retail inventory reductions in 2023. And I would say that our sales and earnings for 2023 are expected to be down significantly, primarily in the first half, as we wrap 20% top line growth last year, recall our gross billings to outpace POS, so we won't have that. Now as you asked, it's also really important to recognize, and we talk a lot about category management, that Barbie is part of our Dolls portfolio, which also continues to be the number one portfolio in the world in the Doll category, and Mattel overall continued to grow share in both the quarter and the full year in the Doll category per NPD."
}