{
    "symbol": "FRGI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 21:27:04",
    "content": " Regarding first quarter results, our strong revenue growth continued with first quarter 2022 comparable restaurant sales performance of 8% versus first quarter of 2021 and we have now generated comparable restaurant sales results at or above 2019 levels for three consecutive quarters despite lost operating hours, some staffing issues and remodeling disruptions in select units. Encouragingly, our digital initiatives contributed to online channel first quarter 2022 comparable restaurant sales growth of 15.5% versus the first quarter of 2021. First quarter 2022 restaurant-level adjusted EBITDA margins, a non-GAAP financial measure improved to 16.1% compared to 14.3% in the fourth quarter of 2021. When compared to the first quarter of 2021, our restaurant level adjusted EBITDA margins declined during the first quarter of 2022 primarily due to total labor and food cost increases, which were partially offset in the quarter given our pricing action to offset those costs in the last months of the quarter. Regarding our efforts in driving growth across all channels, we continue to drive year-over-year growth in delivery channel with comparable restaurant sales growth of 17.8% in the first quarter of 2022 versus first quarter of 2021. Finally, dine-in and counter takeout sales are showing strong growth as consumers become more comfortable with the dine-in experience with dine-in encounter takeout comparable restaurant sales growth of 23.1% in the first quarter of 2022 versus 2021. Overall, we were pleased with our strong comparable restaurant sales growth in the first quarter of 8% versus 2021, and our comparable restaurant sales were at or above 2019 levels for the third consecutive quarter, with first quarter 2022 comparable restaurant sales of 4% versus 2019. Regarding sales performance, the first quarter improvement compared to 2021 resulted from a 15% increase in the net impact of product and channel mix and pricing and a decrease in comparable restaurant transactions of 7%. Total revenues increased 8.4% to $95.6 million in the first quarter of 2022 from $88.2 million in the first quarter of 2021, driven by the comparable restaurant sales increase. Regarding the first quarter trends in key expense categories, cost of sales as a percentage of restaurant sales in the first quarter of 2022 increased to 32.3%, compared to 31.1% in 2021 due to higher food and packaging costs, partially offset by our phased menu price increases. Restaurant wages as a percentage of net sales increased to 24.8% in the first quarter of 2022 from 23.2% in 2021, driven primarily by higher labor costs due to higher wage rates and overtime due in part to labor shortages, partially offset by lower medical benefits, including the impact of higher sales and lower incentive bonus costs. Other restaurant operating expenses as a percentage of restaurant sales increased in the first quarter compared to 2021, due primarily to the impact of higher repair and maintenance costs, higher utility costs, higher delivery fee expense due to increased delivery channel sales and higher insurance costs. As we expected, margins improved in the first quarter to a run-rate -- sorry to run-rate approaching 18% and we continue to target restaurant-level adjusted EBITDA margins of 18% to 20%, as our sales growth and labor optimization initiatives increasingly gain momentum, barring any unforeseen changes in the operating environment."
}