{
    "symbol": "FRGI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 08:52:05",
    "content": " We were very excited to see strong comparable restaurant sales growth in the third quarter of 9.3% versus 2021 despite the impact of the hurricane, which we estimate reduced comparable sales by approximately 2.6%. Regarding sales performance, total revenues increased 7.9% to $95.6 million in the third quarter of 2022 from $88.6 million in the third quarter of 2021, driven by the comparable restaurant sales increase partially offset by the negative impact of the hurricane estimated at approximately $2.6 million. The third quarter improvement compared to 2021 resulted from a 14.6% increase in the net impact of product channel mix and pricing and a decrease in comparable restaurant transactions of 5.3%, including approximately 2.2% due to the negative impact of the hurricane. Restaurant level operating profit margins declined during the third quarter compared to 2021, primarily due to the impact of the hurricane higher utility costs, repairs and maintenance costs, advertising costs, insurance costs as well as commodity costs, partially offset by the impact of higher restaurant sales. Regarding third quarter trends in key expense categories, cost of sales as a percentage of restaurant sales in the third quarter of 2022 increased to 32.4% compared to 30.7% in 2021 due to higher commodity costs and sales mix, partially offset by our phased menu price increase and improvements due to operational efficiencies. Restaurant wages as a percentage of net sales decreased to 26.2% in the third quarter of 2022 from 28% in 2021, driven primarily by lower special incentive and bonus pay partially offset by the impact of higher wage rates. Other restaurant operating expenses as a percentage of restaurant sales increased in the third quarter compared to 2021 due primarily to the impact of higher utility costs higher repair and maintenance costs and higher insurance costs, partially offset by lower operating supplies and delivery fee expense."
}