{
    "symbol": "PLXP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 13:25:04",
    "content": " As a reminder, the USPFT’s recommendations are not new and pertain only to the use of aspirin for the treatment of primary prevention, meaning for people who have never had a cardiac event; however, for patients who have already had a heart attack or clot-related stroke, aspirin is the cornerstone therapy. Your messages are clear - first, the physician’s number one concern is the health of their patient, and second, physicians don’t like erratic or variable absorption Dr. Ali and a growing list of other HCPs see the difference between Vazalore and enteric coated aspirin. In marketing to HCPs, we’ve developed an enhanced scientific narrative in collaboration with key scientific experts that supports the differentiation of Vazalore and reinforces the value proposition versus enteric coated aspirin for secondary prevention of cardiovascular events. There hasn’t been a day since that information came out that I haven’t had a patient come back to me with a recent heart attack or stroke and asking me, should I still be on my aspirin, so clearly when the data came out about primary prevention, it caused a lot of confusion in the patient population, but I think as patients are going back and talking to their healthcare providers, there is a reestablishment of what is primary versus secondary prevention, and what is the importance of aspirin as a life-saving therapy in their regimen. I think what is a new story is that physicians are actually quite shocked and they didn’t realize that aspirin never--the formulary of aspirin today did not go through the rigors of FDA approval that Vazalore has, and that there is new data now coming out about PKPD modeling and absorption and, I think, physicians as a whole, ACPs, the ones I talk to which are key opinion leaders in the United States, are really quite shocked, actually -I would use that word, and they want to have discussions about using the drug that actually works, especially when they’re doing life-saving interventions. If you’re going from zero to five new medications with a stent in your heart, or you’ve been in the ICU - the intensive care unit or the cardiac care unit with a heart attack or stroke, and now expanding down to peripheral vascular disease because you have blood vessels from head to toe, so if the insult’s in the brain, it’s a stroke, if it’s in the heart, it’s a heart attack, if it’s in your leg, it’s peripheral vascular disease, each one of those may require hospitalization, may require a procedure, so getting patients to change--that is the optimum time for patients to change a behavior, whether it’s quitting smoking, losing weight, improving their diet-exercise, but in addition, adding medications. As far as strategies to get the word out, absolutely P&T committees, we’re running a little bit of a campaign talking to chairmen who want to have much further discussions, grand rounds looking at the data because healthcare institutions too are in the business for providing the best and excellence in care, and they want the best and the most excellence in treatment strategies and programs, and I believe this is a healthcare issue that needs to be discussed in a much broader perspective, including speaking to organizations like the American Heart Association to clarify to patients the difference between primary and secondary prevention and the best strategies for those patients’ treatment. And Dr. Ali, with respect to patients who may need to take, let’s say, a proton pump inhibitor or some other adjunctive agent to help them with the GI tolerability issues of regular aspirin, do you see that as kind of a special sweet spot population for Vazalore or is it really just Vazalore is simply a better aspirin and whether you are trying to ameliorate that side effect or not, one should simply be on Vazalore for all the various benefits ?"
}