{
    "symbol": "PLXP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 13:56:13",
    "content": " During the second quarter, we intensified our focus to more strongly differentiate Vazalore and communicate the advantages from other older aspirin formulations and targeted this message to a broader audience of consumers and healthcare professionals or HCPs. Despite these market challenges, we remain as confident as ever in Vazalore's potential to transform the standard of care of aspirin therapy for secondary prevention of cardiovascular events and to reinvent aspirin for pain relief. I'm happy to be here again to talk about my clinical experience with VAZALORE, which I call aspirin 2.0 and my efforts to raise awareness and education among other healthcare providers colleagues regarding aspirin's efficacy and safety because at the end of the day that's what we're talking about. But more importantly there's something called shared decision-making where I'm informing patients of their medications, we're reviewing their medications and the patients feel assured about an FDA-approved product in light of their aspirin being Vazalore, really no resistance or pushback using the product, especially, when it's explained by their doctor or their healthcare provider. Email open rates across all target audience performed at more than three times the industry benchmarks on average indicating a keen interest in our new innovative aspiringâ\u0080¦ Second, on social media we've enhanced our presence with Vazalore -- advertising on Facebook and company-related news on Twitter and LinkedIn. We've adjusted our tactics to strengthen our brand offering and value proposition for Vazalore to both consumers and healthcare -- and we remain as confident as ever in Vazalore's potential to transform the standard of care, the standard of aspirin therapy for secondary prevention of cardiovascular events and to reinvent aspirin for pain relief. Dr. Ali in your conversations with colleagues regarding VAZALORE, you get the sense that there's just a lack of awareness of the relative benefits of the product itself a lack of awareness about the limitations of enteric-coated aspirin or is there just a general sense that the data on VAZALORE as it currently stands isn't compelling enough to recommend usage of the product given the incremental costs associated with it?"
}