{
    "symbol": "CATX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-08 20:45:05",
    "content": "  Operator: Good afternoon, ladies and gentlemen, and welcome to the IsoRay Fiscal Second Quarter 2022 Earnings Call for the quarter ended December 31,2021. Sir, the floor is yours. Good afternoon and thank you for joining us today for the IsoRay fiscal second quarter 2022 earnings call for the quarter ended December 31, 2021. Sir, the floor is yours. Good afternoon, and thank you for joining us today for the IsoRay fiscal second quarter 2022 earnings call for the quarter ended December 31, 2021. When used in this conference call, words such as will, believe, expect, anticipate, encourage and similar expressions as they relate to the company or its management, as well as assumptions made by and information currently available to the company's management identify forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on management's current expectations and beliefs about future events as of today, February 08, 2022. As with any projection or forecast, they are inherently susceptible to uncertainty and changes in circumstances, and the company undertakes no obligation to and expressly disclaims any obligation to update or alter its forward-looking statements, whether resulting from such changes, new information, subsequent events or otherwise. We will begin today's call with Lori Woods, IsoRay's Chief Executive Officer, and then Jonathan Hunt, IsoRay's Chief Financial Officer who will discuss the fiscal second quarter 2022 financial results. Good afternoon and thank you for joining us today for IsoRay's fiscal second quarter 2022 earnings conference call for the quarter ended December 31, 2021. Following my prepared remarks, our Chief Financial Officer Jonathan Hunt will provide a more detailed review of our fiscal second quarter financial results. Total revenue for the fiscal second quarter increased 19% versus the year ago, quarter to $2.82 million. This represented the third straight quarter of year-over-year growth for our core prostate business, as well as total company revenue. In fact, this quarter is the second highest revenue quarter in the company's history, right behind the quarter ended March 31, 2020 at the very beginning of COVID. In addition to growth in our core prostate business, our non-prostate brachytherapy business, which is about 25% of our total revenues now, grew 46% year-over-year. This is especially true when we look at this growth in context of the ongoing pandemic, I believe the pandemic-related headwinds to our prostate business will persist, but with diminishing magnitude moving forward. Consequently, we believe the number of men diagnosed with prostate cancer is going to grow at a historically high rate. This report estimates that nearly 270,000 men will be diagnosed with prostate cancer this year, which is almost 50% more than the number of men diagnosed annually in the years just prior to the pandemic. Despite these historic challenges driven by the pandemic, we continue to believe Isoray is well positioned to accelerate our growth and expand our share of the prostate brachytherapy market. With that in mind, we recently engaged in a thorough review of the prostate market opportunity and how our sales marketing strategy should be aligned. Our market research has reinforced the notion that although radiation, oncologists and urologists generally are receptive to the clinical data on Cesium-131, their awareness of the product is relatively low and they're more likely to use the isotope they were originally trained on. Grand rounds in urology is a leading network of clinicians who provide best practices and current clinical updates for the treatment of urologic disease and conditions, including prostate cancer. The program is an outgrowth of the International Prostate Cancer Update or IPCU, one of grand rounds in neurology's program offerings. It includes a multi-day CME accredited conference, focused on prostate cancer treatment updates. Isoray will be exhibiting at this conference and I, along with several senior Isoray executives will be there to assure a strong brand presence and take full advantage of some key networking opportunities. We believe that in the immediate future, the incorporation of MRI will offer a significant improvement in the planning, execution and evaluation of prostate brachytherapy. The FDA cleared prostate treatment we developed in partnership with C4, brings together MRI assisted radiotherapy with Cesium-131. At the end of February, we will be conducting an Internal Launch Preparation Meeting regarding this new prostate treatment opportunity, which will train our sales teams, so they will be better able to engage with key institutions and providers. As a result, we feel it should be well received by many of the growing number of men facing prostate cancer. Underpinning all of these programs, will be our continued concentration on refining Cesium blue's brand image and related messaging across our website, collateral and outreach to patients. I am equally excited about the growing opportunities for our proprietary isotope in treatment areas like brain, head and neck and lung. For example, seeds with a higher isotope activity may be more effective for nonsurgical treatment of certain lung cancer. And finally, I am happy to report that our immuno-oncology study combining Cesium-131 with Keytruda for the treatment of recurrent head and neck cancers, continues to gain momentum with recent additional patient enrollments as we move beyond COVID-related hospital restrictions that have been a headwind to the study thus far. Additionally, we continue to have ongoing discussions with other leading institutions, interested in potentially collaborating with the University of Cincinnati to potentially make this a multicenter study. We believe that our multi-pronged undertaking aimed at our core prostate business surrounding training, sales and marketing at this time, when we expect the overall market to expand is essential. At the same time, we see strong progress in the developing opportunities to treat applications for brain, head and neck, lung and other cancers. Lastly, we continue to make progress with respect to a number of strategic collaborations and investments, which we will share with you once we have more details, barring any unforeseen circumstances, I am encouraged by the recent growth and future opportunities for Isoray. I am going to discuss some of the financial information that was contained in our press release for the fiscal second quarter ended December 31, 2021 that we released a short while ago. Revenue for the second quarter ended December 31, 2021 grew 19% to $2.82 million versus $2.36 million for the same period last year. Driven primarily by seed and services revenue from GT Medical Technologies, other brachytherapy revenue increased 46% versus the second quarter of fiscal 2021. Gross profit as a percentage of revenues for the second quarter ended December 31, 2021 was 43.3% compared to 49.5% for the quarter ended December 31, 2020. The gross margin decline was primarily the result of the 34% increase in cost of product sales, when compared to a year ago quarter. Additionally, payroll and benefits expenses increased as a result of greater headcount versus the comparable year ago period. Total operating expense is consisting of research and development, sales and marketing and general and administrative increased 40% to $2.86 million versus $2.04 million in the second quarter of 2021. Total R&D expenses increased 88% versus the comparable prior quarter to $535,000. Sales and marketing expenses increased 13% versus the comparable prior year quarter to $702,000. The increase in sales and marketing expenses was driven primarily by increases in travel and tradeshow costs and increase in payroll and benefits expense to the merit increases, new higher and increase incentives compensation versus the prior year comparable period. The year over year increase was primarily due to increases in payroll and benefits expense due to annual merit increases and greater headcount, employment hiring expenses, IT consulting expenses, D&O insurance premiums, other public company expenses, audit and legal fees and travel expenses versus the prior year comparable period. The second quarter net loss was $1.6 million versus a net loss of $868,000 during the same prior year period. As of December 31, 2021, the company had cash, cash equivalence and certificates of deposit, that totalled $60.4 million or approximately $0.42 per share compared to $63.8 million at the end of the fiscal year 2021 ended June 30, 2021. Your line is live. It sounds like relatively significant step up in the internal investment side sales, marketing, DTC, those types of things. We do believe in, we are certainly hoping that going forward we'll have better access and things will ease a bit. When it comes to increased folks in other areas, certainly over the last few earnings calls, we've been talking about our shoring up internal resources to an additional growth. And what you're seeing here is definitely looking at our R&D resources and other resources as well, to make sure that we can continue to focus on some of these external things. We continue to look at opportunities and refine our opportunities and then ones that get to the due diligence phase work on our due diligence, but that does take resources to do all that. If it was a non-COVID year, I would say that typically our seasonality can be found during the summertime when people go on vacation and around the holidays as well. We saw COVID when COVID went up, we have been seeing the reduction in access to hospitals and patients getting in the system, and it hasn't necessarily lined up with the holidays or vacation times this year. So as we look into this first quarter here, my hope is that Omicron really does go down as people say it may and fall off quickly and we get back more into that summer environment that we've seen with COVID the last couple years. And so, as we look forward, that's what hoping to see, but we just don't know if another variance going to pop up and put us back in the same position where we were in with Delta, where we thought we were moving forward and then Omicron hit. Last one for me, realizing you're in the process of adding another reactor at a time where supply chain increasing material costs have been very common out there. Honestly, I thought the gross margin was a little bit better than anticipated for the quarter. So maybe just talk about the different material cost increase, well as the reactor impact, and one, we could see something back towards your call it 50% plus gross margins experienced in previous years. We expect to be able to balance those two reactors out over the coming quarter and to especially, margin's going to really start to improve and get back into those kind of that 50% range as we see the cells continue to improve. Really when the cells start to improve, that's when it allows us to be more efficient with our use of isotope which is one of the main cost drivers. And, in terms of other supplies, we have seen some increases there but we have not had any supply chain disruptions, but we've been able to maintain our so supply chains sometimes going out to other vendors at times, but nonetheless being able to acquire the supplies that we need throughout this time. Really nice 13% year over year growth in core prostate last quarter, now back above December 19 levels. As a fair synopsis, this is just a bit of post Delta pre Omicron recovery, coupled with Lori, the better access that you mentioned and possibly some of the ABS guideline inclusion that I believe was effective September 21. Yeah, I think it's fair to categorize certainly that we had a quarter where we had better access and we felt like we were getting in front of physicians. We have also been working as we talked about getting our training programs up and going again, getting clinicians involved in understanding how to do a great implant. And then pivoting over to the other non-prostate side, seems like we've observed an increase in customers, maybe trying GammaTile or at least an increase in talking about it, realizing that GT is a separate company. Are you aware of any increased marketing efforts on their behalf and related to that, has the new arrangement, I believe where you're providing GT with the seeds as opposed to the finished tiles, is that played any role. It just seems in our model, obviously there's some really big growth numbers that we saw in your fiscal '21 and we're seeing it slow just more, still respectable numbers on the non-prostate growth. I think we, in terms of what we see from our perspective, feel like they're making good progress on this front, and we're very excited to be able to support them. When it comes to us selling them seeds and them loading their own tiles, that's I think has been very beneficial. Curious, Lori, if you have any thoughts on the one year, the latest one year delay to the ROAPM to now not before I believe January of 2023. So, we continue to see this, get pushed back a bit and I have to give a lot of credit to ASTRO because I think they've been working really hard with CMS to get CMS, to understand the kinds of issues that are, are related to the complexity of providing radiation treatment to patients. And I think this year pushback is going to give us the opportunity need to look at some of the things, that could be better in that language, to help make sure that patients have access to the care that they need and so from that perspective although we continue to be hopeful that they will engage in the ROAPM model at some point. And yet patients who have high risk prostate cancers are likely to get external beam radiation, and brachytherapy. Your line is live. And that would get a lot easier to finish off the enrollment of this particular study and the more access we have the patients and giving them this opportunitynity for this type of treatment, the faster that will go. So over the next 12 months, we're looking at dividing out three additional territories across the country. I mean, is it -- I would imagine it's probably pretty sensitive as to each additional territory you add. But we absolutely do feel like, if our sales people can get in front of more people more frequently, we can move the process forward faster and that should result in these additional territories being helpful over time. And what we're finding is during COVID that takes a little longer than it did before, but where we can get to centers that already have Cesium on the license; we're taking advantage of that. And then working with these other centers to get them through the process as fast as we can, and more feet on the ground, more people able to support that will only improve, our ability to get that done. I mean, is there any thoughts where you might put some investment dollars behind training and involving some of the medical schools in the U.S, such that, residents get more education on brachytherapy? That's a really good question, Tim and something that we have been evaluating at. And I don't have specific institutions for you at this point in time, but certainly it behooves us to be in teaching institutions, where these clinicians are being trained, so that they're comfortable with Cesium, when they come out of these institutions. And some of the ways we're doing that right now, without actually being involved with the specific institution is when we work with folks like the American Brachytherapy Society residents, and other people go to these programs to learn more about what's happening in brachytherapy. So even though they're not getting trained in medical school for using specifically Cesium, we can get to them through areas like IPCU and the ABS to get them in front of our particular treatment and to get them the training, they need to be very successful in using Cesium-131. I mean, it looks like -- it looks like you have a, I mean, you did pretty well in the quarter and with COVID cases starting to decline you may have a line of sight to more radiotherapy procedures as we approach the summer. Your line is live. And during that time we've had other geopolitical kinds of things happen, like Crimea and some of the other political situations that have arisen from time-to-time during that point-in-time, we have never missed an order or had a disruption happen. We see at this point in time, no complications to that it's, it seems to be business as usual, and we appreciate their going out of their way to make sure that we're comfortable with that. I think the only one that actually, I found a little bit humorous, was the ones where they were talking about not being able to actually transfer money between banks in and out of Russia. There was -- they were looking at sanctioning, the ability to do that, which would mean we would have to, write a paper check and send it by, a DHL or an international courier service to, to actually make our payment versus any bank transfers. Well, we always think about it and we think about it that way, but I'll give you a couple examples that I think in previous years we've put in our K's and our Q's. Our problem ended up being because they're not a commercial reactor, they're a research re actor. So we are always looking at reactors around the world to your earlier question, to see what opportunities are out there and to figure out are they the reactor that has the appropriate flex rate to make Cesium-131 that's one of the criteria. And then pricing is always, always a question we look at, but we keep a list of all the reactors online, offline, coming online, going offline around the world, and we continue to investigate that on an ongoing basis. I also, what we're starting to see a bit more is people have gotten vaccinated and boosted and are, are maybe in some cases, just the fatigue of COVID is we're starting to see that there's upticks during the downturns of COVID. There was some, uptick going in COVID, but the rest of the quarter wasn't, and, and that's where we saw a significant upturn. And I think it is these people who haven't been able to get into the system that are -- that are looking to get into the system, knowing they need to and to some degree, be it either access, they just can't get in any other time or, patients actually looking at it and timing it saying now looks like a good opportunity."
}