{
    "symbol": "CATX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-28 22:35:23",
    "content": " And thank you for joining us today for the discussion of the proposed merger with Viewpoint Molecular Targeting and the Isoray fiscal fourth quarter 2022 and fiscal year 2022 full year earnings results for the quarter and fiscal year ended June 30, 2022. We will begin todayâ\u0080\u0099s call with Lori Woods, Isorayâ\u0080\u0099s Chief Executive Officer; and Thijs Spoor, Chief Executive Officer of Viewpoint Molecular Targeting; and then Jonathan Hunt, Isorayâ\u0080\u0099s Chief Financial Officer will discuss the fiscal fourth quarter and fiscal year 2022 financial results. Our sales for the fourth quarter ended June 30, 2022 of $2.5 million represented a decline of 8% versus the year ago quarter. In the short-term, although we do have adequate supply now of Cesium-131, we expect a decline in sales in the first fiscal quarter of 2023 ending September 30, 2022 versus the prior year. I am going to discuss some of the financial information that was contained in our press release for the fiscal fourth quarter and fiscal year ended June 30, 2022, that we released a short while ago. Revenue for the fourth quarter ended June 30, 2022 declined 8% to $2.5 million versus $2.71 million for the same period last year. Total operating expenses, consisting of research and development, sales and marketing and general and administrative, increased to $3.03 million in the quarter versus $2.44 million in the fiscal fourth quarter 2021. The year-over-year increase in research and development expenses was primarily through result of higher market research and consulting expenses, as well as increased payroll and benefits expense due to greater headcount versus the fourth quarter of fiscal 2021. Sales and marketing expenses were $654,000 in the fiscal fourth quarter of 2022, a negligible decrease versus the comparable prior year period. Isoray posted a net loss of $2.08 million for the fourth quarter ended June 30, 2022, compared to a net loss of $1.06 million for the quarter ended June 30, 2021. Basic and diluted share results are based on weighted average shares outstanding of approximately 142 million for the quarter ended June 30, 2022 versus 141.7 million for the prior year period. Turning now to our full year 2022 results, revenue for the fiscal year ended June 30, 2022 increased 7% to a record $10.79 million, compared to $10.05 million for the prior year. The companyâ\u0080\u0099s core prostate brachytherapy revenue increased 3% in fiscal year 2022 versus the fiscal year end June 30, 2021. Full year non-prostate revenue grew 23% versus fiscal year 2021 to a record $2.74 million and was driven by growth in sales to treat brain, including sales of GammaTile Therapy. Gross profit as a percentage of revenues for the fiscal year ended June 30, 2022 was 42.8% versus 50.9% for the fiscal year ended June 30, 2021. Total operating expenses were $12 million for the year ended June 30, 2022 versus $8.57 million in the comparable prior year period. The companyâ\u0080\u0099s net loss was $7.3 million for the fiscal year ended June 30, 2022 versus a net loss of $3.39 million in fiscal year 2021. As of June 30, 2022, the company had cash, cash equivalents and certificates of deposit that totaled $55.9 million or approximately $0.39 per share, compared to $63.8 million at the end of the prior fiscal year."
}