{
    "symbol": "SLHG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 12:07:01",
    "content": " Our focus with a specific patient population such as Medicare is to shift them from a traditional fee for service model, where in general, they can generate between $200 to $400 of visits per year, I’m sorry, to a value based care contract. Taking on full risk and Medicare Advantage, something that we’ve communicated as our goal for shifting the fee for service practices into value based care means materially also growing top line revenues, but opportunities for improved contributions for EBITDA. It’s where we continue to look at investment as a corporate entity where we believe growth will come from the most and now specifically, both within teams JV and our sort of newest welcome partnership with neighbor, the ability to look at membership growth and MA offers another opportunity as well, where the ability to look at membership growth in MA offers another opportunity as well, where there’s significant organic growth opportunities that can be done also at a alternative cost implementation and so some of these changes happen sort of overall. So, again, one of the things I didn’t mention I should have mentioned, of course, is along with neighbors ability to move into full risk we also have benefited greatly from having some very smart people joining our team that are leading the value based care efforts now on a national level to Skylight and so as part of this transition each health plan sort of has their own policy for annual enrollment. But it’s not as shifted away January, February, our ability now adjust our numbers and look at where we see health care from a non-pandemic model reflects something that we’re seeing today and what you’re seeing in lower urgent care visits you’re starting to see primary care visits again why we believe it’s so important to be positioned in the primary care sector patients starting to come back now that they’re not so fearful of exposure. So if I were to be more conservative and refer to when I believe we will have a greater inflection outside of the revenue contribution that’s coming from the acquisitions we’re making, but more specifically relates to the organic enrollment of our current patients, you’re probably looking safe to say Q1, ‘23 is when you’ll see those lives moving into a capitated for risk models, as well as the ACO reach that will kick off in January 23. Firstly, in terms of the company’s acquisition pipeline, I was wondering if you could talk about what type of transactions we should expect going forward in terms of the size, strategic reasons etc and it kind of would be helpful and secondary can you please clarify the value based for care program on the company’s gross margin because I noticed the in the press release under financial highlights, the third states BBC models you the higher gross margin. And of course, there’s opportunities to improve that margin on the full risk contract based on your ability to keep your patients healthier, and your ability to overall have a lower cost of expense with regards to their medical expenses. So when you’re looking at forecasting out your risk, and of course, keep in mind, I’m very glad for having the team at Neighbor coming on board at Skylight, because we leverage not only their experience over the last five years and successfully operating under these contracts, but also their ability to accurately, in most cases, beat their expected savings rates that they had forecasted. And so, so far, what we’ve seen is to the positive and like I said, our goal is to get it down to a margin, where it’s significantly lower than where the current benchmark might be at and allows us for us to see that growth in the leverage that we can continue to keep impacting here, we’ll both be accurately coding our patients to the cost of care that matches what their conditions are, and what they’re expected to receive as treatments for their conditions."
}