{
    "symbol": "INTC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 20:28:04",
    "content": " This afternoon, I will focus my comments in three areas: one, the key trends and dynamics that shape Q3 and are informing our outlook; two, the progress we are making on IDM 2.0, including our momentum on process and product road maps and our recent announcement that we are implementing an internal foundry model; and three, the actions underway to drive cost savings and efficiency gains aimed at accelerating our transformation. CCG revenue was $8.1 billion, up 6% sequentially, driven by higher ASPs on better mix and also benefiting from our efforts to work with customers to maximize our share position ahead of Q4 price increases. IFS revenue was $171 million, down 2% year-over-year, driven by automotive weakness with customers citing third-party component shortages, partially offset by growth in core foundry and IMS businesses. Given the deteriorating macro environment and based on input from our customers, we're now guiding Q4 revenue in a range of $14 billion to $15 billion with sequential decline driven by lower CCG revenue as customers reduced inventory lower NEX TAM and continued DCAI headwinds. So we'll update you as we progress over the course of the next three years and let you know how we're doing in terms of our progress, but we have very good line of sight on the first $3 billion and pretty good line of sight on the full $8 million to $10 million. So to me, it's really maintaining the good things and the 3 I described, the technology benefits, balance sheet capital and the supply chain while driving a lot more transparency, automation, efficiency and the result will be, I believe, is a much better Intel for the long term, not just for the external foundry customers, as you suggest, but for my internal customers as well. And also just piling on to that, we also look -- we always look at that through the lens of our smart capital strategy, where clearly, we're viewing both the gross CapEx, but more importantly, the net CapEx from your perspective and how we access other pools of capital to be able to build that out in a very financially prudent way and those other approaches, EU, U.S. Chips Act, ITC skip give us a lot of flexibility, combined with the shell first strategy to be able to make sure we're spending the capital, the more expensive equipment capital, more timed with the market demand clarity."
}