{
    "symbol": "INTC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 20:17:06",
    "content": " In data center, DCAI had strong year-on-year growth as customers continue to choose Intel and as we continue to deliver increasing value and innovation, we are seeing strength in both hyperscaler and enterprise, and we expect the market to grow double digits going forward, driven by workloads like AI and security. Mobileye achieved all-time record quarterly revenue of $394 million, up 11% sequentially and 5% in comparison to Q1 '21, which saw exceptionally strong auto production and pipeline rebuilding due to COVID-related recovery last year. As Pat mentioned earlier, we continue to see strong end user demand for our products across each of our business units and we reaffirm our revenue guidance of $76 billion as lower than previously expected PC revenue is offset by NEX growth and DCAI hyperscale customer strength. Although these headwinds have reduced our CCG revenue forecast, we expect CCG revenue to increase in the second half of the year as a return to normal seasonality boost demand, OEM inventory burn subsides and the ramp of our leadership, Alder Lake and Raptor Lake products position us to compete per share. For DCAI, we also expect to see a stronger second half of the year as hyperscale customer demand remains robust, component supply improves and the ramp of Ice Lake and Sapphire Rapid’s increased competitiveness. But by the second half, we expect those adjustments and obviously the strength of second half outlook, we do expect much of that inventory burn to have finished in the first half and a strong second half as we're ramping our new products that will have much better performance feature, some of that with higher costs, but also coming with higher ASPs. First half to second half, you always see the normal cyclicality of the client business and particularly in the second half, we're going into a much stronger product line with Alder Lake and Raptor Lake and the reversal of inventories for Raptor Lake and Sapphire Rapids starting to hit there as well, which will be very nice to improve both operating gross margins as well as the revenue outlook. But I'd also highlight that we are seeing the growth businesses, IFS, AXG and Mobileye being very strong growers for us, and they'll start more meaningfully as we go into the second half of the year, which is a little bit of the answer to Stacy's question before, solid growth across all of the business areas of the company, and we're starting to -- start seeing these new areas contribute in meaningful ways. So overall, we think that the strategy that we've laid out, we've gotten great response from our customers for, and as I already indicated, we're executing as we set Sapphire Rapids' first PRQs this quarter, many more as we go through the rest of the year, and we'll be ramping that aggressively and seeing a good response from the customers. I'd also again add, Tim, that our execution of our 5 nodes in 4 years on or ahead of schedule across it, this just reinforces the competitiveness that we've described where we do see ourselves coming back to a position of unquestioned process technology leadership, and we're building out the manufacturing capacity at scale to deliver that to our customers. And as I already indicated, we're seeing a tremendous amount of SKUs and instance types across all of the OEMs as well as all of the hyperscalers in the marketplace, and we're looking forward to those being broadly available in the second half of the year."
}