{
    "symbol": "INTC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 18:36:01",
    "content": " Calendar year 2022 design wins, including supervision, are projected to generate future revenue of approximately $6.7 billion across 64 million units. We generated $15.4 billion of cash from operations and an adjusted free cash flow of approximately negative $4 billion at the low end of the range we provided last quarter, despite approximately $3 billion of capital incentives that shifted from Q4 into 2023. Through reductions in spending and significant working capital improvements, we offset a $13 billion reduction to revenue expectations to come within $2 billion of our initial adjusted free cash flow guide, while still making the needed capital investments in support of our IDM 2.0 strategy, and to position ourselves for long-term growth in a market expected to reach $1 trillion by 2030. CCG revenue was $6.6 billion, a decline of 36% year-over-year as PC TAM deteriorated faster than expected due to macroeconomic headwinds. DCAI revenue was $4.3 billion in Q4, up 2% sequentially, with higher ASPs offsetting demand softness and down 33% year-over-year, driven by TAM contraction and competitive pressure. NEX quarterly revenue was $2.1 billion, down 1% year-over-year, as declining global GDP impacted the Edge business, offsetting growth in Xeon network CPUs and the ramp of our Mounts Evans infrastructure processing unit. Despite second half macro headwinds, NEX set another full year record revenue at $8.9 billion, up 11% year-over-year and marking consecutive years of double-digit revenue growth. AXG achieved record quarterly revenue of $247 million, up 34% sequentially and up 1 point year-over-year, supported by the launch of Sapphire Rapids HBM. While we're progressing toward a $3 billion spending reduction with significant austerity across the company, given the fixed cost nature of our business, we expect the sequential revenue decline will result in negative operating margin in the first quarter. We're forecasting gross margin of 39%, a tax rate of 30% and EPS of negative $0.15 at the midpoint of revenue guidance, inclusive of $350 million to $500 million of operating margin benefit from the useful life accounting change, split approximately 75% to cost of sales and 25% to OpEx. We expect FY 2023 operating expenses of under $20 billion, a roughly 10% year-over-year decline, consistent with committed cost-cutting measures totaling $2 billion, adjusting for the depreciation change. Jonathan, can we have the next question, please. It's the $3 billion for 2023, and it's the $8 billion to $10 billion improvement over the course of the next few years that really will help drive the costs and drive the gross margins beyond just revenue and loadings. Jonathan, can we have the next question, please. Jonathan, can we have the next question, please."
}