{
    "symbol": "JAKK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 00:56:04",
    "content": "  Operator: Good afternoon everyone and welcome to the JAKKS Pacific Second Quarter of 2022 Earnings Conference Call with management, who will review financial results for the quarter ended June 30, 2022. Mr. Berman will first provide an overview of the quarter, along with highlights of product lines and current business trends, then Mr. Kimble will provide detailed comments regarding JAKKS Pacific's financial and operational results. Before we begin, the company would like to point out that any comments made about JAKKS Pacific's future performance, events or circumstances, including the estimates of sales, margins and/or adjusted EBITDA in 2022, as well as any other forward-looking statements concerning 2022 and beyond are subject to Safe Harbor protection under federal securities laws. For details concerning these and other such risks and uncertainties, you should consult JAKKS most recent 10-K and 10-Q filings with the SEC as well as the company's other report subsequently filed with the SEC from time to time. In addition, today's comments by management will refer to non-GAAP financial measures such as adjusted EBITDA and adjusted earnings per share. Unless stated otherwise, the most directly comparable GAAP financial metric has been reconciled to the associated non-GAAP financial measures within the company's earnings press release issued today or previously. It's not often you get to report quarterly year-over-year sales growth of 96%, so you can hopefully forgive our enthusiasm around our latest results. With $220 million in net sales in Q2, we were finishing the first half of the year with $341 million shipped year-to-date. As we have said before, years ago, we implemented a new philosophy and approach to running our company. By focusing on methodically building and refreshing our product lines annually, we create the brick-by-brick foundation of our evergreen business, delivering the singles and doubles that generate our results year after year. In mass for customers like Target, Walmart, Amazon, Tesco, Carrefour and more for specialty channel customers such as Smith's, Kohl's, GameStop, Barnes & Noble; and for value drug and grocery customers like Kroger, dollar stores, Walgreens, CVS, Ross, Big Rock, Five Below as well as many others. With that foundation, there will sometimes be unique opportunities to exceed our expectations which we are seeing this year with many areas of the company performing extremely well and contributing to tremendous performance against our plan. To name a few, toys developed for the Disney animated film Encanto and the live action and CGI film, Sonic The Hedgehog 2 are having exceptional years. Beyond those 2, we are seeing amazing, continued expansion of the evergreen Nintendo IP, very strong demand for Disney Princess products as well as our Perfectly Cute Baby line. Lastly, with the international initiatives we have embarked on over the years on opening up offices to sell direct to retail in more markets, we are seeing tremendous growth, details of which I will highlight shortly. As we discussed last quarter, we have been seeing exceptional demand for our current product lineup. And at the same time, we've done everything we could to take advantage of off-peak shipping windows to secure the manufacturing and inventories we plan to sell domestically in the second half of this year. Our quarter end inventory level is $124 million, of which $36 million is in transit to our warehouses. Although this is a high level for Q2, it is reflective of our planning to mitigate potential exposure to our higher second half spot container rates and extended transit times. Given our strong sell-in and sell-throughs to date and reviewing the insights into retail demand for the second half of the year, we are quickly pivoting our attention to ensuring that we exit the year with tight inventories at retail and within our own warehouse infrastructure worldwide. Although it's true that there has been a lot of spending in the toy space over the past couple of years, it is also true that a 3-year-old is now a couple of years older too. And when you layer in basic play and play patterns that are healthy for children and the surge of new content reaching households at theaters and via streaming, we believe it's still a very good time in the toy kids consumer business. At JAKKS, we've been extremely focused over the years to try to ensure a large portion of our product SKU retail price points are lower than $30. That reality of affordable price points in combination with the current popularity of our classic and topical brands leaves us mindful of the current market conditions, yet optimistic that we will finish the year with the right kind of momentum heading into 2023. At retail, broadly speaking, our largest segments of business are performing best and our sense of the market is our velocity is as good or better than any other company in our space. Of course, we did see some point of sales that slowed down compared with some of the strong numbers we saw earlier in the year but we are certainly growing faster than the market in total. Last year, some customers were late setting planograms for the Halloween season. This year, we are stretched the industry standard timelines to work with our customers and factories to reduce that likelihood as much as we could. In total, we shipped $72 million in the quarter, more than double what we shipped in the quarter last year. Given our recent performance and outlook for the next 6 to 12 months, before the second quarter close, we decided to make an optional $10 million pay down towards our long-term debt. I will now pass the call over to John for some further discussions around our financials, after which, I will come back with some more thoughts about the balance of the year and how we are starting to think about 2023. Sticking with the idea from last quarter, I will skip reading through the various financial details included in our release today, even if they are pretty good. What I think you see in these results are execution against what we've been talking about the last couple of quarters, a longer and more expensive supply chain for us translates to or wanting to do even more FOB business and to reaffirm our focus on our biggest and most popular brands and segments. Add all those factors together and layer in the great momentum of our costume business, that leads you to types of sales numbers we've seen in the first half of the year when supported by the team's relentless execution. As we've also said before, we really do manage the business with a full year view, given our seasonality, so although we love being able to deliver quarterly results like these, we really are focused on finishing strong on 12/31 and then starting all over again. The sales performance to date has been exceptional, along with the timing of when it's happened, given that increased freight costs have eroded some of the progress we were making in gross margins in 2020 and early 2021. That said, we're pleased to only be down less than 80 basis points in gross margin percentage compared to last year. As Stephen pointed out, the narrative on ocean freight in Q2 was along the lines of, so far, so good, still unfavorable versus prior year but it certainly could have been worse. Where this topic ends up 6 months from now, we'll have a meaningful impact on our full year results as well as our ability to drive bottom line margin percentage improvements in 2023. With LIBOR increasing, this represents at least $400,000 in cash interest avoidance between now and the end of the calendar year based upon projected rates. Interest expense in the quarter was $2.3 million, down from $4.4 million in the same quarter last year. In aggregate, our adjusted EBITDA for the quarter was $27.1 million versus $5 million last year. You'll note with the surge in sales and our going forward of inventory, our midyear noncash working capital is very high compared to historical loans. Broadly speaking, we've intended for quite some time to get a shelf in place in case the situation arises in the next couple of years, where management and the Board feel offering some more shares would be the right thing to do. Leading off clearly, a remarkable quarter in our costumes business and congratulations to everyone who works under the Sky's business. Building on last Halloween success and sell-through, we saw most customers this year wanting to both go a bit deeper into the Sky zone with a couple in particular making bigger bets. A return of confidence in the box office is creating additional demand as our 2022 offering is anchored by theatrical releases like Jurassic World, Minions, Disney Pixar's Lightyear in addition to Disney's Encanto and Sonic 2. Moving to our Doll and Role-Play business, as a result of ongoing year-over-year growth we have been securing extended shelf's presence and incremental distribution for the Disney Princess franchises, generating meaningful incremental volume. Although nearly 3 years removed from our most recent film, Elsa remains one of the most popular Disney characters. And while as anticipated, Frozen sales are down versus last year, they have been selling above planned expectations. Finally, I also wanted to mention our promoted Playdate 32-inch doll segment will include our new version of our popular Rapunzel along with a new, really innovative, really fun, many moods Maximus. Outside of Disney Princess and Frozen, we continue to be excited about our support, the Disney ILY 4EVER brand with new dolls launching in October, inspired by Bell, Rapunzel and Minnie Mouse. As we mentioned last quarter, international expansion is happening with this business across a number of markets. When it comes to Disney's Encanto, we have been scrambling since January to keep up with demand and make sure that this will be a magical holiday season when it comes to Encanto toys. Supporting Encanto, last week, Disney kicked off a 32 city tour of a one-of-a-kind concert event featuring the entire length film and an on-stage band celebrating all the record-breaking hit songs from the beloved soundtrack. And looking into the second half of the year, we see momentum continuing. For Sonic The Hedgehog 2 movie and product line, we have exceeded our internal original forecast this year. One of the exciting things about this industry is despite the fact that we normally have a long planning cycle, with our teams currently deep in refining our fall 2023 introductions with new licenses and rights in the works, in addition to securing new rights for 2024 opportunities at the same time, we always have to stay in the moment, track and react to what is currently working at retail. As much as on January 1, this year, we felt we had a strong lineup for calendar year 2022, none of us would have predicted with high confidence that would all come together to the levels of success we are now looking to achieve for the full year. First, innovation within categories to maintain freshness and relevance; second, in addition to being relevant brands, new and exciting IP and licensed store relationships; third, geographic expansion to reach a rapidly expanded global market; and four, migration into adjacent categories to fulfill the needs of our consumers and our retail buyers. Those guideposts are both contributing to our results this year, while we also benefit from the additional pop of some breakout successes and creating the momentum, we have heading into the second half of the year and beyond. But looking beyond the top line, we remain very focused on continuing to improve margins and bottom line profitability as we have consistently done since our 2019 recapitalization. And the windfalls from this year and any potential reductions in working capital can be reinvested in improving our balance sheet, reducing our borrowing costs and are enabling thoughtful additive acquisitions consistent to what we have done and been saying for a long time. So if we take Encanto, Encanto on its own had a successful launch in last year in fall and also continues this year from first quarter onward. But Encanto has also, I believe, helped the enhancement of the overall Princess business as Princess, the Doll Role Play and Dress Up category, inclusive of Encanto has grown tremendously, with the overall just general Princess properties as well as our Style Collection. And with Nintendo and the gaming licenses, the hot gaming license are performing extremely well and continue and Encanto has been growing double-digit for years. And then we've had a tremendous year, almost overall in the majority of our evergreen stable businesses. As I mentioned earlier, Halloween, we more than doubled -- or doubled shipments in the second quarter and we have a as I mentioned, a pressure of new licenses as well as continuous licenses that have helped the growth in addition to building international that has actually helped drive growth and we're just starting this year. But overall, excluding our table and chairs, there's been some real market drivers but the basic business and the business that we've mentioned earlier that over 50% is under $24 has really helped during this time of unique periods in the economy. Just thinking through the full year and kind of as Stephen has mentioned some things about 2023, cushioning the softening from strong trends in '22. I think most of the year, we've been talking about how we see the front half of the year would be much bigger for us on a percentage basis than it has been in recent years. The goal for Jack, so what we have been doing is focusing on is bringing more in early and making sure and ensuring that our inventory levels both at retail, worldwide and our in-transit and distribution centers worldwide have a lesser amount of inventory going into '23 and we've been managing that at the start of this year. Yes, I think it's fair to say that our expectation for the full year is higher now than what we thought it was 3 or 4 months ago."
}