{
    "symbol": "AFRM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-25 21:18:10",
    "content": " We are proud of the progress we made this fiscal year as we introduced nearly 7 million more people to on a finance , expanded and diversified our merchant base to cover more than 60% of U.S. ecommerce and delivered very strong unit economics at 4.3% revenue less transaction costs as a percentage of GMV, well above our long-term range of 3% to 4%. I'll cover three topics before we open the line for questions: first, a more detailed review of our fourth quarter results; second, an update on what we are seeing in terms of consumer credit performance; and third, some perspectives on what we expect and how we plan to operate in fiscal 2023, given the macro environment, the growth opportunities ahead of us and the profitability targets we plan to achieve. Our strong top line growth, combined with the leverage we achieved on nonprovision transaction costs, drove a 25% increase in revenue less transaction costs to $184.3 million or 4.2% of GMV. In comparison to a more normalized fiscal third quarter of 2022, provision for credit losses grew just 10%, and provision expense as a percentage of GMV declined by 4 basis points sequentially to 1.65%. Adjusted operating loss was $29.3 million in the quarter or 8% of revenue, which was significantly better than our outlook for adjusted operating loss of 15% to 11% in the period, driven by better-than-expected RLTC and lower-than-expected operating expenses. GAAP total operating expenses, excluding transaction costs, grew by 76% to $461.6 million, driven by year-over-year growth in enterprise warrant and share-based expense of $102.7 million. Further, given timing within the quarter and the product mix, we expect to see a seasonal decline in both revenue and revenue less transaction cost as a percentage of GMV in the period due to how revenue is earned on these loans, similar to last year. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. But the impact of lapping the explosive growth in the first half of last fiscal year and the aforementioned Peloton categorical headwind, combined with the things like the shift in e-commerce and the discretionary spend, those probably matter more than the things that weâ\u0080\u0099re seeing directly on credit as we sit here today. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}