{
    "symbol": "BWMX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 14:53:04",
    "content": " As you may remember, our growth rates exploded during the first quarter of 2020 and continued through first quarter of 2021 due to lockdowns, resulting in increased demand for our household products and the increased need from people to generate an extra income when employment and economically active population sharply declined, which derived in a sharp increase in our associate distributor base. We believe that the restructuring of spending and the new commercial strategies have allowed us to start at an adequate level in 2023, which we can confirm with the results obtained in the first eight weeks of the year in terms of profit margins and average weekly sales, with the latter, growing 3.3% compared to what was registered on average during the fourth quarter of 2022. Consolidated net revenues increased 48% compared to fourth quarter 2021, explained exclusively by the inclusion of JAFRA results, which was partially offset by the decline of net revenues in Betterware. Consolidated gross margin expanded 1,605 basis points to 69.7% compared to 53.7% in the fourth quarter of 20 21, explained mainly by JAFRAâ\u0080\u0099s higher gross margin profile and a 233 basis points margin expansion in Betterware, mainly due to price increases, lower input costs and the normalization of supply chains globally. Consolidated net income was MXN209.3 million, 9.1% higher than in fourth quarter of 2021, mostly explained by inclusion of JAFRA to our results and partially offset by the higher interest expense due to the debt obtained to fund this acquisition. Earnings per share for the period were MXN5.62 and free cash flow for the quarter defined as cash flow from operations minus CapEx was strong with an increase of more than 300% attributed to both Betterware and JAFRAâ\u0080\u0099s cash flow generation, lower CapEx and efficient working capital management. For the year, including JAFRAâ\u0080\u0099s results from April 7, 2022, consolidated net revenue increased 14.5% compared to 2021 explained by the inclusion of the JAFRA results and partially offset by the decline of net revenue in Betterware. Consolidated gross margin expanded 1,198 basis points to 68.2% compared to 56.2% in 20 21, explained by JAFRAâ\u0080\u0099s higher gross margin and to a lesser extent a 186 basis points margin expansion in Betterware, mainly due to price increases the normalization of supplying chains, including the decline in freight costs. Consolidated EBITDA for 2022 was MXN2,230 million, 19.4% lower than in 2021 and EBITDA margin contracted 812 basis points to 19.2% due to the decline in Betterware's net revenue and loss in operating leverage."
}