{
    "symbol": "BWMX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 11:26:09",
    "content": " This acquisition was completed, we have been working very closely with JAFRAâ\u0080\u0099s talented management team to identify and execute synergies and efficiencies in the short-term, and to replicate Betterwareâ\u0080\u0099s business model supported by our strategic pillars of product innovation, technology, and business intelligence, which will enhance JAFRAâ\u0080\u0099s growth prospects and profitability in the mid-and long-term. In Betterware, we were not immune to the strengths, but our business proved its resiliency and now Q2 2022 average weekly sales are 100% higher than pre-pandemic comparable period, namely Q2 2019, representing a 26% CAGR and according to the market study, we expanded our market share to 7.7% in 2021, up from 5% in 2020, and 2.6% in 2017. And EBITDA margin contracted by 484 basis points to almost 24%, explained by lower revenues and lower operating leverage as our SG&A expenses represented 34.9% of net revenues for this quarter compared to 28.8% in the second quarter of 2021, despite a contraction of 25% in absolute terms in operating expenses. Our consolidated EBITDA margin was 18.4%, 1,039 basis points lower than the second quarter of 2021 explained mainly by JAFRAâ\u0080\u0099s lower margin profile, which opens an opportunity for us to improve its cost structure and increase the companyâ\u0080\u0099s profitability. Consolidated gross margin expanded 991 basis points to 67.1% compared to 57.1% in the first half of 2021, explained partially by JAFRAâ\u0080\u0099s higher gross margin and partially an expansion in Betterwareâ\u0080\u0099s gross margin of 348 basis points year-on-year. Consolidated net income decreased 53% year-on-year due to lower operating leverage and higher interest expenses related to the debt used for the acquisition of JAFRA and consolidated adjusting net income, which excludes non-cash expense of MXN 71.1 million related to the unrealized loss in mark-to-market valuation of financial derivative instruments decreased 37% year-on-year."
}