{
    "symbol": "ASPN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-29 08:38:05",
    "content": " We believe that our Q4 thermal barrier revenue will be at a record level of approximately $20 million and will enable us to achieve overall revenue for the year of approximately $180 million, revenue growth for the year of nearly 50%. With an active energy industrial business and with a strong position to grow with the EV megatrend, we are committed to our $240 million 2023 revenue target and our $720 million 2025 revenue target. This modest increase aligns with my remarks from Q2 around making sure that our OpEx increases become more modest and focused precisely on delivering three things: one, tangible productivity benefits through new process development and the implementation of systems that streamline our methods and drive overall productivity; two, new business awards through our EV thermal barrier technical sales efforts; and lastly, clear milestones in our R&D efforts. Capital expenditures during the quarter of $67 million included the site work, extract their pit formation as part of Plant 2â\u0080\u0099s construction, assembly equipment for a higher-volume thermal barrier operations, the R&D lab upgrades for our carbon aerogel battery material efforts and the initial construction of our advanced thermal barrier center. As progress remains on track for Plant 2 to enable our revenue growth in 2024, we have incurred $129.4 million in capital expenses through the end of Q3 towards it. Delivering over $59 million of revenues during the fourth quarter is subject to various external factors, such as our thermal barriers customersâ\u0080\u0099 abilities to maintain their stated vehicle production volumes and the supply chain of our main raw materials such as silanes, batting, CO2 and the local labor market, particularly for our aerogel facility in Rhode Island. And so as we were working our way through the end of Q3, we started allocating aerogel production to the energy industrial segment, and weâ\u0080\u0099ve continued to do that, and thatâ\u0080\u0099s whatâ\u0080\u0099s going to â\u0080\u0093 thatâ\u0080\u0099s what still gives us confidence into the $180 million for the year in 2022. Thatâ\u0080\u0099s super helpful, guys. And here, as we work to deliver the $20 million in Q4, I think weâ\u0080\u0099re going to see a very good improvement over Q3 and Q2, just given the nature of what these parts look like now and really the processes that weâ\u0080\u0099re using to make them. Thatâ\u0080\u0099s super helpful, guys."
}