{
    "symbol": "ASPN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 16:06:12",
    "content": " During the fourth quarter, we had record PyroThin thermal barrier revenue, slightly surpassing the $25 million mark and a robust energy industrial order book, which together enabled us to achieve our target of $180 million with growth for the year of nearly 50%. PyroThin thermal barrier revenue for the year surpassed $55 million, up nearly nine times from the 2021 levels. Our demonstrated capability both supply and demand to generate nearly $60 million of revenue in Q4 2022, supports our target of reaching approximately $240 million of revenue this year, consistent with our objective to double revenue from 2021 to 2023. Our total EV thermal barrier revenues in 2022 were up $55.5 million, an almost nine-fold increase over the prior years. For the year, our material cost of $92.2 million made up 51 percentage points of sales and as we've mentioned previously, these are at least 11 percentage points away from our long-term target. Capital expenditures during the quarter of $64.1 million included the partial construction of the main buildings in Statesboro, Georgia for Plant 2, assembly equipment for our automated thermal barrier operations, upgrades to our R&D labs and significant progress in the construction of our advanced thermal barrier development center in the Boston area. 2022 was a pivotal year for funding our growth with $478.4 million in net financing activities that featured proceeds driven by a $100 million from the issuance of a convertible note and $50 million of common stock issued to Koch Industries at a price of $27.90 per share, $73.3 million of net at the market offering proceeds from the sale of common stock at an average price of $17.70 per share and most recently, $267.9 million of net proceeds from our upsized public equity offering at $9.50 per share on November 30. Having expressed the target of doubling our revenues every 24 months since our Q4 2020 Earnings call, it would be logical to expect our 2023 revenues to be double the $121.6 million that the team delivered in 2021. With what we know today about our customers' demand for PyroThin thermal barrier in 2023, we're setting our revenue outlook for the year to be of between $200 million and $215 million. As we optimize our revenue mix, our total annual revenue capacity for plant in Rhode Island can be of up to $400 million per year and the capacity of Phase 1 of Plant 2 can be of up to $1.2 billion, for a total annual revenue capacity of $1.6 billion. In light of having to spend an incremental $135 million on Phase 1 of Plant 2, we focused on driving the flexibility to not just deliver our 2025 revenue plans, but to be ready for additional opportunities. First, we had record revenue in 2022 finished with a strong Q4 and positioned ourselves to achieve our target of doubling revenue from 2021 to 2023 to $240 million. Third, we are actively managing cost and schedule pressures of Plant 2 in a way that enables us to achieve our 2025 revenue target of $720 million and provides maximum flexibility to meet the potential for significant customer demand. Your line is open. Eric, a key point just to reiterate -- just one point I would just reiterate is, you know, as we are managing the build, first and foremost, was our ability to be sure we were able to meet our 2025 revenue target, a tripling of revenue to $720 million and the design does have that capability and more frankly as we see potential upside as we scale our business and as the megatrend continues to take shape. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}