{
    "symbol": "ASPN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-31 06:34:15",
    "content": " Over the past 16 months, we have raised over $300 million to scale a company that is targeting revenue of $1.6 billion and EBITDA of $400 million as we seek to fully utilize our second aerogel manufacturing plant in the years to come. With this commercial momentum and of course, our existing awarded programs with General Motors and Toyota, we are confident that we will have high year-over-year growth rates in 2022, and we believe that we are in a strong position to meet our $240 million revenue target for 2023. While these enterprise-wide investments require capital and burden margins in the short term, we believe they set us up structurally so that we â\u0080\u0093 so that with full utilization of Plant 2, we are positioned to generate $1.6 billion of revenue and $400 million of EBITDA and at the same time, have the opportunity from new businesses for potential additional breakout value. Starting with revenues, high demand across all our markets and the successful execution of various initiatives to increase our throughput, have enabled us to deliver $45.6 million of revenues in Q2. While we have mentioned that the EV thermal barrier opportunities materializing faster than originally expected, I will start by highlighting that our energy industrial revenues increased by 13% over the prior quarter to $34.9 million. Delivering this level of growth in our core business while also increasing our EV thermal barrier revenues to $10.8 million, a 42% quarterly increase demonstrates our teamâ\u0080\u0099s continued ability to deliver the growth that is required to meet our long-term objectives. More broadly, the higher revenue run rate of our energy industrial business enabled our total conversion cost to decrease by 4 percentage points of sales quarter-over-quarter to 46% or $20.8 million. Capital expenditures during the quarter of $37.9 million included the ground clearing foundation, and building of Plant 2, assembly equipment for a higher volume thermal barrier operation and the R&D lab upgrades for our carbon aerogel battery material efforts. We are geared to deliver revenues of $180 million with potential upside to $200 million, and net loss in the range of $79.8 million and $86.8 million and adjusted EBITDA in the range of negative $55 million and $62 million. Our capital expenditures for the year are expected to range between $250 million and $300 million, delivering $100 million to $120 million of revenues during the second half of the year implies a 10% to 32% increase in our Q2 revenue run rate. During the quarter our EV thermal barriers segment run at a roughly $40 million annual run-rate, while our energy industrial business ran at a roughly $140 million annual revenue run-rate. Above our run-rate of $150 million per year, our energy industrial business can deliver 20% plus gross margins. Assessing the value and probability of these quotes takes a path for us to become a company with $1.6 billion of annual revenue capacity, delivering over $400 million of EBITDA shortly after we achieve our near-term objectives through 2025. And second, we are laser-focused on turning the investments that we are making today into a business that is cash flow positive in 2024 and is on the way to its longer-term goal of $1.6 billion of revenue and $400 million of EBITDA. Thank you for your question. Today, we are highly focused on Phase 1 and on Phase 2 of Plant 2 and getting to that $1.6 billion of revenue and $400 million of EBITDA target. Thank you for your question. I believe that when we have plant to fully utilize that $1.6 billion revenue level and generating significant amount of cash in the business that we are likely to want to build our third aerogel manufacturing facility elsewhere and quite possibly in an international location, itâ\u0080\u0099s getting back a little bit to Alexâ\u0080\u0099s question as well that those OEMs may very well want to shorten that supply chain. Thank you for your question. Thank you for your question. For thermal barriers, when I model guidance, it suggests you should hit that annual revenue run rate of $120 million over the second half of next year, so potentially just 12 months to 15 months out and you expect to be able to achieve a gross margin of 15% at that run rate. Thank you for your question. Thank you for your question."
}