{
    "symbol": "KO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-25 12:14:02",
    "content": "  Operator: At this time, I'd like to welcome everyone to The Coca-Cola Company's First Quarter Earnings Results Conference Call. I would like to remind everyone that the purpose of this conference is to talk with investors, and therefore, questions from the media will not be addressed. These schedules reconcile certain non-GAAP financial measures, which may be referred to by our senior executives during this morning's discussion to our results as reported under generally accepted accounting principles. In addition, this call may contain forward-looking statements, including statements concerning long-term earnings objectives, which should be considered in conjunction with cautionary statements contained in our earnings release and in the company's periodic SEC reports. Following prepared remarks this morning, we'll turn the call over for questions. First and foremost, on behalf of our company and our entire system, I'd like to share our deepest sympathies to all those who have been affected by what's happening in Ukraine. Now this morning, I'll discuss how we drove strong results in the quarter and that we are reiterating our guidance even in the face of incremental challenges. We all know that much has happened in the world since we last talked with you in February, leading, for sure, to an operating environment that is fast changing and increasingly complex. However, we remain confident about the future and are well equipped to manage external factors worldwide through our strengthened leadership position with the right portfolio, the right strategy and the right execution in the marketplace. After a promising start to the year, the operating environment soon changed with very significant geopolitical conflict, a resurgence of COVID in various places, record-high inflation and continued challenges on the supply chain front. Nonetheless, we've consistently sustained our momentum from last year, moving with agility as conditions changed to generate strong top and bottom line growth in the quarter. We delivered 8% unit case volume growth, primarily driven by strong recovery in away-from-home channels and continued growth in our home channels. Volume growth was strong across all operating segments, driven by marketing investments and aided by an increase in consumer mobility as the impact of the pandemic abated in most regions. Our enhanced capabilities helped us gain value share overall in both at-home and away-from-home channels globally and across most of our geographic operating segments, a clear indicator of the power of our new approach. Amidst the dynamic macro conditions and an inflationary cost backdrop, we focused on delivering growth. Our accelerated agenda in marketing and innovation is tying our beverages to daily consumption occasions, adding and creating value for our brands. Additionally, we continue to work with our bottling partners to expand package offerings and strengthen distribution to capture growth opportunities, using all the available revenue growth management levers, including price, to win in the marketplace. In India, we drove excellence in integrated execution as consumer mobility improved across channels by stepping up product availability, adding approximately 240,000 outlets and over 50,000 coolers. Japan is emerging from its extended state of emergency, and we've increased our consumer base and driven market share gains in key categories. The Coke ON app reached 35 million app downloads, continuing the direct engagement with consumers to create and capture value. We also continued our focus on ESG initiatives with 100% recycled PET bottles now available in Japan for 5 key brands, including Coke and Georgia Coffee. In China, a strong start in January, led by an excellent Chinese New Year brand activation with Coke, was followed by strict COVID lockdowns, and this resulted in reduced consumer mobility. We're adapting how we engage with consumers depending upon local market conditions, and we're working in close collaboration with our bottling partners to focus on execution basics like increasing multipack availability and maximizing share of visible inventory in channels and regions that are open. In ASEAN and South Pacific, we gained share in key countries and across most categories, while consumer mobility was mixed and supply chain headwinds remained. Growth was led by Trademark Coke and sparkling flavors, driven by strong end-to-end execution of the , Sprite Heat Happens and the Fanta Colorful People brand campaigns. In EMEA, notwithstanding the conflict in Ukraine and an uptick in inflation, we delivered a strong performance in Europe in the quarter. The continued rollout of new and improved Coca-Cola Zero Sugar across key markets helped drive 5 percentage points of sparkling single-serve mix growth, which is ahead of pre-pandemic levels. Topo Chico Hard Seltzer is closing the gap with the #1 hard seltzer brand in Europe, and the eB2B business with myccep.com accounted for low double-digit contribution to total revenue. In Africa, macroeconomic recovery is underway, although conditions remain challenging due to inflationary pressure. In South Africa, we accelerated refillable PET expansion and the execution of in-store sampling to retain consumers. We are connecting with our existing customers in the digital space and have surpassed 65,000 outlets on the Wabi eB2B platform, significantly ahead of plan. Despite macro volatility and intense inflation in the region, Eurasia and Middle East drove top line growth through a strong suite of marketing programs across categories, led by sparkling and ready-to-drink tea. In Turkey, Coca-Cola Zero Sugar became the #2 immediate consumption player in value share behind brand Coke. In Pakistan, Coke Studio, a platform that unites diverse cultures through the power of music, drove social engagement that reached an all-time high in terms of impressions and viewings. In North America, we are seeing more inflation and continue to navigate supply chain dynamics. We're closely monitoring further pressure in some inputs such as high fructose corn syrup, PET and metals, along with wages and transportation as they impact us as well as our bottling partners. Despite these challenges, we continue to gain share in both at-home and away-from-home channels and across most categories. The strong rollout of Real Magic platform and the successful launch of Coke Starlight resulted in Coke Trademark being the fastest-growing trademark in measured retail, driving household penetration up a full point. In Latin America, we delivered strong performance despite challenging macro conditions, and the investments we made to sustain momentum are paying off. We remain focused on integrated execution and drove revenue growth faster than transaction growth, both of which grew faster than unit case volume growth. The Prospera loyalty program added nearly 50,000 retailers in the quarter while continuing to advance our customer-focused digital expansion. Notably, we have digitized nearly 2 million customers in the region, and we are leveraging the strong system alignment with our bottling partners and are continuing to execute for growth. Within Global Ventures, despite an inflationary backdrop in the UK, Costa continued to recover driven by retail and strong like-for-like sales with Costa Express. In China, while retail sales were impacted by store closures due to the pandemic, Costa ready-to-drink coffee sustained its #2 position and continue to innovate with Costa chart. Finally, our Bottling Investments Group delivered strong Q1 performance, driven by the expansion of affordable immediate consumption entry packs in key markets, and this resulted in share gains in sparkling. Clearly, the operating environment has proven to be more challenging, but we're pleased with the results we delivered in the first quarter. We anticipate many new chapters and challenges, including, but not limited to, ongoing geopolitical conflict; uncertain consumer sentiment amidst the increasingly inflationary environment, accelerated cost pressures and ongoing supply challenges; and of course, continued evolution of pandemic. That said, the changes we have made during the pandemic have left us better positioned than ever to capture growth, increasing our confidence in the future. The multiple levers of revenue growth management have never been more important, and our investments in building this capability over the past few years are giving us a clear advantage. Further actions on pricing will depend on the consumer and inflationary environment as the year progresses, but we will continue to rely on a mix of price, package differentiation and ever-sharper promotional strategies. Through integrated RGM and execution capabilities, we adapt to local market conditions and give consumers what they want, where they want it and at the right price. By extending package offerings to keep transaction driving price points in play, we retain consumers through affordability while also driving premiumization with innovation and targeted pricing. For example, in Latin America, we are continuing the expansion of refillables to sparkling flavors and juices, and this remains a compelling consumer proposition to address the need for affordability. In North America, we're maximizing value by initiatives like the one expanding the availability of mini cans for consumption across occasions such as breaks and meals and by offering 6 packs, 10 packs and 30 packs, driving an approximate 45% increase in retail dollars in measured channels and their near-20% increase in total distribution points. Our bottling partners complement our progress against our capabilities by continuing to invest in the marketplace, and they help put our purpose into action. We have strong partners with highly capable and experienced leadership, and we continue to build and foster our business and each in our relationship that drive system health and long-term growth opportunities. With our purpose to refresh the world to make a difference, we continue to focus our ESG work on issues where we can have a measurable positive impact on communities as well as create opportunities for our business to grow. We release our fourth combined business and ESG report tomorrow, an integrated approach to reporting that is a strong demonstration of how sustainability is linked to our business, builds resilience and demonstrates transparency. We have a long history of assuring select sustainability metrics while also providing key public disclosures against the TCFD recommendations as well as other reporting frameworks such as SASB, GRI and the UN Global Compact. In the report, we highlight how we and our bottling partners are driving business growth through our interconnected ESG goals and how we continue to seek an exponentially greater impact by fostering collective action, partnering across industry, government and society to address shared challenges. In conclusion, while there is no doubt the world is more uncertain and the operating environment remains highly dynamic, our strategy remains the same: to execute for sustainable growth through strengthened capabilities in innovation, marketing, RGM and execution. Today, I'll highlight our first quarter performance and discuss our full year 2022 earnings guidance; then I'll provide commentary on the overall operating environment and how our organization is navigating effectively to drive results. We delivered strong organic revenue growth of 18%; unit cases grew 8%, with strong growth across all operating segments; concentrate sales were ahead of unit cases by 3 points in the quarter, primarily due to the timing of shipments in Latin America and EMEA. Our price/mix of 7% was driven by strategic pricing, revenue growth management initiatives, further improvement in away-from-home channels in most markets and positive segment mix. Comparable gross margin for the quarter was down approximately 90 basis points versus the prior year, primarily due to the impact of 2 items: one, consolidating the BODYARMOR; and two, currency headwinds. Underlying gross margin expanded despite continued pressure from commodity costs, due to pricing actions in the market and a benefit from the timing of concentrate shipments. This was driven by strong top line growth which benefited from the timing of concentrate shipments and operating margin improvements, partially offset by currency and cost headwinds. On the cash flow front, we delivered free cash flow of approximately $400 million in the first quarter as our strong business performance was more than offset primarily by 2 items: one, cycling the timing of working capital benefits in the prior year; and two, higher 2021 annual incentives paid in the first quarter. Our balance sheet continues to be strong, with net debt leverage within our targeted range of 2x to 2.5x. As James mentioned, much has happened since we last gave guidance in February. The resurgence of COVID in China and some other geographies around the world is a clear indication that the pandemic is still very much a part of the conversation, and a reminder that the recovery path has been and will continue to be asynchronous. Obviously, there are lots of puts and takes at play, and we see a number of potential futures coming at us. But notwithstanding this backdrop, we believe our organization is better prepared today, and we're confident in the flexibility we've built and our ability to manage what's around the corner. We continue to spin the growth flywheels faster, and our local businesses are adapting and executing for growth. Based on current rates and our hedge positions, we are reiterating our currency outlook of a 2- to 3-point currency headwinds to comparable net revenues and a 3- to 4-point currency headwinds to comparable earnings per share for full year 2022. Additionally, taking into account our current understanding of recently issued regulations, we now expect an effective tax rate of 19.5% in 2022 versus the 20% that we had guided to previously. All in, we continue to expect comparable earnings per share growth of 5% to 6% versus 2021. And we continue to expect to generate approximately $10.5 billion of free cash flow for 2022 through approximately $12 billion in cash from operations, less approximately $1.5 billion in capital investments. But based on current rates and hedge positions, we expect the commodity price inflation to remain in the range of mid-single digit impact on comparable cost of goods sold in 2022. Additionally, we see incremental cost pressure coming from areas like wages and transportation. When it comes to capital allocation, our priorities remain the same, and we continue to balance financial flexibility with efficient capital structure. For 2022, we announced a dividend increase of 5%, a higher rate than in recent years; and we also announced the resumption of share repurchases with approximately $500 million in net share repurchases expected this year. Despite uncertainties around the world, our strategic transformation has fortified the organization to weather the storm, and we are extremely proud of how our people are responding and delivering. We are keeping consumers at the center, operating more effectively and efficiently and unlocking the immense potential of our growth portfolio of brands. I was hoping we could talk a little bit more about Latin America, an area like you called out about performance, in particular, Mexico and Brazil this quarter. It looked -- I'm guessing it might be in juice because I think you talked about sparkling being up, but anything in particular you're doing or the degree to which the market share performance is an area, a watch point for you and how you're balancing that versus thinking about recovering cost inflation. We'll be -- in the spirit of generosity, we'll try and -- because they're very related. Look, we have a great partnership with our bottlers in Latin America from the 2 very big ones. And we have developed collectively the system, many capabilities on many fronts, whether it be marketing automation, but particularly, the levers of revenue growth management and execution in volatile times. And that, I think, you see reflected in this quarter as we had a lot of good growth. And there was some pressure as much in juice or some of the juice drink categories, but also category mix. We are very much focused on, as we've talked about previously that when you are in a cost environment, that those cost increases, whether it be commodities or wages or logistics or marketing costs, need to go through over time. Sometimes when you're in a very high share market like Latin America and you lead on pricing, not all competitors necessarily follow immediately, and that can have temporary impacts on share. But we, with the bottlers, will be very focused on not only continuing to carry on growing, but to regain and expand our share position. Russia, in Q1, was another strong quarter. But clearly, there's risk consumer spending might weaken with the unprecedented inflation we're seeing. Well, clearly, my active generosity, and Lauren has unleashed a torrent of multi-question questions, but it would be harsh to cut it off at this stage, Dara. And as I and John and we talked about previously on calls, we believe that pricing for our business has to be earned for the brands. We have to give the consumer and the retailer reason for the price increase and for the value of our brands, whether it's the marketing, the innovation, the execution or the packaging options, we do that. It's not a cost-plus business, although we do seek, of course, to protect the margin structure by moving through changes in commodities and other costs. But when you go into high inflation, consumers come under pressure. There's clearly reductions in real purchasing power going on for some segments of the population, if not everyone around the world. And so our focus is very much to find those packaging and price options by channel where we can stay connected to people who are coming under purchasing power pressure, very much the affordability just building on the Latin America example for the last question; a lot of focus on returnable, refillable bottles because the economics of those packages work to an extent that you can have a lower price point for the package. And with reductions in purchasing power, we very much see the actual out-of-pocket price point and keeping a low entry point into the category is very important, also pushing the expansion of refillables in places like South Africa. So very much acting on the signs of consumer purchasing power pressure, but very much also anticipating that it will increase. The rhyme of history would tell you that at some point, either inflation or reduction in purchasing power or supply constraints eventually create a bump. And at that point, we will want to both be accessing the premium opportunities that have but very much with an anchor in the affordability and entry price point opportunities and necessities as consumers come under pressure. When I think about -- just to approach to capital allocation and business reinvestment, as you talked about it in the prepared remarks, you framed it as essentially unchanged as a framework. Maybe James, to your answer to the last question, maybe it's affordability or something like that. But just again, over my sense is it's moving around a lot under the cover. And as we -- as James just said, when you think about the environment that we're -- we have been dealing in and we will be dealing with the rest of the year, the name of the game right now is to do exactly that is to continue to invest in our brands so that we have the wherewithal to manage through whatever comes at us. I think at a local level, the mix of investments is something that we continue to be very flexible with. And we are leveraging the work that we have been doing over the last couple of years to be even more effective in how we're spending our marketing dollars, whether it's on building our brands or whether it's on supporting our RGM efforts in the marketplace. The other areas of our capital allocation framework, supporting the dividend, looking at opportunistic M&A and share repurchase, we covered in the script with the dividend and share repurchase, we continue to be very open as to what opportunities may be out there. And as I say, the mix of that investment is something that varies and will continue to vary depending on what we need to do locally. I had just a big picture question about how you're working with your bottlers who are experiencing pretty sharp cost pressures to essentially help them navigate through this tough environment, if you guys could talk about that. But as we go into a tough environment, as we always do historically, we make sure that we intensify our collaboration and partnership with our bottlers, both to work on what are the marketing programs and the innovation programs that are going to work in the consumer and the retail environment that we face wherever we are in the world, and also the execution initiatives and focus areas that bottlers can drive on. Because firstly, the environment is not the same in every country around the world. Some are opening up exuberantly and actually chasing and keeping up with demand and the kind of the reopening euphoria, all the way across the spectrum to parts of China like Shanghai, which is in full lockdown as though it were April 2020. Clearly, there are headwinds in terms of cost, whether it be commodities, logistics, wages. And as I said earlier in one of the questions, we work with our system, our bottling partners, to make sure we protect and sustain the margin structure over time. That's not necessarily true every single quarter, but that is our overall objective: earning the right to price the brands so that the system has the sort of margin structure and stability of that over the course of time, if not every single quarter. The reopenings provide fuel not just for overall demand, but improvements in channels, away-from-home channels where we're strong and leaning in with investment produces great results. James, I wanted to just circle back to the comments you made in the prepared remarks about ESG and, I guess, tying it to comp. And then also for your annual long-term incentive comp, the amount that's paid out in stock options, I think, goes up from like 1/3 to 1/2. Yes, I mean, firstly, we'd refer everyone who wants a greater depth to the proxy that's out there on our website, and we've tried to lay out some of the mechanics and our thinking behind the 2. We have made some changes, as you point out, Bryan, to the way the long-term incentives or more specifically, the performance share units, which are kind of a 3-year program. And because some of those ESG objectives take some time to execute against, we felt they were better embedded into the 3-year stock award programs. And then secondly, as you point out, with the Board and with the Compensation Committee, we felt to increase greater alignment with shareowners. I mean you can take that as a confidence in the future, but that's one very small stone on the large pile of stones of things we do to demonstrate that we believe this is a great company with a great future. Clearly, price realization has been very strong in the carbonated soft drink category and particularly North America with a very rational environment in the industry and pretty low elasticity so far. And then secondly, if you think you will see more promotional activity in the industry in the balance of the year. I mean our approach to pricing, I've commented a little bit on it already. And that is the combination of its activities in marketing, in innovation, in execution and the investments in the store and of course, in RGM to make the packaging and pricing architecture fit the consumers' needs. Obviously, what goes into a piece of that puzzle is also the cost environment, whether that be commodities, marketing, logistics, et cetera, et cetera. As I said earlier, clearly, as we go into reducing consumer purchasing power, we need to have affordability as front and center, and depending on where you are in the world, can take the shape of different packaging but it all becomes about the entry price point to the category, not the kind of the higher-end price towards the category. And it is all done with a perspective that not necessarily every single day, but in a reasonable time frame, the margin structure of the system needs to be sustained. You definitely don't want to get to a point where there's been a substantial cost push through, and that has not yet been passed on into the marketplace when any recessionary impact appears. In the same way, we have a bias to invest behind our brands in marketing innovation. And that, of course, leads us to take pricing more or less frequently depending on where you are in the world, and I expect to see more of that in the rest of the year. Maybe not just on your end, but some of the other moving parts, I suppose, on what needs to happen there beforehand. Clearly, as part of both our RGM initiatives, because the refillable, reusable packages tend to give you the opportunity especially in larger sizes, have a lower entry price point, which is particularly useful in developing and emerging markets. And so you have an intersection of a very important business imperative on affordability and the fact that ultimately, a refillable package is less likely to go to waste and has a lower carbon footprint. And so we're very much looking to invest behind refillable packaging, making progress in gaining in mix in Latin America, also been driving that in parts of Africa. We've even taken to experimenting with returnable glass in the Southwest of the U.S. And so we are very focused on this because it does work for both of these imperatives, and so expect to see kind of more focus and more investment behind keeping that up and working with retailers to make it simple for the consumers to get the credits when they return these reusable bottles. James, just to conclude on pricing, you mentioned that you continue to monitor further inflation pressures and also alluded to potentially further pricing. Well, clearly, I mean, I've talked about our approach to pricing several times. And you do see multiple price increases during the year, as a matter, of course, when you're in those sorts of circumstances, with cost pressures to push through as you seek to sustain margins over time. It has been apparent, and other people have commented on less elasticity in recent times as price increases have gone through. I can't give you the answer to that because it's very dependent on some macros, and it's probably going to vary by country. But we are very attuned to it, which is why I talked about how we are leaning into investing behind our brands so that we earn the right for the price increases, so that we can minimize the elasticity and that we keep a sharp eye on affordability, which again tends to minimize elasticity if we use RGM well. But as I say, if the choice comes down to, we think the elasticity is going up or we're going to have to not pass through some cost, we're going to err towards taking the price increase rather than not taking the price increase. As I said earlier, not seeing the cost go through and arriving at a recession being behind the curve is less desirable than embarking and having to take the hit from a greater elasticity in the short term. And so that's our kind of modus operandi, and we will certainly seek to earn the right to take the price increases. James, in the opening comments, you mentioned that you had digitally connected, I believe, with 2 million customers in Latin America. Simply put, the idea of connecting these customers is essentially that our retailers, particularly the traditional trade and the fragmented trade, remembering that on a global basis, about half of our sales go to the fragmented trade, whether that's from grocery side or fragmented in terms of being away-from-home and , so about half of the global sales go to that, is being able -- that they can order the Cokes they need or the rest of the portfolio that they need, they don't have to necessarily wait for the salesperson to turn up. And so very much it's about sales force enablement system, such that in the same way that consumers in the developed world can just use their phones to -- with whatever system, with whatever app is appropriate to order things, and they don't have to go to the store to get them. We see that the bottling system will be able to sell more and very much in the -- where we've implemented these systems, where it's a complement to the sales force, it has driven extra sales and driven retailer loyalty. And so we think we can see -- and obviously, we're very much engaged with the bottling partners to drive the connectivity, particularly for the fragmented trade so that they could order whatever they want, whenever they want from the Coke portfolio. And that's as true in the rollout, as you called out in Latin America. I mean, it was mentioned in your prepared remark, I mean Coffee was up 27%. Laurent, looking at the non-retail business of Costa, the Express machines, the kind of vending digital barista machine had a very strong quarter with transactions growing strongly, and we're starting -- and we're seeing -- now that reopenings have occurred, we're starting to see the focus on placement of new machines across Europe and the Middle East; and also in China, although that's got a little harder in the last couple of months. It's continuing to grow, and we've launched it also in some of the European markets. So starting to see those innovations roll out, and we'll see how they do in the coming quarters. James, I wanted to pivot to your business in China, given the uptick in COVID cases there and related lockdown measures. I mean, clearly, China is an important market to us. As I said in the script, we had a strong start to the year going into Chinese New Year. The lockdowns, as you can read in the newspapers, are still in full force, so to speak, in those cities where they're locking down. Of course, we're going to focus on what we can control. We certainly had 2 years of trying to look at what that looked like over the last couple of years, and we'll continue to build on those learnings and the playbook that we had and adapt as necessary. It's a little difficult to predict exactly what it's going to look like, but we feel -- said a different way, we feel better prepared and more resilient for the COVID journey of 2022 in China than we did in 2020. John said in the prepared remarks, there was improvement away-from-home channel in most markets, but not all. I appreciate Asia Pacific will have specific impacts in the quarter, as just noted. I mean, firstly on -- firstly, let me step back both. The away-from-home channels, whilst we have recovered to our 2019 levels, the away-from-home channels have not yet fully recovered. And in part, the -- and we -- I think I've talked about this on previous call, we've lost outlets in the course of the pandemic. That's true of the away-from-home, and that's also true of the fragmented grocery trades. Of course, there is a distinction by sub-channel with away-from-home, particularly QSR has done well, particularly those with digital and drive-through have done well. But again, globally, it's not quite back at the 2019. In terms of the current global status, yes, China very much impacted by COVID lockdowns, but there are other parts of Asia Pacific, Southeast Asia where there were pressures on the away-from-home channel. I mean, let me include Japan, which only just lifted the state of emergency, and we should start to see that improve. And of course, if there are recessionary impacts, either because of recession or loss of purchasing power in the face of inflation in certain parts of the world, then that will be an offsetting factor as we go into it. And part of that is because the nature of the retail landscape, the nature of the distribution systems and the nature of the alcohol regulation is different in different parts of the world. To the extent -- and you've heard me talk about like never say never in a kind of a probalistic view of things, to the extent that a case can be made for other products being on the trucks, probably other beverage products, including alcohol, and that is somehow going to make the system, the bottlers and it's going to sell more of our brands, then that is a question we're going to look at. We're going down that road, has been successful in selling more Coke products. Chile would be an example of that where there are other beverage brands, are typically alcoholic ones, whether that be beer or spirits on the truck and in the selling system, which has allowed us to have more salespeople with a digital overlay as we talked about on the previous question, so retailers can order things. But ultimately, it's successful not because we can get more things on the truck, it's successful because we can sell more of the Coke brands. Other parts of the world and not necessarily the same initial starting point, and it might make more sense. We make available the classic version, the Coke Zero Sugar version, and we invite consumers to drink the one that best suits them. But no, specifically, I don't expect Coke Zero to overtake Coke Classic in North America in the short term. Well, just to summarize, obviously, we're very pleased with our first quarter results. And while there are clearly more clouds on the horizon, our strategy is intact, and we are well equipped to execute and invest for sustained growth. Ladies and gentlemen, this concludes today's conference call."
}