{
    "symbol": "MP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 19:05:03",
    "content": " I will discuss some discrete tax items that impacted Q4, but for the full year, our strong earnings demonstrate both our enviable operating leverage and cost structure, but also our strong tax position as a domestic producer of critical materials, which will only get better as we transition to Stage II and take advantage of some of the benefits of the IRA bill. Moving to the bottom right graph, you will see that our production cost per metric ton increased 26% year-over-year and 17% sequentially, driven by the timing of maintenance costs during the quarter, as well as higher payroll expenses, including an increase in employee headcount to support the expansion of Stage II operations and the impact of cost of living adjustments, which we talked about last quarter. Excluding the Stage II related costs, Stage I production costs were roughly $1,600 per ton in the quarter, impacted by the same factors just discussed but primarily driven by the timing of maintenance events across our mining fleet and our crushing facilities, which we view as discrete. As Jim mentioned earlier, that more than covered the $308 million of growth CapEx during the year, which covered the significant completion of Stage II as well as material investments in the Stage III building shell, engineering and early equipment costs. As it relates to your CapEx question, what I would say there is in terms of the overall $700 million guide, which you are right, that was an all-in number thinking about the completion of Stage II, bringing online the Fort Worth facility as well as the heavy Rora separation facility at Mountain Pass. I mean I'll just -- hey Laurence, point blank, and very clearly, we have said consistently over time that we look at the Stage II and III businesses as separate businesses that certainly benefit that we're on the same platform, but that we have to make sure that incremental investment has a very attractive risk adjusted return on capital."
}