{
    "symbol": "NTNX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-03-02 21:07:09",
    "content": " During today’s call, management will make forward-looking statements, including statements regarding our business plans, strategies, initiatives, vision, objectives and outlook, including our financial guidance as well as our ability to execute there on successfully and in a timely manner and the benefits and impact thereof on our business operations and financial results, our financial performance and targets and use of new or different performance metrics in future periods, our competitive position and market opportunity, the timing and impact of our current and future business model transitions, and factors driving our growth, macroeconomic, geopolitical and industry trends and the current and anticipated impact of the COVID-19 pandemic. Now, turning to our guidance, the guidance for Q3 is as follows: ACV billings to be between $195 million and $200 million, representing year-over-year growth of 22% to 25%; revenue of $395 million to $400 million; gross margin of approximately 82%; operating expenses between $365 million and $370 million; and weighted average shares outstanding of approximately $222 million. The guidance for FY ‘22 is as follows: ACV billings to be between $760 million and $765 million, representing year-over-year growth of 28% to 29%, revenue of $1.625 billion to $1.63 billion, non-GAAP gross margin of approximately 82.5%, and non-GAAP operating expenses between $1.465 billion and $1.47 billion. Your line is open. When you talk about, Duston, that $18 million of renewal upside in the quarter, you broke it down to that we had good renewal activity overall, but we also had a pull-in of early renewals. Your line is open. Your line is open. But if I am looking at the $18 million of revenue upside – sorry, billings upside you reported this quarter, we are seeing that is almost entirely coming from the early renewals and about $10 million of that was from this co-terming maybe pull-in from Q3. Your line is open. Your line is open."
}