{
    "symbol": "NTNX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-25 19:00:03",
    "content": " Growth in ACV billings was greater than growth in revenue, because orders with future start dates that are booked and collected are reflected in ACV billings, but revenue can only begin to be recognized in the quarter of the actual license start date and also because of slight term compression from 3.3 years in Q3 2021 to 3.2 years in Q3 2022. This means that when there are delays in server availability from hardware providers, customers may choose to either: one, line-up the software subscription license stock base with the expected availability date for the servers, leading to us receiving orders with start dates in future quarters; or two, in some case cases, delay their orders until the hardware becomes available. The significant majority of the impact on our Q4 ACV billings guidance relative to our previously implied guidance for Q4 is due to the impact of increased supply chain challenges, which, as I described earlier, affects us in two ways; one, future start date, that is orders that customers book with us but that are not yet collected; and two, customers choosing to delay placing orders with us, pending the availability of hardware. The Q4 revenue guidance is more impacted than ACV billings guidance relative to their respective previously implied Q4 numbers because orders with future start dates that are booked and collected are reflected in ACV billings, but are only reflected in revenue in the quarter of the actual license start date. Moving on to full year revenue, the guidance for fiscal year 2022 is as follows; ACV billings to be between $735 million and $745 million, representing year-over-year growth of 24% to 25%; revenue of $1.535 billion to $1.555 billion; non-GAAP gross margin of approximately 82%; non-GAAP operating expenses of between $1.402 billion and $1.407 billion. Is there – appreciate the color you just gave, but is there a way to think of the backlog you now have that should come in when supply comes back, or put another way, is your backlog up by roughly the $90 million that you had to guide down for fiscal Q4, understanding there's multiple ways here of how orders get booked or delayed. So as you'll recall, one of the things we said was a significant majority of the Q4 ACV billings guidance relative to what was implied at our previous quarter when we guide for Q3 and for full year, the significant majority of that delta is coming from the supply chain challenges, and it shows up in two ways."
}