{
    "symbol": "VCTR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-10 11:03:02",
    "content": "  Operator: Good morning, and welcome to the Victory Capital Fourth Quarter and Full Year 2022 Earnings Conference Call. Following the company's prepared remarks, there will be a question-and-answer session. I would now like to turn the call over to Mr. Matthew Dennis, Chief of Staff and Director of Investor Relations. Before I turn the call over to David Brown, I would like to remind you that during today's conference call, we may make a number of forward-looking statements. Reconciliations between these non-GAAP measures and the most comparable GAAP measures are included in tables that can be found in our earnings press release and in the slide presentation accompanying this call, both of which are available on the Investor Relations portion of our website at ir.vcm.com. Good morning, and welcome to Victory Capital's third quarter 2022 earnings conference call. I'm joined today by Michael Policarpo, our President, Chief Financial and Administrative Officer; as well as Matt Dennis, our Chief of Staff and Director of Investor Relations. While we are not immune to the market backdrop, I am very pleased with the results we reported last night. At the end of each year, I like to step back and take a long range view of our company and review our progress against our long-term strategy and goals. At the start of the year, we laid out several key strategic objectives and we have achieved tangible and measurable progress in each area. As part of that, we continue to make strategic investments in hiring, technology, data, and marketing and distribution during the year and we are seeing that these investments are beginning to pay us back. Specific to the fourth quarter, net long-term outflows were elevated. We experienced clients selling assets at an accelerated pace for a number of reasons including tax loss, harvesting, capital gain, distribution avoidance, and pivoting to risk off positions to name a few. In total we returned more than $200 million of capital to shareholders, which was more than three times the $62 million in capital returned in 2021. At the same time, we continued to reduce debt to increase our balance sheet flexibility. Based on our positive outlook of excess cash flow generation, the Board declared an increase of 28% in our quarterly cash dividend this quarter. Additionally, we have continued to make investments in our business in areas that can have the greatest impacts. These included expanding the use of data in all aspects of our business, enhancing our technology capabilities, investing in distribution, marketing, continuing to hire new talent, as well as expanding the products and service offerings available for our direct investors. While many in the industry are cutting their capital allocated to invest in their platform and people, we are not. We are continuing to invest and hire at the same steady pace we have maintained over the last few years, and we'll do the same thing in 2023 while also maintaining our long-term adjusted EBITDA margin guidance of 49%. Turning to Slide 7, you can see the strong investment performance we deliver on behalf of our clients has continued throughout the year and its final quarter. Additionally, approximately 80% of our total AUM outperformed benchmarks for the three, five, and 10-year measurement periods as of yearend. During the year, our WestEnd Advisors franchise secured new platform placements with seven firms. In addition, we experienced more than a 25% increase of new advisors opening their first account with WestEnd during New Year. 2023 is also off to a strong start with three of WestEnd's products being added to LPL's Model Wealth Portfolios platform, which is the flagship platform for many LPL advisors. The increased shelf space we have secured for our USAA investments franchise outperforming fixed income products over the last few years, has us very well positioned to capture more market share as investors reallocate back to fixed income. Keep in mind, from a product offering perspective, we have mutual funds, separate accounts, and the ETFs available for this franchise. Share repurchases totaled 4.6 million shares during the year, which was significantly higher than in prior years. We pivoted to allocating more of our excess free cash flow to share repurchases given equity market conditions, and specifically due to the price of VCTR. Additionally, we did continue to reduce debt and we maintained our growing ancillary cash dividend. Our strategy included deploying capital support, earnings growth, capital appreciation, and balance sheet flexibility, while at the same time rewarding shareholders with capital returns. Lastly, subsequent to year end, we announce a new addition to our corporate board. With that, I will turn it over to Mike for more details on the quarter's financials. Revenue of $201 million in the fourth quarter was up 3% in the third quarter, which was consistent with the 3% decline in average AUM in the year's final quarter despite the higher point-to-point AUM. This compares with $89.8 million in the same quarter last year, and $374 million for all of 2021. The increase in year-over-year operating income is attributable to non-cash items, namely the change in value of contingent consideration for recent acquisitions. Looking at capital allocation, we returned a record amount of capital to shareholders during the year. In the fourth quarter, we returned $59 million to shareholders with $42 million of that through share repurchases and $17 million in dividends. Lastly, we increased our quarterly cash dividend by 28% to $0.32 per share, and that will be payable on March 27th to shareholders of record on March 10th. On Slide 11, you can see total AUM of $153 billion at the end of the year remains well diversified from a distribution channel and client perspective. Turning to Slide 12, long-term gross flows were $6.5 billion in the fourth quarter, which was the highest we've ever reported for a fourth quarter period. Full year gross long-term flows of $33.3 billion, also marked a new record. WestEnd Advisors, Sycamore, Sophus, and RS Global, each had positive net flows for 2022 and the fourth quarter represented the ninth consecutive quarter of positive net flows for our Victory Shares ETF business. For example, Fidelity Strategic Advisors and Edward Jones made model allocations to trivalent and RS growth respectively and Schwab added the Victory shares USAA core intermediate term bond ETF to one of its models. In addition, our market neutral income fund was added to the recommended lists at Morgan Stanley, Merrill Lynch, Saterra , Fifth Third Bank and LPL. On Slide 14, we break out our expenses which increased $10.5 million due primarily to an increase in non-cash expense related to the change in value of contingent consideration from recent acquisitions recorded in acquisition, restructuring and integration expenses. On a cash basis, compensation as a percentage of revenue held steady as designed at 24.5% and our variable operating expenses calibrated with our AUM and revenue. Moving on to our non-GAAP results on Slide 15, adjusted net income was $65 million in the fourth quarter. The tax benefit in the quarter increased to $9.5 million, reflecting the incremental tax benefit associated with the payment of the third USAA earnout payment of $37.5 million made in Q4. We're making no changes in maintaining our long-term guidance of 49% for 2023, which is inclusive of our continued investments in numerous areas to support our growth initiatives that Dave highlighted in his opening remarks. Lastly, turning to Slide 16, our net leverage ratio at year end was 2.4 times. As a reminder, we are reducing the floating portion of our debt and not the $450 million of debt that we have hedged at 3.15% interest rate. In addition, our $100 million revolver remains undrawn. That's part of an overall capital allocation strategy, which really the primary purpose of our capital allocation strategy is to really have a flexible balance sheet so we can go ahead and pursue acquisitions and the buyback and the dividend is ancillary to that. I'd reiterate what I said in our script that we think that the levels we're at today, there's really good value in our stock. And Dave, my followup is also on capital return. You know, with the dividend hike, I think your yield is now around 4%. We have a really positive outlook to the future and we think that the balance we have between debt pay down, buyback and dividend is the right balance. For 2022, if you go ahead and look at how we allocated capital, the majority of our capital allocation did go down to debt pay down. We generate a lot of cash and we have a portion of our debt that as you know, that is hedged out at about 3% plus. So I think all-in-all, we look at the dividend as a component. You know, so just to expand on what we said in the prepared remarks, we have 16 products under the USAA franchise. 15 of them I think are four or five star, which is about, it's really remarkable that we have this franchise with this excellent investment performance. We offer these products in ETF, a mutual fund, and also separate accounts. Since the acquisition, we've spent a lot of time building out the distribution on the retail and intermediary side and also on the institutional side. We're starting to make some progress and we think as investors come back into fixed income, we hope that as we progress through the year and the Fed, what the Fed is going to do becomes much more clear, we think we're really well positioned with the investment performance. And then also this is a franchise that manages about $25 billion in assets, so it's a sizeable franchise that is deep in resources and has been doing this quite a long period of time. You know, WestEnd Advisors was net flow positive in 2022 when a lot of their competitors weren't. We have excellent distribution there, and it's expanding, so we're really excited about that opportunity. Mike mentioned our ETF platform Victory Shares, the consistency of flows there has been really impressive, and we're seeing that moving into 2023 and we don't see that changing, so we're excited about that part of our business. And then lastly, we also with our New Energy Capital acquisition we expect that to make progress as well and that's around private funds, and we're excited about that opportunity. So, you know, I guess I wanted to just maybe start on the fee rate here. Yes, I think as you mentioned, our fee rate has remained very stable. And I think as we look out in some of the areas that Dave just highlighted, we would expect that the fee rate will continue to be driven by both beta impact as well as asset mix, channel mix, product mix. As we think about opportunities for expansion of fee rate, we've talked a little bit about the fulcrum fees we have on some of our products that gives some upside. Those fulcrum fees were positive in the fourth quarter, about 0.1 basis points, and there is opportunity for upside on that. But as we think about the guidance going forward, I would say we'll be in the 52 basis point range. And the last thing I would obviously say this quite often, we're very focused on margins. So fee rates will continue to move slightly in different directions, but I think the power of our operating platform really allows us to focus on margins. And Michael, you talked a lot about the platform additions for a number of your various different affiliates. You look at WestEnd Advisors, we own that business for all of 2022, and that was net flow positive. That was done in 2015, and that has been a consistent grower that took a little bit of time, but that has been a consistent grower. We also look at the opportunity that we have with the USAA fixed income investments and that as we see fixed income accelerate, we think that will be a grower. Today it's not, but we think that one will be a grower. And that has lots of different perspectives on that, and thatâ\u0080\u0099s what ranges in the different time and the different examples. Iâ\u0080\u0099d like to start on the capital return side of things, buybacks robust again and you guys spoke to that a bit in a prior question. But one of the things thatâ\u0080\u0099s interesting when we speak to investors about Victory and the discount, as many point to the large private equity ownership and concern either, concern about when that ownership might end up winding down versus, or maybe that is a reason for the discount. We also on the other hand, have done very well with the ownership of private equity. The board evaluates every time, every quarter, all different kinds of programs around what we do with our buyback, how we interact with our private equity shareholders. As we look forward, what weâ\u0080\u0099re focused on is really performing from a business perspective. And we think, as you have pointed out the discount, we think thatâ\u0080\u0099s a tremendous opportunity, entrance point for investors. Because those challenges are not business related, theyâ\u0080\u0099re really more ownership related. Weâ\u0080\u0099re focused on growing the business, doing smart acquisitions, taking care of our clients and weâ\u0080\u0099ll evaluate every quarter what we do with our buybacks and how we interact with the private equity sponsors. Unless youâ\u0080\u0099re getting a direct allocation from a CIO office or a home office, there will be a lag in time to educate the advisors to go out and do marketing material and to have meetings, so there is a lag. I couldnâ\u0080\u0099t give you a timeframe, but we do know from history that getting onto platforms, getting into models is the first step in a process of getting more clients and getting positive flows. And I think itâ\u0080\u0099s a really, really important first step to an end point of really seeing nice, a nice impact on flows. I could guess that some of it has to do with, maybe the market calming down a little bit and people focusing on thinking about the future as opposed to digesting whatâ\u0080\u0099s happening, given the market volatility. We had one large relationship that was ended, that was a relationship with a large amount of assets which impacted our total net flows for the fourth quarter. So for 2022 and for New Energy, I think it was a platform setting, so it was that business working in within our environment and getting themselves ready for a growth phase. Weâ\u0080\u0099re positive from a private market perspective and especially what they do, and especially with a team that does it, given their long track record and the space that they operate in. And when I look out, in the future in 2023 and beyond, I think for Victory New Energy was the first alternatives acquisition weâ\u0080\u0099ve done. Maybe just on M&A, you guys have been quite active over the years. Markets have been quite volatile, though financing costs have gotten a bit higher and bit that spreads have widen out. As a public company, weâ\u0080\u0099ve done four acquisitions in five years, so weâ\u0080\u0099ve been really active. I think in those four acquisitions, I think weâ\u0080\u0099ve done about $1.5 billion in capital. And as I look at the environment with pricing, with cost of, with financing costs, weâ\u0080\u0099re well positioned if we find something that works to execute on it with our balance sheet, with our history of the debt that weâ\u0080\u0099ve used and then also with our structure, we feel really good, but if we find something weâ\u0080\u0099ll do it. So with WestEnd, I know part of the ambition was about selling to more advisors. Yes, so we donâ\u0080\u0099t give specific flows for each franchise as you know, but I will tell you the three that you mentioned, if you accumulated their flow profile accumulated, all three of them are net flow positive. So if you look at, combined all of their flows that group will be net flow positive, so theyâ\u0080\u0099ve been additive to our net flow profile. As far as WestEnd specifically, I think we had some numbers in the script. We have added advisors, weâ\u0080\u0099ve added multiple platforms and weâ\u0080\u0099ve had that. And then NEC as I said this year in 2022 and 2023, we are preparing for growth there as we go out and think about how you grow and raise private funds. And if I think about the numbers, as I said, you put all three of them together, itâ\u0080\u0099s net flow positive for 2022."
}