{
    "symbol": "JBHT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-19 21:09:06",
    "content": " These include a flexible, much lighted asset position in our highway services offerings, compelling solutions for private fleet conversions aiding in the nuances of managing advanced transportation networks, a more economical and carbon-friendly full-load services offering in Intermodal, and a Final Mile delivery position that addresses a   growing demand channel, we remain in a leadership position across our many businesses, and from a position of strength financially and on the teams' experience and ability to navigate through an ever-changing, constantly evolving global supply chain, I am encouraged to be in healthy, cash-generating businesses across the company. Some trends we identified last quarter, like a softer transactional spot market remain, but also remains is a healthy demand for our Intermodal capacity and our professionally outsourced product fleet solution in DCS, and the frictionless way we connect customers with capacity in our highway services businesses by leveraging our J.B. Hunt 360 platform. We took delivery of an additional 1,300 containers in the quarter and expect to take delivery of more in the second-half of the year as we continue to invest in capacity to meet the needs of our customers, while our network velocity and resulting volume performance were disappointing in the quarter, the system and programs we have in place continue to protect the significant investments we've made on behalf of our customers. That said, we did adjust the dials mid-quarter on some of our platform parameters, and saw improvement in spot rate and freight trends as the quarter progressed, we will continue to target the right and appropriate balance between volume growth and profitability and our goal remains to outperform industry trends over the long-term on growth but more importantly, on delivering value to customers. Volume growth of 14% in the quarter supports that view, we see tremendous opportunity, as customers begin to think differently about the blending of their live network and drop trailer network capacity needs. So -- â\u0080¦\n That was Todd Flower, soâ\u0080¦\n We are having really good conversation with our customers, that I think, not unlike what's happened in the pandemic the last two years, there is continuing to be challenges in the supply chain that are creating uncertainty in the market, in particular with our customers around inventory, which is really generated from consumer behavior. So, if you can just talk about if AB5 is implemented or executed, what the implications are for the industry overall and specifically how J.B. Hunt's position in that and then, Darren, I was hoping you could update us on the joint initiative with BNSF, I saw the Intermodal, the transload facility I think you guys put up a few days ago in the press release, would just love to get an update on what BNSF the progress that they've made in terms of giving you a little bit more clear access to capacity, if that's being implemented now or is that sort of more to come that can maybe drive a step function improvement in the terms of the volumes? As you look at your mode in different way of servicing customers, is there a point where maybe you're concerned that the Intermodal kind of permanent modal shift has missed this opportunity, missed this window and if so, how do you kind of position all the different segments of J.B. Hunt whether that's a capital dollars or labor, et cetera to kind of shift gears pretty quickly if Intermodal is never going to really dream the dream? I will say I think we are well-positioned in any environment, whether the market turns south or stayed as is, we think that we're going to have a successful and good second-half of the year, certainly way too early for us to talk about anything beyond that, that we haven't had any customers specifically tell us that we should be concerned about volume."
}