{
    "symbol": "EXTR",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-25 12:19:04",
    "content": " We had another record quarter, as demand for cloud-driven networking and for Extreme Solutions remains exceptionally strong with good visibility through fiscal year end '23, leading us to raise our full year revenue outlook to the high end of our range. Our share gains are evident by a second consecutive quarter of double-digit revenue growth, 17% growth in product revenue, record free cash flow and a sizable backlog. The sequential increase in revenue and margins led to continued improvement and our operating model to record levels just shy of 15% operating margin, and we achieved EPS of $0.27 in Q2, up from $0.21 in the year ago quarter. Our second quarter revenue of $318.3 million grew 13% year-over-year and 7% quarter-over-quarter, which was above the high end of our expectations entering the quarter. The growth of cloud subscriptions and maintenance drove the total deferred revenue to $446 million, up 19% from the year ago quarter and 5% sequentially. Q2 operating expenses were $139 million, up from $127 million in the year ago quarter and from $135 million in Q1 '23, reflecting higher R&D investment and sales and marketing expense to support higher revenue growth. As we enter the second half, our confidence in the revenue outlook is supported by our product backlog of $542 million, our services and subscription deferred revenue balance of $446 million, as well as a product pipeline that is up double-digits year-over-year. Against this backdrop, we expect for Q3 revenue to be in the range of $315 million to $325 million, gross margin to be in the range of 58% to 60%, operating expenses to be in the range of $140 million to $145 million, and earnings to be in the range of $31.1 million to $38.4 million, or $0.23 to $0.29 per diluted share. Your line is open. Your line is open. And the call here given the acceleration of supply and what we've seen here, so the combination of strength of demand that we're forecasting as far as bookings, as well as the supply release we're calling the high end of that 10% to 15% range for the second half of the year, but we do expect it to go up in fiscal '24. Your line is open. Yeah, subscription growth, if we look at quarter-over-quarter subscription growth, year-over-year subscription growth, the trends have been somewhat consistent, what we've call is a long-term range where we've said, you're going to see a 30% to 40% subscription growth. So one of the things Cristina commented on, was the 38% growth in terms of the accrued subscription revenue, deferred revenue and then we think you'll see that rollout, but the long term model is, I'm sorry, 25% to 35% and that's the normalized level that, that I know we put out for our long-term guidance. Your line is open. Your line is open. Your line is open. Your line is open."
}