{
    "symbol": "OSIS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-04-30 15:00:18",
    "content": " Q3 revenues of $290 million, represented a 2% year-over-year increase, driven by growth in Security and Opto sales, which were partially offset by an expected small reduction in year-over-year Healthcare division sales. Q3 non-GAAP earnings per share were $1.43, up 4% from Q3 of fiscal '21, driven by a lower tax rate and smaller share count, which outweighed increased R&D, higher supply chain costs and a less favorable product mix. Moving to the Healthcare division, Spacelabs, where we had a strong core, although revenues were down about 3% than the prior year's Q3, which was expected as last year's Q3 contained patient monitoring revenues from COVID-related tailwinds, the division achieved nice operating margin expansion, driven by higher gross margins from a favorable product mix. The growth in Security and Opto sales were partially offset by a 3% reduction in year-over-year revenues in the Healthcare division, given the elevated demand for patient monitoring products, as Deepak described earlier, creating typical comps for this division in fiscal '22. The mix of sales within the Security division were less favorable than in the prior year's comparable quarter and revenues in our Healthcare division, which carries a higher gross margin than our other two divisions were down slightly, each of which has a downward impact on the consolidated margin. The Security division's adjusted operating margin decreased to 14.9% in Q3 of this year from 17.9% in Q3 of the last fiscal year, which more than offset the improvements in the other two divisions, primarily due to a less favorable mix of customer revenues, rising cost in the supply chain, higher marketing expenses for promotional activities that were specific to Q3 and increased R&D to support new product development. Yes, Larry, this is Alan. Yes, Larry, this is Alan. So, just think about it that all -- whether the equipment is Rapiscan equipment or it's made by Rapiscan's competitors, if the customer is going to go back and standardize it to make one central station to do integration, the software will be needed and that not only as a first installation software but also licensing fees and as a what we call number of shares increase as they get more people trained to be on the software, it will continue to increase."
}