{
    "symbol": "OSIS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-18 19:41:05",
    "content": " First, we reported record Q4 revenues of $337 million, a 1% year-over-year increase, driven by record Security division sales. Second, we reported record Q4 adjusted earnings per share of $1.96, up 27% from Q4 of the prior year, driven by productivity improvements, a favorable sales mix, tighter cost controls, a lower tax rate and a reduced share count which outweighed higher supply chain, logistics and labor costs. Before diving more deeply into our financial results and discussing the fiscal â\u0080\u009823 outlook, let's provide more detail of our business performance by division, starting with Security, where Q4 and fiscal â\u0080\u009822 revenues increased 4% and 5%, respectively year-over-year. The Optoelectronics and Manufacturing division generated total revenues including inter-company of $367 million for fiscal â\u0080\u009922, representing a 5% increase over revenues in the prior fiscal year and a new record for the division. So as mentioned Q revenues were up 1% compared with that of the prior year Q4, fiscal fourth quarter Security division revenues were up 4% on a very challenging comp, given the divisions exceptional performance in Q4 fiscal â\u0080\u009821. The Healthcare division reported a 3% reduction in Q4 year-over-year revenues, while patient monitoring and cardiology sales decreased in the quarter, there was an increase in services supplies and accessory sales, which tend to be recurring in nature. Research and development expenses in Q4 of fiscal â\u0080\u009822 were $14.6 million, representing a year-over-year increase of 5%. Net interest and other expense in Q4 of fiscal â\u0080\u009822 decreased to $2.4 million from $4.1 million in the same prior year period, primarily due to the adoption of the accounting standard, ASU 2020-06, which eliminated the non-cash interest expense associated with our convertible debt as we previously discussed. Overall, our adjusted operating margin in Q4 of fiscal â\u0080\u009822 increased 150 basis points to 13.7% compared to 12.2% in the same prior year period. We were particularly pleased with the increase in the non-GAAP adjusted operating margin in our Security division, which expanded to 19.7% in the last quarter of fiscal â\u0080\u009822 from 18.0% in the prior fiscal year fourth quarter, driven by increased service gross margin and lower operating expenses. Cash flow provided by operations was $22 million in Q4 of fiscal â\u0080\u009822 compared to $8 million in the same prior-year quarter, driven by higher profits and certain working capital improvements, CapEx in the fourth quarter was $4.6 million, while depreciation and amortization expense in Q4 was $9.7 million. Based on what we are currently seeing from our backlog and pipeline of opportunities and factoring the end customer timeline preferences for deliveries and supply chain limitations, we currently anticipate revenues and adjusted operating income will be strongest at fiscal quarters two through four in fiscal â\u0080\u009923. The nice thing for our whole year was, while we were very back-loaded in fiscal â\u0080\u009822 to Q4, we think it'll be a little bit more evenly distributed between Q2 and Q3 and Q4, while Q1 just becomes a little softer based upon our customer delivery preferences and some supply chain limitations. I think with some of the higher costs, given some of the supply chain challenges and some of the cost thatâ\u0080\u0099s already embedded in some of the backlog we have, I think we're currently anticipating that our gross margin will be relatively comparable to what we saw in fiscal â\u0080\u009822 on a full-year basis, it will bounce around a little bit based on the mix of revenues and the level of revenues from quarter to quarter on an annual basis should be comparable, give or take a bit."
}