{
    "symbol": "SFET",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-29 10:09:01",
    "content": " On a corporate level, all the actions and activities taken in the recent quarters led to revenues of $13.6 million for first nine months of 2022 already exceeding full-year 2021 revenues and presenting an increase of 109%, compared to the nine month period of 2021. We are extremely proud to execute these fundings that support the company growth without impacting our shareholders at the current market valuation, resulting in the addition of over $4 million on top of September 30, 2022 capital resources. Revenue for the third quarter of 2022 totaled $4.8 million, a 42% increase compared to revenues of $3.4 million for the third quarter of 2021. Operating expenses in the third quarter of 2022 totaled $5.1 million, compared to $6.2 million in the equivalent quarter of 2021. As of September 30, 2022, the company's cash and cash equivalents balance   to $3.8 million, compared to $4 million on June 30, 2022. These company's cash balance for September 30, 2022 does not account up for up to additional $4.3 million in future funds under its recently secured credit facility and investment financing. Net loss for the third quarter of 2022 totaled $2.4 million or $0.07 basic loss per ordinary share, compared to a net loss of $3.7 million or $0.12 basic loss per ordinary share as of September 30, 2021. So basically, our current expenses, we think we can optimize the revenues and we build an infrastructure, as I mentioned also in the call, we invested a lot in the last quarters to build the infrastructure from product and technology perspective,  resources perspective, and we think that our costs should remain more or less the same, while we think that we can scale up with revenues based on more or less the same cost. So, from consumer acquisition perspective, due to the fact that our model is working very well and is very attractive from IR perspective, we think that we can fund it even forever on this rev-share model and keep the company to be, look at the difference between the cash in the last â\u0080\u0093 in the end of the second quarter to the end of the third quarter and  that we can keep like this for many quarters."
}