{
    "symbol": "SFET",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-31 12:57:05",
    "content": " In the first half of 2022, we delivered record revenues of 8.8 million, an increase of 181% and $4.8 million in the second quarter, an increase of 168%. Since we acquired NetNut, it has achieved rapid growth in revenues started at $800,000 in 2017, to 5.3 million in 2021, and reached $3.6 million in the first half of 2022. Revenue for the second quarter of 2022 totaled $4.8 million and revenue for the first six months ended June 30, 2022 was $8.8 million. Gross profit for the second quarter of 2022 was $2.6 million, compared to a gross profit for the corresponding period in 2021 of $0.8 million only. Gross profit for the first half of 2022 was $4.7 million, compared to a gross profit for the corresponding period in 2021 of $1.2 million. Research and Development expenses for the second quarter totaled $0.9 million, compared to $0.8 million in the second quarter of 2021. Research and Development expenses for the first half of 2022, totaled $2.3 million, compared to $1.5 million in H1 2021, the increases attributed to the consolidation of CyberTech features and development expenses, and the development of new products were partially offset by a reduction in the research and development expenses of the enterprise security segment due to the agreement with Verizon. For the first six months of 2022, IFRS net loss totaled $7.9 million or $0.26 basic loss per ordinary share compared to a net loss of $4.9 million or $0.20 basic loss per ordinary share in the first six months of 2021. Non-IFRS net loss for the second quarter of 2022 totaled $2.5 million, or $0.08 basic loss per ordinary share, compared to a loss of $2.2 million, or $0.08 basic loss per ordinary share in the same period for 2021. For the first six months of 2022, non-IFRS net loss totaled $5.9 million, or $0.19 basic loss per ordinary share, compared to a net loss of $4.2 million or $0.17 basic loss per ordinary share in the first six months of 2021. Company's cash and cash equivalents for the six months ended June 30, 2022, totaled more than $4 million, compared to $3.8 million as of December 31, 2021. As of June 2022 shareholders equity totaled $17.3 million or approximately $0.57 per outstanding American Depository shares compared to shareholders equity of $24.2 million on December 31, 2021."
}