{
    "symbol": "LAKE",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-08 18:27:05",
    "content": "  Operator: Good day, and welcome to the Lakeland Industries Fiscal 2023 Second Quarter Financial Results Conference Call. During today's call, we may make statements relating to our goals and objectives for future operations, financial and business trends, business prospects, and management's expectations for a future performance that constitute forward-looking statements under federal securities laws. During today's call, we will discuss financial measures derived from our financial statements that are not determined in accordance with U.S. GAAP, including EBITDA, adjusted EBITDA, and EBITDA margin and non-GAAP net income. I'm joined today by Lakeland's Chief Operating and Financial Officer, Allen Dillard. As you saw in this afternoon's press release, Lakeland delivered another quarter of sequential improvement highlighted by quarter-over-quarter and year-over-year revenue growth and a gross margin of 41.3%. Revenue for the second quarter was $28.2 million, up 3.3% sequentially driven by increased volumes and up 2.6% compared to the second quarter last year. Importantly, we had continued strong profitability with another quarter of gross margin above our long term target threshold of 40%, which is further evidence that our profit margins are sustainable as we grow the business in the post-COVID era. While we're proud of our results, and milestones achieved during the quarter, we are not satisfied, recognizing that the developing macroeconomic headwinds held back our revenue growth potential despite our over performance relative to overall industry trends. Our sales performance continues to be impacted by weakening economic environment, supply chain disruptions and labor shortages within the Industrial segment. In navigating these global market complexities, we believe it is prudent to respond to these cross currents by accelerating the implementation of our strategic sales and operating expense initiatives, bringing forward to focus on tightening certain general and administrative expenses to maintain the path we are on to achieve our long term operating margin goals. To that end, we are expediting the shift of human and technical assets from our disposable segment to our fire, high performance and critical environment product lines. Concurrent with this development, we anticipate increased demand for disposable garments associated with regional flooding events across the U.S. Our current inventory levels place Lakeland in a solid position to respond to these longer lead times and capitalize on increased demand due to floods. Looking to the balance of the fiscal year, while economic conditions appear to be softening and may impact the industry and Lakeland further in the near-term, I'm confident in our team's ability to deliver growth in our core markets. Additionally, and as Allen will described in more detail, we continue to make progress on our various strategic initiatives, particularly the strengthening of our sales force and investment in manufacturing, which should only enhance our operational capabilities over the long run. On a consolidated basis for the second quarter of fiscal 2023, net sales were $28.2 million. While fiscal 2022 second quarter domestic sales were $11.3 million or 41% of total revenues and international sales were $16.2 million or 59% of total revenues. On a consolidated basis, compared to fiscal 2022, currency fluctuations negatively impacted revenues by approximately $800,000. In terms of product mix for the quarter, we saw a positive shift from a margin standpoint as disposables represented 45% of total revenues for the period compared to 55% in the year ago quarter. The mix shift was driven by growth in our higher margin non-disposable products, particularly chemical, which reached 25% of total revenues for the quarter versus 20% in the year ago period. We are also seeing increased orders for direct containers from our larger customers, which is further evidence that our customers are shifting their orders to more reliable suppliers as supply chain headwinds have become more acute with the recent COVID-related lockdowns that have taken place in China, as well as with certain other global raw material suppliers. Importantly, Lakelandâ\u0080\u0099s proactive strategy to build both finished and raw material inventory has positioned us to navigate a complicated global supply chain environment while maintaining the ability to deliver finished goods to customers as needed. We expect over stock inventory levels in the distribution channel, which is predominantly made up of disposable products to continue to diminish over the next few quarters. During the quarter, our gross margin benefited from an increase in U.S. direct container business from several of our larger customers, even as disposable revenues were decreased. As a result, operating margins were 6.4% in the second quarter, up from 5.3% for Q1 2023 and down from 14.8% for the second quarter of last year. We opportunistically invest in our operations, but are mindful and aggressive in managing the controllable expenditures to ensure we are on a path to our targeted long term operating margin goals. This compares to $900,000 or $0.15 per basic share and $0.14 per diluted share for Q1 â\u0080\u009823 and $3 million or $0.37 per basic and $0.36 per diluted share in the prior year period. As was disclosed in our 10-Q filing, during the quarter, Lakeland reassessed its long term capital requirements for its Chinese operations due to an updated evaluation of our investment strategies, strategies prioritizing both flexibility and the balance of our capital resources across our global footprint. As a result of this planned repatriation, we recorded a $2 million discrete deferred tax provision and withholding taxes in the second quarter. While this had an impact on net income for the quarter, this action will allow significantly more flexibility as it relates to our future capital allocation plans. Capital expenditures for the three and six months ended July 31, 2022 were $100,000 and $500,000 respectively. Year-to-date, our capital expenditures primarily relate to capital purchases for our manufacturing facilities in Mexico, Vietnam and India, enhancement of our global IT infrastructure and our new corporate headquarters office. Working capital was $105.1 million at July 31, 2022 compared to $108.6 million at January 31, 2022. During the quarter, we added $7 million of inventory as part of our inventory management strategy we discussed last quarter, with most of the build representing raw materials. As Charlie already alluded to and I discussed earlier, supply chain challenges have persisted and our inventory program is intended to ensure we have access to an adequate supply of raw materials and have adequate finished stock available to decrease customer lead times, address surge demand such as the U.S. regional flooding events and free manufacturing capacity for developing product lines. At this time, we have essentially reached our stocking goals and we expect to see inventory levels begin to flatten in the second half for this fiscal year. During the fiscal 2023 second quarter, the company repurchased $2.7 million or just over 171,000 shares of common stock under its repurchase program. We now have approximately $2.7 million remaining under the current authorization as of July 31, 2022. During the second quarter, we finalized our plans for expanding our manufacturing operations in Mexico, began to build out of our cleanroom manufacturing facilities in Vietnam and continue to make progress on our developed technology deployments with a focus on sales operations in the quarter. Looking to the balance of the fiscal year, because of continued macroeconomic headwinds and the delayed recovery of some of our most important industrial markets, including oil and gas, our team has undertaken a rationalization and resource reallocation exercise in support of our strategy to focus on higher value of brand product lines. Given our long term margin ambitions as well as our top line goals and support of these objectives we are moving more aggressively to shift our product mix towards higher value, higher margin and less commoditized non-disposable products and specific markets. In doing so, we believe we can minimize economic headwind to revenue growth in the second half of this fiscal year. Well, outside of the U.S. and Canada, our largest markets are Europe and China, where the currency is less of a headwind in their economic conditions, so that's the driver there. To maintain that level of gross margin, there's a trade-off in revenue and the disposables market is where that trade-off is the most exacerbated. Consequently, that's the reason for our focus on the higher end product lines. And then could you just kind of remind us a little bit, I think, for better or for worse, a lot of investors really associate your business with the disposables, I think especially given all of the business and the headlines around COVID and Ebola and bird flu, I think that's the segment of your business that people are most familiar with. In fact, one of our high value product lines is a subset of disposables and that's the critical environment market, which is pharmaceutical cleanrooms and sterile applications. The reason we know that it will work is if you were listening to Allen's comments, we're already -- we've seen the impact just between Q1 and Q2 with a shift to higher value products does to our profitability, albeit I think we'll see a greater shift in the future or greater impact in the future, that didn't just happen overnight."
}