{
    "symbol": "ALGN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 20:19:07",
    "content": " Despite the large impact of unfavorable foreign exchange, Q4 revenues of $901.5 million, increased sequentially from Q3, reflecting growth in Systems and Services as well as a slight increase in Clear Aligner shipments. On a constant currency basis, Q4 Systems and Services revenues were impacted by unfavorable foreign exchange of approximately $2.7 million or 1.5% sequentially and approximately $11.2 million or 6.2% year-over-year. For Q4, total Clear Aligner revenues of $731.7 million were down slightly, 0.2% sequentially and down 10.3% year-over-year. On a constant currency basis, for Q4 Clear Aligner revenues were impacted by unfavorable foreign exchange of $13.4 million or 1.8% sequentially and $56.4 million or 7.2% year-over-year. Q4 total Clear Aligner volumes of $583,000 was up slightly sequentially, reflecting growth in the Americas and EMEA regions, offset by lower APAC volumes primarily in China. For EMEA, Q4 Clear Aligner volume increased sequentially in all markets and across products, especially recently launched Invisalign Moderate, iGO Plus and iGO Express, which enabled GP dentists to treat a broader range of cases, mild-to-moderate types of malocclusions and can easily be integrated in a wide range of restorative treatments in a dental practice. For Q4, the total number of new Invisalign trained doctors decreased sequentially due primarily to fourth quarter being a seasonally slower period for clinical education with holidays, et cetera, as well as fewer trainings in China and Brazil. On a constant currency basis, Q4 2022 revenues were impacted by unfavorable foreign exchange of approximately $16 million or approximately 1.7% sequentially and approximately $67.6 million year-over-year or approximately 7%. For Clear Aligners, Q4 revenues of $731.7 million were flat sequentially, primarily from lower ASPs, mostly offset by higher volumes. On a year-over-year basis, Q4 Clear Aligner revenues were down 10.3% and primarily due to lower volumes and lower ASPs, partially offset by higher non-case revenues. Q4 2022 Systems and Services revenues of $169.9 million were up 7.8% sequentially, primarily due to higher scanner volume, services and exocad revenues, partially offset by lower ASPs and were down 21.3% year-over-year primarily due to lower scanner volume and ASPs, partially offset by higher services revenue from our larger installed base of scanners and increased nonsystem revenues related to our certified preowned and leasing and rental programs. The Systems and Services deferred revenues on the balance sheet was up $9 million or 3.4% sequentially and up $42.9 million or 18.7% year-over-year, primarily due to the increase in scanner sales and the deferral of service revenues included with the scanner purchase, which will be recognized ratably over the service period. Clear Aligner gross margin for the fourth quarter was 70.8%, down 0.1 point sequentially due to lower ASPs and higher warranty and restructuring costs, partially offset by improved manufacturing absorption and lower training costs. Clear Aligner gross margin for the fourth quarter was down 3.4 points year-over-year, primarily due to lower ASPs, increased manufacturing spend as we continue to ramp up operations at our new manufacturing facility in Poland and a higher mix of additional aligner volume. Systems and Services gross margin for the fourth quarter was 58.8%, down 4.6 points sequentially due to lower ASPs and higher inventory costs and manufacturing inefficiencies, partially offset by higher services revenues and lower freight costs. Q4 operating expenses were $505 million, up sequentially 6.2% and down 3.6% year-over-year. Year-over-year, operating expenses decreased by $18.6 million primarily due to controlled spend on advertising and marketing as part of our efforts to proactively manage costs as well as lower incentive compensation, partially offset by restructuring and other charges. On a non-GAAP basis, excluding stock-based compensation, restructuring and other charges and amortization of acquired intangibles related to certain acquisitions, operating expenses were up were $459.7 million, up 3.7% sequentially and down 7% year-over-year. Our fourth quarter operating income of $112.7 million resulted in an operating margin of 12.5%, down 3.6 points sequentially and down 8.9 points year-over-year. Interest and other income expense net for the fourth quarter was income of $2.7 million compared to a loss of $21 million in the third quarter and a loss of $0.9 million in Q4 of 2021, primarily due to net foreign exchange gains from the strengthening of certain foreign currencies against the U.S. dollar."
}