{
    "symbol": "ALGN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 21:28:13",
    "content": " On a constant currency basis, total Q3 revenues were reduced by $25 million or 2.7% sequentially and $57.4 million or 6.1% year-over-year, one of the largest quarterly foreign exchange impacts in our history. On a constant currency basis, unfavorable foreign exchange reduced Q3 '22 systems and services revenues by approximately $4.1 million or 2.5% sequentially and approximately $9.9 million or 5.9% year-over-year. On a constant currency basis, Q3 '22 Clear Aligner revenues were reduced by unfavorable foreign exchange of approximately $21 million or approximately 2.8% sequentially and approximately $47.4 million or approximately 6.1% year-over-year. On a constant currency basis, Q3 2022 unfavorable foreign exchange reduced Q3 revenues by approximately $25.1 million sequentially and approximately $57.4 million year-over-year. For Clear Aligners, Q3 revenues up $732.8 million were down 8.2% sequentially primarily due to lower volumes, unfavorable foreign exchange, higher promotions and discounts and product mix shift, partially offset by higher additional aligners. On a constant currency basis, Q3 '22 unfavorable foreign exchange reduced Q3 Clear Aligner revenues by approximately $21 million or approximately 2.8% sequentially and approximately $47.4 million or approximately 6.1% year-over-year. The Q3 Systems and Services revenue of $157.5 million were down 8% sequentially, primarily due to lower scanner volume, partially offset by higher services revenues from our larger installed base and were down 11.7% year-over-year, primarily due to lower scanner volume and lower ASP, partially offset by higher services revenue from our larger installed base. Q3 '22, Systems and Services revenue were unfavorably impacted by foreign exchange of approximately $4.1 million or approximately 2.5% sequentially. On a year-over-year basis, System and Services revenues were unfavorably impacted by foreign exchange of approximately $9.9 million or approximately 5.9%. Systems and Services deferred revenues on the balance sheet was up $4.1 million or 1.6% sequentially and up $76.5 million or 40.9% year-over-year, primarily due to the increase in scanner sales and the deferral of service revenues included with the scanner purchase, which will be recognized ratably over the service period. Our third quarter operating income of $143.7 million resulted in an operating margin of 16.1%, down 3.3 points sequentially and down 9.6 points year-over-year. On a non-GAAP basis, which excludes stock-based compensation and amortization of intangibles related to certain acquisition, the operating margin for the third quarter was 20.2%, down 3 points sequentially and down 8.6 points year-over-year. The third quarter GAAP effective tax rate was higher than the second quarter effective tax rate, primarily due to the decrease in profits and changes in jurisdictional mix of income, resulting in lower tax benefits from foreign income tax at different rates and higher than in the U.S. On a non-GAAP -- our non-GAAP effective tax rate was 33.1% in the third quarter compared to 25.6% in the second quarter and 22.2% in the third quarter of the prior year."
}