{
    "symbol": "ALGN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 18:39:10",
    "content": " For the quarter, Q2 Clear Aligner volumes reflect sequential growth across the Americas and parts of EMEA, partially offset by China and UK Q2 Invisalign case starts for teens and younger patients was 177.3000 up slightly sequentially and down 2.1% year-over-year compared last year when our Teen case shipment growth rate was an all-time high. For clear aligners, Q2 revenues of $798.4 million were down 1.4% sequentially, due primarily to product mix and unfavorable foreign exchange, partially offset by higher non-case revenues, and down 5.1% year-over-year, primarily reflecting lower volumes, unfavorable impact from foreign exchange and product mix shift, partially offset by higher additional aligners per order processing fees and higher non-case revenues. Q2 2022 Clear Aligner revenues were unfavorably impacted by foreign exchange of approximately $12.3 million, or approximately 1.5% sequentially, and approximately $32.9 million, or approximately 4% year-over-year. Q2 2022 Systems and Services revenue of $171.2 million were up 4.7% sequentially, primarily due to higher scanner volume and ASP, and were up slightly by 0.8% year-over-year, primarily from higher services revenues from our larger installed base, partially offset by lower scanner volume and lower ASP. Systems and Services deferred revenues on the balance sheet was $13.3 million, or 5.4% sequentially, and up $99.6 million, or 62.3% year-over-year primarily due to the increase in scanner sales and the deferral of service revenues included with the scanner purchase, which will be recognized ratably over the service period. It really comes down to, Kevin, more just having more predictability on a macro basis, understanding you mentioned COVID and thinking that we're through it, then you have China lockdowns or some of the consumer sentiment and things that come up that are outside of our control, we feel very good about being able to control what we can control, making the right investments as we go to market or adding investments in R&D to better our products and so on, and drive that return."
}