{
    "symbol": "ALGN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 18:33:16",
    "content": " Notwithstanding these headwinds, Q1 2022 total revenues of $973.2 million were up 8.8% year-over-year compared to Q1 2021 revenues of $894 million with a growth rate of 62% year-over-year. For Q1, Clear Aligner revenues were up 7.5% year-over-year, reflecting revenue growth across regions and products and were down slightly sequentially from Q4 at minus 0.7%. The timing of the new teen program coincides with the beginning of the summer teen season, and we're excited to continue partnering with doctors to grow their practice with Invisalign treatment with less than 10% share of teen case starts, the teen subscription program has the potential to help accelerate Invisalign adoption in the largest segment of the orthodontic market teams. For our Systems and Services business, Q1 revenues were up 15.6% year-over-year, reflecting strong scanner shipments and services and down 24.2% sequentially, primarily reflecting lower volumes from the previous mentioned headwinds and capital equipment seasonality. For Clear Aligners, Q1 revenues of $809.7 million were down 0.7% sequentially due to lower Invisalign case volumes, partially offset by higher ASPs, reflecting higher ASPs and up 7.5% year-over-year reflecting higher ASPs in non-case revenues. Our Systems and Services revenue for the first quarter were $163.5 million, down 24.2% sequentially and up 15.6% year-over-year. Our Systems and Services deferred revenues on the balance sheet was up $16.5 million or 7.2% sequentially and up $114.9 million or 87.6% year-over-year, primarily due to the increase in scanner sales and the deferral of service revenue included with our -- with the scanner purchase, which will be recognized ratably over the service period. Our first quarter operating income of $198.1 million resulted in an operating margin of 20.4%, down 1.1 points sequentially and down 4.8 points year-over-year. On a non-GAAP basis, which excludes stock-based compensation, amortization of intangibles related to certain acquisitions and acquisition costs, operating margin for the first quarter was 24%, down 0.7 points sequentially and down 4.6 points year-over-year."
}