{
    "symbol": "CRM",
    "quarter": 1,
    "year": 2023,
    "date": "2022-05-31 20:17:04",
    "content": " And I'll tell you, as you hear some of these incredible stories from the quarter, companies like State Farm and F1 and Goodyear and even the Department of Commerce, well, I'll tell you, these customers, they're very excited to be able to get not only incredible productivity from our product but also growth as well. This is an example, late last year, we introduced Revenue Intelligence, which is a deep integration between Tableau and our Sales Cloud that enables sales teams to enable every rep to be more efficient to collect cash faster, to boost growth and really bringing together this entire Customer 360 portfolio to give our customers not only a chance to reimagine their Sales Cloud implementations, but make sales that are relevant to an even broader range of customers. When you look at some of the wins that we've talked about in this quarter like ADT or DoorDash, you think about this next generation of selling in this era of flexible work, there's always an opportunity for our customers to reimagine their approach to sales and Sales Cloud continues to be the most innovative platform for opportunity management and lead management. Well, it's a great question. In fact, one of the things I'm most excited about from this past quarter is we shift a lot of the integrations between Customer 360 and Slack, whether it's team selling and account management in our Sales Cloud or case warming in our Service Cloud, it's actually one of the solutions that DoorDash uses with their Service Cloud deployment, really using our Slack to amplify their investment in our Service Cloud and they succeed in this new era, where their workforce is working from anywhere. And it's a great example by having a full suite of products and also by augmenting those products with our acquisition strategy over the last few years, we really have just a tremendous opportunity with every single customer to extend and expand and land and go and -- this is just a moment where I think that there will be some consolidation with vendors, and they'll rely on the vendors that they have the most trusted relationships with. Well, it's a great question."
}