{
    "symbol": "QRTEA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 12:24:09",
    "content": " I would now like to turn the call over to Courtnee Chun, Chief Portfolio Officer. Before we begin, we'd like to remind everyone that this call includes certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Actual events or results could differ materially due to a number of risks and uncertainties, including those mentioned in the most recent Forms 10-K and 10-Q filed by our company and QVC with the SEC. These forward-looking statements speak only as of the date of this call and Qurate Retail expressly disclaims any obligation or undertaking to disseminate any updates or revisions to any forward-looking statement contained herein to reflect any change in Qurate Retail's expectations with regard thereto, or any change in events, conditions or circumstances on which any such statement is based. On today's call we will discuss certain non-GAAP financial measures, including adjusted OIBDA, adjusted OIBDA margin, free cash flow and constant currency. Information regarding the comparable GAAP metrics along with required definitions and reconciliations including preliminary note and schedules one through four can be found in the earnings press release issued today or our earnings presentation, which are available on our website. Today, speaking on the earnings call we have Qurate Retail, President and CEO, David Rawlinson; Qurate Retail Group's Interim CFO, James Hathaway and Qurate Retail Executive Chairman, Greg Maffei. Looking at our Q3 results, our performance was the result of several factors, some of these are external, which we are managing through like all are in retail and some are internal for which we are focused on driving better outcomes through improved execution and Project Athens and laying our Project Athens in June, we said we expected fiscal 2022 to be the base line year and that our transformation will not be linear. We made progress in Q3, moving from the assessment phase of Athens to in-depth planning. In the third quarter, total company revenue declined 9% in constant currency, a modest sequential moderation in the rate of decline from Q2 driven by better execution and the easier compares. Like all the retail, we managed against macro headwinds, including inflation, continued war in Ukraine and rising interest rates that negatively impacted consumer sentiment. In the US, the University of Michigan Consumer Sentiment Index declined 20% year-on-year in September 2022. We also faced several extraordinary events that impacted performance, namely we approach the death of Queen Elizabeth in the UK with respect, keeping our customers, team members and the mood of the nation in mind. And we estimate this period, coupled with the 10 days of mourning impact the QVC UK sales by approximately $10 million. This reflects approximately a 100 basis points and lower product margins due to planned promotions as we work to reduce our inventory, particularly at HSN. While this has pressured our margins year-to-date, it has improved our inventory position that I'll discuss more shortly. We continue to work through excess inventory, amplified by impacts of the Rocky Mount fire leading to higher levels of detention and demurrage expenses, as well as inflationary pressures in shipping, fuel, packaging, labor rates and marketing. Despite elevated costs we elected not to raise prices this year, primarily due to the macroeconomic environment and consumer sentiment, but also to manage our promotional cadence as we took actions to address excess inventory. That said, we have made progress on reducing inventory. We had excess inventory based on the retail and supply chain environment, but also compounded by the December 2021 tragic fire at our former Rocky Mount fulfillment center. In this role he lead supply chain procurement, Global Business Services and corporate real estate and workplace services for all Qurate brands globally, as well as customer service for all US brands and fulfillment center operations for QVC, US and HSN. Scott brings deep experience leading global retail supply chains for multiple Fortune 500 companies, including Cardinal Health,  (ph) and Conagra Brands. Most recently she led Amazon's Prime Video Channels business, prior to that she was founding CEO and President of BritBox, the first of its kind streaming video on demand offering from the UK's two national broadcasters BBC and ITV. By adding Soumya and her qualifications, we expect to meaningfully grow our audience and product sales on streaming platforms over time. She is developing and leading merchandise strategy across all platforms, as well as overseeing QVCs buying, planning and programing organization and our design, development and sourcing team, which is our in-house agency that brings new brands, products and concepts to life. Stacy brings extensive merchandise experience and a proven ability to help omnichannel multi category retailers differentiate themselves, engage customers and drive sales. Most recently she led global e-commerce and digital marketing for G-III Apparel Group, she spent more than 20 years at Macy's serving in a variety of executive leadership roles. Having a strong leader here will allow us to better serve our customers, attract new ones and grow revenue. Lastly, Linda Aiello joined Qurate as Chief People Officer. She leads the full team member portfolio, including team member experience, talent management, diversity, equity and inclusion. She brings more than 20 years of international experience leading people functions, modern technology businesses and luxury fashion brands. Most recently she was Chief People Officer at Stitch Fix prior to Stitch Fix, Linda served in senior people roles at Salesforce and Uber. I'm pleased to report that Qurate Retail Group earned a 2022 US Great Place to Work certification, The Global Authority on Workplace Culture and Employee Experience. In addition, our own internal surveys revealed meaningful gains and our team member engagement and confidence in the company's strategy and leadership. Now I'll provide updates on the five pillars of Project Athens that we communicated in late June, where we are pleased to see initial traction. First, from an overall perspective, we formed the transformation office to work with the teams for a successful execution of Project Athens. The office is led by Scott Barnhart, our new COO reporting into Scott is a dedicated Chief Transformation Officer, Bill Hunter, who has been with the company for 14 years in a singularly focused on delivering our strategic initiatives. Total QxH customer count declined 11% in Q3 versus mid-teens in the first half of 2022, while total count declined, the average spend per customer increased 3% and the average number of items per customer increased 6% in Q3. Customers remain engaged with total minutes viewed up 8% in Q3, which was slightly stronger than Q1 and Q2. With better execution and an improved merchandise portfolio, we will be better suited to serve our engaged audience. In July, we began putting that today and the special back in Today's Special Value in Today's Special by shortening their availability to only one day and offering our best price for that day, driving a greater sense of urgency. In Q3, we experienced a moderation in the rate of decline in TSV performance. QVC US shifted 36% of its TSVs in Q3, down from 50% in Q1 and 75% in Q2. HSN shifted 40% of its TSs in Q3, down from 60% in Q1 and Q2. We experienced meaningful cost pressures in Q3, some from external macro factors, inflation and excess inventory and some from sales deleverage and some from our investments. For today, I'll simply reassert the point we made when we unveiled Project Athens. That said, we continue to face capacity constraints at our fulfillment centers and incremental detention and demurrage costs. And going into the holiday season, we believe our fulfillment centers are well staffed. As a result, they saw a stabilization in conversion rates and an increase in average order value, while national brand product was limited for most of Q3. Zulily has since attracted several national brands capitalizing on industry wide excess inventory, which will be beneficial moving forward. Looking forward, Zulily is focused on attracting more national brands, improving the customer experience on its sites and efficiently ramping marketing through more diversified channels. Cornerstone brand sustained revenue growth with record Q3 revenue at each of its home brands, Frontgate, Ballard Designs, and Grandin Road. We continue to expand our distribution, our streaming apps are now included on Samsung Smart TVs and on Cox's Contour platform. As we look to the fourth quarter, QVC will be a presenting partner of this year's Christmas Spectacular starring the Radio City Rockettes, which will open November 18 at Radio City Music Hall. QVC will have terrific exposure to the approximately 1 million people who attend the Christmas Spectacular, as well as the millions of Rockettes fans worldwide on social media. Over the same weekend, we'll host our nonstop party, which is a continuation of 2021s 40 man hour event success. There will be dozens of celebrities, fashion designers, host, customer favorite brands and special popping guests. Content will be broadcast and streamed live across all QVC channels on virtually every platform and device, including QVC, QVC2, our website, mobile app and social pages and QVC+ and HSN+ streaming services. We now have a dedicated transformation office, as well as key new executive leadership talent. In the near term, we do anticipate increased promotions due to elevated inventory throughout Retail. We also recognize that consumer sentiment is lower than last year, primarily driven by macroeconomic challenges. That said, we are intensely focused on the execution of Athens and reiterate our 2023, 2024 outlook we unveiled in June, with stable revenue and double-digit CAGRs for OIBDA and free cash flow. Iâ\u0080\u0099m pleased to welcome Jim Hathaway, our Interim CFO on our call today. Before I tried it to Jim, I want to thank Jeff Davis for service as our CFO for the past four years. Jim, joined us in May 2021 to lead finance for QxH and is intimately familiar with our unique business. Prior to Qurate, Jim spend more than 20 years with PepsiCo Frito-Lay in various financial leadership roles of increasing responsibility. Unless otherwise noted, my comments compare financial performance for the three months ended September 30, 2022 to the same period in 2021. Revenue declined 8% primarily on lower unit volume, e-commerce revenue declined 8% in line with the overall revenue performance. Recall, that in Q3 of 2021 we experienced inbound freight delays that impacted our ability to secure product on time last year. In addition, we saw an increase in advanced orders in Q3 of 2021 that shipped in Q4 of last year. As David mentioned, we got started on this earlier than others in retail by necessity due to the Rocky Mount tragedy, which has had a longer lasting impact on our project margins, but is leading to improvement in our inventory balances year-over-year. This promotional activity was mostly in the home category in areas such as seasonal decor, storage and organization, cookware, kitchen electronics, home office and gaming, but also in fashion, such as loungewear. Home revenue declined 9%, which was an improvement from the first half of the year in Q3 we experienced lower demand primarily for seasonal, cleaning, heating, air purification bed and bath and garden, partially offset by gains in food. Apparel declined 2% against 8% growth in Q3 of 2021, which demonstrate solid two year performance. Accessories declined 10% primarily due to lower demand for handbags and luggage, intimates and casual and athletic footwear. Electronics revenue declined 11%, which was an improvement from our over 25% declines in Q1 and Q2. Looking at the main components of the margin compression, gross margin declined 530 basis points primarily reflecting unfavorable fulfillment expenses, product margins and obsolescence expenses. Fulfillment expenses reflect capacity and operational inefficiencies that resulted in detention and demurrage costs, higher freight rates, fuel and wages, largely due to inflation, higher rents at fulfillment centers and up from the sale and leaseback and sales deleverage. These headwinds were primarily offset by savings from decommissioning our Lancaster, Pennsylvania and Roanoke, Virginia fulfillment centers last year. Product margins decreased primarily due to our inventory reduction actions, especially at HSN, as well as lower shipping and handling revenue. Inventory obsolescence increased primarily due to higher current year reserve provisions, we reduced QxH inventory 5% year-over-year, which was an improvement from the increase in Q2 reflecting rigorous efforts on inventory management and more disciplined buying behavior. Operating expenses were unfavorable 110 basis points, primarily due to commissions and customer service. Commissions were primarily due to expanded over the air distribution of Ion, Tonga, Scripts and Nexstar. Fixed cost pressure was primarily due to sales deleverage and investments in video commerce ventures and IT, higher wages and corporate rent post the sale leaseback. Marketing reflects investments to expand our commerce platforms, cost inflation and lower efficiency of marketing spend. Moving on to QVC International, my comments will focus on constant currency results. Our largest European business, Germany and the UK declined in the low double digits, and as David mentioned, experienced a cautious consumer sentiment from historic inflation, particularly for energy, the ongoing war in Ukraine and the interruption of program in the UK following the death of the Queen. QVC Japan was less impacted by these factors, however, and grew mid-single digits. QVC International experienced declines in home, beauty and accessories, which were partially offset by modest gains in apparel and jewelry. Gross margin declined 190 basis points, driven by the following factors. Product margins declined, reflecting lower initial margin due to inventory reduction actions and lower shipping and handling revenue due to reduced unit volume. Fulfillment costs reflect sales deleverage and higher labor cost, caused by increased minimum labor rates and COVID related staffing challenges, as well as higher freight rates in European markets. SG&A was unfavorable favorable, primarily due to higher fixed costs and marketing expenses. Fixed costs rose due to higher wages and benefits, as well as software and IT project costs, marketing pressure including investment to support our growing Japan business. Revenue grew 8% with record performance at each of its home brands, Frontgate, Ballard Designs and Grandin Road, driven by demand for bath, case goods, home furniture and Halloween products. Adjusted OIBDA decreased 58% primarily due to higher inbound transportation costs, detention and demurrage fees for storage and handling and higher marketing costs, which were partially offset by initial margin gains. Looking at Zulily, revenue declined 39%, primarily due to lower unit volume reflecting limited availability of national branded product in the quarter and marketing inefficiencies due to cost inflation. Adjusted OIBDA at Zulily declined 47%, primarily due to deleverage of fixed costs, which were partially offset by favorable marketing expense, fulfillment and product margins. First, due to challenging economic conditions, weekend business performance, the decline in our stock price and a significant increase in discount rates used, we accelerated our annual impairment assessment. As a result, we have taken a non-cash impairment charges of $2.7 billion at QxH and $366 million at Zulily. These charges are related to the respective businesses goodwill and the trade names of HSN Zulily and are included in operating income, but excluded from adjusted OIBDA. Second, you will see in the 10-Q filed later today that we identified a material weakness in our internal controls over financial reporting. Total capital expenditures were $171 million for the nine months ended September 30, 2022 and we spent $36 million on renewal of our TV distribution contracts. Our total free cash flow for the nine months ended September 30, 2022 was a use of $105 million versus a source of cash of $218 million last year. The year-over-year decline was primarily attributable to lower cash from operations, driven by operating results and unfavorable working capital. Despite the year over year favorability in the inventory outflows working capital headwinds were more timing driven with increased uses of cash from payables this year related to inventory purchase in 2021, some of which remain in transit due to supply chain inefficiencies. Our free cash flow includes insurance proceeds received year-to-date, given the inventory loss and impact to our results related to the Rocky Mount fire. On a last 12 month basis, our free cash flow was positive $288 million. Included in our free cash flow in the first nine months of 2022 was $280 million in insurance recoveries related to the Rocky Mount fire, a $184 million of which is recognized in cash flows from investing and the remainder in operating cash flows. As we communicated on the last call in July, we completed five additional sale leaseback property transactions and we received approximately $443 million in cash proceeds, we recorded a $277 million gain on the sale lease assets in Q3, which was included in operating income and excluded from adjusted OIBDA. In early 2022, we agreed the terms for the sale and leaseback of our UK and Germany fulfillment centers. Looking at our debt profile, on September 30 we had $545 million drawn on the QVC revolver with $2.7 billion of available capacity. This net leverage covenant includes the adjusted OIBDA of QVC, Cornerstone and Zulily. As David and the entire  (ph) management team are obviously very focused on stabilizing the business this year, there is a weak macro environment and a highly promotional environment among retailers, and that intensity is clearly impacting Q as well as the broader retail market. Importantly, we did make progress on inventory reductions in the third quarter and are on track for longer inventory reduction actions. David has attracted a top-quality team to support his plans, including the actions under the pillars. As you heard, we have a European series of sale-leaseback transactions that are signed and will provide additional capital, the estimated gross proceeds of approximately $170 million on current exchange rates. We expect to close that early in the first quarter of '23 and again, intend to use those proceeds to further reduce debt. We do look forward to seeing you at our annual Investor Day on Thursday, November 17, as David mentioned. If you'd like to submit questions in advance, you can e-mail them to  (ph). And with that, operator, we'd like to open up for questions. You said that inventory should get better, so it should be a net positive from that. Thank you for that question. As I look to Q3, what we discussed was the exchange between better usage of inventory and a reduction in our inventory levels and higher payables. But if you look at the last two years, we had an exchange from turning down our inventory levels disproportionately, and the payables should catch up as we discussed. Obviously, we've not had accessed right time, right product, right value, right host in quite the way we would if we were operating in a normal environment, and that has a particular impact on our business model. And I would say, there are some categories like beauty that have been especially impacted by the fire at Rocky Mount. I would also say, I think we've been particularly weak in attracting new customers over the last few quarters. Some of that's because new customer really center around our ability to attract new customers, really centers around consumer electronics and home product, which were all difficult coming out of the pandemic. And then finally, I would just point out, if you look at our customer count by cohort, we did see a very large crop of large low-quality customers that we attracted during the pandemic, which are still working their way out of our numbers. In terms of what we're doing to address it, really, the first action I talked about in my comments, which was shortening the TS and TS availability, it goes back to the execution of our core business model. We know that when we execute on our Today's Special and Today's Special Value, it increases the attraction of new customers and the stickiness of our best customers. For reference, as a result of some of these actions that we've taken, we did see improvements in the rate of decline. And so, we think that's going to help. Again, I would point to some early signs of the rate of our total customer count decline did moderate in Q3. So on Zulily, I thought that we maybe would have seen better stabilization in results just given that we had talked about in the last earnings call, I think, it was mentioned as well about the better buying environment out there. On Zulily, it's a great question. We have signed on a couple of hundred new brands of various types, including 15 to 20 national brands. Those 15, 20 Tier 1 national brands are all brands that we haven't had over the last 18 months. It's taken a bit of time for us to get these on the site and start promoting them, to your question, Jason. We have to establish and set up to get the inventory shipped, and then we have to run the promotion on the site. The other thing I would just point out, which is, it's not only about getting the Tier 1 brands, it's also about the level and depth of the assortment that we have available to us, which we've also seen expanding very substantially. And I think as you go through the holiday season, you'll see a number of changes, including the new shipping offer, including a real diversifying and away from Facebook into other marketing channels. So I would agree with you, it hasn't -- the numbers haven't come through quite as quickly, I think, as we would all have hoped, but I think we're in a good position now. On Cornerstone, I'm curious, for the overall business, you called out a lot of macro and external headwinds. Yes, it's a great question. I think, first, essentially all Cornerstone product is proprietary or private label. And so, because of that it's insulated a bit from some of the discounting pressure and the other things that are going on in retail, that's first. Second, I think a direct marketing skill set, catalogs, paper, customer by customer, category by category is even more valuable in the current environment. And so, what I think used to look like a weakness, now looks like a bit of a strength. I'd also say we've seen continued increases in investments around home, both indoor and outdoor. I think there was some sense that, that might moderate coming out of the pandemic. But what we've seen is people shifting their wallet more consistently to doing things to upgrade their home, whether that's grills outside or patios outside. And so, a lot of those trends look stickier than I think the common wisdom had baked in. And then of course, next year, we've talked about, we're going to continue opening at a deliberate pace stores for the Cornerstone brands, especially valid designs. The stores have continued to perform extremely well, continued to grow and continued to have good profitability. prepared remarks when you discussed timing of shipments and their delay from the third quarter to the fourth quarter of '21, it seems like you were kind of indicating that the challenge -- that the comparisons are going to become more difficult in the fourth quarter. So we had an exceptional event last year given everything that was happening in supply chain, where we took a lot of advanced orders that didn't ship. So, I think it's fair that they -- in the compare helped a little bit in Q3, hurt a little bit in Q4 just because of when that revenue is recognized. It's not a massive swing in the numbers, but we just wanted to highlight that it was an impact. I would say, we saw improvements in levels of decline in moderation coming into this quarter. It will depend a little bit on how the fourth quarter performs, of course. It's possible that there could be some hangover as we go into Q1, but we feel pretty good. As we look out across the universe, if you look at NPD data, some other industry data, it suggests the market's up about 20% in excess inventory across retail. So we're going into this a lot more clean than the overall retail environment, and we think we'll continue to improve on that number as we go through the fourth quarter. So there may be some hangover going into Q1, but we think we'll largely be through getting clean on inventory and getting to a level we're more happy with as we go into Q1. I would say it's not a primary driver today, but it has been growing very quickly. It's material, but I wouldn't say it's a primary driver of results yet. But eventually, medium to long term, I think as people continue to move from linear to streaming, it will be an increasingly big and important part of our portfolio. I think in the U.S., streaming reach overall in the broader market has already surpassed linear TV reach. I think we passed that threshold this year, and I think there will be a lag for us. I think the interest in doing additional sale leasebacks will be opportunistic and dependent on market conditions, but we will continue to look at opportunities across the portfolio. And then looking at the customer count, I know you got these questions before, but at QVC, it's down 16% year-over-year, 13% from pre-pandemic and 6% since the first quarter. The first is, we sort of look at customers broken out within the business by new occasional returning and our best customers. And certainly, the spending behavior of our best customers have been extremely strong growing in the quarter. Our new customers have been a potential source of weakness often being down in the first half, being down in the 30% range. Now, new customers in our model are not nearly as valuable as best customers. But for the long-term health of the customer file, they're very important. And we've cut that rate of decline for new customers by more than half already, and we're going to continue to hammer away at making our value proposition much more attractive for new customers. On the overall customer file, like I pointed out before, we have seen a moderation in the rate of decline. We think we know why we're driving that moderation, and we think we know the tools we have at our disposal to continue working on getting back to a stabilized growing customer file. And then just one on the business interruption, you mentioned that you filed or submitted your claim. There's negotiations going on, I don't know that we're ready to comment at this point whether it's going to be bigger or smaller than the property amounts that we've gotten back. And then just a clarification, you've got plenty of revolver capacity now. I think we're being prudent with respect to interest expense, current interest rates and relative to our really low coupons on some of the nearer term maturities. So more likely if we were to use the revolver, for example, for the March 2023 maturity, we would just do it just prior to maturity as opposed to proactive repurchase. I'm surprised that you're still shifting a lot of them, I guess, given what looks like a better inventory flow through than what you had last year. I would say the supply chain is better than it was last year, for sure. The other piece of it, of course, is as we've gotten through the inventory at Rocky Mount there's some lumps in that inventory, and there's also some changes and what we need to do as we discover what's salable and what's not in the promotional calendar. So all of those things, I think, have continued to make the calendar a little more unstable than we'd like, but it was a lot better in the third quarter than it was in the first half. In the EBITDA bridge or margin bridge that you guys provided, I saw the sort of the margin decline for merchandise margins. But I would think on a go-forward basis that there could be a meaningful benefit to shipping costs, just given what we're seeing in ocean freight. Thank you for that question. And we have seen stabilization broadly similar to the broader market in our supply chains from oceangoing freight, which is a large portion of our business. I would just point out, there is -- there are some substantial lags for two reasons. First, it just takes those lower rates time to show up on the P&L from the time that you contracted before it gets on the water, before it gets here and before it flows through the numbers. Second, some of the shipping rates are at spot prices, but a lot of it is also on contract. And so, it does look like it will be a good guide going forward, but it will come into the P&L and give us relief over time. See, I was a little surprised given all the initiatives you've announced and the sales decline that the costs were up so much. It's up double digit, but the base seems to keep going down. We think we'll have a cleaner base and read going into 2023, 2024. So that's why we stated it like that, but I think we'll be able to give you a little bit more detail as we land 2022 when we're able to talk about what Project Athens looks like going forward. In terms of cost pressures, I'll take a little bit of time with this one because I think it's important. I would really bucket the cost pressures in the four buckets, and it's important to separate them because what we have to do against them is a little bit different. So I would think about fulfillment, other inflationary impacts, our inventory liquidation efforts and then sales deleverage across the P&L. So on fulfillment, fulfillment and supply chain is the largest driver of cost by a lot. So we had to go out and lease more buildings, we also had to leave more inventory and trailers, so all of those were costs that should be coming out of the P&L. So I talked about the trailers coming into, I think, Q2, we had 1,000 trailers across various yards in the network. And since the end of Q3, we've gotten that down even further. So, things like detention and demurrage which were penalizing in this quarter over time should work their way out. In terms of other inflationary impacts which is sort of the second category, that's where you see marketing cost. The digital marketing environment has been tough, although I would hope that comes down. We've also invested a little bit, although not a material driver, into our streaming business on marketing. On the gross margin line, obviously, we've been moving to get rid of some excess promotions. We think we'll continue to see that impact through 2022, but we should see that start to moderate in 2023. I would just say, when you're -- we were down 9% constant currency. When you're seeing that sort of down, it's just hard to remove SG&A at end period at the same rate of the sales decline. We also, because of the overall consumer environment, unlike last year weren't able to counteract very much of it by taking price. What I would say is we're attacking all of these areas, even if you can't get it in period. And then across the business, of course, we're also very intentionally managing headcount. If you look at the headcount across the business, despite the increases that we've had to deal with -- to deal with Rocky Mount, overall business headcount is still notably down year-over-year. And then I think as we go into next year and as we stand up the transformation office, we only intend to accelerate these sorts of cost effort. So operator, I think we are done for the day."
}