{
    "symbol": "PAA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 21:36:04",
    "content": " In summary, fourth quarter and full year adjusted EBITDA attributable to PAA was $659 million and $2.51 billion respectively with full year results exceeding our February guidance by $310 million or approximately 14%. We reported fourth quarter adjusted EBITDA of $659 million, which includes crude oil segments benefits of Canadian market based opportunities and increased volumes across our systems, primarily within the Permian and along with NGL segments benefits from stronger seasonal sales. Looking at 2023 compared to 2022 and as illustrated by the EBITDA walk on Slide 7, we expect adjusted EBITDA $2.45 billion to $2.55 billion with year-over-year growth in our crude oil segment and a reduction in the NGL segment. Growth in our crude oil segment is primarily driven by anticipated tariff volume increases in our Permian gathering long haul businesses, due in part to our increased ownership in Cactus II, which is now consolidated into PAA's financials with volumes reported on a consolidated basis and earnings on a proportional basis. As such and as illustrated on Slide 12, Plains is well-positioned to improve returns of capital to unitholders, through a capital allocation framework that targets multiyear distribution growth, an 8.5% current yield, significant free cash flow generation and balance sheet flexibility built on the strength of our strategically located Crude and NGL footprint across North America. So, we look at that plus a roughly 10% increase in the wealth connects across our systems throughout the year, gives us pretty much good confidence on a top down level as well as a bottoms up build from producer forecasts in the 500,000 barrels a day outlook that we have, some of the offset as to potentially slowing down as well, we can foresee as incremental basin decline just from higher production. On the guidance for kind of mark-to-market based, what we've done is, as you know, we've got a pretty complex system that's got a lot of flexibility to be able to capture volumes when the arbitrage opportunities are there. One thing that's notably different this year than past years that you may have picked up is, we've -- we're coming into this year with a substantial amount of our long haul volumes in the Permian and 80% of our frac spreads kind of locked in."
}