{
    "symbol": "PAA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 22:15:03",
    "content": " The success of this effort, when combined with solid operating, commercial and financial performance, enabled us to achieve our leverage objectives well ahead of our initial expectations and to accelerate returns to equity holders while providing greater clarity on our multiyear capital allocation framework. Beyond '23, as part of our annual budget review process with the Board, we anticipate targeting annualized distribution increases of approximately $0.15 per unit each year until reaching a targeted common unit distribution coverage ratio of approximately 160%. We reported third quarter adjusted EBITDA of $623 million which includes the benefit of increased volumes across our systems, primarily within the Permian, higher commodity prices as well as Canadian margin-based opportunities. With respect to increasing returns of capital to our equity holders in a long-term, sustainable manner, as shown on Slide 11 and detailed in our earnings press release, we intend to recommend to our Board an annualized increase of $0.20 per common unit for our quarterly distribution to be paid in February which is one quarter earlier than we would normally implement a change to our quarterly distribution. Subject to that process, we currently anticipate targeting annualized distribution increases of $0.15 per unit per year until reaching a targeted common unit distribution coverage ratio of approximately 160%. Even with the potential increase, we still have ample financial flexibility to continue lowering leverage and increasing returns of capital to common equity holders in a manner consistent with what we have described on today's call. And the reason for that is, as we think about our capital allocation process, it's a pretty dynamic matrix that we look at with a number of things and the goal is to really help improve the value of the company and the ability to be able to have additional cash flow which we can distribute back to unitholders. And as we put this multiyear trajectory out on the increase, the 160% target is really kind of a governor to make sure that we've got adequate coverage and cash flow to be able to cover our routine CapEx expectations, our annual program as well as a little bit of extra dry powder to be able to further take our leverage down and be prepared for anything that might present itself."
}