{
    "symbol": "PCYO",
    "quarter": 1,
    "year": 2023,
    "date": "2023-01-10 19:16:04",
    "content": "  We develop those water rights and we are cradle-to-grave on the water rights, where we develop the wells, the distribution system, put that water to use in both the land segment, which is a parcel of property that we own that weâ\u0080\u0099re doing a master planned community on and weâ\u0080\u0099re building lots for our homebuilder customers, and then we are holding back some of those lots and building homes on those for the single-family rental segment as well, so each of those segments really are interrelated to a vertically integrated platform that we have from the water utility side. The water supplies certainly are long-lived - those are perpetual, and then you have a lot of the brick and mortar that weâ\u0080\u0099re building associated with that, and really this is showing the growth of the company in the last five or six years, really showing about an 86% growth in the capitalized asset class and the various categories of that infrastructure, whether thatâ\u0080\u0099s water and wastewater treatment facilities, transmission lines, wells, finished water storage, surface water, groundwater supplies, distribution systems, all the components of a water utility youâ\u0080\u0099ll find in there, so that will continue to grow as we keep seeing that. Our water supply, our service areas, and really--you know, the City of Colorado is located over a fairly prolific oil and gas field thatâ\u0080\u0099s gotten a little bit more attention more recently with the shale oil play, but we are seeing operators drill a number of pads in a number of formations here that consume a tremendous amount of water for oil and gas, and so we continue to see those sales. Weâ\u0080\u0099ve got very valuable, very low cost basis legacy assets here, both in terms of the water and the land side of the equation, and what weâ\u0080\u0099ve done successfully is really make sure that we carefully position you all with your invested capital to market exposures, and so one of the ways that we do that is through how we handle our builder contracts, and those of you that are familiar with the company kind of had this appreciation, but we have a lot delivery agreement structure where our builders are working in partnership with us on delivery of this very expensive infrastructure, when youâ\u0080\u0099re in a high cost business where weâ\u0080\u0099re delivering horizontal infrastructure for master planned communities and then the housing side of it, the vertical side is handled by the homebuilders. We find ourselves in the right market segment, that entry level product, and so as the homebuilders come out there and look for buying opportunities, Dirk really highlighted the continued demand for single family homes in the marketplace, and thatâ\u0080\u0099s still--weâ\u0080\u0099re seeing that in the marketplace, weâ\u0080\u0099re seeing that in terms of the builders and the building permits that theyâ\u0080\u0099re pulling and the spec homes that theyâ\u0080\u0099re building out of Sky Ranch, and then also that theyâ\u0080\u0099ve having sales, you know, that weâ\u0080\u0099ve got customers that have moved out there in the last 30 days and continuing to really see that absorption. Bill, your line is live. Bill, your line is live."
}