{
    "symbol": "AQN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-17 11:19:08",
    "content": " After a challenging second half of the year, we closed out 2022 on stable ground with full year adjusted net earnings per share coming in at the top end of our revised guidance range at $0.69, supported by fourth quarter adjusted net earnings per share of $0.22. These actions include reducing our capital spend intensity to recognize changing market conditions and company-specific factors, optimizing our portfolio by targeting approximately $1 billion of additional asset sales, reducing our quarterly dividend by 40% to $0.1085 per common share and reducing our reliance on equity capital markets, including undertaking no new equity financings for the next two years. Our fourth quarter 2022 consolidated adjusted EBITDA was $358.3 million, which is up approximately 20% from the $298.3 million for the same period last year. Full year 2022 consolidated adjusted EBITDA was approximately $1.26 billion, an increase of approximately 17% and from the approximately $1.08 billion in the prior year. Fourth quarter adjusted net earnings were $151 million compared to $137 million reported last year, an increase of 10%. Full year adjusted net earnings were $474.9 million, up 6% from $449 million for the full year 2021. And for the full year, adjusted net earnings per share was $0.69, a 3% decrease from $0.71 last year. Our net GAAP earnings was a loss of $74 million for the quarter, and a loss of $212 million for the full year compared to $175 million net profit in the fourth quarter of 2021 and $265 million for the full year 2021. For the full year, 2022, the Regulated Services Group delivered $863.6 million in operating profit compared to $758.8 million for the full year 2021, an increase of 14%. Fourth quarter 2022 divisional operating profit was $163 million compared to $123.2 million in the same quarter last year, an increase of 32%. The increase was primarily due to the $62.8 million gain from our inaugural renewable asset recycling transaction, which compared to a gain of $29.1 million recorded in the fourth quarter of 2021. For the full year 2022, the Renewable Energy Group reported divisional operating profit of $472.2 million compared to $383.6 million last year, an increase of 23%. We have reaffirmed our 2023 adjusted net earnings per share expected range of $0.55 to $0.61, which starting this year will be calculated excluding the impact of any gains or losses on asset sales. And I asked because I think at the most recent deep dive Investor Day over a year ago, you were talking about $1.2 billion for the regulated spending plan in 2023? So we are confident in the $1 billion asset sales because like I keep saying, with our over $17 billion of assets, we have lots of optionalities and we are very much deep in the planning stages, including Phase 2 of our renewable asset sell-out."
}