{
    "symbol": "AQN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 13:27:02",
    "content": " I'm pleased to report that we are on track with steady year-over-year growth in the following key financial metrics: Q1 adjusted EBITDA was $330.6 million, a 17% increase year-over-year, and our Q1 adjusted net earnings per share was $0.21, an increase of 5% compared to last year's $0.20. Recall that Empire Electric had earlier requested a rate increase of $79.9 million, which included $29.9 million of recovery related to last year's extreme Midwest weather event and subsequently amended the direct request to $50 million after updating certain components and deepening the recovery of Storm Uri cost. As we've previously mentioned, our expectation of enhancing Kentucky Power's local operating model, bringing benefits to customers by exploring opportunities to reduce customer rates through investing in lower cost energy and creating increased local employment are all attributes that are expected to help customers and the local communities while driving value for shareholders. Our first quarter 2022 consolidated adjusted EBITDA was $330.6 million, which is up approximately 17% from the $282.9 million we reported for the same period last year. The Regulated Services Group delivered $231.2 million in operating profit in the current quarter, which compares to $206.4 million in the same quarter last year, an increase of $24.8 million or nearly 12%. The Renewable Energy Group reported first quarter divisional operating profit of $118.6 million, which compares to $95 million in the same quarter last year, representing an increase of $23.6 million or nearly 25%. Moving on to our capital plan for the year, for 2022, Algonquin is targeting to spend over $4.3 billion in capital, with the majority related to the acquisitions of Liberty New York Water, which closed earlier this year and Kentucky Power, which is expected to close mid this year. During the quarter, in addition to the approximately $609 million of capital deployed from the closing of New York Water, we invested over $225 million of capital into our utilities and continue to invest into our renewables development and construction programs."
}