{
    "symbol": "DGII",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-02 16:15:25",
    "content": "  Operator: Good day, ladies and gentlemen and thank you for standing by. At this time, I would like to turn the conference over to Mr. Jamie Loch. Joining me on todayâ\u0080\u0099s call is Ron Konezny, our President and CEO. This morning, Ron will provide a comment on our performance and then we will take your questions. While we believe the expectations reflected in our forward-looking statements are reasonable, we give no assurance such expectations will be met or that any of our forward-looking statements will prove to be correct. For additional information, please refer to the forward-looking statements section in our earnings release today and the Risk Factors section of our most recent Form 10-K and subsequent reports on file with the SEC. Finally, certain financial information disclosed on this call includes non-GAAP measures. The information required to be disclosed about these measures, including reconciliations to the most comparable GAAP measures are included in the earnings release. Now, Iâ\u0080\u0099ll turn the call over to Ron. Before we jump into Q&A, just a few highlights. I sound like a broken record, but we set new quarterly records for revenue, annualized recurring revenues, or ARR and adjusted EBITDA. We sustained first, the first of our three 100 goals with another quarter of over $100 million in revenues. We are excited to play a leading role in our customersâ\u0080\u0099 digital transformation, which has become increasingly important in unpredictable macro environments. We continue to see elevated demand as evidenced by a strong backlog, while a gradually improving supply chain has helped us exceed our expectations. Lastly, we are making tremendous progress with our processes, systems and services to enable superior customer experiences and accelerate the delivery of differentiated solutions driving increased ARR growth. At this time, Iâ\u0080\u0099d like to turn the call back to the operator for our questions and answers session. Mr. Moll, your line is open. Thanks for taking my questions. So I wanted to start off, Ron, I think I saw some of the language in your letter about having stronger confidence in the â\u0080\u009823 outlook. Yes, Tommy very good question. So, our performance has been more dictated by the availability of supply. And you saw that happen in the first fiscal quarter, we had more supply that enabled us to exceed some expectations there. We are seeing less of them that we saw in a period or a year ago, but they are not â\u0080\u0093 they are not alleviated yet. With that backdrop, you just outline which sounds fairly constructive. Yes, itâ\u0080\u0099s really our visibility supply chain itâ\u0080\u0099s not a demand issue. If that improves, certainly, we would be communicating that. No, we continue to make investments to the business. And we donâ\u0080\u0099t want to slow down those investments, especially those associated with improving the customer experience. And again, to the extent that we can get access to components, we do have some I think some very considerate assumptions we have put in there for costs. And although we work to mark those down, we donâ\u0080\u0099t want to make sure we get too far ahead of ourselves. Mr. Kumar, your line is now open. Ron, let me start off with something simple. Itâ\u0080\u0099s still in the double-digits, millions of dollars that we are not able to ship in any given period. We do think as the supply chain eases, there could be some normalization that occurs. But right now, we are still not able to meet all of our customer demand. I was curious if you could frame for us, how you see the growth in that business. Yes, we were really happy with this quarter, Harsh and that we have got balanced contributions from really all of our offerings across all of our geo. So it was a rewarding quarter and that included, of core SmartSense. And youâ\u0080\u0099re absolutely right, Harsh, food has been a big part of that businessâ\u0080\u0099 success, not just the restaurant side, but grocery continues to be a strong vertical for us as well. On the international expansion, we want to be very considerate. Europe would be the most likely scenario, especially as we land multinational customers that want us to have a broader presence. And then I had a very similar question, Ron, on integration of Ventus. Yes, again, good questions, Harsh. We do have one big milestone which is converting their ERP and CRM to the companyâ\u0080\u0099s systems, which will improve â\u0080\u0093 which will conclude about the middle of this calendar year. The international expansion is very similar to SmartSense and that we have some larger customers that are asking us in particular for European presence and thatâ\u0080\u0099s a great, great way for us to enter those markets. Part of the experience of being a Ventus customer is making sure that you have that excellent uptime, which includes making sure we have the people, the inventory, the processes and systems. Lastly, we are always looking for opportunities to grow inorganically. We â\u0080\u0093 as you know, we are focused on integration execution, reducing our leverage. And so that remains the priority, especially though maybe slowing down, but rising rates environments. Your line is open, Mr. Walkley. We are being very, very, I think considerate and thoughtful in making sure that we generate an incredible customer experience. And there is some system enablement that we are doing and we are going through, if you will, a crawl walk and run phase that will gain momentum as we pace through this fiscal year. We expect really to began fiscal â\u0080\u009824 at that run stage where in particular with routers, but other parts of our businesses as well, being really fully committed to that experience and that solution that has the strong attach rates. But I think we are also trying to be optimistic where â\u0080\u0093 while we are seeing improvement, there still is some constraints out there. And so when opportunities to especially in the component side present themselves for us to be able to deploy our capital that way and really secure that that forward-looking revenue thatâ\u0080\u0099s coming out of the backlog, we are going to take advantage of that. So, I would tell you that over the course of time inventory clearly will come back down to normalized levels. And so when all of a sudden, an opportunity arises, weâ\u0080\u0099ll go through an evaluation period to decide and sometimes your buying components knowing that you still donâ\u0080\u0099t have that proverbial golden screw. So, I do think it comes down, but I think inventory will most likely, it could bob and weave a little bit as those opportunities present themselves, but we evaluate that as they come forward. Ron, you talked in the past just about strong demand trends when you left on the table. Yes, itâ\u0080\u0099s really the availability of supply thatâ\u0080\u0099s been governing our performance much more so than demand. The backlog stretches up mainly the next four quarters, but in some cases actually goes well into fiscal â\u0080\u009824 for those that really want to ensure their delivery of products. And whatâ\u0080\u0099s nice is we are seeing not just good contributions geographically, but across different verticals whether it be as we talked about earlier, the food vertical for SmartSense, EV charging, renewables has been a strong segment, medical device has been a strong segment, data center, retail. Mr. Stoss, your line is now open. But maybe if I could just hone in a little bit more on the backlog, Ron. Yes, itâ\u0080\u0099s a really good question. Although as we said earlier, we are seeing some easing there, which clearly last quarter drove our outperformance. We have been really watching Europe, in particular, with the war in Ukraine, with inflation, rising energy costs. But with these rising input costs, if anything, really accelerate the urgency on digital transformation, to save on labor, to save on truck rolls. So we are pleased with better performance than we expected, especially out of the European theater. Mr. Searle, your line is now open. Thanks for taking my questions. Hey, maybe just to quickly jump in. Ron, it sounds like you are continuing to be supply constrained, but things are improving, you guys have guided conservatively. I would imagine at this point, itâ\u0080\u0099s probably pretty good. Yes, as I mentioned, demand has not been an issue for us. Given the information we have, we still see some sticking points, there is some components, especially those that are used by automotive industry that we are in contention with to get our allocation. And if I could, on the product front, you had good results, this quarter up sequentially, gross margins look good. I am wondering if you could provide a little bit more color in terms of how things are progressing from September to December in the outlook from a gateway perspective, from an Opengear perspective being the two elements of that business there, what you are seeing on that front, how that pipeline is shaping up and maybe some color in terms of the end markets? Yes, I think we have seen â\u0080\u0093 again really rewarding to see every one of our offerings grow year-over-year and contribute to the companyâ\u0080\u0099s success. One of the things that we are excited about is 5G is starting to gain a little bit more momentum than it has in the past, and in particular, for the retail segments. So we are excited to see that 5G start to kick in and that affects of course our cellular router and gateway business, but also businesses like Opengear to a lesser extent. And lastly, if I could on the IoT solutions front, revenues were a little bit flattish there, ARR grew, but it hadnâ\u0080\u0099t grown at a particularly accelerating pace. Yes, itâ\u0080\u0099s a good question. And we do feel confident we have got the pipeline, weâ\u0080\u0099ve got the opportunities that there is, if you will, a real deliberate approach to make sure that ROI is there, especially with larger rollouts that really start to move the needle. But the larger opportunities I think are gaining a little bit more scrutiny, but we do expect those to really help push that ARR growth further as we go throughout the fiscal year. And maybe Ron, just to quickly follow-up, as you start to look at the gateway business and managing some of that transition to more of a Ventus model. Yes, itâ\u0080\u0099s a very good question. So for example, at the NRF Trade Show held recently in New York City, those teams were really in the same exhibit area, working with those customers to make sure we are providing the best solution. Mr. Soderberg, your line is now open. Embedded will not be 100%, those companies are typically working with us at the engineering level. We are a part of their IoT solution, but not necessarily all of it. That doesnâ\u0080\u0099t mean, we can improve our ARR in that business, but itâ\u0080\u0099s not going to be 100% like we would expect out of our businesses. Of course, in solutions that are already there, but even our box businesses like infrastructure management, cellular and Opengear, where we think we are going to have really compelling offerings. And then Jamie, on the gross margin front, I think they were slightly down year-over-year. In that constrained environment, you are seeing pricing on certain components going up and above what we have got our standard pricing in that. So, one of the challenges that we do get is as inventory goes up, we see a little bit more purchase price variance going through the P&L. We are seeing that to some degree on a large scale, kind of the theme is that itâ\u0080\u0099s coming down, you still see pockets of it. And again, itâ\u0080\u0099s kind of back to that timing issue, we are depending on the components that you buy, that depending on the opportunities that how you are deploying the working capital. That is another part of the equation in terms of where is the pricing on those components, where do we think that pricing is trending. On the gross margins side, we have talked in the past about our pricing strategies and how in some cases, you are able to get that reflected in price. In other cases, we have made determinations that itâ\u0080\u0099s appropriate for us to make that investment and to the relationship with our customers. And you are seeing that just a regular, pretty consistent ticking up. And I think you will continue to see that as the supply chain stabilizes, as recurring revenue becomes a greater mix of the total revenue portfolio, which provides strong mix into that. So, I think you will continue to see that, that gradual improvement making its way through as those two elements, as time allows those to flow through the P&L. Mr. Moll, your line is now open. Ron, one comment you made in the materials this morning was around, ARR was maybe not as the growth was maybe not what you had hoped for first quarter, but you are still confident in exceeding overall revenue growth for the year. So, what we are spending a lot of time as a team is making sure of that, especially in a business that goes through a channel, Tommy, that when we ship inventory to that channel and it eventually gets to the end user, we get that point of sale data back. So, we create the customer account or if itâ\u0080\u0099s an existing account, those products go into that account, so itâ\u0080\u0099s a seamless zero touch activation for the customer. And the first contact they get is a proactive one for us, making sure the channel partners have the systems, the tools and give us the data on a timely basis is incredibly important. And of course, then we have got to make sure we ingest that data into our ERP, CRM system and into any host systems like the best device management system. So, that gives you an example of some of the plumbing that we are putting in place to make sure that that customer experience is an outstanding one. Jamie, this will be my last question of the day. And I wanted to ask a follow-up on working capital, which has been discussed a couple times or at least inventory. I hear you loud and clear that making a call on inventory any given quarter is difficult, just because you have got the plan to buy opportunistically as I think I hear you say. I do think when you look at it over the year, I think Digi has always been a good, strong generator of cash. But I definitely â\u0080\u0093 right now, I am not projecting that it would flip into a use of cash position as much as just less positive than normal course and speed. Your line is open, sir. The follow-up guys, first of all, just a quick comment. I love the format of this call, all the information is in the letter, and then itâ\u0080\u0099s just pretty quick, and we can get to the topics that are on our mind. And then Ron for the question, you have got a couple of different software, you have got Lighthouse, you have got SmartSense software. As probably most people know, our solution segment, itâ\u0080\u0099s 100% attach rate. Within our products and services businesses, the attach rate, if you will, has been well under 30%. As an example, the OEM business recently announced their connect core cloud and connect core security services, which allow our customers to have more of the solution provided and get them to market more quickly. So, you are seeing very demonstrative efforts on the products side as well. And with these opportunities, with the exception of embedded, we think we can race towards the 100% attach rate. But we want to be very considerate, very thoughtful into the process of systems, the service and the experience that this bundle that we are offering is going to be comprised of 24/7 support, limited lifetime warranty, and of course all of our device management capabilities and software. So, we think itâ\u0080\u0099s a compelling offering of that the market will see. Yes, itâ\u0080\u0099s not mandatory. And thatâ\u0080\u0099s a courageous moment for us Harsh, where we tell the customer that doesnâ\u0080\u0099t want the full offering that we may not be the best fit for them. Hey, appreciate it, Ron. Congratulations again, Jamie, Ron and the team. For investors, we will be attending ROTH Capitalâ\u0080\u0099s 35th Annual Conference, March 12 to 14 in Dana Point, California. Ladies and gentlemen, thank you for participating in todayâ\u0080\u0099s conference. Everyone, have a wonderful day."
}