{
    "symbol": "AXON",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 19:12:11",
    "content": " And then, yes, there's really no -- nothing -- in Q4, we had some unfulfilled demand that rolled into the first half of the year, but we're sort of back to more normalized levels, obviously, quarter-to-quarter order inflows. And when we couple that like you mentioned, Sami, with a better EBITDA, both dollars and margins in the back half of the year, there's a lot of opportunity to improve free cash flow in the back half, and we're really focused on it, and that's what we're going to do. So we basically -- let's slow down a little bit, let's really recalibrate and see what the post-COVID world looks like and let took the building cost cool off a little bit, and now give us a little time to just keep tuning and refining. Looking at the TASER gross margins and your commentary regarding improvement in the second half of the year, I mean, previously, I think the manufacturing automation was going to happen when you're going to build the campus, but it sounds like things are changing. Can you talk a little bit about maybe philosophically, where you're seeing that opportunity, the spend as if it's your own, I know I'm not saying that right, but that campaign -- yes, I just want to understand, like do you feel like there was maybe lack of oversight there in the past, or is this a situation where you're just trying to tighten the belt a little bit. But I think at times, we've gotten just a little bit bloated in how we think about things from the number of people that attend meetings with customers like Rick mentioned, or Swag is another obvious one, where we have -- and maybe the absence of being in the office, we've used Swag as a way to kind of connect with our employees. And so you go through cycles, several years ago, we had a scrappy year where -- that was an opportunity for us to lead and say, okay, this is the year we want people to really like it's very similar what we did we spend it like pictures, like old be scrappy was, hey, we want to focus in on finding ways to more efficiently get things done and where more people are being scrappy and not throwing a body at every problem. So, I think this was a balanced way for us to connect with -- maybe even some of the angst our employees are feeling about the macro environment, like, hey, here's something you can do really buckle down on expenses so we can continue to invest over here because we know these are the times those investments really pay off. In other markets, we're starting to see â\u0080\u0093 I position it like international governments are starting to dip their toe a little bit into the body camera world and start to understand kind of what's going to work for them and what's not."
}