{
    "symbol": "AXON",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 20:27:05",
    "content": " The first is we've got a really, really strong team that's doing great work around the globe across a lot of different products and a lot of different markets. Now when we combine that with bookings from last year and years prior, which is a really good forward indicator of revenue and just the strong pipeline that we've built up through this year that we see a high probability of closing, I think it just gives us a lot of confidence across the board. So this is the first year we've added free cash flow guidance, and we've got a fairly wide range I think the main driver of why we didn't update the free cash flow guidance is largely the revenue out of performance is going to be spread over most of the rest of the year, and there's typically a lag between that revenue over delivery and sort of that translate into cash. And it's about customers even outside of those, adding a la carte add-ons for our diverse range of new products, both premium features on top of our classic products like Evidence.com as well as new things like VR and across the board and then doubling down on that the expansion into new market segments like federal and justice and the others and global expansion into other geographies. I think we have a very intentional strategy there, and we've had that same strategy for some time now, which is really fortify what we would call the Tier 1 markets, the UK, Canada and Australia and try to become the market leader across both less lethal and body cameras. And so now we're really focused on repeating that same mechanism in those markets, building up a sales force that's capable of selling both products, working with early customers and then kind of using that same land and expand approach to growing and becoming the market leader in those categories. I think it's a great case study and how the first product kind of demonstrated the use case and then the subsequent couple of versions of the product have kind of propelled us into a place where we're among the market leaders, if not the market leader in that space. And because we're building the tools to extract transcripts and be able to get smarter about how to extract metadata and alerts and things from these cameras to be able to then populate that into more structured data forms, I think just creates virtually -- I don't want to get too excited here, but almost any enterprise could have a need to use this type of way to document what's happening in their interactions, whatever they may be. And I think going into kind of our next round of planning, we will make some more investments to make this even more attractive to future customers outside of public safety, and we're really excited about where that road leads. I think we're focused on deploying with like Fortune 500 companies that see a need for this, whether it's last mile delivery services or retail or other risk management opportunities. Whether it's in hospitality, there are some really kind of clear use cases where we're getting a lot of positive feedback on the use of cameras, and I think we're seeing it at kind of a macro level as well."
}