{
    "symbol": "VICR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 00:00:05",
    "content": " As our new factory comes online and we release our new 5G modules into production this year, our front-end team is laser focused on our top 100 customers securing design and production wins that will put us on track to achieve our Northstar goal of $1 billion in revenues and 65% gross margins. Your line is open. I think as Phil pointed out, we are seeing the effects of the long lead times and growth pace a year ago with some key customers being concerned with respect to being able to get enough product and ordering ahead to ensuing events involving a variety of factors from the exclusion of certain products from the Chinese market to the setbacks that is the industrial large suffered with respect to contraction in the general level of activity. Your line is open. Your line is open. Your line is open. Your line is open. And for a variety of reasons that constraints on the competitive alternatives with respect to, what they can do in terms of power distribution networks, and one of our greater opportunities aside from again, the density of the molecules, and the advantages of high price power, have to do with our enabling ways to deliver that power that bring about much greater efficiency in the power distribution, that is the copper layers, letâ\u0080\u0099s say within a bar, and related to that, the much greater control of the voltages within domains in the silicon itself, which is an issue that, frankly, many customers donâ\u0080\u0099t yet fully appreciate that they see the silicon on running Red Hat. In the fab, to make these kinds of products with vertically integrated processes as got a number of novelties and complexities that weâ\u0080\u0099re bringing together for the first time, I guess, United States, the fact that the delivery of some of these equipment got delayed by I think, 5 or 6 months also, given the cycle time for developing the equipment and manufacturing. Your line is open. And I think whatâ\u0080\u0099s particularly noteworthy is that in terms of resetting the level that weâ\u0080\u0099re setting the bar of expectations in terms of power density, current density and the critical needs in computing automotive and other major applications, I think is well beyond the setback in performance that Vicor was able to achieve with prior generations of products. They still have to leave the session but there are trends that follow the earlier ones so thereâ\u0080\u0099s an opportunity to intersect with 5G from a design process perspective is starting this year weâ\u0080\u0099re engaged in a few instances with the kinds of customers that we can be engaged in at this stage of 5G capability, which is really still preliminary because while we do have target specs for very comprehensive product portfolio, the targets paths are not final yet, while weâ\u0080\u0099re waiting for some of the last elements, enabling elements to fall in place. Your line is open."
}