{
    "symbol": "ASAI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 15:43:05",
    "content": " We have an important intensification of our competitive advantages this year considering the macroeconomic scenario, but we also have been able to balance itself with sales and our competitive advantage as well which made us grow by over 30% in the quarter. But especially with historic conversions of the extra stores and even the organic stores where we're opening stores that have better location, there's an interesting convergence providing convenience to customers that prefer this option. And when it comes to the market as well, an increase in our vision and we're going to get into this as well when we talk about ESG but we have an economic moment that's going to be very favorable to us in this opening now in the second semester. Everyone from our 60,000 employees in different areas and functions and roles for their work when we look at the numbers and we talk we have about being a company that of BRL 60 billion in a year as revenue you can be share that there's  an effort from many different areas and teams and departments working daily to deliver not only the numbers we're presenting here because we are publicly held company. And about the same-store sale point, I think we have to compare same stores with the same and all the same cash-and-carry with the cash-and-carryâ\u0080\u0099s because I say we don't have the distribution wholesale operation where of course, you can reduce margins and you can burn a big amount of margins and have a higher volume of sales. And so if we look at the sales per square meter, the highest indicators we've reached almost BRL 5,000 per square meter and that's already considering the expansion, of course. So what we saw in the first quarter, we have an event that took place and it's the company which considers a really high volume of sales and this, of course could sometime may bring in this kind of strategy. And sometimes give us a bit of a lack of room for margins and competitive advantages especially considering the new stores, which is where of course we invest because in our vision, this is the target audience that will generate loyalty. So we see a lot of room for this as well really looking at the assumptions in this project when it was idealized and the acquisition of the extra hyper stores, that would be capped at a stable level or even higher. And so as Belmiro mentioned to you guys, we have a number of stores that's quite relevant that we're going to be opening every quarter. Thank you for that question, Vinicius. There's of course, an important event in this but the focus at this moment is to have the actual conversions and of course to provide a digital experience with this digital strategy for customers that are in the stores today. Thank you for that question, Vinicius."
}