{
    "symbol": "OBSV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 11:27:02",
    "content": " On the cost of these key milestones, we wanted to share more details on what we see as the market opportunity for Linzagolix for uterine fibroids, our commercial launch preparations, and how this program aligns with ObsEva’s mission to bring much needed innovation to the field of women's health. The Linzagolix program is currently before each of the European commission and FDA for review, and if approved will be the only approved oral GnRH antagonist to offer flexibility and choice for women suffering from uterine fibroid, including a non-hormonal dosing option to address the needs of women with uterine fibroid who cannot or do not want to take hormones. Importantly, for women with uterine fibroids who cannot, are at risk of or simply do not want to take hormones, which as I noted may account for at least half the patient population, Linzagolix has the potential to be the first and only approved oral GnRH antagonist that does not exclude hormonal add-back therapy. As Brian noted, we believe what sets the Linzagolix program apart is the potential to provide individualized treatment options to address the needs of all patients, including for the first time in an approved product, those women who are contraindicated to, at risk of, or prefer to avoid hormonal add-back therapy. Taken together, we believe these results support further development of Linzagolix in the endometriosis indication, and we plan to discuss next steps with regulators, including exploration of a non add-back therapy dose option as we believe endometriosis remains a crucial unmet need in a large global patient population and women deserve options and flexibility in their medical treatment. GnRH antagonists may offer a new gold standard treatment for uterine fibroids, and we believe linzagolix has a potential to not only lead the class in terms of efficacy and overall group profile, but also offer the first and only approved oral GnRH antagonist option to address the needs of women who can't, are at risk of, or simply prefer not to take additional hormonal add-back therapy. For prescribers, we will position Linzagolix if approved as providing the best efficacy across patient profiles and the only option to address the different needs to all patient categories, including those women who can't, are at risk of or don't want to take hormonal add-back therapy. In summary, we believe the Linzagolix product profile combining potentially best-in-class efficacy and we're the only dosing option to address the needs of patients who cannot, are at risk of or simply don't want to take hormonal add-back therapy alongside our commercial relationships, position this program to become a leading therapeutic in the class if approved."
}