{
    "symbol": "RPAY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 19:21:05",
    "content": " Our Consumer Payments segment which accounted for approximately 80% of our card payment volume in 2022, serves the following verticals; Personal and automotive lending, credit unions, mortgage servicing, receivables management, consumer health care and diversified retail. Our Business Payments segment, which represents approximately 20% of our card payment volume in 2022, is comprised of the accounts payable and accounts receivable automation solutions servicing approximately 4000 clients across the following verticals: health care, media, auto, municipalities, home services and property management; including hospitality, HOA and multifamily management. The Business Payments segment one of which I've been a part of for more than two decades has experienced incredible growth over the past few years, particularly in this post-COVID labor environment. The confidence in our growth strategy is driven by: first, a strong sales pipeline in Consumer and Business Payments as a result of our increased investments in go-to-market and product innovation. Our Consumer Payments segment reported solid gross profit growth of 24% in Q4 and our Business Payments segment continues to be a great gross profit growth driver, a 31% year-over-year growth. During the fourth quarter, we used approximately $8.7 million of cash for share repurchases and onetime settlement payments to certain large clients and partners. Please note that while our outlook implies lower revenue take rates than in prior periods, this is primarily due to the addition of several enterprise clients at more competitive pricing, Business Payments growing as a percentage of our overall mix in the Blue Cow sale, as that business had higher take rates than the corporate average. And then in ARM, which is about 10%, we think there's potential for increased volumes in the latter half of this year given some of the delinquency trends and the other sub-verticals within consumer payments and that could benefit us in the second part of the year."
}