{
    "symbol": "RYI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 19:33:04",
    "content": " During the second quarter, and as noted in our subsequent event disclosure, we retired the remainder of our high-yield notes, reduced net debt, lowered cash interest cost, completed our share buyback, amended and extended our asset-based credit facility, increased liquidity, increased the dividend, announced a new and larger share repurchase authorization, increased net book value and made important growth investments across our service center network in new plants, equipment and systems to further our company's potential and enhance the customer experience. In the second quarter of 2022, Ryerson reported net sales of $1.74 billion, which came in slightly lower than guidance, benefiting from sequentially higher ASP per ton, but impacted by weaker-than-forecasted stainless steel volumes. Ryerson's higher ASP per ton, sequentially gaining 0.5% to $3,327 in the second quarter, was driven by favorable pricing in aluminum and stainless steel and partially offset by a decline in the price of hot-rolled coil quarter-over-quarter. Adjusted EBITDA for the third quarter of 2022, excluding LIFO, is expected to be in the range of $110 million to $120 million, and earnings are expected to be in the range of $2.40 to $2.60 per diluted share. Overall, Ryerson generated $85.5 million of operating cash in the second quarter and ended the period with $534 million of total debt and $492 million of net debt, a decrease in net debt of $14.5 million compared to the first quarter. The company's available global liquidity increased to $894 million as of June 30, 2022, from $760 million as of March 31, 2022, due to the successful increase of our revolving credit facility from $1 billion to $1.3 billion during the quarter. While the sequential net debt reduction was $14.5 million, compared to the $67.7 million of free cash flow, it is important to note that $52.4 million was returned to shareholders in the form of share repurchases and dividends during the second quarter of 2022. Finally, on August 3, Ryerson's Board of Directors declared a third quarter cash dividend of $0.15 per share of common stock, a sequential increase of 20% from the second quarter dividend of $0.125 per share. Ryerson generated revenue of $1.74 billion in the second quarter of 2022, and gross margin expanded by 320 basis points to 26.7%, up from 23.5% in the first quarter of 2022 as cost of goods sold reflected lower cost of carbon steel material. Net income attributable to Ryerson for the second quarter of 2022 was $196.4 million or $5.10 per diluted share, compared to $163.6 million or $4.17 per diluted share in the previous quarter. Excluding these onetime items and the associated income taxes, adjusted net income attributable to Ryerson was $204.4 million or $5.31 per diluted share, compared to $167.5 million or $4.27 per diluted share for the first quarter. In closing, Ryerson achieved adjusted EBITDA excluding LIFO of $224.2 million in the second quarter of 2022, compared to first quarter of 2022 adjusted EBITDA excluding LIFO of $250.6 million."
}