{
    "symbol": "GES",
    "quarter": 1,
    "year": 2022,
    "date": "2021-05-27 22:40:05",
    "content": " During the period, our revenues reached $520 million, doubling last year's results and were only 3% below revenues in the LLY period. Adjusted operating profit was $26 million in Q1, which compares to an adjusted operating loss of $109 million last year as we faced the most challenging time of the pandemic. This also compares to an adjusted operating loss of $22 million in the LLY first quarter period, a $48 million improvement. As a result, we delivered an adjusted operating profit in Q1 for the first time in six years with every one of our segments delivering higher profit than pre-pandemic LLY. Additionally, government restrictions for our retail operations in Europe and Canada had a material negative impact on our sales with these temporary store closures worth about 12% of sales versus LLY for the total company during the quarter. Adjusted SG&A for the quarter was $186 million compared to $204 million two years ago, a decrease of $19 million or 9% and better than our expectations. In addition, there was a benefit of about $7 million from government subsidies, mainly in Europe, which was partially offset by higher variable expenses related to the growth of our e-commerce businesses. Free cash flow for the quarter was negative $65 million, an increase of $3 million versus negative $68 million last year. For both the second quarter and the full year, we are raising our revenue expectations from down high-single-digits to LLY to down mid-single-digits, as permanent store closures and pandemic-related traffic declines are partially offset by continued momentum in our global e-commerce and wholesale businesses. In Americas Retail, we continue to see performance roughly follow trends in Q1 and expect total revenue declines for Q2 and the rest of the year to be in line with our Q1 performance, which was down 12% versus LLY, primarily impacted by permanent store closures. Lastly in licensing, we had a very strong first quarter, but we are modeling for the year to be down to LLY given the challenges in the wholesale business globally right now."
}