{
    "symbol": "GVA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-01 08:22:04",
    "content": " At this time, I would like to welcome everyone to the Granite Construction Incorporate 2022 First Quarter Conference Call. These forward-looking statements are estimates reflecting the current expectations and best judgment of senior management regarding the future events, occurrences, opportunities, targets, growth, demand, strategic plans, circumstances, activities, performance, shareholder value, outcomes, outlook, guidance, objectives, committed and awarded projects, or CAP, and results. These include, but are not limited to, adjusted EBITDA, adjusted EBITDA margin, adjusted net income or loss and adjusted earnings or loss per share. In our fourth quarter conference call, we briefly discussed our new strategic plan. Today, we will share more detail about our plan and how we believe it will position Granite for success. We have made substantial progress in derisking our project portfolio by narrowing the footprint of our former Heavy Civil group, and introducing rigorous project selection criteria. We believe that this transition has increased the quality of our committed and awarded projects, or CAP, and then our existing CAP portfolio positions us for increased profitability in 2022 and beyond. Our strategic plan contemplates a return to strong profitability by focusing on our core construction skills, the skills that we had developed and honed over the past 100 years. As part of this focus on core competencies and as previously announced, we are in the process of divesting our former Water and Mineral Services group businesses. These revised groups, California, Mountain and Central are focused on a home market strategy to build on the strengths that made us one of the most respected contractors in the country. As we look to capitalize on increased funding from the federal infrastructure bill, it is critical to have skilled trained teams ready to execute work across the organization. We are implementing more rigorous and standardized continuous training at all levels of the organization, which will enhance the flexibility of our workforce and promote the growth of our people. Additionally, for high potential employees, we have developed and implemented a suite of leadership training programs focused on business acumen, managing people and strategic planning with a goal to graduate 250 employees annually with 40% being people of color or women. In the Construction segment, we are focused on three key factors, appropriate project selection and accurate estimate on bid day and execution during construction. To enhance our work on these factors, we established the Construction Leadership Council, or CLC, to identify and promulgate best practices in the bidding, estimating and project execution processes. Through a CLC, we are focused on further strengthening these processes with increased training, enhanced standardization, improved database projections and universal adoption of best practices. Within Construction Materials, we are raising the bar by automating our plants to increase production capacity, while lowering our per unit costs. Utilizing the latest technology, these facilities not only replaced aging plants, but significantly increased production capacity and efficiency, thereby lowering our overall costs. Investment in materials facilities continues in 2022 with a variety of upgrades and enhancements to our hybrid plants, which will provide competitive advantages as we work to strengthen our home market positions. As I will discuss shortly, this growth will be in two phases, the near-term support and strengthen phase, and the longer term expand and transform base. We intend to maximize value add by improving capital management, growing earnings, delivering consistent financial results and leading the industry in environmental, social and governance performance. We will deliver value back to shareholders, while simultaneously investing in growth organically and through M&A. Through experience in markets where we have an established presence, we build market intelligence and insights, which allows us to read a competitive landscape, identify the best project opportunities and implement the most effective strategy to win and execute work. In a home market, we are an active member of the community with longstanding trusted relationships with vendors and subcontractors. These hard-won relationships with key stakeholders, they grant the contractor of choice within our home markets. Our home markets have readily available resources, both in terms of quality construction materials and workforce. In these markets, we have many long-tenured employees, and believe we are the employer of choice and on contractors for both salaried and craft workforce. We can leverage our solid relationships with our union partners to obtain the workforce that we need for our projects, even in the current challenging labor conditions. Finally, having strong relationships with project owners and regulators is crucial to driving our client-centric culture and a key aspect of our home market strategy. Our goal of being the contractor of choice is not going to be selected for emergency work or best value procurement projects, but to maximize collaboration with our stakeholders throughout the full life cycle of a construction project. In home markets, we know the clients and representatives are working together for many years and enjoyed the strong relationships that support long-term success. From 2018 to 2021, we increased the percentage of construction revenue from private owners from 17% to 24%. Better portfolio balance will allow us to maximize our capabilities and resources, driving better returns for all stakeholders. 2022 and beyond, we will continue to strengthen existing home markets and develop new ones. In some markets, it is difficult to secure work at acceptable margins without access to quality materials. Selling materials to our projects as well as to our external customers increases volumes for our materials plants, lowers our fixed cost per ton and maximizes profit. Second, we collect knowings from our projects to use as Recycled Asphalt Payment, or RAP, in future asphalt mixes. By reducing the amount of virgin material utilized, we lower potential cost of projects, thereby increasing the profitability of our materials business. In addition, our aggregate quarry locations, backhaul materials from construction projects utilizes fuel for use in future projects. Finally, we achieved tax savings through the transfer of materials internally to construction projects rather than purchasing the materials externally and paying applicable sales taxes. And through vertical integration, it will continue to drive our sustainable, profitable growth in the future. Our liquidity, balance sheet and cash generation allow us to invest in our business, which we will continue to do this year and moving forward. Within the support and strengthen phase, we plan to invest over the next three years in solidifying and bolstering our core competencies and expanding within our existing markets. Within the materials business, we are making investments to upgrade production capacity in aggregate facilities while increasing automation and energy and water conservation. In addition, we continue to invest in materials reserves to ensure that our facilities and markets have access to aggregates for today and into the future. In the near-term, we intend to strengthen and expand our current markets with bolt-on acquisitions. We are continually evaluating bolt-on acquisition opportunities, and are excited to strengthen our home market footprints to future transactions. Looking to 2024 and beyond, we plan to expand and evolve through more transformative investments in the new geographies through vertical integration expansions and platforms. As we move into this period of our plan, we want to build our M&A and integration capabilities through small to midsized bolt-on acquisitions and will expand to more transformative acquisitions by entering new markets or adding materials assets where we currently don't have a vertically integrated presence. Over the next few slides, I will cover our financial targets and expectations through 2024, starting with revenue. Since the timing of M&A is highly dependent on the market and opportunities, these slides are focused on our continuing operations business and our expected organic growth. As we stated last quarter, our guidance for revenue in 2022 is for low single digit growth from 2021. At the end of the first quarter of 2022, we are maintaining that guidance with growth from the California and Mountain groups expected to offset an intentional decline in revenue from the Central group as we continue to transform that portfolio. As we move into 2023 and 2024, we expect to benefit from a strengthening funding environment with the federal infrastructure bill, resulting in an increase in opportunities that will aid 2023 and continue to grow in 2024 and following years. As we saw in California, when SB-1 was implemented, the full benefit of the infrastructure bill will take time to be realized with maintenance projects funded first and expansion projects funded as designed, right of ways and other requirements are completed. We believe we are well-positioned to capitalize on the positive environment in our key vertically integrated markets, including California, Washington, Nevada, Utah and Arizona. Given the public funding dynamics and strong private economic environment, we believe we will reach our target of $3.4 billion to $3.6 billion of revenue by 2024. This slide details the historical gross profit and gross profit margin, both including and excluding old risk portfolio losses for 2019 through 2021. In the Construction segment in 2022, we will work through most of the old risk portfolio, or ORP, with planned completion in 2023. As we move through 2022 and 2023, we anticipate improvement in gross profit margin as margin pressure from the ORP declines. In addition to the uplift from the completion of the ORP, we are focused on raising profit margins on our projects through multiple avenues, starting with the previously identified key factors of procuring the right project, maximizing profit on bid day and executing every day to meet and exceed bid day margins. Our operations have previously achieved this level of profitability, and we are confident we can consistently reach this level again by 2024. Within the Materials segment, we are focused on increasing profitability through investment in technology, disciplined performance and pricing. In 2020, the materials business benefited from low oil prices, with a gross profit margin of 17%. While lower commodity prices cannot be expected to repeat in future periods through our investments and initiatives, we believe we will reach our target gross profit margin of 15% to 17% by 2024. As noted on the slide, our SG&A as a percentage of revenue has been largely consistent over the last three years. Our new strategic plan centers on capitalizing on the return to our core businesses by maximizing standardized processes to accommodate future growth, while minimizing increases in SG&A. We have the people and resources in place to allow us to drive top line growth, while remaining at the low end of our SG&A range. We expect significant improvement in adjusted EBITDA margin from the 5.4% reported in 2021 to our target of 9% to 11% by 2024, driven primarily by the increase in Construction gross margin and more moderate impact coming from improvement in Materials gross margin and SG&A efficiency. Maintenance CapEx historically has been to 1.5% to 2% of annual revenue, and we expect that to continue in future years. Granite's ability to win and deliver a profitable project relies on timely replacement and upgrade of equipment and facilities, so that our people can focus on sustainable project delivery. Earlier, Kyle walked you through our home market strategy and our intention to invest in our vertically integrated business model organically and through M&A. Our markets are healthy and expecting strong growth, making it important to build upon our existing market positions through the right bolt-on acquisitions in the near-term and more transformative opportunities down the road. Finally, we announced an increased authorization in our share repurchase program last quarter, resulting in an authorization for up to $300 million in purchases. Before I turn it back to Kyle to go over our first quarter results, this slide summarizes the key financial metrics we expect by 2024 from our strategic plan. We expect sustainable organic revenue growth with increased profitability, while maintaining efficiency in our administrative support functions. Now, let's shift the discussion to the first quarter, starting with the Construction segment. While we saw an overall decrease in revenue in the first quarter from the same period last year, I'm encouraged by the mix of our results for the quarter. In the Central group, this decrease was partially offset by a good performance in the Arizona region, which entered the year with a strong backlog. In California, while there was a revenue decrease year-over-year, this is primarily due to weather in early California and delays in project starts. As we stated in our guidance, although there was a year-over-year decrease in revenue in the California group, we expect that the turnaround in following quarters, resulting in an increase in revenue for the 2022 fiscal year compared to 2021. For the Mountain group because of where their operations are located, the construction season generally does not begin until after winter. But even with that limitation, the group turned in a strong quarter with revenue increasing in multiple regions, led in particular by our Utah region. The last two years, a key component of the Utah region's success has been its work on the Granite joint venture on $350 million progressive design build project for the Utah Department of Transportation. In February of this year, we announced another progressive design build Granite led joint venture for the Utah Department of Transportation. It is the best value procurement project in our home market, where we know the owners, vendors and subcontractors where the project will be built by experienced Granite crews. While there was an overall decrease in CAP since the prior quarter and from the prior year driven by the Central group, both the California and Mountain groups ended the quarter with increases in CAP sequentially and over 2021. While the first quarter of the year is always competitive, we have seen a better environment compared to the beginning of last year. In the Materials segment, aggregates and asphalt volumes increased year-over-year in all three groups. Although, oil prices increased and remained high during the quarter, cost mitigation strategies such as bulk purchases and forward contracts partially offset the increase in oil related prices and pressure on margins. While it is expected that inflation in clean oil prices will continue to be elevated and volatile, we believe resilient market demand for construction materials will continue driving revenue throughout 2022. Now, I'll turn it back to Lisa to discuss our financial results for the quarter. In the first quarter, revenue decreased 3% from the prior year while gross profit decreased 7%, resulting in a gross profit margin of 9%. In the Construction segment, revenue declined $32 million year-over-year to $475 million. The California group was impacted by work start delays, while the Mountain group completed a strong first quarter. The Construction segment's gross profit for the quarter decreased 9%, resulting in a gross profit margin of 10%. The ORP ended the quarter with remaining CAP of $246 million, a decrease of $73 million from $319 million in the prior quarter. The burn during the quarter was consistent with expectations and is on pace for the expected progression in 2022, leaving approximately $50 million going into 2023. First quarter net ORP losses to Granite, which excludes non-controlling interest, were $3 million on revenue of $80 million compared to breakeven on revenue of $105 million in the prior year. The Materials segment's revenue increased $13 million or 22%, led by strong demand and volumes, as well as price increases in both asphalt and aggregates over the prior year. Materials gross profit increased $1 million, with a slight year-over-year increase in gross profit margin to 2%. Although cost pressure due to increased liquid asphalt and diesel prices impacted the first quarter, both purchases, forward contracts and financial hedges partially mitigated the effects of the cost increases. Adjusted net loss from continuing operations for the quarter increased $6 million year-over-year to $13 million or an adjusted diluted loss per share of $0.28 compared to an adjusted net loss of $7 million, and adjusted diluted loss per share of $0.15 in the prior year. For the year, our adjusted EBITDA margin guidance of 6% to 8% is unchanged. Typically, cash is used by operations in the first half of the year due to seasonality as projects begin and ramp up. In the first quarter of 2021, cash flows benefited primarily from the timing of cash collections from receivables. At the end of the first quarter, our liquidity remains strong, with cash and marketable securities of $398 million and revolver availability standing at $242 million with no debt currently drawn on the revolver. Our fixed interest rate debt at the end of the quarter is $299 million, down from $340 million at the end of the first quarter of 2021, reflecting the early paydown of half of our term loan. During the first quarter, we closed the sale of the Inliner business and made progress in the divestiture process of the Water Resources and Mineral Services businesses. While it is still early to definitively say the amount that will be received from the transactions, we believe that the combined value of these businesses is greater than that of the Inliner business. In March, we executed share repurchases of 611,000 shares for approximately $19 million, leaving $281 million remaining of the $300 million share repurchase authorization. With our strong cash position and expected cash inflows from the sale of the remaining Water Resources and Mineral Services businesses, we will evaluate the continued repurchases of shares that will provide immediate value back to shareholders in 2022 as long as the share repurchases are highly accretive. We plan to sustainably grow our businesses, strengthen and expand our current footprint and then pursue more transformative platform acquisitions in the longer term. While investing in our business, we are also focused on utilizing our strong cash position to return immediate value to our shareholders. As increased funding is expected to flow into the market later this year, we expect our CAP to expand with the opportunities leading to organic growth in 2023 and 2024. Maybe to jump in kind of big picture, it looks like Granite has a great setup in the year with a lot of excess capital from the divestitures and then the ORP burning off to a very low level. From an investment framework perspective, over the next two, three years, we're really focused on supporting and strengthening our existing home markets. So, we need to continue to ensure we have access to aggregates for our materials business. So that's a primary focus for us, let's say, over the next two or three years. So, we're looking at getting into acquisitions around civil construction and materials within the existing footprint that we're in today. We think it's easier to capitalize on synergies and drive utilization, but it's also easier for us to integrate. So, we think that that's going to give us an opportunity to go out do some deals, demonstrate our ability to do the deals and integrate the deals and set ourselves up down the road, where we want to do something more transformative. And then, thinking about CapEx this year above levels we've seen in the past three years. And then one more, thinking about the near-term, good to hear the bidding environment year-to-date is better than last year. Well, so as we shared, we're really looking to get, I would say, outside of the ORP, about a 2% margin improvement by 2024. One is going to be on bid day, getting more money on the projects that we're bidding in the market. I can tell you at this point through the year and 2022, we are seeing -- our hit rate improve with higher margins on the work that we are procuring. So, you add that to our materials business that have higher volumes in the quarter and higher margins, everything is really pointing towards a much better market in terms of health than we saw last year at this time. So, everything is kind of set for us from a market perspective today. But today, it's looking very strong. Kyle, on your goal for revenues and margins of 2024 versus where we are today and you put forth some very helpful guidepost. But what are the -- again, economy aside because there's -- GDP came out negative this morning. I know you're going to be making some investments, but those can I think will kind of be fruitful and pulling wise. I think we've been demonstrating that with our California and Mountain teams over the last couple of years, they've been growing their CAP. I think as we wind down the ORP, we're actually in a position this year where we can take those employees and resources and put them on to these projects that we're going to see that are going to allow us to grow our company, they are going to be quality projects. So, the timing is working out quite well for us, assuming the restructure bill starts to flow in to good opportunities late this year and we can actually turn those into construction projects in 2023. So, I think that's probably the opportunity for us. I mean, that's a big piece, if not the foundational piece of our strategic plan, is to make sure that we're recruiting and developing and retaining our employees and creating opportunities for them that will create more opportunities for the company. So, certainly, your California and Mountain businesses, given your historic and your levels and the level of integration and your -- the execution of those divisions have been quite good. So, it's got a whole different mix than what we probably used to when we talked about, say, the Heavy Civil group which is a little bit different. And so, we knew that it was going to take some time as we wind down the ORP to transition the Central group into more of a BI type business. And I don't know if that's even the ultimate goal today or being in the near-term, but we really are pushing them to look at different types of work. So, no longer pursuing these big large mega projects, design build projects that got us into trouble. So, now we're focused on smaller work, and we even went further with this home market strategy. So, they're no longer even called the Southeast region as the Florida region or the Central region, it's now the Texas region. So, we're really starting to narrow in their home market, because we know they can procure work in their home market. They've been working really hard on it over the last year, 1.5 years, and I think they're doing a nice job. And I do think as we sit through today in 2022, that team is starting to procure work and the right kind of work that's going to help the company achieve the goals that it wants to achieve. So, again, it's going to take time, but I think they're making really good progress in the transformation. So, it's not a matter of can we get to the margins that we're talking about getting to. So, again, it's really about -- you can look at it as a percent on bid day and a percent better in terms of execution as a company outside the ORP and we're there. So, what we provided was a 6% to 8% CAGR and that's our revenue growth rate organically. And I think maybe the way to level set that is if you look at the infrastructure bill and really the highway funding portion, we look at that as around a 6% CAGR. And then, for us to get up to around 8% implies that we're going to get a little bit more market share than we have today. I mean, I think it's -- there's certainly markets that we see -- where we could strengthen our vertically integrated position. There are some markets where we don't have vertical -- we're not vertically integrated today, say, Texas or in Florida, those would be opportunities for us. But right now, I think there -- I don't want to tip our hand too much in terms of where we're looking, but we certainly are looking at our existing footprint. When it gets back to that integration piece for us, we really want to do it in markets where we have really strong teams in place so that the integration is a lot easier for us as we do it. So, I think, it's mostly going to be out in the West Coast today. Just given the sharp increase we're seeing in raw material costs, et cetera. This year, again, we're seeing -- through today, we're seeing a really nice improvement in  in terms of our ability to capture works or hit rates up and the margins of the work that we're picking up has gone up as well. So, what we're seeing come out is showing a very strong market, and I'll point back in materials business, volumes are up, and that's another good indicator. So, first off, I'm going to talk about the quarter a little bit here, but 1Q had stronger than anticipated materials revenue and gross profit. And we did pretty well as a company, I think, in getting out front of a lot of what we see in terms of oil, diesel and natural gas to some level in the company. And I think our teams on the field are doing a really nice job of that, rescheduling projects, their ready mix issues and the like or different shipping issues that they had. I would say late last year, we put in place our new diesel pricing into our equipment rate. So, we do a lot to try and mitigate this risk for us in the business, and I think it's paid off for us. But I think in general, our teams have done a nice job of ensuring that we're covering those costs and we can pass those on. I mean, I think, we feel good about the margin profile on the materials business. I think, it's going to be in line with our guidance. In general, around kind of overall mid-teen margins is kind of the goal for our business. Last year, it came back up and we couldn't really pass that margin expansion on. I think, this year, in general, we're able to pass those costs on. We have another $250 million still an ORP CAP and we expect to burn through another $200 million, which will be $50 million at year-end. I think longer term, we're looking at more of a geographic diversification. I think our first step is to stay focused on what we do well, get even better at it and strengthen the positions that we have today. And so that's our focus, I would say, in the next two, three years. So, we classified at the end of the year and announced earlier this year, the divestiture of the businesses within the WMS Group."
}