{
    "symbol": "LDI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 19:47:07",
    "content": "  Operator: Good afternoon, and welcome to loanDepot's Year-end and Fourth Quarter 2022 Conference Call. Today, we'll discuss Loan Depot's year-end and fourth quarter 2022 results. Before we begin, I would like to remind everyone that this conference call may include forward-looking statements regarding the company's operating and financial performance in future periods. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including, but not limited to, guidance to our pull-through weighted rate lock volume, origination volume, pull-through weighted gain on sale margin and expenses. On today's call, we have Lone Depot President and Chief Executive Officer, Frank Martell; and Chief Financial Officer, Patrick Flanagan, to provide an overview of our quarter as well as our financial and operational results, outlook and to answer your questions. We are also joined by our Chief Investment Officer, Jeff DerGurahian; and LDI Mortgage President, Jeff Walsh, to help address any questions you might have after our prepared remarks. I look forward to sharing my perspectives on market conditions, our results and our outlook. As all of you know, 2022 was a year of dramatic volatility and extreme challenge for the mortgage and broader housing markets. This was compounded by the cumulative impact of significant home price appreciation over the last four to five years, driven by structural supply-demand imbalances as well as the depressive impact of high inflation on available household incomes. To address the short- to medium-term impacts of lower market activity, as well as to position loanDepot to capitalize on longer-term opportunities inherent in shifting home buyer demographics, technology enhancements and process optimization, we announced the launch of our Vision 2025 strategic plan in July of 2022. Regarding our revenues, Vision 2025 focuses on creating long-term shareholder value through a unique purpose-driven and durable mortgage origination footprint focused on first-time homebuyers and servicing diverse communities. In addition to centralizing and simplifying our organization, we also focused on growing revenue-generating opportunities, which fit the strategic imperatives outlined in Vision 2025. During the fourth quarter, our JV team demonstrated the benefits of our investment in this differentiated channel by delivering strong year-end volume. In addition to driving profitable growth, loanDepot also made important and significant investments in its quality, delivery, compliance and risk management capabilities over the course of 2022. In this regard, we recently completed the process of bringing our mortgage loan servicing portfolio onto our in-house platform, which we expect to drive higher levels of customer satisfaction at lower costs. We also announced our investment in a new loan origination platform, which we expect to deliver operational efficiency and state-of-the-art technology and workflow processes. As I mentioned at the start of my remarks, 2022 was a year of dramatic volatility and extreme change for the mortgage market. When we announced Vision 2025, we established the goal of reducing our expenses by an annualized amount of $375 million to $400 million. Lower costs were expected to come from rightsizing our staffing levels, shrinking our real estate footprint, reducing marketing costs, consolidating operations, investing in operating efficiencies and realizing synergies from bringing our servicing portfolio in-house. Today, I can confirm that our team has overachieved against our Vision 2025 expense reduction goal. Pat will go over our results in more detail in a minute, but the non-volume-related expenses are down $130 million since the second quarter of 2022 or over $500 million annualized. With a sizable cash balance, we believe we are well positioned to continue to invest in our people and our platforms as well as to benefit from ongoing industry consolidation. Against the backdrop of one of the most difficult housing markets in a generation, we have very significantly reset our cost structure, which has resulted in a progressive narrowing of our operating losses. With over $860 million in cash on hand, approximately $520 million in run rate cost reductions identified so far, and several new growth vectors in flight, we believe we are positioned to navigate through the current market downturn and emerge as a stronger and more valuable company. With that, I will turn the call over to Pat, who will take us through the company's Q4 and full year financial results in more detail. During the fourth quarter, loan origination volume was $6 billion, a decrease of 35% from the third quarter of 2022. Fourth quarter volumes consisted of just under $5 billion in purchase transactions and $1.5 billion in refinanced loans, primarily cash-out refinances. Our pull-through weighted rate-lock volume of $4 billion for the fourth quarter resulted in total revenue of $170 million, which represented a 38% decrease from the third quarter. The decrease in revenue is primarily a result of lower pull-through weighted rate-lock volume quarter-over-quarter driven by ongoing volatility in the interest rate markets, year-end seasonality and the completion of our decision to exit from the wholesale channel. Our pull-through weighted gain on sale margin for the fourth quarter came in at 221 basis points, also within the guidance we provided. As of last month, we achieved our goal to bring our portfolio of agency and Ginnie Mae loan servicing to our in-house platform. With the transition complete, we will continue to invest in our in-house servicing business, complementing our origination strategy to serve customers through the entire journey mortgage -- entire mortgage journey. The unpaid principal balance of our servicing portfolio increased to $141 billion as of December 31, 2022, compared to $140 billion as of September 30, 2022. Despite the larger portfolio, servicing fee income decreased from $114 million in the third quarter of 2022 to $107 million in the fourth quarter of 2022. If you recall, we had a bulk sale of MSRs early in the third quarter of last year. These characteristics contributed to a low delinquency rate with only 80 basis points of the portfolio more than 90 days past due at year-end and should generate reliable, ongoing revenue during these uncertain economic times. We believe that the mortgage market will total approximately $1.5 trillion in 2023, and we've been shrinking our expense base for this much smaller market. Our total expenses for the fourth quarter of 2022 decreased by $91 million or 21% from the prior quarter, driven primarily by lower personnel expenses including both salaries and volume-based commissions, lower G&A and lower marketing expenses. Thanks to the hard work of our entire team, we exceeded that goal by reducing non-volume-related expenses by an annualized $519 million. The fourth quarter included Vision 2025 related charges totaling $12 million, including $6 million of real estate exit costs, $3 million of personnel-related charges and $2 million of Vision 2025 related professional fees. While we achieved our Vision 2025 expense reduction target, we will continue reducing expenses with some additional headcount reductions, primarily in the form of attrition and additional consolidation of redundant operational functions and reducing real estate costs and other third-party charges. We expect the first quarter expenses will mark the low point for 2023, reflecting the full benefits of our expense reduction and efforts of shrinking Vision 2025 related expenses. Looking forward past the first quarter, we expect increased expenses primarily driven by higher volume-related commissions and other origination expenses, reflecting the traditional seasonal increase in home buying activity. Looking ahead to the first quarter volumes and margins, we expect origination volume of between $3 billion and $5 billion. In light of current market conditions, our balance sheet management strategy will keep in place our various forms of capital, preserve cash until operating losses are reduced and industry-wide gain on sale margins normalize. We entered 2023 financially sound with $921 million of tangible equity, $864 million of unrestricted cash and what we believe are excellent relationships and the support of our financing partners the agencies and our other investors. So yes, just hoping for more detail around the gain on sale margin, the midpoint around 200 basis points for business exiting the wholesale, I guess, it seems like some peers in the retail are higher. Yes, so I think that we think that our gain on sale margin reflects the activity in the market for the loan origination profile of customers that we're originating and expect, as we said, for that to remain pretty steady in the first quarter. The MSR and the searching business are important assets to us, and we don't expect to reduce that portfolio, and we'll look to selectively increase it as the economics of the business allow us to do so. Thanks for taking my question. I think -- first of all, I think that, as I said, the team did a great job, and we reduced our expense structure significantly. So we remain very focused on the market and where the market goes, and we have actions that can address market downsides, but also we are committed to investing. Thanks for taking my question. Thanks for taking my question. Just high level, obviously, demand for mortgages, we know that's done just from your perspective, in the industry. And then just 1 quick follow-up or clarification now that servicing is in-house, just looking at the loan you guys sold $6.8 billion of loans in the quarter and released $2.6 billion of that -- of the servicing type of those loans. We've been expanding the product offering, and we see becoming a more and more meaningful part of our business going forward, not just the volume and revenue in the short term, but also the kind of the long-term customer opportunities that get created from having those consumers in the portfolio. I think -- look, I think there's always opportunity to reduce cost, and we continue every data to get more efficient. I think longer term, though, we're really excited about the new LOS platform that was announced recently. We think that over the medium to longer term, that's going to generate significant cost reduction and efficiency, but also quality and other opportunities for us. So that's just one example of investments we're making, there's many others. So I think we will continue to look at what's important, I think, is the market and how the market evolves and make cost actions and cost plans accordingly. So in the fourth quarter, cash out refi was about 30% of your volumes. Industry-wide, it looks like average FICO scores and cash out refi loans have been declining quite materially over the past year, while on purchased loans have remained relatively flat, so some people are interpreting that to mean the lenders have already finished cashing out the easiest borrower, so to speak and are kind of moving down to like lower credit quality parts of the spectrum. To a degree, I think the HELOC product is meant to serve some of those higher FICO borrowers that maybe have sticker shock when they see some of the current rates. I think going forward, consumers are continually adding to their debt stack, which are at higher rates than even current mortgage rates. So we expect this to continue to see borrowers come to us for that consolidation option, whether it's HELOC or first lien cash out. I mean higher interest rates for longer, we may not get a rebound in the mortgage market until, I don't know, 2025, I mean, you have to be prepared. How much cash do you expect -- I mean, at this market, you have to get a way, you have to get to profitability or zero cash burn, so you're around for the other side. And how -- I mean, you've done -- it's a really tough question and tough market, and you've done a great job reducing expenses. And we'll -- and we do -- are starting to see some seasonal pickup in home purchase activity, and we'll have to watch very closely to see if that materializes through the spring. And so I think we'll continue that focus on the business, and we have that discipline to adjust to market cycles. And as in my remarks earlier, we would say we're going to keep our current balance sheet management strategy and focus on maintaining liquidity. Look, I think as we stated, we will continue to drive toward cash flow neutrality and operating profitability in any market. And as Pat said, I think we planned this year on a $15 trillion, which is a very low market volume. I don't anybody does, but I think we're taking -- as you pointed out, we're taking the right actions. And as I said in my prepared remarks, we're prepared to adjust our planning depending on market conditions. That doesn't materialize, we'll be looking at continued cost management activity -- aggressive cost management activity. It's just a function of the market and managing through the market, and it's certainly the roughest market in the generation for sure. But I think we have liquidity, and we have a very sound and prudent capital management strategy that will see us through this cycle. On behalf of Jeff, and Jeff and Pat, and really the rest of the team loanDepot, I want to thank everybody for your support and your continued interest in the company, and we'll continue to keep you all appraised of our continuing progress, both on a short term and a longer-term shareholder value creation plan that we believe is encapsulated in Vision 2025."
}