{
    "symbol": "BR",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-02 11:53:01",
    "content": " Today, we are reaffirming our guidance for that full period, including 6% to 9% constant currency recurring revenue growth, continued margin expansion and 7% to 11% adjusted EPS growth. Our visibility into position growth and our $430 million backlog gives us confidence in our outlook for this year and our investments which are attracting growing interest from clients, positioned Broadridge to deliver increasing returns and long-term growth well into the future. Moving to capital markets, revenues rose 14% constant currency driven by strong growth from Broadridge trading and connected solutions and from new sales. Fourth, as we look beyond fiscal â\u0080\u009823, the investments we have made and are making in our digital capabilities and our wealth and other technology platforms and extending our capital markets business, leave us better positioned than ever to drive long-term profitable growth with increasing returns through this cycle and beyond. Though a seasonally small quarter, our first quarter results represent a strong start to the year and continued conversion of our sales backlog to revenue, our outlook for continued robust demand trends and the operating leverage, coupled with our disciplined expense management and the challenging macroeconomic environment gives us the confidence to reaffirm our fiscal â\u0080\u009823 guidance. We continue to expect 6% to 9% recurring revenue growth, approximately 50 basis points of adjusted operating income margin expansion, adjusted EPS growth of 7% to 11% and closed sales of between $270 million to $310 million. Our fiscal â\u0080\u009823 recurring revenue growth will be driven by our strong sales backlog, which was $430 million at the end of fiscal â\u0080\u009822 and by our equity and fund position growth, where our latest testing supports mid to high single-digit position growth. Given the divergence between the strong revenue growth of 8% and the 15% decline in operating income, could you dig into your investment spending plans for this year, particularly as they affect both the income statement and the cash flow statement and the pacing of those plans. I guess first of all, I was a little confused, maybe I missed it in the beginning of the call to see the revenue growth rate on the regulatory side at 4% versus position growth, which was I think it was 9% for equity or 11% for mutual fund."
}