{
    "symbol": "EQH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 12:33:04",
    "content": " Non-GAAP operating earnings were $5.08 per share, or $5.55 per share after adjusting for notable items, down 8% in the year, a strong performance despite 2022's turbulent markets, which saw equity markets fall 20% and bond values down 13%. Post LDTI accounting changes, we are increasing our payout guidance to 55% to 65% of operating earnings and expect 2023 cash generation of $1.3 billion. As of the year-end, we have deployed 70% of our $10 billion capital commitment from our insurance business to see growth in AB's private markets platform, with meaningful impact coming through higher yields in our general account and supporting the acquisition of CarVal Investors. We continue to realize the benefits of our proprietary sales force with Equitable Advisors delivering approximately 50% of our $19 billion retirement premiums this year, in addition to $10.4 billion of wealth management sales. Importantly, the strategic focus on AB's private markets and the acquisition of CarVal, brought our private markets platform to $56 billion, up 57% on the year, resulting in a 3% fee rate improvement and a healthy institutional pipeline. In our Wealth Management business, we reported $10.4 billion in investment product sales, of which over 85% were fee-based advisory accounts, our second best year in sales after a record year in 2021. Despite challenging markets, our advisors delivered $4.5 billion in wealth management net inflows, driving a 5% organic growth rate and productivity was up 2% over prior year. As Mark mentioned, our earnings results performed as expected compared to prior year, impacted by market headwinds, which were partially offset by the continued execution of our general account rebalancing, achieving our target of $180 million incremental income a year ahead of plan. In Group Retirement, our operating earnings were $520 million after adjusting for notable items with total premiums up 16% year-over-year. Adjusting for 93 million of notable items in the quarter, non-GAAP operating earnings are 529 million or $1.36 per share, down 17% on a comparable year-over-year per share basis. Throughout the year, we return 1.3 billion with 224 million in the fourth quarter, which includes 150 million of repurchases resulting in a 15% return to shareholders on a free cash flow per share basis in 2022. Your line is open. I think the $1.3 billion assumed markets are flat at year-end 2022 levels, is the sensitivity still about $150 million per 10%? Your line is open. Your line is open. First, as you highlighted, yes, the fourth quarter was a little soft, but we saw a positive improvement in our net flows, as Mark and Robin highlighted for the full year, record volume, record value of new business and over $4 billion in positive flows. So I think our guidance on a post LDTI basis is going to be that 55% to 65% payout ratio as not only on top of the free cash flow generation of $1.3 billion that we have from our subsidiaries, we have the Holdco flexibility as well depending on how earnings proceed during the year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}