{
    "symbol": "SANM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-01 22:34:04",
    "content": "  Operator: Good day, and welcome to the Sanmina Corporation Third Quarter Fiscal 2022 Earnings Conference Call. I would now like to turn the conference over to Paige Melching, Senior Vice President of Investor Communications. Good afternoon, ladies and gentlemen, and welcome to Sanmina's third quarter fiscal 2022 earnings call. Joining me on today's call is Jure Sola, Chairman and Chief Executive Officer. Before we begin with our prepared remarks, let me remind everyone that today's call is being webcasted and recorded and will be available on our website. During this conference call, we may make projections or other forward-looking statements regarding future events or the future financial performance of the company. The company's actual results could differ materially from those projected in these statements, as a result of a number of factors set forth in the company's annual and quarterly reports filed with the Securities and Exchange Commission. The company is under no obligation to and expressly disclaims any such obligation to update or alter any of the forward-looking statements made in this earnings release, the earnings presentation, the conference call or the Investor Relations section of our website, whether as a result of new information future events or otherwise, unless otherwise required by law. Included in our press release and slides issued today, we have provided you with statements of operations for the quarter ended July 2, 2022, on a GAAP basis, as well as certain non-GAAP financial information. In general, our non-GAAP information excludes restructuring costs, acquisition and integration costs, non-stock -- or sorry, non-cash stock-based compensation expense, amortization expense and other unusual or infrequent items. Accordingly, unless otherwise stated in this conference call, when we refer to gross profit, gross margin, operating income, operating margin, taxes, net income and earnings per share, we're referring to our non-GAAP information. First, I would like to take this opportunity to recognize Sanmina leadership team and our employees for managing successfully around material constraints and navigating around COVID challenges in our China operations. So to you Sanmina's team, thank you for delivering strong and consistent results for the third quarter. Now, I'd like to turn this call over to you Kurt. In the third quarter, our team, once again did an outstanding job delivering strong revenue and profit growth as well as cash generation. Non-GAAP gross margin improved to 8.4% compared to 8.1% in the prior quarter, primarily due to higher revenues and a more favorable product mix. Finally, Q3 GAAP fully diluted earnings per share was $1.29. We have delivered consistent financial performance over the last two years, despite the challenges associated with COVID and the supply chain constraints. In addition, non-GAAP operating margins have been 5% or higher for seven of the last eight quarters. Q3 IMS revenue increased to $1.625 billion, an increase of 4.3% over the prior quarter. This is primarily due to strong customer demand and excellent coordination by the supply chain and operations team, in conjunction with our suppliers and customers to help mitigate these material challenges. Non-GAAP gross margin for IMS improved to 7.3% compared to 7% in the prior quarter, primarily due to higher revenue levels and a more favorable product mix. Our strong balance sheet and cash flow generation allows the company to continue to be opportunistic, as it repurchases shares and returns capital to shareholders. During the third quarter, we repurchased approximately 3.1 million shares bringing the total for the fiscal year through the end of Q3 to 7.4 million shares. At the end of Q3, we had approximately $188 million remaining of share repurchase authorization. Despite the higher levels of inventory, we were able to manage working capital such that cash cycle days remained relatively steady at approximately 56 days. Overall, customer demand remains strong, but there continues to be supply chain challenges. We expect non-GAAP other expenses of approximately $8 million to $9 million, non-GAAP tax rate of approximately 17.5%, non-GAAP fully diluted share count of approximately $61 million. When you consider all of this guidance, our outlook for our non-GAAP diluted earnings per share for Q4 is expected to be in the range of $1.27 to $1.37. I would note if we achieve the midpoint of our Q4 outlook for both revenue and non-GAAP EPS, fiscal 2022 revenue will have increased over 14% compared to fiscal 2021 and fiscal 2022 non-GAAP EPS will have increased over 20% compared to FY 2021. In summary, demand remains strong across our customer base. Ladies and gentlemen, let me make a few more comments about business environment in the third quarter. As you heard from Kurt, Sanmina delivered strong and consistent results. Lead times for semi components is still challenging, but we saw some nice improvements in the third quarter. Through operational flexibility and excellent operational execution, we're able to deliver critical requirements for our customers. I can also tell you that our Sanmina team, has done outstanding job, as we continue to differentiate our industry-leading capabilities, by delivering competitive advantage to our customers. Overall, we delivered nice organic growth, quarter-over-quarter growth of approximately 6% and year-over-year growth approximately 22-plus percent. As you can see on this slide, top 10 customers were 47.7% of our revenue. Communication networks and cloud infrastructure, will continue to see strength in this market segment, which was 40% of our revenue. This segment quarter-over-quarter, grew approximately 6% and year-over-year grew 14%. Growth was driven by optical systems, 5G networks and cloud infrastructure. Industrial, Medical, Defense and Automotive was approximately 60% of our revenue. We see strong demand year-over-year growth, up 27.2% is a result of our efforts to diversify, in these segments as we win new programs. Growth was driven by Industrial, Medical, Defense and Automotive. The third quarter bookings, continue to be strong. And overall, we have strong demand and solid backlog. Now, let's talk about revenue outlook by market segments for the fourth quarter. We see a strong demand, across all end market segments. We expect supply constraints to continue, and we expect to manage successfully around material constraints. We're forecasting the 40% plus and minus, our fourth quarter revenue will be from communication networks and cloud infrastructure markets, driven by optical systems, 5G networks, cloud networking and enterprise storage system. All of these segments, we expect to move in the right direction. We're also forecasting that approximately 60%, of revenue for the fourth quarter will be from Industrial, Medical, Defense and Automotive markets. Again, in this segment, we expect to move in the right direction. As you can see, Sanmina does not serve consumer markets. Our focus is on mission-critical, high-complexity, heavy regulated markets. For fourth quarter, again, we see nice strong backlog and we are forecasting approximately $1.95 billion to $2.0 billion for revenue. We also expect revenue growth for the year, to be around 14-plus percent. And for the year, we expect non-GAAP EPS growth of approximately 20-plus percent. So the way I would conclude, this was a pretty good year for Sanmina. I know this is on everybody's mind, but I want to just remind you I'm not an economist, but I do have strong foundation and experience of how to manage through this environment. On Sanmina's management point of view, we are running Sanmina under the assumption the recession is already here. Most important, Sanmina is well positioned for any economic environment. On the positive side, we are excited about Sanmina's future for the fiscal year 2023 and beyond. We have been consistent and continue to focus on the profitable growth which is evident in our results, despite the challenges of macroeconomic backdrop. We focus on things that we control, which is quality of our customer base, building right partnerships by focusing on high-complexity products. We focus on quality of earnings, consistency and the growth of the earnings. For fiscal 2023, we expect to see nice improvement over fiscal year 2022. We're really focused on some key markets that have been successful for us; such as medical, defense and automotive. Industrial and alternative energy, we're in a great position and some great opportunities to continue to expand. In Communication and Cloud Infrastructure, we have a strong position, so we are focused on the leading-edge technologies here. Overall, we are expanding into more profitable projects by providing industry-leading technical engineering solutions from R&D, advanced components, products and integrated manufacturing services. Also, I can tell you that Sanmina still has a lot of leverage in our business model. We're forecasting solid revenue of $1.95 billion to $2.05 billion supported by a strong backlog, and non-GAAP diluted EPS $1.27 to $1.37. I can tell you, Sanmina is in excellent shape and we are well-positioned to manage through this dynamic environment. Now ladies and gentlemen, I would like to thank you all for your time and support. Operator, we're now ready to open the lines for questions and answers. As I said earlier in my prepared statement, Ruplu, we expect definitely 2023 to be a stronger year for us. What I mean by that to grow more than what we did in 2022 and also to -- in absolute dollars, I don't want to give percentages out there. In this environment that's what we got to do, but we've been very aggressive and that's why we are expanding some -- we're not expanding, because of the capacity. We're going to expand in to bring some new technology that are required by our customers, some new opportunities that we already won. So we expect to have a good year, but we'll take one quarter at a time. So as we've said on prior calls, I mean, the main reason why inventory has gone up is that we've been buying parts in the hopes that we would get in some of these constraints semiconductor or other constrained parts. And therefore, when they haven't come in as expected, we still have that inventory on hand. So I think in terms of how I expect inventory to play out, my expectation is that it will still grow a little bit more in the next quarter or two, but the hope would be as the supply constraints start to become more manageable that inventory would level off and then candidly ultimately decline to get back to a more normalized turns. But I would say, we're probably in for another quarter or two of high inventory and perhaps a little bit higher inventory, but that will depend on a bunch of variables that are hard to predict. And maybe for my last one, can I ask you the CPS segment gross margins declined looks like 20 bps looks like on sequentially higher revenues. So I think just the mix -- even though the revenue grew, the mix was slightly different that quarter. And we expect as Jure mentioned, there's a lot of operating leverage in that segment, so we expect those margins to increase over time, especially as some of these supply constraints resolved. If I can add to that, I think, if you look at where we are today, we did a lot of work in the last couple of years. Well, Jim, let me start with that and I'll turn it over to my expert, the CFO here. First of all, we drive -- we think our minimum margin should be 5% to 6% operating. As we said at beginning of the year, we want to get over the 5% which we did and then now keeping it up. Because the parts -- not getting parts on daily basis, our efficiencies are not that good today. So, we got a higher goals than what we delivered this quarter. But it's going to take us a year to get what we want to get, but we move in the right direction. Jim, I'd say, it's a combination of a couple of things. I mean obviously, gross margin improved by roughly 30 basis points. But as Jure pointed out, we've done in the past candidly better gross margins. And I think as we get more efficient as the supply chain gets more stable when we receive materials more evenly throughout the quarter, we think we should be able to improve that over time. And then, on the operating leverage, again, we're trying to keep -- and I think we've been successful -- keeping OpEx around $60 million or $60-and-change million. Obviously, every quarter is up and down, there's different puts and takes, but we expect to see further leverage there. But we think, as Jure has said multiple times, that there's continued leverage in the model. And so as, revenue grows and as some of these inefficiencies caused by the supply chain, lack of linearity I'll say inside of a quarter, we should continue to be able to improve things. So, we're adding really capabilities there. We're going to change the model on this business, so I don't think it's acceptable anymore in this business to be at the 4% operating margin. So, that's our next step. And part of that organic growth is to continue to add to our capabilities and as a result of not only expanding our existing customer relations, but also new programs that we take on. I think, in general, we're very happy with our geographic footprint. So, I think our number one priority has been and will always be organic growth. We continue to pay down our debt, approximately $5 million a quarter. You're very optimistic, it sounds like for a continuation of topline revenue growth in fiscal year 2023 over 2022. I mean as I mentioned in our prepared statement, the demand today we see a strong demand. I mean if we didn't have the shortages, we could have shipped a lot more. So, we -- as that gets resolved I think some of these new programs that we have should continue to drive. So, we're optimistic that 2023 is going to be a solid year for us. What we see today Christian is that we think in absolute dollars, we're going to do more than we did this year. When I say we're running like it's a recession here, you constantly -- nature of this business is you have to tune things up on a daily basis. So, it's all about doing the right thing for your customers, listening to your customers, and executing. And our Components, Products, and Services, I think are moving in the right direction. The backlog in our defense business is, I think is solid for next three, four years. But again, in this environment, you take one day at a time, one week at a time and one quarter at a time. So no matter what happened with recession, this is not going to -- in 2008-2009, we had a lot of debt. Today, we're strictly focusing today on execution and winning the business. So, whatever happens with the economy, I believe Sanmina will perform pretty well against any of our competitors. And then my last question, reverting back to the meaningful growth in inventory, that is your conviction -- investors should probably interpret your conviction in backlog, bookings, new program pipeline as a reason why despite possibly already being in a recession, we have no problem building a bunch of inventory waiting for constrained parts, because we don't really feel like there's little to no risk of any pushouts or cancellations. Let me make sure, we're very clear. So, let's make sure that's very clear. So, the inventory we have is being driven by our customer requirements. And believe me, in some -- a lot of these cases, they wish we shipped them last quarter. So, that's kind of what we are operating in. I mean, we -- I don't -- I think our market for consumer is a fraction of percent, if any. So we -- I think the other businesses, I think will go through. But in the market that we focus on I think, there's a lot of resilience in those type of markets and we are one of the leaders there. So, it's really more raw materials or subassemblies not finished goods. I think the second thing I would say, as you said, well, it shows Sanmina's confidence. I'd say, it shows Sanmina's confidence, but it also shows our customers' confidence, because at the end of the day, the inventory is driven by our customers' forecast. And at the end of the day, those customers are on the hook for that inventory. So, I would say, it's not just our confidence. I'm just curious, it is just like what's holding you back is some specific components that you're dependent on to be able to assembly the inventory you have. Or...\n No, I think this is a lot of these components are customer around semi. As you know, we have a who's who with our customer base. If I have to get probably middle of 2023, but I think for the next couple of quarters I think we continue to see some of these shortages will continue. I mean, we have a few parts that are built around the COVID, maybe some of those parts, but that's a small percentage of our business. And any if you have any questions, please get back to us."
}