{
    "symbol": "REVG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-06-07 13:05:20",
    "content": " Today I will provide an overview of the quarter's consolidated performance and then move to commercial, operating, and financial highlights achieved within the quarter before turning it over to Mark for a detailed segment financials. Strong demand for components and materials combined with lingering labor challenges within our supply base have restricted the availability of key components such as wiring harnesses, radiators, axles, and others. As a result, our businesses that manufacture purpose built chassis such as fire apparatus and municipal transit buses continue to experience throughput challenges and labor inefficiencies related to rework as these components are received. While we experienced improved sequential chassis pool allocations in the first quarter, several OEMs scheduled shutdowns or limited production at their facilities within the second quarter which adversely impacted the build rate against these allocations. Completions in the Fire & Emergency segment were challenged by shortages of chassis and key components mentioned earlier, the recreation supply chain has remained resilient and the segment continued to deliver strong results and execution with record sales against our record backlog. This was largely offset by lower sales, labor inefficiencies, and inflationary pressure within Fire & Emergency and Commercial segments. This combined with lower production driven by previously mentioned components and chassis shortages have resulted in record consolidated backlog of $3.6 billion, an increase of 55% versus the prior year. At our current line rates, backlogs extend into fiscal year 2024 for several of our businesses. Within the quarter, we deployed $21.5 million towards the repurchase of common shares consistent with our balanced use of capital. Exiting the second quarter, our leverage ratio was 2.1 times net debt to trailing 12-month EBITDA, which is near the low end of our target range. Our updated free cash flow guidance of $64 million at the midpoint provides ample opportunity for additional share repurchases, tuck-in acquisitions or debt reduction after accounting for potential dividend payouts in the second half. As you know, the supply chain challenges we referenced in today's earnings release and on this call have now existed for several quarters. Entering the second quarter, we believe that our supply chain would improve in the second half of this fiscal year. Within the quarter, we did not experience improved supply chain and in certain cases the situation has worsened. Within the second quarter, we put boots on the ground and created a physical presence at key suppliers to drive operational intensity needed to fulfill our demand. Last quarter, we discussed pricing strategies that included both forward pricing and repricing a portion of our backlog. Our pricing process includes continuous review of anticipated foreign inflation, aligned with our current production lead times by business and by product type and we will continue to move to price accordingly to preserve price costs. Fire & Emergency second quarter segment sales were 245 million, a decrease of 20% compared to the prior year. The decrease in net sales was primarily the result of fewer shipments of fire apparatus and ambulance units and unfavorable mix of fire apparatus, partially offset by price realization of units in the backlog. F&E unit starts and completions continue to be impacted by critical part shortages and reduced chassis receipts from our OEM suppliers, resulting in 17% fewer unit shipments in the quarter versus prior year. Within the fire division, sales have been negatively impacted by shortages of key components, including radiators, axles, and wiring harnesses. Our second quarter chassis receipts averaged just 10 per week, resulting in lower than expected unit starts, completions, and sales. The decrease was primarily a result of lower volume and inefficiencies related to supply chain disruptions and unfavorable mix of fire apparatus and inflationary pressures, partially offset by pricing realization. The fire business produced zero aero units and availability of parts resulted in a greater mix of commercial versus custom units, resulting in a lower average selling price and profitability. As Rob noted, throughout the second quarter the F&E segment retained labor to address the significant level of rework associated with erratic component supply and the expectation of improved chassis availability within the ambulance business. At the end of the second quarter, we lacked chassis to run a full production schedule and beginning in the third quarter we made the decision to execute furloughs in certain ambulance businesses. During the quarter, our KME production facilities in Pennsylvania and Virginia completed their final KME units as planned, and facility disposition is in process. Within the quarter, we received 2 million of cash for the sale of certain assets and are executing the sale of the remaining properties. Unadjusted second quarter results include 8.2 million of charges related to the wind down of these operations, which include 7.3 million of restructuring and related charges, as well as 900,000 of accelerated depreciation on buildings and equipment as it reached its final use date. However, the full ramp of production for KME backlog continues to be impacted by supply chain constraints. Total F&E backlog was a record at 1.8 billion, an increase of 63% year-over-year. The increase in backlog results strong orders for both fire apparatus and ambulance units, as well as price actions taken in the last 12 months. We expect conversion of these orders to sales to remain challenged, and our expectation for supply chain relief that would allow for accelerated top line growth has been pushed into calendar year 2023. The midpoint of updated guidance anticipates we'll experience lower chassis fill rates than first half run rate, with improved fire apparatus sales offsetting the sales decline in ambulance. The net result is that we expect third quarter F&E segment revenue to be approximately flat with the second quarter run rate, followed by a small increase in the fourth quarter. Given the cost actions we are taking to align labor staffing levels to reduce production rates, we expect to convert second half sales at a 30% to 40% incremental margin compared to the first half. Turning to Slide 7, commercial segment sales were 91 million, a decrease of 8% compared to the prior year period. The decrease was primarily related to lower shipments of municipal transit buses, partially offset by increased shipments of terminal trucks and street sweepers and price realization. Municipal transit bus sales declined 55% versus last year, primarily due to shortages of critical parts such as destination signs, exhaust kits, and wiring harnesses that resulted in zero shipments in the month of April. School bus unit sales were approximately flat versus last year, but revenue was impacted by a mix of lower priced buses sold during a competitive bidding environment in prior year. Commercial segment, adjusted EBITDA of 4.4 million decreased 47% versus prior year. unfavorable mix within school buses, inefficiencies related to supply chain disruptions, as well as inflationary pressures partially offset by increased shipments of terminal trucks and price realization. Commercial segment backlog at the end of the second quarter was a record 531 million, with increased orders experienced across all product categories. The commercial segment outlook anticipates a recovery of municipal transit bus shipments as dual sourcing initiatives take hold, improved profitability in school bus sales, and a continuation of the improved performance within the specialty group. Turning to Slide 8, recreation segment sales of 241 million were up 1% versus last year's quarter. Increased sales were primarily a result of increased Class B unit shipments and price realization across all product categories, partially offset by fewer shipments of Class A, Class C, and towable products. Despite supply chain challenges, our Class B business continues to streamline operations and achieve record unit production. Lower shipments of Class A and Class C units were primarily related to supply chain constraints, which included shortages of awnings, windows, generators, and chassis. Recreation segment adjusted EBITDA was 28.7 million, up 4 million versus the prior year. The increase in adjusted EBITDA was primarily result of increased shipments of high margin Class B units, a favorable mix of Class A and Class C units, and price realizations partially offset by inflationary pressures and inefficiencies related to supply chain disruption and labor constraints. Turning to Slide 9, net debt as of April 30th was 237 million including 5.9 million of cash on hand versus 242 million net debt at the end of fiscal first quarter. The decrease in net debt was a result of free cash flow generation within the quarter of 27 million, partially offset by share repurchases of 21.5 million or 1.7 million shares and an average price of $12.84. At quarter end, the company maintain ample liquidity with approximately 294 million available under the ABL Revolving Credit Facility. Our third party chassis inventory, both on balance sheet and within OEM pool, decreased 22 million sequentially. Adjusted EBITDA expects to be in the range of 100 million to 120 million, a decrease of 30 million at the midpoint. So as you pointed out, it's still uncertain what's going to transpire here from a supply chain. So we still need to see how the chassis supply is going to -- the fill rate is going to play out, as well as some of these key components that work on dual sourcing as we pointed out as well, especially around radiators and axles and wire harnesses. I think we've hit a tipping point here where we flex our costs, we're going to flex our costs aligned and the throughput we can achieve. Plus, we're going to have to go find the folks and right now, with the furloughs, we're extending medical benefits so we're trying to keep those folks in our team here as much as we can while we await chassis delivery. And it was only a couple of facilities within our ambulance division, since they're most hit by the chassis. So it's about 100 people that were furloughed here, and they're 30 day furloughs right now they're executing. We're doing surcharges, we're doing list price increases, we've indexed some to -- on the surcharge side. We're looking at forward casting what we think inflation is going to be relative to lead times, and we're making future pricing decisions around making sure that as we do the math around the forward projection of cost versus the build time that we're going to be in a spot where we can -- mitigate the price cost challenges that the industries are facing right now. And I ask, because if I'm looking at Fire & Emergency, you're talking about demand being robust, but implied orders here are the lowest they've been in almost six quarters and they have been eroding sequentially. Yeah, I think when you look at the -- when you compare it to probably the more recent quarters, both Fire & Emergency have had some pretty robust order rates there in the last year and a half of really coming out of the back end of the 2020 related to COVID. And so when you think about these, for example, on a trailing four quarter basis in 2020 ambulance orders on an industry base, I think we're almost 30% higher than a historical average for the prior many, many years. So there is going to be some normalization, I think, as we move forward on order rates relative to the historical norms versus these kind of the funding that's been available plus the pent up demand, I would expect to see it normalizing. But having said that our order rates while they have on a month to month basis probably gone down, they're still relatively strong relative to our throughput as these backlogs continue to build. I think they're also, if you go back on a longer view, they're pretty strong relative to historical averages in these industries. I think the point you're making Mig around, is price at some point going to be an issue. But, right now we're trying to, we got to make sure that we price at the level that protects costs and that's equally challenging it when you're looking at lead times being extended because of all these material issues. And then if the situation comes where we might have challenges, we're going to aggressively go back out to the backlog to make sure that we protect our businesses as best we can. So the first thing I would say is that when you look at broadly, the expansion we've seen here in the last two years in RV is if you look at the data by end market, it's been largely a towable market expansion and -- C but -- and we're not, we're underweighted exposure on towables. We still continue to see orders coming in there in our C business, despite some of the comments you made or saw around the broader RV market. So I think overall, with respect to canceled orders, we've had, I believe one order cancel, and that's really something that it's not related to where we are in a point in time, it's something that we have seen through this channel partner on an ongoing basis. So we have and we got low inventory in our dealers still, we're kind of in a niche product and the end markets are still pretty healthy for, and we still see order rates in these surpassing our ability to deliver. And I get -- I hear what you mentioned about towables and such, but I guess, how do you think about you and other RV manufacturers in terms of production schedules, right because if -- okay, so inventories are low for certain products, but if towables -- on the towable side, they're not low and as floor plans begin to fill up, then that would tend to affect other product categories. So there's no question that you can just drive down the highway and see towable inventory in dealers has increased, and that's why you're seeing some of compass that you you're seeing. But our specific product in the towable, we have a single exposure in towables, and it's a premium product and inventories in that space are still low. So in the towable space specifically because of our low exposure and because our niche exposure, for a pretty decent period of time, I think we're in a good spot. There is segmentation in the dealer base, but also they get it out on their lot product to serve the customer that's coming in. Someone's not -- generally someone comes in to buy RV, they're going to -- they're coming in to buy a towable versus a motorized, it's a different customer. As well in the niche market that we're talking about, the Bs and Cs, and somewhat in the A, we still have a high percentage of what we're producing our already retail sold. So significant amount of what we're producing still is as Rod mentioned, we're not replenishing the dealer inventory, it's going right to the consumer. Well, I honestly believe, if you look at -- if you bridge it out, look at where we're at now versus where we would want to be or even where we were last year at this time, it's a volume, it's, it's largely a throughput, and an inefficiency walk. And so if we got the throughput back, if we were able to manage these supply chain challenges that we're faced with, and their disruptions are considerable, I believe this business can transition back to where it was last second quarter, pretty as quickly as it went the other direction. That's our belief because I think we've improved our performance, despite the challenging environment we're working in. And I think that when we get the stable supply chain, we'll be able to get back on the path of where we were prior to this challenge. The decrementals are up, that's largely because the headcount we're carrying that we know we based on throughput, we really don't need right now, but we have made a conscious decision for the reasons I mentioned earlier to maintain that head count, for rework and whatnot in our business. There's others that have gotten better, but majority the key components that we rely on, especially chassis as we've highlighted, which is significant for our outfitting business as Rod referred to. So those -- that was sort of John, our way of saying here's the ones that have gotten significantly worse that are key components for us that we called out. But the other issue that we're seeing that's really impactful to the businesses, when we plan a build, when we do our slotting for production, we're building the body and preparing for the delivery of chassis. And right now we're seeing a lot of variation from what we expect to come in versus what's coming in, which means we have built bodies or what not for chassis that don't match up. And that creates tremendous inefficiencies in our business when we don't have line of sight to, what's actually going to arrive as the OEM's battle, all the things that they're battling as well. So it's not just not getting the chassis, we need the right chassis because we're planning and producing for a certain chassis arrival that the mix and the variation on that has been pretty significant, especially in our ambulance business. So it's a -- it's not just going to get a chassis, we got to get the right chassis, or it drives inefficiencies in a different way in the business. So I think in closing, I mean, as you can look at the results, you can look at the commentary that everybody's sharing around supply chain challenges, those are all real but over time, as you would be, I'm confident that we'll work through these things. The underlying thing that I'm really positive about, and I believe is I look at the work the team is doing, I look at the work we're building on capabilities around the lean projects that we're working, the lean certifications developed around materials planning and production planning, and the AIC  certifications that we're launching, the plant work we're doing in terms of closing down facilities and transitioning new facilities, relaying outlines in many of our businesses in both RV and the commercial side, as well as ambulance. There's a lot of groundwork, the work that we've talked about that we needed to do, we've continued to execute that despite the fact that we're facing pretty significant challenges from the supply chain, that's affecting us. We continue to push forward with the belief that the things that we're doing and the things we've talked about since the beginning of our time, looking at this business are still a great opportunity for us and we are just going to be prepared for when the supply chain stabilizes that we're very well positioned to take advantage of that and we will be. I do want to thank our employees as they're doing a great job, not only delivering for our customers, but also doing the extra work that we need them to do associated with the things I just commented on."
}