{
    "symbol": "REVG",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-14 17:33:06",
    "content": " Commercial segment backlog was $526 million at the end of the fourth quarter, which reflects pricing actions taken throughout fiscal â\u0080\u009822 and increased orders of municipal transit buses. Increased sales versus the prior year were primarily results of increased shipments of Class B and Class C units and pricing actions, partially offsetting the increase in lower sales in towable units related to supply chain and labor constraints. The decrease in the commercial segment EBITDA was primarily due to the completion of a large municipal transit bus order earlier this year, which resulted in an unfavorable mix of units in addition to increased costs related to inefficiencies associated with supply chain constraints and rework needed to complete units. Today, we are providing full-year guidance which reflects a range of continued uncertainty surrounding chassis business building, key components supply, and our expectation for increased inflationary pressure that has impacted a portion of units in the backlog, adequate earnings in the first half of fiscal 2023. I would say, like we talked about, we're good in first half, second half, but you know what our guidance would imply that we see the improvement, especially what we've been talking about recently in the last couple of earnings calls, and the multi-sourcing that Rod even highlighted today that some of these problematic key components, we have internal plans in place to multisource, so exiting the second quarter, entering the third we'll see improved throughput, as well as anticipated chassis supply picking up. And then, Commercial being in the $20 million and $30 million range, more of a normalized between $21 million and $22 million range, and then some downward pressure in Recreation related to the mix that we talked about, right, that having more in the towables and as you know, we've extended our reach into the East, so we'll be selling more towables in the East through some of the backlog, so with the mix, we will have a downward pressure on Recreation, but would be more in that $95 million to $100 million sort of range for Recreation -- for those three segments to get to where the full year number is and with some choppiness as we talked about in Q1 and Q2 across those segments. Yes, so it's more around the units like we talked about around throughput and our ability to get these older units out, as I highlighted for Jamie, so it's really a margin discussion and we'll have the revenue, but these are at lower margin units like I highlighted on the commercial, which we've talked about in the last couple earnings calls, as well as on the F&E side as we convert, especially in our Holden facility could be -- convert the older KME, as well as for our units there, those will have no pricing related to the â\u0080\u009821 and â\u0080\u009822 increases that we have put out there."
}