{
    "symbol": "STOR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 15:37:03",
    "content": " Interest expense increased by $4.2 million, primarily reflecting the net additional borrowings we made late last year and in April of this year, to support growth in our real estate portfolio partially offset by a lower overall cost of debt. Property costs were $2.3 million for the second quarter, down from $5.2 million, excluding amounts reimbursed by our tenants property costs for the 12 months ended June 30 represented about 9 basis points of our average portfolio assets, down from 16 basis points from the year ago period. Our strong and healthy portfolio as well as the tailwinds Mary mentioned, delivered AFFO of $164 million, up from $136 million in the year ago quarter. Now, turning to our balance sheet and recent capital markets activity, we funded our second quarter acquisitions with a combination of cash from operations, proceeds from both property sales and the issuance of the bank term loans in April as well as the sale of equity through our ATM program. During the quarter, we issued approximately 3.1 million shares of common stock under our ATM program at an average price of $27.52 per share raising net equity proceeds of $83 million, bringing our year-to-date proceeds to approximately $250 million at an average price of $29.38. As we discussed on our first quarter earnings call, we entered into $600 million of unsecured variable rate bank term loans in April and used interest rate swap agreements to convert the variable rates on this debt to an attractive weighted average fixed rate of 3.68%. Our pipeline of new investment opportunities, the continuing solid performance of our portfolio, and efficiencies in our cost as well as tailwinds from the pandemic recovery we are raising our 2022 AFFO per share guidance to a range of $2.25 and to $2.27, which represents 9.8% to 10.7% growth over our 2021 AFFO per share. You may now go ahead. You may now go ahead. You may now go ahead. We had a really nice issuance of $600 million of term debt from all of our banks participating in that showing great support for STORE, and that gave us a lot of nice dry powder to be a little more tactical as we look to optimize cost of capital in a big picture way. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead."
}