{
    "symbol": "PYPL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 21:43:05",
    "content": " While there is not a standard proxy for ecommerce growth I'd point to Bank of America's credit and debit card volume data, which highlights 2% U.S. ecommerce growth in Q3, a full 200 basis points below our 4% branded checkout growth rate. In the third quarter, we processed nearly $5 billion in volume up 157% year-over-year, with over 25 million consumers using our Buy Now, Pay Later services approximately 150 million times since launch. This year, we will process nearly $1.4 trillion of payment volume an increase from $1.25 trillion last year, and a 25% compound annual growth rate from $288 billion in 2015. In the third quarter on a non-GAAP basis, these expenses grew 4% year-over-year relative to 17% growth last year, driving 180 basis points of operating leverage. Taken together, we believe that our cost savings initiatives and benefits from higher interest rates will enable us to deliver non-GAAP earnings growth of at least 15% next year. Just wondering, on the margins, though, can you talk a little bit about how you're approaching next year, obviously, there's -- as you indicated, Gabrielle, there's a big range of potential scenarios, especially around revenue, but you seem fairly confident in your ability to deliver that 100 basis points of margin expansion, which is a little more than we had modeled. And then on top of that higher total, generated at least 15%, EPS growth, which gets you to about as a first step for us $4.70 next year. Your line is now open. Your line is now open. Consumers are twice as likely to spend online when they see the PayPal button, 80% of the 1500 largest online retail retailers across the U.S. in Europe, except us in our   right now is 600 basis points above the market average like for every 100 transactions, PayPal is going to approve six more than traditional card networks. And I've mentioned this already on our digital wallet stats, but it's up 50% of our base now plus is using our digital wallets that's up over 13% year-over-year, we're seeing much reduced churn on that 25% to 33%, 50% greater ARPU, 60% more checkout transactions, we're seeing a lot of our new products in the wallet gained a lot of traction. Your line is now open. Your line is now open. Your line is now open."
}