{
    "symbol": "OBLG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 11:58:06",
    "content": " Please be aware, some of the comments made during todayâ\u0080\u0099s call may contain forward-looking statements within the meaning of Federal Securities Laws. In addition, today's call includes non-GAAP financial measures, a reconciliation of such measures to GAAP measures is contained in the press release issued today. We encourage you to review the safe harbor statement and risk factors contained in the company's earnings release and filings the SEC including without limitation, our most recent annual report on Form 10-K and other periodic reports that identify specific risk factors that may also cause actual results or events to differ materially from those described in the forward-looking statements. At the end of the second quarter of 2022, we had total cash with $5.1 million, zero debt and working capital of $5.5 million. As I've acknowledged in recent quarters, our growth objectives remain tempered by the lingering effects of the pandemic, and in particular buying behaviors of IT and facilities leaders trying to better understand technology needs for a rapidly evolving workforce. And while we continue to see an array of investments into third generation web products, it's also clear larger macro influences of inflation and a lack of visibility into how and when staff office space opens remain headwinds for near term growth. In the spirit of getting to the points and with a goal to provide our shareholders a clearer picture of our objectives for the rest of 2022, I'll highlight three key areas we believe provide the best opportunity for value creation in the near term. Since our last earnings call, we've explored a number of potential alternatives received a number of inbound calls and will continue to evaluate transactions that provide long term value for our shareholders. In anticipation of looming headwinds across the entire market, the company has taken major steps to extend our liquidity into the second quarter of â\u0080\u009823, as Dave mentioned earlier. In short, ultimately, timing will come back towards this sector and whether it's augmented reality or gestural spatial interaction, or next-gen web 3 products, we believe Oblong remains poised to take advantage of a very, very large and growing market opportunity in the future. As previously stated, a link to the website replay of the call is also provided in the earnings release and available on the company's website, oblong.com."
}