{
    "symbol": "OBLG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 19:40:48",
    "content": "  Operator: Hosting the call today are Oblong's President and CEO, Peter Holst; and CFO, David Clark. Please be aware, some of the comments made during today's call may contain forward-looking statements within the meanings of the federal securities laws. We encourage you to review the safe harbor statement and risk factors contained in the company's earnings release and filings with the SEC, including, without limitation, our most recent annual report on Form 10-K and other periodic reports that identify specific risk factors that may also cause actual results or events to differ materially from those described in the forward-looking statements. Copies of the company's most recent reports on Form 10-K and 10-Q may be obtained on the company's website, oblong.com; or the SEC website, sec.gov. A link to the website replay of the call is also provided in the earnings release and is available on the company's website, oblong.com. While some of the workforce has definitely returned to office environments post Labor Day, a substantial amount of our target market remains very much in a state of hybrid work, continually assessing the use of commercial office space and, in particular, how to best optimize collaboration spaces going forward. While recent volatility in the capital markets has tempered the appetite for M&A since late summer, we do believe current market conditions may actually expand our deal flow over the coming quarters while also allowing us to revisit opportunities otherwise deferred as valuations reset in the months ahead. Our discussions with distribution partners and end users throughout the last few quarters suggest there is a larger redesign effort moving gradually across commercial office space, but a renewed focus on workforce size and optimization in recent months has delayed reconstruction efforts across many of our current and prospective customers. As our current and prospective customers reset their business models, we have continued to take steps to extend our liquidity through the first half of '23 to ensure we can pursue both traditional and inorganic paths to growth when the market conditions improve. Our adjusted EBITDA loss was $1.4 million in the third quarter of 2022, an improvement as compared to an adjusted EBITDA loss of $1.7 million for the same period last year. Also, we reduced our cash used in operations for the first 3 quarters of 2022 by $1.1 million as compared to the same period last year. At the end of the third quarter of 2022, we had total cash of $4.1 million, 0 debt and working capital of $4 million. I want to thank our customers and partners in particular, who have worked with us over the last year during a pretty big period of transition and who are helping us sort of frame the future for collaboration as it relates to Oblong. As previously stated, a link to the website replay of the call is also provided in the earnings release and available on the company's website, oblong.com."
}