{
    "symbol": "TD",
    "quarter": 1,
    "year": 2021,
    "date": "2021-02-25 20:49:07",
    "content": " Revenue increased 2%, reflecting volume growth in the personal and commercial banking businesses, and higher wealth, insurance and wholesale revenue, partially offset by lower margins in the retail businesses. The U.S. Retail Bank's net income was USD 615 million, down 14% and primarily reflecting lower revenue and higher expenses, partially offset by lower PCL. Bank's pre-sales in the quarter were $316 million or 17 basis points, representing a 15-year low, reflecting the ongoing impact of bank deferral and government economic support program and a performing allowance release. Bank's impaired PCL increased $106 million quarter-over-quarter, primarily reflected in the U.S. credit card portfolios and largely recorded in the corporate segment. The allowance for credit losses decreased $437 million to $8.9 billion quarter-over-quarter, reflecting the impact of foreign exchange, resolutions of impaired growth in the wholesale segment and performing allowance releases in the consumer-lending portfolio related to improvement in our macroeconomic forecast and planned credit attributes, partially of the large management overlays to address ongoing elevated uncertainty. I think on the matter of the strategic cards portfolio and the PCL relating to that, if you look on Page 26 of our slide where we have, for the last few quarters, laid out an example that if you had a credit card portfolio for $1 billion that earned a revenue of $150 million and has PCL of $50 million so that the risk-adjusted profit were $100 million. And if the sharing arrangements were such that we retain 20% of the risk-adjusted profit and pay to the retailers 80% of that, then from a GAAP perspective, we would record revenue in the financial statements of $150 million, PCL of $50 million, noninterest expenses for the portion that we paid to our retailer partners of $80 million, so we retain $20 million. From an acquisition standpoint, if you think about the Canadian cards business and you sort of think about half of our customer base as travel and luxury and half of the both as other categories of spend such as everyday spend and cash back, we invested over the last number of years and have a very strong lineup against cash back and that's performing well year-over-year despite the circumstances -- in light of the circumstances."
}