{
    "symbol": "TD",
    "quarter": 4,
    "year": 2021,
    "date": "2021-12-02 20:52:03",
    "content": " Our U.S. retail bank earned U.S.$3.3 billion in fiscal 2021 with improving top-line growth throughout the year, a strong deposit volume, PPP loan forgiveness and a steady recovery in consumer lending and fee income help offset continued margin pressure. Revenue decreased 2%, which includes the impact of the $1.4 billion pre-tax net gain on the sale of the bank's investment in TD Ameritrade in the fourth quarter last year. Absent is adjusted expenses increased 1.8% or 3.7% ex FX reflecting higher employee related expenses, including variable compensation and higher spend supporting business growth because of the large year-over-year change in PCL, the accounting for the U.S. strategic card portfolio continues to have a significant impact on total bank expenses. Adjusted revenue increased 5% or 6.5% ex FX and the insurance fair value change, reflecting strong fee income and volume growth in the retail businesses partially offset by lower wholesale trading related revenue from Q4 2020s elevated levels. Absent this, adjusted expenses increased 2.2% or 3.9% ex FX reflecting higher employee-related expenses including variable compensation, and higher spend on professional and advisory services and marketing as we position ourselves for future growth, partially offset by higher corporate real estate optimization charges in the prior year. Revenue increased 8% reflecting higher volume growth and higher fee-based revenue in the wealth and banking businesses partially offset by lower deposit margins, and a decrease in the fair value of investments supporting claims liabilities, which resulted in a similar decrease in insurance claim. Reported non-interest expenses increased 8% year-over-year, reflecting higher spend supporting business growth, including technology and marketing costs, higher employee-related expenses and variable compensation partially offset by prior year charges related to the Greystone acquisition. Revenue increased 8% year-over-year, reflecting accelerated fee amortization from PPP loan forgiveness, growth in deposit volumes, higher valuation of certain investments, and higher fee income partially offset by lower deposit margins. The U.S. retail net PCL ratio, including only the bank's share of PCL for the U.S. Strategic cards portfolio was an annualized percentage of credit volume was minus point 15% higher by three basis points sequentially. Wholesale net income for the quarter was $420 million, a decrease of 14% compared to a very strong quarter -- fourth quarter last year, reflecting lower revenue and higher non-interest expenses partially offset by lower PCL. Expenses increased 13% year-over-year, primarily reflecting high employee related costs from continued investment in wholesale banks U.S. dollar strategy of higher variable compensation. The year-over-year decrease was primarily attributable to the net gain on the sale of the bank's investment in TD Ameritrade of $1.4 billion or $2.25 billion after tax, partially offset by lower net corporate expenses and a higher contribution from other items. But suffice it to say, as I've said many times before, our capital deployment framework, our priority number one is to support existing strategies, whatever strategies, whatever plans we put in place, and that entails use of, or increase in RWAs on an ongoing basis, because that's we're a growing franchise and we have lots of opportunities and to have the flexibility we do is a great advantage for the bank."
}