{
    "symbol": "TD",
    "quarter": 3,
    "year": 2021,
    "date": "2021-08-26 18:46:10",
    "content": " While credit card balances are still being impacted by high savings rates, card retail sales reached a new high in Q3 as we made creative use of accelerators and leveraged our strategic relationships, including the new subscription offer we introduced this quarter with Instacart, bonuses for TD Aeroplan card holders who link their card to a Starbucks account, and our exclusive relationship with Amazon, which has seen customers make over 1 million redemptions using the Amazon Shop with points capability on their TD card. The U.S. retail bank net income was a record USD $891 million, up USD $631 million, primarily reflecting lower PCL and higher revenue, partially offset by higher expenses. Personal volumes decreased 1%, primarily reflecting lower home equity and credit card balances and business loans declined 8% reflecting pay-downs and lower commercial line usage, partially offset by higher average PPP loan volumes. Expenses were down 5%, primarily reflecting lower variable compensation, partially offset by higher employee related costs from continued investments in Wholesale Banking's U.S. dollar strategy. Well, thanks for the question. I would just say that the call reports are a fine proxy, but a lot of times when we get talked about as a U.S. Bank and our non-interest income percentage of overdrafts is higher than a lot of our peers, obviously some of that goes to the fact that we don't have the wholesale numbers in the U.S. Business and we don't have a large, as large of a wealth business built up yet and you have lower drivers from some of those businesses, but those fee income numbers that you call out are trying to use as a proxy, sure. So then with respect to the $40 million comment, that seems to be only about 10% of what the… \n Well, I said $40 million to $50 million and it depends on volume, right, the interactions that you'd see, but as we model this thing out and a return to normal activity levels, that's what we would see as to be the impact from these changes we made reducing the number of overdrafts you can incur per day and reducing them from five to three and raising the threshold from $5 to $10, but we were using normalized activity in the market. Well, thanks for the question. And as you would have seen by much of their second quarter numbers as well, we would have been on the better side of the group, whether it's the regionals and really especially if you measure in the money centers, had far more substantial declines year-over-year in loan growth because of pay-downs downs, particularly on the commercial side and in some of their card portfolios."
}