{
    "symbol": "M",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-23 12:57:02",
    "content": " Weâ\u0080\u0099re making strategic decisions to fuel the second half of the year, particularly by rebalancing our mix of market and private brands to ensure that we have the products our customers expect to see over the holidays. Partially offsetting the additional markdowns in the second quarter were higher ticket prices and favorable category mix shifts that help drive an owned AUR up approximately 5% for Macyâ\u0080\u0099s, Inc. For Macyâ\u0080\u0099s brand AURs with occasion-based categories saw growth of 12.5% over the prior year, higher prices and lower promotions drove the results within these categories. During the quarter, SG&A also benefited from the growth of Macyâ\u0080\u0099s media network, which generated net revenues of $30 million in the quarter more than 60% higher than the prior year. Although, weâ\u0080\u0099ve seen bad debt trends better than our expectations, weâ\u0080\u0099re taking a measured view on bad debt for the remainder of the year based on potential early signs of rising credit delinquencies and slower payment rates in the second quarter. While we are committed to taking the necessary markdowns, the year-over-year growth rate in inventory at the end of the third quarter is expected to be similar to the second quarter to ensure the appropriate freshness and inventory levels for the holiday season. Now we do expect relative to last year, our ending Q3 inventory to be at similar levels on a rate basis relative to the second quarter, but thatâ\u0080\u0099s really responding to the opportunity to be ready for holiday and have strength going into the back portion of the year. Weâ\u0080\u0099re taking more aggressive markdowns to ensure that when we talk about the kind of sell-throughs that we got since Fatherâ\u0080\u0099s Day and some of these pandemic categories in second and third markdowns that was off about a third from the rates that we were getting previously in the quarter, and then first markdowns were off about 0.5 point. Kimberly, if I could just add a few things and amplify one thing that Jeff mentioned, as a bit of context we are â\u0080\u0093 when you look at our inventory productivity, weâ\u0080\u0099re better than 2019 and relatively flat to last year when â\u0080\u0093 effectively we were relatively lean, not only at Macyâ\u0080\u0099s, but across the industry. And then if you compare it to kind of the trend that weâ\u0080\u0099ve been seeing over the years, our digital penetration, for example, in the second quarter was eight percentage points higher than 2019."
}