{
    "symbol": "ADTN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 11:51:06",
    "content": " However, these statements involve risks and uncertainties, including the continued spread and the extent of the impact of the COVID-19 pandemic, the ability of component supplies to align with customer demand, the successful development and market acceptance of our products, competition in the market for such products, the product and channel mix, component cost, freight and logistics costs, manufacturing efficiencies, our ability to effectively integrate mergers and acquisitions and other risks detailed in our annual report on Form 10-K for the year ending in December 31, 2022, and our quarterly report on Form 10-Q for the quarter ending September 30, 2022. The growth in optical networking solutions, was especially strong in Europe, driving non-US optical networking revenue up 10% quarter-over-quarter on a full quarter basis, and helping push overall non-US revenues up 15% quarter-over-quarter on a full quarter basis. Revenue from access and aggregation solutions was up 7% quarter-over-quarter -- on a full quarter basis, driven by growth and fiber access platforms. ADTRAN's fourth quarter 2022 revenue came in at $358.3 million, up 132% year-over-year, and up 5% quarter-over-quarter within the lower half of our guidance range of $355 to $375 million. Our Services and Support segment contributed 11% of revenues in Q4 2022, compared to 10% in the year ago quarter and in the previous quarter as well. Year-over-year and quarter-over-quarter revenue increases were driven by our optical Networking Solutions category, which comprises 40% of revenues, compared to 35% in the previous quarter. Our non-GAAP operating expenses were $118.6 million, increasing by 123% year-over-year and 9% quarter-over-quarter, which were primarily driven by increased labour costs related to the first full quarter of expenses, partially offset by lower contract services. Non-GAAP operating profitability was $21.5 million, which translates into a non-GAAP operating margin of 6%, compared to 1% in Q4 of 2021 and 6% in the previous quarter. The company's non-GAAPâ\u0080\u0099s tax provision for the fourth quarter of 2022 is currently expected to be an expense of $15.9 million, or 50%. With that in mind, we expect that our first quarter 2023 revenues will be between $355 million and $375 million and we expect a non-GAAP operating margin between 5% and 6.5%."
}