{
    "symbol": "ADTN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 23:19:02",
    "content": " However, these statements involve risks and uncertainties, including the continued spread and extent of the impact of the COVID-19 global pandemic, the ability of component supplies to align with customer demand, the successful development and market acceptance of our products, competition in the market for such products, the product and channel mix, component cost, freight and logistic costs, manufacturing efficiencies, our ability to effectively integrate mergers and acquisitions, and other risks detailed in our annual report on Form 10-K for the year ended December 31, 2021, and our quarterly report on Form 10-Q for the quarter ending March 31, 2022. We also saw well-balanced growth across customers of all sizes with increased revenue from Tier 1, Tier 2 and regional service providers globally on both a quarter-over-quarter and year-over-year basis. ADTRANâ\u0080\u0099s second quarter 2022 revenue came in at a $172 million, up 20% year-over-year, led by a 24% increase in our Network Solutions segment. Your line is open. Your line is open. And I think we have said on the revenue synergies for a while that we would expect that itâ\u0080\u0099s going to take a while to be able to pull together, combined contracts and make our combined portfolio pitches and bring from one company to the other additional market ads, which I believe we said that we would see somewhere between 5% and 10%. Your line is open. So the alignment is really good, the pull from larger customers, thatâ\u0080\u0099s typically on a customer-by-customer basis where they are trying to see the benefits of us in that space is we have a complete portfolio that now competes with the biggest players in the space, and thatâ\u0080\u0099s really what they were looking for, especially in Europe, where they are kind of â\u0080\u0093 itâ\u0080\u0099s much more difficult after youâ\u0080\u0099ve seen them kind of re-rationalize their security positions on certain vendors. Well, if you â\u0080\u0093 I know that you donâ\u0080\u0099t want to open up until itâ\u0080\u0099s material, but if you take a $5 million in terms of number that was given it looks like youâ\u0080\u0099re almost doing $0.20 a share on the $77 million after tax. Your line is open. I think we are really get what we said, Paul, I believe, is that itâ\u0080\u0099s at over 50% â\u0080\u0093 Tier 3 they are over 50% and like 99, I donâ\u0080\u0099t want to be an exact number, but a very, very high percentage, and the 90% go through distribution and none of that has changed. I guess, Mike, if deferred revenue â\u0080\u0093 see I was doing about $5 million to $6 million of quarter, just $5 million to $6 million, numbers right at about $5 million to $6 million each for the last several quarters. Your line is open. Your line is open. Still though, it seems like you are being pretty â\u0080\u0093 unless you are talking about some incremental supply impact, I see OpEx about $10 million higher than I would have thought, standalone combined and prorated for 11 weeks."
}