{
    "symbol": "ICUI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 21:15:03",
    "content": " It's been a quick 90-or-so days since the last call, and our legacy ICU business unit revenues are on track in 2022, and we have now seen weekly improvements over the last 8 to 10 weeks through today in our operational performance for the businesses that came with Smiths Medical. First, comment on the year-over-year drivers of the 3 main legacy ICU businesses, give an update of the current inflation in the market and how it has negatively impacted legacy ICU profits, which is really just about fuel, explain the Smiths Medical revenues we achieved in Q2 and bridge to how that fits with our comments on the last call, provide status update on the Smiths Medical businesses current challenges and opportunities in the 2 buckets we've highlighted on the last 2 calls, begin to talk about Smiths Medical revenues sequentially and describe what we think the next few quarters could look like in the individual segments to try to narrow the range of outcomes for the balance of this year. The good story in Q2, legacy ICU had $324 million in revenue, which was growth of 6% on a constant currency basis and 4% reported. Starting as usual with infusion consumables, which is our largest business, Infusion Consumables had revenues of $144 million, which was a 9% increase year-over-year on a constant currency basis and 6% reported. Finishing the segment discussion with Infusion Solutions, we had $80 million in adjusted revenues or an increase of 3% on a year-over-year basis both constant currency and reported. Starting with revenues, the Smiths Medical businesses contributed $223 million, with vascular access at $77 million infusion systems at $78 million in Vital Care at $68 million. If we add up what we think the Smiths business will do over the second half of 2022 and combine those with legacy ICU, we believe we'll be very close to exiting 2022 at the original $2.4 billion annual revenue run rate after taking some large pressure on currency. To talk about revenue and profitability in the medium term and to simplify the numbers a bit, if we said we could have around $600 million in revenues in Q4 and approaching $100 million of EBITDA, that is basically where we thought we would have been towards the end of Q1 or early 2Q this year. And while we don't technically control fuel costs, though we need to address the tactical item and how it should be incorporated to certain products over time, fuel increases in currency have probably been between $40 million to $50 million above our starting budget this year. Our second quarter 2022 GAAP revenue was $561 million compared to $322 million last year, which is up 74% on a reported basis reflecting the impact of the Smiths Medical acquisition, along with growth in the legacy ICU business. For the legacy ICU business, our adjusted revenue for the quarter was $324 million compared to $311 million last year, which is up 6% on a constant currency basis and 4% reported. After adjusting the first quarter close timing of Smit Medical, total operating expenses in Q2 declined compared to Q1 by approximately $7 million from a combination of cost synergies and lower personnel costs. And finally, adjusted EBITDA for Q2 increased 27% to $85 million compared to $67 million last year. Here, we invested $64 million in additional raw materials and finished goods inventory, most of which was related to the Smiths Medical product lines in order to protect our manufacturing operations from supply disruptions and to better serve customers. Additionally, we spent $24 million on CapEx for general maintenance and capacity expansion at our facilities as well as placement of revenue-generating infusion pumps with customers outside of the U.S. And we continue to expect total CapEx spending in 2022 of approximately $100 million. For modeling purposes, for the back half of the year, the adjusted EPS guidance assumes interest expense of $40 million, a non-GAAP tax rate of approximately 23% and diluted shares outstanding of . On the -- I know it's hard to break out the legacy from Smith, the sort of $45 million to $50 million incremental impact of inflation from the start of the year that you guys called out, that's across the company, I assume not just legacy."
}