{
    "symbol": "LOGI",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-25 12:53:05",
    "content": "  Good morning, and good afternoon. Thank you, everyone, for joining us. Joining us today are Bracken Darrell, our President and CEO; and Nate Olmstead, our CFO. During this call, we will make forward-looking statements, including with respect to future operating results under the Safe Harbor of the Private Securities Litigation Reform Act of 1995. We undertake no obligation to update or revise any of these statements, and we will also discuss non-GAAP financial results. You can find a reconciliation of these non-GAAP and GAAP results and information about our use of non-GAAP measures and factors that could impact our financial results in our press release and in our filings with the SEC, including our most annual â\u0080\u0093 most recent Annual Report and subsequent filings. Unless noted otherwise, comparisons between periods are year-over-year and in constant currency and sales are net sales. With that, I will now turn the call over to Bracken. Thank you, Nate, and thanks to all of you, as usual, for joining us. Last quarter, we discussed the ongoing macroeconomic and geopolitical challenges impacting Logitech and the world. Inflation continues to be an issue, the dollar remains strong, the war continues, and consumer confidence appears to be tepid. Despite this volatility, weâ\u0080\u0099re committed to a straightforward approach as we manage the business. Weâ\u0080\u0099ll continue to invest in product innovation, volume managed in the near-term conservatively. First, letâ\u0080\u0099s talk about innovation. Weâ\u0080\u0099re optimistic about their growth trends, on the markets, the strategy and our business model. All told, we announced more than 20 new products in the quarter, 20. In my time at Logitech, I donâ\u0080\u0099t think weâ\u0080\u0099ve ever launched this many. More important than the sheer number, though, is that I believe this year, they have never been more innovative. Weâ\u0080\u0099ve increased our product development investments over the past three years, and youâ\u0080\u0099re seeing the results of those investments as we further separate ourselves from others in the market. And with everything going on in the world, our teams are doubling down. Many of these new products, by the way, are additive to our existing portfolio. And equally as important, theyâ\u0080\u0099re designed to take advantage of the big durable trends weâ\u0080\u0099ve been highlighting, video everywhere, hybrid work and the explosion of gaming and content creation. And as the environment changes, weâ\u0080\u0099re continuing to learn something new every day, every week about what the future holds. And itâ\u0080\u0099s that evolution that creates the demand for innovation, and thatâ\u0080\u0099s the kind of markets we like to be in, markets where our expertise in design and user insights is rewarded by customers. For example, for B2B customers, we announced Logitech site, addressing the question we hear most from enterprises about videoconferencing. Site is the next step, bridging this gap. Itâ\u0080\u0099s a tabletop camera that will be sold as part of our conference room solutions, and it uses AI to more intelligently track conversations and provide a more natural video perspective to enhance meeting effectiveness. Itâ\u0080\u0099s powered by AI software, an excellent example of our increasingly software-driven solutions. And itâ\u0080\u0099s a perfect example of a product thatâ\u0080\u0099s completely additive to our existing portfolio of conference room products, seamlessly working with Rally Bar scribe, just to name a couple of them. For the personal workspace, we launched a new set of keyboards and mice design, especially for Mac users, which will expand our addressable market and the work from anywhere trend. And now letâ\u0080\u0099s look at gaming, where the team had a really strong quarter of product launches. Similar to the trend in video and hybrid work, weâ\u0080\u0099re seeing more gamers demanding products to let them game from anywhere. We announced G CLOUD, a gaming device designed for cloud gamers that accesses PC and console games from nearly anywhere. And as a site for B2B customers, this product is completely additive to our gaming lineup. Later in the quarter, we released our lineup of PRO Racing wheels and pedals, which I believe are far and away the best in the industry. These are the high-end, high-performing products and the response has been incredibly positive. Gaming launched its Aurora suite of products, a new set of keyboards, mice, microphones and headsets targeting a larger customer set with expanded color and design choices and new features like headsets more easily worn with earrings and a broader range of hair styles. For creators, we have a new studio quality microphone and lighting. Weâ\u0080\u0099re pushing ahead on the metaverse and in partnership with Meta released an immersive audio solution, Logitech Chorus. They offer a high-quality, seamless experience for people to work, play and create, wherever and whenever they want. Theyâ\u0080\u0099re tightly integrated with our existing product portfolio and, in some cases, expand the addressable market. By investing in our product road map, while also focusing on operational efficiency, will ultimately come out of this downturn better positioned and poised for strong growth. But make no mistake, weâ\u0080\u0099re not operating in normal times, and weâ\u0080\u0099re acutely aware of the macro challenges. Last quarter, we discussed a plan under this theme. What you saw this quarter were the first steps in executing that plan, we decreased our expenses focused on operational efficiency. For Q2, OpEx was down 15%. Earlier this year, we merged our commercial organizations into one team. The goal was to serve B2B customers in a coordinated way, leveraging on Logitech to sell a portfolio of Logitechâ\u0080\u0099s relevant products. This quarter, we evolved our business group and engineering structures to directly align with our new commercial structure and customer audiences, B2B customers, end users and gamers plus streamers. Along with operational efficiencies, this will allow us to better compete within the enterprise market and better serve end users at the same time. Our gross margin for the quarter was a strong 38.6% given inflation and currency headwinds, and weâ\u0080\u0099ve not yet started to see the lower shipping rates flow through our P&L. Looking ahead, you should expect us to continue to operate this way. People will game, people will create content and Logitech will be right in the middle of all of it. Before I turn the call over to Nate for a breakdown of our financial performance, Iâ\u0080\u0099d like to say a few things about what you saw in our press release about Nateâ\u0080\u0099s next steps. And over the course of these conversations, we came to an understanding that now would be a reasonable time for him to move on to the next opportunity. And as important, Nate plans to stay on board and tells replacements in place. I am very grateful to you, Nate, for everything youâ\u0080\u0099ve done for Logitech, and I can speak for the Board and say they are too. Thanks, Bracken, and thanks for your kind words. In Q2, net sales were down 7% to $1.15 billion. While sales were down, this was the third consecutive quarter of improved year-over-year growth performance. While gaming showed nice sequential improvement in year-over-year growth, down 4% after being down 13% in Q1. Versus the prior year, product cost and freight rate increases were unfavorable three points and currency was unfavorable two points. Operating profit was $156 million, reflecting lower demand, inflationary cost pressures and unfavorable currency and our continued investment in our product development capabilities. For Q2, Gaming was down 4%, which is a marked improvement from last quarter. Americas and Europe Gaming sales remain pressured, while Asia continues to grow up 25%. As with last quarter, we outperform the market and gained PC gaming share. This growth was offset by a decline in business oriented webcams, which were down more than 30%, although their sales remained more than three times higher than pre pandemic levels. Pressure in webcams following the incredible dynamic, pandemic driven growth, somewhat offsetting solid and strong growth in conference room cameras and peripherals. Keyboards & Combos net sales declined 10% due to low end market softness in China and Europe, partially offset by a strong start from our new high end MX mechanical keyboard. And as with our business webcams, consumer webcams were pressured and down 33% from pandemic highs. In any given quarter, results across our categories may not move up or down in concert. So what we focus on is the performance of the categories that are addressing secular trends in Gaming, Video Collaboration and hybrid work. Sales of our Pointing Devices, Keyboards & Combos, Gaming and VC products were 80% of our total net sales this quarter. Consistent with the first quarter, we reduced our expenses, most notably in sales and marketing, which was down 21%. As Bracken mentioned earlier, we remain committed to investing in product design and development to strengthen our category leadership, and we increased R&D spend by 3%. Last quarter, we committed to reduce our annual operating expenses by $150 million versus last year. In September, our shareholders approved our proposed dividend distribution, which when combined with our continued buyback program returned $276 million to shareholders in the quarter. We are now halfway through the fiscal year, and despite the headwinds, we remain confident in our ability to meet the outlook we announced last quarter. The U.S. dollar continued to strengthen versus last quarter, and currency now projects to be a roughly five-point headwind to U.S. dollar growth. Therefore, our outlook for full year revenue in U.S. dollars would be down 9% to 13%. Our full year non-GAAP operating income outlook remains between $650 million and $750 million, despite the incremental currency pressures. Much like last quarter, our intent is to provide you with a range of reasonable outcomes, given the highly volatile nature of the global economy. At the high end of our outlook, we assume a relatively normal holiday cycle. While at the low end, weâ\u0080\u0099ve assumed a holiday lift generally aligned with the worst in the last decade. And while it continues to be challenging to forecast with a level of precision and certainty in line with pre pandemic business cycles, we believe maintaining our forecast is prudent and reasonable. Nate, itâ\u0080\u0099s time to open the call for your questions. And thank you, Nate. For those who interested in asking a question, please raise your virtual hand. And thank you for always sharing your insights and providing clarity on callbacks, et cetera. As the release came out, the macro conditions remain volatile and I know you guys talked about seasonality in the back half of this year. And then another question on inventory, if I may. I think that declined, if my numbers are correct, that declined sequentially ahead of a holiday season. Yes, Nate, why donâ\u0080\u0099t you take both those. So I am thinking as far as the back half of the year, Asiya, like I said, the outlook really represents kind of two ends or two multiple scenarios. But you can think about it, I guess at the high end, hey, itâ\u0080\u0099s a pretty normal holiday lift that we would see. And then on the low end, weâ\u0080\u0099ve assumed something that really aligns with kind of the worst sequential growth that weâ\u0080\u0099ve seen over the last decade. I think some of the â\u0080\u0093 normally in the holiday, right, youâ\u0080\u0099ll see very strong performance from some of the consumer products. But you saw the performance in Video Collaboration again, this quarter grew 7%. So really thinking about it across the spectrum, and weâ\u0080\u0099ve got a very diversified portfolio. I guess on the second question, yes, it came down sequentially. The logistics disruptions, some of those are starting to alleviate. And so weâ\u0080\u0099ll be working down that inventory, weâ\u0080\u0099ll do it prudently, but it should come down further in fact in Q3. Yes, I mean, Iâ\u0080\u0099ll just add to that. We expected Asiya to bring inventory down in this quarter, even though it was going into our holiday quarter and we did. Next question weâ\u0080\u0099ll go to Paul Chung, JPMorgan. Hi, thanks for taking my questions, and Nate youâ\u0080\u0099ll be missed. And you mentioned some Board structure changes, et cetera. Let me jump in first Nate, and then you can answer. Weâ\u0080\u0099re actually growing our product development investment, as you know. And weâ\u0080\u0099re pulling back in different areas throughout the business, including marketing. Whereas Nate talked about in script, we pulled back pretty significantly. But really on that top of the funnel marketing that we feel like, at the end of the day when the markets are generally softer, top of funnel markets, marketingâ\u0080\u0099s not as effective. Whereas search engine optimization, the things youâ\u0080\u0099d expect us to keep investing in, weâ\u0080\u0099ll certainly keep investing. I mean, obviously, agree with all that. Paul, if you recall, we talked in the past about as we were building, as we were investing more and as the revenue growth was very strong in FY 2021 and even FY 2022, we were conscious of the fact that we wanted to be investing in a variable way if possible, and where it made sense. And so, that has helped us as weâ\u0080\u0099ve had to reduce expenses or weâ\u0080\u0099ve taken action to reduce expenses here in the first half. I think even when you look at our marketing spend though, weâ\u0080\u0099re really aligning it with sales. And if you look back historically, weâ\u0080\u0099re kind of at levels right now that are consistent with the level of investment weâ\u0080\u0099ve had there before. So we havenâ\u0080\u0099t cut back as Bracken said on all marketing, but weâ\u0080\u0099re just being very thoughtful about where it makes sense to invest now. And I think if conditions change and we start to see more revenue growth and gross profit expansion, you may see us increase those investments again. I think, you mentioned 20 or so, and then kind of your commitment to R&D, which is doubled since 19 levels. Yes, let me, first of all, in terms of the cadence, we usually do launch quite a few products in Q2, ahead of Q3. I mean, I think, I donâ\u0080\u0099t know, we try to go back and count, but we announced 20 new products this quarter. I mentioned that in the script and new addressable markets, things like G Cloud, Logi site, and yes, what Iâ\u0080\u0099m excited about, thatâ\u0080\u0099s a good example. I mean, I think this the ability to, I think anybody whoâ\u0080\u0099s been in a video call lately and been one of the remote participants has had somebody stand with their back to the big camera, and they feel really out of it. And the cool thing about it is, you need our existing products to use it. You can buy them now, and then this will just be a complement when it comes out. We already had a very high end, MX Master and MX Keys version. So everybody can afford to really have an alternative to Appleâ\u0080\u0099s experience, which is great. And I could probably keep going, G CLOUDâ\u0080\u0099s going to be really interesting to see how it does. I think, weâ\u0080\u0099re going to just keep an eye on that category. Next question will be from Alex Duval, Goldman Sachs. Firstly, you saw 7% decline organically, constant currency in the quarter. And secondly, related to this, if we look at video conferencing, you referenced the back-to-office dynamic. I think, weâ\u0080\u0099re seeing at the very beginning of really the re-enablement of an office. I mean, weâ\u0080\u0099re an interesting example. So I think, weâ\u0080\u0099re pretty representative, maybe a little bit on the front of the curve of most companies. So I think most companies over the next few years are all going to be adjusting size, structure inside the office, the whole thing. Oh, and the people at home, they really now do need better work, better stuff. And like I said, on many calls, everybody on this call can upgrade their workspace. I guarantee youâ\u0080\u0099ll send me a picture, Iâ\u0080\u0099ll tell you exactly what you should do. So itâ\u0080\u0099s a really I think itâ\u0080\u0099s a very good looking future for us in the whole B2B space, whether itâ\u0080\u0099s B2B in the office or B2B at home. And then on your question around the guidance, Alex. Yes, I think you kind of hit some of it in your question. In the first half of last year, we grew 24% in constant currency. And the second half of last year, we declined 9% in constant currency. So itâ\u0080\u0099s pretty big difference in the year-over-year, compare half-to-half. Next question will be from Adam Angelov, Bank of America. Yes, Iâ\u0080\u0099ll answer the last one first, Nate, and then you can jump into the first one. As you said, you could argue itâ\u0080\u0099s more into the, as you call it, the center of gaming, although needless to say, on the CEO of Logitech. We think there are opportunities not only in gaming, but across the Board. And several of the products we launched this time, as I said earlier, weâ\u0080\u0099re really new addressable market opportunities for us. So yes, Iâ\u0080\u0099m pretty optimistic about that. In terms of the cost, Adam, up in cost of goods sold, I mean thatâ\u0080\u0099s one of the reasons why I wanted to call that out is I want to give you visibility of what some of the drivers are of the margin. And in the case of cost, you kind of got two big buckets, youâ\u0080\u0099ve got logistics and the logistics cost and product cost. Those will begin to flow through as benefits in the second half, but you have to remember, we have to work down inventory before we start to see some of those benefits. Some of it is contracts that we have, although weâ\u0080\u0099re able to buy on the spot rate in some cases as well. And then as we get into next year, probably see more of that favorability start to flow through the P&L. Of course, you always got to keep in mind that we may decide to take pricing actions going in the other direction. But net-net, I would expect some of those cost pressures to start to become tailwinds as we move into the back half of this year and then more so into FY2024. But I will say, and if you listen carefully to Nateâ\u0080\u0099s script, thatâ\u0080\u0099s 5 points of headwind. And as youâ\u0080\u0099re suggesting, Adam, neither one of those is likely to last forever. But long-term, thatâ\u0080\u0099s Iâ\u0080\u0099m really excited about that. And I think the fact that we could deliver 39 points of gross margin with 5 points of headwinds that are pretty temporal, and some time frame is exciting. Obviously, an uncertain involved a time right now from a macro standpoint, but our gross margins remain strong. And so we have to make some assumptions about how long itâ\u0080\u0099s going to take for some of those cost pressures to reverse, but thereâ\u0080\u0099s some strong margin power in this model. Hi, thanks for taking my questions. And the second question would be please, Bracken, you mentioned this, there are a couple of changes in the organization in the B2B go-to-market strategy and also in business group and engineering. We did kind of shorthand, I guess, Nate, Iâ\u0080\u0099ll take the last one. So this set of changes really started at the end of last fiscal year, at the beginning of this one, and we quietly put two sales forces together. So now youâ\u0080\u0099ve got one organization bringing one commercial organization, bringing all of Logitech, whether itâ\u0080\u0099s a personal workspace or a room. The reason we did that was because I think I mentioned this in the last call, as we were aggressively selling in video conferencing equipment, we are increasingly having people say, oh in, before you leave, could you please â\u0080\u0093 can we talk about myosin keyboards. And so we were underdeveloped in the B2B market in our whole personal workspace or as we call it B2B, personal workspace mice, and keyboards and things. So by changing that commercial alignment, we have now one message to the customer, one idea of what is Logitech and one thing we can talk about. The second â\u0080\u0093 this last round of changes, we didnâ\u0080\u0099t change the business group structure to adapt to that. So weâ\u0080\u0099ve got one team, and this should make us much stronger on our overall B2B business. But the more important thing is, I think itâ\u0080\u0099s going to give us the ability to move step by step further, further and further into services and software-enabled services and also to leverage the fact that we have all the hardware thing on one desk all the names of people buying things, all the data thatâ\u0080\u0099s coming in and the ability to get our products to work and do more things together. So I am really, really excited about the set of changes. And Joern, to answer your question about AP region, normally, we talk a lot about China there. China actually didnâ\u0080\u0099t have a strong quarter as it had recently, but that was more than offset by really good performance in Australia and Korea. So just like a lot of places, weâ\u0080\u0099re diversified even within region. And the strength that we saw other than gaming, which we saw really good performance across the region, I would say. But in Korea and Australia, itâ\u0080\u0099s really kind of across the portfolio, the mice, keyboard, video collaboration, all had very, very strong quarters. Well, again, I think countries you got to look at prior year compares. But the portfolio, I think with the new product introductions that we talked about on this call, I think weâ\u0080\u0099re seeing some of the benefits of that. Hi, I just had a question regarding the upcoming selling season. Yes, Iâ\u0080\u0099ll jump in on that Nate. So I feel super about the product lineup we have and the portfolio we have going into the Q3 and Q4 and beyond, so our â\u0080\u0093 the holiday season and beyond that. Just if you could just remind us, I know youâ\u0080\u0099ve taken a lot of share post previous downturns because a lot of companies have kind of exited, et cetera. If you look at what weâ\u0080\u0099ve done inside of our gaming business, weâ\u0080\u0099ve just consistently gained share every year. Honestly, didnâ\u0080\u0099t have too much to do with competition. If you look at our â\u0080\u0093 if you go to Google Search trends and typing Logitech G and just look over the last 10 years, and youâ\u0080\u0099ll see how much â\u0080\u0093 how long thatâ\u0080\u0099s been headed up and to the right. And by the way, thatâ\u0080\u0099s halo of Logitech, too. So I think generally, and itâ\u0080\u0099s really not been about competitors flaming out or something that very few competitors have left our business. Yes, Rob, I just want to echo that. Weâ\u0080\u0099ve been talking for a while about moving from push to pull, right, and making investments in marketing, reducing reliance on promotion. And we accelerated that through the strength of our results during the pandemic and increased our investments, and I mean, I think that what youâ\u0080\u0099re seeing and what you have seen consistently over the last several quarters has been the benefits of those investments and decisions we made. If we do say so ourselves, we pat ourselves on the bank. Nate, you will be sadly missed. In all seriousness, Nate, thanks for all of your help. Because if you look at historically, sequentially, you see pressure in the December quarter owning to the fact that it is a bit of a more promotional period. But then you talked about some of these more temporal headwinds, inflation, logistics. I know that was for Nate, but I have to jump in here. First, while those headwinds are temporal, theyâ\u0080\u0099re not that temporal, hopefully, youâ\u0080\u0099ll see a huge change in Q3. My outlook really doesnâ\u0080\u0099t assume much change in gross margins at current levels, Erik. Category mix is another one intended historically, you were talking historically. Historically, mobile speakers was a much bigger part of our portfolio. And so you did have some mix impacts as you went into the consumer period as well as like you said, a little bit more promotion for Black Friday and those types of big events. I think as our business portfolio has shifted towards little bit more of the business customers, that mix effect will lessen a little bit. But yes, typically, I would still expect margins to come down a little bit in Q3. But thereâ\u0080\u0099s lots of big factors at play here in the back half, as Bracken mentioned, and heâ\u0080\u0099s absolutely right. I do believe that, that will happen, but weâ\u0080\u0099re not predicting that to be super significant here in the second half. And I would add, I do think it will be â\u0080\u0093 if somebody ask a question, I think it will be a little more promotional in Q3 just because we always are. And I think thatâ\u0080\u0099s just the reality of the world weâ\u0080\u0099re in right now, too. And then maybe just as a follow-up, year-to-date, I guess, your cash flow from operations is tracking below operating income. Yes, I think inventory, working capital, in general, will be one of the big drivers. Thatâ\u0080\u0099s â\u0080\u0093 basically, your cash flow is going to be two big components. I think in the back half of the year, youâ\u0080\u0099ll see some efficiency improvement in working capital. So our collections was â\u0080\u0093 we didnâ\u0080\u0099t finish all the collections of all the sales this quarter, so weâ\u0080\u0099ll see some benefit from that in Q3. Aging is great on AR, no problems there, just a little back-end loaded, and so weâ\u0080\u0099ll see higher collections in Q3. Our next question will be from Serge Rotzer, Credit Suisse. First question, I have two or three. So first of all, I would say, with 20 products, probably on average, their margin they are neutral â\u0080\u0093 margin neutral. You could buy a room system and then get it all set up, how it ready to go, get used to it and then bring this in and drop it right into the middle of the table, literally, and it will improve the overall experience. On the other hand, other things like G CLOUD are available now. But generally, everything is available. Probably to take again G CLOUD, is it available only in the U.S. you mentioned? And in big volumes or only available, letâ\u0080\u0099s say like that. Yes, weâ\u0080\u0099re going to keep it pretty limited because limited production to start. We try to do that with brand new categories, and then we can always turn this  if we need to. And Serge, one thing I need to â\u0080\u0093 you asked about margin, but also keep in mind, the ASPs and things like site is relative to the rest of our portfolio, itâ\u0080\u0099s a high ASP product, PRO Racing wheels or high ASP product. So itâ\u0080\u0099s not universal across the board, but youâ\u0080\u0099re seeing, again, itâ\u0080\u0099s not like we just flip the switch on this stuff. Thereâ\u0080\u0099s a lot of software content in there, a lot of value. Probably a year on the guidance, you increased the currency impact from 4% to minus 5%. And you said reported sales will be lower or decreases higher, but you left EBIT unchanged. So basically, itâ\u0080\u0099s a guidance upgrade. I called out two things briefly in my prepared remarks, additional efficiencies that weâ\u0080\u0099re finding across the organization. Keep in mind, weâ\u0080\u0099ve got $3 billion plus of spend up in our cost of goods sold. And then also, we do think weâ\u0080\u0099re starting to see some of those spot rates on logistics come down, especially on the ocean. And so as we get into the back half â\u0080\u0093 really into the back half of the second half of the year into Q4, weâ\u0080\u0099ll probably see some favorability from that, that will help offset the currency pressure. so â\u0080\u0093 and then the last one, restructuring charge minus $11 million; and other income, minus $25 million. The other item was a write-down of an investment that we had on our books from years ago, life size, if you remember, was a company that we used to own that we spun out, and we wrote down the value of that this quarter. Thank you, Serge\n Great. And thanks, Nate, also for all the conversations. One is how much leeway do you have with pricing given that consumers, especially in Europe are already quite squeezed. Iâ\u0080\u0099ll let Nate answer the second, but Iâ\u0080\u0099ll answer the first one. The last round, I would say, was really a response to the continued currency challenges, and we focused it in Europe and Japan, a couple of other places. On the low end, itâ\u0080\u0099s going to be competitive, and weâ\u0080\u0099re not going to give up any share on the low end, so weâ\u0080\u0099ll make sure to stay competitive there. So we may moderate a little bit on the low end if we have to, but weâ\u0080\u0099re holding the line for now. And then the second part of your question, Michael. Ananda Baruah, Ananda from Loop. Well, letâ\u0080\u0099s â\u0080\u0093 weâ\u0080\u0099ll get coffee about 45 minutes after this call ends back in. You should have hit me â\u0080\u0093 yes, you should have hit me before the call we really good at big cooking. Listen, thanks for the question. Nate, weâ\u0080\u0099ll miss you man. Hopefully, we can continue them in a different context. So different context, different setting. I guess, my question is, whatâ\u0080\u0099s the â\u0080\u0093 how would you guys context like the visibility to the guidance maintenance relative to sort of normally, it feels like weâ\u0080\u0099re still kind of like at the front end of macro making like a commercial impact, impact on commercial spend. And certainly, it seems like weâ\u0080\u0099re weâ\u0080\u0099d probably not â\u0080\u0093 weâ\u0080\u0099re probably still in the first half of the game of interest rate increases and things like that. So I guess Iâ\u0080\u0099ll sort of leave the question there, but would love to get how you guys relate to sort of the conviction in the guidance maintenance. If I could jump in first, Nate. And I think Nate â\u0080\u0093 when Nate introduced, he talked about the range of outcomes. So â\u0080\u0093 but within a range, we feel pretty good. And Iâ\u0080\u0099d just come back to diversification, Ananda. In times of uncertainty, diversification is really your friend. And I call â\u0080\u0093 I mentioned those big four categories, 80% of the sales actually grew a little bit, excluding currency in Russia. I think the â\u0080\u0093 yes, so I apology to say that. And as Bracken said, weâ\u0080\u0099ve given a range. Let me look, itâ\u0080\u0099s helpful. I mean you guys â\u0080\u0093 you hit the quarter, and it sounds like itâ\u0080\u0099s tracking to expectations right now. I think all the way back to March, beginning of the year at AID, I think the war had just begun. And obviously, unfortunately, that has persisted. I actually think you did your Analyst Day like 10 days before it started, something like that. Thatâ\u0080\u0099s it for me, guys. Iâ\u0080\u0099ll get you listen, Bracken. Bracken, Iâ\u0080\u0099ll shoot your coffee shops, Iâ\u0080\u0099ll see you here for. Iâ\u0080\u0099m here for â\u0080\u0093 any of you in New York in close, yes, actually Ananda, Iâ\u0080\u0099m here. Bracken and Nate, that looks to be a wrap on questions for this morning. Well, thanks, everyone, and weâ\u0080\u0099ll see you next quarter."
}