{
    "symbol": "CZR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 20:19:04",
    "content": " Welcome to the Caesars Entertainment, Inc. 2022 Fourth Quarter and Full Year Earnings Conference Call. I would now like to hand the conference over to your speaker today, Brian Agnew, Senior Vice President of Corporate Finance Treasury and Investor Relations. This afternoon, we issued a press release announcing our financial results for the period ended December 31, 2022. As usual, joining me on the call today are Tom Reeg, our Chief Executive Officer; Anthony Carano, our President and Chief Operating Officer; Bret Yunker, our CFO; and Eric Hession, our President of Caesars Sports & Online Gaming. Before I turn the call over to Anthony, I would like to remind you that during today's conference call, we may make certain forward-looking statements about the company's performance. For additional information concerning factors that could cause actual results to differ from those discussed in our forward-looking statements, you should refer to the cautionary statements contained in our press releases as well as the risk factors contained in the company's filings with the Securities and Exchange Commission. Also, during today's call, the company may discuss certain non-GAAP financial measures as defined by SEC Regulation G. the GAAP financial measures most directly comparable to each non-GAAP financial measure discussed and the reconciliation of the differences between each non-GAAP financial measure and the comparable GAAP financial measure can be found on the company's website at investor.caesars.com by clicking on the press release regarding today's fourth quarter financial results. We generated fourth quarter EBITDA records in both our Las Vegas and Regional segments during the quarter, and our Digital results continue to show impressive quarterly sequential improvement all year leading to our best performance during Q4. Trends in Las Vegas remained strong during Q4, delivering both 11% revenue and EBITDA growth versus last year. Excluding real rent payments, Las Vegas generated $549 million of adjusted EBITDA with a margin of 48%, up 1,000 basis points versus 2019. Occupancy during Q4 was 95.5%, up to pre-COVID levels for the first time since the pandemic. For the full year, Las Vegas segment generated over 25% growth in both revenues and EBITDA, leading to annual records of approximately $4.3 billion in revenue and $2 billion in adjusted EBITDA. While we clearly had a strong year in Las Vegas, we remain optimistic for '23 and beyond. Group and convention paid for 2023 is up to 2019, driven by strong ADRs, higher room nights and higher banquet revenues. In our Regional segment in Q4, we delivered $443 million of EBITDA, up 3% versus last year despite the impact of negative weather in December. Adjusted EBITDA during the quarter, excluding Lake Charles, grew 21% versus 2019, with margins expanding approximately 700 basis points. For the full year, our Regional segment delivered $5.7 billion in revenues and $2 billion in adjusted EBITDA, delivering 34.8% margins. On a same-store basis versus 2019, excluding Lake Charles, our Regional segment delivered 24% EBITDA growth and margins expanded 700 basis points. As we have stated on prior earnings calls, we expect to benefit from several capital investment projects in 2023. Temporary casinos in both Danville, Virginia and Columbus, Nebraska remain on track to open by midyear. And with that, I will now turn the call over to Eric Hession for some insights on the fourth quarter and full year performance in our Digital segment. If you recall, our objective is to drive a solid return on investment for our shareholders as our business grows and matures over time. Net revenues for sports and online are primarily determined by a combination of volume, hold and offset by the cost of promotions. I'm pleased that in Q4 year-over-year, our volume was up 7%, hold up 100 basis points and promotional expense down 43%. On the sports betting side, we continued to focus our product and technology improvements on the overall experience for our customers. During the quarter, we also started to see the results of our segmented marketing campaigns that allow us to reward customers more directly for their loyalty and play. As referenced earlier, these efforts were direct contributors towards our net revenue growth as they allowed us to improve our promotional spending efficiency. On the Isle Casino side, work is well underway toward creating a significantly improved product experience for our customers that will be rolled out in the second half of 2023. The new product experience will also include enhanced marketing capabilities, such as segmented and life cycle triggered offers, which we currently do not have for iGaming. In the meantime, we continue to add new content, which has been well received. From an expansion standpoint, in Q4, we opened retail locations in Puerto Rico and Kansas and launched online sports betting in Maryland. In addition, on January 1, we launched sports betting online in Ohio and retail. Consistent with our historical track record, we continued to aggressively reduce debt in the fourth quarter by paying down over $200 million from free cash flow, bringing our full year debt reduction to $1.2 billion. Alongside a one-notch rating upgrade from Moody's in January, we refinanced $4.5 billion of debt at highly attractive rates, roughly half of which came in the form of 7% fixed rate notes, further decreasing our exposure to short-term rate hikes from the Fed. 2022 CapEx spend, excluding AC, came in at just under $800 million, which remains our expectation for 2023. As of December 31, we had Federal net operating loss carryforwards of $1.9 billion, which will continue to shield operating income in 2023 and well beyond. We averaged just over $1 billion of annual debt reduction over the past two years, which sets a nice target for us to achieve yet again in 2023. And on the financing piece, I know these calls end up skewing to the equity markets, I want to thank our banks and our credit investors. We've been at this for about nine years now as a public entity and have gone through a series of acquisitions, a series of financings. And every time we ask the debt markets to step up for us, you step up and strengthen numbers well beyond expectations; in this case, allowed us to upsize by $1 billion and start dealing with '25 maturities. In advance of when we expected, know that, that's not taken for granted that we really do appreciate you believing in us each time we come to market. In terms of operating results for the quarter since we already pre-released, I'll make a few comments on last quarter, but I'll focus on what's going -- what's going on in January and February so far. So on a hold-adjusted basis, we are well into the positive in the fourth quarter. First quarter, we launched Ohio. Given the launch cost there, you should expect a modest loss in the first quarter. And when I say that, I'm talking about overall and both verticals, I expect sports betting and iGaming to be EBITDA positive this year for us. When we started this Digital launch about a little over 1.5 years ago, we told you that cumulative EBITDA losses would be something north of $1 billion. So the switch to getting out of brand building, getting out of advertising in terms of big expense of commercial, as you noticed you didn't see us at the Super Bowl, but more importantly, the granular changes in individual marketing have slowed dramatically. January alone, on a consolidated basis EBITDA improved over $450 million for the month. So obviously, there's going to be a significant change in trailing credit statistics that we're excited for. In the brick-and-mortar arena, the business remains exceedingly strong. I peg about $20 million of lost EBITDA in December, primarily in the Midwest, but kind of throughout the Regional business. First quarter, you've got Northern Nevada has been inundated with snow. But despite that, our Regional business grew in the fourth quarter. If you look at how it's been doing since opening, I'd expect that our incremental EBITDA on the spend is going to be in excess of 25% on a gross basis. So on a net basis, our ROI there should be approaching 50%. We're excited that we've got temporary casinos coming in Danville, Nebraska. Vegas, it's hard to express how strong Vegas is right now. Occupancy in January for us was up over 1,700 basis points versus Omicron impacted '22. We're off to on a consolidated basis and in Vegas, in particular, an exceedingly strong start to the first quarter. But recall that in the first quarter, the back half of the quarter tends to be more important than the front half. But as we look at forward bookings in Vegas, they're strong and getting stronger. Forward bookings are strong, group attrition is declining so that we are now seeing group business in excess of 2019 numbers for the first time it looks that way going forward and all of our forward indicators for booking look very strong. So as we sit here today, it feels -- the business feels fantastic. Tom, just wanted to dig a little deeper into your Las Vegas Strip group and convention commentary. So I don't know that I want to get into that level of granularity in terms of quarter-by-quarter, I'd tell you that right now, we are high single-digit percentage points above 2019 levels. Obviously, the back half of the year from a calendar basis, citywide sets up very strong. Yes, Joe, I think that's certainly possible. So I would be -- I'm expecting Super Bowl level activity, if not stronger. But if you lost the Super Bowl in February, you're still going to have a strong weekend. But when you're talking about in November, that's our softest period of the year. So yes, I'd be looking at for us something along those lines, 5% or better in terms of EBITDA lift for the quarter that's driven by that weekend. But yes, we want to be sub-4x levered that's been consistent since we closed the Caesars transaction. And then, Tom, if I can follow up on the more or less kind of 550 target EBITDA from the Digital business. Yes, that's true, Carlo. I prefer not to get super granular I'd say, the mix in that 550-plus number will lean towards sports betting, but is on a per state basis, obviously, iGaming is overrepresented. I mean, I don't -- I'm no economist. There's less working from an office, there's more working remotely. Obviously, that's going to have significant correlation. I don't know if time was a limiting factor as well, that people can now spend time doing things that they enjoy longer than they could before because they're not commuting to a city center, and they're not spending the money to do that. But all I can tell you is what we see in the business is continued strength and where you know we're up against strong comps going back for a few quarters now, and we're still growing. So with all the handing over what will happen, I expect when we do get a turn in the cycle, I'm expecting a normal business cycle recession where you get a substitution effect two regional properties out of destination, but we certainly don't see anything in our destination business today that suggests that, that's on the horizon. Obviously, there's some overlap. The answer is we don't know, suspect that the digital player is more just money if you're looking at money versus time constrained, I suspect the digital player is more -- leans toward money as they achieve constraint and brick-and-mortar is a mix. Tom, I don't think you mentioned in your prepared remarks -- and I know you said besides weather, there's nothing you can really point to in terms of consumer weakness. Your last question, there is -- no. In terms of unrated, you saw -- we saw a material step down in unrated as we anniversaried stimulus, but that's behind us now. And you've seen the results, including the fourth quarter and into the first quarter. Second question, and look, I'm not even sure this is even relevant, but we've gotten this question a couple of times from investors. We're running Nevada on old technology, not Liberty. We expect that relatively soon, and so we expect Nevada to be on Liberty for next football season. So that's certainly not something that we were -- that we enjoyed while it was going on, but it's in the rearview mirror at this point. First, I was hoping we can get a little bit more granular on the potential iCasino ramp in the back half. Maybe any other major catalysts that move the needle in terms of share there because certainly doesn't look like with the EBITDA guidance -- and thank you for that by the way, it doesn't seem like that includes a lot of big cash promotional push. Maybe I'll jump in and take this one, David. So right now, if you want to play on the casino, you have to go download the sports betting app and then find the casino icon, click on it and go through the casino. We'll also be offering a casino app that then you can do the same thing and go back to the sports betting side, but it will be much easier to use from a customer perspective who's looking just for the casino side. So much like if you recall, a year ago, we were unable to do that on the sports betting side. We're now able to do segmentation on the sports betting side, but we're not on the casino side. From a games content perspective, that's something we can address now. And so what you'll see is over the next say two to three months, we'll be making steady releases, adding more games, particularly on the iOS side where we don't have as many as on the Android side. We'll be adding custom table games that are branded as Caesars, but the big changes will be the segmented marketing the ability to do triggered life cycle journeys and then the stand-alone app that you'll see in the second half. And then just kind of -- I think this will bleed into Eric, your comments just now, but Tom, in the past, you've given us data points on land-based contributions from online, I believe, sometime last year around this time, it was $150 million of high-margin revenue. But as states mature, what you see us doing is leaning into our rewards database and bringing those new customers into our database and we're seeing a lot of cross-market play. I get -- anecdotally, I get a report of big winners and losers in both sports and iGaming every day. And a year ago, there was -- the report will show their brick-and-mortar history, and this is particularly true in iCasino. And now you're seeing -- if it's 25 people on the sheet every day, 20 of them have significant brick-and-mortar history. So you can see it continuing to build through the reward system, which is exactly what we were hoping would happen. But overall, your -- in some cases, particularly in -- early in this quarter, you're filling a room that was unfilled last year. As you move through the year, you're basically trading up to a more valuable customer. And while their mix of spend may be a little different, their profitability is significantly higher than what they're replacing. And then for Digital, is there any way you could help us bridge a little bit. We're going from 2023 kind of modestly positive, a big jump into 2024 and then an even more significant jump in 2025. Yes, it's all of the above. You've got a business that's growing organically and has added a bunch of states, some more recently than others. Obviously, we've got a significant ramp expected in iGaming as we get into back half of '23. And then you do have all of that, the original partnerships that were stuck in that should be rolling off starting in '24, '25 on and some of the chunkier ones that flow directly to EBITDA as they run off. So without giving a target, we've got an advantage against some others in terms of we own all of our licenses, we think we've got a customer acquisition cost advantage tying into our database against all, to some degree, but some significant advantage there. We think that sports will be lower margin than iGaming, but that both will be material margin, and we have a long history of performing well on a margin basis, on a relative basis, and we would expect that to be the same in Digital as it's been in the brick and mortar. And then sort of just wanted to pivot on the land-based side, too, maybe just the cost environment a little bit. We're starting to hear a number of operators on the hotel side, talk a little bit more about sort of cumulative inflation over the last three and four years. I know Caesars has a decent amount of union contract as well, which probably provides some visibility. We've begun discussions with the unions and to put it plainly, we're doing well. We expect labor cost inflation through this new union contract in the back half, starting in the back half of '23. And with what we've got going on in the business, we think we'll be able to navigate that just fine. So Brandt, we've seen a significant lift in demand as we measure it in terms of forward bookings in the last few weeks. As I said, March is setting up for one of the strongest months we've had certainly from a rate and occupancy standpoint. As you get toward the back half of the year, you're comping against quarters where we were full, so you're going to see more of a rate lift. It's really the first half of the year that has benefited in filling in occupancy that wasn't there in '22, primarily midweek. And Tom, I'm curious, when you think about that market, and you think about your company's aspirations for growing that -- your business there in the second half. I think it will be a mix of both that will tap into our own network, but that also there will be some market share gain as well. But when you give the customers a better product, we've got a lot of customers that are that lean towards doing business with us if we've got the right product. And we think that we're going to be there shortly, and we'd expect similar experience. Eric, you mentioned hold was up, I believe, 100 basis points in the fourth quarter. And I'm guessing that was a combination of game outcomes, but probably more importantly, game mix with single game parlays and the like. Can you kind of help us think about structurally what's happening with withhold, kind of where your single game parlay and maybe in-play product is against where you want to be and maybe your peers, and if you think this will have a positive outcome for 2023, particularly as we get deeper into the year? It was, I would say, mostly structural changes that we made, there was definitely a favorable outcome on some key sporting events. So if you go on our app now, you'll see we have pre-canned parlays, so they're effectively prebuilt. Right now, they're the same for everybody. But in the future, we'll be able to use some segmented marketing to display different pre-canned parlays, which I think will be really -- customers will be really receptive to that. In addition, we've made a number of changes on our trading team. We fully separated from the William Hill team, and we also have the modeling being done for the most part now in-house. So our analytics team has built a lot of the models that we use for in-play trading, which also helps have more customization for our position with the book, but it also just over time, will help our whole percentages. We see the same documents that you see that suggests they're looking to award something by the end of the year, but there's a potential cut through the location boards of the various properties that's upcoming in the next quarter or so. Obviously, is already tourist-focused but I can assure you, we are not going to be the one that wins because we built the biggest housing development outside of our casino. If it becomes an arm's race of who is going to spend the most money, we won't win. Obviously, the last couple of years have been pretty noisy. Obviously, I think 2Q has some benefit from 1Q trips being deferred, but curious if you can give some insight for this year. I would say you should expect a more normal year of seasonality in Vegas this year where early in the year, your soft ramp up in the kind of right about now in the first quarter, and that goes until it gets really hot here. Fourth quarter, you've got November is typically your slowest month of the year, but that's when F1 will hit this year. And then 4Q in Las Vegas, I think maybe Anthony's prepared remarks, you mentioned 16% or 17%, I forget, which group room nights is relatively high for you guys. I'd expect with full-on group business with FORUM operating, I think you should expect us to continue to creep higher into the high teens in terms of percentage of overall room next year. We are not active in that market, so I can't speak with first-hand knowledge. At this point, they have been getting better, but in an environment where the Fed is still raising, it's still a dicey environment where you got to pick your spots. Yes, we're presuming that -- we're presuming that those proceeds would -- they add lease adjusted debt, they'd be used to pay off conventional debt so that that would be -- that wouldn't change the net result materially. As a clarification, I believe I heard Bret mention the $1.2 billion in debt reduction this year could be repeated next year."
}