{
    "symbol": "CZR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 20:15:04",
    "content": " So we cut about a little over a quarter of a billion dollars of expected spend from when we started cutting in February, through the end of this year, we've seen no degradation in handle share, other than our planned retrenchment in New York back through as we talked about, we were more aggressive than we needed to be out of the box in New York and got 37%, 40% 40 plus percent share as you see us kind of in that 15% to 20% share. And if you think about numbers that we've talked to in the past, the cross market play out of sourced in digital into brick-and-mortar we said was run rating, about 150 million of gaming revenue at the time of our last call that has since increased to over $200 million -- what are we focused on in the offseason we're focused on the shoulder season, I should say there's never an offseason. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And that's going to have two significant change, two significant impacts, you're going to build loyalty among that that group that is targeted, and you're going to increase profitability as you increase share of wallet, you're still going to have activity from those that are not targeted to the same degree, but your profitability on those customers is going to change dramatically, because they're not getting the marketing officers or the marketing officers that come out. Great, thank you so much. Your line is now open. Your line is now open. Your line is now open. Well the $200 million is an annual number, so you're talking about $50 million of quarterly spend, that gets up that gets to that number, that's a pure additions through the digital channel, if you want to take it to the level of customers would sign up and there would be some, if digital didn't exist, there would be in addition, through Caesars Rewards, that's a derivative level, that's not useful to get into on the call. Your line is now open. Your line is now open. Your line is now open. And that's what you're seeing now in our regional destination properties in Vegas, in particular, and I think you've got some pent up demand for group travel that we're really just getting into. Your line is now open. Great, thank you so much. Your line is now open."
}