{
    "symbol": "CMPO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 21:50:01",
    "content": " Our adjusted EBITDA was also a record at $33 million for the quarter, up 14% year-over-year, which highlights the impressive margin profile of the premium card business and our relentless commitment to continuous improvement, which had a positive impact on efficiency, positioned us well to support greater output and help provide incremental lift to margins for the quarter. International sales for the first quarter of 2022 were $22 million, 178% higher than prior year and 96% growth quarter-over-quarter, driven by strong sales execution, distributor growth and demand for premium payment cards. As mentioned, we're excited that our payment card plus Arculus digital authentication and/or crypto cold storage has been selected by several cryptocurrency platforms and fintech partners, and we expect additional announcements in the coming quarter. Based on feedback from conference attendees, we believe we were one of the standouts of the conference with a potent marketing presence, including delivering 25,000 Bitcoin Conference, co-branded Arculus Key Cards, a main stage speaking engagement by Adam Lowe, our Chief Product and Innovation Officer, and nearly 20 media interviews with both social media influencers and leading business publications. We also included some of the trends that we're seeing in the industry, American Express is one issuer that releases data in their earnings release, and we shared some of that where it was record number of customers acquired, strength in areas like platinum and gold, the premium fee-based products, which many, many, many of those cards are metal. But each of those partners was willing to step up and say, hey, yes, we selected Arculus and the CompoSecure team to partner with because we believe in the additional security features that the cards enable, whether that's payments plus digital authentication, payments plus cold storage or in some cases, trying to bring together all 3 of those."
}