{
    "symbol": "CMPO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 14:41:09",
    "content": " For the third quarter, we achieved net sales of $103 million, which was up 56% versus last year as we continue to see strong demand for premium metal card products both domestically and internationally, and we capitalized on this through strong sales execution, deep customer relationships and partner channels. We also reported net income of $22 million, up 17% year-over-year, and adjusted EBITDA was higher than expected at $33 million for the quarter, up 33% year-over-year, due to a combination of our ability to drive significant economies of scale, our focus on operational excellence and efficiency and managing investments based on the Arculus ramp up expectations and timing. To be more specific, going into 2022, we shared that our projected full year net impact from Arculus was forecasted to be around $33 million negative, which encompassed total anticipated net sales minus expected operating and marketing expenses. Based on our strategic business decisions and spending discipline driven by uncertainty in the market, we now anticipate the net impact for the full year to be more in the range of $20 million to $22 million negative, which has a positive impact on our adjusted EBITDA for the year. Coming back to our overall outlook for the year and based on the outperformance in the metal payment card business, we are updating the 2022 net sales range to the high end of our previously announced guidance and now expect net sales for the year between $370 million and $380 million. We are also raising our 2022 adjusted EBITDA guidance and now expect it to be in the range of $130 million to $137 million given our continued margin expansion, profitability and spending discipline. They also stated that investments to drive customer engagement, acquisitions and retention continue to generate results with card member spending at near record levels in the quarter and highlighted the fact that the strength of the rebound in travel spending has exceeded expectations throughout the year and total T&E spending was up 57% in the third quarter from a year earlier. Net sales are up 48% to $285 million driven by momentum in our premium metal card business across banking, gaming, fintech, entertainment and exchanges in the U.S. and internationally."
}