{
    "symbol": "CMPO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 13:15:08",
    "content": " For the second quarter, we achieved net sales of $97 million, which is 55% higher year-over-year, and up 15% sequentially driven by strong sales execution and growth across new and existing accounts. Our adjusted EBITDA was $40 million for the second quarter, up 45% year-over-year, demonstrating the impressive margin profile of our premium metal card business and our constant focus on operational excellence and process improvement. For the second half, we've got a number of meaningful updates coming, including our ability to significantly expand the number of digital currencies that we support, introducing white labeled payment cards with integrated cold storage functionality, which I mentioned, continuing to enhance our SDK for B2B integrations, offering a joint wallet option for direct-to-consumer, expanding our direct-to-consumer distribution channels, and finally simplifying secession planning for crypto through our joint wallet solution. Second quarter 2022 net sales grew 55% to $97 million, up from $63 million in the same quarter of the prior year. We reported net income for the second quarter of 2022 of $61 million, this includes a $35 million favorable impact for fair value adjustments associated with the mark-to-market of the warrants and the earnout. If you adjust out the $35 million of our operating net income would be $26 million, which is up 18% compared to our operating net income of $22 million in the second quarter of 2021. Looking at our strong performance for the first half of the year, net sales grew 43% to $181 million in the first half of 2022, up from $127 million in the first half of 2021. If you adjust out the $37 million at about operating net income, it would have been $51 million, or up 13% compared to an operating net income of $45 million in the first half of 2021. So far for the first half of 2022, we've produced adjusted EBITDA of $73 million, which was an increase of 29% from the first half of 2021. Looking at the split between domestic and international, you can see that we continue to have strong domestic sales, increasing 50% compared to the second quarter of 2021 to $70 million, again, due to the strength of our sales execution and favorable industry trends. International net sales for the second quarter of 2022 was $27 million, 71% higher than the prior year due to the expansion of our international sales team continued distributed growth and demand for premium payment cards in the international markets."
}