{
    "symbol": "CMPO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 20:52:09",
    "content": " For the upcoming year, we're providing net sales guidance of $400 million to $425 million, which is approximately a 12% increase from 2022 at the top end. On Slide 6, you can see that American Express continued to report strong card acquisitions of 3 million new customers for the quarter and $12.5 million new card acquisitions for the year. As John mentioned, for the full year 2022, net sales increased 41% to $378.5 million compared to $268 million, the increase was driven by continued strong sales execution and growth of our metal card business domestically and abroad for both new and existing customers. As Jon mentioned earlier, the net impact from Arculus revenue and investments was minus $21 million for all of 2022, and in line with our latest guidance issued last year and significantly lower than the $33 million in our original projections. Adjusted EBITDA for the quarter was $31 million, up 44% compared to $21 million last year and adjusted EBITDA margin in Q4 improved to 33% compared to 28% in the fourth quarter of 2021. As I mentioned earlier, weâ\u0080\u0099re expecting another year of solid growth in 2023 as we anticipate net sales to range between $400 million and $425 million and expect adjusted EBITDA to finish between $145 million and $155 million. Driving organic growth in the business and by that I mean the metal payment card business continuing to expand capacity, drive innovation around not just the form factor but new security technology, things like dynamic CVV, biometrics, the authentication and the integration of Arculus into credit and debit cards as kind of our first priority, and second paying down debt. I'm even more excited for what's ahead of us in terms of continued growth of our metal payment card business, domestically, internationally, and with fintech clients as well as continuing to push on the Arculus expansion, on security authentication as well as cold storage for digital assets."
}