{
    "symbol": "POWI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 21:32:05",
    "content": " At this time, I would like to welcome everyone to the Power Integrations Third Quarter Earnings Call. With me on the call today are Balu Balakrishnan, President and CEO of Power Integrations; and Sandeep Nayyar, our Chief Financial Officer. Non-GAAP measures for the September quarter exclude stock-based compensation expenses, amortization of acquisition related and tangible assets, and the tax effects of these items. Our discussion today, including the Q&A session, will include forward-looking statements denoted by words like will, would, believe, should, expect, outlook, plan, forecast, anticipate, prospects and similar expressions that look toward future events or performance. Such risks and uncertainties are discussed in todayâ\u0080\u0099s press release and in our Form 10-K filed with the SEC on February 7, 2022. Finally, this call is the property of Power Integrations, and any recording or rebroadcast is expressly prohibited without the written consent of Power Integrations. Last quarter, we noted that distribution sell-through had in fact slowed across all of our end market categories, likely signaling a broad-based downturn in demand. End demand appears to have declined significantly, and distribution sell-through has continued to slow, particularly in our consumer category, which is about a third of our business and is dominated by appliances. Our revenues for the third quarter were within our guidance range, but below the midpoint, down 13% from the prior quarter, and we expect December quarter revenues to be down more than 20% sequentially at the midpoint of our range. For those less familiar with our history, itâ\u0080\u0099s not uncommon for us to experience large cyclical fluctuations than our peers because we sell primarily to power supply manufacturers and therefore have an additional layer of inventory between us and the end markets. And just as we are typically among the first to see a downturn, we have historically been among the first to see the eventual upturn, and while itâ\u0080\u0099s difficult to predict the timing of a recovery, we do see indications that our business is likely to hit bottom over the December and March quarters. Our communications category, which was the first category to experience the downturn distribution sell-through, and our direct business were sequentially higher in Q3 and channel inventory fell significantly during the quarter. Across the entire business cancellations were lower in Q3 than in Q2, and we have seen a modest uptick in turns orders in recent weeks with many customers already having eliminated much of their excess backlog. And the product demand outlook improves, we expect recent market share gains and contributions from new products to enable the kind of outperformance we have historically delivered coming out of a downturn. In the meantime, we will focus on what we control, managing the business for long-term growth and profitability rather than short-term operating metrics though we do expect to be within our target range of operating margin in 2023. We talked in depth about these opportunities at our recent Analyst Day, and I encourage anyone following our story to view the replay of the event on our investor website. Our presentation covered a wide range of topics, including our unique system level approach to integration, our history of innovation in high voltage process and device technologies, including GaN and the contribution our products are making to a cleaner planet. Driven by a combination of investments in new products and technologies and big picture market trends, creating opportunities in areas like renewable energy, home automation, appliances, advanced charging and transportation. As we mentioned last quarter, new regulations in India are driving a wave of design activity in ceiling fans by essentially forcing the adoption of efficient brushless DC motors. During Q3, BridgeSwitch was also designed in at a top tier European appliance maker for a next generation refrigerator, a design that will contribute meaningful revenues in 2023. The designs we are winning today will not only generate near-term revenue growth, but also pave the way for the higher power BridgeSwitch products in our pipeline. Unlike the switch solutions, BridgeSwitch and our Motor-Expert software provide a platform solution that can easily be adapted to a wider range of end products by customers once theyâ\u0080\u0099re familiar with the architecture. We expect an equally large increase in SAM to come from automotive, where the EV transition brings substantial high voltage semiconductor content to passenger cars and commercial vehicles. As we explained at the Analyst Day, we have a content opportunity of more than $60 today in a passenger car, which we expect to increase by more than 2x as we expand our product offerings in the coming years. Heavy vehicles like buses, trucks, and construction equipment will have even greater dollar content. While the major revenue ramp is still fewer years away, we are making excellent progress, establishing ourselves as a key supplier to the EV market, adding almost 200 designs to our opportunity pipeline so far this year. A majority of these projects involve our silicon carbide based InnoSwitch ICs, which are ideal for next generation 800-volt systems. Our success in converting opportunities into wins has been highly encouraging and speaks to the degree of differentiation we provides with InnoSwitch Switch in terms of ease of use, reliability, space savings, and efficiency. Overall, we have now secured designs in at seven of the top 10 tier one automotive suppliers, and we expect to be in production with about 15 end customers this year, a number that should at least triple in 2023. These include not only a wide range of power supply applications at automakers in the U.S., Europe and Asia, but also several designs using our SCALE-iDriver gate drivers in drive train inverters mainly at Chinese EV customers. Another key topic of our Analyst Day was a detailed discussion of our GaN technology, a cornerstone of our product roadmap, and also a near-term driver of share gains and higher dollar content. We presented not only the rapid growth in GaN-based products revenues over the past couple of years, but also the $100 million opportunity pipeline we are working to convert to design win and revenues. In fact, half of our GaN design wins in Q3 came from industrial and appliances. Going forward, GaN power switches will feature prominently in the automotive and motor drive products that will drive much of our SAM expansion. We also have GaN-based products in our pipeline that will open up new markets for us, such as data center and comm equipment, another major piece of our SAM expansion roadmap. Our high-power business struggled to grow over the past couple of years as projects was slowed by the pandemic, but we have seen a healthy rebound in this business in the past several months, and it is now on track to grow double digits this year. We expect strong growth in high power again next year, driven by design wins in solar, wind and electric locomotives. In summary, our long-term growth story is on track and we are looking past the current downturn to the exciting future that we laid out for you at our event in September. As a reflection of our confidence in that story as well as of strong balance sheet and ongoing cash generation, our Board has allocated $100 million for share repurchases, which we expect to begin implementing in the days ahead. And we believe market share gains, new products and secular growth opportunities will enable us to emerge stronger on the other end. As we manage through the downturn, we will be guided by the long-term mentality that is integral to our culture and which was a key theme of our Analyst Day presentation. Accordingly, we are adjusting our spending plans, but will continue to invest in new products and greater sales reach. We are moderating production, especially the conversion of wafers to finished goods, but we will keep our foundries active to ensure access to capacity when demand recovers. This approach paid off when demand came back after the initial pandemic shutdowns, and we are following the same playbook now. Revenues for the quarter were $160 million within our guidance range, but below the midpoint as demand tapered down over the course of the quarter. Consumer revenues fail more than 25% sequentially, driven partly by seasonality in air conditioning, but more so by software demand and elevated inventories in major and small appliances. China continues to be the prime resource of weakness in the appliance market, but the slowdown is not isolated to China. Computer revenues were up slightly from the prior quarter, driven by strength in tablet charges, as well as recent design wins in notebooks with our GaN-based InnoSwitch products. Industrial revenues also increased slightly from the prior quarter, driven by strength in our gate driver business across a range of applications including solar, wind, energy exploration and rail. Revenue mix for the third quarter was 41% industrial, 32% consumer, 16% communication, and 11% computer. Non-GAAP operating expenses for the quarter were $40.8 million below our forecast and down sequentially by more than $1 million, driven by slower than expected hiring in the timing of spending, which pushed some expenses out to the December quarter. Non-GAAP operating margin for the quarter was 32.4% and non-GAAP earnings were $0.84 per diluted share Weighted average diluted share account for the quarter was $57.6 million down $700,000 from the prior quarter. No shares were repurchased during the September quarter, but as Balu noted, our board has allocated a $100 million were additional buybacks, which I expect to put to work in the days ahead. Cash flow from operations for the quarter was just under $50 million, and they used $5.5 million during the quarter for CapEx and paid out $10.3 million in dividends. As I noted earlier, the long lives and flexibility of our products afford us the ability to build wafers â\u0080\u0093wafer inventory during a downturn ensuring continued access to capacity at our foundry partners. Sell-in exceeded sell-through for the full quarter, though we saw a crossover in September with sell-through exceeding sell-in for the month. Based on our preliminary checks, this also appears to be the case for October and we expect it to continue through the remainder of the quarter, resulting in a meaningful reduction in channel inventories as we exit the air. Importantly, distribution inventory for communications category decreased significantly during the quarter and sell-through was up sequentially, indicating that the worst of the inventory correction in smartphones may be behind us. We expect revenues for the December quarter to be $125 million plus or minus $5 million, and again, we expect sell-through to be higher than reported revenues. Non-GAAP operating expenses for the fourth quarter should be between $42 million and a $42.5 million, and the non-GAAP effective tax rate should be between 9% and 10%. And now operator, letâ\u0080\u0099s begin the Q&A session\n  And your first question is from the line of Tore Svanberg with Stifel. But in case of Korea, they still seem to have inventory, and so they are yet to deplete their internal inventory. We see the overall communications inventory at the channel has decreased significantly, but we still have some ways to go. We are thinking that by perhaps the second half of Q1, we will start getting higher shipments to this market. Maybe questions for Sandeep, with the weak yen, still kind of, you guys are a beneficiary of a weak yen with your manufacturing in Japan. So the way we have always done it, and it, if you just take a step back just pre-pandemic, we continue to build because we wanted to keep up, of our foundry partners economically profitable as well as what we know that we always come out of this downturn and when it comes, we do really well, and that really helped us with the having that inventory this time is going to be no different. As we, I have talked earlier, these downturns take three quarters to four quarters and typically, this could be a quarter more, but as a result of which Iâ\u0080\u0099m expecting that, we may have a reversal of this year where next year could be like the back half of this year, while as the back half will be a much stronger back half. So from a margin standpoint, I think Iâ\u0080\u0099ve, given you the guidance for Q4 for next year, I think we should be still in the 55% to 56%, mainly because the communication sector will come back and the mix is going to be a little less favorable next year compared to this year on an annual basis. As â\u0080\u0093 the impact of FX, the recent weakening, weâ\u0080\u0099ll have to go through our inventory before we get the P&L benefit that wonâ\u0080\u0099t happen until the second half of next year, but you also have to remember that our input costs have gone up that will also flow into that at a very high level. I think that the level of integration, level of innovation we bring makes it very difficult for western competitors to compete with us and make good margins. In some cases, theyâ\u0080\u0099re completely decided to close down, like Panasonic has closed down, but many others are retreating from this market. Basically, theyâ\u0080\u0099re shipping what they have, but theyâ\u0080\u0099re not building new products. They look at our product and they, itâ\u0080\u0099s very difficult for them to think about how to compete with us without infringing on our IP. So, I think we are in such a strong position in terms of being years ahead of our competition, and we will continue to innovate. Hey, good afternoon and thanks for taking my question. I guess, Sandeep on the first, if I kind of think about the industrial revenue, which, if Iâ\u0080\u0099m not mistaken, is one of the higher margin segments, it was up considerably in terms of percentage of business overall, and it seems like thatâ\u0080\u0099s still hanging in there, in being and fairly healthy. Yes, industrial is the highest, but consumer follows behind that closely, and as you saw, the industrial kind of did well, but the consumer was quite weak during the quarter, so that kind of offset added to that, you heard we obviously with the volumes being lower, that had an impact on the margin. And also, the pricing environment is not as favorable as it used to be. And that has started to also, because we do value pricing has started to also have a bit of an impact and will be have some impact next in the coming year also. The high power part of industrial, which is roughly letâ\u0080\u0099s say 25% or so is doing very well. As you, as we mentioned in the script the last two years a lot of projects, infrastructure projects have been delayed, but it has come back nicely this year. We expect double-digit growth this year, and it looks like next year also would be double-digit growth. These are things like renewables, solar and wind, high-voltage DC transmission systems, traction that is electric locomotives and so on. The home and building automation so far has done well, but thereâ\u0080\u0099s a possibility that could soften. Iâ\u0080\u0099ve heard it from other companies, we havenâ\u0080\u0099t seen it yet, but thatâ\u0080\u0099s an area that could soften. But the overall industrial at least going into Q1, it could be roughly flat, maybe slightly down, depending upon as a percentage of revenue. And I guess itâ\u0080\u0099s a good sign that cancellations have dropped quarter-over-quarter, I think, if I heard you guys correctly. And I would say that when we started the quarter, we had indicated that we are within the range of what we had in â\u0080\u0093 what we had guided. But what happened throughout the quarter was there were bookings, but there were also push outs and cancellations that basically offset. So, we expect some turns business this quarter and significantly higher turns business next quarter. Therefore, we think that fourth quarter and the first quarter would be roughly bottom of the cycle. And we also mentioned that the cell phone inventors are coming down very nicely, so we expect that to come back first and then appliances and industrial. So going to Q1 quarter, our best estimate is we would be similar to Q4 and then Q2, our expectation is that itâ\u0080\u0099ll be incremental growth, but second half is where we expect a stronger demand as this downturn turns into an upturn. I just wanted to touch on, you mentioned some softer pricing this quarter and that you expected to continue into next year. Well, we price it price our products on value. As far as going forward, I will let Sandeep explain for next year. Yes, as I had a guided, even at the Analyst Day, I had said 56%, but right now Iâ\u0080\u0099m guiding to 55% to 56%, because the volumes are much lower. And as I said, the mix is more going to slot towards communication, and as Balu had indicated, the cost increases from wafers will be offset by the yen more or less. And obviously the value pricing, theyâ\u0080\u0099re expecting to have some impact in the coming year. Putting all that together, the non-GAAP gross margin guide to the best we can do and with the best indication we have for the mix is 55% to 56% for 2023. So, I guess just digging into; letâ\u0080\u0099s say the comms market a little deeper here. So you guys have peaked in the $60s millionâ\u0080\u0099s  per quarter, and probably down now to mid-teens per quarter. In China, as you know, because of lockdowns and all of the business, the challenges theyâ\u0080\u0099ve had in terms of the economy slowing down and so on. Now, I think they say, okay, Iâ\u0080\u0099ll keep the phone, because I canâ\u0080\u0099t afford to buy a new phone. When they will start buying, I donâ\u0080\u0099t know, we are going through this timeframe where the demand for the phones in China is low. And in fact, across the world things are slowing down, as you know, because of inflation and so on. So our best estimate is that at the current rate of demand, we can see how theyâ\u0080\u0099re depleting their internal inventory. Now, I have to be careful theyâ\u0080\u0099re already ordering some products because thereâ\u0080\u0099s a mix issue. Obviously we are still shipping products, but it is to non â\u0080\u0093 more to non-Chinese customers and less to Chinese customers. We will see, I believe a some revenue coming back in Q1, but higher in Q2, but bigger change in demand will be the second half, and that is our best, I would say speculation of when the demand will come back to normal. Yes, I think, common computer will be higher and you will see the other segments thatâ\u0080\u0099s why a bit of the margin impact. Well, I would say the industrial be down â\u0080\u0093 industrial will be down from where it is and all four, I mean, I would say the direction is dominant dollars, but percentage wise, you will see common computer slightly up. Yes, it went down about, yes about $10 million â\u0080\u0093 roughly around $10 million or so. Yes, channel inventory went up in the last two quarters, but in Q4, we expect the channel inventory to come down. Obviously, we wonâ\u0080\u0099t get to our target weeks until a few quarters later. The dollar value goes up, but the denominator also comes down and that amplifies the change in weeks. And then the â\u0080\u0093 now more recently, I will say from Q2, the China, we saw the inventory problem in Q2, but in Q3, we saw a significant inventory correction in Korea, both in the cell phone and appliance OEMs. And they are really correcting very hard right now, and that wonâ\u0080\u0099t be corrected until probably end of Q1, because they do have â\u0080\u0093 they have built more inventory based on their concerns before â\u0080\u0093 during the pandemic. The whole thing, if you look at it, what happened was they were trying to build enough inventory so that they donâ\u0080\u0099t have supply chain issues, but the demand dropped up so abruptly they were not prepared. And China to a large extent is corrected at the OEM level, not at the channel level, but in Korea itâ\u0080\u0099s still there at the OEM level."
}