{
    "symbol": "POWI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 08:01:56",
    "content": " At this time, I would like to welcome everyone to the Power Integrations Second Quarter Earnings Conference Call. With me on the call today are Balu Balakrishnan, President and CEO of Power Integrations; and Sandeep Nayyar, our Chief Financial Officer. Before we get started, I'd like to remind everyone that we will be hosting an Analyst Day on September 8 in New York. Details on a registration link for either in-person or remote attendance can be found on our Investor website, which is investors.power.com. I'll also mention that during this call, we will refer to financial measures not calculated according to GAAP. Non-GAAP measures exclude stock-based compensation expenses, amortization of acquisition-related intangible assets, net other operating expenses of $1.1 million related to a patent litigation settlement and an offsetting recovery from the liquidation of SemiSouth Laboratories and the tax effects of these items. Our discussion today, including the Q&A session, will include forward-looking statements denoted by words like will, would, believe, should, expect, outlook, forecast, anticipate, prospects and similar expressions that look toward future events or performance. Such risks and uncertainties are discussed in today's press release and in our Form 10-K filed with the SEC on February 7, 2022. Our second quarter revenues were up 2% year-over-year to $184 million, which was slightly below our guidance range. Nevertheless, our non-GAAP earnings per share grew 24% year-over-year to $1.03 driven by a significant expansion in our gross margin. On last quarter's call, we acknowledged the emerging concerns regarding the near-term demand environment. Softness in computer category was also evident, but was cushioned by recent share gains in notebooks, resulting in a modest decrease about 5%. Industrial revenues increased about 20% sequentially, while consumer revenues are up high single digits though distribution sell-through lags sell-in across both categories. While domestic demand in China is reportedly seeing an uptick following the easing of lockdowns, our third quarter revenue outlook calls for a 10% sequential decline at the midpoint, reflecting inventory builds at customers and distributors. As in past downturns, we will maintain our focus on long-term growth, continuing to invest in products and people rather than managing to short-term operating metrics. We remain as excited as ever about our future, thanks to the expanding portfolio of leading-edge products we are bringing to the market and the broad secular trends, enabling us to expand our SAM. These include the electrification of tools and transportation, home and building automation, renewable energy, advanced mobile device charging and the conversion of brushless DC motors in appliances. Motor-Expert includes not only design tools, but also control software to drive both single and 3-phase motors to optimize motor performance and minimize system cost. The simplicity of BridgeSwitch architecture, combined with our Motor-Expert, software enables rapid design cycles, a capability that has been especially powerful in recent months with many customers forced to -- forced into sudden redesigns by competitor supply shortages and changes in efficiency regulations. Our current BridgeSwitch product range addresses motors up to 400 watts, a market opportunity of $0.5 billion, encompassing applications such as refrigerator compressors, water pumps, range hood fans, air conditioning fans, high-speed hair dryers and ceiling fans. New efficiency regulations in India are having a significant impact in ceiling fans, which is a sizable market in that country. We're also seeing strong traction at a broad range of major appliance customers where we already have deep relationships, thanks to our leading market position in AC to DC power supplies. In all, we expect to have about a dozen customers in production this year with BridgeSwitch, and that number is set to expand dramatically in 2023. We are equally excited about our progress in electric vehicle market, where the need for high-voltage semiconductors is creating significant opportunities for Power Integrations. Our automotive qualified InnoSwitch products are rapidly gaining acceptance at customers in the U.S., Europe, Korea, Japan, and China, in particular, the new 1,700-volt version with a silicon carbide switch designed for use in next-generation 800-volt vehicles. Our power supply products established a presence at customers and are quickly being adopted as platform solutions, enabling us to then gain access to a higher value opportunities such as gate drivers and drivetrain inverter -- for the drivetrain inverter. And we are targeting not just passenger vehicles, but also commercial and industrial vehicles such as buses, trucks, mining and construction equipment, where the available dollar content per vehicle is in the hundreds of dollars. In May, we launched our SCALE EV board-level gate drivers targeting heavy vehicles. SCALE EV drivers are rated at 1,200 volts to address both 400- and 800-volt systems and are capable of driving IGBTs as well as silicon carbide MOSFET modules. While long design cycles will result in a gradual revenue ramp over the next few years, we expect to be in production this year with several customers, and we are rapidly expanding funnel of design opportunities. Finally, we continue to make great progress penetrating the market with our highly integrated GaN products, including InnoSwitch, MinE-CAP and ClampZero as well as the recently introduced power factor chip HiperPFS-5. We won a wide range of GaN designs in Q2, including a 65-watt multipurpose USB PD charger for a Chinese handset and notebook OEM and aftermarket designs spanning from 33 to 120 watts. In summary, while the near-term demand environment is challenging and uncertain, we have a playbook that has served us well in the past economic cyclical downturns. We intend to follow it again here, focusing on winning market share and bringing innovative products to market so we can come out stronger at the other end. While our Q2 revenues were below the range, reflecting the downturn in demand, we nevertheless had an excellent quarter from an EPS and cash flow standpoint driven by a strong gross margin and lower-than-expected OpEx. We expect gross margin to remain above the high end of our target range for the next several quarters, thanks to favorable mix and manufacturing efficiencies and the strength of the dollar versus the yen. And as in past downturns, we are tightening our belt on spending, but we'll continue to invest in the people and products we need to sustain our long-term growth. Revenues from communication category fell nearly 50% from a year ago, reflecting the recent weakness in smartphones but also the unusually strong demand in the first half of 2021. Consumer revenues were up mid-20s driven by appliances, while industrial revenues increased nearly 40% year-over-year with strength in a number of verticals, including home and building automation, metering, high-power and broad-based industrial. As Balu noted, however, sell-through did lag sell-in across all end market categories. Revenue mix for the second quarter was 38% consumer, 35% industrial, 18% communication and 9% computer. The higher-margin industrial and consumer categories accounted for 9 percentage points more than in the prior quarter, driving non-GAAP gross margin up to 58.5%. Non-GAAP operating expenses for the quarter were $42.1 million, below our forecast, reflecting a smaller-than-expected increase in headcount. Non-GAAP operating margin for the quarter was 35.6%, and non-GAAP earnings were $1.03 per diluted share, up 24% from a year ago. Weighted average diluted share count for the quarter was 58.3 million, down 1.8 million shares from the prior quarter. In total, we bought back about 6% of our shares since November, taking advantage of market volatility as well as the dislocation caused by our promotion to the S&P MidCap Index late last year. In addition to the buyback, other uses of cash were $13 million CapEx and $10 million for dividends. Inventory in the distribution channel rose to 11.6 weeks at the end of June quarter, reflecting the weaker sell-through. Internal inventories rose to 132 days, up 17 days from the prior quarter. As we have said many times before, we are comfortable allowing inventories to rise well above our target level during a downturn as we did in the earlier months of the pandemic when we went as high as 178 days. We can do this because we have virtually no obsolescence risk with the vast majority of our products, thanks to the long life cycles and fungibility across customers and applications. Building wafers during periods of slack demand ensures continued access to foundry capacity, which gave us a tremendous competitive advantage throughout the period of supply and demand imbalance over the past 1.5 years. Looking ahead, we expect revenues for the September quarter to be $165 million, plus or minus 5%. I expect non-GAAP gross margin for Q3 to tick down slightly to about 58%, reflecting the seasonal slowdown in air conditioning, which will result in a slightly less favorable mix. Non-GAAP operating expenses for the third quarter should be approximately $42.5 million, essentially flat compared to the June quarter. In light of the weaker demand environment, we have trimmed expense budget for the second half of the year and now expect full-year non-GAAP expenses of around $170 million rather than the prior expectation of about $177 million. The non-GAAP effective tax rate for the third quarter should be approximately 10%, and I expect diluted share count for Q3 to fall by about 0.5 million shares. And now, operator, let's begin the Q&A. Your line is open. Hey guys, thanks for the question. Chris, I think as you heard from our script that the China handsets is really where we really saw quite a bit. But the other area that we are watching, and we have talked about in the past that with the whole housing issue that is happening, the inflation factor and all that has a big thing. And obviously, the war has had an impact also. So I think we've been calling this for a bit, and we're seeing it now. The good part for us, however, as we have said in the past is we've had tremendous share gains. And we typically see this about a quarter or so earlier than others, but we also come out of it much stronger as we have done in the past. How long the cycle lasts is very difficult to tell because the number of things that are very different this time is not only the macro situation, but the inflation factors, the war, which are adding more complexity. Cycles in the past, and you've heard other people talk about this, I had another company which I read talked about that they'll see the inventory adjustment take two to three quarters. And we -- this is the reason we had cautioned about the sell-through in our last call, and that caution seems to have come through. The part I think I'd like to leave with is irrespective of this, we've had tremendous share gains. We feel very good, and we've got some very great products coming out. And then also, gross margins held up pretty well through all this. I think some of that was a function of mix, maybe some currency on the yen side that you guys were helped by. So I think on margin, you pretty much highlighted the mix as the thing that really helped us. The one part that I think which you probably heard, I think that the margin will continue to remain strong because of the slowdown, what has happened is that the inventory levels have gone out. And the cost increases that I talked about in the back half, especially in Q4, will now get pushed out into the next year pretty much. So as a result, we continue to see good -- I mean, the similar margin as we have predicted for Q3, for Q4. I think in terms of the revenue for the next quarter and the decline, I think you're going to see, the communications maybe down along with consumer. So I think it will be all three tapering, but I think the computer segment will do a little better there. But all the others, I think, will taper down. Your line is open. Looks like we've gone from six weeks to 12 weeks in about two quarters, a pretty steep increase. So obviously, sell-through has weakened quite significantly. Because obviously, you're guiding down for Q3. First of all, I think the reason the channel inventory went up is because of the suddenness with which the demand went down. They were making sure that they have enough inventory in case there is a snapback from the lockdowns, but that really didn't happen. The other challenge, of course, is if you don't sell-through as much, your denominator is smaller, so for the same revenue or the same inventory or higher inventory, it amplifies the number of weeks. In terms of demand, now we believe there is inventory at our end customers. And we are seeing some signs of improvement in Chinese cell phone demand, but we won't see the benefit of that until the inventory is completely depleted. And depending upon when they start ordering, we may have some pull-in from Q1 because the Lunar New Year this time is earlier, so we'll benefit from that. A small amount may come back in Q4, and that is purely from an inventory standpoint. As far as overall demand, of course, it depends on the macro. And also, there is the challenge of the lockdowns that has impacted the demand, which we thought will come back, hasn't come back. It could snap back in Q3 or Q4, but we are very cautious about the overall macro demand slowing down. And a question on gross margin, and I understand the drivers near term. It's a good question, Tore. I think if you are talking near term at next year, obviously, the mix is the wild card. But I still believe that with the new products like BridgeSwitch and others, the mix, I think, will still be more towards our richer margins. Now with the macro, obviously, since we do value pricing, I don't know what the macro environment will be there, and that can have an impact. But obviously, the increase in wafer cost coming in next year would be a headwind, but the yen is definitely a tailwind. Putting all this together, and if I have to take a gut thing, I believe we will still be slightly above the high end of the range for next year. You're starting to see more -- some more share gains, you're starting to see higher ASP products. We are already benefiting from that in spite of the fact that there is softness in terms of units, on a relative basis, the dollar value is higher for us even though units are lower. Outside of China, our business is actually doing well. So it's a share change, if you will, between major companies. And overall, worldwide, we have very high share of the top four OEMs out of five. Your line is open. Hi guys, thanks, let me ask you question. So while it was weaker than we expected, it wasn't necessarily directionally surprising. But the consumer and industrial areas are two areas, probably in that order, that people are increasingly concerned about having somewhat of a similar impact over the next couple of quarters as macro weighs on those just a little bit later. So until now, I would say China is the only one which has been impacted. But on the longer run, we are concerned about the overall inflation and the potential impact on GDP across the world. And in China, until you actually buy the house, you don't put the appliances in. So to that extent, there is headwinds in terms of appliance demand in China. Ross, this could obviously impact the shorter term, but the market share gains that we have gotten over these last 1.5 years with the ability to supply the innovative products that we have, I believe when this thing turns, we will still come back very strong in this segment. Most of that China side, I assume you were referring to the consumer aspect. In the industrial, actually, on a relative basis, we have done extremely well in industrial. Even on a sell-through basis, if you compare it to -- compare year-over-year for Q2, we grew about 25% on a sell-through basis. But as you saw, our  went up in Q2 across all markets, including industrial. So I think on a relative basis, industrial is doing well. As I mentioned, the -- all of the category sell-through was weak. And as far as whether that inventory will stay there or go down, I don't believe in Q3 it will go down very much, but Q4 is when I expect it to go down. And therefore, they always have some level of charger inventory, and they also did not expect the demand to go down so quickly. In April, we had one of the cell phone company executives here pushing us to ship more products to them. And literally, in May, the same company decided they have too much inventory, they see a recession coming, and so they wanted to cut the inventory by half, which means we don't see any business for a while. I mean, that's how quickly this market changed. It's -- I remember when they came here how hard they were pushing us to ship them more products, and we were trying to resist that. As you know, we always try to meet the demand rather than what they're asking for. But we do have to let them have some inventory because they don't want phones ready, but they don't have chargers to go with it because phone is a lot more expensive than the charger. I think part of the thing is that they were hoping that after the lockdown, the demand would come back very strongly. And Ross, the other thing is that the Chinese -- the New Year is much earlier. And that's the hypothesis is that they would like to keep a little more elevated just in case there is more demand, and they don't want to again be out of inventory in Q4. And obviously, the sell-through in communication was so low. So yes, the weeks in the channel related to communication is much higher than the others, though everything grew, but it is much more in communication. Your line is open. The first one is around -- obviously, the end markets are changing quickly due to some of the things that have been well documented and you guys have talked about so far on the call. And the second question that's related to that is -- and maybe the answer is yes, then it's fine. Historically, we have been much more balanced during downturns, meaning that we don't do anything drastic. In fact, downturns are best time to hire people because you get very good people when other people are -- other companies are laying off people. Secondly, we continue to build inventory so that we keep our foundry running, and we can maintain the capacity. And we can do that, because we're in a unique business model where we have very little obsolescence risk on most of our products. And that sets it up perfectly when the demand comes back, which it always does eventually. And we do judiciously -- of course, we always tighten our belt a little bit, but not at the expense of long-term growth of the company. We continue to invest in hiring people in R&D and sales, because we need that for future growth. And every downturn in the past, we have gained significant share. And that's because we take this as an opportunity rather than as a problem, and we go after more designs. So I can't tell you about what they're doing today, but I can tell you, historically, we have always done better through the downturn. And even in 2008 and '09, we not only grew through the downturn, in 2010, we grew 40%. So obviously, there are some pockets where you're seeing a little bit of that. And that's why when I had the question of Tore, I said, I want to see what the macro dynamics is. But you are seeing some pockets where the value pricing is seeing some impact, but it's a little too early to tell. I think someone earlier asked a little bit about the gross margin being higher, and you guys answered some of the overall trends. I wonder if you might -- it seems like more weakness in consumer, no question. As you know, we have always ranged that we get the highest margin in industrial followed by consumer, followed by computer, and communication is the lowest. And I think the best way to attribute it is look at how the margin changed between what we guided to, what we came out in Q3, and that gives you a relative measure of what happens when you have tremendous success in the higher margin business. Your line is open. Let me ask a question here, I guess, Balu, you had talked about the significant executive that had the demand in April and then slowed in May. But I must say we are seeing, to a lesser extent, a similar reaction in appliances because the demand has come down in China appliances as well. As you know, for the last two years, they have been struggling with getting enough supply. So it's not just cell phones, but cell phone is worse than appliances. What we did is we said we guided to the range, and there's always the risks. You get some turns business, but you also get some cancellations. And the only thing that is, I think, comforting to us is that, yes, with the Chinese New Year being early, people have realized in the past that if they cut it too thin, they don't have inventory. But again, it's -- we are in very different times right now in a very short period of time. But even in spite of that, the channel inventory has gone up quite a bit. David, just to add, we said for Q2, we were booked to the midpoint, and you noticed that we came below that. So it may look like we are being conservative, but we are trying to do the best estimate we can because there could be pluses and minuses. On the PC, you said you'd expect that to be maybe a little bit better next quarter, and you mentioned the notebook specifically. Yes, I don't think we see any signs of PC business improving. In spite of the weakness, we think we'll grow. In fact, if you look at Q2, we were only down 5%, whereas the market was down quite a bit more than that. That's because we are growing share, and that will amplify in Q3 because of some new design wins. And therefore, our forecast is that, that category will grow in Q3 even though the other categories will be weaker. Your line is open. Yes, thanks for taking the question. Well, there is no -- it's hard to talk about normal. If you go back three or four years, we used to have significant turns business within the quarter. I mean, maybe 50%, 60% turns business. But the best example I can give you is last quarter, we were booked to the midpoint and then we ended up at the lower end of our guidance. So the turns business, the net turns business is not very much, as you can tell. And then over the last couple of years because of the shortage of semiconductor, I don't think you have really passed along cost savings to your customers. As Sandeep said, we always price our products based on value. To the extent the discrete components supply becomes easier and the cost on those come down, yes, it will have some impact on our pricing, but it's all value. And then just in looking at the handsets and so to follow, I think China has been first to adopt rapid charge, and I think that's kind of close to a standard. In other words, I can use my charger from last year's phone, and I don't need to buy one, and people aren't putting them in the box anymore. I believe it's the latter because in China, the chargers are shipped with the phone. So I don't believe that has an impact, at least not in China. I don't know whether I have buy that geography, I would say overall market share for smartphones, we are probably approximately in the 40-plus percent range on a unit basis. In dollar terms, we are much higher because our ASP is much larger than our competitors, who sell portions of the solution. Your line is open. So first of all, one of the few benefits of raising interest rates, of course, is the impact on your other income line. So as you know, we spent over $300 million in the last six months. And in fact, the average price that we have bought it back is slightly below where we closed. So we've just taken a little pause, but we are opportunistic. And we're going to be, again, opportunistic, and buyback is one of the ways we return value, and that's not going to change. And my second question, and I think this is the first time in more than a year that there hasn't been an auto question on the POWI call. So Balu, you talked about production this year but still a very gradual ramp. Right now, it's an industrial. Obviously, if it becomes 10%, I think that will be a reasonable time to break out auto revenue. In terms of when it will -- the auto revenue will really become material, I would say it will be starting in 2024, because right now, the designs we are winning are short design cycle type of sockets, where you don't need a full safety qualification and so on. I mean, we -- every customer we have showed InnoSwitch are going to use it. They're either started designing with it, they are some of them are in production. And the big change will come when we have our gate driver products designed into the inverter, the main inverter for the motor. So all in all, I would say automotive will become our largest SAM in a matter of a few years. Tore, I think what I've said before, 2025 to 2035, it will be the decade for POWI of automotive. Yes, I'm appreciate that the reaction from customers has been unexpectedly positive. We thought this will be a very hard market to get into, but the enthusiasm we see from customers based on how compelling our product is in the application is really heartening. Your line is open. I want to go back to the cash question that Tore just asked and maybe ask you differently and maybe clarify your answer to him, Sandeep. It looked like you bought back more in the second quarter, not less. So when you said you were opportunistic and you're taking a pause because of what's going on in the end market, that's completely understandable. I know you have a ton of it, $328 million is a lot. Most other companies have slightly net debt, and you have a ton of cash per share. We keep a little bit of powder dry for -- as we said, we have a four pronged approach, whether it be M&A, whether it be internal investments, like not only expense, but right now, we may be growing our inventory that we have done in the past and the dividends that we periodically increase. If you look back in the last six months or seven months, we got over $300 million. So -- and if you look back over the last 10, 12 years, it's like $800 million. And obviously, with the uncertainty, this will continue to be one of the four prongs, as I said, in the coming quarters. Hey Ross, it's Joe. The pause refers to the fact that the buyback we did in Q2 actually exhausted the authorization we have, and so we don't have an active authorization at the moment. And then, I guess, a housekeeping question for you. You talked about -- and you guys have evidenced this through every downturn since I've followed you investing through downturns, coming out stronger, still continuing to hire, et cetera. But this last quarter, it fell by more than half sequentially. I know share price moving around can change things a little bit, but your share price hasn't moved that much either. So it's a good thing from an investor part, but it's not good for us, obviously. So with the weaker second half in general, it probably stays at this level, but if, let's say, optimistically return -- you return to solid growth...\n No, no. I think -- yes, no, no. So we have what I would call performance stock short term and performance stock long-term, which has had  especially at the executive over a three year period. So when you have this performance, it also has not only to our performance, but the measure also is linked to how the industry is doing. So it's got a cap element of the true-up, which has made it lower than what it will be going forward. Once again, if you are interested in attending our Analyst Day on September 8 either in person or remotely, you can find a link to register on our website, investors.power.com."
}