{
    "symbol": "MODV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 17:04:03",
    "content": " We reported solid quarterly results, driven by strong member growth in our non-emergency medical transportation or mobility business, while our Home division, consisting of our personal care and remote patient monitoring businesses, continues to perform well. Third quarter revenue increased 31% over year to $648 million, driven by 23% growth for our mobility business and 43% growth for our personal care business. Adjusted EBITDA margin for the NEMT segment was 8.6% in the third quarter of 2022, compared to the second quarter of 2022, adjusted EBITDA declined $6 million, primarily related to lower out-of-period benefit from a favorable contract repricing which benefited second quarter adjusted EBITDA by approximately $8 million. Hours during the third quarter increased approximately 2% sequentially to $6.8 million, driven by increased service levels and our team's focus on workforce development, including recruiting and retention initiatives. Personal Care segment net income increase was $1.6 million, while segment adjusted EBITDA was approximately $19 million in the third quarter of 2022 compared to $10 million from the prior year period. This morning, we increased our revenue guidance range by $75 million for the year due to strong membership growth in our Mobility business and reimbursement rate increases in our Personal Care business. Additionally, NEMT adjusted EBITDA could decline somewhat sequentially due to the lower average members compared to Q3, while margins for the year could be at the lower end of our long-term range of 9% to 12% due to higher transportation cost per trip and still being in the early stages of our mobility process and technology transformation. For our Personal Care segment, we expect revenue growth in the mid-single digits for 2022 on a pro forma basis, and adjusted EBITDA margin is expected to be near the midpoint of our long-term range of 10% to 12%."
}