{
    "symbol": "MODV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-25 11:32:01",
    "content": " Before I turn the call over to Ken Shepard, our CFO of Mobility to review the fourth quarter and full year 2022 financial results, I want to remind everyone that the biggest fundamental challenges facing the US healthcare systems today are its elevated cost, the inequities and access to care for the most vulnerable patients and too little focus on care prevention by addressing the social determinants of health. Fourth quarter adjusted EBITDA included approximately $7 million of onetime benefit about half of which was related to our year end accrual adjustments, and the other half related to a onetime revenue recapture in our NEMT contracts. Transitioning to the financial results of our segments starting with Mobility or NEMT, fourth quarter 2022 revenue increased 14% year-over-year to $459 million, driven by a 16% increase in average monthly members. Service expense for the NEMT segment, which includes all direct costs increased approximately 22% year over year in the fourth quarter of 2022 to $387 million. Turning to our Personal Care segment, revenue in the fourth quarter of 2022 was $176 million, which was a 12% increase year over year. Full year 2022 Personal Care revenue increased 35% year-over-year to approximately $668 million, driven by the full year contribution from our CareFinders acquisition, which annualized in September as well as improvements in recruiting, retention and a 6% revenue per hour increase during the year. Personal Care segment net income was $2.3 million, while segment adjusted EBITDA was $16.6 million in the fourth quarter of 2022 or 9.4% of revenue. For the full year, Personal Care adjusted EBITDA increased 67% year-over-year to approximately $70 million, which was 10.5% of Personal Care revenue. Revenue in the fourth quarter of 2022 increased 18% year-over-year to approximately $19 million, which included approximately $4.6 million of contribution from our Guardian Medical Monitoring acquisition. RPM segment net income was $0.7 million in the fourth quarter, while adjusted EBITDA was approximately $6.8 million and adjusted EBITDA margins improved 50 basis points sequentially to 35.8%. As we suggested last quarter, we expect our full year 2023 adjusted EBITDA to be more back half weighted due to our ongoing operating initiatives, investments we are making during the first half of the year as well as normal seasonality impact on profitability."
}