{
    "symbol": "GNSS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-09 22:29:02",
    "content": " We had a terrific second quarter with revenues of $13.2 million, up 17% from the prior year Q2. Bookings for the first half were $12.5 million, yielding a backlog at the end of Q2 of $23.9 million, up 73% or $10.1 million from a year ago. Based on our quarter end backlog of $23.2 million and supported by our current supply chain visibility and rapidly growing business pipeline, we are reaffirming our fiscal 2022 outlook of a sixth straight year of revenue growth and a fourth consecutive year of record revenues. Revenues for the fiscal 2022 second quarter were $13.2 million, up 16.5% from the prior year quarter. As compared with the same prior year period, LRAD revenue was $10.6 million, up 8.4%. IMNS revenue was $1.9 million, up 128% and software revenue was $673,000, essentially unchanged from the prior year quarter. Adjusted EBITDA for the fiscal 2022 second quarter was $853,000 compared with $1.2 million in the prior fiscal year second quarter. For the first 6 months of fiscal 2022, revenues were $23.8 million, up 23.4% from $19.3 million in the same period last year. Operating expenses were $14.2 million, up from $9.1 million in the same period last year, again, largely due to a 48.6% increase in SG&A, primarily in sales and marketing expenses from the addition of personnel increased trade shows and travel, increased noncash expense for amortization and share-based compensation compared to the prior year and an 84% increase in R&D, specifically engineers for product development opportunities. Net loss for the first 6 months was $1.8 million or $0.05 per share compared with a net loss of $357,000 or $0.01 per share in the first 6 months of fiscal 2021. Adjusted EBITDA for the first 6 months of fiscal 2022 was $441,000 compared with $922,000 in the prior year period. Cash, cash equivalents and marketable securities totaled $16.4 million as of March 31, 2022 compared with $20.7 million as of the prior year-end."
}