{
    "symbol": "GNSS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-11 19:59:08",
    "content": " Bookings for the quarter were nearly $20 million, growing our backlog $6 million to a total of 30 million exiting Q3, keeping us on track for our revenue expectations for the year. SaaS revenue has nearly doubled year-over-year and SaaS bookings in the first nine months increased 27% over the same period last year, reflecting the growing momentum of our GEM and Zonehaven solution. Based on our $30 million quarter end backlog and supported by a rapidly growing business pipeline, we are well positioned for a six year of revenue growth. As a reminder, our fiscal 2022 business plan includes a year-over-year increase in operating expense for strategic growth initiatives targeted materially shifting our revenue mix toward a higher proportion of software revenue and expanding our margins. Adjusted EBITDA for the fiscal 2022 third quarter was $364,000 compared with $1.4 million in the prior fiscal year third quarter. For the first nine months of fiscal 2022 revenues were $38 million, up 19% from $32 million in the same period last year. Operating expenses were $21.4 million, up from $15 million in the same period last year, again, due to a 35% increase in SG&A related to strategic growth spending to accelerate SaaS revenue and a 72% increase in research and development spending. Net loss for the first nine months was $2.4 million or $0.07 per diluted share compared with a net loss of $67,000 or zero per share in the first nine months of fiscal 2021. Adjusted EBITDA for the first nine months of fiscal 2022 was $805,000 compared with $2.3 million in the prior year period. Our balance sheet remains strong with cash, cash equivalents and marketable securities totaling $19 million as of June 30, 2022, compared to $20.7 million as of the prior year end. Cash used in operating activities for the first nine months of fiscal year 2022 was $600,000, this compares to cash provided by operating activities of $8.3 million in the same period last year. The $1.7 million change in our cash position from $20.7 million at the end of last fiscal year to $19 million as of June 30, 2022 is largely attributable to share repurchases."
}