{
    "symbol": "JFIN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 09:07:06",
    "content": " Before we continue, please note that today's discussion will contain forward-looking statements made under the safe harbor provisions of the U.S. In the second quarter, we delivered excellent financial and operational results, despite a global and fragile economic environment. Notably, our loan origination volume grew by 138.4% year-over-year, while our net revenues increased by 64.9% year-over-year in the quarter. Such strong performance was able to be made on the foundation of our network of partner financial institutions, technology innovation commitment, asset quality optimizations, and risk management capabilities. During the quarter, we actively expanded our partnerships with licensed financial institutions. As of June 30, 2022, we have forged partnerships with 46 financial institutions and we are currently in discussion with another 45. Notably, national financial institutions in our partnership network contributed to over 70% of our total loan origination volume in the second quarter. Currently, we have enabled three financial institutions to leverage our integrated platform and intelligent solutions to accelerate their business digitization under the new partnership model. These intelligent platforms have driven our digitization capabilities to a new milestone   not only improved our internal business efficiency, but also empowered our partner institutions. Meanwhile, the number of borrowings we facilitated in the second quarter increased by 59.5% year-over-year. Our utilization of cutting edge digital technologies we developed such as AI and big data processing, also enabled us to augment our risk management process during the quarter. In Mexico, we made steady progress in operating our business model and establishing partnerships with local licensed financial institutions. As part of this ongoing effort, we continue to increase our efforts in supporting small and micro businesses during the quarter. In order to help small business ease the financial pressure and recover from these economic downturns, our services for small and micro business owners have been extended nationwide. Looking ahead, we will continue to lead the charge towards greater financial inclusion to provide more accessible, affordable, and inclusive   for small businesses. Our competitive strength in our highly automated platforms leading risk management capabilities, diverse funding sources, and global business expansions positioned us well to establish our competitive advantages. As Mr. Yan mentioned earlier, we once again delivered outstanding financial results in the second quarter, highlighted by robust revenue growth. Revenue growth was primarily driven by the significant growth in loan origination volume, which increased 138.4% to 13.5 billion. Origination and servicing expenses were 128.3 million, up 54.2%, driven by the increase in our loan origination volume, allowance for receivables, and contract assets reduced by 46.2% to 7 million, mainly as a result of the ongoing restructuring of the company's overseas business during the second quarter of 2022. Sales and marketing expenses were 235 million, up 34.9%, reflecting higher borrower acquisition expenses in this quarter. G&A expense was 42.6 million, up 21%, primarily driven by expenditures in compensation and the related benefits in the quarter."
}