{
    "symbol": "JFIN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-23 09:22:05",
    "content": " Our loan origination volume grew by approximately 123.5% to RMB14.9 billion in the third quarter, making it the second consecutive quarter with over 100% year-over-year growth. Our exemplary third quarter performance attached to our commitment towards strengthening our partnership network, refining our risk management strategies, strengthening our technology capabilities and accelerating our global business expansion. In the third quarter, expanding and strengthening partnerships with largest financial institutions remain our top business priority. Under the current macroeconomic conditions, we focus on reassessing the needs of financial institutions and building long term partnerships to safeguard our funding sources and optimize our funding structure. As of September 30, 2022, we have forged partnerships with 46 financial institutions and we are currently in discussion with another 60. Notably, national financial institutions in our partnership network still contributed to the majority of our total loan origination volume in the third quarter. In addition to strengthening partnerships, since earlier this year we began collaborating with partner financial institutions to provide them with technology enabled services for their in house operations. Currently, we have empowered three financial institutions to digitize their in-house business from fund management, risk management, intelligent marketing, customer services to other operation processes, we are now interfacing with another three financial institutions and actively negotiating with six more institutions to foster the development of this new collaboration model. In the third quarter, our average borrowing amount per borrowing reached RMB10,158, increasing 58.1% year-over-year. Moreover, despite adding new borrowers in the quarter, our repeat borrowing rate still maintained at a healthy level above 60%. Our 61 to 90 day delinquency rate remained relatively stable in the quarter, reflecting our outstanding risk control capabilities under the volatile macro environment. Going forward, we will continue to focus on improving the profitability of our Nigerian operations, developing innovative partnership models as well as accelerating our product development and penetration in the local market. In the third quarter, our charging charity special fund organized the led children's small charity fund raising even on Jiajing Charity Special Found organized the  Children Small charity fund-raising event on  (ph) charity platform where we help fund 10,000 mental care service packages for the use. In addition, the repeated COVID resurgence and the consequence control measures have had a negative impact on small business owners this quarter. Following the government's call, we also continued our efforts in supporting small and micro businesses during the quarter by expanding our services for small and micro business owners who have long been underserved. By the end of September, our specialized loan program has served approximately  (ph) small business owners in 31 provincial level regions across China. We have proven our capabilities to develop leading financing service offerings, intelligent financial solutions and compelling value propositions, we are confident that we will continue to empower our partner financial institutions serve our broad borrower base and generate sustainable value for our shareholders in the long term. As Mr. Yan mentioned, we delivered another quarter of robust financial performance. Our loan origination volume grew by 123.5% to RMB14.9 billion as we expanded and strengthened our collaboration with institutional funding partners, our net revenue was RMB894.3 million, up 55% driven by a 47.7% increase in our revenue from loan facilitation services. Origination and servicing expense was RMB148.4 million, up 68.1%, in line with our loan origination volume growth. Allowance for receivables and contract assets reduced moderately by 4.8% to RMB5.9 million, mainly as a result of the ongoing restructuring of our overseas business during the quarter. Sales and marketing expenses increased by 36.6% to RMB323.6 million, reflecting higher borrower acquisition expenses in the quarter as we continue to invest in our online marketing programs. G&A expenses were RMB51.4 million, up 13.5%, primarily driven by expenditures in compensation and related benefits in the quarter. Our ability to carefully manage our expenses define our cost structures and improve operating efficiencies, while growing our business enabled us to further enhance our profit margins in the quarter. We ended this quarter with RMB217.5 million in cash and cash equivalents, up from RMB213.9 million as of June 30, 2022. Given our better than expected performance in the first nine months of the year, we now further revised our full year 2022 loan origination volume outlook to RMB50 billion, which compares to the original RMB36 billion we provided in the first quarter and updated RMB43 billion we announced last quarter. My first question is regarding the really strong growth, especially in the past few quarters. As Mr. Yan mentioned early on, we have established over 46 financial institutions with a deepened and broader network, the demand for our loans has been driven up as a result. Since the start of the Jiayin Group, we have already served over 12 million customers in terms of their loan needs, and we continue to drive higher growth on our overall customer base. But as we all know, in terms of the absolute loan growth, we're really focusing on making sure the growth is healthy, sustainable and forward-looking, especially relative to overall economic outlook, legislation framework, as well as our market outlook."
}