{
    "symbol": "JFIN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-08 10:42:06",
    "content": " On the call with me today are Mr. Yan Dinggui, Chief Executive Officer; Mr. Before we continue, please note that today's discussion will contain forward-looking statements made under the safe harbor provisions of the U.S. In the first quarter, we were faced with significant volatilities from the macro environment following the latest COV1D-19 resurgence in certain areas of China. However, despite the pandemic-inducing economic deceleration, we continue to strengthen our core competencies by enhancing our risk management capabilities, acquiring high-quality borrowers and expanding partnerships with licensed institutions. Notably, our loan origination volume grew by 95.4% year-over-year to RMB8,153 million in the first quarter. In the first quarter, our income from operations reached RMB182.5 million and our net income was RMB144.6 million. The 90 day delinquency rate also dropped to 0.53% from 0.72% at the end of last year, illustrating the consistent improvement of overall borrower credit quality. Going forward, we will continue to invest in our online marketing initiatives to further expand our borrower base with enhanced borrower acquisition efficiency, while maintaining our borrower’s credit quality at a very healthy level. At the same time, we remain committed to expanding our partnerships with licensed financial institutions to continue diversifying our funding sources. As of March 31, 2022, we have four partnerships with 40 financial institutions, and we are currently in discussion with another 45. More importantly, national financial institutions in our partnership network contributed to the majority of our total loan volume in the first quarter. In addition to that, we are also actively exploring new collaboration models by leveraging our integrated platform to empower our financial institution partnerships. Under the new partnership model, we provide specialized services, including borrower acquisition, risk analysis and other operational services to enable our partners to digitize their own operations. We have already implemented the new partnership model with four financial institutions, and we are in discussion with another three institutions to further expand our partnership network. In addition, we also uphill  our corporate responsibility to support small and micro business owners during the quarter through loan services, while small business has the hardest time adjusting to the economic disruptions, their financing needs remain largely under-penetrated and under-served. As such, we continue to develop our loan program for small business owners in order to help them better recover from the economic hardships. To conclude, we uphold our commitment to strengthening our risk management capabilities, growing our borrower base and deepening our partnerships with the licensed financial institutions. As our strong performance in the first quarter again demonstrated vitality and resilience, we are laying on a solid foundation of improved profitability and asset quality to overcome any macro uncertainties in 2022. As Mr. Yan mentioned earlier, we delivered robust financial results in the first quarter marked by strong top line growth and margin improvements. During the quarter, we grew our loan origination volume by 95.4% and revenue by 49%. Importantly, our net income increased by 54.3% year-over-year, while net margin further expanded to 28.3% from 27.3% a year ago. Such achievements against the backdrop of increasing macroeconomic uncertainties and COVID-19 disruptions, again demonstrated the effectiveness of our growth strategies. Net revenue was RMB511.2 million, up 49% Revenue growth was primarily driven by the significant growth in loan origination volume, which increased 95.4%. Origination and servicing expenses were $93.4 million, up 45.7%, largely in line with the increase in our online - in our loan origination volume. Allowance for uncredible  receivables, contract assets, loans receivable reduced by 50% to $4 million, mainly as a result of the decreased loan volume from our overseas business during the first quarter of 2022. G&A expense was $40.7 million, up 7.7% due to higher professional service fees we incurred this quarter. We recorded a higher employee compensation and benefit costs, as well as increased fees for professional services in the quarter. Sales and marketing expenses were $148.8 million, up 63.2%, reflecting higher borrower acquisition and credit assessment expenses in line with the increased loan origination volume. We expect our loan origination volume in the second quarter of 2022 to be between RMB11 billion and RMB12 billion, and our full year guidance remains unchanged. Mr. Yan, our CEO; Mr. Xu, our Chief Risk Officer, and I will answer questions. In Mexico, as we have previously communicated, we have been a strong player in the market, which is continue - we are taking that leading position in terms of the volume. We are starting - working on our strategy to move up to a better, higher-quality customers and providing a product that was a longer term. Last quarter, we have been reporting on our aggressive high volume growth, which is at a double-digit month-over-month growth rate in terms of volume. In Q1 2022, we are maintaining our growth but not at a higher rate and higher double-digit rate. By the way, we are much more focusing on a bigger volume now, continue to drive down the risk metrics, which we have been able to achieve both reasonable health growth, while having a better and improved risk performance. Compared to our operational model in 2021, we're exploring much more flexible and a different strategy to allow us Jiayin to continue to play in our Indonesia lending market. Next question for me, very exciting guide of, I believe it's RMB11 billion to RMB12 billion in originations next quarter. Can you kind of talk about what's driving that growth, whether it might be better acquisition of customers or the introduction of the small business loans. So I think if we're looking at 1.5 years back when we fully in Q4 2020, which is the time when we fully transitioned into loan facilitation model. As a result, our partnership both licensed financial institutions have continued to grow and which we have seen a significant growth in Q1 2022. As we have brought a broader and deepened relationships with our institutional partners, we're seeing that our overall loan growth, we're happy that our overall loan growth was able to meet their needs from our institutional partners. On the other side of our loan origination that we are - with long-term focus and investment in the technology and the lending capabilities, our - our operational teams were able to meet such a high demand on our loans and as well as deliver a healthy performance. Especially due to the COVID resurgence in pocket  areas all over in China focused on the online marketing has benefiting us to continue to drive the growth, while we are experiencing some uncertainties from the COVID situation in China. Aside from the technological investment, we also have pioneered the early risk metrics, both model implementation and model monitoring, which allow us to take a much early peak at both our prospects, risk profiles, as well as our applicant level - applicant risk profiles, in addition to our mature day one risk and  risk. Just my understanding, the government put out some notices on how to enhance the financial services market to spur economic growth during the pandemic - ongoing pandemic issues that have been going on around the world. So the central government and the local government, they are fully aware that economic development, including the GDP growth, employment data, control of inflation is the foundation of China's overall development. So we're also happy to see that the nature of our business, I just mentioned, we haven't seen any like obvious deterioration of delinquency data at like  and on the contrary, due to our better asset quality and refreshing  assets  the delinquency data has grown to be further improved and invest current figures that we have seen."
}