{
    "symbol": "OMCL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 23:24:11",
    "content": " Through these initiatives, including the reduction in workforce, we announced in November 2022 along with other expense containment efforts, we anticipate the annualized savings from operating expenses to be around $50 million for 2023, which does not include the expected volume based reductions within cost of sales. Now turning to our high level financial results, 2022 bookings were $1.54 billion, compared to $1.217 billion for full year 2021, reflecting a slowdown primarily in our point-of-care bookings, particularly offset by an increase of an Advanced Services bookings. The fourth quarter 2022 earnings per share in accordance with GAAP includes the impact of $70 million for severance-related expenses as disclosed in the Form 8-K we filed on November 30, 2022, as well as the impact of $4 million for the impairment of operating lease right-of-use assets as we rationalized our office space as part of the efforts to align with our broader hybrid work strategy. Advanced Services backlog, consisting of minimum contractual commitments as of December 31, 2022, was $418 million, of which $50 million is short-term Advanced Services backlog and $369 million is long-term Advanced Services backlog. For full year 2022, total inflationary costs were $26 million, which is $4 million lower than expected at the time of the third quarter 2022 earnings call, primarily due to moderation in semiconductor steel and freight cost inflation. Now moving to cash flow, full year 2022 free cash flow of $17 million, a decrease of $156 million is primarily due to lower GAAP net income, as well as the impact of higher inventory and timing of cash collections. We expect service revenue from Advanced Services revenue to be between $200 million and $210 million, which is a 10% increase at the midpoint compared to 2022 and represents approximately 18% of 2023 revenues. We expect service revenue for technical services, which includes our post-installation technical support, training and customer education solutions to range between $210 million and $220 million in 2023, an increase of 4% as compared to 2022. The total year 2023 non-GAAP EBITDA guidance includes the impact from estimated lower revenue volume, cost actions designed to create operating leverage, expect to reduce inflationary pressures and anticipated favorable impact from the pricing actions we put in place in recent years and which we expect to have a greater impact in 2023. So really the guide for bookings for 2023, if you play down on that, we are all not breaking out limited bookings between core product bookings and trade services bookings within that core bookings are expected to be down through the year and Advanced Service bookings are expected to be increasing very well, if you will, from  perspective."
}