{
    "symbol": "OMCL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 23:04:03",
    "content": " Our first quarter results include total revenues of $319 million, non-GAAP EBITDA of $50 million and non-GAAP earnings per share of $0.83. First quarter 2022 GAAP and non-GAAP revenues were a record $319 million, an increase of $7 million dollars over the prior quarter on a non-GAAP basis and up 27% over the first quarter of 2021. Non-GAAP gross margin for the first quarter of 2022 was 48.9% including the first quarter gross margin at the impact of approximately $5 million of inflationary costs compared to costs paid for semiconductors, auto materials and trade in 2020. First quarter non-GAAP earnings per share exceeded our expectations due to the strength in total revenue, as well as the impact of a favorable tax benefit and stock compensation of $0.06 per share. We delivered non-GAAP EBITDA of $50 million in the first quarter of 2022, which is $1 million above our guidance range and reflects a 15.8% non-GAAP EBITDA margin. We now expect full year non-GAAP EPS to be between $3.85 per share, and $4.05 per share, representing an increase of $0.10 per share to both the bottom and full expanse of the guidance range based primarily on lower expected diluted shares outstanding, which includes the impact of the repurchase of approximately 389,000 shares of common stock in the first quarter of 2022. Totally the non-GAAP EBITDA guidance includes the impact of approximately $30 million to $35 million of cost inflation 2022 as compared to cost paid for semiconductors, other materials and trade in 2020 and remains also unchanged from last quarter’s outlook. As discussed in the prior quarter, the full year 2022 non-GAAP EBITDA guidance also includes around $8 million of integration costs for the FDS Amplicare, ReCept, and MarkeTouch Media acquisitions. And we believe it's well positioned to deliver on the 2025 total revenue growth targets, driven by a number of factors including growing its tech services revenue, the benefits from long term sole source customer partnerships, multi-year co-develop plans, and increased average deal sizes."
}