{
    "symbol": "EMBC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-15 12:01:13",
    "content": " And based on our strong third quarter results and outlook for the remainder of the year, we're raising our financial guidance for constant currency revenue growth, adjusted gross margin and adjusted EBITDA margin for the second half of this fiscal year, while reiterating our as reported revenue growth guidance despite incremental FX headwinds. Given the fact that Embectaâ\u0080\u0099s historical financial results for the pre-spin periods do not include all the actual expenses that would have been incurred had Embecta been a standalone public company during the periods presented, I plan on focusing most of my time discussing Embecta's recently updated second half of fiscal 2022 financial guidance. Despite incurring additional costs associated with standing-up Embecta as an independent entity, adjusted gross margin for the third quarter of 2022 came in strong at approximately 70%, and this was better than we previously anticipated. Lastly, given that approximately half of Embectaâ\u0080\u0099s business is derived internationally, as well as the fact that several foreign currency exchange rates have changed significantly since we initially provided financial guidance for the second half of fiscal year 2022. We based our updated second half of 2022 financial estimates on spot rates that existed near the beginning of August, including a euro to dollar rate of approximately 1.05 for the second half of the year, and approximately 1.02 in the fourth quarter; a dollar to Japanese Yen rate of approximately 131 for the second half of the year, and approximately 136 in the fourth quarter; and a dollar to Chinese Yuan rate of approximately 6.61 for the second half of the year, and approximately 6.71 for the fourth quarter. This comes despite significant fluctuations in various FX rates since we last provided guidance, which we now expect to be a headwind of approximately 4% in the second half of the year as compared to the prior year period, or an incremental FX headwind of approximately 50 basis points as compared to our previous financial guidance. While from a constant currency perspective, I am pleased to say that we are raising our expectations for the second half of the year by 50 basis points, as we now expect to see a decline of approximately 3% during the second half of fiscal 2022 as compared to the second half of fiscal 2021. Given that we only have one quarter left in fiscal 2022, our updated financial guidance for the second half of 2022 implies a fourth quarter revenue amount of approximately $264 million. That said, for the entirety of the second half of 2022 as compared to our previous guidance, our base business is expected to do slightly better, thereby allowing us to raise our constant currency revenue performance expectations. Given the strong results we achieved during the third quarter, we are increasing our expectations from our previous guidance that adjusted EBITDA margin would be in the low-30s, to our current expectation which now calls for second half of the year adjusted EBITDA margin to be in the mid-30s. As we look forward, our updated guidance for second half of fiscal 2022 adjusted EBITDA margin would imply a low-30s margin during Q4, with the expected sequential decline from Q3 to Q4 primarily driven by: Our fourth quarter adjusted gross margin which is expected to be in the low 60s. And as compared to that prior guidance, our business, our base business is doing slightly better than expected, so I think off to a good start and candidly had the contract manufacturing revenue to BD, which we've always said we viewed as sort of transient in nature, had that remained consistent at our prior guide of roughly $15 million instead of now us expecting $10 million in the second half of the year, that would have added another, let's call it, 80 basis points or so to our constant currency revenue performance. So â\u0080\u0093 but all that said, I think weâ\u0080\u0099re very pleased that for the first quarter as a publicly traded company, that we have the opportunity to increase our second half of the year constant currency revenue expectations, and thatâ\u0080\u0099s really all due to slight improvements in that base business."
}