{
    "symbol": "EMBC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-13 14:08:04",
    "content": " Before I discuss the financial results for the second quarter of 2022, I would like to provide some background information and highlight a few items regarding the presentation of financial results for the second quarter and first half of fiscal years 2021 and 2022. Given the fact that Embecta's historical financial results do not include all the actual expenses that would have been incurred had Embecta been a standalone public company during the periods presented, I plan on focusing most of my prepared remarks this morning discussing Embecta's second half of 2022 financial guidance. Beginning with certain key assumptions, unlike the first half of 2022, our second half of 2022 guidance attempts to take into consideration the various costs that Embecta will incur moving forward as an independent publicly traded company. In addition to these contract manufacturing and supply agreement impacts, our second half of 2022 financial guidance also assumes incremental expenses that we will incur because of the lease of our Holdridge, Nebraska facility from BD, as well as additional expense that we'll incur as a result of BD continuing to factor certain accounts receivable on Embecta's behalf. The approximately $555 million of revenue in the second half of 2022 would represent a decrease of approximately 7% on an as-reported basis as negative foreign currency headwinds are anticipated to drive about half of the decline, while constant currency revenue is expected to be down approximately 3.5%. If you could provide a bit more color, just what you're contemplating, specifically US versus international contributions, taking into account both what's going on in Russia-Ukraine, China, lockdowns and then also your decision to step away from certain businesses, just how all of that rolls into your 2H – your back half guidance and then anything you can provide also and how you're looking from  standpoint 2Q to 4Q would be helpful..\n For the second half of the year, for revenue, we would expect to generate somewhere around $555 million. But in the second half of the year, going from the first half of the year, the EBITDA margin, one of the items that is going to be driving it is obviously a very deliberate decision on our part to continue to invest within R&D, but then there are other items, including increased raw material costs and inflation, as well as all the investments that we need to make in order to stand up Embecta. And as we step back and think about sort of the first half of the year to second half of the year adjusted EBITDA margin trends getting into the low 30s in the second half of the year, I would say well over 80% of that sequential movement from the first half of the year to the second half of the year has to do with increased costs to stand up Embecta as its own company, including the impact from the different contract manufacturing agreements. And from a gross margin standpoint, I would say that there's really three main drivers, the first of which I would sort of put in the bucket of kind of business related, that being incremental inflation, raw material and kind of some supply chain increased expenses that we would expect to incur in the second half of the year. And then, the other things that are impacting sort of the first half of the year to second half of the year adjusted EBITDA margin, which, again, I would caution you that the first half of the year isn't necessarily obviously reflective of Embecta as a standalone publicly traded company, whereas the second half of the year, we're certainly trying to take into consideration all the different costs that we think that we're going to incur. Now, all that said being, expecting to be sort of in the low 30s in terms of adjusted EBITDA margin in the back half of the year, that is very, very robust adjusted EBITDA margin, and it's going to allow us really to continue to make all the necessary investments that we think we need to do moving forward to try and get Embecta to a more sustainable top line growth moving forward. I guess the follow-up there is, if I think about those incremental investments, let's say, largely in R&D, that other portion of the incremental increase of second half versus first half, is there any way to tease out even in the roughest sense, those investments that you're making that you would expect to have – and I'm making these timeframes up, but sort of near-term payouts or payoffs or returns like the next 12 to 24 months, balanced versus, say, sort of longer term projects that may play out visibly, maybe on the top line three to four years."
}