{
    "symbol": "FIBK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 18:30:04",
    "content": " We generated net income of $85.7 million or $0.80 per diluted share in the third quarter, which included a $24 million loss on the sale of investment securities as part of some of the repositioning we did in the portfolio, which we will discuss later in the call, another $4 million of acquisition expenses and a litigation related accrual. The combination of active decisioning to position for higher rates through the back half of 2021, a strong acceleration in loan growth and the ability to have excess liquidity, fund high-cost deposit outflows has resulted in our adjusted net interest margin expanding another 46 basis points during the third quarter and is now up 101 basis points over the last three quarters. To help fund our strong loan growth in the third quarter, we added $650 million in overnight FHLB borrowings, which we plan to use as a temporary funding source that can quickly be adjusted based on loan production and deposit flows. And of course, the roughly $5.6 billion of immediately variable rate loans, securities and cash, which is 20% of earning assets at the end of the quarter, will continue to benefit from recent and future Fed rate increases. Excluding investment securities balances, noninterest income declined $2.9 million from the prior quarter to $47.1 million as an increase in our payment services and swap revenue was offset by further declines in mortgage banking and wealth management. Primarily due to the continuation of the unfavorable environment for mortgage, wealth and swap fee income, we have lowered our expectation for noninterest income to be $45 million to $46 million for the fourth quarter, excluding any impact from MSR valuation changes. Our loans held for investment increased $446.9 million, excluding PPP loans from the end of the prior quarter with growth in all of our major portfolios, with the exception of ag and commercial. Strong loan growth and a more conservative economic forecast was partially offset by the improved credit performance, resulting in a provision for credit losses of $8.4 million for the quarter. While our allowance as a percentage of loans held for investment declined a few basis points to 1.21%, our coverage for nonperforming loans increased to 248% at September 30 compared to 201% at the end of the prior quarter. And finally, during the quarter, we repurchased 3.3 million shares of our common stock at $50.49 per share, which completed our previously announced 5 million share repurchase authorization, even so, our capital levels remained strong at the end of the quarter and continue to exceed our internal policy guidelines."
}