{
    "symbol": "FIBK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 15:42:16",
    "content": " Within the legacy First Interstate loan portfolio, as a result of an increase in utilization rate on commercial lines of credit and a strong production levels, we grew our total loans held for investment by roughly 2% alive in the first quarter, excluding PPP loans. Criticized loans from gray Western were down to 655 million at quarter end, and to accelerate the workout process, we transferred 241 million of credits to loans held for sale at the close of the transaction. On a GAAP basis, our net interest income increased by $56.2 million while the growth in our earning, while the growth in our earning assets from the acquisition was a primary driver, so too was the sequential expansion of our adjusted net interest margin as well as the increased contribution from accretion on purchased loans. Our securities yield expanded 23 basis points, which was partially attributable to the repositioning we did after the Great Western investment -- after adding Great Western's investment portfolio, along with higher new investment yields, which were 2.2% in the first quarter. While the unwinding of this practice has zero impact to net income, it will result in both fees and expenses being approximately $13 million higher for the calendar year 2022 or approximately $1.8 million for the first quarter. So with that, our non-interest income increased $11.8 million quarter-over-quarter to $49.2 million, which included a $3.4 million recovery of mortgage servicing rights impairment and a $1.4 million gain on the repayment of Great Western sub debt. Looking ahead, by the fourth quarter of 2022, we expect our run rate for non-interest income to be in the range of $52 million to $54 million, excluding any impact from MSR. This, along with the partial quarter impact of adding Great Western's operations resulted in total non-interest expense of $207.2 million. Looking ahead, as most of the cost savings will not come out until after system conversion, the additional month of Great Western's operations will increase our adjusted operating expense by approximately $20 million in the second quarter. By the fourth quarter of 2022, we expect our quarterly run rate for total operating expenses to be approximately $160 million, which includes approximately $4 million of reclassified expenses related to the realignment of Great Western's accounting practices that I mentioned earlier. Excluding the addition of Great Western, the legacy First Interstate loan portfolio increased $37 million, excluding PPP loans from the end of the prior quarter, primarily due to growth in the commercial loan portfolio. Our investment portfolio increased by approximately $3 billion from the end of the prior quarter, largely due to the securities added from Great Western. Outside of those charge-offs, we recorded approximately $15 million of net charge-offs on loans acquired from Great Western, most of which were specifically reserved and taken in anticipation of restructuring these loans in future quarters. We recorded $68.3 million through the loan loss provision on non-PCD loans from Great Western, which was partially offset by a release of reserves on the legacy First Interstate portfolio. The fourth quarter run rate expectations of $160 million, I'm a little surprised that, it won't be lower than that given all the cost saves that are still yet to come, $56 million on an annualized basis. The $31 million that you're referring to relates to the TDRs that we're anticipating doing over the next couple of quarters, so we rightsized some loans in the first quarter."
}