{
    "symbol": "FIBK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 17:39:04",
    "content": " Our fourth quarter performance capped off a very strong year for the company as we executed well on the integration of our merger with Great Western, realizing cost synergies we projected for the transaction while continuing to generate solid organic loan growth throughout our footprint. While these items had a $0.07 impact on earnings per share in the quarter, we continued to execute well and saw continued positive trends in our loan growth, core margin expansion and asset quality. Again, excluding purchase accounting accretion, our adjusted net interest margin increased by two basis points to 3.49% from the prior quarter, driven by a favorable shift in our earning asset mix and an increase yields on loans, investments and cash. As you have likely already noted with strong loan growth and deposit outflows, we increased our use of short term borrowings in the quarter, which ended a little over $2.3 billion. As noted on Page 14 of the investor debt, cash flows off the securities portfolio should mostly fund loan growth from here, but the higher balances of wholesale funds to start the quarter will mean we will see some compression in our adjusted net interest margin in the first quarter. Our total non-interest income increased $18.7 million quarter-over-quarter to $41.6 million, primarily due to the loss on investment securities realized in the third quarter. Moving to total non-interest expense, while it was a little messier this quarter than anticipated, on a run rate basis, we landed where we expected in the range of $163 million to $165 million. Net of these items, non-interest expense was $163.7 million and our run rate efficiency ratio would be closer to 53% in the fourth quarter, which by definition would also exclude the $4.1 million of intangible amortization expense. For the full year 2023, we expect operating expenses to increase in the 3% to 4% range from the full year 2022 expense base of about $647.1 million, excluding merger expenses. Moving to the balance sheet, our loans held for investment increased $496 million from the end of the prior quarter with growth in all major portfolios with the exception of construction and commercial. Strong loan growth and qualitative additions related to a more conservative economic forecast push our funded allowance up by $7.1 million from the prior quarter, resulting in a modest increase to our ACL to 1.22% and an increase in our coverage of non-performing loans, which now stands at 3.3 times. And, Jared as far as the 6.47%, if you -- we talked all year about the fourth quarter kind of base run rate to be around $160 million or $161 million."
}