{
    "symbol": "LFUS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 15:51:14",
    "content": " Your line is open. We've talked openly about the fact that the more challenging in transportation, particularly the passenger car side of our business where it's difficult to pass those along in multi-year contracts, so we've been able to pass along some costs and will get further gains on that as we move forward in the next couple of quarters, pricing in the passenger car side of things. Your line is open. Your line is open. Your line is open. And also, if you could just remind us, say, I think mid-teens EBIT margins as how you think about the transport business longer-term, just wanted to confirm that that's still the case given sort of the outgrowth opportunities you've referenced. So we definitely have to see some volume growth come back in a more meaningful way and then the other thing that's also weighing a bit on the margins a little bit is just the Carling acquisition and as we continue to drive synergies there, that's going to help us and that's going to move that trajectory back to our target of the mid-teens. But I would say while we're seeing really strong performance and outgrowth within our traditional transportation definition from a segment perspective, we're also seeing dramatic growth coming from our electronics products into vehicles, and that's driven by the electronification, but it's also driven by electrification as well like some of the technologies that we apply to EV applications. So that's really led to an uptick if you will in the outgrowth performance and the good news is design wins we're seeing this year and have been winning over the last couple of years, make us feel pretty good about continuing to be able to see that double-digit outgrowth. Your line is open. So maybe a couple of things, one, you highlighted one of the things that I mentioned, it's quarter-on-quarter Q2 to Q3, definitely the stronger dollar impact and we've talked about this in the past, but definitely impacted this segment the most, especially in the automotive part of our transportation segment and so that was a 200 basis point impact, largely with the Euro just because of the global footprint that we have across that business, so that's - that would be part one. So the combination of just production coming down, call it a 100 basis points plus our sales volume being a little bit lower even though our content outgrowth story still holds true, in the near-term we're going to see some lower sales with the combination of that, that's also impacting margins. Your line is open. What I talked about, I'd say the past four or five quarters as you noted is the fact that our Electronics segment, given volume - given the volume growth that we've seen giving - given a lot of the price work that we're doing and especially because a lot of that segment was going through distribution and then pricing, we're able to adjust and align pricing faster to market conditions as you're going through distribution. So for us, as we think about margins even at that level, it's a bit dilutive to Company margins, it's a bit dilutive to Electronics segment margins, we think where the opportunities are to grow the margins will be, A, on growth for a lot of the reasons Dave mentioned topline growth as we go through there, and also just as we consolidate it within our business there's always cost structure improvements that we can do. Your line is open. Your line is open."
}