{
    "symbol": "TPL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 15:08:06",
    "content": " I would now like to introduce your host for today's call, Shawn Amini, Vice President, Finance and Investor Relations. Yesterday afternoon, the company released its financial results and filed its Form 10-Q with the Securities and Exchange Commission that's available on the Investors section of the company's website at www.texaspacific.com. As a reminder, remarks made on today's conference call may include forward-looking statements. For a more detailed discussion of the factors that may affect the company's results, please refer to our earnings release for this quarter and to our most recent SEC filings. Please also note, we may at times refer to our company by stock ticker, TPL. This morning's conference call is hosted by TPL's Chief Executive Officer, Ty Glover; and Chief Financial Officer, Chris Steddum. All of TPL's major revenue streams reported double-digit percentage growth on a sequential quarter-over-quarter basis, the total consolidated revenue growing 20%. Adjusted EBITDA of $158 million represents a new corporate record, and our adjusted EBITDA margin of 90% demonstrates our continued focus on maintaining a lean cost structure in generating high margins. During this most recent quarter alone, we returned over $200 million back to our shareholders in the form of dividends and share buybacks while still maintaining a balance sheet with 0 debt, retaining nearly $400 million of cash. Although our royalty production came in slightly lower sequentially, this quarter is a great example of the resiliency and the numerous high-quality revenue streams the company benefits from beyond just oil and gas royalties. Source water revenues were up 18%, reduced water royalty revenues were up 26% and revenues for surface leases, easements and materials, which we refer to as SLEM, were up 52%. SLEM and source water sales, in particular, are generally good leading indicators for royalty production with the increased business activity this quarter, providing confidence that we'll continue to see strong development on our royalty acreage. On the source water side, sales volumes increased 40% sequentially with increases across all the major channels, brackish, brokered and treatment. Due to high water demand, we have increased our CapEx budget to accommodate new frac ponds, tanks, pipes and pumps. We're still observing some operator supply chain issues in the field, so they do seem to be easing slightly. However, excess DUC balances appear close to depleting, and we're now seeing some friction and delays related to scheduling as operators try to manage quick turnaround timing and finishing new spuds in advance of plant completion. On the produced water side, increased revenues were largely driven by higher volumes from new tie-ins and overall increased injection demand. For the last couple of years, performance in that business has been flat as operators generally concentrated development around existing infrastructure. However, in the second quarter, we saw broad strength in SLEM with meaningful higher demand for new surface, subsurface wellbore easement, pipeline easements and caliche. The outlook for the oil and gas industry remains promising, and our shareholders should continue to benefit from the free cash flow afforded by ongoing development in the Permian and high commodity prices. That said, at TPL, we're also excited about the future beyond just oil and gas. Milestone team is amongst the best in the industry, and we look forward to working with them in potentially bringing more carbon capture opportunities to the Permian. On the ESG front, we have posted updated 2021 data on our website with reduced Scope 1 and Scope 2 emissions by 6% year-over-year, and we hope with our continued electrification and efficiency efforts, we can improve that further. Board has approved a proposal to amend the company's charter to declassify the board, which will be included in the proxy materials for the company's 2022 Annual Meeting. We're pleased to see our Board make progress on this item, and we look forward to hosting our annual meeting this upcoming November. Without their dedication, hard work and talent, this outstanding performance we've had across the entire business would not be possible. With that, I'll turn the call over to Chris to discuss our quarterly results. Total revenue for the second quarter of 2022 was $176 million, which was driven by double-digit percentage increases across all of our major revenue streams on a sequential quarter-over-quarter basis. Second quarter royalty production of 19,800 barrels of oil equivalent per day did come in slightly lower compared to last quarter, though oil production was slightly higher at approximately 8,900 barrels of oil per day. Commodity price realizations continue to be excellent as each oil, natural gas and NGL price realizations increased by double-digit percentages sequential quarter-over-quarter, which we fully benefited from as we are still completely unhedged. As Ty alluded, the strong performance in water and SLEM are encouraging data points as we look ahead to the second half of the year. To elaborate a bit more on the outlook, our well inventory data is also aligned in what we consider to be a positive trajectory for the overall business. We averaged approximately 70 gross spuds per month year-to-date through June, which represents an approximate 37% increase compared to the 2021 average of approximately 55 gross spuds per month. However, we do maintain a higher-than-normal inventory of completed but unproductive wells, and we expect these to turn to sales once those wells are tied in. Our $100 million buyback authorization was active during the quarter, and we repurchased approximately 17,000 shares for approximately $26 million. We continue to evaluate our capital allocation priorities and with a large cash balance and a business that continues to generate robust free cash flow, we retain a tremendous amount of flexibility as we look to maximize shareholder value. Look, I would just say that's very promising usually when we see a ramp in SLEM, that operators getting prepared for additional development in those areas. I would also say that the additional revenue we saw this quarter in that business line was spread out kind of over surface -- wellbore easements, pipeline easements, electric easements, material sales. So look, we've got a team -- part of our BD team internally is dedicated to just seeking out next-gen opportunities. So with the bitcoin mining deal with Mawson and JAI, I think Mawson recently put out a press release back in May that, that facility would be operational by Q4 of '22. I mean, obviously, like a material sale is a onetime event, but we continue to see strong material sales. As far as the pipeline easement itself, most of those return easement a lot of well connects, gathering lines being put in place. So rather than like a big onetime long-haul perpetual easement like we've seen in the past, most of this has been recurrent revenue. So if you look at like our original budget, it was kind of in that $12 million to $14 million range. So that additional capital is going to go towards things like frac ponds, treatment tanks, some additional pipe to accommodate that demand and not just 2022 demand, but also just kind of in preparation for 2023 demand. No, I mean it's -- I don't know exactly what that time line looks like. But as far as what that time line looks like, I don't have a good answer for you there. Part of that strategy is evaluating potential acquisitions, not only on the mineral, but things to look at potential surface and water acquisitions as well. And by low -- sorry, just to clarify sort of like sub-1x or 1.5x? I don't think we've specifically talked about a number, but -- and I'm not sure I'd be comfortable giving exact guidance on that because when you're talking about theoretical things, it's always difficult. But I think we would be on the lowest end of what you would see out there, which is kind of where we sit today anyway, so. I mean, Chris, that's a difficult thing to say. I mean as we said, like even just on the carbon capture, they're evaluating the viability right now. And so until some of those studies are completed, I think that's a very difficult thing to project. But look, I would say stay tuned, we'll give more information as it becomes available. But the team is working very hard to procure new revenue streams on the surface, and we think they're going to bear fruit."
}