{
    "symbol": "AJG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 23:13:02",
    "content": " Acquisition rollover revenues were $107 million, and our adjusted EBITDAC margin was 31.3%, up 120 basis points and in line with our December IR Day expectations, another excellent quarter for the brokerage team. Our U.S. retail business posted 8% organic, our new business was a bit better than last year offset somewhat by less nonrecurring business, client retention and the combined impact of rate and exposure were both similar to last year's fourth quarter. Overall, global fourth quarter renewal premiums, that's both rate and exposure combined, were up more than 9% that's consistent with the 8% to 10% renewal premium change we have been reporting throughout '22. But it's worth noting 4 additional trends within property cat: First, attachment points were raised broadly; second, reinsurers pushed to remove prepaid reinstatements from some contracts; third, reinsurers, in some cases, were able to reduce coverage to named perils only; and fourth, top layers of many programs saw the largest percentage increases as reinsurers sought to push up minimum premium rates. So putting it all together, Gallagher Bassett finished the year with an adjusted EBITDAC margin of 18.5% and 13.3% organic benefiting from increased claim activity coming out of the pandemic and some really nice new business wins. It is the culture that drove full year '22 results for our combined Brokerage and Risk Management segments of 24% growth in adjusted revenues, 10% all-in organic, 25% growth in adjusted EBITDAC, adjusted EBITDAC margin in excess of 32% and 20% growth in adjusted EPS. So 11% headline organic, 10% controlling for 606 and 120 basis points of margin expansion, that's a terrific quarter. Another P&C CEO suggested he didn't see as much increase in property rates in the fourth quarter as you might have expected in light of the reinsurance market dynamics, but maybe that's something that builds up as the time goes by is the higher reinsurance rates do directly impact the carriers."
}