{
    "symbol": "AJG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 21:57:10",
    "content": " For our combined Brokerage and Risk Management segments, we posted 15% growth in revenue, 8.4% organic growth, net earnings growth of 12%, adjusted EBITDAC growth of 15%, and we completed or signed 7 mergers in the quarter totaling about $60 million of annualized revenues. Our U.S. retail business posted 9% organic with strong new business and solid client retention, both consistent with last year's third quarter. New business was strong at more than 27% of prior year revenue, and retention was consistent with last year's third quarter. Looking forward for the fourth quarter, we believe organic revenue growth will be about 10% and adjusted EBITDAC margins between 18.5% and 19% that would close out a great year for the Gallagher Bassett team. While that was about right for our third quarter, we posted 32.3%, which was in line with our IR day guidance and we are still comfortable with our fourth quarter outlook of around 125 basis points of margin expansion relative to the FX adjusted fourth quarter '21 EBITDAC margin. As we look ahead to '23, we continue to expect margin expansion next year starting around 4% or better organic growth, call it, maybe 50 basis points at 6%. Another fantastic quarter and 9 months is in the books, another strong outlook for the fourth quarter, and it's looking like we're well positioned for a terrific year in 2023. I think that when we look at 6% organic growth with possibly 50 basis points of margin expansion, that does not include a possible upside from incremental investment income, but not all that incremental investment income will likely hit the EBITDA line. So I wanted to go back, Pat, to your comments about the reinsurance market and the reinsurance business and sort of unpack what's going on and get your perspectives because it really feels like we're at the seminal moment in that marketplace where we could be in a hard market, especially for cat-exposed property, but it seems like it's bleeding over into other lines."
}