{
    "symbol": "AJG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-01 09:49:06",
    "content": " The timing of the large life case and covered live changes in the second half of '21 will cause the Benefits business to post lumpy quarterly organic results this year, but that doesn't change the still favorable underlying environment. As we sit today, we're still seeing third quarter around that 8%, reflecting about 1 point of that tough benefits compare, and we're becoming more bullish in fourth quarter, call it nicely over 8% in the fourth quarter. So you see that kind of in first quarters when you go back over the last few years that maybe rate increases aren't quite as big as they are in later quarters because you get -- for the carriers, they get the full year of the premium in the books by being maybe a little bit more competitive in the first quarter. I know you said you're still -- you haven't fully closed the books on clean coal, holding on hope that maybe you do see some extension come through in D.C. Well, it's a 742 page draft bill that we're doing a lot of word searches on it. I'm not seeing how it's in that, but if you get into the kind of vote-a-rama in the Senate next week to see what other senators might want to include in the package or look at it, I think that -- we're never out of it until -- we're not. So I guess, maybe just switching gears, if I think about, if we do see a slowdown in next year, I guess one thing that I've noticed the past couple of quarters in the press release sort of in the fine print, there's been mention of office consolidations. I think we're harvesting maybe about $8 million a year on that effort, and there's a couple of big office footprints that are coming up here in the next year that I think that maybe will be a little bit more on that over this next year. So I think that -- I think as business... And Greg, you heard us say that of all the lines of cover right now that are adjusted by Gallagher Bassett where comp is still one line that's not -- and it's our core business in the U.S. is not back to prepandemic claim counts. But as a recession -- as there was an onset of recession that claim counts -- workers' comp claim counts actually increase as more employees sharing the worst would slip and fall in advance of actually facing the Grim Reaper, I don't know if that's something that is... That as workers' comp premium rates increase, and we're not fully into big jumps in workers' comp."
}