{
    "symbol": "WSR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 11:55:03",
    "content": " Joining me on todayâ\u0080\u0099s call are Dave Holeman, Chief Executive Officer; Christine Mastandrea, Chief Operating Officer; and Scott Hogan, Chief Financial Officer. Please note, that some statements made during this call are not historical and may be deemed forward-looking statements. Actual results may differ materially from those forward-looking statements due to a number of risks, uncertainties and other factors. Acknowledging the fact that this call may be webcast for a period of time, it is also important to note that this call includes time-sensitive information that may be accurate only as of todayâ\u0080\u0099s date, November 2, 2022. I will now turn the call over to Dave Holeman, our Chief Executive Officer. First is the third quarter of 2021, our revenue grew over 9%, our FFO per share is $0.24, up from $0.22. Same-store net operating income increased 4.5%, and is up over 8% for the nine months of the year. Our total occupancy is 92.5%, up 260 basis points from Q3 2021 and 100 basis points from the second quarter. As of the end of the third quarter, our net effective annual base rent per square foot was $21.73, up 6.5% from 2021. Specifically, since I was appointed, we're a 100% focused on our core business and on executing the company's strategic plan. We have delivered $0.80 FFO per share year-to-date and we are narrowing our 2022 guidance range to the upper portion of the range, making our new target $1.00 to $1.02 per share. Following that, we'll take additional questions from the audience on our call today. Let's start with what we've already accomplished, as we've done a tremendous amount in a short amount of time. We are at Target for an over 16% year-over-year FFO per share growth and we just delivered record occupancy of 92.5%, but our accomplishments extend well beyond just the earnings achievement. Numerous governance actions have been taken, including splitting the Chair and CEO roles, the removal of the poison pill, approval of shareholder access to bylaws, and Board refreshment with the addition of Amy Feng. Furthermore, we extended our credit facility and set the company on a path to divest of our JV investment in Pillarstone Capital REIT operating partnership. So we are pleased with what we've accomplished so far, but additional opportunities still exist to improve. We need to demonstrate that we're the best at operating community connected centers with a well curated mix of 2000 to 3000 square foot spaces occupied by vibrant, successful businesses. We are pleased with the progress we're making in growing our occupancy level, which I believe is the result of the numerous actions we have taken so far in 2022. Upon taking the CEO role, we immediately began to engage with our various stakeholder groups to truly understand the issues and take steps to focus the business on maximizing long-term value for shareholders. As I stated in my first earnings call, we know this begins and ends with high quality leasing. First, we made additional changes in the executive leadership team to achieve alignment with the investment community. Specifically, we streamlined and strengthened the regional leasing and property management teams providing clear goals and priorities, eliminating micromanagement and allowing for faster and better execution. Third, we began the process of restoring our relationships within the real estate community, especially with the brokers which has dramatically increased our transaction flow. Importantly, we've improved morale throughout the company by giving employees more effective tools for success and clear objectives that were aligned with the management team, which is resulting in greater productivity. There has never been a better time for our strategy, our tenants, our properties, and our team to drive results and create value. Staying with occupancy, let me turn to Christine for a couple of questions. Well, we'll address our 2023 occupancy growth target with the Q4 call. However, I think it's important to note that occupancy is an outcome. Our focus is designing the right centers, the tenants that are adding value to the community and that bring in quality of revenue. We target tenants who can increase traffic, successfully serve the community and compliment co-tenants. In order to grow rental rates we seek out successful tenants, not just fill the space. I should also point out that this quarter for the first time, we broke out our occupancy between greater than 10,000 square foot spaces and those 10,000 square feet and under. Our 10,000 and under square foot occupancy, which is our core competency, was 90.1% for the quarter and we believe still has substantial room to increase. One of the additional trends we are seeing is that as the workforce reduces its orbit around the office buildings, demand in our local centers is increasing and we're reaping those benefits. Our 260 basis point, year-over-year occupancy improvement reflects not only that environment, but the momentum we have found from making the changes Dave walked you through. This strength runs throughout our tenant categories, including fitness, restaurants, education, medical, and is a point of reference to the quarter -- during the quarter we signed 86 leases representing 219,000 square feet and $29 million in total lease value. The third quarter was 25% higher on a square foot basis and 56% higher on a total lease basis and year-to-date with 56% higher on a square foot basis, and 96% higher on a total lease value basis. Moving with recent trends, we opened two Asian barbecue  and hot pot  restaurants this quarter, bringing the total within our centers up to six each in a different location. We think these perfectly fit with the growing affluent communities focused on casual economic, family dining experiences with the communal component. Like all of you, we are watching for signs of a market downturn, but that's not what we're seeing. If that should change, we believe staying true to our strategy of leasing to growing businesses such as services and restaurants and focusing on quality of revenue on highly desirable sunbelt markets will allow us to effectively weather a range of economic environments. A great example of the value of our centers we operate is that our FFO per share was off only 8% between 2019 and 2020, which was very strong in performance against our peer set. In the current environment, it means we need to focus on recurring earnings, activating non-income producing land parcels and recycling assets to fuel growth. On the acquisition side, we are actively seeking well-located, value-add properties that will meet our dual criteria. The current transaction market is shallow and disconnected with the rising costs of capital, so patience and discipline are doubly important. Also, the amendment allowed us to lock the interest rate on 82% of our debt. Looking at the forward sofa  curve at our current debt level, we anticipate the fourth quarter of 2022 will have $1.3 million higher interest expense versus the third quarter. In the interest of time, I'll just highlight one or two. If you're looking for a company paying low cap rates for grocery anchored centers or operating power centers with big box and soft good tenants, that's not Whitestone. We believe needs based centers that serve thriving communities on a daily basis with quick serve and family restaurants, fitness, medical, and educational offerings can effectively anchor a center and deliver higher rents. And we believe those centers combined with great locations, in high income neighborhoods, in high growth Sunbelt locations are better designed to outperform in all economic cycles. Our average base rent for spaces 10,000 square feet and under is $25.34 versus $13.58 for larger spaces. In a properly designed center we believe the tenants in the 2000 to 3000 square foot range provide higher profitability and less risk, especially giving the expense and timing of switching out a larger space and the restrictions and approval rights that often are contained in these larger tenant leases. Maybe just some color on the leasing pipeline, I'm hearing a lot more in national tenants taking smaller spaces than typical. Fitness, as we talked about last quarter, is still strong, whether it's franchises or national brands expanding. And in addition to that, it would say that health, beauty and wellness is still, and there's so many new iterations of health, beauty and wellness coming out. So we're seeing a new -- a lot of new types of product out there and it's coming from both the east and the west coast, so usually the new ideas start there. And I think along the lines of, as I mentioned earlier, I think there are, you see some of these new trends. So for example, the Korean hot pot and barbecue restaurants, we've opened six this year and they're all from -- each one of them all six, two in Dallas, one in Austin, three in Houston coming in, and all again, strong regional brands opening up in our locations. If you look at our properties, we -- we've always said we focus on those 2000 to 3000 square foot space tenants and we're really well positioned. So much that about the brand and also creating the opportunity for amenities for the workforce to come back, and thatâ\u0080\u0099s been a unique move too. And those spaces have actually been a little bit larger than the norm, so theyâ\u0080\u0099re closer to 3000 in some cases. Weâ\u0080\u0099ve had a couple of spaces fill up at around 4,000 to 5,000 square feet. Dave, maybe a broad question for you, pretty significant opportunity to do some development/ redevelopment opportunities within your portfolio, and I know you get a pretty significant return on that. We are going to look to take actions that drive earnings growth, but also that improve our balance sheet. So I think as we look at opportunities, there are, I believe in our deck we posted for the call, thereâ\u0080\u0099s a slide on that, but we have pad sites, we have redevelopment opportunities, and then we have some land parcels within the portfolio that have been with us for a number of years that weâ\u0080\u0099re going to look to activate and create income. None of that happens overnight, but I will tell you that we as a management team are focused on those opportunities and delivering those consistent with our goals of driving earnings growth and improving the balance sheet. There is some litigation involved in that, so I canâ\u0080\u0099t comment a whole lot on it, but be assured that Whitestone is focused on taking actions that are in the best interest of our shareholders. There is no -- nothing other than that in our focus, but we do believe that the Whitestone exiting those, that partnership, monetizing our investment and then looking to reinvest that back in the business is the right thing for our shareholders. So not any update, Mitch, other than saying we are focused and taking the steps to monetize that investment for Whitestone and looking to do that in due course. Iâ\u0080\u0099ll just start by mentioning that the vast majority of our leases are triple-net leases, meaning that we recover our common area expenses, real estate taxes and insurance costs from our tenants. And Iâ\u0080\u0099ll also mention that over the last few years, our recovery percentage has been in the mid to high 80s, and we, that should move up along with our occupancy as our occupancy increases from one quarter to next. And the utilities typically are the highest in the summer months, which is the third quarter in Houston and well just in Texas and in Arizona. But if you take a look at the operations expense just as a percentage of revenue on a year-to-date basis, itâ\u0080\u0099s around 18% so far this year, which is the same as it was in 2021. In your prepared remarks, you talked about lowering leverage long-term as one of companyâ\u0080\u0099s goals. If you look at our debt leverage this year, I think for the nine months weâ\u0080\u0099re down to debt-to-EBITDA of 7.9, thatâ\u0080\u0099s down from above 9 a year ago. Weâ\u0080\u0099ve set a target of, I think, seven turns by end of 2030, and we expect to be down into the 7s by end of this year. Second question on your G&A, you guys lowered the G&A guidance for 2022. We, so in the, this is Scott, in the first quarter, we did have $0.04 of non-recurring G&A savings associated with the exit of some of the existing executives at that time. We may have some puts and takes in legal costs associated with litigation with our ex-CEO and with Pillarstone, but I do expect the G&A savings to continue. I believe earlier in the year you mentioned that you were looking at selling some assets potentially in the back half of the year, perhaps recycling $50 million. And I know you discussed sort of more challenging market conditions for transactions, but Iâ\u0080\u0099d be curious, at the time you thought youâ\u0080\u0099d be able to get a pretty, meaningful cap rate arbitrage. Thereâ\u0080\u0099s less deals in the market right now, obviously lots of dislocation potentially between bid and ask, but we are progressing on our recycling efforts and really look forward to sharing that with you probably next quarter as we move to closure. So I think we had identified a small amount, a target of around $50 million in dispositions and then, obviously looking to redeploy that. Weâ\u0080\u0099re finding 1031  money thatâ\u0080\u0099s out there still, so this little bit smaller assets are still in the market. Weâ\u0080\u0099ll have more to share on that on the coming months, but we are on track with what we said we would do this year and look forward to sharing more details. On the dividend, I think right now youâ\u0080\u0099re paying out about 50% of FFO which is quite a bit below where it was prior to the pandemic. But I think when we look at the dividend weâ\u0080\u0099re looking at obviously our tax requirement as a REIT, as one of the key criteria. Weâ\u0080\u0099re looking at capital allocation, as Scott said. We do think thereâ\u0080\u0099s room to grow the dividend in sync with our earnings growth, but I think weâ\u0080\u0099re comfortable with our dividend level. Weâ\u0080\u0099ll continue to monitor the taxable income, and then weâ\u0080\u0099ve got some great opportunities as well for some of the development opportunities that will create a lot of value. I think when we think about the dispositions and the investment in Pillarstone, I think of that as just available capital that we can redeploy in a way that creates more value. So I think when you look at our opportunities, many of the development, redevelopment pad side opportunities, we can fund from organic cash flow as well as a little bit of recycling. A couple of those potentially are putting some residential in line with the retail, but weâ\u0080\u0099re looking to continue to move forward on those. But most of our development opportunities, the smaller ones, we can do from our organic cash flow, not a lot of capital needed. I think what we do is just like you would do with a stock portfolio, we look at all of our holdings and we determine which ones we can, itâ\u0080\u0099s the right time to monetize. It is outside of our footprint, but itâ\u0080\u0099s a very well operating center, but it is under consideration as well."
}