{
    "symbol": "WSR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 10:06:09",
    "content": " Versus the second quarter of 2021, our revenue grew over 14%, FFO per share is $0.25 per share up from $0.24, same-store net operating income increased 8%, total occupancy is 91.5%, up 150 basis points from Q2 2021 and up to 50 basis points from the first quarter. First in terms of strategic consistency, our focus has been on well located necessity-based retail centers located in high household income neighborhoods in the best submarkets in the fastest growing MSA and today our portfolio is located 99% in the top markets in the Sunbelt. The qualitative reasons behind these impressive leasing spreads on slide three depict our strategy that we have pursued over the last decade and positions us well to benefit from the trends that have been emerging the last few years primarily, demand for smaller spaces continues to increase, especially in the 2000 square foot range, convenience, necessity and service are ever more critical to our customers, and cannot solely be replaced with an online presence that are optimized by a combined brick-and-mortar strategy. I think the -- we expected the first part of the year to yield higher same-store results, because we were still in a recovery mode from COVID to the first few quarters, and by the time we got to the back half of the year, we started to see improved collections, our occupancy ended up with record leasing, and by the time we got to the end of the year and since. Christine wants to add anything, she may not, but we have -- within the portfolio, all I will say is, as weâ\u0080\u0099ve acquired assets over the years, sometimes weâ\u0080\u0099ve picked up land parcels, sometimes you picked up a little extra parking field and weâ\u0080\u0099re working internally to look for pad side opportunities, development opportunities and really getting those starting to plan up so they can contribute to our earnings over the coming years."
}