{
    "symbol": "PSMT",
    "quarter": 1,
    "year": 2023,
    "date": "2023-01-10 14:00:06",
    "content": "   Operator: Good afternoon, everyone, and welcome to PriceSmart, Inc.'s Earnings Release Conference Call for the First Quarter of Fiscal Year 2023, which ended on November 30th, 2022. Thank you, operator, and welcome to the PriceSmart earnings call for the first quarter of fiscal year 2023 that ended on November 30, 2022. In the Caribbean region, where we had 14 clubs at quarter end, total net merchandise sales increased 12.9% and comparable net merchandise sales increased 6.6%. In terms of merchandise categories, when comparing our first quarter sales to the same period in the prior year, our foods category grew approximately 6%, our non-foods category grew 1% and our other business category grew 10%, primarily from our food service and bakery departments. In total dollars, total gross margin increased $15.5 million or approximately 10.3% versus the same quarter of the prior fiscal year. Net income for the first quarter of fiscal 2023 was $32.9 million or $1.5 per diluted share compared to $30.5 million or $0.98 per diluted share in the comparable prior year period, which included a $0.05 gain from the sale of Aeropost. From a cash flow perspective, net cash provided by operating activities totaled $30.5 million for the three months ended November 30, 2022 and net cash used in operating activities totaled $13.3 million for the same prior year period. Shifts in working capital generated from changes in our merchandise inventory and accounts payable positions for the three months ended November 30, 2022 contributed $29 million of cash flow compared to the same period of the prior year. Net cash used in investing activities increased by $9.4 million for the three months ended November 30, 2022, compared to the prior year, primarily as a result of a net decrease in proceeds from settlements of short-term investments. And net cash provided by financing activities during the quarter increased by $13.5 million primarily due to the $16.7 million increase in long-term debt proceeds, partially offset by net repayments of $4.3 million of short-term borrowings, compared to the same three month period a year ago. During the first quarter of fiscal year 2023, our private label sales represented 25.9% of our total merchandise sales, that's up 230 basis points from 23.6% in the comparable prior year period of fiscal year 2022."
}