{
    "symbol": "TGAN",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-12 17:21:07",
    "content": " We strengthened senior operations, sales and marketing teams with seasoned industry leaders; secured ARPA-E program to innovate on Transphorm's unique bidirectional GaN technology that replaces 2 to 4 silicon devices with a single FQS GaN in applications like microinverters and motor drives; secured the approval for the wholly foreign-owned enterprise in Shenzhen, Chinato enhance the local customer support, sales, field applications and marketing; we expanded package offerings by adding in industry standard PQFN products, which enable pin-to-pin with multiple sources. We have continued our leadership in high-power GaN, continuing shipments of products for multi-kilowatt systems serving the gaming, energy, server computing and blockchain as well as industrial power market segments. Overall, with approval, performance and design benefits of TGAN over competing solutions and leadership in high power, backed by the strong application-based patent portfolio, we remain well positioned to address the $3 billion GaN TAM in diverse areas like servers and communications, blockchain computing, gaming, energy and electric vehicles, 2-wheelers, 3-wheelers, 4-wheelers, while also allowing for growing our share in the lower-power fast-charger adapter segment. Transphorm is in a unique and differentiated position among the GaN suppliers with our one core platform strategy that spans a wide range of power spectrum with products in the market today that address a tremendous multibillion dollar market opportunity for GaN power conversion, again, from low power adapters and chargers to high-power server, blockchain, datacom power to industrial, energy and PV inverters, renewables that we are already ramped in all of these areas. While there is a very significant high power and low power growth that I talked about, now on Slide 10 here, we show that EV applications continue to present a massive long-term opportunity as the performance of GaN enables continued performance of EVs, addressing fundamental issues of power loss, heat generation and anxiety of range with the high-power density delivered by GaN -- TransphormGaN enabling things like faster charging, we reduced size and lower losses that ultimately results in higher range. Our 1,200-volt gallium nitride platform today in R&D has delivered early results already showing efficiency similar or even higher to silicon carbide in the multi-kilowatt range and built on a simple architecture, not requiring any fancy designs like vertical GaN structures, for example. With our continued leadership in high power at 65% of product revenue this quarter and continued penetration in low power, we have modestly exceeded consensus estimates, delivering $3.7 million of revenues, including $3.2 million of product revenues, while also dealing with some of the supply chain and capacity challenges that we faced."
}