{
    "symbol": "TGAN",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-15 23:44:06",
    "content": " We are pleased to report TGAN's 10th successive quarter of product revenue increase with product revenues well over $1.4 million, a 100% plus year-to-year increase and a total revenue of $5.2 million in the quarter, a 60% year-to-year increase and in line with consensus analyst estimates amidst what is continuing to be a challenging supply chain environment and COVID related shutdown slowdown in Asia still lingering on. An additional example of our high power leadership include the release of our surface mount, high-power D2PAK industry standard package and continued adoption in Hiral applications like the Japanese Nayuta Medical power supply, where TGAN enabled 73% loss reduction in a fanless design. Overall, with the proven performance and design benefits of TGAN over competing solutions, and the leadership in high-power GaN with strong application based patent portfolio, we remain very strongly positioned to address the $3 billion GaN TAM in diverse areas like servers and communications, Blockchain computing, gaming, energy, in orders and electric vehicles, two wheelers, three wheelers, four wheelers while growing our share in the lower powered fast charger adapter segment. TGAN is an established innovator and design pioneer, a leading manufacturer, supplier of high voltage GaN power semiconductor products over the widest range of application from 30 watts low-power to over four kilowatts high-power, and in applications ranging from adapters and fast chargers to high-power data centers, mining, communication infrastructure, broad industrial renewables, and design-ins for automotive, a result of our solid core investment strategy and focus. Our comprehensive and differentiated product offerings, backed by high quality manufacturing base that we essentially own has ramped in the market with over 60 billion field hours now in our customers product, including both high-power and low-power GaN again and resulted in over 24 million in revenues in FY 2022 in spite of a challenging supply chain environment. TGAN is in a unique and differentiated position among the GaN suppliers today to have products in the market that address a multibillion dollar market opportunity for GaN, the GaN TAM for power conversion, from low-power to high-power, adapters and chargers, power servers, data servers, Blockchain, data comm that we are already ramped in to industrial energy and PV inverters, renewables now also in production with TGAN parts with our customers. While packaging is done with some of our valued offset partners, we bring TBH a Transphorm IP in this design, for example, allowing GaN to be efficiently used in robust PO packages designed by high-power customers something that is not easy for other gallium nitride providers to do. Electric vehicle applications continue to present a massive long-term opportunity as the performance of GaN enables continued performance of electric vehicles addressing fundamental issues of power loss, heat generation, and range anxiety with high power density enabled fast charging, reduce size, and lower losses possible with GaN that ultimately results in faster charging and higher range. We did this by satisfying existing demand and creating new wins like a foray of high voltage GaN products in the medical field with the debut of endless power supply and revenue from the gaming power market, evidenced in one way by the third-party tear down Asus 1.6 kilowatt GaN gaming power supply. The Phihong provides a strong proof point for this disadvantage of TGAN, the high power market continues to be strength of TGAN, as we added various diverse applications this quarter along with satisfying existing demand. TGAN's focus remains in three key areas, one, capacity expansion and supply chain management, keeping up with and then next year staying ahead of demand, two, expanding our leadership in high-power GaN including opportunities to diversify our high-power base to better address market cycles, as well as accelerate EV revenues time to market and three with our fundamental better product value proposition, continue to gain share in the adapter and charger market."
}