{
    "symbol": "KTCC",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-31 20:32:04",
    "content": " The gross margin in the second quarter of fiscal 2023 was adversely impacted by business interruption and other operational losses related to storm damage in our Arkansas facility, as well as by preparations for expected sales growth in the second quarter and increased labor costs in both the U.S. and Mexico. At the end of the second quarter of fiscal 2023, our inventory increased by approximately $2.5 million or by 1.5% from the prior period, reflecting the delayed production for the large outdoor power equipment program and our preparations for expected growth in coming quarters. Yes, it's -- we -- as you know, we've been doing this for a while now and we used to have probably five, six years ago, we'd sit around and agonize over four or five big quotes that we had to land one of them in order to replace the leaks out of the revenue bucket and maybe grow. So that's -- the difference between now and the old days, let's call it before the pre-realization that overseas is risky, so the difference now is that we would be sitting in a room, doing the final negotiations with the customer and the customer would say, \"Well, we're close to a deal, but you need to drop your margin by a 0.5 point because you're higher than these other guys.\" And we don't have any hard and fast rule that says that, well, anything under 9% we're walking because as we're analyzing a piece of business, there's not only the margin, there's also the potential for growth, there's the behavioral patterns that we see exhibited by the customer as we go through quoting and negotiating, there is the attractiveness of the business from an operational standpoint. The big question for us and you as an investor is, do we see a big recession coming or do we see the improvement in commodity availability and unemployment and everything else kind of swamping over the efforts of the Fed to drive inflation down, that's more to the question of what's going to happen to our growth, then is our ability to add three or four SMT lines in $1 million a piece. I don't think you guys had -- it's not to say that you're foolish or dumb or anything, because I'm not saying that, but I don't think you have an appreciation -- I don't think you have an appreciation for what has to happen to move a program from a competitor to our factory or to start up a new design and move it into our factory, it's incredibly complex."
}