{
    "symbol": "GDRX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 20:14:10",
    "content": " Product development and technology expenses remained relatively flat at $35.9 million or 19% of revenue compared to $35.1 million or 18% of revenue in the comparable period last year, primarily driven by higher head count and costs related to our in-period reduction in force, resulting from the realignment of our organization in support of our strategic goals substantially offset by higher capitalization of costs related to software development due to greater investment in our products and reprioritization of the development efforts that better align with our strategic goals in future scale. Adjusted EBITDA decreased 16% year-over-year to $52 million, largely driven by the grocer issue, which materially impacted revenue growth as well as adjusted costs and operating expenses as a percentage of revenue. One moment for our next question, please. I think in the interim period though, particularly with respect to Manufacturer Solutions, given what weâ\u0080\u0099re seeing going on in the marketplace and how with pharma manufacturers taking longer to make decisions around marketing spend and being somewhat more focused on spend period in the fourth quarter, which could extend into 2023 as well. One moment for our next question, please. One moment for our next question. One moment for our next question, please. One moment for our next question. I think what makes it even more attractive is the continued shift to digital that pharma manufacturers are indicating theyâ\u0080\u0099re continuing to be committed to make, because that shift to digital in years, particularly to GoodRxâ\u0080\u0099s benefit, given our relatively unique ability to be able to both target healthcare providers and consumers and to target healthcare providers and consumers in a very specific way. One moment for our next question. One moment for our next question, please. One moment for our next question. One moment for our next question, please. One moment for our next question, please. One moment for our next question, please. First of all, Kevin in terms of cap soft weâ\u0080\u0099re, we spent a lot of time over the prior yearâ\u0080\u0099s continuing to focus on managing and maintaining our base code, building new infrastructure to allow us to develop faster and taking on other initiatives of the, like I think what youâ\u0080\u0099re seeing, particularly since Mark Hall joined us to Head product, youâ\u0080\u0099re seeing a shift in which weâ\u0080\u0099re now focused very, very hard on delivering direct value to healthcare providers through things like the provider mode that Trevor talked about and new offerings for consumers too."
}