{
    "symbol": "GDRX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 18:48:09",
    "content": " On our fourth quarter earnings call, we reset expectations because our historical cohorts from the COVID period contributed less than we expected, then our prescription transactions offering was impacted by the grocer issue we discussed on our first quarter earnings call. The second quarter was particularly disappointing due to the impact of the grocery issue we discussed, which was in line with the expected $30 million revenue hit we estimated on our first quarter earnings call. As mentioned, our new user counts in the second quarter, driven by strong user growth in many of the grocers competitors as consumers chose to fill out other pharmacies with attractive GoodRx prices, largely offset the needs or decreased the grocer. The estimated impact of the issue on our prescription transactions revenue in the second quarter was largely in line with the $30 million we estimated on our last earnings call and drove a decrease in both MACs, which decreased 3% year-over-year to $5.8 million and PTR per MAC, which decreased 4% as consumers at the grocer have historically had more transactions per month with a slightly higher fee per transaction. The increase in cost of revenue as a percentage of revenue was driven by the grocer issue described earlier, which materially impacted our prescription transactions revenue as well as the acquisition of vitaCare, which has a higher cost of revenue due to the operational nature of its business. While we're able to keep adjusted sales and marketing largely flat quarter-over-quarter in absolute dollars and decrease the proportionate made of revenue on a year-over-year basis, it still forms a larger percent of revenue compared to the first quarter of this year and some other more fixed cost and expenses from the larger percentage of revenue as well due to the decrease in prescription transactions revenue. Even with the grocer's impact on our business, we are still able to generate an adjusted EBITDA margin of almost 25% and continue to generate strong cash flow with net cash from operating activities of $51 million for the quarter. In addition to the impact of the grocer issue, we expect the consumer engagement efforts Trevor discussed earlier to further impact prescription transactions revenue by approximately $5 million in the third quarter and approximately twice that in the fourth quarter due to higher friction in the funnel. For these reasons as well as the modest decrease in PTR per MAC, we're anticipating due to continued volume mix shift, we expect the quarter-over-quarter prescription transactions revenue decrease of approximately $10 million in the third quarter. As mentioned, in the second quarter, we able to keep adjusted sales and marketing largely flat in absolute dollars quarter-over-quarter and decrease the proportion it made of revenue on a year-over-year basis, but it still formed a larger percentage of revenue compared to the first quarter of this year and some of our other more fixed costs and expenses from the larger percentage of revenue due to a decrease in prescription transaction revenue because of the grocer issue. Our 20% adjusted EBITDA margin guidance is lower than our historical margin profile and lower than our second quarter results, primarily driven by the revenue compression due to the grocer issue. We've historically been able to deliver a strong combination of growth and margin, and we want to make sure that continues to be the case in the future. However, I think we have indicated that, from the 2Q levels of impact, which are around $30 million represented about a 70% to 75% drop relative to expected revenue of the grocer into 3Q that expanded somewhat because the effects have been there for the entirety of the quarter. I think what's changed is that with this onetime step down in revenue that we've experienced hasn't necessarily impacted growth trajectory at all, but it impacts the step down right now with the grocer that may extend the period a little bit, it takes for us to get to those higher combined growth plus margin level. Total company revenue of $191 million to $192 million was essentially in line with the $190 million guidance, with EBITDA $47 million came in about $12 million, $13 million higher than the Street view of $34 million to $35 million, which I feel like that's indirectly where the company sort of guided everyone towards for the quarter when talking about operations last quarter. We've historically been able to deliver a strong combination of growth and margin, and we want to make sure that continues to be the case in the future."
}