{
    "symbol": "OSPN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 18:42:05",
    "content": " Excluding this impact, our Q2 revenue would have been $3.2 million higher than we reported, representing a year-over-year growth rate of 7%. Revenue grew 1% to $53 million, led by 26% growth in subscription revenue to $20 million, offset by the expected decreases in perpetual-based software maintenance and non-recurring revenues. Gross margin was 67%, consistent with the same quarter in 2021, an increase in higher margin digital agreement revenue was offset somewhat by product mix shift within the security solutions segment. We announced Phase 2 of our cost reduction plan in May of this year, which calls for total cash charges related to severance and benefits costs associated with headcount production of approximately $10 million to $17 million during the period covering the last three quarters of 2022 through the year ending 2025. Adjusted EBITDA was negative $1.5 million in the second quarter of 2022, as compared to negative $1 million in the same period of last year. Non-GAAP net loss per share, which excludes long-term incentive compensation, amortization, non-recurring items and the impact of tax adjustments was $0.10 in the second quarter of 2022, compared to $0.4 in the second quarter of last year. Revenue grew 10% to $10.5 million, including 12% growth in subscription revenue to $8.7 million. Subscription revenue grew 39% to $11 million, driven primarily by expansion contracts from existing customers for on-premises, mobile security and service solutions. Total revenue decreased 1% to $42 million, largely driven by expected decreases in legacy deal flow, perpetual-based software maintenance and non-recurring revenues, including Digipass tokens, which account for the largest percentage of this segment's revenue. While we were able to manage through these risks effectively in Q2, supply chain challenges could impact quarterly Digipass revenues by up to $2 million in the second half of the year. Operating income was $8.6 million and operating margin was 20%, as compared to $10 million and 23% last year respectively. We ended the second quarter of 2022 with $98 million in cash, cash equivalents and short-term investments, compared to $98 million at the end of 2021 and $120 million at the end of last quarter. We estimate first half 2022 revenue would have been nearly $5 million higher had currency exchange rates been constant, as compared to the year ago period. For the full-year 2022, notwithstanding FX headwinds, we expect the following: total revenue to meet or exceed full-year 2021 revenue; ARR growth to be in the range of 16% to 18%; and adjusted EBITDA to be in the range of negative $4 million to negative $7 million."
}