{
    "symbol": "OSPN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 21:11:03",
    "content": " Fourth quarter and full year 2022 revenues were $57 million and $219 million, respectively. For the year, revenue grew 2% despite supply chain challenges and foreign currency headwinds, excluding the FX impact of approximately $12 million for the full year 2022, FY2022 revenue grew 8%. Excluding the FX impact of approximately $4 million, ARR grew 15% and we were profitable on an adjusted EBITDA basis for the quarter and year reaching $3.2 million in Q4 and $6.4 million for the year. ARR grew 12% year-over-year to $139 million, excluding the FX impact of approximately $4 million ARR would've been 15% higher year-over-year. Excluding the effect of FX of $2.9 million, Q4 revenue wouldâ\u0080\u0099ve been $59.5 million or 1% higher compared to last yearâ\u0080\u0099s Q4. For the full year 2022 revenue grew 2% to $219 million, excluding the FX impact of approximately $12 million, revenue wouldâ\u0080\u0099ve been 8% higher as compared to 2021. Fourth quarter operating expenses benefited from our cost reduction plans, lower payroll related expenses as a result of lower head count, increased R&D software capitalization costs and by approximately $1.4 million from changes in FX as compared to last year, offset partially by increases in travel, long-term incentive compensation and bonus accruals. Regarding our cost reduction plan, as a reminder, last year we completed Phase 1 resulting in $11.8 million of annualized savings near the high end of our $10 million to $12 million expected range. Digital agreements ARR grew 18% year-over-year to $47 million, excluding changes in FX ARR grew 19%. Excluding changes in FX fourth quarter and full year 2022 revenue grew 16% and 20%, respectively. For the fourth quarter and full year 2022, subscription revenue grew 24% to $11.3 million and 26% to $42 million respectively. ARR grew 9% year-over-year to $92 million, excluding changes in FX, ARR grew to 13%. For the fourth quarter and full year 2022 subscription revenue grew 32% and 34% to $12.5 million and $47.1 million respectively, driven by expansion contracts from existing customers for authentication, transaction signing and  solutions. We ended the fourth quarter of 2022 with $99 million in cash, cash equivalents and short-term investments compared to $98 million at the end of 2021 and $94 million at the end of last quarter. For the full year 2023, we expect the following: Revenue will be in the range of $232 million to $242 million, representing growth rate of 6% to 11%; ARR to be in the range of $157 million to $164 million, representing a growth rate of 13% to 18%; and adjusted EBITDA to be in the range of $3 million to $6 million. And then just lastly, when you think about the 12%, as I said, $3.9 million was FX, depending what the macro does in 2023, and nobody has a crystal ball, so that could be a headwind or a tailwind for us."
}