{
    "symbol": "OSPN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 18:49:09",
    "content": "  Operator: Hello, and welcome to today’s OneSpan First Quarter 2022 Earnings Conference Call. Hello everyone, and thank you for joining the OneSpan First Quarter 2022 Earnings Conference Call. Joining me on the call today is, Matt Moynahan, OneSpan's Chief Executive Officer; and Jan Kees van Gaalen, our Interim Chief Financial Officer. This afternoon after market close, OneSpan issued a press release announcing results for our first quarter 2022. Following our prepared comments today, we will open the call for questions. Please note that statements made during this conference call that relate to future plans, events or performance, including the outlook for full year 2022, are forward-looking statements. These statements use words such as believes, anticipates, plans, expects, projects and similar words, and these statements involve risks and uncertainties and are based on current assumptions. Consequently, actual results could differ materially from the expectations expressed in these forward-looking statements. In addition, please note that the date of this call is May 3, 2022. Any forward-looking statements and related assumptions are made as of this date, except as required by law, we undertake no obligation to update these statements as a result of new information or future events or for any other reason. Before turning the call over to Matt, I want to remind everyone, we will be hosting an Investor Day in New York City on May 17th. I would like to begin by thanking our talented employees for their extra efforts over the last several months, as we thoughtfully and thoroughly explored, developed and finalized our long-term strategic plan, which we'll discuss in detail with you at our Investor Day two weeks from today. We accomplished a lot over the last several months, all the while remaining focused on driving first quarter results, which I will discuss in a few minutes. First, let me provide a glimpse into what you will hear at our Investor Day. First, we will operate as one team spanning the globe united in one go-to-market strategy behind a shared vision and mission. Second, our two solution portfolios, digital agreements and security solutions, will have clear roadmaps, team structures, operational focus and improved execution. And third, we will accelerate our growth in the broader digital agreements category, which includes e-signature, virtual room and other solutions. In addition, we will also return our total security, both hardware and software to growth and operate in a more capital efficient way to deliver increasing profitability over our three year plan. As I mentioned before, we are in very good position with the core building blocks in place, to drive the next generation of growth for OneSpan. We have a customer base that includes many of the largest and most security conscious companies in the world, companies that trust us to mitigate their risk of fraud, help them to comply with regulations and deliver user-friendly experiences in their mission critical business processes, including use cases such as new bank account openings, new customer acquisition, and business-to-business wire transfers. As a result, we plan to aggressively penetrate the broader enterprise segment and tightly integrate our security technologies into our digital agreement solutions as a key and core differentiator in the market. Turning to the first quarter, we reported 21% ARR growth and 22% recurring revenue growth, led by strong sales of e-signature solutions. Year-over-year, we saw modest top line growth with increased operating efficiencies, resulting in improved adjusted EBITDA as compared to the first quarter of last year. In particular, I'd like to highlight a multi-year seven-figure ACV e-signature contract closed in Q1, with a global revenue lifecycle management company. In the near-term, our selling efforts will continue to focus on providing new and existing customers, with our core solutions as we progress in our journey. Stay tuned for more as I look forward to discussing our innovation, go-to-market strategy and capital realignment plans with you soon. Annual recurring revenue or ARR grew 21% year-over-year in the first quarter to $131 million. DBNE, dollar based net expansion rate, which we define as the year-over-year growth in ARR for existing customers, was 115% consistent with recent quarters. Total recurring revenue, including SaaS and term-based subscription, along with maintenance on software licenses, increased 22% year-over-year to $35 million in the first quarter of 2022 and accounted for 95% of software and services revenue. E-signature, SaaS and term-base subscription revenue increased 40% year-over-year in the quarter. Term-based subscription revenue grew 65% to $13 million in the quarter and benefited from a more multi-year e-signature on premises renewal. 22% growth in recurring revenue was offset by a decline in non-recurring software, services and hardware. Though we continue to experience global transportation and supply chain disruptions, we reduced our reliance on air freight as compared to the last quarter. As of March 31st, we had completed substantially all of the action items contained in our cost reduction plan announced in Q4 ’21. Excluding severance, we achieved cost reductions of $2.7 million in the first quarter, and our own target for total cost reductions of more than $11 million for the four year 2022, above the midpoint of the plan. Non-GAAP loss per share, which excludes long term incentive compensation, amortization, non-recurring items and the impact of tax adjustments, was $0.01 in the first quarter compared to $0.16 in the first quarter of last year. We ended the first quarter of 2022 with $120 million in cash, cash equivalents and short-term investments compared to $98 million at the end of 2021. Geographically, our revenue mix by region in the first quarter of 2022 was 47% from EMEA, 33% from the Americas and 20% from AsiaPac. This compares to 53%, 33% and 14% from the same regions in the first quarter of last year respectively. Recent temporary COVID driven closures at our contract manufacturing facilities in China, along with delays in deliveries of electronic components to these facilities could impact second quarter hardware revenue by up to $2 million. As you can see, we started the year with solid momentum and we look to keep that momentum going as we begin implementing our strategic plan this quarter. Our strong market position and solution portfolio, along with our talented employees, provide us with a strong foundation to build upon. And I'm confident in our ability to unlock shareholder value as we increase our focus, leverage our competitive advantages and enhance operational performance as one team. At this time, we are finalizing our review of our full year 2022 adjusted EBITDA outlook in context with our strategic plan, and we'll provide an update at our Investor Day on May 17th. We have seen use cases for our hardware from customers in Europe who are looking for higher assurance use cases, and this will be a theme going forward with the company. We are still reviewing the EBITDA and the adjusted EBITDA numbers, and we will communicate those during the investor conference now in two weeks. And so, just to give you a sense, we have a monthly, if not bi-monthly meetings, with everybody in the company, bringing along this process over the past four months since my arrival. We have obviously as part of this process beginning in December have made performance management moves, and we’ll continue to do that over the course of the company. I know since the last call, it's a new CMO. You should expect over the near term to see a Chief Product Officer, as well as a new General Council and the Head of Compliance joining. There's also an open executive position for the CRO, Chief Revenue Officer, and we are making very good progress there. So it looks like the subscription revenue bounced back a little, up 20% this quarter versus 15% last quarter. With regards to e-signature and subscription revenue, it has slowed somewhat post COVID. We do work on changes as we are going to operationalize our new strategy, and this will be discussed with you during the Investor Day in two weeks. Just to give you a sense, as I mentioned, one of our objectives for Investor Day going forward is to bring crystal clarity to how to look at this business, both at the security side, as well as the e-signature or what we're calling digital agreements side of the house. If you look at what we benefited from, as Jan Kees mentioned in his opening remarks, we do sell from time-to-time term based subscriptions, which is essentially an on-premise version of our e-signature that really is no different other than just the location of the on-premises equipment from our cloud based. It looks lower because we had several sales of our on-premise term based subscription versus as we currently report pure subscription, if that makes sense. Definitely appreciate your time and attention, and I hope to see many of you in person at our Investor Day in New York City on May 17th, where we look forward to sharing with clarity the future of the company and one that I find particularly exciting and look forward to seeing you in two weeks short time."
}