{
    "symbol": "DNB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 22:05:02",
    "content": " For example, third-party and supply chain risk management continues to be a focus for companies throughout the world, and our revenues in that subsegment grew over 20% versus the prior year quarter. On a GAAP basis, first quarter revenues were $536 million, an increase of $32 million or 6% compared to the prior year quarter and 8% before the effect of foreign exchange. First quarter adjusted revenues from the total company were $536 million, an increase of 5.3% or 6.9% before the effect of foreign exchange versus the prior year quarter. First quarter adjusted EBITDA for the total company was $190 million, an increase of $4.5 million or 2%. First quarter adjusted net income was $103 million or adjusted diluted earnings per share of $0.24, an increase from $98 million or $0.23 per share in the prior year quarter. In Finance and Risk, revenues were $202 million, an increase of 6%, driven by increased new business and higher upsell, particularly in our third-party and supply chain risk management solutions. North America, our first quarter adjusted EBITDA was $153 million, an increase of 2%, primarily due to revenue growth, partially offset by higher data and data processing fees. Finance and Risk revenues for the first quarter of 2022 were $109 million, an increase of $2 million or just over 1% and 6% on a constant currency basis. Sales and Marketing revenues for the first quarter of 2022 were $60 million, a decrease of $3 million or 5% and an increase of 2% on a constant currency basis. First quarter International adjusted EBITDA was $55 million for the 3 months ended March 31, 2022, an increase of $4 million or 7% compared to the same period last year. We continue to expect adjusted revenues after the effect of foreign currency to be in the range of $2,270 million to $2,315 million or an increase of approximately 4.5% to 6.5%. Similarly, we continue to expect adjusted EBITDA to be flat to prior year in the second quarter and then ramp up in the third and fourth quarters as we annualize prior year investments in new alternative data sets and see the strong contribution margins flow through from accelerated revenue growth. Andrew, your line is open. Andrew, your line is open. And then it's gaining the benefit also of quarterly accelerated organic revenue growth, but also the synergies, as Anthony mentioned, we've executed now through this quarter about $30 million of annualized run rate synergies."
}