{
    "symbol": "DNB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 13:39:02",
    "content": " Turning to Slide 1, on a GAAP basis fourth quarter revenues were $595 million, a decrease of 1% compared to the prior year quarter and an increase of 3% before the effect of foreign exchange. For full year 2022, revenues were $2225 million, an increase of 3% or 6% before the effective foreign exchange. Fourth quarter adjusted revenues for the total company were $595 million, a decrease of 1% or an increase of 3% before the effect of foreign exchange. Fourth quarter adjusted EBITDA for the total company was $250 million, an increase of $8 million or 3%. Full year adjusted revenues for the total company were $2225 million, an increase of 3% or 6%, before the effect of foreign exchange compared to 2021. Full year adjusted EBITDA for the total company was $864 million, an increase of 2%. In North America, revenues for the fourth quarter were $435 million, an increase of approximately 1% from prior year, excluding the impact of foreign exchange and acquisitions, North America organic revenue grew 22%. In financial risk, revenues were $231 million, an increase of a million dollars or less than 1% due to growth in our Financial Risk Solutions partially offset by declines and our government incredibility solutions. North America fourth quarter adjusted EBITDA was $250 million, an increase of $4 million or 2% primarily due to revenue growth and on-going cost management efforts. In North America, revenues for 2022 were $1587 million, an increase of $88 million, or 6% from prior year. North America Finance or full year revenues were $867 million, an increase of $32 million or 4% primarily attributable to new business and higher customer spend in our third party risk and supply chain risk management solutions partially offset by lower revenues from our government solutions. North America sales and marketing full year revenues increased $56 million, or 8% to $720 million. Full year adjusted EBITDA for North America increased $3 million or less than 1% to $718 million, primarily due to higher revenues, partially offset by investments waiting to higher data and data processing costs. In our International segment, fourth quarter revenues decreased 6% to $160 million or an increase of 6% before the effect of foreign exchange and organic revenues on a constant currency basis increased 7%. The Finance and risk revenues were $106 million, a decrease of 4% or an increase of 7% before the effect of foreign exchange. In our International segment, full year 2022 revenues were $638 million, a decrease of 5% or an increase of 5% before the effect of foreign exchange. Full year 2022 International adjusted EBITDA was $202 million, an increase of $8 million or 4% versus 2021. Total revenues after the effect of foreign currency are expected to be in the range of $2,260 million to $2,300 million or an increase of 1.6% to 3.4%."
}