{
    "symbol": "DNB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 22:25:05",
    "content": " With 51% of our revenues under multiyear contracts and 96% gross revenue retention rate and 95% recurring revenues, we continue to build our business into a sustainable mid single-digit growth engine with further upside from increased innovation, continued market expansion and better leveraging pricing power. On the Sales and Marketing front, we grew 12% overall and 3% on an organic basis with solutions like Master Data management growing high single-digits and our digital marketing solutions growing low double-digits. Despite the evolving market and macro landscape, we continue to be laser-focused on delivering long-term value through our guiding strategic principles: innovate solutions and localizing throughout the world; increase our wallet share with strategic clients through expanded data sets and complementary solutions; approach and monetize the small business channel in new and innovative ways; and continue to grow International in both our owned and worldwide network markets. On a GAAP basis, third quarter revenues were $556 million, an increase of $14 million or 3% compared to the prior year quarter and 7% before the effect of foreign exchange. Third quarter adjusted revenues for the total company were $556 million, an increase of 3% or 7% before the effect of foreign exchange versus the prior year quarter. In Finance and Risk, revenues were $224 million, an increase of 5% primarily due to strong double-digit growth in our third party and supply chain risk management solutions and solid single-digit growth in our Finance Solutions, partially offset by lower revenues in our public sector driven primarily by the conclusion of the GSA contract at the end of April. North America third quarter adjusted EBITDA was $188 million, an increase of 2%, primarily due to higher organic revenue growth, partially offset by investments leading to higher data and data processing fees. In our International segment, third quarter revenues were $153 million, a decrease of $15 million or 9% and an increase of 3% on a constant currency basis. Finance and Risk revenues for the third quarter of 2022 were $102 million, a decrease of $7 million or approximately 6% and an increase of 6% on a constant currency basis. Sales and Marketing revenues for the third quarter of 2022, were $51 million, a decrease of $9 million or 14% and a decrease of less than 1% on a constant currency basis. International third quarter adjusted EBITDA was $52 million, a decrease of $2 million or 4% compared to the prior year period. We'll have the GSA in the first quarter of next year at a full three months,but outside of that certainly the investments that we've made whether it's in ESG data whether it's in shipping data whether it's in these other alternative data sets that are really giving us a differentiation in the market right now, an ability to continue to accelerate our organic growth we'll see that natural flow through we've talked about, which is generally on like mid-single digits 50 to 100 bps of margin expansion."
}