{
    "symbol": "DNB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 10:50:11",
    "content": " For instance, our new localized version of Hoovers in Europe has achieved a near 50% increase in revenue versus prior year, and we believe there's ample greenfield opportunities to continue to accelerate growth over the coming quarters and years. On a GAAP basis, second quarter revenues were $537 million, an increase of $16 million or 3% compared to the prior year quarter and 6% before the effect of foreign exchange. Second quarter adjusted revenues for the total company were $537 million, an increase of 3% or 6% before the effect of foreign exchange versus the prior year quarter. The increase in EBITDA was primarily due to revenue growth from the underlying business, partially offset by investments leading to higher data and data processing costs and $3 million from the impact of foreign exchange. In Finance and Risk, revenues were $209 million, an increase of 5% primarily due to new business and higher customer spend in our third-party and supply chain risk management solutions, partially offset by lower revenues from the conclusion of the GSA contract at the end of April. North America's second quarter adjusted EBITDA was $161 million, a decrease of 4% primarily due to investments leading to higher data and data processing fees, partially offset by organic revenue growth. Finance and Risk revenues for the second quarter of 2022 were $102 million, a decrease of $2 million or approximately 2% and an increase of 7% on a constant currency basis. Sales and Marketing revenues for the second quarter of 2022 were $54 million, a decrease of $6 million or 9% and an increase of 2% on a constant currency basis. Second quarter International adjusted EBITDA was $46 million for the 3 months ended June 30, 2022, an increase of $4 million or 9% compared to the same period last year. Additional modeling details underlying our outlook are as follows: depreciation and amortization expense of approximately $90 million, excluding incremental depreciation and amortization expense resulting from purchase accounting; adjusted effective tax rate of approximately 24.5%; weighted average diluted shares outstanding of approximately 430 million; and CapEx, we expect to be at the higher end of our $150 million to $180 million range. Adjusted EBITDA is also expected to ramp up in the third and fourth quarters as we annualize prior year investments in the first half of the year and see the contribution margins flow through from revenue growth in the second half, with only a slight impact of $6 million in the second half of the year from foreign exchange. Please proceed with your question. Please proceed with your question. Please proceed with your question. All I'd add to that is that's a growing area that we don't see going away, but we see we're getting more and more core to our clients and anchored on them and working on solutions that can really benefit them such as ESG and these new early growth areas where what we can provide to them from a repeatable, measurable scoring capability can really help when you really understand the regulatory environment that they're going to be faced with and with our access to private company data as well as public company. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}