{
    "symbol": "BCO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 16:58:08",
    "content": " We also affirmed our full year guidance which includes revenue growth of 8% to 11% and operating profit growth of 16% to 23%, reflecting approximately 100 basis points of margin expansion, driven by our lean cost initiatives and leverage from a lower fixed cost base. The exception was North America, where profits declined versus last year's very strong second quarter, which benefited from several one-time adjustments related to various insurance credits, bad debt reversals and COVID related government subsidies, that on a combined basis more than offset the second quarter margin improvement this year. As Mark just mentioned, 2022 second quarter revenue versus prior year, was up 13% in constant currency, almost entirely from organic growth. Reported revenue was $1.134 billion, up 85 million or 8% versus the second quarter last year. Reported operating profit was $124 million and the operating profit margin of 10.9%, was up 40 BPS versus the second quarter 2021. Second quarter interest expense was $32 million, up $4 million versus the same period last year, due to higher debt associated with the $200 million in share repurchases completed in the last 12 months and higher variable interest rates. Second quarter 2022 adjusted EBITDA was $187 million, up $21 million or plus 13% versus a strong quarter last year. Cash interest is expected around $115 million, an increase of $9 million versus 2021, due to the incremental debt associated with the previously mentioned share repurchases, the PAI acquisition that closed on April one last year and higher variable interest rates. The approximate $180 million decrease in net debt from year-end 2021 to 2022 is expected to be driven by free cash flow and $67 million in third quarter 2022 hedge monetization, partly offset by dividends, financing leases and other strategy 2.0 device investment. We're also on track to achieve operating profit growth of 16% to 23%, reflecting a margin increase of approximately 100 basis points versus last year. For additional perspective, it's also important to note, that our three-year targets are driven primarily by growth and continued operational improvements in our core business, which accounts for approximately 90% of our 2024 revenue target and 85% of our operating profit target."
}