{
    "symbol": "BCO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 11:30:20",
    "content": " This morning, we reported record first quarter results with revenue growth of 10%, a strong start to the year, despite a slower than expected start in the quarter due to Omicron-related shutdowns in many of our markets. Despite our slower than expected start to the year due to Omicron, our full year guidance is clearly supported by our first quarter results, 10% revenue growth, 24% operating profit growth and 46% EPS growth. Our non-GAAP results include first quarter revenue growth of 10%, operating profit growth of 24%, adjusted EBITDA growth of 21% and EPS growth of 46%. On the right hand side of the slide, you can see that the first quarter revenue of the total company recovered to 95% of 2019 pre-COVID levels, a continuation of the improvement we saw in 2021. In aggregate, our U.S. dollar revenue versus pre-pandemic levels recovered to 95% in the first quarter of 2022, which was flat versus the prior quarter, despite the lingering impact of the pandemic in the first half of the quarter. The 95% first quarter USD recovery was sequentially flat with a seasonally strong fourth quarter of 2021, but even higher on a local currency basis, which was at a hundred percent excluding the inflationary impact of Argentina, two percentage points higher than the fourth quarter of 2021. In North America first quarter revenue – reported revenue grew 16%, which includes 6% organic growth and 10% from the impact of the PAI acquisition that we did last April. Reported revenue was $1.74 billion, up $96 million or 10% versus the first quarter last year. First quarter 2022 adjusted EBITDA was $165 million, up $28 million or plus 21% versus prior year. Our strong first quarter results, which include 10% revenue growth and 24% operating profit growth clearly demonstrate the resiliency of our business and support our confidence in achieving our 2022 guidance. Well, I think Tobey, I think your question is a good one in terms of how do you split the replacement of a better value solution for our existing CIT customers, therefore it's replacement revenue versus the new sales we laid out in Investor Day that we're looking for $500 million in incremental sales that's on top of our existing sales, or those will not be replacements through the three-year strap plan period of time for the 2.0 strategies."
}