{
    "symbol": "BCO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 12:37:09",
    "content": " Our guidance includes full year organic revenue of about 12% and strong double digit growth in operating profit, EBITDA and EPS, reflecting approximately 100 basis points of margin expansion driven by our organic growth, lean cost initiatives and leverage from the lower fixed cost base. The reported revenue was $1.1 billion, up $61 million or 6% versus the third quarter last year. Acquisitions added another 1% and 4x was a 14% headwind, resulting in reported operating profit of $127 million and an 11.2% operating margin, which was 40 basis points above last year and 30 basis points higher sequentially. Our organic operating profit growth was primarily driven by revenue growth and was partially offset by an increase in security losses, including the previously discussed $10 million related to the jewelry robbery in Los Angeles and expenses related to variable compensation. Starting with our operating profit and walking left to right, third quarter interest expense was $34 million, up $7 million versus the same period last year, primarily due to higher interest rates and to a lesser extent higher levels of debt. Then doing the math, $127 million of operating profit plus interest expense, taxes and $3 million in non-controlling interest and other, which includes higher interest income on held cash generated $64 million of income from continuing operations, up $7 million over last year. That then leads us to third quarter adjusted EBITDA of $189 million, up $19 million or 11% versus last year, primarily due to the higher operating profit and non-cash variable compensation and as Mark mentioned, EBITDA as a percentage of revenue was 16.6%, up 80 basis points versus Q3 of last year. Cash interest is expected to be around $125 million, also an increase of $10 million versus our prior target and $19 million higher than last year, primarily due to higher variable interest rates and higher debt levels. If you adjust our full year target by the $25 million that would yield a 36% free cash flow to EBITDA ratio, in line with last year. Our 2022 organic revenue and profit growth targets are still intact, and we expect to be able to achieve strong growth and margin expansion despite FX headwinds of $265 million on revenue and $51 million on profit versus the prior year. For additional perspective, it's also important to remember that the three year targets we provided last December are driven primarily by organic growth and continued operational improvements in our core business, which accounts for approximately 90% of our 2024 target revenue and 85% of our operating profit target. I think you know the 50% organic growth for us, while it's a big number and it feels really good, this is really several, singles and doubles along the way in our base business, whether it's PAI or the rest of our global footprint, but it's also a big step up as we're bringing on the BPCE network that we previously announced in prior year."
}