{
    "symbol": "JHX",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-07 21:54:05",
    "content": " Moving to Asia Pacific, where John Arneil and the team delivered a solid outcome of 8% growth in net sales under continued inflation, labor shortages and supply chain disruptions in the first half of the year. With that said, we expect EBIT margin growth in the second half of the fiscal year with price realization and continued higher mix products. However, based on the significant decline in the market expectations over the past 45 days, which we have reviewed with our customer partners, we now expect second half volume growth to be between negative 5% and negative 8% to the prior year, which is a significant reduction to our August September projections. And in our projections for the second half of the year, we see volume growth in our regions that are more R&R focused, but see significant volume decreases in those regions skewed toward new construction. For the second half of our fiscal year, we expect volume growth will be in the range of minus 4% to flat versus the same period last year. We do believe we will continue to deliver relatively strong price mix growth, resulting in net sales in the second half to be slightly down versus the same period last year. Over the past few years, we have significantly step changed our top line results by driving volume growth and price mix growth, which puts us in a position to deliver, again, the second largest half year net sales dollar results in our history despite the market slowdown. This adjusted outlook for the second half still puts us in a position to deliver EBIT growth year-over-year and an EBIT margin in the top end of our 25% to 30% range, while continuing to make the right investments in our long-term growth. Global adjusted EBIT increased 6% to $218.5 million, driven by the global net sales growth of 10% partially offset by inflationary pressures in all regions. From the second quarter of fiscal year 2020 through to this result, we have now seen our second quarter adjusted net income growth 22%, 29% and now 13% over the past 3 years. In the second quarter, the North American team delivered robust net sales growth of 18% to $750.6 million, driven by volume growth of 4% and excellent price mix growth of 14%. Over the past 3 years, we've seen substantial growth in North American net sales and EBIT from the second quarter of fiscal year 2020 through to this results, we have seen our second quarter North America net sales grow 12%, 23% and now 18% over the past 3 years, and have seen our EBIT grow 19%, 23% and now 17%. From the second quarter of fiscal year 2020 through to this result, we have seen our second quarter Asia Pacific net sales grow 4%, 15% and now 7% over the past 3 years. During the second quarter, net sales decreased 2% to â\u0082¬102 million, driven by a 14% decline in volumes, which was a result of the slowdown in the European housing market. More specifically for North America, our largest region, we expect fiscal year 2023 net sales growth of 13% versus fiscal year 2022 at an EBIT margin between 28% and 30%. As I mentioned earlier, while we have reduced our expectations for the second half in North America due to the changing market conditions, we still expect to deliver the second largest half year in net sales in James Hardie's history. Good evening, Aaron and Jason. Good evening, Aaron and Jason. So just checking on your North American sales guidance for the plus 13% for fiscal year '23, my rough and dirty math has your second half sales down 12% over the first half."
}