{
    "symbol": "AGNC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 12:05:04",
    "content": " Interest rates across the yield curve moved materially higher as the Fed increased the federal funds rate 425 basis points in just 9 months, the yield on the 10-year treasury increased by close to 250 basis points. So that rotation, out of other asset classes into fixed income and into Agency MBS, I think, is going to continue particularly against the outlook from the equity markets is obviously, from a portfolio perspective, I think investors are favoring a much greater share of fixed income securities. And thatâ\u0080\u0099s why over the short-term, our view is that spreads are likely to buy a bias to be somewhat tighter not dramatically, but I think the trend could stay in place for some period of time, particularly because the seasonals from a supply perspective are also really good over the next several months. But sort of broadly speaking, if you look back at our portfolio, and this is hard to do because we donâ\u0080\u0099t give you the interperiod numbers, but sort of the low point for our portfolio was right around the end of October in terms of our asset balance, and thatâ\u0080\u0099s consistent with the environment that weâ\u0080\u0099re in because that was when the risk was at its highest point from a market perspective. But when you think about â\u0080\u0093 Chris mentioned the refinance ability of our portfolio for a 50 basis point move, assuming a 6% mortgage rate today, only 15% of the universe would have a 50 basis point incentive for a 200 basis point rally in mortgage rates, only 15%. Unfortunately, itâ\u0080\u0099s probably coming in a time when we thought we would actually have a lot more rate stability in our outlook given the fact that I think the Fed is going to be pretty much done with what it needs to do in the next couple â\u0080\u0093 two or three meetings. So, to Chrisâ\u0080\u0099 point, eventually the market implied volatility is going to come back to the historical norm, and thatâ\u0080\u0099s meaningfully lower, 25%, at least lower, and that could be easily 25 more basis points of tightening on production coupons."
}