{
    "symbol": "ASIX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 14:41:09",
    "content": " The strength and advantage of our business model and diverse product portfolio and the continued execution to our long term strategies, again, enabled us to both navigate the challenges of supply chain and logistics disruptions, escalating raw material inputs and inflationary costs as well as to capitalize on resilient, underlying demand opportunities to deliver results this quarter. Tracking our key variable margin drivers, performance in ammonium sulfate on a net price over natural gas and sulfur basis continued its positive trend year over year, reflecting the strong underlying ag environment, as well as our ability to drive value above and beyond the sharp increase in input costs. In the quarter, we also saw a roughly $23 million unfavorable impact from increased plant spend, primarily driven by utilities due to higher natural gas prices, and an increase in non raw material inflation, primarily on transportation costs. As we have shared in prior years, historically, we've seen a sequential consideration of $10 million to $15 million higher COGS on average in the third quarter, relative to the second. We continue to expect a range of $32 million to $37 million in 2022 with the larger of our Hopewell turnarounds roughly $26 million to $30 million of that total scheduled for the third quarter Operationally, we continue our focus on safe, stable, and sustainable performance while driving less variability and utilization rates, which in turn drives improved customer experience and higher returns for the business. Our differentiated product portfolio focused on high purity applications, high value intermediates, and differentiated nylon is now over $200 million in annual revenue, growing at GDP plus rates with margins that are twice our average based business growth margins, supporting and enhanced sales mix. I would highlight that we do continue to benefit from pass-through pricing in nylon on the top line, but certainly the top line sales growth was achieved, again with the keen focus aligned to the regional supply-demand dynamics and to really capture the inflationary input costs and increasing focus on value-based pricing."
}