{
    "symbol": "ASIX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 15:23:05",
    "content": " We also continue to enhance shareholder value creation as we deployed a significant amount of capital in the first quarter with a combination of our increased CapEx investments, acquisition of U.S. Amines, sustained dividend and opportunistic repurchase of approximately $7 million of shares. Sales volume decreased approximately 4%, driven primarily by robust sales in the first quarter of 2021 as we reduced finished goods inventory in the prior year period to meet a recovery in customer demand amid very tight industry supply conditions. Tracking our key variable margin drivers, performance in ammonium sulfate on a net price over natural gas and sulfur basis, continued its positive trend year-over-year, reflecting the strong underlying ag environment as well as our ability to drive value -- above and beyond sharp increases in input costs. Accounts receivable represented approximately $28 million of that total, reflecting the 13% jump in sales compared to the fourth quarter of 2021 as well as sales that were more back-end loaded in the last month of the first quarter. On the right side of the page, we've highlighted the nearly $130 million of capital deployed in the first quarter, comprised of our organic CapEx investments of $21 million, acquisition of U.S. Amines for an estimated net purchase price of approximately $98 million and over $10 million of cash returned to shareholders through roughly $7 million of share repurchases and $3.5 million of dividends paid. But looking at the inventory level, $163 million, I mean, it is up a little bit from the fourth quarter, but it's been higher in periods with much lower feedstock cost levels or finished product prices back half of 2020. Yes, I think one of the things, Dave, that you need to consider in the inventory balance going in, just to be clear, when you look at the absolute balance, we went from $150 million at the end of the fourth quarter of 2021 to $163 million at the end of the first quarter of 2022."
}