{
    "symbol": "DLNG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-28 12:58:02",
    "content": " The statements in today's conference call that are not historical facts including, among other things, the expected financial performance of Dynagas LNG Partners business, Dynagas Partners LNG ability to pursue growth opportunities, Dynagas Partners LNG expectations or objectives regarding future and market charter rate expectations and in particular, the effects of COVID-19 on the financial condition and operations of Dynagas Partners LNG and the LNG industry in general, may be forward-looking statements as such as defined in Section 21E of the Securities Exchange Act of 1934 as amended. The quarter was mainly impacted by the special survey, dry-dock of our 2007-built LNG carrier Clean Energy, which commenced on 16th March, was completed on April 15 and which $2.6 million was attributable to this quarter. As a result, adjusted net income for the quarter decreased by 5.7% to $10 million compared to the first quarter of 2021 and adjusted EBITDA amounted to $22.9 million, a 4.2% decrease compared to the first quarter of 2021. Looking forward, we anticipate that next quarter's earnings will also be impacted firstly with the balance of the Clean Energy special survey and dry-dock, which is anticipated to amount to $2.7 million, excluding the installation for the ballast water treatment plant, which will be capitalized. We are continuing our comprehensive deleveraging path, which commenced in the fourth quarter of 2019, having repaid through the quarterly installments in our credit facility, $120 million in debt, resulting in a decrease in our net leverage to 4.7x from 6.6x and an increase in our book value of equity by 30%. Our per vessel quarterly breakeven daily rate, including all operating G&A expenses, debt service payments and class survey costs amounted to $55,300 excluding preferred distributions versus our fleet contracted time charter rates for the quarter, which amounted to about $62,200 per day per vessel. Since September 2019, the Partnership has repaid $120 million in debt, increased its cash balance from $66 million to $106 million, decreased net leverage from 6.6x to 4.7x and increased book equity value by 30% to $403 million."
}