{
    "symbol": "HOG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 14:08:10",
    "content": " Equally, we are very pleased with the strong operating income margin growth weâ\u0080\u0099ve seen growing 9.5 points to 17.9% versus last year, which we believe is a solid indicator that we have the right strategy in place to deliver long-term profitable growth at Harley-Davidson. Third quarter results reflect a significant year-over-year revenue and operating income increase, primarily driven by a strong recovery in global motorcycle production and wholesale shipments after being adversely impacted by the unexpected production suspension back in May. Turning to Q3 year-to-date results, total consolidated revenue of $4.6 billion was 7% higher, compared to last year, and total operating income of $906 million was 9% higher, compared to last year. Q3 average inventory was 22% higher than Q3 prior year and on a sequential basis, average inventory rose 12% compared to last quarter as production and wholesale shipments recovered from the suspension in May. The actions that we took during the Rewire to prune the portfolio coupled with the actions on pricing and incentives we've taken the past couple of years to offset inflation have resulted in our unit profitability improving from the low point in 2019, and as we continue on The Hardwire journey, we will remain focused on overall HDMC revenue, operating income, as well as profitability per unit as key measures. If you have a clear positioning as the most desirable lifestyle brand that is rooted in moto-culture demand â\u0080\u0093 so, demand and I am talking motorcycles for a moment here is what drives our thinking all the time and we want to make sure that we are planning our manufacturing accordingly in order, of course, to capture demand, which was not always possible in the last couple of years due to the supply chain challenges, but also that we are agile to move as demand evolves in the next quarters."
}