{
    "symbol": "KE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-06 15:19:02",
    "content": " Diluted EPS increased more than 30% year-over-year with our backlog of open orders at record levels, and manufacturing facilities running at higher utilization and capacity expansions underway, we are ideally positioned to maintain strength and momentum in this bifurcated year, and we expect a strong pace to carry through the fourth quarter. Turning back to the third quarter, net sales were $368 million, a 19% increase compared to Q3 last year and $50 million higher than Q2. The strength this quarter occurred in all four vertical markets with sales and automotive exceeding $160 million, a 16% increase year-over-year, and we're 44% of our total company sales in the quarter. Net sales in medical were $103 million; a 20% increase compared to Q3 of last year, and represented 28% of our total company sales. And finally, sales on our public safety vertical were $13.8 million, a 2% increase compared to the third quarter of last year. As Don just detailed total net sales in the third quarter were $368 million, a record for our company and up 19% compared to Q3 last year. Adjusted selling and administrative expense in the third quarter were $14.3 million compared to $11.6 million in Q3 last year, with the increase resulting from higher salary and related payroll costs and stock-based compensation. As Don highlighted, this was a significant improvement compared to the first half of the fiscal year and to last year when adjusted operating income was $14.4 million or 4.6% of net sales. Net income in the third quarter of fiscal 2022 was $13.6 million or $0.54 per diluted share compared to adjusted net income in Q3 last year of $9.9 million or $.39 per diluted share, representing a 37% increase year-over-year. Capital expenditures in the third quarter were $22.3 million, largely in support of our facility, expansions and new business awards, such as the next generation breaking system in Reynosa, Mexico, that we announced in February. As Don noted, we are updating our guidance for fiscal year 2022 with net sales estimated to be in the range of $1.345 billion $1.365 billion, a 4% to 6% increase year-over-year. Our open order backlog totals $930 million, a record high up 43% year-over-year and driven by component shortages, as well as new business wins. As an example, our facility in Thailand was first opened in the year 2000 and finished fiscal year, 2021 with revenue in excess of a $100 million, much of the product produced in Thailand is exported with a heavy focus on medical, one of the vertical markets identified in our strategic plan with significant growth potential in the years to come."
}