{
    "symbol": "KE",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-05 15:21:07",
    "content": " Net sales in Q4 were $373 million, a 13% increase compared to the fourth quarter last year. Net sales in medical were a $114 million, a 34% increase compared to Q4 last year and 30% of total company sale. In total, our sales in the medical vertical market grew 2% in fiscal year 2022 to $392 million with applications supporting sleep therapy and respiratory care; image guided therapy; in vitro diagnostics; drug delivery systems; AEDs; and patient monitoring equipment. Industrial had a best ever quarter in Q4 with sales totaling $88 million, a 2% increase over the fourth quarter last year. And finally, net sales and public safety were $14 million, a 33% increase compared to the fourth quarter of last year with the growth driven by thermal imaging, first responder electronics, and the production of security access products. This vertical market finished fiscal year 2022 with $50 million in revenue, a 4% increase year-over-year. The growth margin rates in Q4 was 9.2%, a 50 basis point decrease compared to the same period last year was still a very strong result of facing several headwinds in the quarter with low absorption in our facility in China which was most directly impacted by the lockdown from the zero tolerance policy on COVID-19, the ramp-up of our facility expansion in Mexico as well as general inflation. Adjusted operating income for the fourth quarter as $19.4 million, a 5.2% of net sales which compares to last yearâ\u0080\u0099s Q4 adjusted results of $18 million or 5.5% of net sales. Other income and expense was expense of $5.3 million in the quarter versus income of $400,000 in Q4 of fiscal 2021, with a change resulting from higher interest expense this year due to record levels in inventory and the foreign exchange impact that Don noted. Net income in the fourth quarter of fiscal 2022 was $9.9 million or $0.40 per deluded share compared to adjusted net income in Q4 last year, a $14.7 million or $0.58 per deluded share. As Don noted, we are providing guidance for fiscal year 2023 with net sales estimated to be in the range of $1.6 billion to $1.7 billion, a 19% to 26% increase year-over-year."
}