{
    "symbol": "MEIP",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-08 21:00:05",
    "content": " Despite a good start to the year, our success was tempered by the changes at the FDA, relating to its approach to the type of study designs acquired for potential accelerated approval under 21 CFR Part 314.500, Subpart H. The change in approach to accelerated approvals was first communicated to MEI in March of 2022 meeting with the FDA and then expanded upon publicly communicated during an ODAC meeting this past April. Accordingly, in our meeting with the FDA earlier this year, the agency discouraged the submission based on the Phase 2 single-arm TIDAL study and emphasized that MEI and our partner, Kyowa Kirin, continue our efforts with the ongoing randomized Phase 3 COASTAL study as planned. For the ME-344 program, we look forward to initiating the Phase 1B study evaluating the combination with Avastin in the relapsed colorectal cancer patients in the first quarter of the calendar2023 and sharing initial data in and around the year end. While the FDA's adoption of Project FrontRunner outline the new requirements for accelerated approval necessitates, a reconfiguration of our zandelisib program, I think our ultimate success and the value we can deliver to our stakeholders can best be measured by how we approach and overcome obstacles to achieving our mission to improve outcomes for patients with cancer through our efforts to develop and commercialize novel best-in-class therapies. I think that our plan -- I mean, if you recall the Project FrontRunner, the FDA has said that they are still willing to entertain accelerated approval as an example based on randomized data and then the final primary endpoint as full approval. We are continuing efforts to pursue this dialogue with the FDA to really understand what Project FrontRunner is intended and whether the randomized data from the COASTAL study could be used in some sort of an accelerated filing with a follow-up of PFS for the final endpoint, which is the final -- the primary endpoint of the study."
}