{
    "symbol": "BAX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 13:53:04",
    "content": " With that, let me start our prepared remarks by reminding everyone that this presentation, including comments regarding our financial outlook for the first quarter and full year 2023, new product development, the potential impact of recently announced strategic actions, proposed pricing actions, business development and regulatory matters contain forward-looking statements that involve risks and uncertainties. Sales for the fourth quarter 2022 were $3.9 billion, growing 11% on a reported basis, 17% at constant currency and 2% on an operational basis. For the full year sales of $15.1 billion advanced 18% on a reported basis, 23% at constant currency and 2% on an operational basis. Fourth quarter 2022 global sales of $3.9 billion, advanced 11% on a reported basis, 17% on a constant currency basis and 2% operationally. As we've discussed previously, supply for select products remains constrained and we estimate that these constraints impacted our revenues by approximately $50 million in the quarter or approximately 140 basis points. Performance in the quarter was driven by solid growth in our PD business, where we observed an increase in PD patients globally, particularly in the U.S. which saw a sequential improvement in growth of 100 basis points and ended the year with patient growth of approximately 4%. Sales in our Acute Therapies business were $182 million, declining 3% on a constant currency basis and reflecting a tough comparison to the prior year, where we had experienced elevated demand for CRRT given the rise in COVID cases. BioPharma Solutions sales in the quarter were $153 million, increasing 12% on a constant currency basis. Legacy Hillrom contributed $734 million in sales in the quarter compared to $212 million in the prior year period after the acquisition closed on December 13, 2021. Sales in Patient Support Systems declined low single digits in the quarter, primarily driven by lower rental revenues in the quarter as the prior year period benefited from more than $10 million in sales due to COVID-related rentals. Adjusted gross margin of 41.6% decreased 270 basis points versus the prior year, reflecting increased cost of goods sold, primarily driven by the factors we've discussed around inflation, freight and supply chain constraints. Adjusted SG&A of $797 million represented 20.5 as a percentage of sales, an increase of 30 basis points versus the prior year, driven by the addition of Hillrom as well as higher freight expenses. Adjusted R&D spending in the quarter of $157 million represented 4% of sales, an increase of 10 basis points versus prior year. Adjusted net interest expense totaled $117 million in the quarter, an increase of $73 million versus the prior year, driven by higher outstanding debt balances related to the acquisition of Hillrom and the impact of interest rates on the variable rate debt. Legacy Hillrom's Front Line Care, Patient Support Systems and Global Surgical Solutions businesses contributed $2.9 billion to full year sales on a reported basis. In addition to consolidating our operations into 4 vertically integrated global business units, we're also evaluating additional strategic actions, including potential product line and country exits to better position the company for more profitable growth over the mid to long term These exits are expected to reduce sales by more than $100 million as compared to full year '22. Lastly, as it relates to the top line 2022 results, included approximately $140 million of sales that are not expected to repeat in 2023 as well as the benefit of approximately $50 million due to lower customer rebate costs, this includes lower COVID vaccine revenue of approximately $100 million and 2 contractual payments which benefited Renal Care sales by approximately $40 million in the second half of 2022. For full year 2023, we expect global sales growth of 1% to 2% on a reported basis and flat to 1% growth on a constant currency basis. Specific to the first quarter of 2023, we expect global sales to decline by approximately 3% on a reported basis and approximately 1% on a constant currency basis. But as we start to benefit from indices that currently sit at today's levels in the product that we sell in the second half of the year, as we start to benefit from more electronic component availability and only reflected modest, very cautious improvements in this area in the second half and as we add incremental sales to the second half as we always do, the second half margin starts to look a lot nicer and a lot more consistent with the trajectory that we expect to see."
}