{
    "symbol": "MYGN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 23:05:06",
    "content": " In the quarter revenues of $164.9 million increased 11% year-over-year and diagnostic test volumes of 241,000 increased 10% year-over-year, demonstrating strong continued growth in our core businesses. While the first half of the quarter limited our access to providers and patients, particularly in our hereditary cancer business, as women visited their doctors less, delayed routine screening, our path to profitability otherwise remains clear and our confidence in both our 2022 and long-term financial guidance is unchanged and reflects both the challenges we face as well as the benefits of our transformation plan. Powered by Illumina's TSO500 technology and processed by Intermountain Precision Genomics, Precise Tumor is part of Myriad Precise Oncology Solutions, a suite of offerings including our myRisk germline hereditary cancer tests, our myChoice CDx companion diagnostic tests. Driven by GeneSight our Mental Health business unit reported $29.3 million in revenue for the first quarter of 2022, an increase of 66% year-over-year roughly 8,4000 tests processed in the quarter. In the first quarter, our Women's Health business reported $65.5 million in revenue a 19% increase year-over-year. As Paul mentioned this past March we launched Precise Tumor for molecular tumor profiling as part of a suite of precise oncology solutions that combine our myRisk germline hereditary cancer test, myChoice companion diagnostic test and Myriad Genetics tumor profiling test powered by Illumina's TSO 500 technology. Our quarterly results were driven by stable diagnostic test volumes, which despite headwinds in the first six weeks of the quarter brought on by COVID-19 in experience increased 10% compared to last year after excluding divested assets. Looking at product performance, total Q1 test volumes increased 10% compared to Q1 of last year and increased 2% sequentially from last quarter after excluding volumes from divested assets. Hereditary cancer revenue in the first quarter was $70.9 million, a decrease of 7% compared to the first quarter of last year. Prenatal revenue in the quarter increased 35% year-over-year and 6% sequentially, driven by our proprietary Amplified technology which significantly enhances the performance of our Prequel noninvasive prenatal screening test and works to reduce test failure rates so that patients may avoid unnecessary invasive procedures. Pharmacogenomic testing and Mental Health delivered first quarter revenue of $29.3 million, an increase of 66% year-over-year and was flat sequentially, while GeneSight volumes in the first quarter of 84,000, increased 49% year-over-year and 7% sequentially."
}