{
    "symbol": "MYGN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 21:41:06",
    "content": " In the third quarter, the women's health business reported $54.3 million of revenue, with reported quarterly test volumes of roughly 109,000. In the quarter, the Women's Health team celebrates a return to positive quarterly volume growth for our Hereditary Cancer test up 4% year-over-year, and what is typically our seasonally weakest quarter. As Paul stated earlier, overall volume growth was strong in Q3 up 12% year-over-year, excluding divested businesses driven by on-going demand for GeneSight where quarterly volumes grew 34% and renewed growth in our hereditary cancer testing businesses for quarterly volumes grew 4%. And I think what we're seeing in our market research is a significant improvement in customer perceptions of our reputation and the engagement that they have with us, and that's leading some large customers to really take another look at Myriad and giving us opportunity to gain access in places we haven't had for a while to have higher-level conversations. But first and foremost, to your point around ultimately getting to profitability, we want to position the business and the cost structure in a way that is long-term sustainable and really supports the business and generates free cash flow sort of on a stand-alone basis, as you would look at it separate and apart, sort of from the capital and the investments that we're making to really drive our growth acceleration. And then secondly, at the same time that we're doing that, we're also every day going through -- because it is a difficult operating environment, as you've noted, and looking for ways that even in this current circumstance, that we can save money in certain places and utilize that money to reallocate more towards things that are going to help to drive growth. So that's -- as Bryan pointed out, $20 million net to date and that cash and negative $1.8 million of operating cash flow, we feel really good about the sustainability and our ability to self-fund when we're running the business as efficiently as we are."
}