{
    "symbol": "VRSK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 13:33:06",
    "content": " While overall organic constant currency revenue growth, excluding Russian revenues was below our long-term targets, we saw solid performance in our subscription revenues offset by weakness in our transactional revenues due to the continued impact of the work from home environment on certain businesses as we'll describe. Transactional organic constant currency revenue growth of approximately 2%, representing 19% of total revenue, improved slightly in the quarter with sequential improvement in insurance through the solid underwriting growth offset by weaker performance and claims due to ongoing declines in workers' compensation claims volumes across the industry of at least 25%. Energy transactional revenue declined modestly on an organic constant currency basis, due primarily to resource constraints in our consulting business as a result of strong demand from our professionals, particularly in  region as well as tough compares versus last year's rebound level growth rates. Across insurance, we're experiencing strong growth in subscription revenues across both underwriting and claims, resulting in OCC subscription growth of 7.3% segment overall and demonstrate stability and consistency of our business model and the must have nature of our solutions. Consolidated OCC adjusted EBITDA growth was 4.4% in the second quarter, normalizing for the prior year revenue associated with our energy business in Russia and the incremental expenses associated with exiting that business. We saw healthy growth in our industry standard insurance programs, claims analytics, extreme events, life insurance and international specialty business solutions, subscription revenues increased 7.3% while transactional revenues were up 2.7%. We continue to experience strong recovery growth in certain of our transactional businesses, including international travel insurance solution, but continues to be pressured by weakness in workers compensation, as well as softness in personal auto underwriting as the dealing with some dislocation as Mark described earlier. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. But we maintain complete confidence that the transactional driven businesses over time and on a normalized basis will be additive to our overall growth rate and can certainly exceed our 7% long-term target\n And maybe summarizing that, we are taking share across all this. Your line is open. Your line is open. And since you've taken a close look at costs and the insurance business as part of the strategic process, how likely are you able to also take out medium term organic revenue growth for insurance beyond the historical 7% range."
}