{
    "symbol": "VRSK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 11:47:10",
    "content": " We've really been looking forward to this call because it's our first opportunity to reintroduce Verisk in our new insurance-focused configuration, to discuss the momentum in the fourth quarter and given all the structural changes, give you a forward view of our expected performance in 2023. I'd also note that fiscal year 2022, the insurance OCC revenue growth of 6.5% and adjusted EBITDA growth of 8% is a solid result for a year of substantial change and macroeconomic challenges and is a strong reflection of the stability of our business and a good foundation to build on to in 2023 and beyond. There's a lot that you'll be familiar with, including our insurance focus, industry centrality, strong market position, stable growth and strong margins and some new elements that are expanding our growth opportunities in areas such as life assurance, marketing solutions and in our European businesses, including specialty business solutions, where we are improving workflows and efficiency in the Lloyd's nonstandard market. For the fourth quarter, on a consolidated and GAAP basis, revenue was $630 million, up slightly versus the prior year, reflecting growth in insurance, offset by the impact of the VFS and 3E dispositions. Total adjusted EBITDA margin, which includes both organic and inorganic results, was 52.7%, up 210 basis points from the reported results in the prior year, reflecting the benefit from recent dispositions, strong cost and operational discipline, the impact of certain cost reduction actions and the high incremental margins associated with storm-related revenue. Reflecting on our objective to deliver 300 basis points to 500 basis points of margin improvement in 2024 from a normalized base of 50% to 51% in 2021, we took great strides in 2022 with full year adjusted EBITDA margin of 52% on a pro forma basis, reflecting approximately 140 basis points of margin expansion associated with our operational excellence focus."
}