{
    "symbol": "BBAR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-20 15:01:06",
    "content": " Net income for the period is negatively affected by a higher income from net monetary position, given that the quarterly inflation in the first quarter of 2022 was 16.1% compared to 10.2% in the previous quarter. Excluding the effect of the sale of Prisma, net income in the first quarter of 2022 would have been ARS 1.9 billion, 66% lower than fourth quarter of 2021 and 59.1% lower than first quarter of 2021. Net interest income from the first quarter of 2022 was ARS 39.2 billion, increasing 0.6% quarter-over-quarter and 17.4% year-over-year. Interest income increased 6.4% compared to the fourth quarter of 2021, mainly driven by higher income from government securities, especially LELIQ and an increase in CER/UVA clause adjustments, mostly on income from government securities linked to such indexes. Net fee income as of the first quarter of 2022 totaled ARS 6.6 billion, falling 1.9% quarter-over-quarter and increasing 27.5% year-over-year. In the first quarter of 2022, loan loss allowances increased 340.6% quarter-over-quarter and fell 23.6% year-over-year, returning to average values considering the particularly positive impact that took late in the fourth quarter of 2021 and having a particularly good portfolio behavior on the commercial side. During the first quarter of 2022, total operating expenses were ARS 28 billion, increasing 3.5% quarter-over-quarter and falling 6.8% year-over-year, 70% were personnel benefits and administrative expenses versus 65% in the fourth quarter of 2021. In terms of activity, on slide 6, total consolidated financing to the private sector in the first quarter of 2022 totaled ARS 413.2 billion, falling 8.4% in real terms compared to the fourth quarter of 2021 and contracting 10.3% compared to the fourth quarter -- first quarter of 2021. On the funding side, as seen on slide 7, private nonfinancial sector deposits in the first quarter of 2022 totaled ARS 779.6 billion, decreasing 3% year-over-quarter and increasing 1.2% year-over-year. As of the first quarter of 2022, the Bank’s transactional deposits considering checking accounts and saving accounts, represent 60% of total non-financial private deposits versus 64.3% in the fourth quarter of 2021. Exposure to the public sector in the first quarter of 2022, excluding Central Bank instruments, represented 8.9% of total assets above the 8% in the fourth quarter of 2021 and 6.4% in the first quarter of 2021 and way below the 15.5% reported by the system by February 2022, the latest available information."
}