{
    "symbol": "BBAR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-23 14:54:07",
    "content": " At this time, we would like to welcome everyone to BBVA Argentina's Third Quarter 2022 Results Conference Call. Good morning, and welcome to BBVA Argentina's third quarter 2022 earnings conference call. Moving into business dynamics, as you can see on Slide 3 of the webcast presentation, our service offering has evolved in such a way that by the end of September 2022, retail digital clients' penetration reached 62%, slightly increasing from a year back, while that of retail mobile clients reached 55% from 52% as of the same period of last year. Retail digital sales have increased from 79.6% in the third quarter of 2021 to 83.4% of units and represents 55.7% of the Bank's total sales measured in monetary values versus 52.8% in the third quarter of 2021. BBVA Argentina third quarter 2022 net income was ARS9.7 billion, decreasing 50% quarter-over-quarter. Operating income in the third quarter of 2022 was ARS48.4 billion, 24% above the ARS39 billion recorded in the second quarter of 2022. Quarterly operating results are mainly explained by: one, greater interest income; two, higher income from measurement of financial instrument at fair value through P&L; and three, lower operating expenses, mainly personnel expenses. Net income for the period fell 50% quarter-over-quarter due to the contrast generated by the effects of a benefit in the income tax line, as a result of the implications of tax deferrals, recorded in the second quarter of 2022. In the first nine months of 2022, the accumulated net income was ARS34.8 billion, 28% above the ARS27.2 billion recorded in the first nine months of 2021. Net interest income for the third quarter of 2022 was ARS76.6 billion, increasing 15.6% quarter-over-quarter and 43.3% year-over-year. In third quarter of 2022, interest income in monetary terms increased more than interest expenses, mainly due to: one, higher income from government securities; two, an increase in income from interests from loans, in particular, overdraft and discounted instruments; and three, increases in income from CER/UVA clause adjustments. In the quarter, interest income totaled ARS144.3 billion, increasing 18.8% compared to the second quarter of 2022. Quarterly increase is mainly driven by: one, higher income from government securities, both from an increase in the nominal rate and the volume in the position of LELIQ; and two, an increase in interests from loans, mainly overdrafts and discounted instruments, especially due to the increment in interest rates and higher activity. Interest expenses totaled ARS67.7 billion, denoting a 22.5% increase quarter-over-quarter. Interest from time deposits, including investment accounts, explain 70.9% of interest expenses versus 69.3% the previous quarter. Net fee income as of the third quarter of 2022 totaled ARS9.1 billion, decreasing 27.5% quarter-over-quarter. In third quarter 2022, income fell 5.9%, mainly explained by a decline in fee from credit cards, mostly due to the effect of inflation and an increase in the use of the Puntos BBVA benefit program. Regarding fee expenses, this increased 48.4% quarter-over-quarter. In the third quarter of 2022, loan loss allowances increased 37%, mainly due to the periodic update of macroeconomic scenarios in IFRS 9 impairment model. During the third quarter of 2022, total operating expenses were ARS43.8 billion, decreasing 2.9% quarter-over-quarter, 32% were personnel benefits versus 34% on the second quarter of 2022. As of the third quarter of 2022, administrative expenses also decreased 1.8% quarter-over-quarter. The accumulated efficiency ratio as of the third quarter of 2022 was 69%, improving compared to the 71.3% reported in the second quarter of 2022. The quarterly improvement is explained by a decrease in expenses and also an increase in income, both due to a reduction in expenses as well as a significant increase in interest income. In terms of activity on Slide 6, total consolidated financing to the private sector in the third quarter of 2022 totaled ARS582.4 billion falling 8% quarter-over-quarter and 6.4% year-over-year. During the quarter, the decline was especially driven by an 8.6% fall in credit cards, a 13.6% decrease in other loans followed by a 5.7% fall in consumer loans. Loan portfolios were highly impacted by the effect of inflation during the third quarter of 2022, which reached 22%. In nominal terms, BBVA Argentina managed to increase the total loan portfolio by 11.9% during the quarter. BBVA Argentina's consolidated market share of private sector loans reached 8.47% as of the third quarter of 2022, improving from 8.10% . In the third quarter of 2022, asset quality ratio or NPL was 1.07% compared to the 1.08% recorded in the second quarter of 2022. The coverage ratio was 236.87% in the third quarter of 2022, above the 219.39% recorded in the second quarter of 2022. Cost of risk reached 2.65% as of the third quarter of 2022, above second quarter 2022's 1.94%. On the funding side, as seen on Slide 7, private non-financial sector deposits in the third quarter of 2022 totaled ARS1.1 trillion, falling 9.9% quarter-over-quarter and 7.2% year-over-year. The quarterly change is mainly affected by a decrease in sight deposits especially checking accounts by 23.3%, followed by saving accounts by 17.9%. As of the third quarter of 2022, the Bank's transactional deposits considering checking accounts and saving accounts represents 55.2% of total non-financing private deposits versus 60.2% in the second quarter of 2022. In terms of capitalization, BBVA Argentina continues to show strong solvency indicators in the third quarter of 2022. Exposure to the public sector in the third quarter of 2022, excluding Central Bank instruments, representing 9.8% of total assets, slightly above the 9% in the second quarter of 2022 and way below the 13.1% reported by the system as of August 2022."
}