{
    "symbol": "NOG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 15:39:03",
    "content": " Yesterday after the market closed, we released our financial results for the fourth quarter and fiscal 2022. I'm joined here this morning by NOG's Chief Executive Officer, Nick O'Grady; our President, Adam Dirlam; and our Chief Financial Officer, Chad Allen; and our EVP and Chief Engineer, Jim Evans. Our agenda for today's call is as follows: Nick will provide his remarks on the quarter and on our recent accomplishments, then Adam will discuss an overview of operations. Please be advised that our remarks today, including the answers to your questions, may include forward-looking statements within the meaning of the Private Securities Litigation Reform Act. Those risks include, among others, matters that we have discussed in our earnings release as well as in our filings with the SEC, including our Annual Report on Form 10-K and our quarterly reports on Form 10-Q. During today's call, we may discuss certain non-GAAP financial measures, including adjusted EBITDA, adjusted net income and free cash flow. Evelyn comes to NOG with tremendous amounts of capital markets and investor relations experience, and we're excited to have her on board. Despite lower commodity prices and severe weather, we generated approximately $90 million of cash in the fourth quarter, and still we're within annual production guidance. As we entered Q1, the business is back online and building momentum driven by strong turn-in line activity in December. We closed on three Permian acquisitions and in the first week of January, we closed on our Midland Petro transaction. In total, these represented over 750 million of closings and over 900 million in acquisitions announced in 2022, which should translate into more than 20% growth in our year-over-year production on a reduced diluted share account. This is following roughly 40% growth in 2022, all the more impressive given we are in a low growth era for most public energy companies. Despite inflationary pressures, and lower current commodity strips, we expect to generate significant cash flow and production growth in 2023. Our 2023 guidance, which Chad will delve into later reflects capital efficient growth, conservative cost inflation assumptions, and as I just mentioned significant and differentiated volume and cashflow growth throughout the year. At our new elevated level of baseline production, we expect to generate significant levels of free cash flow in 2023, as the Midland Petro project reaches completion, it sets the stage for a substantial increase in free cash flow in the coming years, enabling us to further accelerate the company's growth and enhance shareholder returns. Over the last four years, we've not only rebuilt our infrastructure, augmented the financial strength and improved the asset positions of the company but have also invested in data science to continuously improve our technical analysis. More specifically, we believe our enhanced analytics will enable us to efficiently find differentiated value in properties further enhance our risk management tools. During the fourth quarter, we continued to tactically repurchase our common stock and senior notes as market opportunities allow, we will continue opportunistic common buybacks and debt repurchases throughout 2023 and beyond. A few weeks ago, we announced a 13% increase in our quarterly common stock dividend to $0.34 per share for the first quarter and introduced a plan to accelerate the dividend further to our target of $0.37 per share about two quarters ahead of schedule. Our Goldilocks strategy should give us the ability to both pay healthy, growing current income to our shareholders and also allow for our significant excess retain cash flow to provide for value added bolt-on acquisitions and growth opportunities. Going forward, we remain focused on driving the highest total return to shareholders, focusing on optimal yield tax and capital efficiency and management of our overall leverage levels. The good news is with the business positioned for strength, we anticipate being able to deliver continued growth to our returns, while still leaving room for flexibility and the ability to scale the business responsibly over time. On both the operational and business development fronts, we finished off another transformational year and look to continue our growth trajectory into '23. While initial production results were outperforming internal estimates, winter weather in December impacted production by approximately 10,000 barrels a day. As normal operations return, we expect to receive much of the benefit of our fourth quarter adds moving into the first quarter. Looking further ahead, we anticipate a typical turn-in line schedule, with spuds front-end loaded and completions weighted toward the back half of the year. Given the pull forward in well completions during the back half of '22, our wells in process finished the year totaling 55.4 net wells, with the Williston accounting for roughly 80% of our WIPs, excluding our Marcellus ducts. That said, we added 6.8 net wells in process with the closing of our mascot project in January. And accordingly, we now expect new drilling activity levels to be equally weighted across the Permian and Williston for 2023. In the Marcellus, we have deferred most activity to 2024 as we focus on higher margin oil properties, but continue to look for ways through acreage trades, and other means to potentially add exposure in the back half of the year. Q4 well proposals on our organic acreage remained healthy as we received over 125 AFEs during the quarter, which accounted for roughly 10 net wells. The combination of our operators staying disciplined, and our acquisitions focused on the core of our respective basins led to a consent rate of approximately 95%. As we think about well costs going forward, it has been encouraging to see a deceleration in inflation, which broadly aligns with the conversations that we've had with our operators. We anticipate those minimal increases from leading edge indicators at year-end to carry over into 2023, which results in an estimated 7.5% inflationary increase at the midpoint. As Nick alluded to earlier, the fourth quarter was extremely busy for the business development team as we work to close some of the most impactful acquisitions in company history. The 750 million of M&A completed in Q4 and Q1 has deepened our exposure to top-tier inventory, with the addition of approximately 8000 net acres in the Permian. Overall, our 2022 closed acquisitions and ground game activity added approximately 125 high quality, low breakeven net future locations to our inventory, and 15% to our proven reserves, which increased to an estimated net 330 million barrels of oil equivalent. On the heels of our announced joint development agreement, we have been approached by multiple operators trying to find solutions for existing assets and desired development plans, as well as partnership opportunities to co-bid and acquire operated assets. Not only are we one of the few non-operators with scale, and a balance sheet to help move the needle pursuing large scale acquisitions. These competitive advantages have established NOG as a partner of choice in pursuing operated assets, and at the same time brought in the opportunity set available to us. As we move into 2023 the M&A backlog is spooling and we are reviewing more than $5 billion in non-operated packages, operated packages and joint development opportunities. In the fourth quarter, we closed on 1.2 net wells, and 127 net acres finishing, our 2022 ground game efforts acquiring 8.7 net wells, and over 1400 net acres across 24 transactions. As we look ahead to 2023, we are seeing a variety of compelling opportunities across our respective basins. I'll start by reviewing key fourth quarter results, which were solid across the board despite the impact of the recent winter storms. Our Q4 average daily production was 78,854 BOE per day, a 23% increase compared to Q4 of 2021. Our adjusted EBITDA was 264.8 million in Q4, and top 1 billion for the year, a record for our company. And we generated almost 460 million of free cash flow in 2022, which has more than doubled the prior year. Our adjusted EPS was $1.43 per share in Q4, up roughly 35% year-over-year. Oil differentials were again better than internally expected in Q4 and came in at $2.42 per barrel, due to continued strong in basin pricing and have more barrels weighted towards the Permian, which are typically priced tighter. For the year, our differentials were $2.73 off WTI, a record low for the company, driven by improvements in North Dakota and the diversification of our business over the last several years. Natural gas differentials were 92% of benchmark prices for the fourth quarter, lower sequentially but better than our internal expectations. Lower natural gas and NGL prices drove the reduction a function of lower gathering cost absorption and lower NGL uplift, for the yearly average 113% of NYMEX. On the CapEx front, we invested 142.9 million during the quarter evenly split between the Williston and Permian basins. As Adam mentioned, before turn lines were up dramatically from the third quarter and provide strong momentum as we enter 2023. We closed the $500 million convertible notes offering in the fourth quarter to fund in part, our recent acquisitions. In addition to the convertible notes offering, we're able to expand the capacity of our revolving credit facility to $1 billion from 850 million, reflecting the growth on our borrowing base to 1.6 billion from 1.3 billion. As a result of our M&A activity, we flexed our balance sheet for the announced transactions in the fourth quarter. Our net leverage ratio should return to normal levels by the end of 2023, as our acquisitions contribute to our operations, and we're able to organically delever. In 2022, we retired 25.8 million of our 2028 notes, and we will continue to look for ways to efficiently reduce leverage if market opportunity arises. With respect to hedging since our last report, we opportunistically added volumes in the form of attractive costs collars that provide downside protection with the optionality of participating in the upside of prices rally. As it pertains to our 2023 guidance, with a run rate CapEx from 2020 to of approximately 500 million largely carrying over. This translates to a range of 737 million to 778 million total CapEx guidance for 2023 from  perspective, we expect approximately 60% overhead annual spend will occur in the first half of the year. But the decline in natural gas prices and subsequently what appears to be the beginnings of a reduction in overall rig count, which is down approximately 25 from the peak in the United States could lead to cost savings in six to nine months if the current trend stays in place. Additionally, we've seen debottlenecking and sand tubulars, an added pressure pumping capacity, all green shoots towards stabilization or reduction in costs as the year progresses. Regarding our 2023 production guidance, we expect to start the year at a range of 84,000 to 86,000 BOE per day in Q1, improving each quarter with a target fourth quarter exit rate of 96,000 to 100,000 BOE per day. Overall, the quarterly production should translate to an average range of 91,000 and 96,000 BOE per day for the full year. With respect to the first quarter, we typically see seasonal organic declines and a quarterly guide conservative given the end of winter in the Williston. However, we do expect strong activity throughout the year to drive that higher exit. Differentials, we're taking a conservative view, given the recent downtick in natural gas prices and typical volatility of in basin oil pricing. Nick, my first question, for your Chad, this is on capital spend maybe specifically, we're modeling how should we think about your '23 CapEx sort of pre and post potential transactions or maybe asked another way, do you all assume there'll be at least a minimum amount of ground game additions that we should put in the model and just really trying to speak to CapEx versus production expectations this year? Whether we use it or not, it depends on the  proposals that come in the door, what they're expected spudder sales times are in, compare that to the ground game opportunities that we're seeing day in, day out, so meaning we really wait of returns against one another. I'd say, like any other year, it'll depend on what we're able to get done. And if they're compelling opportunities to flex forward, you know, through the ground game, but again, as I reiterate, we budgeted a pretty hefty amount in our base budget every year for that amount. I'm just basically wondering, maybe for Adam, how stable -- more recently have no  plans have become and if you all receiving what I'd call more or less proposals, than a year ago, I asked that because obviously, a lot of the gas is getting -- gas guys are becoming very volatile. I'm just wondering if you're seeing a bit more stability, and maybe Bakken versus Permian and just wondering how the proposals have become more recently. And I think in the fourth quarter out 125 plus AFEs, we received about 100 of those were in the Williston. And so, looking at the end of the year, if we're looking at our oily basin, kind of makeup, that's about 80% of kind of the wells that are in process right now. Yes, I would just say Neal, based on our guidance that we put forth today are, whether or not the Williston Basin grows as a whole or not, I would probably say it probably remains pretty stable. And I think it's a function of the working interests and the concentration with some of our operators, we've got significantly larger working interests that we're stepping into here at the beginning of the year. And maybe if, I don't know the right way to say, but quality of sort of your ground game and your potential acquisition activity, where do you see upside, like, when you do, back looks at what you did versus what now, with this system. I mean, from a strategic standpoint, especially if we branched out into multiple different basins that the volume of opportunities coming at us is at an all-time high. And when you've got the volatility that you have from a commodity standpoint, as well as the inflationary pressures that ebb and flow, the fact that we've got north of 100 plus operators, all that information needs to be socialized, and it needs to be done quickly, in order for us to -- truly high grade and allocate capital appropriately. And so by instituting the AI program, we're able to take that real-time data and truly harness all the information that we have coming through the  and the revenue checks, as well as all the public data and do that with one source of truth. And so that's going to be the key to our success, as well, as you know, taking the look backs on the various transactions. I think we did one just recently, in terms of kind of the recent major acquisitions, and we were within about 2% to 3% of original underwriting. The only color I would add to that is, we got 9000 gross wellbores at this point in the business. Being in half of every Williston well drilled means you have full bore of knowledge, but the speed of what you can access that data and harness it can take minutes now what would take our engineering team a week to come through in the past. And so, my next question is, just if you can be patient with me for a second because there's a couple pieces to it. But like, if I think about where natural gas prices are today, and obviously the entrance you all made into Appalachia, the first thing that stands out to me as if I look back, when you guys announced that acquisition, gas prices were about 250. So yearly, they're kind of back to where it was when you made that acquisition. I mean, there definitely was a step down in production versus where you originally expected. So I mean, to the latter point, Scott, that transaction, even net of all the hedging we did paid out in one year, meaning we got all our money back in one year of owning it, and it has 20 years of inventory on it. So the pace at which it goes, I would say, the pace has been slightly slower than we thought, but at the same time, the cost structure and well performance has been 20% or 30% better than what we underwrote. And that's really important to us, because I don't, while it is economic today, I don't really think we want to develop our gas properties at $2 gas. For example, buying assets at $100 oil has a lot more risk, even if you're hedging it versus buying it at 50. And buying gas last year was pretty unattractive to us on a risk adjusted return because ultimately, there's a lot more that can go wrong than go right. And so I would say as it pertains to gas, it appears to us at current that the longer term convexity on gas assets is very attractive. But, obviously the big driver, there's weak NGL prices. And of course, realize there's a fixed component that's coming into play relative to lower NYMEX prices. I think, some of the struggles in the Permian, obviously, with gas takeaway is going to also kind of creep into, I guess 2023. And that's kind of where we're being a bit more conservative, I think, with respect to realizations of gas prices. And then you have the price of the NGL basket, which swings wildly, because the actual yields from the plants changes depending on where the what the plants want to do, meaning, whether ethane is economic or not to extract it. But you then -- if you're a three-stream reporter, but you're losing money. And I think the thing to think about, though, is that although NGL, prices came down in in the fourth quarter, gas prices really came down in the first quarter. And so actually, from a ratio perspective, the propane is an example it was about one and a quarter to one versus gas in the fourth quarter, but it's over two today. And so really, the absolute price of the gas versus the NGL impacts that as much and so we tried to be really conservative, because we're not -- we don't have a crystal ball here in terms of where natural gas is going. And if you look at our track record in the past, we've historically been very conservative in this because these are non-controllable costs that we don't really want that there's no benefit to us by doing anything by taking a conservative run at it. But I do think there as Chad mentioned in his prepared comments, there are some -- there is some room for improvement throughout the year. On the reserve report, and just wondering if you can maybe share what your next 12-month PDP decline rate is, I guess, for both oil and gas. I'm assuming it's come down a little bit, but just looking for the approximate magnitude or so. Obviously, as we go through the year, and we start bringing on some of these acquisitions, MPDC projects, those sorts of things are declining, right will increase throughout the year. So as we exit the year, we're probably going to be closer to mid-30s to high 30s and that kind of range, but that's kind of where we're starting out today. And I think, when we roll in PDC, and I think we're sitting right around 10.50 for kind of exit DD&A. So I think once we get that rolled in, are probably somewhere in the 11.50 to 12.50 range, I would guess. And then, the second questions on the acquisitions that you just sort of -- you're just closed on here. I mean, I think maybe a few anecdotes to start first, like, a small anecdote like our first Midland acquisition that we closed in October performing exceptionally well. And we actually just did this look back this morning, and in aggregate, we are ahead of schedule and the assets are performing really well. As a non-operator, you just have to say like anything, this will change and pivot, depending on the environment. And so ultimately, while drilling schedules move around here and there, I don't think we expect any major surprises in 2023. The first one I want to ask is, I know it is definitely way too early to get specific at all on guidance or any type of an outlook for 2024. I mean, I think the simplest way to say this and assuming, obviously, keeping costs constant for a second Donovan, if we spent the same levels of activity this year that we -- next year, we would certainly see growth. We do highlight this in our earnings presentation, but the effective roll off of some of that MPDC activity, and we what we try to highlight is, obviously, the guidance is for 91,000 and 96,000 barrels a day, you're obviously going to exceed that at some point as that project completes. And as Jim pointed out earlier, your decline rate is going to be a little bit higher as you kind of reach that zenith. But you need about   to that wells a year to kind of hold above 90,000 barrels a day flat, public wrote a little bit from that base over time. But obviously, our guidance is more like 750-ish this year. And then, if I could get another -- for second question, I know that it might seem a little bit like a bit of an oddball question. And when you probably haven't gotten in a while, but I am curious to know if you would ever consider taking non-op positions outside of these U.S. shale plays. And I know you don't -- certainly wouldn't fit into a core competency, or you have this real differentiated knowledge base. And so I'm just curious if you think about stepping out into some of these other areas, doing a little like a small degree of dabbling to build that knowledge base. I mean, I think we've seen a handful of Canadian opportunities on our way, and they've never made it past the email inbox. I think, we take great pride, and we take this really seriously about having technical knowledge. And so if you're going to do something, you need to do it well, and I think that, we've seen this one, we've been shopped conventional opportunities in the United States which is within this country. In terms of the M&A landscape, I think the most interesting opportunities that we're seeing currently are within the basins that we're already in. Because we look at the Eagle Ford, we look at the Haynesville, we've looked at the DJ, we've looked in other basins in that regard, but I think even stepping out into any of those basins, you're going to have to have a hurdle rate that's going to need to be compelling in order for us to dedicate significant resources to that. And so I think we'll continue to keep our ear to the ground and take a look at these other basins from a shale standpoint, but even then, it's going to have to be a higher bar. Start with couple of things, was interesting to hear you say that the longer-term outlook is making you see gas assets as very attractive with this pullback and you're certainly looking at those properties. I mean, the number one we don't -- we certainly don't pick some esoteric gas price that we think it should go to, to underwrite these things. We certainly never model in growth, just given the infrastructure constraints within that base. I'd say basins that were not in, use the Haynesville as an example where, we've observed, as it's grown materially, in the last few years, that infrastructure has gotten really tight. Are you --on the path to maybe going non-consent on more of what gets refers to you in for example, Appalachia or other places weight a little bit gassier. And it's more happenstance than a function of the gas environment, but there are no completions this year. So there'll be minimal CapEx, we may expend some drilling CapEx as we prepare for the 24 plan at the end of the year, but not a ton. And so if you have a gap down and commodity pricing, but inflation stays stickies, and there's going to be things that, may or may not meet our hurdle rate. And so I think you've got some buffer in that regard, versus a lot of the science experiments that we've seen in cycles past. And so we don't have a ton of acres in areas that are non-core, we're going to be really subject to some of those things to my advice, as you see now. And the Williston well because we have a large legacy position, we own a lot of non-core properties to ."
}