{
    "symbol": "ALTR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 09:23:08",
    "content": " Total billings for the first quarter 2022 were $171.3 million, an increase of 17.5% compared to Q1 2021, driven primarily by strong new and expansion software opportunities and high retention on our software renewal base. Software product revenue for the quarter was $140.9 million versus $129.5 million in Q1 of 2021, reflecting year-on-year growth of 8.8% or 11.5% in constant currency. Adjusted EBITDA for Q1 2022 was $46.6 million compared to $37 million in Q1 of 2021, an increase of nearly 26% from the first quarter of 2021. While we saw strong software product revenue growth in the quarter, and over 80% of this incremental revenue converted to incremental EBITDA, the balance of the business saw an overall aggregate revenue decline of approximately $1.7 million as compared to the prior year period. Therefore, on a constant currency basis, in the first quarter 2022, we saw year-over-year software product revenue growth and total revenue growth of approximately 11.5% and 9.0%, respectively. Non-GAAP gross margin, which excludes stock-based compensation and restructuring expense, was 81.4% in the first quarter compared to 79.0% in the prior year, an increase of 240 basis points as our software revenue mix, which carries higher gross margins, increased as a percentage of total revenue. Adjusted EBITDA in Q1 2022 was $46.6 million or 29.2% of total revenue compared to $37.0 million or 24.6% in the prior year quarter, an increase of 26.1%. As a result, we expect total revenue for Q2 2022 in the range of $128 million to $131 million or year-over-year growth of 6.7% to 9.2%. For Q2 2022, we expect adjusted EBITDA in the range of $12 million to $14 million or 9.4% to 10.7% of total revenue compared to $9.5 million or 7.9% of total revenue in the year ago period. And for full-year 2022, we are slightly raising our adjusted EBITDA guidance at the midpoint to a range of $98 million to $106 million or 17.3% to 18.2% of total revenue compared to $85.3 million or 16.0% of total revenue in 2021."
}