{
    "symbol": "ALTR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 14:26:06",
    "content": " Software product revenue for the quarter was $116.9 million, up from $99.6 million in Q2 of 2021, reflecting year-on-year growth of 17% or 23% in constant currency. Adjusted EBITDA for Q2 2022 was $16.4 million compared to $9.5 million in Q2 of 2021, an increase of 73% from the second quarter of 2021. Software product revenue in H1 2022 was $257.8 million, up from $229.1 million in H1 2021, reflecting growth of 12.5%. Total billings for the quarter were $125.4 million, an increase of 6.5% compared to Q2 2022, including software billings growth of more than 11%. Total revenue, which includes services and other revenue, was $132.7 million or an increase of 10.6% compared to Q2 2021. Relative to Q2 2021, our software product revenues and total revenues were unfavorably impacted by changes in FX rates of approximately $6 million and $6.6 million, respectively. Therefore, on a constant currency basis, in the second quarter of 2022, we saw year-over-year software product revenue growth and total revenue growth of 23.4% and 16.1%, respectively. Non-GAAP gross margin, which excludes stock-based compensation and restructuring expense, was 79.3% in the second quarter compared to 74.5% in the prior year, an increase of 480 basis points, as our software revenue mix, which carried higher gross margins increased as a percentage of total revenue. Adjusted EBITDA in Q2 2022 was $16.4 million or 12.4% of total revenue compared to $9.5 million or 7.9% in the prior year quarter, an increase of 73.1%. With that backdrop, we are expecting software product revenue for Q3 to be in the range of $99 million to $104 million or a year-over-year change of minus 3.2% to plus 1.7%. Compared to prior year, our Q3 expected software product revenue is being negatively impacted by approximately $7 to $9 million  or 6.5% of growth due to changes in foreign exchange rates. And on a full year basis compared to prior year, our 2022 expanded software product revenue is being negatively impacted by approximately $23 million or 5% of growth due to changes in foreign exchange rates. As a result, we expect total revenue for Q3 2022 in the range of $115 million to $120 million or year-over-year decrease of 5.2% to 1.1%. Compared to prior year, our Q3 expected total revenue is being negatively impacted by more than $7 million or 6.5% of growth due to changes in foreign exchange rates and on a full year basis compared to prior year, our 2022 expected total revenue is being negatively impacted by more than $25 million or almost 5% of growth due to changes in foreign exchange rates. For Q3 2022, we expect adjusted EBITDA in the range of zero to $4 million or zero to 3.3% of the total revenue compared to $14.8 million or 12.2% of total revenue in the year ago period. And for full year 2022, we are now expecting adjusted EBITDA to be in the range of $89 million to $99 million or 15.0% to 17.5% of total revenue compared to $85.3 million or 16% of total revenue in 2021. From the last time we gave guidance for full year and its actually at the midpoint on a constant currency basis, actually guiding up slightly on software product revenue and about just about flat on total revenue with FX having an impact of $13 million to $14 million there on total revenue."
}