{
    "symbol": "ALTR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 19:32:03",
    "content": " Software product revenue as a percentage of total revenue for the first 9 months of 2022, continued a strong positive trend of 87.8% compared to 84.7% during the same period in 2021. Adjusted EBITDA for the first 9 months of 2022 was $69.9 million or 17% of revenue versus $61.3 million or 15.7% of revenue in the same period for 2021, reflecting growth of 14% in a year in which exchange rates dramatically reduced our revenue numbers. Despite significant currency headwinds and an increasingly uncertain economic environment, demand for our products remained high, enabling us to deliver year-over-year revenue growth and a meaningful increase in cash flow, driving results above the midpoint of the range on every metric we guided to for the quarter. Calculated total billings for the quarter were $122.9 million, a year-over-year increase of 4.9% in reported currency and 13.3% in constant currency. Total revenue, which includes services and other revenue was $119.4 million or a decrease of 1.6% compared to Q3 2021 in reported currency. Relative to Q3 2021, our software product revenues and total revenues were unfavorably impacted by changes in FX rates of approximately $8.9 million and $9.6 million, respectively. Therefore, on a constant currency basis, in the third quarter 2022, we saw year-over-year software product revenue growth and total revenue growth of 10.1% and 6.3%, respectively. Non-GAAP gross margin, which excludes stock-based compensation and restructuring expense, was 78.6% in the third quarter compared to 75.2% in the prior year, an increase of 340 basis points, as our software revenue mix, which carries higher gross margins, increased as a percentage of total revenue. For the 9 months ended Q3 2022, adjusted EBITDA grew 14% to $69.9 million or 17.0% of total revenue from $61.3 million or 15.7% of total revenue for the 9 months ended Q3 2021. We generated free cash flow of $5.2 million in the third quarter, and when excluding the payment in the first quarter of the legal settlement assumed as part of the World Programming acquisition, we generated free cash flow of $85.7 million for the first 9 months ended 2022 compared to $48.8 million in the 9 months ended 2021, an increase of more than 75% year-over-year. With that backdrop, we are expecting software product revenue for Q4 in the range of $126 million to $131 million or a year-over-year increase of 3.0% to 7.1%. At the midpoint, when compared to the guidance we gave last quarter, this represents an increase of $4.2 million, offset by a decrease of $6.2 million due to changes in foreign currency exchange rates over the last 3 months. As a result, we expect total revenue for Q4 2022 in the range of $143 million to $148 million or a year-over-year increase of 1.6% to 5.1%. At the midpoint, when compared to the guidance we gave last quarter, this represents an increase of $3.7 million offset by a decrease of $6.7 million due to changes in foreign currency exchange rates over the last 3 months. For Q4 2022, we expect adjusted EBITDA in the range of $22 million to $25 million or 15.4% to 16.9% of total revenue compared to $24.0 million or 17.0% of total revenue in the year ago period. At the midpoint, when compared to the guidance we gave last quarter, this represents an increase of $1 million, offset by a decrease of $1.5 million due to changes in foreign currency exchange rates over the last 3 months. Compared to prior year, our 2022 expected adjusted EBITDA is being negatively impacted by more than $7.5 million due to changes in foreign currency exchange rates. And finally, we are also raising the guidance for full year 2022 free cash flow by $4 million at the midpoint to a range of $14 million to $18 million, which includes the $65.9 million payment for the existing litigation judgment against World Programming that we assumed as part of our acquisition and was paid in January. Excluding this payment, weâ\u0080\u0099re expecting free cash flow for the year of approximately $82 million at the midpoint compared to $53.8 million in 2021, representing an increase of 52%."
}