{
    "symbol": "HRTG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 11:51:03",
    "content": "  And welcome to the Heritage Insurance Holdings, First Quarter 2022, earnings conference call. I would now like to turn the conference over to Kirk Lusk, Chief Financial Officer. In our earnings press release, and our SEC filings, we detail material risks that may cause our future results to differ from our expectations. Our statements are as of today, and we have no obligation to update any forward-looking statements we may make. For a description of the forward-looking statements and the risks that could cause our results to differ materially from those described in the forward-looking statements, please refer to our annual report on Form 10-K earnings release and other SEC filings. With me on the call today is Ernie Garateix, our Chief Executive Officer. I would like to thank our Heritage employees for their dedication to the company, as well as our policyholders. On this call, we will begin with an overview of our performance for the quarter ending March 31, 2022, provide updates on key financial performance metrics and then open the call for Q&A. Despite the substantial increase in net current accident year weather losses during the quarter, we remain encouraged by the rate and form changes implemented throughout the book of business over the last 18 months. These changes, coupled with additional geographic diversification and more restricted underwriting for new and renewal business will continue to positively impact our portfolio. The initiatives to tighten underwriting, an increase rates have improved our average premium per policy by 10.7% from the first quarter of 2021. Therefore, this amount does not include rate changes on policies which have not yet renewed. For perspective, our 2022 voluntary homeowners’ renewals for all states are averaging a 21% rate increase over the prior year with our existing rate changes. We are committed to proactively and appropriately raising rates to offset higher loss costs, and taking underwriting actions to improve our profitability throughout the year. We look forward to finalizing our CAT XOL reinsurance program, which should be completed by the end of this month. We used our SPV, Citrus Re, again this year for a portion of our CAT XOL program specific to the Northeast. We were pleased with the pricing of this $100 million reinsurance cat bond, as we continue to successfully access the capital markets as part of our risk transfer program. We recognize that litigated claims environment has made the Florida market very difficult, and we're taking rating and underwriting actions that we believe will position the company well in the future. As a result of the continued execution of our diversification strategy, 74% of our TIV was outside of Florida, up from 69% as of the first quarter 2021. We think it's important that the TIV increase outside of Florida was distributed among nearly each state, which we conduct business, which improves our overall diversification of risk. The ceded premium ratio was 46.8% in the first quarter, down 60 basis points from 47.4% in the first quarter of 2021. This year-over-year increase also includes $18.8 million of weather losses, up from $16.1 million in the prior year quarter. First quarter 2022 weather losses are primarily attributed to events in Florida, particularly severe storms in mid-January and mid-March. The Florida legislation has taken up some actions to address this issue by a Senate Bill 76, and we're interested in seeing the outcome of the special session later this month. The net combined ratio for the quarter of 2022 was 129.5% which is up from 107.7% in the prior-year period, reflecting a higher net loss ratio, partially offset by lower net expense ratio. Total capital return to shareholders during the first quarter of 2022 was $6.7 million, reflecting a $0.06 per share regular quarterly dividend, and repurchase of shares. During the quarter, we repurchased 721,118 shares at an average price of $6.93 per share, totaling approximately 5 million. Many of our markets and especially Florida, are challenged by social and economic inflation, continued litigation and increasingly severe weather. We have taken considerable actions to mitigate their facts and approve our underwriting results, including taking rate, increasing our inflation guard factor, tightening underwriting standards, and managing exposures. Our actions have improved our portfolio, while claims inflation and litigation associated with continued severe weather is continue to dampen the impact of those improvements. We are committed to taking rate where it is needed, tightening our underwriting standards even further while remaining compliant with state regulatory requirements and changing our products, coverage and exposures. We will consider all options to realize the value of our entities, and we will also take the actions necessary to improve margins. Operator, we're ready to begin the question-and-answer portion of the call. So, stepping back and looking at some of the initiatives that you have done and accomplished over the past several quarters, do you see any area of perhaps where some of the diversity that you hope to inject into the underwriting book might not have lived up to your expectations. So, we continue to look at the book and we're pleased with the actions that are taking. But I think to understand that some of those actions, whether they're non-renewals, increasing rates take 12 to 18 months to flow through the book. So, we are on a monthly and quarterly basis, we are constantly looking at those actions and seeing where it's appropriate to take. So, we continue to look in those areas outside of Florida that we are constantly looking at, but we're overall pleased with the direction in which we're heading on with the underwriting performance. So, for example, we will look at each individual state and our distribution within that state by county between coastal and mainland and adjust the portfolio where we aren't seeing the returns we want to. And then once you take a decision to either, as you think, surgically, shift a little bit tweaked the portfolio. Or for example, in some areas where we've terminated agents that takes some time for those policies to roll off. So those things unfortunately do not happen overnight, takes a little bit of time of that. You've got to get proper notice if it's a non-renewal and some of the rates that we take on our renewal basis, so by time you get those approved, it does take a bit of time. So, we do have some large partnerships with Liberty Mutual, GEICO, Safeco, and NatGen, and we're constantly in communication with -- regarding the business that we're looking to target. And obviously in a true partnership, there are times where we have to pull back in certain areas and they understand, but then we refocus in other areas where it's more profitable for us and they have been very good partners with respect to that. Mr. Newsome, your line is open on our end, perhaps it's muted on yours. They were unusually large by your standards, as well as really anybody else in the industry. So was there anything that would lead us to suggest that this was just a particular concentration of an area, or maybe you could talk about how you define your CAD losses. So first of all, there were six PCS events that we categorize into that, PCS 2211, 2212, 2218, 19, 20 and 21. When you look at the states that that impacted, it was Alabama, Georgia, Florida, and North Carolina predominantly. And also, when you look at, I think our reserving practices, we do had like -- when you look at our reserving practices over since third quarter of 2018, we've had favorable development up till this quarter. But prior to that, we've had till -- from third quarter 2018 until now, have had favorable development to the tune of about $30 million. So, we think our reserving is prudent and accurate. So, I can't speak for anybody else's losses or their reserving, but that's how we look at it. Yeah, we did have $2.4 million worth of development. And again, first quarter in a long time, there was really nothing in particular about that as far as where it was coming from. There's a couple of the storms, Elsa, Fred and Ida, which are all retained for us. Could you talk a little bit about, it may not be precise, but the profitability of the Florida book versus to non-Florida book. Well, with the weather losses, obviously, the Florida book did not perform well. And also due to the tightening of the underwriting standards, we have -- we're looking at that as seeing quarter-over-quarter improvement in that. But again, it's the weather that is driving it obviously this quarter. So, the big topic of the we're really the last year, so there's been underlying claims inflation versus rate. And so, from that standpoint, I think we're building that inappropriate. It seems that the weather bucket is the majority of it, and the cat's bucket isn't necessarily so sizable. Well, the cat bucket was $44 million -- $45 million. We're putting the PCS events into the cat bucket, correct. So, it's a non -  cat. Do you have handy like how many claim counts that came off of those events that relate to that 60 -- I'm sorry, wherever it was, $64 million of  weather. As far as reported claims, as of -- yeah, 3 31, there was 876. So, from that standpoint, we do think that we're okay from a capital position and you'll continue to look at that going forward. In addition to that, I would mention the fact from a cash position, our non-regulated cash is $35 million. It was relatively in line with the year-over-year, but it was up versus the prior three quarters. I would expect it to drop some into the second through the fourth quarter, but probably not to the extent it did last year. We're very optimistic again, we've got a lot of commitments and we're in the process and expect that to be fully placed by the end of the month. And then obviously, you know, in the announcement we didn't go out early and make the cut bomb placement as well."
}