{
    "symbol": "CTRE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 16:08:04",
    "content": " Listeners should not place undue reliance on forward-looking statements and are encouraged to review CareTrust's SEC filings for a more complete discussion of factors that could impact results as well as any financial or other statistical information required by SEC Regulation G. Except as required by law, CareTrust REIT and its affiliates do not undertake to publicly update or revise any forward-looking statements where changes arise as a result of new information, future events, changing circumstances or for any other reason. Despite these shifts we are very careful to underwrite in value assets in today's market as we need to ensure the fundamental at the facility level are in place, or have the ability to reach the necessary key factors for operators to execute on their business plans for the life of our long-term leases. I'd say that it's pretty fluid, not just on the buyers ability, but also operators ability to step in, in some cases where we are today with the particular operator that we might like -- would have liked to enter originally, maybe theyâ\u0080\u0099re a lot stronger that today than they were at the start of the year and that option to retain . Yeah, I think cap rates are probably not moving as quickly just because I think what we're seeing, as Dave mentioned, this phenomenon in recent weeks, really what's taking place is, I think, in the call it, traditional buying market or bank lending market. So I think it's too early to say exactly where cap rates are going, I think we're starting to see just a shift from, kind of the auction process, multiple rounds with the best and final, and numbers call it, in Q1 that were kind of all-time highs to sit now more of a softer market where folks value our transactional acumen or user friendliness, and our ability to write the check. So that's the answer that -- it's, I think -- we've tried to be the best transactional partner we can, and in some instances, maybe there is a need for us just to ride shotgun on a transaction if the building or building in some instances in pretty early and get to underwrite and have a little bit more time to kind of think about who the parents buildings with the operators."
}