{
    "symbol": "CTRE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 19:32:05",
    "content": " I would now like to turn the call over to Lauren Beale, CareTrustâ\u0080\u0099s Senior Vice President and Controller. Participants should be aware that this call is being recorded and listeners are advised that any forward-looking statements made on todayâ\u0080\u0099s call are based on managementâ\u0080\u0099s current expectations, assumptions and beliefs about CareTrustâ\u0080\u0099s business and the environment in which it operates. These statements may include projections regarding future financial performance, dividends, acquisitions, investments, returns, financings and other matters and may or may not reference other matters affecting the companyâ\u0080\u0099s business or the businesses of its tenants, including factors that are beyond their control, such as natural disasters, pandemics such as COVID-19 and governmental actions. Listeners should not place undue reliance on forward-looking statements and are encouraged to review CareTrustâ\u0080\u0099s SEC filings for a more complete discussion of factors that could impact results as well as any financial or other statistical information required by SEC Regulation G. Except as required by law, CareTrust REIT and its affiliates do not undertake to publicly update or revise any forward-looking statements where changes arise as a result of new information, future events, changing circumstances or for any other reason. During the call, the company will reference non-GAAP metrics such as EBITDA, FFO and F-A-D or FAD and normalized EBITDA, FFO and FAD. When viewed together with GAAP results, the company believes these measures can provide a more complete understanding of its business, but cautions that they should not be relied upon to the exclusion of GAAP reports. Yesterday, CareTrust filed its Form 10-Q and accompanying press release and its quarterly financial supplement, each of which can be accessed on the Investor Relations section of CareTrustâ\u0080\u0099s website at www.caretrustreit.com. On the call this morning are Dave Sedgwick, President and Chief Executive Officer; Mark Lamb, Chief Investment Officer; James Callister, Executive Vice President; and myself, Lauren Beale. I will now turn the call over to Dave Sedgwick, CareTrust REITâ\u0080\u0099s President and CEO. First, weâ\u0080\u0099d like to excuse our CFO, Bill Wagner from todayâ\u0080\u0099s call. And on behalf of Bill, we would like to thank you for the many condolences and concern that has been expressed. Now if I can shift gears, zooming out a bit to look at the big picture, todayâ\u0080\u0099s broader economic conditions bring both opportunities and challenges for our business. Historically, healthcare has been a hedge against recessionary pressures as demand for services is unaffected, while tight labor markets tend to loosen. Drilling down further to our market, highly levered buyers have been very active in our space for several years and the tight market â\u0080\u0093 the tight debt market today has caused difficulties for those buyers and therefore slowed some of our pending dispositions. But the flipside is that the rising rates are clearly tipping the scales in our favor on the acquisitions front, we expect to continue to see an uptick in deals across our desk in the coming months. In October, we hosted our operator conference, wherein we collectively address topics like overcoming the tight labor market, purchasing reimbursement, the administrationâ\u0080\u0099s policy proposals and more. Each operator is unique, most are eager to grow with us, while some are very â\u0080\u0093 still very much finding their footing as they continue to manage through historically tough operating conditions. In our supplemental, we are reporting lease coverage on an adjusted basis, excluding assets held-for-sale. We collected 93.4% of rents, inclusive of deposits applied in the quarter, 92.5%, excluding those deposits, and more currently, in October, we collected 95.6% inclusive of deposits applied and 92.7% exclusive of deposits. Even after 30 months of the pandemic, this yearâ\u0080\u0099s bear market and repositioning work, we have produced a 5-year total shareholder return of 22.2% through Q3. As we conclude the portfolio optimization work in the coming months, we will be poised to take advantage of increasing opportunities to grow as you would become accustomed to with CareTrust. As Dave mentioned, we were very pleased to have closed during the quarter on the sale of 7 facilities in Ohio at a purchase price of $52 million. As we sit here today, we have several dispositions progressing towards closing with the target closing dates in the next couple of months. As we weigh the alternatives for these properties, the common objective remains the same to de-risk the portfolio moving forward and efficiently allocate capital for the long-term. Outside of the assets held-for-sale, we have entered into leases to reposition two of the seniors housing facilities to behavioral health and are entering into a lease to retenant two other seniors housing facilities with a tenant that is a new relationship for us. While we had expected to complete most of the dispositions by year end, the dramatically altered debt market has impacted many of our buyers. As interest rates have risen, we have seen many lenders continuing their move to the sidelines as they consider industry headwinds and a looming recession. Nevertheless, we continue to see legitimate interest in our proposed dispositions and we will continue to provide updates to you as deals further solidify and progress. Also for the portfolio in Q3, we closed two real estate secured portfolio loans. In August, we closed on a $22.3 million B piece loan secured by 5 California skilled nursing facilities. And in September, we provided a $24.9 million B piece loan secured by 4 Georgia skilled nursing facilities. Looking to the market, we see increased interest rates, particularly from bridge lenders for widening their spreads while tightening their underwriting standards, specifically increased debt yields and lower LTV and LTC ratios, which we believe these changes have been the drivers of an uptick in deal flow for us. Brokers and investment sales professionals are now commonly advising sellers to take certainty of close over maximizing sales proceeds, giving you an advantage back to the well-capitalized buyers like us who do not depend on bank or debt fund financing to close transactions. Unfortunately, yet predictably, sellers still believe they are going to achieve peak pricing that they could have received in 2021 and early 2022. Turning to the pipe, it currently sits in the $100 million to $125 million range. We are seeing our standard one-off opportunities and also looking at some medium to large-sized portfolios that maybe split up amongst a few of our operators and in some cases, can be used to allow us to launch some new operators as weâ\u0080\u0099ve probably done in the past. For the quarter, normalized FFO decreased 1.7% over the prior year quarter to $36.1 million, and normalized FAD decreased by 2.6% to $38 million. On a per share basis, normalized FFO decreased $0.01 to $0.37 per share and normalized FAD also decreased $0.01 to $0.39 per share. The increase of $200,000 is due to the following 2 items: one, an increase from CPI bumps of $394,000 offset by a decrease of $145,000 from cash collected from tenants who are on a cash basis of accounting; and two, a decrease in reimbursed property expenses of $36,000. Interest expense was up $2.1 million from Q2 due to a higher LIBOR rate, which accounted for most of the increase, totaling $1.6 million and higher borrowings under our revolver, which made up the remaining $486,000. During the quarter, we took additional impairments of $12.3 million on assets held for sale. Property operating expenses were $3.8 million for the quarter, primarily related to the sale of the facilities in Ohio, totaling $3.3 million, with the balance of $500,000 related to properties held for sale. G&A expense was up $181,000 from Q2 due to compensation-related items of $302,000 and offset by other corporate-related items of $121,000. Lastly, we recognized a $4.7 million unrealized loss on our loan portfolio. As interest rates have risen since we placed these investments, the fair value has declined. Cash collections for the quarter, came in at 93.4% of contractual rents and includes the application of $424,000 of security deposits. Without the application of the security deposits, cash collections was 92.5% of contractual cash rent. In October, we collected 95.6% of contractual rents due from our operators, but that percentage includes cash deposits. Excluding those cash deposits, contractual cash rents collected was 92.7%. Leverage also continued to be strong with a net debt to normalized EBITDA ratio of 4.2x, well within our stated range of 4x to 5x. Our net debt to enterprise value was 30.6% as of quarter end, and we achieved a fixed charge coverage ratio of 5.9x. Your line is open. Have we announced a breakdown of that in the past I donâ\u0080\u0099t think we have, Jonathan, so we will have to address that probably on a future call. I guess moving to the portfolio then, could you just talk about â\u0080\u0093 you can give us maybe an update on Covenant Care, Bayshire and the Aspen portfolios, where EBITDAR coverage has either improved or stabilized, but it is below 1x. So take Bayshire and Aspen kind of together, those guys are in our top 10, although we donâ\u0080\u0099t have a lot of buildings with them, because they have made up a â\u0080\u0093 the big acquisition that we did last year, those prime markets here in California, big campuses that there was some turnaround work that needed to be done when we acquired them. And Iâ\u0080\u0099d say that as we sit here today, things are trending a lot better, particularly Aspen is making some great changes at one of those buildings that has been a little bit slower than the other and Bayshire we expect to continue to report increasing coverage on them. And very strong corporate credit and Bayshires, it seems like they are delivering already a little bit ahead of schedule on their turnaround plans there. The new CEO started there in June, and weâ\u0080\u0099re very close to those guys as well and are pleased to see the moves that they are making. Weâ\u0080\u0099re expecting that coverage to increase in coming quarters, and we donâ\u0080\u0099t expect any problems with rent. And then I was hoping you could just kind of talk about your views on transitions or re-tenanting properties and the discussions between you and an operator, obviously, each situation and negotiation is a little different. At the end of the day, the math is simple enough that even I can do it, which is long-term, whatâ\u0080\u0099s the strategy thatâ\u0080\u0099s going to preserve the most value for CareTrust while also being a sustainable win for that operator. We look at when there is a question on the table about an operator going sideways, we really look at all of the options from disposition to re-tenanting to cutting rent and keeping the operator to repurposing. Again, a lot depends on the existing relationship and confidence we have in the current operator. And one more just for me, the all-other tenantsâ\u0080\u0099 bucket, thatâ\u0080\u0099s about 10% of rents. Last quarter, there was an operator that actually had negative coverage that dragged it down. We stay very close to that operator thatâ\u0080\u0099s not in our top 10, but they are big enough to have a pretty big impact to that number. If you exclude them from the number, that 1.11x coverage goes to $1.94, and total portfolio coverage goes to $2.11. The current contractual rent that through Q3, they are current on far exceeds what we would likely achieve from either re-tenanting or a recycling approach. Please go ahead, your line is open. Itâ\u0080\u0099s pretty fluid, as youâ\u0080\u0099ve picked up on about half of the assets that are held for sale are right now under a purchase sale agreement that have dates either year-end or a little bit past that to close. Then the other half, we are a little bit more fluid than that as weâ\u0080\u0099re going down the parallel path of looking at re-tenanting versus selling. I donâ\u0080\u0099t think weâ\u0080\u0099ve given any guidance on eventual value that we expect to get from that, particularly because itâ\u0080\u0099s a moving target as things fall in and fall out of those buckets. And then on the pipeline, just curious on the yields we should expect for the $100 million, $125 million, correct me if that â\u0080\u0093 those numbers were mines I took the best notes there. And I donâ\u0080\u0099t think that included is get correct me if Iâ\u0080\u0099m wrong, but I thought that was seniors housing and behavioral. So itâ\u0080\u0099s starting the 10, mid-10s at this point for skilled nursing. On the behavioral side, itâ\u0080\u0099s somewhere between 9% and 10%. Then on the assisted side, itâ\u0080\u0099s, I would say, kind of mid to low- 9s. I think in my prepared remarks, I said skilled nursing and behavioral, which is what weâ\u0080\u0099re pretty focused on right now, and the composition of the pipeline is made up predominantly of those two groups. However, when we received the expected proceeds from the sale of the properties that are being marketed, that percentage is going to come down, we have looked at swapping to fixed rate on our term loan, but we donâ\u0080\u0099t like those rates when we compare it to the yield curve. So while it may be a bit bumpy for the next 6 months or so with regards to rate exposure, we feel comfortable with where weâ\u0080\u0099re at. Please go ahead, your line is open. Yes, I donâ\u0080\u0099t think Iâ\u0080\u0099ll probably tell you anything you wouldnâ\u0080\u0099t expect to hear on those discussions with potential buyers. Given how much the world has changed since we kicked off this process back in Q1, itâ\u0080\u0099s just become tougher for them as lenders have kind of tightened up their requirements. The second part of the math, I guess, any seller financing on the assets, anything you would consider along those lines to get more assets moved. We will provide that, if needed, to some degree, I mean, we donâ\u0080\u0099t want to get too heavy to that, but we will be flexible to get stuff done that we need to get done. One, you got the Ohio sales done a little bit earlier, which was good to see. And then the second question on the financing side, the deposits, you said, I think, in November, you donâ\u0080\u0099t expect to use any deposits or at least itâ\u0080\u0099s not in kind of the number. With regards to the Trio portfolio, they were not paying rent at all this year. Please go ahead, your line is open. What weâ\u0080\u0099ve heard is that the private market valuations for SNF is actually holding up fairly well, while there is probably some more concerns on the seniors housing side. I think certainly, weâ\u0080\u0099re seeing â\u0080\u0093 and granted, we donâ\u0080\u0099t see a ton of Class A senior housing. I think on the private market field nursing valuation side, I think thatâ\u0080\u0099s actually â\u0080\u0093 a lot has changed in the last couple of weeks and kind of continues to move in our favor more and more every day. Certainly, there is debt available, but itâ\u0080\u0099s not attractive enough for the valuations to stay propped up. And I think really, we are starting to â\u0080\u0093 we are seeing stuff come down almost daily in terms of where pricing was and the new expectations for either brokers or sellers. I know over the past few years, itâ\u0080\u0099s been well above your expectations. So, over the last couple of years, we have been accustomed to buying buildings and assets that maybe have little to no cash flow, but had enough low-hanging fruits in day one changes for ancillaries or insurance expenses to basically grow lease coverage fairly quickly within the first 90 days. I think the end of the public health emergency, I think will be the end of the line for a lot of operators. So I would expect at some point, mid next year to see, call it, more distress. And look, if bridge lenders are somewhere in the 7 to 8, today is probably 6.5 to 6.75 all-in. So, really, REITs are in a pretty good position to kind of pick and choose what works for us and for our operators. So, I think we are probably â\u0080\u0093 my crystal ball is probably 6 months to 12 months away from seeing pricing come down significantly to where, call it, asset economics kind of fit with the values. And I know historically, CareTrust has bought a lot of assets and transitioned out the operators. I think that there is going to be so many opportunities in the coming months of operators that or facilities that have just lost their way, and if you bring in a new operator, fresh leadership can really move the needle. But again, like Mark said, we just take each deal separately and underwrite it to what it can do. Philosophically, strategically, we havenâ\u0080\u0099t written off seniors housing. And so, we are open for business on skilled and seniors and behavioral health. Your line is open. So, this is kind of an age-old question, I guess. There are some where the rent coverage is sub-1.0 on an EBITDAR basis, but still above 1.0 on EBITDARM. Itâ\u0080\u0099s always a little bit murky on the fees in between those two ratios and what is being spent on, how much is truly cash versus non-cash, etcetera. So, the difference for us is we apply the standard 5% management fee to come to â\u0080\u0093 to go from EBITDARM to EBITDAR so that everybody is viewed under the same standard lens. To your question about concern about paying rent, let me be clear that we really do not have any concerns about rent payments from our top 10 tenants in spite of a few of them being under 1x. But generally, that 5% management fee is not completely used for back office, corporate services, and it does produce some extra cash flow for those guys. Your line is open. But given the market that we are in, itâ\u0080\u0099s pretty fluid, and we could see some of that push into next year. And then I just wanted to touch, it looked like one of the assets fell out of the pool of repurposing opportunities this quarter. During the diligence process for licensure for the behavioral health property in that particular market, the timeline to repurpose that was determined to be a lot longer than our operator had originally expected. And so, that caused us to revisit the issue and we mutually agreed that it would probably make more sense for us to just re-tenant that as opposed to agree to a much longer timeline before receiving rent on that property. Just remember that when we give occupancy numbers that are real time, they can fluctuate a little bit as the actual financials come in. And going forward, as it relates to coverage, there is a lot of variables in play right now, from, skilled mix to overall occupancy and what the labor market looks like as the recession takes hold. So, itâ\u0080\u0099s pretty tough to look in a crystal ball right now, but hopefully, we will have some more clarity on that in the next quarter. There are certainly going to be exciting opportunities, we think to expand existing relationships in existing geographies. Your line is open. Again, they have kind of entered this relationship with Sabra, and it is kind of interesting because not that long ago they were just kind of talking purely about their captive REIT. And like we expanded our relationship with them last year, if there is opportunities to do that. And I guess I can just clarify, like I just thought they were kind of going towards building their own REIT. So, it was kind of interesting for them to kind of decide to be a tenant again for a bunch of assets. No, I think they have always prioritized acquiring real estate before their CareTrust spin-off and since their CareTrust spin-off, and I think they would love to do that still. But even with that preference, if you look back, they have done a lot of leases at the same time. So, I think the thing about Ensign is they are very disciplined in their growth and the opportunities that they pursue, whether and they found the ability to be disciplined growers both through real estate and leases. And then, Dave, if you could just indulge me again, your commentary generally today sounded cautiously optimistic, which is great to hear. But you are also kind of hedging that a little bit, if I may use those words with environment, is still somewhat uncertain. I would say that we want to â\u0080\u0093 we really want to see agency, third-party temporary agency usage come down in a meaningful way in those facilities. The best, I would say, sign of stability for an operator is to have essentially no third-party temporary agency staffing. So, while those remain high, itâ\u0080\u0099s going to be a little bit of a constraint on both occupancy growth and just a return to kind of more of a pre-pandemic feel. I would like to turn the call back over to CareTrustâ\u0080\u0099s CEO, Dave Sedgwick, for closing remarks."
}