{
    "symbol": "NOW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 19:27:02",
    "content": " It's time to standardize on the platforms we trust for the long haul.â\u0080\u009d The current macro environment likely will need overnight neither will the theme for automation as companies need to make money, save money and differentiate and they need to do all of that really fast. And looking at SaaS businesses across the industry that have built $200 million or greater in ACV businesses, it's important to call out that ServiceNow is actually accomplished that milestone with 11 businesses in our current portfolio. From an industry perspective, technology, media and telecom led all other verticals growing net new ACV 100% year-over-year and our Better Together go-to-market positioning continue to resonate as we closed 54 deals greater than $1 million in net new ACV with 16 of our top 20 deals containing five or more products. Primarily to reflect the incremental $87 million headwind we're seeing from FX since the end of March, we now expect subscription revenues between $6.915 billion and $6.925 billion, representing 24% year-over-year growth. On all those dimensions, we're now seeing the ServiceNow platform chosen by especially the Global 2000 and that differentiation platform to really get business going either to save money or make money or compete better. And Kash, I think this is now the moment where ServiceNow really gets a big, big tailwind from a macro that forces customers to really think deeply about where they're spending their money. Somewhat of a similar question on getting on the other metrics, just wondering if there's anything you can add to put some context behind that, whether it's a certain industry or something you're seeing and then confidence you have the ability to use free cash flow to offset any moderation you're seeing for the rest of the year I think is very top of mind for investors. So we talked pretty explicitly about not slowing down hiring on feet-on-the-street go-to-market and on critical R&D resources, but we are being much more mindful and planful of other kind of support types of roles, as well as, if you think about T&E expense, event expense, marketing things, we're not cutting anything that's driving demand. And I'm also very -- I'm very happy that we put industries as a priority for CJ and the whole engineering team to link the industry domain expertise of great development in cloud services to the solution experts that actually interface with the account executive in comporting the best possible, road mapping and account plan for every customer we have including how our partners in ServiceNow deliver that impact of business value. Thank you very much, Pat. Thank you very much, Pat."
}