{
    "symbol": "NOW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 21:41:06",
    "content": " With 25.5% constant currency cRPO growth, we actually had better-than-expected new business in Q4 with less reliance on early renewals. Our fundamentals are operating at peak performance, net new innovation for our customers, business impact, driving long-term stickiness of our platform and network effects, giving us a competitive moat with multiple avenues for market expansion and profitable growth with a pristine balance sheet. While constant currency cRPO growth came in just shy of our guidance of 26%, we actually outperformed our target for net new ACV and renewal ACV for contracts expiring in the quarter. Thank you very much, Brad. And in the quarter, our target forecast for net new ACV as well as renewal ACV within the quarter actually overachieved, which is why we were able to come out with a strong 2023 revenue guide and why we feel good about not only the Q4 results, but also the position that we stand in the market as well entering 2023. And we also knew that they weren't going to give up on their digital business dreams and they would be investing to reorient business models, as Gina said and think differently about their enterprise, which CJ's example underscored and growth would still remain on the agenda. And with a loyal customer base that will remain ever loyal with many upsells, cross-sells and same account revenue growth, if you get new business on top of that because you're building the best product in the world, you're going to have the defining enterprise software company in the 21st century. And I think we heard last quarter and correct me if I'm wrong, that new customer acquisition had slowed relative to, say, Q2 where I think for new revenue, you had talked about maybe 10% of growth was coming from new customers. So clearly, we're thrilled with the net new ACV growth that we're seeing, and not only are our expansion rates strong within the quarter and for the full year in 2022, we were really, really pleased to see that new customer, net new ACV grew over 30% year-over-year despite the headwinds. Thank you very much, Brad. Yes, Keith, I'll tell you that 30% net new ACV -- net new customer ACV growth, we're really proud of in the quarter."
}