{
    "symbol": "ASTE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 14:37:05",
    "content": "  Operator: Hello, and welcome to the Astec Industries Fourth Quarter Earnings Call. Thank you, and welcome to the Astec fourth quarter 2022 earnings conference call. Joining me on todayâ\u0080\u0099s call are Jaco van der Merwe, Chief Executive Officer; and Becky Weyenberg, Chief Financial Officer. In just a moment, Iâ\u0080\u0099ll turn the call over to Jaco to provide comments, and then Becky will summarize our financial results. Before we begin, Iâ\u0080\u0099ll remind you that our discussion this morning may contain forward-looking statements that relate to the future performance of the company, and these statements are intended to qualify for the Safe Harbor liability established by the Private Securities Litigation Reform Act. In an effort to provide investors with additional information regarding the companyâ\u0080\u0099s results, the company refers to various U.S. GAAP, which are generally accepted accounting principles, and non-GAAP financial measures, which management believes provide useful information to investors. All related earnings materials are posted on our website at www.astecindustries.com, including our presentation, which is under the Investor Relations and Presentation tabs. Good morning, everyone, and thank you for joining us this morning. When I joined the company six years ago, I was drawn by what I saw, a strong company with a history of delivering valued product that had tremendous potential. Astec has established itself as a market leader in the industries we serve, bringing innovative solutions to the road construction industry for over 50 years. We have made progress, and Iâ\u0080\u0099m proud to be part of the team that has moved us forward. Iâ\u0080\u0099ll share more detail in a few minutes, but the priorities are executing on our simplify, focus and grow strategy and delivering on our commitments to employees, customers and shareholders. As CEO, I will continue to champion these priorities for the organization, while emphasizing the importance of execution to drive consistent and sustainable financial performance. Through our Built To Connect purpose, we are enabling our employees to create a customer-centric culture that provides value, and this will benefit our shareholders. On Slide 5, you can see in the end markets we serve through our two complementary segments, ensuring that needed materials are delivered and installed for ongoing infrastructure investments. The 3 pillars of our strategy: Simplify, Focus and Grow are best summarized on Slide 6. Beginning with Simplify, we are optimizing organizational structure by reducing complexity across our organization, starting with the leadership team and extending into select areas. We are also using Simplify to help optimize our product portfolio, including, which products we make, how we make them and where we make them. Once we simplify and remove unnecessary complexity, we are better able to focus using the OneASTEC business model to drive excellence in everything we do. Operational excellence is permeating our entire organization, driving a focus on quality and performance into our culture. Prior strategic actions under review currently include our Drive to 2025 initiative, the performance of our Brazil business, our site closure Mequon and Tacoma and the integrations of recent acquisitions. As we do this, we discovered that operational excellence is not only for production teams, but is applicable to all areas, such as commercial teams where we can elevate the customer experience through aftermarket excellence. Profitable growth will be driven by expanding our parts and service business, our dealer networks and our international presence. Together, these three pillars of Simplify, Focus and Grow help ensure we have the right priorities to consistently drive profitable and sustainable growth as we bring value to our customers, employees, partners and shareholders. The global Astec team rose to the challenge by demonstrating our core values, delivering unique solutions and by providing outstanding customer service to our valued commercial partners. In addition to the strong effort of our team, we benefited from robust end market demand across both segments. Positive customer sentiment is proving sustainable even in the face of ongoing macroeconomic uncertainty, and our record-level backlog gives us confidence as we enter 2023. As a market leader in our industry, we develop and deliver technology that enable our customers to be successful. As we enter 2023, the demand outlook is much the same as it was during the second half of 2022. Infrastructure projects, which tend to be longer-term and less correlated with near-term economic fluctuations have remained robust, and our customer sentiment has remained positive. As funding begins to flow from the Federal Infrastructure Investment and Jobs Act, we expect this to provide future revenue growth and visibility. The health and reliability of the supply chain we rely on has shown improvement over the last year, eliminating some of the challenges we encountered. At the same time, we are implementing operational excellence initiatives to mitigate future disruptions in our supply chain. As you can see, backlog at the end of Q4 is down slightly from the record level we established in the previous quarter. Over the past two years, our backlog has increased 153% and some moderation is expected. We are making steady progress on our initiatives to convert backlog and expect to see this trend continue as order rates normalize, and we increase output. It directs us as we leverage our global footprint to reduce lead times, optimize revenue and manage costs. This model is a critical component of our success, and I believe it has become an ingrained component of our culture that will enable continued future success. And we will continue to prioritize these initiatives while we keep our eyes open for selective opportunities to acquire businesses that meet our disciplined, strategic and financial focus. Slide 14 shows a carbon footprint model where we can employ our materials knowledge, process tools and telematics to monitor and drive lower emissions. Staying on the theme of telematics Slide 15 shows how we are developing comprehensive digital solutions, including positive contributions from our Grathwol and MINDS acquisitions. This approach aligns well with Simplify, Focus and Grow framework as we develop capabilities that improve our operations, elevates the customer experience for our partners and expands our ability to grow into high-value market opportunities. Finally, bringing these slides together on Slide 16, we highlight the Astec Digital suite. And while Iâ\u0080\u0099m proud of the progress we have made, I am even more excited about the path we have in front of us to deliver sustainable, profitable growth. With that, I will now turn the call over to Becky to discuss our detailed financial results. Sales were $349.9 million, up 31.2% with strong growth in both equipment and parts, which increased 45.3% and 11.8%, respectively. By region, there was a 32.2% increase in domestic sales and a 27.4% increase in international sales. Strong demand also kept backlog near the record level we established in Q3, coming down slightly as we increased output and order rates are beginning to normalize. Compared with last year, backlog is up 19.7% on a consolidated basis. By segment, Infrastructure Solutions backlog grew 26.2%, while Material Solutions increased 8.9%. Domestic backlog saw the greatest increase, improving 23.3%. However, International was also up growing 2.8%. Adjusted EBITDA increased $22.2 million, expanding adjusted EBITDA margin 370 basis points to 6.3%. This was primarily due to the net positive impact of volume, pricing and mix that outpaced inflation and higher manufacturing costs due to lingering inefficiencies in the supply chain. This quarter, we realized significant pricing, which helped improve profitability and drive margins. We did see an increase in adjusted SGA&E, which was up 6% as we invested in headcount, incurred expenses for our transformation program as well as incremental costs from acquired businesses. Adjusted earnings per share was $0.34, driven by increase in gross profit and maintaining cost controls and operating expenses. This excludes costs driven by our transformation program, which will optimize our company for long-term value creation. We also recorded foreign valuation allowances of $5.8 million, primarily associated with our Brazil entity. As a result, our adjusted net effective tax rate for the quarter was 47.6%. For 2023, we expect our normalized net effective tax rate to be in the 23% to 24% range. Infrastructure Solutions sales increased 27.1% to $238.4 million in the quarter, primarily due to strong global demand for our solutions, especially equipment and favorable net volume, pricing and mix. Demand was up for both domestic and international sales increasing 26.9% and 28.2%, respectively. By product, equipment sales were up 42.1% and parts sales grew 6.6%. Segment gross profit increased 34.3% to $48.2 million, and gross margin increased 110 basis points to 20.2%, primarily due to the impact of favorable volume, pricing and mix. Our Materials Solutions sales increased 39% to $109.8 million, driven by strong global demand for equipment and parts along with favorable volume, pricing and mix. However, gross margin decreased 50 basis points to 19.8%, due primarily to cost inflation and manufacturing inefficiencies this quarter that offset volume, pricing and mix for the segment. On Slide 21, we highlight the key drivers of our year-over-year adjusted EBITDA bridge. EBITDA improved significantly in the fourth quarter, up 217.1% to $22.2 million, which caused EBITDA margin to expand 370 basis points to 6.3%. The positive contribution from volume, pricing and mix more than offset the impact from inflation. Negative manufacturing efficiencies due to supply chain disruptions are still having a lingering effect and SGA&E were slightly higher due to increased commissions, research and development costs and the addition of personnel associated with our MINDS acquisition. On Slide 22, we show full year results. Adjusted EBITDA grew 8.8%, even with the various supply chain and manufacturing efficiency headwinds we encountered this year, which is a testament to the entire team for performing in a challenging environment. We continue to invest in growth, which brought our cash position down to $62.8 million reflecting an increase in inventory and CapEx to meet demand and improve productivity and capacity. Our balance sheet remains solid, and we expect our cash position to grow as we manage working capital and resolve supply chain disruptions. Should we need to incur higher debt levels in the future, we will strive to operate between 1.5 to 2.5 times net debt-to-EBITDA. We maintain a disciplined framework to capital deployment, balancing investments in growth with returning cash to shareholders. In 2022, we spent $41 million on CapEx to invest in projects to improve operational efficiencies and advance our long-term strategy. Turning to Slide 26, I would like to review our key investment highlights. Despite all the changes we saw in 2022, one thing that has remained constant is our customersâ\u0080\u0099 desire for our unique solutions. We have built a leadership position by delivering innovative, high-quality products and superior customer service. As the global installed base of Astec products grow, it creates the need for reliable aftermarket parts that tends to be reoccurring and less cyclical. This strong OEM aftermarket combination, coupled with improving operational excellence, improves our financial returns. As a result, we have a strong balance sheet that enabled us to strategically invest and grow. Finally, our commitment to the Simplify, Focus and Grow strategic pillars unite our organization and drives improvement in everything we do. We saw improvements in nearly all financial metrics in 2022 and have made progress on achieving our long-term financial targets, shown on Slide 27. The plans we have in place including the Oracle implementation plus our teamâ\u0080\u0099s actions to live out our core values daily gives us confidence that these targets are attainable, and that 2023 will be a good year for Astec. Iâ\u0080\u0099m humble and grateful to be the CEO of such a wonderful team and organization, and Iâ\u0080\u0099m excited about where we are going and what we can accomplish together in 2023 and beyond. Your line is open. Obviously, youâ\u0080\u0099re not new to Astec, but you are new to the CEO role. The first 60 days, I visited 12 of our U.S. facilities, and I met through a significant number of people on all levels and organization. And one thing thatâ\u0080\u0099s very clear to me is that we have a lot of good people in our organization, a lot of people thatâ\u0080\u0099s really focused on delivering results for us. Iâ\u0080\u0099ve also spent quite a bit of time talking to customers, visiting various industry events, specifically the National Asphalt Pavement Association. And obviously, that provides us some confidence for this year. So very positive first 60 days, lots of work, a lot of traveling going on. But I think we have a strong organization behind us and even more important, our customers are very positive at this point in time. I guess, my next question would be, it looks like guidance is still suspended. I mean, obviously, as part of our Simplify, Focus and Grow, weâ\u0080\u0099re going to continue to drive our operational excellence. As you guys know, the volatility in the supply chain is still there. And as that improves, we should see a positive effect on margins. Steel pricing is a little bit fluctuating, as you guys very well know. Weâ\u0080\u0099ve seen steel pricing moderating a little bit, however, recently turning back upwards. And that will help us as well, creating a stable environment and improving efficiencies in manufacturing. As you guys see, weâ\u0080\u0099ve had a positive effect on pricing this year, and weâ\u0080\u0099re going to continue to work on that. Your sales in the quarter were the highest since the pandemic by a pretty sizable amount, yet the drag on EBITDA for manufacturing efficiencies got a little bit worse. Obviously, supply chain disruptions are not over yet. So weâ\u0080\u0099ve seen that specifically more in our mobile equipment side, where thereâ\u0080\u0099s obviously a large number of parts that goes into equipment. Your line is open. Hey, good morning, everyone Jaco, welcome to the call. So obviously, for me, personally, parts is something that Iâ\u0080\u0099m very passionate about. So as the move plays out and as we get to the teams back performing before â\u0080\u0093 like before we closed the facilities, I think those results will continue to be positive. With previous positions, help us from memory, legacy Astec had some issues on the manufacturing side and on the distribution side in the International, I suppose on the margin side. If you look at our traditional market shares, obviously, the U.S. is much stronger for us. However, we need to be smart about it and make sure that we have the right manufacturing footprints and the right supply chain processes. So in our future growth, as we make our plans to grow internationally, finding the right footprint and the right supply chain processes will be important for us. I would add to that, that under our decentralized structure previously as Jaco said exploring to those sites. We were structured to fully optimize getting product to those sites, but we want Astec considering those as manufacturing sites, it opens up a lot of opportunities for us. Inventories are up, obviously, just because of inflation and other things. Our inventories are up year-over-year, but so is our backlog, and we continue to see good order intake. But certainly, weâ\u0080\u0099re challenging the rest of the sites to improve their turns across the house, weâ\u0080\u0099re challenging everyone to improve their returns. So we expect that inventory with the focus we have on it to come down, but just being mindful that it does move in conjunction with backlog. Your line is open. I wanted to ask about a couple, I know youâ\u0080\u0099re not guiding for 2023, but a couple of lines, maybe you can offer some help if you didnâ\u0080\u0099t provide it in the detailed review this morning. Steve, with the SG&A run rate, we do think weâ\u0080\u0099ll be pretty flat year-over-year on a percentage of sales basis. We are taking some restructure â\u0080\u0093 limited restructuring actions, not necessarily all SGA&E, but we are also we acquired MINDS, which is software engineers, and that all sits in SG&A. Also, as a reminder, we have CONEXPO this year. So Q1, we always see an uptick and not that this is all SG&A either, but just Iâ\u0080\u0099ll throw in that weâ\u0080\u0099re continuing to roll out our systems. So it will be a little bit lumpy, but itâ\u0080\u0099s still â\u0080\u0093 it will be pretty flat with last year. I know youâ\u0080\u0099re aware of this, so â\u0080\u0093 or many others, but the CONEXPO shows once every three years. Obviously, this was the first quarter we saw backlog down. As I mentioned, when we met with a significant amount of our customers at NAPA, everybody was still very optimistic. But just for January, weâ\u0080\u0099ve seen an $8 million uptick again in backlog. I talked to a lot of companies that are sitting on very significant backlog, and itâ\u0080\u0099s provided them the flexibility to be much more aggressive on the pricing side simply because youâ\u0080\u0099re sitting on this much backlog, you can be willing to lose lower margin business. On capital equipment, obviously, you have to think a little bit forward and dissipate. And one thing to consider is if a customer buys an asphalt plant from us, that customer has a lifespan on that equipment for 30 years. Your line is open. Obviously, a big increase in equipment sales. I mean if you â\u0080\u0093 the reduction in backlog is obviously a function of getting additional volume out, I will say that our teams have done a really good job implementing some significant CapEx projects. Weâ\u0080\u0099ve also, over the last year, invested significantly in manufacturing engineering capability. But you talked about dealer expansion and strategic accounts, and you also mentioned digital connectivity and telematics. Or is that in the future or just kind of right level on those initiatives, if you can. And on the mobile equipment side, the teams have now significantly transitioned to dealers. And what happened last year was the teams have really put good structure in place around how we manage dealers, how do we agree on performance with the dealers. And that process, in my mind, is really going to drive the performance of our dealers. Our teams have also been successful with â\u0080\u0093 weâ\u0080\u0099re expanding dealers across the country, and we still have a few white spaces in the U.S., but overall, we â\u0080\u0093 the guys have done a really good job expanding that. On the strategic account side, this is something that Iâ\u0080\u0099m very passionate about as we see consolidation in our customer base, we need to be good dealing with the larger customers. With the MINDS acquisition, the Grathwol acquisition of about two years ago, taking and putting all of those things together with the current technology we have is something that we are working on right now. Thank you, Brett, and well to talk about it, anyone whoâ\u0080\u0099s going to be out in Vegas for CONEXPO, please stop by our booth in Central Hall and see us. This will conclude our call, but Iâ\u0080\u0099m happy to connect with you if you have additional questions later."
}