{
    "symbol": "CASY",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-08 13:13:11",
    "content": " Your line is now open. It did not in the second quarter for the reasons that we talked about, and some of that is just the comps around opex growth are going to get a little easier for us here in the second year, so we’re lapping hard closures of operating hours in the prior year and then re-openings, and we have special COVID pay coming on and off in the prior year, which makes it very lumpy in terms of what’s happening with opex, but in the second half of the year as we sit here now, I think we’ve got a pretty good line of sight that gross profit dollars will consistently outperform from a growth standpoint, the operating expense growth. Your line is now open. Yes, just to drill down on the cost of running the new and the acquired stores, in the first quarter when we did that bridge, and we have it on our website - you know, growth in M&A units contributed about 8% of year-over-year increase in total, and you may remember we didn’t close on the actual acquisition of these stores on the very first day of the quarter, it was a couple weeks after the quarter had started, and so now in the second quarter, we have obviously those units for the entire quarter, which is a couple of extra weeks, and we’ve got a 9% contribution to the operating expense increase. Your line is now open. Your line is now open. I think we’ll spend--we’ll still have several million dollars of integration related costs, right, where we’re extra training, etc., which was all part of--you know, when we gave the expectation earlier this year, I think it’s about $45 million of EBITDA contribution from Buchanan, that would have been inclusive of all of those costs, so I do think we’ll spend several million dollars more for, frankly, all three acquisitions - Circle K, Buchanan and Pilot, in the second half of the year, and they will be integration and consistent with the overall accretion expectation of EBITDA. Yes, and Ben, the only thing I’d add to that is the largest element of our operating expenses is stores and the labor and team members in those stores, and what we highlighted a little bit earlier today was that in spite of growing our two-year same store comps roughly 10%, we had a 3.5% reduction in hours, so I think our operations team is acutely aware of the need to operate our stores efficiently, and we’ve been able to take labor hours out of the stores while still accelerating the store growth on a more comparable basis. Your line is now open. Your line is now open. Yes, and I think I’d just follow up on that, Bobby, the beauty of our model is our ability to go back and forth between building new units and buying units, and so to the extent there is digestion, I guess you saw it a little bit in the decisions we’ve made, so we’ve reduced our capital spending expectation this year because we’re going to build fewer number of units than we had thought at the start of the year, and some of that is supply chain related but primarily it’s a function of we’re able to buy more than we would have expected at the beginning of the year. If you’re looking including or excluding credit card fees, credit card fees are higher for sure, but I’ll exclude that for a second, so same store opex excluding the credit card, it is primarily a wage story, right, and so there is no doubt that last year, there were quite a bit of minimum wage increases across our footprint, and then as COVID continued to be more of a significant issue, we obviously then started to deal with broad-based industry wage pressure, and so yes, it’s much more of a wage pressure dynamic in terms of what’s driving the two-year same store opex number for us. Like I said before, because we had cost of goods largely locked in across categories through the balance of the calendar year, we saw it as an opportunity to maintain margins and take some share, and like I said before, we have done that, and now as we move into the new calendar year, we think there’s going to be a lot of folks under increasing cost pressure, and that’s going to drive retails up, and we’ll be able to take retail price along with them and at the same time maintain a competitive delta and still be able to grow share. Your line is now open. Your line is now open. Your line is now open. It’s not going to be significantly different because the credit card--the two things that are driving it, there’s more units for sure coming in with Pilot, credit card fees are higher both at the acquired stores, frankly, but there’s a lot more stores in the mother ship, so I think by the time we get to the end of the year, it’s not going to be significantly different than a 50/50 split, probably a little more weighted to same store just as you think about the overall number of units and the fact that, again, most of our integration-related spending has already been completed, and so that is going to drop out of the reconciliation to a large extent for new units, so modestly over-weighted to same stores by the time we get to the end of the year."
}