{
    "symbol": "CASY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-09 12:06:04",
    "content": " 7:38 During the third quarter, same-store fuel gallon sold around 5.7% with a fuel margin of 38.3 cents per gallon, up approximately $5.4 per gallon, compared to the same period last year. Retail fuel sales were up $851 million in the third quarter, driven by a 19.9% increase of total gallon sold to 622 million gallons, as well as a 48% increase in the average retail price per gallon. Casey's had gross profit of $664 million in the third quarter, an increase of $124 million or nearly 23% from the prior year. 14:50 Finally, due to the higher retail fuel prices mentioned earlier, same-store credit card fees also rose and less accounted for another 2% of the operating expense increase in the quarter and finally 2% of the increase is due to higher incentive compensation. 15:45 Net income was up in the prior year versus the prior year to $64 million, EBITDA for the quarter was $173.5 million, compared to $125.7 million a year ago and increase of 38%. But we will roll into a 4% increase, and then the price increases that I mentioned coming in March, are going to be somewhere in the neighborhood of 5% to 6% on average, across most of -- most of our prepared food SKUs and again, those we won't absorb all of that in the current quarter. We were -- I think lined up, the price increase in the cost increase was more closely aligned in the grocery business, because that business primarily is contractual for us and so as we worked through annual contract renegotiations, over the last couple months with our supplier partners, we had a pretty good sense of where those we're gonna land and we're able to act on retail adjustments, really about the same time that the cost started coming through the prepared food business is much less contractual and much more commodity oriented in nature and so it's a little bit tougher for us to line that up, exactly an enhanced tends to lag. We actually take LIFO charges almost every quarter, just the way that the accounting works, in a kind of non-inflationary environment, they tend to be de minimis and we don't obviously talk about them very often because of the environment that we're in and because so much of our grocery business is on a calendar year, the renegotiations all really began on January 1 and so the way you do that is you take a charge when they come through and so hence, that's a January 1 item. And from a gallon standpoint, this will seem counterintuitive, but when -- when you see prices rapidly increasing like we have over the last week, the consumer behavior tends to be more of aggressive buying, as opposed to not aggressive buying because people are afraid it's going to be $0.20 more a gallon tomorrow than it is today. And then the last point I'd make is, the national numbers really don't describe what goes on in the Midwest and so the national numbers for retail prices of fuel are heavily influenced by the Northeast and the West Coast, which are well over $4 a gallon, as we sit here today in our market, we're sitting just under $4 a gallon across our 16 state geography in the Midwest, tends to be pretty low relative to others and part of that is because we blend a lot of ethanol and ethanol right now is trading at about $0.70 or $0.80 below gasoline. 50:41 Yes, right now, we think the consumer is in pretty good shape, about 60% of our -- our guests make over $50,000 a year, and, in a lot of those have seen some of the -- the most accelerated wage increases. 51:45 So if you think about our prepared food offering today, it is already just naturally more value-oriented relative to QSR, fast casual, and certainly then, in full service dining, when you think about a specialty pizzas, an example, a whole pie that can feed 3 to 4 people being at around $16, $50, $17 a pie, that's a -- that's a really great value for a family. So, again, if we persist at $120, that's expensive, but not -- not nearly towards a peak from a historic perspective and I and I think more importantly, from to answer your question on the margin is, regardless of whether crude oils at $120 or $140 or $180, or not, the structural situation we have in this industry isn't changing, underlying costs operate, this business is still going up, it's still getting more expensive for the smaller operators to continue to survive."
}