{
    "symbol": "CASY",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-08 12:46:06",
    "content": " Your line is open. I think the primary influence on the way opex will play out over the course of the four quarters next year is what we’re lapping in fiscal 2022, so half of our increase will still be from new units and that includes the units that we lapped in the prior year, and so we didn’t close the Buchanan acquisition until the middle of May last year, we didn’t close the Circle K acquisition until the end of May, so we will pick up at least a month as the case may be of kind of incremental opex, just from those two acquisitions, and then we still have to lap Pilot later in the year, so that’s what drives most of it. The other thing I would add is that credit card fees are a bit of a wildcard at this point in terms of the high fuel--high retail price of fuel and what that impact can be, and to put that in context, for every $0.10 in retail price increase, that equates to about $4 million in incremental credit card fees on an annualized basis, so as fuel prices are continuing to soar into record high territory, we’ll still feel that impact on credit card fees, and it’s hard to predict at this point where the top is and when that may start to decline, so we’ve factored in some of that into the opex guide for the year. Your line is open. The grocery and general merch side is going to be a little bit more manageable because, as we’ve discussed before, those agreements with the major CPG manufacturers are on a calendar year basis, and we took some of those cost increases January 1 and we had planned retail price increases to mitigate those, and so as you’ve seen, we’ve still be able to have margin expansion in grocery and GM in spite of the inflation, so we think we’re pretty solid in that side of the ledger. On the prepared foods, it is more commodity based, and so that tends to be a little bit les ratable, but we’ve taken three retail price increases so far since October of last year, one of them most recently in the last couple of weeks, and we think we have more pricing power there because it’s a little less commoditized at retail, meaning nobody really knows what the proper price for a slice of pizza should be or for a breakfast sandwich, so we believe we have a little more pricing power there. Your line is open. Now, there is a bit of a wildcard in there and that’s with the retail price of fuel, because I think margins tend to expand a bit to compensate for the credit card fees associated with higher retail prices, so I would anticipate that those can maybe go up in the short term as we see these really high fuel prices and then they could come back down a little bit to offset that, so net-net you end up in the same place. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. If I do the two categories separately, because we’ve behaved a little bit differently in the grocery versus prepared food, most of our grocery price increases excluding tobacco, I think were put into action at the beginning of this calendar year just based on the contractual nature of that business, and so we know what the inflation is across most of the center of the store through our joint business planning exercise, and most of those price increases were put in place in January, so let’s call that low to mid single digits, depending on what the particular category is. They’ve started at different points in time - you know, some of them started later last year calendar year, and the more significant ones started either in the middle of the fourth quarter for us or literally at the beginning of this fiscal year, but it’s a mid single digit kind of price increase, it is rolling through over the course of the year, we’ll get the benefit of most of that the entire year. Your line is open. I think we slowed down new builds in fiscal ’22 mainly because we were digesting so many acquired units, and that’s the beauty of our model, is we can kind of hold on the land bank, and so you’re going to have the first part of this year some units that we, frankly, could have opened last year and chose not to, but as we sit here today, probably it’s half and half, and that’s the biggest contributor to why the run rate of total capex is kind of that $450 million to $500 million. Your line is open."
}