{
    "symbol": "CASY",
    "quarter": 1,
    "year": 2022,
    "date": "2021-09-08 15:37:06",
    "content": " I would now like to turn the conference over to your speaker today, Brian Johnson, Senior VP of Investor Relations and Business Development. Good morning, and thank you for joining us to discuss the results from our first quarter ended July 31, 2021. Before we begin, I’ll remind you that certain statements made by us during this investor call may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include any statements relating to expectations for future periods, possible or assumed future results of operations, financial conditions, liquidity and related sources or needs, the company’s supply chain, business and integration strategies, plans and synergies, growth opportunities, performance at our stores and the potential effects of COVID-19. There are a number of known and unknown risks, uncertainties and other factors that may cause our actual results to differ materially from any future results expressed or implied by those forward-looking statements, including, but not limited to, the integration of the Buchanan Energy acquisition, our ability to execute on our strategic plan or to realize benefits from the strategic plan, the impact and duration of COVID-19 and related governmental actions, as well as other risks, uncertainties and factors, which are described in our most recent annual report on Form 10-K and quarterly reports on Form 10-Q as filed with the SEC and available on our Web site. Any forward-looking statements made during this call reflect our current views as of today with respect to future events and Casey’s disclaims any intention or obligation to update or revise forward-looking statements, whether as a result of new information, future events or otherwise. Before I turn the call over to Darren, I'd like to point out that we changed the titles of two categories that we routinely disclose and discuss; grocery and other merchandise has been changed to grocery and general merchandise, and prepared food and fountain has been changed to prepared food and dispensed beverage. With that said, I'd now like to turn the call over to Darren to discuss our first quarter results. We're looking forward to sharing our results in a moment, but I would like to start with a top priority for Casey’s, supporting our team members and their safety in the continuing battle with COVID-19 due to the Delta variant. It's been a long 18 months and after some of this seemed nearly normal, our team is again experiencing COVID-19 case increases and related challenges. In spite of these obstacles, our team has performed exceptionally well and truly makes life better for our communities and guests every day. As our guests and communities shift gears from summer and head back to school, commuting for work and engaging the fall routines, Casey’s will be here ready to serve them. In August, Casey’s Cash for Classrooms giving campaign raised almost $1 million, thanks to our generous guests and passionate team members. I'm proud to share that Greg Trojan, former CEO of BJ’s Restaurants, has joined the Casey's Board. He brings 25 years of experience leading national restaurant, retail and consumer products companies like Guitar Center, House of Blues Entertainment and California Pizza Kitchen. Adding Greg to the Casey's Board adds strategic expertise in areas that fuel the growth of our business; focusing on the guest, leading an exceptional restaurant caliber food service program and being a retail leader. As you see in the press release, we're off to a great start to the fiscal year. Diluted earnings per share were $3.19, just off slightly from the all-time high quarter one year ago. Adjusted EBITDA was $243.2 million, the highest quarterly EBITDA in company history. Sales volumes and margin improved dramatically as guest traffic began to rebound, driving an all-time high gross profit dollar quarter for the company. We also successfully completed the closing on two highly strategic acquisitions in the first quarter, and are already seeing good performance. Grab and go items such as pizza slices, packaged beverages and snacks were up significantly throughout the quarter as guest traffic improved. Packaged beverages outperformed despite high comparisons during the pandemic, achieving a two-year stack same-store growth of 17.6%. Although alcohol sales have moderated and we're about flat versus pandemic-driven buying in the prior year, they still achieved a 20.2% two-year stack sales growth. Pizza slices were the star of the show, up close to 29% in the quarter. During the first quarter, same-store fuel gallons sold were up 9% with the fuel margin up 35.1 cents per gallon, as Casey's continued to achieve strong fuel margins. Total revenue for the quarter was nearly $3.2 billion, an increase of $1.1 billion or 51% from the prior year. This was primarily due to an increase of retail sales of fuel of $881 million driven by a 21.5% increase of total gallons sold to 667.5 million gallons, as well as a 49% increase in the average retail price per gallon. Reported fuel results do not include the recently acquired Buchanan Energy wholesale fuel business, which is included in the other revenue category. Grocery and general merchandise sales increased by $104 million to $835.5 million, an increase of 14%. And prepared food and dispensed beverage sales rose approximately $38 million to $308.4 million, also an increase of 14%. As a reminder, we define gross profit as revenue less cost of goods sold but excluding depreciation and amortization. It is primarily attributable to higher inside gross profit of $66.3 million, or nearly 17%, as well as an increase of $24.4 million, or 11.6% in fuel gross profit. Our grocery and general merchandise gross profit increased $39.8 million, while prepared food and dispensed beverage gross profit increased $26.5 million dollars. In addition to higher revenues and gross profit, it was encouraging to see inside gross profit margin expansion as well. Inside gross profit margin was 40.5%, which is an increase of 90 bips from the prior year quarter. The grocery and general merchandise margin was 33%, up 80 basis points. Prepared food and dispensed beverage margin was 61%, up 130 basis points from prior year. Casey's enjoyed favorable sales mix shifts, both within and across the categories, as packaged beverages along with the chips, meat, snacks and candy performed well in addition to the resurgence of grab and go items within the prepared food and dispensed beverage category. Total operating expenses were up 24% or $92.8 million in the first quarter, and that's consistent with our expectations. These additional hours accounted for more than half of the same-store increase, followed by wage rate increases and store operating expenses, which are also due to higher hours, such as repairs and maintenance and higher utility costs. On a two-year stack basis, we continue to mind our labor utilization as same-store labor hours remained down approximately 4% versus pre-COVID levels. And this also includes approximately $8 million in one-time deal and integration costs, which was several million dollars lower than we originally anticipated. With the large rise in retail fuel prices, same-store credit card fees also rose and that's accounted for another 3% of the operating expense increase in the quarter. As mentioned earlier, the operating expense increase was in line with internal expectations as the company anticipated that the most significant quarterly increase for fiscal '22 would occur this quarter given the increase in store count and operating hours relative to last year. Importantly, I'd like to reemphasize that the company still expects the full year operating expense increase to finish within our previous outlook, which is a mid teens percentage increase. This includes an approximately $3 million one-time charge associated with revaluing our deferred tax liabilities as part of the Buchanan Energy closing, and that was several million dollars lower than we initially expected. At July 31, cash and cash equivalents were $199 million. And we have the full capacity of our $475 million lines of credit, giving us ample available liquidity of $674 million. For the quarter, the company generated $197 million of free cash flow, which we define as cash flow from operating activities, less purchases of property and equipment. At the September meeting, the Board of Directors increased the dividend to $0.35 per share, which represents the 22nd year in a row of raising the dividend. We will remain balanced in our capital allocation going forward, leaning into the many growth related investment opportunities that we have, but continuing to repay that gradually and tending to the dividend. The company has opened 142 stores so far this year, which includes three new store openings, the 137 stores from the Buchanan Energy and Circle K acquisitions, and two independent acquisitions. Obviously, there continues to be a growing uncertainty around consumer behavior and traffic volumes as the Delta variant continues to spread throughout the country. The industry is also dealing with product outages and supply chain challenges, both with respect to fuel and merchandise. However, we feel confident in our previously disclosed fiscal '22 outlook and do not believe it's necessary to make any adjustments other than that we now expect the effective tax rate for the year to land between 24% and 26%. As previously mentioned, we expect total operating expenses to finish the year up mid teens percentages and that the quarterly year-over-year increases will gradually decline as the year progresses, with a small improvement in the second quarter and more substantial changes in the second half. The company will continue to endeavor to offset labor inflation with gross profit adjustments, and Darren will talk about what we're doing to address the tight labor market shortly. Looking ahead to the very near term, we expect second quarter earnings to be lower than the prior year due to higher operating expenses and depreciation, which will be partially offset by higher gross profit, primarily from inside the stores. First, I'd like to congratulate the entire Casey’s team for delivering impressive results in the first quarter. For fuel, we've experienced low single digit positive gallon growth, while fuel margins remain over $0.30 per gallon. If you recall, the pillars of the strategic plan to deliver top quintile EBITDA growth are reinvent the guest experience, create capacities through efficiencies and being where the guest is, be it disciplined unit growth. Given the inflationary pressures most retail industries are currently experiencing, I think it's appropriate to start with creating capacity through efficiencies as it is top of mind for the team right now at Casey’s. And finally, private label products continue to grow market share inside our stores. Not only is this a better value option for our guests, but it also improves gross profit margin for the category. With respect to being where the guest is, we're off to a great start integrating the two highly strategic acquisitions that we completed in the first quarter. Expanding our digital guest engagement remains a high priority as digital sales were up 14% in the first quarter, cycling a 162% increase last year. We've also implemented DoorDash white-label delivery, a third party service that takes orders through our systems at 830 stores. We still utilize our own delivery drivers at 400 stores and still offer in-store pickup and curbside pickup at over 2,200 stores. With respect to investing in our talent, the company has held several mass hiring events to address our staffing challenges and continue to offer retention and referral bonuses. Before I open up the call to questions, I'd like to take a moment to recognize Julie Jackowski, our General Counsel. Julie is a 27-year Casey’s team member, has been a key member of our senior leadership team since 2010. In addition to serving Casey’s, she's been a tremendous advocate for the convenience store industry, serving on various committees and volunteer roles with the National Association of Convenience Stores, including Chairperson of the Board. Your line is open. Really great to see you guys reaffirm the target, despite probably or not probably a tougher labor environment than when we originally talked last. As you recall, last year we kind of pulled back hard on operating hours in our stores and in our kitchens as kitchens were restricted or even required to shut down early on. As things wore on through the pandemic and things started to open up gradually, we started to add back some of those hours. And as things progressed throughout the year, we started adding more operating hours back. But we will start to feel a little bit more of the wage pressure year-over-year delta last year in the first quarter, we were still paying some special COVID pay to people that gradually worked its way out of the system. And so the change in hours is going to be less impactful to us, but the change in rate will become more impactful as we move forward in the remainder of the year. We're targeting 200 units into the system this year, obviously more than half of those have already come into the system. And then the credit card fees, that's going to follow the price of fuel to a large extent, but the math simply helps us with hours and the actual wage rates as we go forward. What I would say Bobby is that we were doing a lot of work around labor management really pre-COVID and then throughout COVID in terms of time motion studies, standing up a new labor management tool, implementing that. With respect to the breakfast business, we are not all the way back to where we expect to be. I think we're going to learn a lot here in the next several weeks post Labor Day with school fully back in session, people going back to work or not, depending on the Delta variant. But we just announced today we've launched a new breakfast lineup and new coffee program, so we're encouraged by the potential that that program has to offer. And so, hopefully, we'll get back but we're not anticipating having to significantly invest more in labor to meet that need. Your line is open. Obviously, we're seeing the comps come back. If I look at the margin profile of the business, it's on a recovery track for sure. Yes, I think it's going to take some time, Ben, to get back to pre-COVID levels. But certainly with the morning dayparts still under pressure, while we're seeing better bakery and coffee sales than we were a year ago, we're still not all the way back to where we were before. And then the same applies to the other dispensed beverages found in frozen while improving over prior years, still not all the way there. So while we've been able to mitigate that to a certain extent through our cheese lock or through pricing, we have seen inflation in a lot of the other ingredients and toppings for our various food products which has put a little pressure on those margins. It doesn't look like it was a huge amount, but it's tough to tell with specificity. So we carried over a little more than 4 million physical RINs from the fourth quarter into the first quarter of this year that normal course, we probably historically would have sold those RINs in the fourth quarter. When we did sell those, we have completely sold all of those in the first quarter. So, we realized somewhere in the neighborhood of $7 million or $8 million of value from those 4 million plus of RINs. And so that's a function, obviously, of the type of fuel that we end up selling and whether we slash blend it or not. Your line is open. Yes, Bonnie, like I mentioned in my opening remarks, we feel really good about the integration process so far. Part of what we acquired there was a small distribution center that they have, and we're starting to wind down those operations and expect to be out of that by the end of the year. We are in the process of converting stores over to Casey's from Bucky's, and we've got the first four open and operating. We're seeing encouraging results there, but obviously very early days. I would say probably from an upside perspective, there's probably a couple of areas that we feel good about. We've really seen an uptick in the fuel margins in that business, particularly in the Illinois stores versus what we had originally anticipated. They really put a lot of focus and emphasis on their car wash business, which is something that we've been getting into, but frankly haven't done a great job of. But suffice it to say, we're encouraged with what we've experienced so far. Your line is open. Yes, Kelly, we're really excited about the breakfast launch. We've focused on improving some of the existing products that we already had, just getting higher quality ingredients in different builds. And then our culinary team developed a new product, a breakfast handheld product that leverages our made-from-scratch dough in unique builds with sausage and egg and cheese or bacon and egg and cheese, but leveraging that dough in a unique way. So it's handheld, it's very portable and car friendly. And as we go into the fall, you've seen a lot of QSR concepts lean into breakfast because everybody is trying to get their breakfast business back. But I would argue there's not been any real innovation in breakfast, it's all the same stuff. So that will enable us to reduce waste, make it easier to execute in the stores from a labor standpoint and provide fresh coffee 24/7. So we think when you take all of that, we've got a little bit of labor efficiency on the coffee piece, we've got a little bit more complexity on the food side. We think that it's a wash from a labor standpoint, but providing a much better experience for the guests. And just if you could elaborate, I think you commented on the low single digit through August. Yes, low to mid single digits for inside sales, and that's what we're experiencing now and would anticipate at this point. Like I mentioned before, with most every QSR concept that has breakfast trying to get back into that business. We think we're differentiated, we'll outperform, but we have that baked into our numbers for the year. Your line is open. Yes, Matthew, I would say that at this point, we'd have to say that these margins are sustainable, at least in the near term. And it's for the reasons that you mentioned, the underlying cost to operate this business are going up, everything from labor which is well documented and everybody is dealing with that. Some are probably experiencing it more than we are, but they're experiencing it nonetheless. And then, of course, credit card fees that we're experiencing right now. Whether they last at $0.30 a gallon or north of $0.30 a gallon longer term is anybody's guess, but I would certainly expect that they're going to remain elevated from where they were historically because there's no other place for most of these folks to go to recapture this OpEx. It's got to go somewhere, and I think that's where it's most likely to end up. Some of your peers are having higher than normal out of stocks in stores, mostly driven by their collection of distributors having their own labor and fill rate issues. And I know category and subcategory mix, the procurement opportunity, private brand products, that's already lifting inside gross margins for you, but I'm presuming there's still room for improvement just off industry supply chain headwinds hopefully softening at some point going forward. I'll tell you, Matthew, that our -- the fact that we own our own supply chain has been a huge benefit to us during this whole time. Now I'll be the first to say, we have experienced our own challenges with the supply chain because manufacturers are struggling to produce products. So we can send a tractor to a manufacturer, pick up a trailer and get it back to our distribution centers, continue to distribute product. And we've seen, as we've gone into competitor stores, that these stores are out of stock on a lot of those products that we're able to self-distribute and manage. And on their end, it's anywhere from labor shortages to driver shortages and some time -- in some cases, it is raw material shortages that have occurred. But like I said, I like our spot of having positive control over the supply chain, being able to flex and adjust to keep our stores in stock. Thank you very much. Your line is open. You mentioned that the supply -- excuse me, there is a resurgence in the single slice business. Yes, Chuck, the slice business has definitely come back. As you get more into the evening time and dinner, that's when we shift over to the whole pie business. Now that being said, our whole pie business has softened a little bit versus prior year. Obviously, when everything was shut down, the whole pie business really surged. But on a two-year stack basis, we're up double digits in whole pie. So we feel like we've held on to a lot of that incremental growth that we experienced during the height of the pandemic, but we gave a little bit back. But overall, we're really happy with where the pizza business is right now and it's continuing to grow. Your line is open. I think on the grocery business, we've had a lot of success over the last year, renegotiating and entering into favorable supply contracts with a lot of our CPG and DSD suppliers. And I think we're seeing that for sure in the margin improvement in that category where we don't talk much about inflation pressure in that category, and that's a function of the procurement progress that we've made. That's where most of our focus is right now if you think of commodity suppliers, everything from cheese to proteins, a lot of emphasis on that. I would expect by the end of the year, we will have made quite a bit of progress not only in locking up longer term agreements, but also making sure we have less dependency on single source suppliers than we do today in certain categories. And given Darren's earlier comment just around supply chain challenges, I think we all would feel better with a little more redundancy in certain aspects of our supply chain. And then finally, on the indirect side, things like construction, et cetera, we spend quite a bit of capital dollars. So as far as cheese costs are concerned, obviously it's a big component of your prepared food category. If you look at the spot curve today, I would tell you we anticipate a cheese cost impact in the second quarter to be comparable to what we had in the first quarter. But I think second quarter will be a tailwind and the spot prices today would have a little bit of headwind cost at the moment in the second half of the year, but it currently would not be significant. Your line is open. Obviously, we didn't own the assets for the entire quarter. I would say, generally speaking to Darren's earlier comments, I think we're about where we thought we would be. I think at the highest level, we spent a little bit less in terms of kind of closing integration-related costs than we had thought we were going to, which helped us a little bit. Their fuel profitability is higher than what we had originally expected it to be, which is consistent with obviously what people are seeing overall in the industry. But we feel good about it being a net contributor of about $45 million of EBITDA to us in this fiscal year by the time the dust settles there, that will include some synergy capture, as Darren referenced, starting in the second quarter. I think we'll start with G&A and fuel and as construction progresses, we'll start to see some inside the store realization there. I know 1Q was pretty light, which I think is pretty typical historically when you look back at historical years. But in this case, it's under 10% of the full year guide. We're going to spend most of our time in the second quarter working on integrating the acquisitions, remodels, et cetera. So it will be backend loaded, and we're somewhat dependent on making sure we successfully manage through supply chain challenges on the construction side. Thank you very much. Your line is open. Yes, Krisztina, with respect to traffic, I think it's a little bit early to tell with the back-to-school. We've kind of been back-to-school for a few days in most of our geography and that was a holiday week, and now we're just coming back. So we're anticipating that our traffic will improve, but we've got to get a couple more days into it before we have a real sense. And I think a couple of months ago, pre the Delta variant really getting some momentum, I think most companies were planning on returning back to work after Labor Day. And a lot of those companies have sort of pushed those plans a month or two, in some cases have pushed all the way to the end of the calendar year. All that being said, we expect to continue some momentum with the grocery category, but we will be cycling over the store resets here substantially in the third and fourth quarter. So I would say grocery probably softening in the back half, prepared food maybe accelerating a bit. I think the math is going to be grocery will be below prepared food for the rest of the year, and that's just a function of the math, right, with what we're lapping from the prior year. And if you think about how we've been marketing so far from a digital standpoint, we look at -- we have kind of a blended strategy. We use a curation, which is where we market to -- one message to a broad swath of people to the majority of guests, and that's about 55% of what we do today. As we move throughout this year, we're going to shift that mix. So by the end of the year, we expect about 60% of our digital activity will be individualized to each consumer. Thank you very much. Your line is open. And then over time, we expect to get to 10%, but that's going to be a multiyear exercise. We've already launched 209 private label products since we've launched the program, and we have another 60 products in the pipeline that will be launching between now and the third quarter. On the new stores, I'm not sure that we're seeing any significant difference between new stores and existing stores. The acquisition stores, it's very early stages. So very early days on those, but I would anticipate that they would reach the same mix as our more traditional stores. Do fuel margins -- ex RINs, they're still pretty high. I think it's less about fuel margins right now and more about just the underlying cost and complexity of operating the business today, particularly in this environment with COVID. And then compounding that is the potential of the capital gains tax changes, and I know they're talking about that as we speak. But yes, we expect that that's going to be a catalyst in the near term for increased M&A activity. Your line is open. Yes, Renato, in terms of the landscape, I think -- what you saw a year ago once the businesses were shutting down, offices were shutting and people were sheltering in place, you saw a disproportionate impact on the breakfast daypart. So now you fast forward a year later, I think everybody is optimistic about getting that business back to normal as schools are in session in person and more people are returning to work than there was a year ago. A lot of that comes in our breakfast pizza, but a lot of other things like donuts and baked goods and coffee and sandwiches also play a big role, and that's where we've innovated is on the coffee and on the breakfast -- the other breakfast lineup. And so we'll always have that base of breakfast pizza to lean on, but we've got the innovation on top of it that we think will help us accelerate our breakfast growth. Fortunately, we demonstrated our ability to deliver results on our long-term strategic plan to both normal times and during our global pandemic that I'm confident will continue to drive shareholder value."
}