{
    "symbol": "LAW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 23:14:06",
    "content": " And we received incredible feedback and praise from the industry, including recognition as a leader in the worldwide Ediscovery Early Case Assessment, and Ediscovery Review Software 2022 vendor assessments by IDC Marketscape, specifically calling out the strengths in our corporate toolkit, scalability, and ease of use for customers. Revenue growth last year was impacted by a decline in usage of our review product, especially on large reviews, and by volatility in usage of all our products, including e discovery, especially in the latter part of the year. We believe that our investment into an end-to-end and full stack solution that is our ability to provide not only Ediscovery, but also products like Disco Request and Disco Hold that are primarily used by in-house counsel, as well as downstream products like Disco Review and Disco Case Builder has made our solution more attractive to corporate legal departments. In 2022, our multiproduct attach rate calculated as the percentage of customers at year-end, who generated revenue for us in 2022, for their use of more than one Disco product during the year was 11%. I think we're just at the beginning of a very exciting time in the integration of generative AI and other AI techniques into Disco's products and we look forward to sharing more product announcements going forward, not only in Ediscovery, but in some of our newer products like Disco Case Builder, and Disco Hold. And our goal is to continue to drive an increase in that metric, both by getting more new customers to land with our second, third, fourth and fifth products, and getting both existing customers and new customers to expand across multiple products as they use the Disco platform for more and more categories of legal work. Things like extending our reach into corporate, that number of customers is up to 450 and up 35% year-over-year, and then driving multiproduct attach rate that's 11%, up very materially year-over-year. I think if you go back three to five years ago, there were number of ideas that were new to the market, that Disco championed, and that our competitors, were often skeptical of things like moving to the cloud, things like a focus on the end user experience of lawyers, things like a direct sales model, where we sell directly to the ultimate buyers, whether in legal departments, or at law firms. And then of course, our original product, Disco Ediscovery still makes up a large majority of our overall revenue north of 105 million for last year, up 30% year-over-year and importantly with 120% dollar based net retention."
}