{
    "symbol": "VTNR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 12:38:05",
    "content": " During a volatile period for the broader energy complex we generated record consolidated second quarter adjusted EBITDA of $71.3 million, supported mainly by contributions from our recently acquired Mobile refinery, which generated $63.6 million in standalone adjusted EBITDA during the period. Total gross profit per barrel, excluding a realized hedging loss and inventory adjustments was more than $23 per barrel in the second quarter or approximately 51% of the benchmark 2/1/1 Gulf Coast crack spread in the period. With a few -- full quarter at Mobile behind us, together with expectations for a prolonged period of elevated refined product margins, we have concurrently chosen not to expand our hedging program past the third quarter of 2022, position us take full advantage of the spot market beginning in the fourth quarter of this year. For the three months ended June 30, 2022, Vertex reported a net loss of $63.8 million versus a net loss of $16 million in the second quarter 2021. The second quarter net loss includes a $46.9 million unrealized commodity derivative loss, a $23.2 million loss on an intermediation agreement due to backwardation, a $46.1 million realized commodity derivative loss, together with $11.6 million in non-recurring transaction and other non-operating expenses. As of June 30, 2022, the company had total cash including restricted cash of $97.9 million versus $36.1 million at the end of second quarter 2021. Also during the quarter, we upsized our term loan from $125 million to $165 million, using the incremental $40 million in proceeds to repurchase Tensile Capitalâ\u0080\u0099s outstanding 65% ownership within certain legacy assets including our Heartland refinery and Myrtle Grove sight. For the third quarter of 2022, we currently anticipate the following; total throughput of between 72,000 barrels per day and 74,000 barrels per day at the Mobile refinery and direct operating expense per barrel of between $3.50 and $3.75 at the Mobile refinery. Again, if we didnâ\u0080\u0099t have the crack hedge going forward the second quarter, third quarter, are actually for the second quarter, we would have been looking at another $90 million of cash flow and EBITDA to be talking about. I mean, given its timing, youâ\u0080\u0099re going to make that $13.3 million backup in the third quarter and then weâ\u0080\u0099ll see what happens at the end of the third quarter. What you will see occurs in the fourth quarter of this year as the OFH comes down, we do lead -- lose some of the diesel make that occurs and weâ\u0080\u0099ll be selling the product, what is feeds the OFH will now go out in the product market and so that spread will change going forward and weâ\u0080\u0099ll provide guidance on that when we get to the next quarters, weâ\u0080\u0099ll continue to look at those. In the cash flow statement is the $93.745 million hedged commodity loss and then sitting here today basically comment you made, if the quarter were to have ended for 3Q, that number would be $23 million smaller."
}