{
    "symbol": "VTGN",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-12 14:02:16",
    "content": " Since our meeting with the FDA back in the middle of 2020, we have developed extensive new data, reinforcing our confidence in PH94Bâ\u0080\u0099s potential to transform lives of millions of people suffering from the debilitating effects of SAD and other anxiety disorders. For example, preliminary data from nearly 200 subjects in our PALISADE open-label safety study suggest that as needed use of PH94B over time has potential to help patients achieve cumulative functional improvement in the severity of social anxiety disorder, as measured by the LSAS. Based on a cohort of nearly 200 subjects who have completed three months of exposure, we saw increasingly reduced severity of SAD as measured by the LSAS at the end of each of months one, two and three with a greater than 20-point reduction on the LSAS compared to baseline at each of those time points. Importantly, the findings from the multiple Phase 2 studies â\u0080\u0093 multiple use Phase 2 study, which was conducted again in the real-world environment rather than in a clinical setting suggests that once a person with SAD experiences a benefit from PH94B, they may gain confidence in their ability to function in stressful situations, and that confidence can persist. This increase is primarily due to expenses related to conducting our PALISADE Phase 3 program for PH94B, including PALISADE-1, PALISADE-2, the PALISADE open-label safety study and the PH94B Phase 2 study in adjustment disorder with anxiety as well as nonclinical development and outsourced manufacturing activities for both PH94B and PH10. And given what weâ\u0080\u0099ve recently learned from PALISADE-1 and the PALISADE open-label study, we believe LSAS measurements over time may be better suited to demonstrate efficacy and the true impact of PH94B on patients lives. Weâ\u0080\u0099ve seen PH94B improved LSAS scores in both our Phase 2 study versus placebo, a published study after two weeks of use and in our recent open-label study of a cohort of nearly 200 subjects by capturing the monthly change from baseline on the LSAS."
}