{
    "symbol": "VTGN",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-10 11:20:05",
    "content": " However, a new and another important factor to note regarding our considerations for potentially resuming PALISADE-2 is that in December 2022, a couple of months ago, two of our peers announced topline results of their recently completed SAD studies using a single administration public-speaking challenge study design with SUDS as the primary endpoint. So after reviewing the information and data available to us at this time, we believe it is not yet advisable to resume PALISADE-2 before discussing our broader Phase III development plan for PH94B in SAD with the FDA and assessing the results of the other two recently completed SAD public speaking challenges conducted during the pandemic that also did not achieve their primary efficacy endpoints. We are currently preparing to meet with the FDA to discuss our broader Phase III development plan, which includes the possibility of conducting a multiple administration, randomized double-blind placebo-controlled Phase III study of PH94B in adults using the Liebowitz social anxiety scale, or LSAS, as the primary measure to evaluate the efficacy of PH94B over time, in patients with SAD to support a potential PH94B NDA for treatment of SAD. The Phase III study contemplated as part of our broader plan would involve multiple administrations of PH94B on an as-needed basis up to four times a day in a real-world setting over multiple weeks, with the LSAS as the primary efficacy endpoint. Another important component of our Phase III program in SAD is the PALISADE Open Label Study, which we initiated back in October 2021 to evaluate the safety and tolerability of PH94B in adult subjects with SAD taken as needed prior to anxiety provoking social and performance situations in daily life over a period of up to 12 months. And although from an open label study, when considered with our prior placebo-controlled, multiple assessment Phase II study of PH94B in a real-world setting, that study has helped inform many important aspects of our broader Phase III development plan for PH94B in SAD. The open label study results reinforce our beliefs in the potential of PH94B used overtime as needed up to four times per day in daily life to provide rapid onset, clinically meaningful and sustained response with a favorable safety and tolerability profile. That study is now underway and is intended to both confirm the favorable safety profile of PH10, establishing three previous clinical studies conducted in Mexico, including positive published Phase IIa study of PH10 for the treatment of MDD as well as to facilitate our plans for Phase IIb development of PH10 in the U.S. as a novel standalone treatment for MDD. This decrease is primarily due to reduced expenses related to the PALISADE Phase III program for PH94B, which, as Shawn has described, includes PALISADE-1, PALISADE-2 and the PALISADE Open Label Study as well as the PH94B Phase IIa study in adjustment disorder with anxiety and other non-clinical development, regulatory and outsourced manufacturing activities for both PH94B and PH10. So it's possible that we would simply unblind PALISADE-2 as it is and in the study there and see what we find from those unblinded data on 140 subjects, it could be denting, it could be soft trend, it could be positive signal, decent effect size, it could be a lot of things. And we take that together with the data from the placebo-controlled Phase II study, where the real world study, there â\u0080\u0093 those studies provide a lot of evidence on how SAD patients would use PH94B, for example, the frequency of use in the real world setting and the appropriateness also of assessing improvement in SAD over time, utilizing the LSAS, obviously, as the key measurement. So the LSAS, which again, long established by Dr. Liebowitz, who's the PI of the Phase II studies and also currently working with us, that remains the most appropriate outcome measure for the type of study we might next do, right, a double-blind, placebo-controlled study that evaluates the efficacy of as needed use of PH94B, but overtime for the treatment. So exposing people to stressors over a long period of time, six weeks was probably what we would see in a Phase III study, given the way that PH94Bs onset is rapid, what we would see say in the six-week study would be really what the antidepressants achieved in a 12-week period, since they have a long onset of action. So with a bit of a changed world now, where COVID's under control and a lot of other factors that we would improve on that some lessons learned from PALISADE-1 that transport into what we would do if the direction forward is a Phase III study with LSAS as the primary."
}