{
    "symbol": "VTGN",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-10 21:08:09",
    "content": " So let's get into some of the detail about progress across our pipeline, starting with our PALISADE Phase 3 program for PH94B in social anxiety disorder, or SAD, also our PALISADE-1 and PALISADE-2 double-blind placebo-controlled Phase 3 studies and our PALISADE open-label study. We've been gathering and analyzing the data from this study and have identified a few areas, especially related to the impacts of the pandemic that may have contributed to the results that were so different from what we've observed in previous clinical studies of PH94B in SAD, including the recently assessed PALISADE open-label safety study, which we'll talk about later in the call. The third important component of our PALISADE Phase 3 program is the PALISADE open-label study, which we initiated in October of 2021 to evaluate the safety and tolerability of PH94B in adult subjects with SAD, taken as needed prior to acute anxiety-provoking social and performance situations in their daily life, up to four times per day and over a period of up to 12 months. In addition to assessing safety and tolerability, we also included several exploratory efficacy objectives, including assessment of PH94B's potential to achieve overall symptom reduction and improvement in the severity of SAD, as measured by the Liebowitz Social Anxiety Scale, as the efficacy endpoint required by the FDA for all of the prior SAD approvals. And as we reported today, our preliminary analysis now of nearly 400 subjects in that final data set for the PALISADE Open Label Study, we see that there was robust functional improvement in anxiety-provoking social and performance situations in the daily life of the subjects, as measured by the LSAS or the Liebowitz Social Anxiety Scale. So as to efficacy, we now have two important data sets supporting PH94B's ability to improve LSAS scores, the PALISADE Open Label Study over a period of one month and beyond and a published double-blind, placebo-controlled Phase 2 real-world crossover study after two weeks of use. These studies further reinforce our belief in the potential of PH94B, when it's used acutely, as needed in daily life to provide onset -- rapid-onset, clinically meaningful and sustained response in SAD patients, all with a very favorable safety and tolerability profile. And one of the things that's so encouraging about what we've seen in the open-label study in the crossover study is that with the LSS, which is the endpoint, the FDA is constantly used for approval of the prior drugs we're seeing some substantial improvements."
}