{
    "symbol": "ATOM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 20:35:06",
    "content": "  Mike Bishop: Hello, everyone, and welcome to Atomera’s First Quarter Fiscal Year 2022 Update Call. I’d like to remind everyone that this call and webinar are being recorded, and a replay will be available on Atomera’s IR website for one year. As in prior quarters, we are using Zoom, and we’ll follow a similar format with participants in a listen-only mode. We will open the call with prepared remarks from Scott Bibaud, Atomera’s President and CEO; and Frank Laurencio, Atomera’s CFO. Before we begin, I would like to remind everyone that during today’s call, we will make forward-looking statements. These risks and uncertainties are detailed in the Risk Factors section of our filings with the Securities and Exchange Commission, specifically in the Company’s annual report on Form 10-K filed with the SEC on February 12 -- excuse me, February 15, 2022. Also, please note that during this call, we will be discussing non-GAAP financial measures as defined by SEC Regulation G. Reconciliations of these non-GAAP financial measures to the most directly comparable GAAP measures are included in today’s press release, which is posted on our website. Good afternoon, and welcome to Atomera’s first quarter 2022 update call. I’m sure you’ve noticed the momentum that’s been building over the course of this year, and I hope to share some details of that with you today. Then, after providing some insight into latest industry trends and how they affect us, I’ll turn the call over to Frank to briefly review the numbers and outlook. This opportunity arose because one of this customer’s business units had found MST’s capabilities compelling and subsequently referred us to their R&D arm, whose job it is to vet incoming technologies. As you know, Atomera’s number one goal is to ship MST-based products, resulting in royalty payments. We will continue to provide updates as best we can, but as our followers know, there’s a high degree of confidentiality demanded in this industry. Further, as everything in this JDA has taken a bit longer than our initial expectations, we’re not guiding to a timeframe on these next steps. An hour ago Atomera announced that we entered into our second JDA, this time with a large semiconductor foundry who’s been working with us in phase 3 for a number of quarters. After extensively reviewing our technology, our TCAD simulations, MST enabled wafers and the impact MST can have on their designs, this customer decided to enter into a joint development agreement with Atomera, the purpose of which is to define exactly what steps will be taken with high priority and with a full set of resources to take MST-based products into production, if the results of our latest experiments meet their expectations. So, I’d like to note that this JDA is different from our first in some important ways. First, it’s not being administered by a central R&D group, but by one specific technology area. So, there’s no revenue associated with signing but the customer has committed to prioritize our wafers and dedicated team who can help move the process to production quickly, and it clearly spells out the revenue expectations coming in the later phases of the JDA. That said, if we’re successful on this JDA, we believe the customer will move expeditiously towards commercialization because the all the legal and contract delays should be behind us. So, with these two JDAs underway, I’d like to take a step back and review where we are. We’ve had one new customer move into phase 2, offset by another engagement that was consolidated as a customer combined two programs into one. This has been a goal of Atomera’s for the last year, and we’re making good progress in that direction. Unfortunately, I can’t go into the exciting details of each engagement because we are working on some high-potential areas which can provide significant competitive advantage to our customers, making them especially sensitive to confidentiality. I can say that we are getting very-promising results, which has led these customers to deeper engagement and hopefully to more JDAs on licenses. Towards the goal of moving customers faster, Atomera created MSTcad simulation software, which rides on top of Synopsys’ industry-leading Sentaurus TCAD tools. Last month, Synopsys hosted a joint webinar on how the MST tool set can be used to model MST’s optimized transistor performance. Now, I’d like to address some recent developments in the semiconductor industry, which I believe create an exceptionally favorable environment for Atomera. So, these new fabs can’t easily get equipment, and when they can, the associated CapEx costs will drive lower profitability than they’ve experienced in the past. To deal with the capacity crunch and pay for the CapEx, fabs are raising prices on their wafers up to 20% now, and industry insiders say that price rises are not transitory, they’re permanent. Atomera’s spreading this message to industry players, and we believe that it will lead to widespread adoption over time. We remain laser-focused on getting the first player into production, who we believe will drive the domino effect that’s been predicted for some time. In our Q4 call, I said that we were entering into 2022 with strong momentum, and I think you will agree that it is continued with a new licensee, successful execution on our first JDA, and the opening of a new JDA. The $400,000 of revenue that we recognized in Q1 of last year had a 100% gross margin, since it consisted solely of the grant of a manufacturing license to our first JDA customer. In Q1 2022, our $375,000 of revenue consisted of a JDA success fee, which involved Atomera engineering costs and the integration license revenue, which included costs of MST deposition and wafer delivery. As we’ve discussed on previous earnings calls, our cash usage is typically highest in the first quarter of each year, due to annual payments, which are expensed throughout the year on our income statement. Scott mentioned in his remarks that we’ve signed a new JDA, which we believe will lead to us recognizing license and engineering services revenue, and more importantly, will accelerate our path to commercialization with this foundry partner. And consistent with our past practice, I’m not guiding revenue beyond the current quarter. With that, I’ll turn the call back over to Scott for a few summary remarks before we open up to questions. As you’ve heard in this call, we continue to gather steam here Atomera and are quite excited about some of our near-term developments as well as the underlying macro environment, which is creating favorable long-term conditions for MST to be widely adopted across more and more applications. I guess, Scott, first question here is, I’d like you to describe this a little bit better. So, one of the -- generally, when we engage with a customer, we’re engaging with one specific business unit that’s thinking they have a problem, and they want to use MST to solve it. Our JDA that we announced last year, we initially started working with the customer like that, one of the business units looked at our technology, said, hey, this looks very interesting. Now, the good news about that is from that first JDA, the central engineering group did a lot of work and now they’ve kind of given it their seal of approval for the rest of the company. Now, the good news is they’re ready to go to production, or they could possibly go to production quickly with a number of different business units. And if all goes well, they’ll be driving that specific one to get into production, and hopefully, will get adopted by other business units inside their company. As a matter of fact, we’ve been working -- I mentioned in my remarks, we’ve been working with this company in phase 3 for a while they’ve tried a number of different things with our technology, and they’ve decided to focus on this one area first. But we do have a number of other areas that we have been talking with them about and has the real potential to expand beyond, into those once we’ve established success in this first area. I suspect not, but just wanted to see if there’s anything else you can characterize. Well, we’ll look forward to that day. I know it’s not immediate, it’s going to take a few quarters. I don’t know, maybe you can describe what your expectations are now. I think, right now, I wouldn’t say that getting wafers is the limitation. Where we stand right now is we’ve kind of -- we’ve had the central engineering group say, hey, this is good technology, it does what they say it does. And we also have tested it and determined that we can take it into high volume production, because that’s one of the things they’re testing for. Ideally, we’ll be able to convince a number of different business units. I will say one more thing is that, we installed MST in the factory at that first JDA customer. They can literally take wafers off their line and put them into this other machine that’s in the same factory, get MST on there and test it in the same day, as opposed to what normal customers. But for this first JDA customer, literally in one day, they can do it, should speed up everything to be able to get for its production quicker. Scott, you’ve said a couple times in this call and obviously in past calls as well, it’s your priority to get the first customer across the finish line, get into phase 6 and get to wafers out the door in a production sense here. Is that the right way to ask that question, ultimately getting to the answer that we think is all -- will obviously be great news for Atomera’s wafers in production? I’m not going to predict anybody, we’ll get to Phase 5 right now. For the JDA customer, they’d have to go through some integration work. So, just at a high level, let’s think about it like they’re developing a product. But before they would start taking it to production, obviously, they’re going to insert the ingredient and run a bunch of tests and make sure it works well. Once you’re done with that, they’ll start going towards the process of entering it into production. And we can’t -- I don’t like to call them phase numbers in this case, because it isn’t really linear, but let’s just say they have to do integration phase work, and then they can get into the qualification Phase 5 work, after that. And I think a couple of different technology areas was -- my understanding is, they’re focused, mostly, if not entirely on that capacity. Once you’ve talked about before being RF-SOI, I think a good -- a decent chunk of industry capacity on 5 volt analog is also there. Is this tight capacity -- is that creating any headwinds for actually adopting, because it’s so tight they can’t even do the work to implement your technology, even though there is seemingly a lot of benefit there, or is that actually accelerating it and -- let me just stop at that point. This year, even though I don’t see -- the industry is not seeing signs that the capacity crunch is behind us, it’s certainly still going out. We are seeing more interest and willingness to run R&D wafers, because, it’s just been some time that they’ve been prioritizing production and now they got to get back onto the R&D bandwagon to keep their innovation going. So, I don’t see it as a major holdup for us this time -- at this time, getting into those 200-millimeter fabs. One last question for me, and I’ll jump out of the line. Just kind of big picture long-term, one of the six product -- or technology areas you’ve talked about on last call and well before that, one of them was talking about advanced nodes here, which is a big topic of discussion across the semi-industry here. I don’t know the exact answer to that question, Richard. But, I will tell you that we’ve had customers that have talked to us about yield enhancement on existing nodes that are in production, we have still advanced nodes, but doing work there. Even though memory tends to be a little bit bigger line with, they’re still pushing the envelope on how they’re building wafers and are looking for solution. And let me just say, I don’t think that the first JDA is a model. This particular JDA, as I mentioned, we don’t have revenue at the signing. Now, the first milestone requires us to get good results on some work that we’re doing together right now. But, the whole point of the JDA is to kind of grease the skids, that if we get good results on that next one -- and we’re very confident. And we don’t want things to be slowed down by contractual negotiations, or any kind of misunderstandings between the team. If we’re going to make this super high priority, then this is what we expect from you. And it’s, I think, a really good step for us. But one thing about our technology and any new process development technology in semiconductors, it’s very rare that you kind of do the first one and it’s a homerun. And we’re looking for a signal that indicates that with a little bit more tweaking, we’re going to get to the promised land that we’re all hoping to get to. So, yes, there’s a few runs and there is a number of, I’d say, a few shots on goal here before we know. And with -- if we get good results on one, I think we’ll see -- have the ability to expand into a number of other businesses. And so, it’s important to be able to have a foundry that you’re working with that you can point them towards that you can make that definitive next step. So, if we can meet all the requirements of the foundry process, then we’ll be able to get rollout to customers. All of our licensees with one exception, continued to work with us continue to move forward towards getting technology into production. We’ve talked a lot about one of them today, was the existing JDA, I mean, our first JDA customer. We had another licensee that started in February, and obviously, we’re going very hot and heavy with them. One of our licensees, AKM, who allowed us to use their name, we’re still on quite limited work with them, because their fab burnt down, they’re using third-party fabs right now as they figure out how to rebuild and get started again on their R&D work. But we have been talking with them and do have an assurance that when they get their stuff back together, they’ll be restarting their work on MST. Hopefully, we’ll be moving forward to production with them. It’s a little bit hard to guess, actually. In China, we didn’t have -- although we had started to do some work in China with talking to fabs over there, a couple of years ago, we slowed down that effort based on some concerns about IP and other things. And so, today, although the environment is very volatile over there, it’s not really affecting us in any way. I mean, as I’ve been saying for a couple of quarters, we feel like we’re reaching some limits on our capacity with the number of customers that we’re working with. So, that’s where our hiring is focused and adding more engineering headcount. But, the reason that I haven’t sort of made any change on our expense guidance, we think there’s plenty of work for folks to do. So, we’re -- we’ve not added any new headcount during Q1, which we would have liked to do. But, as you know, it’s a very-competitive environment right now to hire. So, yes, that would probably be the single factor, I think that could cause us to maybe under spend versus what our guidance is, if we’re not able to hire, but we’re holding the line on that. There’s -- we’ve got an epi team in the Phoenix Arizona area, which is kind of a center of excellence for that that’s where the historically been a lot of fabs and there are also -- have been a lot of -- there have been some significant sites there for both, ASM and applied. But yes, I’d say, the two places we’ve found the most folks is some with technical recruiters and some just with kind of a network effects from our own team. But, in this market, we’ve got to also take some rifle shot approaches, and we’ll kind of pursue both ways, I mean, with jobs posted on our site with recruiters and word of mouth, I think pretty typical for the way most engineering organizations would try to grow. I think our opportunities are bigger than our ability to service them right now, which is -- and to correct that it’s not going to be another 20 people. It’s only a small group of people, but we really need to do that. And Scott and Frank, we have a number of questions coming in from today’s attendees on the Q&A window. The first JDA, honestly, let’s go back and look. And it ultimately took almost a full year before we can finally announce the start of the JDA, and then took us another year to get to the point where we would -- we had done all -- met all their technical specifications. So, I’m hopeful that this next JDA will move faster. And then, for the second JDA, there’s just some clarification. We have had that discussion with a lot of customers, the amount we’re asking for with royalties is reasonable. That being said, almost everyone doesn’t want to negotiate the license rate until they can see the final benefit that they’re going to get on their production. Obviously, they’re going to be willing to give us more royalty than if we can bring them only a very modest improvement. So, they all want to wait until later in the process before we finalize the royalty rates, and that’s true. We can’t answer the when question because, as we mentioned, it’s hard to predict. Unfortunately, I just really can’t talk about any potential to use or what the timeframes would be. The timeframes, I can’t answer even if I knew to be used, because it’s too early in the process. And so, I can’t really reveal any details about what they’d be doing with the technology. No, I mean, I would just say that’s from the license that we announced in the first quarter, and it’s in the range of license fees that we’ve been paid for integration licenses in the past. And so, we’ll look forward to continuing successful wafer runs with that integration licensee with the hope to get that to phase 4. Scott, I think that concludes the questions that I’ve got prepared. Well, I want to say thank you to everyone who’s attended today’s presentation."
}