{
    "symbol": "MTW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 14:28:03",
    "content": " Good morning, everyone, and welcome to the Manitowoc conference call to review the company's fourth quarter 2022 and full year 2022 financial results and business update as outlined in our press release yesterday. For the full year, we generated slightly above $2 billion in sales and $143 million in adjusted EBITDA, a 23% increase year-over-year. From a strategic standpoint, we increased non-new machine sales by 22% to $545 million for the year. We generated orders of $708 million during the fourth quarter, which was a big jump year-over-year. Beginning with orders, we exceeded our expectations during the fourth quarter with orders of $708 million, an increase of 15% from a year ago. Our adjusted EBITDA for the fourth quarter was $52 million, an increase of 51% year-over-year. On a currency-neutral basis, orders increased $21 million, driven by the impacts of our pricing actions and higher orders in the Americas, partially offset by the lower demand in our EURAF segment. Net sales for the full year were $2.33 billion, an increase of $312 million or 18% year-over-year. Adjusted EBITDA for the full year was $143 million, an increase of $27 million year-over-year. On a sequential basis, net operating working capital decreased $28 million, primarily due to the improved shipments during the fourth quarter. Net sales of $2 billion to $2.1 billion; adjusted EBITDA of $130 million to $160 million; depreciation and amortization of $60 million to $65 million; interest expense of $31 million to $33 million; provision for income tax expense, excluding discrete items, $13 million to $17 million; adjusted diluted earnings per share of $0.35 to $1.15; and capital expenditures of $65 million to $75 million. Number four, in Saudi Arabia, I saw with my own eyes last week that the government is moving at warp speed to invest $1 trillion to revolutionize how people live and to create a futuristic city with 10 million residents over the next 20 years. They're moving dirt at this stage and they've got a lot of cranes on projects, but there's -- I don't think that we'll really start to see tenders come out until the fourth quarter of this year, so it's still early on."
}