{
    "symbol": "BWXT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 23:27:05",
    "content": " Second quarter adjusted EBITDA was robust, up 26% year-over-year to $115 million, which was driven by higher revenues and strong margins in both segments despite lower recoverable CAS pension income. In the second quarter, government operations revenue was up 8% to $437 million, driven by timing of long-lead material in the naval reactors business and higher volume in uranium processing. Second quarter Government operations adjusted EBITDA was up 15% year-over-year to $95.7 million, driven by strong contract performance in uranium processing and technical services, which was partially offset by lower recoverable CAS pension income and fewer positive contract adjustments, particularly at some of the Northern sites that Rex mentioned. Second quarter Commercial Operations adjusted EBITDA was up significantly to $18.2 million, driven by a combination of higher revenue and a more favorable business mix when compared to the second quarter of last year. Commercial operations EBITDA is now expected to be $48 million to $50 million, given heightened field service demand, increased volume in nuclear component manufacturing, a strong showing by our BWXT Medical business and efficient cost management across that segment. As I mentioned last time, we had projected that the investment for Pele would add less than $30 million of incremental capital to our initial CapEx forecast presented at our Investor Day, and so the guidance now incorporates about half of that spend in 2022 as we aggressively stand up that effort for our highly ambitious government customer. So if we snap the chalk line at the end of June, we would estimate just over a $20 million noncash earnings headwind to other income, with about half of that impact coming from higher interest rates, and the other half coming from about a 10% decrease in pension assets. That's the kind of ramp that we're on you know given the demands in the Navy program, Pele program and all the other things that we're trying to do, and so we have to hire about 1,000 to net 500 out of all this and that's the headwind that we're facing, and we are net positive on our hiring for the year, but not at the rate that to get us to 500 and I don't think that's kind of typical of what's going in the business right now."
}