{
    "symbol": "BWXT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 22:57:07",
    "content": " Third quarter revenue was up 5% to $524 million, driven by growth in both operating segments, but most notably in commercial operations. Third quarter adjusted EBITDA was down, as anticipated by 5% to $100 million, which was driven by higher revenues and solid cost controls in commercial operations, which were more than offset by government operations headwinds including the hiring and labor challenges that Rex mentioned as well as lower recoverable CAS pension income. Lastly, free cash flow was up $25 million, primarily driven by a decrease in CapEx as we continue to wind down the two major capital campaigns in the Navy and Medical businesses. In Government operations, third quarter revenue was up 1% to $423 million, driven by higher naval production and microreactor volume that was partially offset by lower long lead material. Third quarter adjusted EBITDA was down 8% year-over-year to $90.4 million, as decreased efficiencies from a challenging hiring dynamic resulting in fewer favorable contract adjustments. Consolidated adjusted EBITDA, which includes a $17 million pension headwind, is now expected to grow about 5% with government operations now anticipated to be lower than previously expected at $395 million due to labor issues. From an operating cash flow standpoint, we still anticipate a broader range of $260 million to $290 million, as working capital items can fluctuate at the end of the year. Currently returns and discount rates suggest a $40 million non-cash FAS pension headwind given year-to-date asset returns, down about 25% and a discount rate that has moved up almost 300 basis points from the start of the year. Next year, we anticipate about $200 million of free cash flow, which will be driven by improvements in operating cash flow management across the business and a significant moderation of CapEx. That business is getting to about a $60 million run rate business, and we expect teens growth rate next year as well. So, we had a little bit of a lighter result in 2022 than we thought and that's why we brought down ultimately over the course of the year the depreciation, but we'll get that load to the tune of about $5 million or $10 million headwind to earnings next year. And when you just think about we're generally expecting about a 7% return there as that balance has come down about 25% that's about half of the $40 million, so that's about $20 million of the $40 million. We'll see how we come in the fourth quarter, but I see doing greater than $300 million, obviously, in order to get to that $200 million next year. So I see greater than $300 million by about that $120-ish million of CapEx, if you scroll it up that's where we're getting around the $200 million free cash flow number. If you look at the aggregate number, it's more like 5% across the entire business, but I think we're not planning with the expectation of dramatic improvements in the labor market for next year's plan, particularly because of the two factors that I talked about, which are one is the attrition rate itself and being able to hire to our growth. And then whatever is left let's just take â\u0080\u0093 if we only spend about $5 million of the Project Pele in 2022, well then the remainder of call it $25 million to get to a full $30 million we hope to do it for less than $30 million we have line of sight to that. But if you just take that scenario, you would layer $25 million on top of the $100 million that we've been talking about for maintenance to ultimately have a CapEx guide next year of $125 million. We are buying for a special project that will require some outfitting of the facility that we're in for Project Pele, but there's some different things that we're doing on the fuel side specifically on the DARPA project, the DRACO that some of you know about, that might drive a little bit of CapEx over and above that kind of $125 million next year, the $100 million if you will in 2024."
}