{
    "symbol": "BCAB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-23 22:33:04",
    "content": " Before we begin, Iâ\u0080\u0099d like to remind everyone that statements made during this conference call will include forward-looking statements, including, but not limited to, statements regarding BioAtlaâ\u0080\u0099s business plans and prospects, potential selective licensing collaborations and other strategic partnerships, whether our clinical trials will be potentially registrational, results, conduct, progress and timing of our research and development programs and clinical trials; expectations with respect to enrollment and dosing in our clinical trials, plans regarding future data updates, clinical trials, regulatory meetings and regulatory submissions, the potential regulatory approval path for our product candidates; expectations about the sufficiency of our cash and cash equivalents and expected R&D and G&A expenses. This month, the first six Leiomyosarcoma patients cleared the DLT observation period using the 3Q4W dosing in part 1 of the Phase 2 study which was a study requirement to begin enrolling patients in Phase 2, part 2 of the UPS trial. We now anticipate first patient in for this study soon in the first half of this year, these 1st 40 patients with a TMPs greater than or equal to 50% are now enrolling and will be randomized one to one between 3Q4W or 2Q3W dosing regimens. With respect to Leiomyosarcoma, I mentioned earlier, we recently cleared the DLT observation period in the first six patients using the more frequent dose intensity 3Q4W regimen, and are continuing this study in Leiomyosarcoma for 10 to 15 patients to evaluate this dosing regimen for potentially opening up a broad soft tissue sarcoma Phase 2 study in the future. As a reminder, part 1 of a Phase 2 study of non-small cell lung cancer is ongoing in actual positive patients who have previously experienced failure of either PD-, PDL-1, EGFR or ALK inhibitors. Further leveraging our insights and FDA discussions on UPS, we expanded our Phase 2, part 1 non-small cell lung cancer study to include the more frequent dose intensive regimens 2Q3W and 3Q4W. We are currently enrolling these patients as we prepare our submission for a meeting request to confirm the design of the potentially registrational Phase 2, part 2 study with the agency in the first half of this year, with feedback anticipated in the second half, complete with the final dose selection. As previously reported in our Phase 1 clinical data, we saw impressive responses in ROR2 positive patients refractory to PD-1 therapy, including two PRs in non-small cell lung cancer, one PR in head and neck cancer and one complete response in a melanoma patient who remains in complete remission off treatment for over two years. Based on a similar exposure response analysis done in actual positive tumors, we are pursuing the same strategy in our Phase 2 ROR2 positive non-small cell lung cancer study and currently enrolling patients in the more frequent, more intensive dosing regimen of 3Q4W in the first half of this year and plan to share data when we have sufficient evidence to determine how to proceed with our potentially registrational study. Regarding the Melanoma Phase 2 trial in patients who have previously experienced failure of the PD-1 therapy following an additional CR in an invaluable patient identified using our validated IHCSA, we are screening patients with a validated liquid biopsy and anticipate providing an enrollment update on or around the first quarter 2023 earnings call in May. I'm curious, would you share the efficacy outcome for the six patients in near term and also for the Phase 2, part 2, you're going to evaluate two different dosing, 3Q4W, and a 2Q3W in the first 40 patients."
}