{
    "symbol": "BCAB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 11:47:03",
    "content": " Before we begin, Iâ\u0080\u0099d like to remind everyone that statements made during this conference call will include forward-looking statements, including, but not limited to, statements regarding BioAtlaâ\u0080\u0099s business plans and prospects, potential selective licensing collaborations and other strategic partnerships, whether our clinical trials will be potentially registrational, results, conduct, progress and timing of our research and development programs and clinical trials; expectations with respect to enrollment and dosing in our clinical trials, plans regarding future data updates, clinical trials, regulatory meetings and regulatory submissions, the potential regulatory approval path for our product candidates; expectations about the sufficiency of our cash and cash equivalents and expected R&D and G&A expenses. Our Phase 2 BA3021 studies continue to progress, and we anticipate enrollment completion of up to 20 patients in our non-small cell lung cancer study by year-end for reporting in January. We have several additional upcoming catalysts as well as important results to be covered in todayâ\u0080\u0099s discussion, including exciting updates from our Phase 2 sarcoma study as well as updates from our Phase 2 non-small cell lung cancer study with our lead asset, BA3011. As a reminder, part 1, our Phase 2 study in non-small cell lung cancer is ongoing in AXL-positive patients who have previously experienced failure of PD-1, EGFR or ALK inhibitor therapies. To put this data into perspective, and notwithstanding the relatively small sample size of our data set, the preliminary efficacy observed in this study and in particular, that observed for the BA3011 monotherapy non-squamous group is highly competitive in this PD-1 refractory population and supportive of moving forward to the potentially registrational part of this study. In part 1, we found that UPS and osteosarcoma subtypes responded to BA3011, which provided the rationale for moving forward into part 2, of the study based on predefined internal go-no-go criteria of either at least 1 partial response, a complete response for subtype or progression-free or PFS rate of at least 40% at 3-month. Before I review our key operational updates for the quarter, I want to share my excitement around our lead asset, BA3011 with updates on part 1 of the Phase 2 non-small cell lung cancer study and the proposed path forward in soft tissue sarcoma, specifically UPS. In Phase 1, we saw impressive responses in ROR2-positive patients refractory to PD-1 therapy, including 2 PRs in non-small cell lung, 1 PR in head and neck cancer and a complete response in a melanoma patient who remains a complete remission off treatment for over 2 years. We have seen â\u0080\u0093 if we combine our Phase 1 and Phase 2 UPS patients, weâ\u0080\u0099re seeing a 50% response rate, which is very, very high in this particular population. I continue to be impressed with the non-small cell lung cancer data, especially in those previous PD-1, and part 2, where I believe last quarter, you made comments that youâ\u0080\u0099d like to enroll 100 patients. We are really excited about moving 3011 into what could be a potential registrational study in UPS moving forward into part two of the lung study, and we are really excited about next year as well were two data coming, CTLA-4, data coming from the Phase 1/2 study there."
}