{
    "symbol": "CWK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 10:16:05",
    "content": " In the first quarter, we reported fee revenue of $1.7 billion, up 29% over last year and adjusted EBITDA of $214 million, up 118% over last year, both of which represent first quarter records for the company. As evidenced in the first quarter, according to Real Capital Analytics, overall U.S. transaction volumes remain elevated with $171 billion of volume transacted, up 56% versus last year. Quarter 1 was the strongest first quarter on record in terms of absorption with U.S. occupancy at an all-time high of 96.7% and rental growth of 15.3% year-over-year, nearly double the current rate of inflation. We're also seeing this reflected in total global office leasing activity, where preliminary data shows an increase of 19.1% in the first quarter versus prior year. And this is in line with the 90 U.S. markets that Cushman & Wakefield tracks, where total leasing activity was up 19% in the first quarter compared to prior year, and on a trailing 12-month basis was up 41% from the same period a year ago. Our continuing revenue growth and earnings expansion in this area reflects our fast maturing capabilities, and I'm excited to share with you today that in the first quarter, we were awarded one of the industry's largest contracts by a major global financial institution based in the U.S. for a 17 million square foot portfolio across all service lines in the United States. For the first quarter, fee revenue of $1.7 billion and adjusted EBITDA of $214 million resulted in adjusted EBITDA margins of 12.6%, an increase of 512 basis points compared to the prior year, driven primarily by brokerage revenue. In the first quarter, leasing and capital markets revenue increased 58% and 76% respectively, versus an easier prior year comparison as a result of the impact of COVID in the first quarter of 2021. In capital markets, investment appetite remained strong with fee revenue growth of 51% compared to pre-pandemic levels in the first quarter of 2019, driven largely by the Americas segment, where nearly all property sectors showed growth."
}