{
    "symbol": "TBLA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 15:32:03",
    "content": " We mentioned at our Investor Day that our next big milestone is $1 billion in ex-TAC, which implies $300 million of adjusted EBITDA with roughly $150 million of free cash flow and that we're investing in recommending anything and anywhere. While we're still in early stages, we're seeing strong results anywhere from 5% to 10% win rates and at scale, this will allow us to support our publishers making their display revenue grow and this will grow our share of wallet, make our advertisers more successful and potentially generate hundreds of millions of dollars using our unique first-party data and AI. Even in a particularly soft quarter like Q3, we generated over $10 million of free cash flow and over $25 million if you factor out interest paid on our long-term debt and net prepayments to publishers. And then on the performance advertising, it's our number one as a reminder, and again, it's in my letter, but there are four things we're investing in right now as a company, performance advertising, which will help us drive yields and revenue from our existing publisher base. So just following up -- just building on that last question, where we're going into these very uncertain times and a lot of guys are taking down sort of 4Q and next year, does that affect the cost of your guarantees, like you get better deals in environments like this because you're willing to give them guarantees in an environment where there's so much uncertainty. And that also why it helps us to reaffirm $152 million EBITDA this year, which I'm very proud of, I think, which leads to your second question, we're trying to run a business that not only is a great business now, but can be even stronger on the other side of it. And the third one is that, you don't want to just get money, you want to empower your editorial team, your subscription team, your product team and by working with us, I can tell you in about two weeks from now, one of our largest publishers, they are coming in with almost 10 people, Head of Audience, Head of Product, Head of Subscription, the Chief Editorial person, none of them is even in the revenue team, and they're all coming to see what can we do together to help drive engagement."
}