{
    "symbol": "MO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 12:57:03",
    "content": "  Operator: Good day, and welcome to the Altria Group 2022 Fourth Quarter and Full Year Earnings Conference Call. Todayâ\u0080\u0099s call is scheduled to last about one hour, including remarks by Altriaâ\u0080\u0099s management and the question-and-answer session. I would now like to turn the call over to Mac Livingston, Vice President of Investor Relations for the Altria Client Services. This morning, Billy Gifford, Altriaâ\u0080\u0099s CEO; and Sal Mancuso, our CFO, will discuss Altriaâ\u0080\u0099s fourth quarter and full year business results. The release, presentation, quarterly metrics and our latest corporate responsibility report are all available at altria.com. During our call today, unless otherwise stated, weâ\u0080\u0099re comparing results to the same period in 2021. Finally, all references in todayâ\u0080\u0099s remarks to tobacco consumers or consumers within a specific tobacco category or segment refer to existing adult tobacco consumers 21 years of age or older. It was an exciting year for Altria as our businesses delivered strong financial performance, and we continued to strategically invest toward our vision. We grew our adjusted diluted earnings per share by 5%, and our tobacco businesses remained resilient and successfully executed their strategies. Last year, we returned more than $8.4 billion to shareholders, outpacing our record returns from 2021 and representing the largest single year cash return since 2002. Our vision guided our actions, and we believe we made meaningful progress on our journey toward moving beyond smoking. nicotine pouches, creating long-term optionality for our inhalable smoke-free product portfolio, enhancing our digital consumer engagement and continuing to advocate for tobacco harm reduction. reported shipment volume to 82.5 million cans during its first full year of unconstrained manufacturing capacity, an increase of more than 70% versus the prior year. In oral tobacco product development, we are excited to announce we have finalized a new product design, which will provide tobacco consumers more smoke-free options within our portfolio. We also began regulatory preparations for the product, and we are encouraged by the initial research results and the response we have received from dippers and nicotine pouch users. Internally, we have not yet finalized the design of our heated tobacco capsule product, but our teams continue to make progress. And in October, we announced a strategic partnership with JT Group, including a joint venture for the U.S. commercialization of heated tobacco stick products. In e-vapor, we previously announced we elected to be released from the noncompete obligations related to our JUUL investment. We believe the category can play an important role in harm reduction, and weâ\u0080\u0099re continuing to evaluate all options to best compete in the category. Next, letâ\u0080\u0099s discuss the progress we made to enhance our digital consumer engagement. We launched a new digital trade program last spring, and we believe this program enhances our ongoing commitment to responsible retail. And once the consumer is verified, retailers can then provide offers and messaging from our brands within the retailerâ\u0080\u0099s app. Iâ\u0080\u0099m excited to share that we implemented these solutions in more than 33,000 stores, exceeding the goal we outlined last year at CAGNY. Currently, consumers can view offers from our smokeable and more smokeless tobacco brands. As we continue to broaden our digital reach, data will help us better understand each smokerâ\u0080\u0099s journey and help them successfully transition to other smoke-free alternatives in our portfolio. We remain optimistic about the future of harm reduction in the U.S. We believe we have an unprecedented opportunity to lead the way in shifting millions of smokers to smoke-free alternatives, if we follow the science and foster innovation with the support of reasonable regulation. In December, the Reagan-Udall Foundation published its operational evaluation of the FDAâ\u0080\u0099s Center for Tobacco Products. Among its recommendation, the report urges the FDA to clearly define product pathways and accelerate PMTA decision-making, take enforcement actions against manufacturers and products in violation of the law and address the need for risk communications to tobacco consumers. We agree these are important opportunities and believe that the FDA should direct its focus toward implementing a framework to advance harm reduction, rather than focusing on prohibition policies that we believe will further expand the illicit market and create other unintended consequences. Although volumes declined by an estimated 1% year-over-year amid considerable regulatory uncertainty such as the FDA from denial order and subsequent temporary stay on JUUL products, which caused market disruptions for both consumers and retailers. In oral tobacco, volumes grew by an estimated 1.5%, driven by the continued adoption of all nicotine pouches. For 2023, our planned investment areas include: continued smoke-free product research, development and regulatory preparations; digital consumer engagement; and marketplace activities in support of our smoke-free products. We will continue to monitor the economy, including the impact of high inflation, tobacco consumer dynamics, and regulatory and legislative developments. Considering these factors, we expect to deliver 2023 full year adjusted diluted EPS in the range of $4.98 to $5.13. Before I turn it over to Sal, I would like to send a sincere thank you to our employees. Leo served on our Board since 2011 and made many contributions to Altria, including as Chair of the Compensation and Talent Development Committee and as a member of the Innovation Committee. In the fourth quarter, the smokeable products segment grew its adjusted operating companies income by 4% and expanded its adjusted OCI margins to 58.4%. As a reminder, manufacturer price realization does not reflect retail price changes for smokers. For example, Marlboro net retail pack price increased 6.4% in the fourth quarter compared to last year. We continue to successfully execute against our strategy in the smokeable segment, maximizing profitability while balancing investments in Marlboro with funding the growth of smoke-free products. For the full year, smokeable segment adjusted OCI grew 2.9% to $10.7 billion, and adjusted OCI margins expanded by 1.4 percentage points to 59%. In addition, over the past five years, the smokeable segment has grown adjusted OCI by $2.2 billion, representing a compounded annual growth rate of 4.7%. Over the same time period, adjusted OCI margins have expanded from 51% to 59%, an impressive increase of 8 percentage points. When adjusted for calendar differences and trade inventory movements, domestic cigarette volumes for the fourth quarter and full year declined by an estimated 11% and 9.5%, respectively. At the industry level, when adjusted for trade inventory movements, calendar differences and other factors, we estimate that adjusted domestic cigarette volumes declined by 9% in the fourth quarter and by 8% for the full year. Next, letâ\u0080\u0099s discuss retail share performance. We believe these results were driven by an increased pressure on smokersâ\u0080\u0099 disposable income and increased competitive activity, including multiple branded discount offerings priced at deep discount levels. Most of the full year share losses were attributable to the value options within the Marlboro brand family, such as Special Select and Marlboro 72s as some price-sensitive consumers continue to seek additional price relief. Meanwhile, the brandâ\u0080\u0099s mainline non-menthol offerings, including the iconic red and gold pack varieties were resilient and performed well for the year. In fact, over the past three years, Marlboro grew its share of premium by 1 full share point. In cigars, reported cigar shipment volume decreased 4% for the full year. Next, we will move to the oral tobacco products segment. When adjusted for trade inventory movements and calendar differences, we estimate that full year total oral tobacco segment volumes declined by an estimated 2%. Within the traditional smokeless category of MST and snus products, Copenhagenâ\u0080\u0099s share performance has been stable over the last three years, declining only 0.3 from 2019, whereas the second largest traditional smokeless brand has ceded 1.6 share points. We recorded $571 million of adjusted equity earnings for the full year, down 10.6% versus 2021. We continue to view the ABI stake as a financial investment, and our goal remains to maximize the long-term value of the investment for our shareholders. In our all other operating category, we have completed our wind-down of Philip Morris Capital Corporation and no finance assets remain. Finally, we continue to effectively manage our balance sheet while generating strong financial performance and returning significant cash to shareholders. Our debt-to-EBITDA ratio was 2.1 times, down 0.4 over the past three years, and our weighted average coupon was 4%, a decrease of 0.2 over the past three years. In addition, we returned more than $8.4 billion in cash to shareholders last year through dividends and share repurchases. We also repurchased more than 38 million shares during the year, totaling $1.8 billion, which completed our previously authorized program. Earlier this week, our Board authorized a new $1 billion share repurchase program, which we expect to complete by the end of 2023. While the calls are being compiled, Iâ\u0080\u0099ll remind you that todayâ\u0080\u0099s earnings release and our non-GAAP reconciliations are available on altria.com. Weâ\u0080\u0099ve also posted our usual quarterly metrics, which include pricing, inventory and other items. As we mentioned during the call, we have exciting topics to discuss at our Investor Day next month. I recognize you guys have kind of suspended the historical practice of offering industry guidance, and that makes good sense to me. Yes, I think itâ\u0080\u0099s a little early to say exactly what that headwind will be, Vivien. We think itâ\u0080\u0099s -- it actually -- we were very pleased with the results we -- as you mentioned, we reduced it 15% first half to second half and it continued its momentum and grew share. We think itâ\u0080\u0099s a growing category, Vivien, and that the entire segment is growing, and we want to participate in that growth. And as we move forward, I think you see the benefit of data analytics. And then, in the future, the application of what most people refer to as revenue growth management that weâ\u0080\u0099ve seen success in traditional smokeless as well as cigarettes. So, thatâ\u0080\u0099s what you can expect from us as we move forward. And just one last one for you, Sal, please, I recognize itâ\u0080\u0099s premature for us to start modeling royalties from the IP litigation with British American Tobacco because thereâ\u0080\u0099s certainly an appeals process. But, as you know, with any year, you put plans in place and there are always puts and takes. So, I think itâ\u0080\u0099s early to really think about how you might model that. Vivien, I know youâ\u0080\u0099re looking for -- Iâ\u0080\u0099m sorry, Pamela, youâ\u0080\u0099re looking for guidance on upcoming volume. I think youâ\u0080\u0099ve heard as many predictions as I have had soft landing, no deep recession. So, I think even the experts from an economist standpoint are all over the board. We feel good about where the consumer is, but we want the adaptability and the flexibility to be able to move with the consumer needs. So I think the consumer will remain under pressure until we see some relief, if you will, from inflationary pressures in the marketplace. Thatâ\u0080\u0099s -- we certainly have seen a decline, but nowhere near the lows we were seeing as we were pre-pandemic levels. So, gas prices can move around depending on China reopening and things of that nature. I think when you think about volumes, itâ\u0080\u0099s specifically combustible volume. Tobacco, the industry is not immune to macroeconomic environment. And so, from that standpoint, historically, what weâ\u0080\u0099ve seen, Pamela, is that as the consumer is experiencing this rapid change in their economic condition, whether up or down, they make changes in their purchasing behavior and then it becomes more comfortable to them through time and they adjust various factors in their purchasing basket. And my other question is just on your 2023 earnings guidance, which reflects a slightly lower growth rate compared to your 4% to 7% guidance over the last several years. I think, the last comment you made, I would say thereâ\u0080\u0099s a slight shift. I think when you think about it, itâ\u0080\u0099s really the uncertainty around the macroeconomic environment was the biggest impact to the overall guidance. Just thinking about the strength in your net price realization and smokeables over the past several quarters, itâ\u0080\u0099s been so darn robust. But the way we think about pricing, as you know, itâ\u0080\u0099s an important part of the algorithm when youâ\u0080\u0099re in a declining category. Remember, our strategy in that category is, maximize profitability over the long term while making appropriate investments in Marlboro in the growth areas. When you think about pricing, I think itâ\u0080\u0099s important to really focusing on what Sal mentioned in his remarks. You see high price realization, but at retail to the consumer from a consumer-facing, Marlboro on average went up about -- just shy of 6.5%, 6.4%. So, the price increase to the consumer is much lower than what you see in the price realization. Itâ\u0080\u0099s list price, as you would expect, across the industry, but itâ\u0080\u0099s also the implementation of RGM. And so, with that price realization and usually Bonnie, you or one of the other analysts will ask us about price gap, and itâ\u0080\u0099s at 41%. I think itâ\u0080\u0099s important to remember, as we get the data and really that data -- thatâ\u0080\u0099s somewhat impersonal. As we analyze that, what weâ\u0080\u0099re able to do is the price gap varies locality to locality. It can vary store to store, and it can vary within -- even within the Marlboro franchise. You heard Sal talk about -- if you think about that overall price gap of 41%, you have the packing. If you look at total year 2022 to total year 2021, you can see it was very stable. As far as how do we think about pricing going forward, weâ\u0080\u0099ve shared with you whether itâ\u0080\u0099s percent of discretionary income, a minutes work and when you benchmark the U.S. against other countries around the world, weâ\u0080\u0099re still at the very low end of that. Just switching gears, if I may, a question on your oral tobacco business. volume growth has been and -- but in the context of that, your total oral tobacco revenue and profit growth has been under pressure with a fair amount of margin contraction. Within the old tobacco space, if you think about that total space, you have traditional moist smokeless tobacco and you have novel oral pouches. Some of the margin contraction youâ\u0080\u0099re seeing is just true mix, right, as consumers are moving from traditional moist smokeless tobacco and novel oral growing, youâ\u0080\u0099re going to have some mix impacts in that overall margin. We highlighted for you the reductions we made in promotional spend per can, but still had the minimum share. I wonâ\u0080\u0099t necessarily give you a sneak preview because I donâ\u0080\u0099t want to get ahead of myself for Investor Day, weâ\u0080\u0099d like to unveil it in total context and paint the solid picture for investors. Billy, you spoke in the release and in your prepared remarks about making sort of \"meaningful progress\" on the smoke-free portfolio. But at the same time, your CapEx guide is flat versus last yearâ\u0080\u0099s guidance. And I think as you said, to Pam, that any slight reduction is more driven by the macro environment, which presumably also implies little or no incremental P&L investment in NGPs as well. I think when you think about where those investments show up, itâ\u0080\u0099s important to remember, theyâ\u0080\u0099re not all incremental spend. Theyâ\u0080\u0099re going to shift some of those -- the infrastructure that the combustible or traditional MST has bore the cost through history, and youâ\u0080\u0099re going to shift that to the NGP space. We do have incremental investments around NGP product development, the regulatory preparations associated with that and the research associated with that. If you think about like even the digital consumer engagement, that weâ\u0080\u0099re implementing in traditional smokeable or combustible and MST, and we mentioned in the remarks being able to transition that over. So, youâ\u0080\u0099ll see those costs will actually appear in the combustible and the smokeless before it appears in the NGP categories. So, thereâ\u0080\u0099s a lot going underneath the surface, if you will, from an investment standpoint. I guess, the natural follow-up is, if I benchmark relative to your big competitors, both in the U.S. and internationally, the two biggest amongst them are spending literally billions of dollars a year. And my guess is instinctively, if youâ\u0080\u0099re just talking about switching a portion of your cigarette spend, over into NGP, youâ\u0080\u0099re not going to get anywhere close to that billions of dollars a year. Yes, we do believe that weâ\u0080\u0099re trying to really be driven by the consumer, learning from the global marketplace of products in the marketplace and use those as, if you will, a launch point for products and really trying to meet what the desires and needs of the consumers are in the marketplace that arenâ\u0080\u0099t met by those existing products in the marketplace. Weâ\u0080\u0099ve highlighted for you guys that we really believe we can navigate strong returns to shareholders at the same time, making the appropriate investments in these growing categories. I think youâ\u0080\u0099ll continue to hear us talk about investments, and weâ\u0080\u0099ll provide a lot more detail of some of the progress weâ\u0080\u0099ve made at Investor Day. And when you were distributing IQOS, then the volumes were much lesser than any of us had expected. So, what did you find were the challenges when U.S. consumers came to IQOS? Itâ\u0080\u0099s a great question. I think when you think about IQOS, it was really about the disciplined approach that we were taking to introduce in a brand-new category. Gaurav, you are correct to point out that inflation is a factor when you think about MSA expense. You are correct to point out that when you think about inflation related to MSA, thereâ\u0080\u0099s 3% floor. So, even if inflation were measured below 3%, thereâ\u0080\u0099d be a 3% increase in the MSA expense. And Iâ\u0080\u0099ll also remind you that inflation is measured at a point in time, December 31st current year to December 31st prior year. So, we have considered that when you think about 2023, there will be an elevated level of inflation. We have seen some receding of the rate of inflation, but still expect it to be elevated. And then finally, Iâ\u0080\u0099ll say, there are other factors besides inflation to consider when you think about MSA expense, including volume, shipment share and other such factors. And my last question is on share repurchases for next year, which at $1 billion or below what we thought and I think where most people were. And even though your EBITDA is growing -- youâ\u0080\u0099re generating free cash flow after dividends, your leverage will anyway be down when you have the ABI stake. Well, first, let me say, weâ\u0080\u0099re very happy that the Board authorized a $1 billion share repurchase. And if you think about capital allocation, I think we have a history of taking a balanced approach. So, as you know -- as I noted in our opening remarks, we plan on paying back about $1.3 billion in notes coming due with available cash. And currently, we believe the best thing for the shareholder over the long term is to hold the asset. And obviously, a round at though discount and deep discount share is accelerating, which has seemed to provide some risk to the brand. I think when you think about the resilience here at Marlboro, weâ\u0080\u0099re very pleased with it. I think when you think about your question on promotions, I would point to you that the high price realization actually shows that weâ\u0080\u0099re able to be more effective and efficient on our Marlboro price promotion. I think it may be useful that -- I talked about Marlboro Red and Gold versus some of the price sensitive, but some of the tools that we have in place actually allow the precision. So, Iâ\u0080\u0099ll just walk through a quick example with three consumers. When you think about those consumers, youâ\u0080\u0099re going to treat those differently to make them more of a continuous premium brand smoker. That discount smoker, you may never be able to get them to convert to a premium because of the condition -- the economic condition that theyâ\u0080\u0099re in. So, as we move to personal value delivery as close as we can get to the consumer, we can tailor that across those three. And so, that allows us to have Marlboro be resilient, address the consumersâ\u0080\u0099 needs on a case-by-case basis, if we can get really close to the consumer and spend those resources accordingly to have a more consistent premium consumer through time. I had one other follow-up, which would be, you do have two relatively unique kind of profit drags this year, with PMCC winding down, obviously, pensions moving around. Yes, Chris, Iâ\u0080\u0099ll be -- so letâ\u0080\u0099s talk about pensions for a moment. If you think about pensions, obviously, thereâ\u0080\u0099s a P&L impact related to return on assets, changes in discount rate, but I would say the pension is really well funded. So, you are correct in that we had earnings and cash flow last year, and this year we will not. On your smokeless business, especially on what weâ\u0080\u0099ve seen, the brand has been driven by strong discounting versus the main peer. I think when you think about it -- and this is not an excuse, itâ\u0080\u0099s just facts. And when consumers -- to get consumers to have new brands in their consideration set, you have to induce trial. I would say, from a consumer standpoint, itâ\u0080\u0099s still very small compared to the total nicotine space. So, weâ\u0080\u0099re going to spend while -- and invest while the overall category is growing, so we can participate in that growth. We mentioned previously, it was intuitive that the adult dipper would move to the product pretty quickly and that the adult cigarette consumer, youâ\u0080\u0099re going to have to induce trial and thatâ\u0080\u0099s what weâ\u0080\u0099re in the process of doing and are excited about the results thus far. I think through time, we did reduce the promotional spend per can. So, when you think about the price gap, if you will, the way you referred to it, to a competitive product in the marketplace, youâ\u0080\u0099re going to invest while the category is growing, so you get these products in the consideration set. I think you saw the benefit of that in this past year, but we have more to do there. And I think as we continue to progress and move forward, we feel good about it. I donâ\u0080\u0099t want you to think, though, itâ\u0080\u0099s all discount. And I hate to use the business term, but itâ\u0080\u0099s surrounding the consumer and really meeting them where theyâ\u0080\u0099re at in their journey and then supporting in that journey to fully transition over, if you will, from cigarettes to this novel oral pouch. We feel good about the progress weâ\u0080\u0099ve made thus far, but we certainly have to continue to drive awareness of the induce trial. And if I could squeeze in just one more if you donâ\u0080\u0099t mind, is that Marlboro has indeed done very well, and congratulations for that. I would say if you look at growth, I would say the growth, if you look at competitors has really been at the very, very bottom end. Sal highlighted in his comments, there are a number of major manufacturers that have what we would consider branded discount priced in deep discount space. And so, when we look at total portfolios for some of those, we donâ\u0080\u0099t see the benefit of having gone down to that low price tier. We think itâ\u0080\u0099s important, but we certainly donâ\u0080\u0099t want to grow the discount category. And I think being premium focused where we feel the profitability and the high loyalty is in the cigarette space is an important place to play, and thatâ\u0080\u0099s where weâ\u0080\u0099re focused. And Sal highlighted for you, our premium brands are growing. So I really appreciate your commentary, Sal, around the intent to pay down your upcoming euro maturity later this month. I guess, as we take a step back, your euro-denominated debt has really sort of come down, I guess, partly driven by sort of the income that youâ\u0080\u0099re receiving from the ABI stake given that that was sort of a natural hedge. Priya, first, Iâ\u0080\u0099m going to start my answer by just reiterating, I really have nothing to report. And as it pertains to ABI, we continue to believe holding the asset is in the best interest -- long-term interest of our stakeholders. Second, I would tell you that while we have flexibility, itâ\u0080\u0099s really a market-by-market analysis and a transaction-by-transaction analysis related to what markets we may or may not enter as we think about managing our debt going forward. So, thatâ\u0080\u0099s kind of how I would answer your question. I was a little surprised because in the fourth quarter, JUUL resolved a large part of the litigation that it faced, which eliminated some of the uncertainty around the company. First, Iâ\u0080\u0099ll remind you that we had taken an impairment related to litigation, and we really captured it within kind of our overall discount rate of the JUUL assets. But on a quarterly basis, the way we account for JUUL is, has us run an analysis of the fair market value of the investment. Itâ\u0080\u0099s not publicly traded, so we have to do an independent analysis. And from quarter-to-quarter, thereâ\u0080\u0099s going to be changes, and weâ\u0080\u0099ve been pretty communicative about that. This quarter, it did -- our investment was reduced to $100 million and itâ\u0080\u0099s really macro driven, itâ\u0080\u0099s really macroeconomics and other factors that are considered when doing that analysis. Yes, macro market conditions, inflation, discount rates, things like interest rates, consumer dynamics, all of that goes into the analysis. So certainly, the interest rate increases weâ\u0080\u0099ve seen through time are going to continue to impact it as long as theyâ\u0080\u0099re still on an upward trajectory. Itâ\u0080\u0099s a great question. What weâ\u0080\u0099re seeing is as we see mobility increase, if you will, the U.S. is coming out of the COVID pandemic, weâ\u0080\u0099re actually seeing a return to more frequent trips. Remember, our consumer pre-COVID would go either every day or every other day. You see a little bit, and we highlighted that, which was the consumers that are under dire economic conditions at times will either switch out or trade out to a cheaper brand. Itâ\u0080\u0099s more about through time, reducing their nicotine occasions. So remember, as we came into the -- thereâ\u0080\u0099s no change in the overall trend, if you will, the long-term trend. As we went through COVID and there was less mobility, less societal pressures, we actually saw what we believe nicotine occasions go up. We see in -- when the economic conditions and the macroeconomic environment is greatly impacting the consumer, they will strict their nicotine occasions."
}