{
    "symbol": "TESS",
    "quarter": 2,
    "year": 2022,
    "date": "2021-10-29 17:06:18",
    "content": " Good morning, everyone, and thank you for joining TESSCO's Q2 Fiscal Year 2022 Conference Call. Joining me today are Sandip Mukerjee, TESSCO's President and Chief Executive Officer; and Aric Spitulnik, the Company's CFO. Forward-looking statements involve several risks and uncertainties, and TESSCO's results may differ materially from those discussed today. Information concerning factors that may cause such a difference can be found in TESSCO's public disclosures, including the Company's most recent Form 10-K and other periodic reports filed with the Securities and Exchange Commission. With that introduction, I would like to turn the call over to Sandip Mukerjee, TESSCO's President and CEO. Our second quarter performance provides further compelling evidence that the work we have done in implementing our strategic initiatives are yielding positive results, while setting us up for even greater long-term success. Our revenues grew 3% sequentially and 22% year-over-year, with gains in both our markets. Total sales bookings were up 38% year-over-year, reflecting robust demand for our products and services. At the same time, we continue to make progress with our Ventev business, where bookings grew 17% year-over-year, the highest we have ever achieved. And we saw increasing utilization and growth in revenue on our website, tessco.com, both sequentially and year-over-year. While we are excited about the strong demand environment, we are also cautious about the global supply chain disruptions, challenges with freight and predictability of product availability. For TESSCO, this means longer lead times, increasing freight costs and delays in converting bookings to revenue. I will now walk you through the results and highlights of the past quarter in the following format: first, our two markets, carrier and commercial; second, the three elements of our business -- distribution, Ventev and software; and third, our performance on tessco.com. Starting with our carrier business, as I mentioned, the second fiscal quarter marked another record for revenue. Carrier market revenue was up 44% year-over-year and 2% over the first quarter, which was our previous record quarter. Our continued strength is due to our logistics and supply chain management expertise, our proprietary engineering and production capabilities, and the successful execution of our business development initiatives. Within the Tier 1 carrier ecosystems, revenues this quarter grew 38% year-over-year. Regarding new business, we are seeing sales to the new customers we mentioned last quarter, and we will ship our first orders to one of the largest wireless carriers in the current third fiscal quarter. Our business development efforts have been highly effective, enhancing our market share with existing customers and expanding the number of customers that we service. While demand from our carrier segment continues to grow, several key products remain highly constrained due to the supply chain disruptions. Turning now to the commercial market, which includes all wireless infrastructure business outside the carrier ecosystem. The commercial market had its best revenue quarter in seven quarters, posting 5% sequential and 10% year-over-year growth. The largest growth sector this quarter was again our VAR customers, up 10% sequentially and 29% year-over-year. This growth was driven by our sales focus on these VARs, continued lessening of the pandemic impact we described in prior quarters, and availability of inventory targeted and purchased for this sector. We are demand planning with our top VARs to better forecast product to meet their demand, especially given the current supply chain disruptions. Many of our customers have utilized our design services, and we are working with these customers to assist them with the necessary product purchases. Bookings have been strong, which should result in continued growth in the second half of the year. While revenues were down 8% year-over-year, our utility business is regaining momentum, and sales grew 19% sequentially. Bookings were also strong, growing 29% sequentially. Our solutions expertise and our line card put us in a very good position, especially with the recent supply relationships that we have announced. Starting with our distribution business, we continue to win market share and develop new customer and manufacturer relationships. Our line card is now one of the most robust critical communications portfolios in the market and includes, among other solutions, products for public safety DAS, cellular DAS, broadband, small cell, macro site and CBRS/private LTE. Our turnkey offerings, value-added services, including solution development and design, site kitting and supply chain logistics provide cost efficiencies for our customers and reduce complexities for their deployment challenges. We're making progress with our IT infrastructure modernization projects, which we expect to largely complete by the end of this fiscal year. Some of these will include reduced freight end costs, improved delivery consolidation, streamlined inventory transfers, ability to proactively identify potential order delays, and streamlined closing of financial statements. First, we have increased our forward-looking demand planning with customers, which has resulted in many of our customers providing us with purchase orders earlier than they had in the past. Second, we have worked very closely with our vendor partners to address supply availability and price increases. And as a result, we create opportunities for ourselves to make educated purchases of constrained inventory to help our customers and protect TESSCO's margins. Despite the headwinds, we will remain focused on our business development efforts to drive growth in our markets while continuing to drive efficiencies throughout our company. Also, we will work closely with our customers and our suppliers to mitigate supply disruptions and inflationary pressures with the goal of improved profitability. Regarding our Ventev business, bookings grew 17% year-over-year, totaling the highest we have ever achieved. While the end customers are the larger nationwide carriers, this business unlocks a new revenue stream for our commercial market, driven by 5G deployments. Other innovations from Ventev this quarter include a variety of enclosures, cabinets and power solutions, all developed using the productization focus we embarked on 18 months ago when we launched our three pillar strategy. And as the bookings demonstrate, these innovations have been well received by customers from many verticals, including clean energy, federal agencies, warehouse operators and universities, to name a few. Our focus and strategy is to ensure attachment of Ventev products with LMR/two-way, public safety DAS and small cell solutions, which improve both margins and customer satisfaction. Regarding our software business, as we mentioned last quarter, our device monitoring and alerting service met generally available or GA milestone and is now in production. We now have a number of customers using this platform, and we are in commercial discussions to help them scale and include this capability as part of their own go-to-market strategies. While we expect initial revenues this fiscal year, as we have said before, these revenues will ramp in fiscal 2023. Our continued focus on tessco.com resulted in an increase in the number of buying customers, the number of repeat customers and the size of orders we have seen this past quarter. In Q2, revenue increased 12% sequentially and 18% year-over-year, totaling $11 million. Engagements, measured by product page views, increased by 280% year-over-year. Second quarter revenues increased 22% year-over-year to $108.5 million due to strong demand across our carrier and commercial markets. As Sandip said, the Q2 carrier market revenues were another record high and commercial revenues were the highest achieved in the past seven quarters. Gross profit was $19.8 million for the second quarter of fiscal 2022, compared with $17.1 million for the same quarter of fiscal 2021. Gross margin was 18.2% of revenue for the second quarter of fiscal 2022, compared with 19.3% in the second quarter of last year. Gross margins in the carrier market continue to be ahead of last year's pace, but we still expect some contraction in the second half of the year based on customer and product mix. Commercial margins were lower than normal this quarter due to some larger projects that were at lower margins, but we expect commercial margins to be better in the remaining two quarters of the fiscal year. Overall, we would expect total margins in the second half to approximate where they were in the first half. In fact, we lowered overall SG&A as a percentage of revenues 410 basis points from 23.4% to 19.3% year-over-year. Second quarter 2022 net loss was $1.3 million, compared with a net loss of $2.9 million a year ago. Adjusted EBITDA was a loss of $200,000 compared with a loss of $2.3 million a year ago. As we had expected, product inventory decreased by nearly $12 million in the second quarter. We would expect more normal quarterly fluctuations in the coming quarters, but the volatile supply chain may still lead to some temporary spikes in inventory. We are still owed another approximately $6 million in tax refunds, but do not expect the majority of that to be received until later in FY 2022 or into early FY 2023. At the end of Q1, our payables and accrued expenses exceeded our receivables by $12 million. These include: number one, achieving between $408 million and $442 million in full year revenue; number two, achieving full year adjusted EBITDA of between breakeven to $2.4 million; and third, a full year net loss of between $6.4 to $4.1 million. We continue to improve our results both sequentially and year-over-year, and I am very excited about the direction we're heading in. In closing, we had another record revenue quarter in our carrier business and the highest revenue in our commercial market since Q4 of fiscal year 2020. And all of these have contributed to a significant improvement in our profitability, as evidenced by the $2.1 million year-over-year improvement in adjusted EBITDA. On the profitability side, that's a little harder to forecast with the changes in product mix that have been going on. But we're not going to get too much into what exactly needs to happen to be low to high, but we think we're in a good position to at least be at the low end of all of those ranges. The supply chain issues, the team is navigating very well, and we will continue to navigate. So we are working very closely with our customers to understand their future projects, their current projects and their supply needs. The orders we are getting are not too far out years into the future, but a couple of quarters into the future than otherwise people would have placed. On the commercial business side, we are seeing robust demand. And as our bookings progress shows, we're really very positive and very pleased with the year-over-year cadence. It's more of a TESSCO internal thing as opposed to a market issue, but I think it gives you a flavor across the board for the question you're asking. That's probably about 80% of the answer is the supply chain issues that spiked up in Q1, and we significantly attacked that to get those down in Q2. We've also done a good job of managing the inventory a little bit tighter than we were, given the supply chain issues that we see and the volatility. And we do expect a small increase here in the third quarter, but not nearly what we saw in the first quarter. So there's still going to be some lumpiness to the inventory because of the supply chain issues, but I think we're managing it very tightly and should be in good shape for the rest of the year. You asked a few things in that one question, so let's unpeel it a little bit. And as soon as the inventory comes in, it goes out and sometimes with other inventory that customers want, along with the power cable or those electronics. The second part of your question had to deal with backlog and how much more revenues had been, if I understood your question correctly. So Bill, that's a difficult one to answer because our customers are purchased -- are placing orders into the future, as we discussed with the last question. So when would they be ready to receive product, it's a little bit of a question mark. Historically, our backlog has been between $10 million to $20 million. Over the first half of this year, it's more than doubled. If you assume that we would have shipped half of that, that would have been an additional $20 million-plus in revenue, but not every quarter. And we have seen, and we've shared numbers over the last couple of quarters. This quarter, we did $11 million and a little more. And we're making more of an effort to move our business online, because as I said on the earnings call, it's much more efficient for us to process from a cost perspective."
}