{
    "symbol": "PCAR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 17:04:04",
    "content": " PACCARâ\u0080\u0099s increased vehicle production, new lineup of premium trucks and strong after-market Parts business drove the higher gross margins. We anticipate third quarter gross margins to be in the 14.5% to 15% range, reflecting a continued strong performance of PACCAR parts and a favorable mix of new truck models in production. PACCARâ\u0080\u0099s exciting new lineup of trucks and transportation solutions, efficient R&D and capital investments, strong after-market parts and financial services business and flexible operating structure position the company for a bright future. First question for you, just on your gross margin trajectory, if I look cycle, last time, we had like 1,000 builds versus 2014 and I think you guys are doing around I guess like margins, if we fast forward to where we are today, looks like weâ\u0080\u0099re heading for like a 14.5% run rate, kind of quite a curious about just like the cycle-over-cycle durability. As we shared in the commentary, the new trucks are performing really well, in the market in Europe and in North America, that performance is helping our customers perform better, finding excellent fuel economy for them. And then as far as commentary and pricing is we feel like because weâ\u0080\u0099ve got the right products in the marketplace, and that the best products delivering thousands of dollars per truck per year and fuel economy savings, that our customers will continue to want to buy those trucks from us. I think every market stands on its own, as you would be well aware and know, and weâ\u0080\u0099ve talked about in the past, right, there have been supply challenges, and weâ\u0080\u0099ve put a priority and making sure that we get the most trucks out for our customers that we could. Weâ\u0080\u0099ll take our next question. Yes, I think that we feel like the business is running really well, the teams have done a great job in the second quarter. Well, we donâ\u0080\u0099t really break the model out that way to think about it in terms of sequential timing of that, it obviously depends on which materials and the trucks, you bring up, the comment of which is, we have seen in the last several weeks, some softening and materials prices, but from very, very high levels. Weâ\u0080\u0099ll take our next question. Weâ\u0080\u0099ll take our next question. Weâ\u0080\u0099ll take our next question. I would say that weâ\u0080\u0099ve had a fantastic team of people working really hard around the business to deliver the great results, as we shared, we think that third quarter looks fantastic as well."
}