{
    "symbol": "PCAR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 16:52:04",
    "content": " PACCARâ\u0080\u0099s financial performance benefited from strong business growth across all of PACCARâ\u0080\u0099s major truck markets, and record results in our parts and financial services divisions. PACCAR Parts achieved fourth quarter revenues of $1.47 billion and record pretax profits of $380 million, which was 23% increase compared to the same period last year. European above 16-ton truck registrations were 298,000 last year, and DAF market share increased to a record 17.3% reflecting the success of the new generation of DAF trucks. We estimate Parts sales to grow by 10% to 13% in the first quarter of this year, compared to the same quarter last year, as high truck utilization contributes to strong global demand for parts. So when we think about deliveries in the first quarter, that's basically production is good run rates, we would say that our margins are doing well on both the parts side and the truck side. Just wanted to ask the first one on the parts growth, 10% to 13% in the first quarter is pretty admirable, just considering some of the rumblings you heard in the channel with regards to truck utilization, maybe being a bit more challenged, but you've obviously been getting the benefit of the MX engine penetration. And I also say that to kind of tie in your second question is we've seen strength globally for PACCAR, right, Europe is doing very well for us, the new trucks there, XG, XF, XG product lines are the only trucks in the industry in Europe that are taking advantage of the masses and dimensions regulations which allow a different shape. So the assets of PACCAR Financial Services fees that of course benefitted from nice  deal of scoring towards the end of the year, our share is about 26% to 36% of the trucks that kind of Peterbilt and DAF have sold were financed by Packer Financial Services. And with our introduction of new trucks, coupled with strong ton miles being driven, that's good for PACCAR and bodes well for a strong year. And it's part of the success of the company that we build trucks that get a premium, whether it's in a new truck market or in the used truck market and benefits the finance company and benefits the truck divisions as well."
}