{
    "symbol": "SKYW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 19:56:03",
    "content": " Consistent with last quarter's comments, we currently expect total 2023 results to be down from 2022, but remain modestly profitable before the effect of roughly $60 million per quarter in deferred revenue in 2023. I think that the big thing is that, 2022 is a big year, we lost a lot of pilots, specifically cabins and it just takes a lot of time to mathematically get back to the math that where we can increase our utilization 30% to 40% compared to where we are today. So it's good cash flow as well, particularly if we don't likely think we're going to get back to flying them many times soon. So yes, for 2023 we're expecting a deferred -- revenue deferred of about $240 million that's the $60 million per quarter. But I think the factor is when we're sitting here in January and February, these are not great predictive, these were lower than last year -- these were lower than last year's January and February by a fair amount, but we want to see what's happening in the springtime going in through summer and see what that is. It feels a lot different this year than last year, but we're not ready to do a wholesale model and that's kind of how we got to the 19% but there's -- it's probably a number that we're not going to hit one way or the other. So I think that hopefully, gives you a couple of benchmark to think about, I can't tell you exactly where we're going to be, certainly, as we discussed about Charter, we will be flying on-demand charter flights starting in March, we anticipate that the demand for non-scheduled service chart on-demand charter business model is extremely strong right now as well. I don't know that we're going to operate this significantly differently with a different circumstance pilots and what we do with SkyWest but there certainly is some different availability and some compelling reasons to do some things within a separate certificate and a separate seniority list just because it seems like these days specific with pilots, people want to get on a new seniority list and be an early participant in that. I think that we continue to have -- we continue to manage the fleet in a way that I think is going to be very good from a cost perspective, and I think, again, we just -- on the CRJ fleet we have a 30% gap we got to overcome, which is purely non capital investment very accretive block hours that we just have to start to get to the point where we can fly. We're just going to continue to be patient and deliberate about taking care of our people in a way in which we can get our utilization on our fleet back up and then be more strategic about what we can do with partners and additional aircraft or shifting some of that stuff around later, but we got a lot of -- we got a lot of runway left to get utilization -- accretive utilization back up before we get to that time. I think you mentioned by 2024, that you could add 30% block hour increase on the ERJ fleet without adding any additional shells and 40% on the CRJs, you only have a few airplanes coming over the next few years, is the right way to think about it that you're really not planning to take delivery of anything beyond what you have order for the next several years."
}