{
    "symbol": "APD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-04 11:25:17",
    "content": " I am proud to say that despite significant challenges including unprecedented energy cost increases and I mean unprecedented, especially in Europe, supply chain disruptions and the continued adverse effects caused by the pandemic, the talented committed and motivated people of Air Products continued to deliver excellent results, including earnings per share this quarter in the top half of our guidance range. The most recent increase is 8%, which increases our dividend to $1.62 per share per quarter, which we expect to – will translate to directly returning more than $1.4 billion to our shareholders in 2022. We continue to deliver strong underlying results but our margin declined in recent quarters, primarily driven by higher energy pass-through, which increases our sales but doesn't impact profit. EBITDA margin declined 570 basis points, mostly due to the higher energy pass-through which negatively impacted our margins about 450 basis points, while higher cost net of price increases contributed to the remaining shortfall. The very high and dynamic energy prices in our last -- in our largest three segments also impacted our supply chain, as we incurred higher operating and distribution costs to keep our customers supplied. About 700 basis points of the decline was due to the significant energy cost pass-through increase, while the remainder was mostly due to higher costs, partially offset by price in the merchant business. Compared to prior quarter, EBITDA was 19% lower due to unfavorable business mix, higher costs and lower equity affiliate income. EBITDA posted another double-digit gain, 14% ahead of last year as better volume, price and equity affiliate income more than offset the higher energy costs. Sales were higher in this quarter, driven by increased project activities but the profits were lower due to higher corporate costs and without last year's settlement of a supply contract. Our volume, price, and profits all grew this quarter versus last year even as they stayed the course and added resources to support our opportunities and world-scale projects for the cleaner energy future. That is where we are falling short in terms of ability to predict energy prices, but nobody could do that because they have been so unprecedented, that if at the beginning of last year you would have told somebody that electricity costs for Air Products will go from a few cents a 100 , to $0.20, we would have thought that was unreasonable."
}