{
    "symbol": "PLUS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-03 20:12:06",
    "content": " Net sales in the quarter grew by 15.7% year-over-year to $495 million, and year-to-date sales increased 12.6% to $1.37 billion. Our services revenue was up 20% for both the quarter and year-to-date reflecting not only increased project-based professional services, but a continuing increase in managed services annuity type bookings, which creates value added and sticking customer relationships, strengthening the ties we have with our customers, as well as driving more predictable future revenue and gross profit profiles. Along with revenue growth, our services business is generating higher gross margins, achieving 39.4% in the third quarter, and 39% year-to-date, which is a 120 basis point improvement. The continued solid performance of our financing segment underscores its value and has operating income of $8.9 million, increased nearly 39% year-over-year in the third quarter. Our business strategy and continued focus on our growth areas supported the technology segment, net sales increase of 14.8% to $477 million compared to $415.6 million in last year's third quarter. The adjusted gross billings and net sales adjustment was 30.4% compared to 29.3% in the last year's third quarter, as we had very strong growth in this quarter for sales of third party maintenance, staff, and subscription. For the financing segment's fiscal 2022, third quarter revenue increased 48.4% to $17.9 million, reflecting higher post contract sales from several early buy-outs of assets under lease. Fiscal year 2022, third-quarter consolidated gross profit amounted to $117.1 million up 19.3% from $98.2 million year-on-year. For the same reasons I just mentioned, consolidated net earnings of $26.4 million, or $0.98 per diluted share, represented increases of 22.1% and 21%, respectively, from $21.6 million, or $0.81 per diluted share, in the last year's third quarter. This, combined with the operating leverage inherent in our business model, led to an increase in year-to-date net earnings and earnings per share of 38.3% and 37.7%, respectively, to $81.4 million or $3.03 per diluted share. This lower level was due to share repurchases totaling $9.5 million, an increased working capital needs to support strong demands for our products and services in the technology segment, particularly as it related to inventory, which more than doubled to $147.7 million when compared to the end of fiscal 2021."
}