{
    "symbol": "PLUS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-25 19:53:10",
    "content": " Fourth quarter net sales increased 28% to $451.5 million with solid contributions from both segments, reflecting broad-based strength across our customer base and end markets. The growth in fourth quarter adjusted gross billings helped drive our fiscal 2022 adjusted gross billings to over $2.6 billion, representing approximately 16% growth from fiscal 2021. In the fourth quarter, consolidated net sales totaled $451.5 million, up 28.1% from $352.6 million reported in the comparable quarter of fiscal 2021. Our financing segment also delivered robust revenue growth, up 54.4% to $32.1 million compared to $20.8 million in the last year's fourth quarter, mainly as a result of higher proceeds from sales of off-lease equipment. Consolidated SG&A was up 10.7% to $77 million, while consolidated operating expense increased 8.9% to $80.9 million given higher variable compensation as a result of our strong gross profit growth. Consolidated net earnings of $24.2 million or $0.91 per diluted share increased 55.9% and 56.9%, respectively, from $15.6 million or $0.58 per diluted share in last year's fourth quarter. To sum up our strong performance in fiscal 2022, consolidated net sales of $1.82 billion reflected a 16.1% year-over-year increase. Technology segment net sales grew 14.9% to $1.73 billion, and our financing segment net sales increased 45.7% to $88 million as a result of higher proceeds from leased equipment sales. Gross profit in the technology segment increased 17.9% to $408.2 million, and gross profit in the financing segment was up 11.6% to $52.8 million, partly due to the outsized transactions we previously called out in our second quarter. Positive operating leverage helped drive strong earnings growth as we saw net earnings of $105.6 million or $3.93 per diluted share, representing an increase of 41.9% for both metrics. As we continue to expand our business, our strong balance sheet supports our growth initiatives as cash and cash equivalents at the end of fiscal 2022 were $155.4 million, up 19.9% compared to $129.6 million."
}