{
    "symbol": "PLUS",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-09 20:57:02",
    "content": " Consolidated net sales increased 5.8% from last year second quarter to $458 million, with broad based growth in products, services and financing. As a result, second quarter operating income rose more than 55% year-over-year, while earnings climbed more than 58% from the prior quarter to $2.34 per diluted share. Looking more closely at our second quarter performance, technology net sales increased 4% from the same period last year, driven by growth in both products and services with services increasing a robust 23.1% on a year-over-year basis. Another bright spot for ePlus in the second quarter was the continued growth of our higher margin annuity quality revenue, which grew solidly in the second quarter both on a sequential basis and compared to the same period last year, driven by rising demand. As a result, financing segment net sales increased approximately 58% year-over-year to $21.7 million and segment adjusted EBITDA increased nearly 94% year-over-year to $14.1 million. Our consolidated net sales for the second quarter were $458 million, a 5.8% increase from the $433.1 million reported in last year second quarter. In our technology segment, net sales increased 4% to $436.3 million compared to $419.4 million in the last year second quarter. Technology segment gross profit increased 20.5% to $105.1 million and gross margin increased 330 basis points to 24.1%, mainly due to higher product margins and increased sales of third party maintenance and software subscriptions recognized on a net basis. Our consolidated net earnings of $31.4 million or $2.34 per diluted share increased to 58.3% and 58.1% respectively, from $19.8 million, or $1.48 per diluted share last year second quarter. Looking at our customer end markets in the technology segment on a trailing 12 month basis, Telecom media and entertainment continues to be our largest end market accounting for 28% of net sales, followed by SLED, healthcare, technology and financial services, which represented 15%, 15%, 14% and 11%, respectively. Moving to the balance sheet; we ended the quarter with $57 million in cash and cash equivalents compared to $129.6 million at the end of March reflecting increased working capital needs in the technology segment, as well as share repurchases."
}