{
    "symbol": "FTEK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 14:12:02",
    "content": " Before turning things over to Vince, I'd like to remind everyone that matters discussed on this call, except for historical information, are forward-looking statements as defined in Section 21-E of the Securities Act of 1934, as amended, which are made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995 and reflect Fuel Tech's current expectations regarding future growth results of operations, cash flows, performance, and business prospects, and opportunities, as well as assumptions made by and information currently available to our company's management. These statements are based on information currently available to Fuel Tech and are subject to various risks, uncertainties, and other factors including, but not limited to, those discussed in Fuel Tech's annual report on Form 10-K in Item 1A under the caption risk factors and subsequent filings under the Securities Exchange Act of 1934, as amended, which could cause Fuel Tech's actual growth, results of operations, financial condition, cash flows, performance, and business prospects, and opportunities to differ materially from those expressed in or implied by these statements. Full year 2022 revenue was 26.9 million, our highest consolidated revenue since 2019, increased 11% from full year 2021 and was driven by an operational rebound in our Air Pollution Control business segment, where revenues improved by 54% from full year 2021. For the fourth quarter of 2022, total revenues rose 8.8% to 7 million due to improved performance at our FUEL CHEM segment. For the APC segment, revenue for the fourth quarter of 2022 fell modestly to $2.9 million compared to $3.1 million in the fourth quarter of last year, due to the timing of project execution. APC's full year revenue was $10.6 million, a significant improvement from full year 2021 revenue of $6.9 million driven by project execution on approximately 10 million in new project awards announced throughout 2022. This decline can be attributed to the contribution from the APC segment gross margin, which declined to 35.4% of revenue from 55.6% of revenue in last year's fourth quarter due to a shift in product and technology mix. Our operating loss was essentially unchanged at $250,000 compared to 2021 in last year's fourth quarter, reflecting a shift in margin contribution from product mix despite increased revenues and lower operating expenses. For the full year 2022, consolidated revenue rose to 26.9 million from 24.3 million in 2021, reflecting a 54% increase in APC revenues, offset by a 6% decline in FUEL CHEM."
}