{
    "symbol": "HTOO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-08 15:50:05",
    "content": " If you believe that the future of green hydrogen is bright, and believe our HEVO-Solar solution offers unique advantages, then there's every reason to believe as I do, and mind you I have never sold a share of Fusion, that we will be successful in building a company that is valued highly in the marketplace. As I've said before, at its core Fusion Fuel is a technology company we have developed and commercialized a proprietary integrated solar to hydrogen generator that unlocks grid independent green hydrogen production at a market leading levelized cost. As pioneers in green hydrogen, Fusion Fuel notice the problem in the market with our customers and our providing a solution to let our customers grow with us and ease into the hydrogen ecosystem while offering the lowest possible levelized cost of hydrogen in the market, especially when you include avoided distribution costs. Portugal, as I noted, is a strategic market for Fusion Fuel, and in order to make hydrogen a reality in 2023, we are focused to develop our own pipeline of projects to build out the hydrogen refueling infrastructure in Portugal. Today, we have secured $40 million grants for projects in Sines are awaiting award of additional grants to help us achieve our target of 10,000 tons per year of green hydrogen production in the region. So we've been in conversations with potential strategic partners, whether they're technology providers, we've mentioned conversations with Toshiba, which are ongoing, with companies that might be interested in our HEVO-Solar solution, and deploying it in their businesses, or partners who are interested in our project pipeline and might be interested in co-investing with us or purchasing projects for infrastructure funds. And I think really, for us, we're seeing a lot of momentum recently, as we've just got our story out there more and are really pushing this really show people they can come to Evora, giving them a Black & Veatch study, showing them the two study and really be able to explain that we're, our technology has reaching a certain level of commercialization that can be competitive, even without ramps, and we are starting to see, as I noted, other opportunities in Italy, Spain, Portugal, in North America."
}