{
    "symbol": "CRON",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 12:16:05",
    "content": " Turning to 2022 on a consolidated basis, we increased revenue 23% year-over-year to $91.9 million, with strong performance in the Rest of the World segment, highlighted by Israel and Canada. The revenue change was primarily driven by a decline in the adult-use Canadian market, driven by lower cannabis flower sales, largely attributable to an adverse price mix shift, a decline in revenue in the US segment driven by the strategic repositioning of that business, and the impact of the weakened Canadian dollar against the US Dollar during the period, partially offset by growth in cannabis flower sales in the Israeli medical market. Consolidated gross profit in the fourth quarter was negative $0.2 million, representing a $2.2 million decline versus the prior year period. Consolidated adjusted EBITDA in the fourth quarter was negative $21.2 million, representing a $6.1 million improvement versus the prior year period. Turning to our reporting segments, in the Rest of the World segment, we reported net revenue in the fourth quarter of $22 million, a 3% decline from the prior year period. Adjusted EBITDA in the Rest of the World segment for the fourth quarter was negative $13.4 million, representing a $1.2 million improvement from the prior year period. Gross profit in the US segment for the fourth quarter was negative $1.5 million, representing a $1 million decline from the prior year period. Adjusted EBITDA in the US segment for the fourth quarter was negative $4.3 million, representing a $4 million improvement from the prior year period. Our free cash flow improved by approximately 43% in â\u0080\u009822 versus prior year, driven by operating expenses, savings and an approximate 60% reduction in CapEx, which was down to $5 million in â\u0080\u009822. Our Canadian business reached $56 million in revenue in â\u0080\u009822, and within that business, our Spinach brand has the following market share range provided by Hifyre data for January of â\u0080\u009823. We have an approximately 10% stake in Vitura, a leading publicly traded Australian medical cannabis provider worth approximately $22 million as of yearend, we own 50% of the equity in Cronosâ\u0080\u0099 GrowCo which is profitable, and they paid us $5.2 million in principal and interest payments in â\u0080\u009822."
}