{
    "symbol": "CRON",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 13:39:02",
    "content": " Revenue growth year-over-year was primarily driven by growth in Israel, which was up 263% year-over-year, largely attributable to the cannabis flower category in growth in Canada, which was up 79% year-over-year, led by our cannabis extracts category, which we see to boost through the introduction of our gummies platform, which did not exist in the prior year, as well as an introduction of a one-gram date which provides great value to the consumer. Turning to the US segment, we reported net revenue in the first quarter of 2022 of $2.3 million, which represents a 5% decrease from the first quarter of 2021, the decrease year-over-year was primarily driven by a reduction in volumes as a result of a decrease in promotional spend as the company works through its review of the US business as part of the strategic realignment. Your line is now open. Your line is now open. So we're very optimistic about the future in Israel and we don't see things as lumpy and we think that there is additional opportunities as the market continues to grow, both from the products we already have on market and being able to launch more products in the market, but we think there is a great opportunity, especially because of the fact that we aren't competing within illicit market, the same way that we compete within the illicit market in North America. Your line is now open. So Mike pointed out a little bit of the seasonality between Q4 and Q1 in Canada in particular, but what we've seen particularly as Mike pointed out with market share gains are extremely encouraging and the fact that the business was up what it was in the quarter, is encouraging to couple that with the margin improvement, we feel like we're really moving this business in the right direction in line with the strategy that has been pretty consistent. Your line is now open. So we do still have a presence in Germany and when we look at opportunities that are going to open up, I don't want to say it's necessarily opportunity to enter adult use in the next 12 months, but we do know that there is legislation starting to new, and so we want to make sure that anywhere we go into, for the amount of cost and time it takes, it's something that's really exciting and we can ultimately start getting the results that we're getting in Israel. Your line is now open."
}