{
    "symbol": "DRH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 14:09:11",
    "content": " While this is a powerful trend year-to-date BTU revenues are still nearly $20 million behind 2019 that tells you that there's a lot of upside to capture in 2023, as more employers get their folks back on the road. Hotel adjusted EBITDA margins at our urban hotels increased by nearly 2,900 basis points from the first quarter to 35.9% and we still have upside to reach 2019 levels. To describe the upside opportunity at the urban hotels another way, for the full-year 2022, we project to be below 2019 total revenues by around $80 million and about $45 million in hotel adjusted EBITDA. These three properties are forecasted to deliver over $15 million of incremental EBITDA for the full-year 2022 over 2019, which means they're tracking to collectively generate a 13% cash-on-cash yield at 2022 on our total investment in the hotels. As Mark mentioned, our full-year 2022 outlook for group room revenue increased $22 million since the end of the first quarter and over 85% of these incremental revenues were booked into Q3 and Q4, which are now on par with 2019 group room revenues. In fact, we have increased our expectation from our last earnings call and now project comparable total hotel revenues to exceed 2019 levels of $936 million for the full-year of 2022 and for comparable hotel adjusted EBITDA to exceed 2019 levels of $278 million for this calendar year with the potential for a new high watermark for profit margins. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I mean, we have a portfolio of 34 hotels, so I'm not sure it's a read-through for the entire industry, but we saw incredible demand, leisure demand in our urban markets kind of the extended three-day weekend in markets like Chicago was terrific in both June and we're seeing in July and even kicking off August. Your line is open. Your line is open. Your line is open. But it doesn't mean it necessarily fits with our long-term strategy, but it's an asset that we think will be very successful, but we'll think about as we kind of monetize assets, I do think markets like San Diego, Miami, Austin, those kind of markets that are seven to eight week markets and have a lot of characteristics where they can have leisure and probably will be more beneficiaries of the BT leisure trends."
}