{
    "symbol": "EFOI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 16:05:21",
    "content": " Net sales of $2.1 million for the first quarter of 2022, decreased 21.8% compared to sales of $2.6 million in the first quarter of 2021 mainly due to delayed funding related to projects, including our products. When compared to $2.4 million in the fourth quarter of 2021, net sales were down sequentially due to a decrease in military product sales. Sales of our commercial products, were $1.1 million or 55% of total net sales for the first quarter of 2022, up $221,000 as compared to the first quarter of 2021. The year-over-year decline in gross margin was primarily driven by less leverage of our fixed costs due to lower sales levels, sales product mix, primarily the margin impact from decreased military and maritime market product sales, and the impact of higher freight costs. Adjusting gross profit margins for excess and obsolete in-transit and net realizable value inventory reserve resulted in a non-GAAP adjusted gross margins of positive 5% for the first quarter of 2022, compared to 24.3% in the first quarter of 2021. Based on our levels of fixed costs if we can again obtain quarterly sales levels greater than $3.5 million to $4 million, we continue to expect our overall gross margins to be initially in the mid-20s. Operating expenses in the first quarter of 2022 were $2.6 million, compared to $2.9 million in the first quarter of 2021. Loss from operations for the first quarter of 2022 was $2.7 million, up compared to an operating loss of $2.3 million in the first quarter of 2021. Net loss was $2.8 million or a negative $0.44 per share of common stock for the first quarter of 2022, compared with a net loss of $1.6 million or negative $0.45 per share of common stock in the first quarter of 2021. Adjusted EBITDA, a non-GAAP measure, which excludes depreciation and amortization, interest expense, stock-based and other non-recurring charges and/or sources of income, such as incentive compensation and the gain on forgiveness of PPP loans in prior periods was a loss of $2.6 million for the first quarter of 2022, compared with a loss of $2 million in the first quarter of 2021."
}