{
    "symbol": "GMS",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-01 10:53:05",
    "content": " Organically, first quarter wallboard sales grew 31.6% year-over-year, comprised of a 25% increase in price and mix and a 6.6% increase in volume. Multi-family volume gains of nearly 30% outpaced mid-single digit single family volume growth, and we were very pleased to see for the first time since before the pandemic began, commercial volumes in wallboard grew for the quarter both sequentially and year-over-year on improving commercial activity levels. Ceiling tile and grid first quarter sales of $167.3 million increased 21.2% over the same period last year, comprised of an 18.1% benefit from price and mix and a 3.1% increase in volume. First quarter steel framing sales of $274.9 million increased 40.1%, comprised of a 47.3% benefit from price and mix partially offset by a 7.2% decline in volumes. Complementary products sales of $395.8 million, which comprised 29% of our total sales for the quarter, were up 24.6% year-over-year as we benefited from positive contributions from acquisitions as well as strong pricing across the category. Now turning to our gross profit during the first quarter, our gross profit of $434.7 million increased 29.4% as compared with a year ago, principally due to our successful pass-through of product inflation, continued strength in residential market demand, and incremental gross profit from acquisitions. Delivery expenses and incentive compensation were generally higher, driven by our robust level of activity and strong results this quarter; however, as has been the case, product price inflation and the resultant increases in both revenues and gross profit dollars have outpaced these pressures, therefore adjusted SG&A as a percentage of net sales for the first quarter improved 100 basis points as compared with a year ago to 19.2%. With that as a backdrop, letâ\u0080\u0099s turn to our near term outlook on Slide 9.For our fiscal second quarter, we expect total net sales growth of roughly 20%, most of which will be organic, our gross margin percentage to be generally consistent with that of Q1, and adjusted EBITDA margin of plus or minus 12.5%. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Clearly from the standpoint of valuation, as you think about earnings of these companies relative to valuations in the marketplace, valuation discussions, weâ\u0080\u0099re have to be a little bit more creative as we think through some of those types of things, but the pipeline is full and active, so we would fully expect to, from a capital allocation standpoint, as we said in some of the prepared remarks, strategically our prime consideration is towards continuing to be a consolidator in the space, and weâ\u0080\u0099ll be doing some other allocations to organic activities, organic growth, the capex we talked about in roughly the $40 million range this year - thatâ\u0080\u0099s a pretty good number going forward as well, and then weâ\u0080\u0099re doing our share repurchase activity to take advantage of some of the opportunistic valuation that we see in our own share price. Please proceed with your questions."
}