{
    "symbol": "GMS",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-02 14:25:33",
    "content": " Strong multifamily residential demand, year-over-year growth in commercial Wallboard volumes and continuing momentum in the sales of complementary products, helped to offset a difficult prior year comparison in Steel Framing as well as regional volume declines in the single-family market this quarter. Our teams continue to do an excellent job addressing the demands of each of our customer categories, with U.S. volumes and multifamily Wallboard continuing to stay strong, up nearly 20% and with commercial Wallboard volumes up 5.6%, sustaining the positive year-over-year growth in commercial Wallboard volume that began early this fiscal year. Comprising nearly 30% of our net sales, we continue to benefit from both higher prices and volumes during the quarter, growing our complementary product sales by 11.7% in total and 8.2% organically. Organically, third quarter Wallboard sales grew 21.2% year-over-year, also comprised almost entirely of price and mix benefits. Third quarter Steel Framing sales of $234.5 million decreased 17.1% versus the prior year quarter, with price and mix down 13% and volumes down 4.1%. Our gross profit of $402.2 million increased 9.4% as compared with a year ago, principally due to continued successful pass-through of product inflation, improved commercial Wallboard sales, growth in complementary products and incremental gross profit from acquisitions. Gross margin of 32.6% increased 70 basis points year-over-year with strong margins in complementary products and better-than-expected margins in Steel Framing, as our teams remain focused on inventory management and diligent project quoting as well as execution on negotiated year-end volume incentives. In addition to the end market mix shift in volumes between single-family and commercial demand, operating expenses during the quarter were also negatively impacted by wage inflation, higher fuel and maintenance costs and unfavorable weather conditions, which impacted our normal operational efficiency for both labor and equipment as we continue to honor our commitment to provide best-in-class service to our customers. Given their longer build times, we expect multifamily to continue to outpace our other end markets with more than 20% year-over-year volume growth in our fiscal fourth quarter, with continuing positive trends through at least mid-calendar year 2023. While we can't fully predict the degree or timing of market price elasticity going forward, for planning purposes, we are currently projecting year-over-year mid- to high teen inflation in Wallboard pricing, flattish prices in ceilings and slight inflation in complementary products for our fiscal fourth quarter. In Steel Framing, while noting the underlying raw material pricing appears to have bottomed and many suppliers have initiated price increases, our current expectation is for our steel prices to continue to decline each month sequentially in the low to mid-single-digit range for a net year-over-year decline of 20% to 25% for the fourth quarter. With outsized declines expected in steel, offset by growth in the balance of our other major product categories, we currently expect total net sales for our fiscal fourth quarter to be flat to down low single digits as compared with the prior year period. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}