{
    "symbol": "GMS",
    "quarter": 2,
    "year": 2023,
    "date": "2022-12-08 12:03:04",
    "content": " With elevated single family home construction activity, as completions eclipsed starts for the quarter, along with strong multifamily residential demand, year-over-year growth in commercial and a favorable pricing environment, we again delivered record levels of net sales, net income, and adjusted EBITDA for our fiscal second quarter as we continued the solid execution of our strategic priorities. For the quarter ended October, the average realized Wallboard price was $474 per thousand square feet, up 8.4% sequentially and 26.3% as compared with a year ago. Ceilings, tile and grid second quarter sales of $159.6 million, increased 13.3% over the same period last year, or 11.6% on a per day basis, comprised of a 9.6% benefit from price and mix and a 2% increase in volume. Second quarter, steel framing sales of $278.2 million increased 2.3% versus the prior year quarter or less than 1% on a per day basis, where price and mix benefited 7.5% was largely offset by a 6.8% decline in volume. Overall, however, given the tremendous rise in steel framing prices earlier in the year, the quarterly average price for steel framing products for our fiscal second quarter was up nearly 9% as compared with a year ago. Complimentary Products sales of $408.7 million, which comprised nearly 30% of our total net sales for the quarter, were up 26.5% year-over-year as we've benefited from positive contributions from acquisitions as well as improved pricing across the category. Now turning to our gross profit during the second quarter, our gross profit of $464.5 million increased 24.9% as compared with a year ago, principally due to our successful pass through of product inflation, continued strength in residential market demand, improved commercial sales and incremental gross profit from acquisitions. Gross margin of 32.5% increased to 20 basis points year-over-year with strong margins in Complimentary Products and better than expected margins, which were up slightly year-over-year in steel framing as our teams remained focused on inventory management and diligent project quoting amid the environment of declining steel prices throughout the quarter. As we have previously shared, while we managed the business toward towards an EBITDA level of profitability to account for mix and cost of execution, we traditionally operate at or around 32% gross margin and believe this to be a reasonable near-term expectation as well, even as we see a slowdown in single family demand ahead. Therefore, adjusted SG&A as a percentage of net sales for the second quarter improved 50 basis points as compared with a year ago to 18.9%. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}