{
    "symbol": "VERU",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-09 14:37:06",
    "content": " We reported positive results from the Phase III COVID-19 clinical trial, which is a double-blind, multicenter, multinational randomized placebo controlled study evaluating daily oral 9 milligram dose of sabizabulin for up to 21 days versus placebo in 204 hospitalized moderate-to-severe COVID-19 patients who had high risk for ARDS and death. As HHS governs the FDA, the FDA to avoid confusion also announced on January 31, 2023 that the May 11 termination would not impact FDA's ability to authorize new treatments for emergency use that existing EUAs would remain in effect and that it may continue to issue new EUAs on criteria to issuance or MET. Similarly, as sabizabulin is authorised and commercialize, we also plan to conduct a Phase 3 clinical studies of sabizabulin for the treatment of hospitalized adult patients with viral ARDS, which would include Respiratory Syncytial Virus, which alone causes 14,000 deaths and 177 hospitalizations each year in the US. The increase in research and development costs is due to the increased costs associated with the multiple in process, research and development projects, mainly for the Phase 3 Sabizabulin COVID-19 registration trial and manufacturing costs of $8 million for pre launch inventory, and increased personnel costs resulting from increased headcount and an increase in the fair value share based compensation. The increase in selling, general, and administrative expenses is primarily due to commercialization costs of $8.4 million, related to preparations for the potential launch of Sabizabulin for COVID-19 incurred in the first quarter of fiscal 2023, and an increase in share based compensation costs resulting from increased headcount and an increase in the fair value of share based compensation. The expected future revenues from Sabizabulin for COVID-19, if authorized, and the continued revenue from the sales of FC2 in the US prescription channel and the global public sector added to our current cash balance, should continue to be the primary sources of funds we use for commercial activities and to invest in our promising pharmaceutical clinical development programs, as we continue to focus on developing novel medicines for COVID-19 and other viral and ARDS related diseases and for the management of breast and prostate cancers. In a Phase 3 study, sabizabulin demonstrated clear clinical benefit in hospitalized moderate-to-severe COVID-19 patients high-risk for ARDS and death and because of sabizabulinâ\u0080\u0099s mechanism of action, it has the potential to treat other virally induced ARDS. As I mentioned, we're seeing improvements in FC2 revenues in our second quarter fiscal year 2023 and ENTADFI may also generate revenue and authorized we expect to also have substantial near-term revenue from sabizabulin 9 milligrams for hospitalized COVID-19 patients and high-risk ARDS."
}