{
    "symbol": "BHLB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 16:05:25",
    "content": " Expenses were up 3% quarter-over-quarter and 6% year-over-year and as Nitin, mentioned we had positive operating leverage on both a year-over-year and quarter-over-quarter basis and our efficiency ratio for the quarter was about 58%. This resulted in fee -- other fee revenues being down due to $2.4 million of tax credit amortization, this is a contra revenue item related to our tax credit business and is more than offset by the benefit received in our tax credit expense, which lowered our tax rate this quarter to about 14%. As Nitin mentioned, we had $11.7 million of net charge-offs this quarter, largely driven by one middle market loan to a corrugated box manufacturer that was impacted by customer receivable defaults and filed for bankruptcy in the fourth quarter. Including the prior quarter charge-off, we've charged-off about 60% of this credit and the remaining exposure of about $7 million is collateralized. Delinquencies and non-performing loans at 60 basis points of loans are at a 10 year low, while we are monitoring credit closely we are not seeing any broad-based portfolio credit deterioration and are encouraged to that our accruing delinquent loans or early stage delinquencies are down 8% versus the third quarter and 55% on a year-over-year basis. Our TCE ratio ended the quarter at 8% and included a cumulative OCI bond mark of $176 million on an after-tax basis, an improvement to the third quarter, given a modestly lower rate environment. As Nitin mentioned, we grew our cash dividends by 50% in the fourth quarter to $0.18 per share per quarter and announced a new $50 million stock repurchase authorization. We are targeting $7 million to $9 million of credit provision expense per quarter, which is largely a function of our expected loan growth. Billy, please go ahead. Your line is open. Your line is open. Your line is open. Yes, we can now. Billy, please go ahead. Your line is open. Yes, we can now."
}