{
    "symbol": "YALA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 01:35:05",
    "content": " 1 MENA-based online social networking and gaming company, we are uniquely positioned to capitalize on MENAâ\u0080\u0099s strong digitalization trend over the next five years, unleashing massive growth potential across Yalla Groupâ\u0080\u0099s businesses. We are pleased to have concluded fiscal year 2022 on a high note, with fourth quarter total revenue of US$75.1 million landing at the high end of the company's guidance. For the first quarter, our revenues increased solidly by 11.2% year-over-year, to US$75.1 million amid external challenges. Our revenues were US$75.1 million in the fourth quarter of 2022, an 11.2% increase from US$67.6 million in same period last year. Our cost of revenues was US$27.4 million in the first quarter of 2022, a 14.7% increase from US$23.9 million in same period last year, primarily due to an increase in technical service fees resulting from the expansion of our product portfolio, as well as an increase in salaries and benefits resulting from the expansion of our operation and maintenance team. Our selling and marketing expenses were US$14.3 million in the fourth quarter of 2022, a 7% increase from US$13.3 million in the same period last year, primarily due to higher advertising and marketing promotion expenses led by our continued user acquisition efforts and expanding product portfolio. Our general and administrative expenses were US$13 million in the fourth quarter of 2022, a 60.4% increase from US$8.1 million in the same period last year, primarily due to an increase in incentive compensation. Our technology and product expenses were US$5.4 million in the fourth quarter of 2022, a 37.3% increase from US$3.9 million in the same period last year. As such, our operating income was US$15 million in the fourth quarter of 2022 compared with US$18.3 million in the same period last year, excluding share-based compensation, non-GAAP operating income in the fourth quarter of 2022 was US$20.2 million. Moving to the bottom line, our net income was US$16.6 million in the fourth quarter of 2022 compared with US$19.1 million in the same period last year, excluding share-based compensation expenses, non-GAAP net income for the fourth quarter of 2022 was US$21.7 million."
}