{
    "symbol": "INT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 23:12:20",
    "content": " A 30% year-over-year increase in average fuel prices and a 10% increase in overall volume drove consolidated revenue to $15.7 billion in the third quarter, up 88% year-over-year, bringing our year-to-date revenue through the third quarter to $45 billion. Consolidated gross profit for the third quarter was $322 million, thatâ\u0080\u0099s an increase of 63% year-over-year. Notwithstanding this normal seasonal decline, full year volume should still be up approximately 20% year-over-year, and considering the significant impact of backwardation in the second quarter, reasonably strong operating results for the full year as well. And lastly, our land segment delivered gross profit of $118 million in the third quarter, thatâ\u0080\u0099s up 88% year-over-year, principally as a result of the Flyers acquisition, as well as improved year-over-year results across the land platform, including World Connect. This represents a significant year-over-year increase principally related to increase cash and equity based incentive compensation related in part to the record level of quarterly gross profit delivered in the third quarter compared to the third quarter of 2021, when variable compensation was down significantly driven by the ongoing impacts of the pandemic last year. Despite the operating expense increase, considering the very strong gross profit contribution this year, our operating margin as a percentage of gross profit actually increased significantly both sequentially, and year-over-year in the third quarter, to the highest level we have seen since the pandemic began. Adjusted EBITDA, as I mentioned earlier, was a record $123 million in the third quarter, representing an increase of 92% year-over-year. We generated $259 million of operating cash flow in the third quarter, driven principally by lower fuel prices, which declined approximately 15% from the second quarter, and record adjusted EBITDA generated during the quarter. Mr. Kasbar, there are no further questions at this time. If we agree that we donâ\u0080\u0099t expect that to happen again, thereâ\u0080\u0099s significant upside for aviation next year, even if it was a low growth environment, depending upon whatâ\u0080\u0099s going on in the economy, just because weâ\u0080\u0099re not expecting to take $50 million process, again, in the second quarter of next year or any quarter of next year. Mr. Kasbar, there are no further questions at this time."
}