{
    "symbol": "INT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 20:50:06",
    "content": " And lastly, our land business performed well in the first quarter, we experienced seasonably strong results in our UK heating oil business and solid contributions from our natural gas and power activities, which serve to further augment the immediate benefits from the addition of the Flyers Energy operations four our overall land business. Furthermore, before getting to the numbers, as Michael already mentioned, this was a quarter which clearly demonstrates the value of our diversified business model, with aviation negatively impacted by unprecedented market pricing dynamics, while marine significantly benefited from the sustained high price environment and land delivered strong results with fliers now on board. Adjusted EBITDA for the first quarter was $75 million, that's an increase in $14 million, or 23%, compared to the first quarter of last year. Our land segment delivered record gross profit of $120 million in the first quarter, up significantly both sequentially and year-over-year, principally as a result of the recent Flyers acquisition, which performs very well in its first quarter since we close the transaction in early January. And while our natural gas activity was down from last year's record performance, which benefited from extreme weather conditions in last year's first quarter, performance was still solid, and our power business delivered strong year-over-year growth as well. During the first quarter, operating cash flow was negative $72 million, which principally relates to a 50% increase in average fuel prices from December to March, driving a 50% or $1.15 billion increase in accounts receivable in the first quarter. So that's why in this environment, you've seen the greatest positive impact in marine, but there are parts of land as well as an example where we also saw improvement in results, we saw that in Flyers in our first quarter that they outperformed our expectations driven in part by that phenomena, and even our land UK business."
}