{
    "symbol": "TTSH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 07:06:04",
    "content": "  Operator: Good day, and welcome to the Second Quarter 2022 Tile Shop Holdings, Inc. Earnings Conference Call. After today's presentation, there will be an opportunity to ask questions. I would now like to turn the conference over to Mark Davis, Vice President of Investor Relations and Chief Accounting Officer. Good morning to everyone, and welcome to the Tile Shop's second quarter earnings call. Joining me today are Cabby Lolmaugh, our Chief Executive Officer; and Karla Lunan, our Chief Financial Officer. The forward-looking statements made today are as of the date of this call, and we do not undertake any obligation to update these forward-looking statements. Please see our earnings release for a reconciliation of those non-GAAP financial measures, which has also been posted to our Company website. Good morning, everyone, and thank you for joining us today for an update on our business and a review of our second quarter financial results. We had a good quarter, highlighted by another double-digit increase in comps and sales in excess of $100 million. We've made great progress building relationships with our pros, and we have a number of exciting initiatives underway. Despite this strong performance, we see signs that the macro tailwinds we've enjoyed over the last several quarters are starting to change. Industry analysts cite rising interest rates, slowing existing home sales and shifts in consumer spending patterns as possible reasons why we may see a slowdown in home improvement spending during the second half of 2022. With that high-level overview in mind, I'd like to provide an update on our 2022 strategic objectives, surrounding our employees, execution in our stores and our supply chain. The skills we've cultivated across our organization are in high demand, especially given the current labor shortages and it remains challenging to attract new talent in the current environment. To stay ahead of this, we have been focused on initiatives, designed to invest in our people, enhance our culture and foster employee engagement. Over the past year, we have refined our training, developed career paths and increased opportunities for interaction between leaders and their teams. During the third quarter, we are looking forward to holding our national sales meeting with all of our store managers, pro market managers and leadership. So I think this will be an extra special event as we build relationships, reinforce best practices, celebrate milestones and build excitement surrounding our vision for the future. Second, our in-store execution continues to improve. I am pleased with the results I've seen on a variety of different metrics, such as conversion, back-shelf attachment rates and average ticket. Lastly, we have made nice progress on our supply chain initiatives over the last six months. Our in-stock levels are back to normal, and we feel good about the level of inventory we are carrying to meet customer demands. While product availability has recently not been an issue for us, our suppliers are continuing to pass along price increases in response to inflationary cost pressures. In response to these pressures, we have pulled forward certain purchases before price increases were implemented. We are also continuing to evaluate alternative sources of supply, where we are able to source high-quality products at lower prices. In short, we had a nice quarter and are positioned to stay focused on our strategy and what we can control. This improvement was largely due to an increase in average ticket, driven by our pricing actions and partially offset by a modest decrease in unit volumes. The gross margin rate during the second quarter was 66%, which was down 310 basis points from last year's second quarter, but up 80 basis points sequentially from the first quarter. Given the decrease in unit volumes during the second quarter, and the softening demand trend that Cab spoke about earlier, we plan to take a more conservative approach to future pricing actions. However, we are not planning to raise prices to the levels required to maintain our current gross margin rates. As a result, we expect to see continued pressure on gross margin rates during the second half of 2022. Pay and benefits expenses, excluding bonus expense, increased by $4 million due to an increase in staffing levels, sales commissions and benefit costs. Additionally, our store occupancy costs increased by $1 million due to an increase in common area maintenance expenses, normal store repair costs and utility billings. We also spent an additional $700,000 in marketing and $400,000 on travel during the quarter. Additionally, depreciation expense decreased by $700,000. Our adjusted EBITDA margin rate fell 40 basis points to 15.6%, largely due to the year-over-year decrease in gross margin that was partially offset by lower bonus expenses. As of the end of the quarter, our inventory balance was $110 million. As of the end of the quarter, we had $10.5 million of cash and our bank debt remained at $5 million. In closing, we are pleased with the second quarter results and are staying proactive against a dynamic macro environment. With consumer spending, we're still seeing a pretty solid ticket average. What we are noticing though is the traffic is slowing a little bit here and there, knowing that it's â\u0080\u0093 it's seasonality along with, I think, the macro environment. So we expect to see our traffic slowed during the summer months, but we're seeing a little bit more in areas that are getting us to believe it's impacting our customer. Typically, we're a few points better than existing home sales, new home sales. So when you see it being depressed, that tells us what we're in for. We're very happy with our results in Q2, and we have a significant order bank going into Q3, but we're seeing it starting to slow. And we just tightened our belts and grind through it, and people are still going to remodel. We have a lot of customers that are â\u0080\u0093 they can't get into a new house, they're going to remodel their existing. With capital allocation, we're talking about it every day. But there's other things with investments in the business that we're looking at currently, Connor. I'm assuming that's a function of direct COGS such as natural gas, which I know still remains elevated. Labor probably, you're seeing continued pressures, but the one bright spot that we're tracking is transportation and container costs have come down meaningfully. We're excited that seeing these costs go down, we do have a WACC model, meaning where we order products six months before it hits our floor and our DCs. We say with our orders we're placing now, yes, the pricing will come down. We are looking at resourcing, actively resourcing, looking at different areas of the world where they're not as challenged with things like natural gas or high container costs. We're excited, but we have to grind away with what we got right now. And then last quarter, you guys touched on a new product that you're going to start carrying luxury vinyl tile. And we did some checks and we see, for example, LL, Lumber Liquidators, is being impacted by F&D taking â\u0080\u0093 doing very well in that space. We added a few more, and we're pretty excited with those results. It's a little ways out, but we're getting everything ready on our end to carry more to make mega splash in that arena. So we're selling a lot of our tile for bathrooms, kitchens, fireplaces, mud rooms, but LVT gives you an opportunity to go in areas where typically you would never even find tile, bedrooms and laundry rooms, things like that. So we're pretty excited about it, but more to come. It seems like we have an opportunity to â\u0080\u0093 even though this year with traffic slowing down a little bit, even though what you omitted from your commentary is that interest rates actually have dropped almost 0.75 points from where they were a month ago and maybe going back the other way again. But one of the things â\u0080\u0093 opportunities that we have, even if revenue were to flattened or EBITDA were to flattened is to substantially grow our earnings through share repurchases like very large share repurchases similar to what Gary Friedman did at Restoration Hardware, which has been one of the best performing stocks over the last decade in the world. I just want to acknowledge that, yes, our credit agreement does provide for the ability to repurchase shares as long as our leverage ratio stays below a certain point. And to that end, in terms of the broader idea that you're raising, we have a good history here of really considering various options in front of us and trying to make the right decision for the company and shareholders, and we'll continue to do so. Guys, best of luck in the second half of the year and beyond."
}