{
    "symbol": "FLT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 22:18:05",
    "content": " We've talked previously about building capabilities to serve our fleet use case and protect the customers we have and the revenue we have, we've now identified a couple of new customer segments that we can repurpose we think our EV assets like our network to and generate incremental revenue beyond the fleet business. Operating expenses of $472 million represented a 38% increase over prior year, primarily due to the addition of the AFEX and ALE operations, increases tied to higher volumes across our businesses, incremental bad debt stock compensation and new sales generation activities and investments to drive future growth. Bad debt expense was $25.5 million or 6 basis points as bad debt levels have returned to more historical levels as customer spend increases with higher fuel prices and as a result of much stronger new sales, which tend to have a higher loss rate. For Q2, we're expecting revenue to be between $805 million and $825 million and adjusted net income per share to be between $3.80 and $3.90, which at the midpoint, is approximately $0.70 or 22% higher than what we reported in Q2 of 2021. I would note that our rest of year guidance expectations do still include revenue and adjusted earnings per share from our fuel business in Russia, which are $67 million and $0.63, respectively, for the remainder of the year. And the thing that's interesting is that you think the higher fuel prices obviously help us from a revenue perspective, right, in terms of MDR, but they actually help in sales. In the event that our other thing ticks down, which, again, we don't think much early days, but instead of people call in, hey, look, it's sad time for fleet or maybe they go holy moly, they're going to hold on to most or all of their fleet business, and they're going to be beneficiaries of something new because of what they built. Obviously, you're getting a lot more inbound activity with higher fuel prices, just in general, but in terms of dedicating more spend, variable spend to digital marketing, things like that, versus perhaps letting some of that flow to the bottom line."
}