{
    "symbol": "FLT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 00:52:07",
    "content": " And itâ\u0080\u0099s, I think you know the full AP, where we have every modality is the fastest growing, I think that particular line of business is probably up 40% to 50% in the quarter, and now weâ\u0080\u0099ve started some software on the front end. I mean, again, itâ\u0080\u0099s the new sales are obviously right, the mix of every 100 new vehicles, the percent EV is growing, but the base is, you know, like in the United States, I think thereâ\u0080\u0099s I donâ\u0080\u0099t know about 300 million registered vehicles, and the new car sales are $18 million a year. So itâ\u0080\u0099s super hard Bob to move the base is what I say, which is again, the other things, you know, is the EV adoption is happening more in consumer and lighter vehicles, right, versus like 18 wheelers, which is the other motivation for us to chase these, you know, EV car manufacturers and EV consumers, because thereâ\u0080\u0099s going to be way more of those in the coming years and there going to be, you know, heavy trucks on EV. It does more things, obviously, itâ\u0080\u0099s got a lot of AP, right if itâ\u0080\u0099s got $200 million to $300 million of revenue, itâ\u0080\u0099s obviously got a lot of employees probably running around, you know, in vehicles. So we think that itâ\u0080\u0099s a huge advantage to have that package to provide you know more value to clients and itâ\u0080\u0099s seemingly early on generates more leads, because historically people have been interested you know on both sides of that thing, and I think you know, weâ\u0080\u0099re not the biggest we got to be one of the biggest non-bank you know a full AP payers already. But the first thing Iâ\u0080\u0099d say is, you know on the defensive side, so on the commercial fleet side, the opportunities, the size of our whole business, right, if you went 40 years into the future, and weâ\u0080\u0099ve got a what a $1.5 billion revenue, global fleet business, the hope is, we replace the business 50 years so that everything was easy, weâ\u0080\u0099d have a $1.5 billion business plus however weâ\u0080\u0099d grow between now and then. Yeah I mean other than the micro thing, I think the answer is, itâ\u0080\u0099s representing obviously, in every business, a larger and larger piece, for example, Lodging, which we just talked about, I think itâ\u0080\u0099s up now about 15% of the sales in that line of business, it was probably 5% two or three years ago, is taking a way bigger chunk of the marketing leads, we used to do old-fashioned, you know, trade shows for middle markets and things like that. I mean, your question is a good one, Trevor in terms of the growth thing having you know, markets that are pacing interest rate moves differently, right like Brazil cut out super early and then I guess we, the US cut out and now Europe is chasing so having you know different timing and differential the rates obviously you know, creates FX volatility. Okay, and then â\u0080\u0093\n But all the reasons are working, right to get to an aggregate number weâ\u0080\u0099re giving you hey look, weâ\u0080\u0099re looking at just a year from today 20% revenue growth organic plus obviously the print would be way higher because weâ\u0080\u0099re adding the deal. And how do we get the distribution to be right for the scene so what weâ\u0080\u0099ve concluded is, weâ\u0080\u0099re not going to chase super-duper small accounts that donâ\u0080\u0099t have much AP you know that are at the very bottom and so weâ\u0080\u0099re really kind of retooling the product and distribution to be up market a bit, so still below middle market, but kind of off of the floor and particularly given you know, what weâ\u0080\u0099re seeing and hearing in the marketplace that seems like the right call who have rushed into like you know, super micro kind of AP accounts."
}