{
    "symbol": "BMA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 14:43:09",
    "content": " Banco Macro's net income for the quarter was Ps.16.6 billion, 59% higher than the third quarter of 2022 and 19% lower than the result posted a year ago. Net operating income before general, administrative and personnel expenses for the fourth quarter of 2022 was Ps.131.3 billion, decreasing 8% or Ps.11.3 billion quarter-on-quarter due to lower income from financial instruments at fair value to profit and loss. In fiscal year 2022 net operating income before general, administrative and personal expenses totaled Ps.498.2 billion, which was 36% higher than the previous year. Operating income after general and administrative and personal expenses was Ps.78.2, 11% or Ps.10 billion lower than in the fourth quarter of 2022, and 79% or Ps.34.5 billion higher than in the fourth quarter of 2021. In the quarter, net interest income totaled Ps.83.6 billion, 12% or Ps.9.1 billion higher than the result posted in the third quarter of 2022 and 20% or Ps.14 billion higher than the result posted one year ago. In the fourth quarter of 2022 interest income totaled Ps.198.6 billion, 23% or Ps.37.7 billion higher than in the third quarter of 2022, due to higher income from government activities and was 79% or Ps.87.8 billion higher than the previous year. Compared to the fourth quarter of 2021, net income from government and private securities increased 144% or Ps.71.9 billion. In the fourth quarter of 2022 interest expense totaled Ps.150 billion, which was 33% or Ps.28.6 billion higher compared to the third quarter of 2022 and 179% or Ps.73.8 billion higher on a yearly basis. Within interest expenses, interest on deposits increased 34% to Ps.28.5 billion quarter-on-quarter, mainly driven by a 10% increase in the average volume of private sector deposits, while the average interest rates paid on deposits increased 860 basis points. In the fourth quarter of 2022, Banco Macro's personnel and administrative expenses totaled Ps.29.2 billion, 4% or Ps.1.2 billion lower than the previous quarter, due to lower employee benefits which were partially offset by higher administrative expenses. In the fourth quarter of 2022 the results from the net monetary acquisition totaled Ps.56.9 billion loss, which was 70% or Ps.11.4 billion lower than the loss posted in the third quarter of 2022 as a consequence of lower inflation."
}