{
    "symbol": "KBH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-11 21:06:04",
    "content": " In the fourth quarter, our housing revenues of $1.93 billion were up 16% from a year ago, reflecting a 3% increase in homes delivered and a 13% rise in their overall average selling price. Our selling, general and administrative expense ratio of 8.0% for the 2022 fourth quarter improved 180 basis points from a year ago, mainly reflecting a decrease in external sales commissions, lower costs associated with certain performance-based employee compensation plans and enhanced operating leverage due to higher revenues. In 2023, we will continue to focus on aligning our overhead expenditures with revenue levels we are forecasting our 2023 first quarter SG&A expense ratio to be approximately 10.3% to 10.8% as compared to 10.2% in the prior-year period, primarily reflecting reduced leverage on fixed costs from the lower level of expected revenues, along with costs associated with the higher community count in the current year. Compared to our robust 2021 results, we increased our housing revenues by 21%, to nearly $6.9 billion, expanded our operating margin by 350 basis points to 15.1%, measurable improvements in both our gross margin and SG&A expense ratio and reported $9.09 of diluted earnings per share, an increase of 51%. Having pivoted our land strategy earlier in the year in response to softening housing market demand, during the 2022 fourth quarter, we continue to moderate our investments in land acquisitions and development, with expenditures down 29% to $443 million compared to the year-earlier quarter. Please proceed with your question. Please proceed with your question. Please proceed with your question. Help me reconcile the statements that you're protecting your backlog and not getting as aggressive or getting a least aggressive as you can on the backlog, maybe I guess you said in some instances where they're smaller backlogs in certain communities maybe incentivizing a little bit but broadly, trying to maintain the gross margin of let's say three or six months ago, and help me reconcile that statement with the first quarter guidance of 20% to 21%, which is several hundred basis points lower than a couple of quarters ago. Please proceed with your question. And we had a lot of buyers that weren't locked, that we had to work with the keep in the backlog because they were scared to death of 6%, when they bought it at 3.5% or 4%, and a lot of what's coming through here in the first quarter, hitting margins as we did more than we normally do on financing concession to keep the backlog, but if you spend 2 points or 3 points on loan as opposed to a broad-based price discount, as a Company, financially, we're far better off. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}