{
    "symbol": "KBH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-03-23 22:13:05",
    "content": " At 6.6 net orders per community, our monthly absorption rate was seasonally very strong in the first quarter, up from 6.4 in last year's first quarter, even as we continued to implement price increases across the vast majority of our communities, and interest rates began to rise. We are pleased that despite increasing supply chain challenges during the back half of the first quarter, we generated a meaningful increase in our housing revenues, which, combined with an improved operating margin drove 44% growth in our diluted earnings per share compared to the prior year quarter. In addition, sustained strong net order absorption during the quarter, along with our substantial beginning backlog and produced a 55% year-over-year increase in our quarter end backlog, supporting our revenue and margin outlook for 2022. In the first quarter, our housing revenues of $1.39 billion rose 23% from a year ago, driven entirely by a 22% rise in the overall average selling price of homes delivered, as the number of homes delivered was about even with the year earlier quarter. We believe we are well positioned to achieve this top line performance, supported by our first quarter ending backlog value of approximately $5.7 billion and our expectation of continued favorable housing market conditions. In the first quarter, our overall average selling price of homes delivered expanded 22% year-over-year to approximately $486,000 and reflecting increases across the business, ranging from 16% in our Southwest region to 24% in our West Coast region. Reflecting our strategy of balancing pace and price to drive higher returns, our 2022 first quarter housing gross profit margin improved 160 basis points to 22.4%. Our selling, general and administrative expense ratio of 10.2% for the first quarter improved 50 basis points from a year ago, mainly due to operating leverage from higher housing revenues partially offset by higher costs associated with resources to support growth. Our income tax expense of $43.8 million for the first quarter represented an effective tax rate of approximately 25%, which increased from roughly 21% in the year earlier quarter, largely due to the expiration of federal tax credits for building energy-efficient homes. In summary, for the 2022 full year, using the midpoint of our guidance ranges, we expect a 30% year-over-year increase in housing revenues and a 450 basis point expansion of our operating margin to 16.3%, driven by improvements in both gross margin and our SG&A expense ratio. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. But I think there's a pretty good potential for us to pick up on a little bit of additional leverage on our fixed costs and gross margin again, predominantly -- well, really starting in the second quarter, running right through the end of the year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}