{
    "symbol": "KBH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-09-21 20:50:22",
    "content": " We delivered another quarter of strong financial results with meaningful year-over-year growth in most of our key metrics, highlighted by more than 600 basis points of expansion in our homebuilding operating income margin to approximately 18%. The balanced approach we take towards capital allocation has resulted in $100 million of stock repurchases in the past two quarters, driving a 5% year-over-year reduction in our diluted share count in the third quarter. In the third quarter, we produced measurable year-over-year improvements in most of our key financial metrics, including a 26% increase in our housing revenues, a 610 basis point expansion of our operating margin and a 79% rise in our diluted earnings per share. Our overall average selling price of homes delivered in the quarter rose to $509,000 from $427,000, average selling prices were higher in each of our four regions, with year-over-year increases ranging from 12% in our West Coast region to 26% in our Central region. For the fourth quarter, we are projecting an overall average selling price of approximately $503,000, which would represent a year-over-year increase of 12%. Excluding inventory-related charges of $8.5 million in the current quarter and $6.7 million in the year earlier quarter, our operating income margin was up 600 basis points year-over-year to 18.1%. We expect our fourth quarter homebuilding operating income margin, excluding the impact of any inventory-related charges, will be approximately 16.7% compared to 12.9% in the year earlier quarter. Excluding the $5.9 million of current quarter abandonment charges and $6.7 million of inventory-related charges in the prior year quarter, our gross margin was up 500 basis points year-over-year to 27%. Assuming no inventory-related charges, we believe our fourth quarter housing gross profit margin will be in the range of 25% to 26%, which is lower than our prior expectation due mainly to the anticipated impact of selling price adjustments in response to softening housing market conditions and a loss of leverage on lower expected housing revenues. Our selling, general and administrative expense ratio of 8.9% improved by 100 basis points as compared to 9.9% from the 2021 third quarter, primarily due to a 70 basis point decrease in external sales commissions and increased operating leverage from higher revenues in the current quarter. During the quarter, we issued $350 million of 7.25% eight-year senior notes and used the net proceeds together with cash on hand to redeem $350 million of 7.5% senior notes prior to the September 15, 2022, maturity, recognizing a $3.6 million loss on this early redemption of debt. In summary, while current housing market and supply chain conditions have negatively impacted our expectations for the fourth quarter, our outlook for the 2022 full year reflects significant year-over-year improvements across most of our key financial metrics with notable increases in our scale, housing gross margin, operating margin and returns. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}