{
    "symbol": "KBH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-06-22 21:31:06",
    "content": " With more than $6 billion in potential future revenues and backlog, we believe we're well-positioned to deliver meaningful returns focused growth this year with an anticipated expansion of our scale to $7.4 billion, and an increase in our operating margin to over 16%, which together will drive a return on equity of over 27%. Our housing revenues of $1.71 billion for the quarter increased from $1.44 billion in the prior year period, reflecting a 21% increase in our overall average selling price and approximately the same number of homes delivered. In the second quarter, our overall average selling price of homes delivered increased to $494,000 from $410,000 in the prior year period, reflecting the strong housing market conditions over the past 12 months, which supported the successful opening of new communities and enabled us to raise prices across our operational footprint. Homebuilding operating income was up 62% to $264.5 million as compared to $162.9 million in the year earlier quarter, reflecting an increase of 410 basis points in operating margin to 15.4% due to meaningful improvements in both our housing gross profit margin and SG&A expense ratio. Please proceed with your question. If you go back to the comments I made about our buyer profile that closed in the quarter, at an average income of 125 in the credit metrics and the down payment, they actually could absorb more interest rate than we've seen so far and still buy the homes that they're choosing. Please proceed with your question. My understanding is that, a lot of investors sort of feel like builders need to cut their prices in order to get affordability back to where it was, let's say, when you had a 5% mortgage rate, you see the mortgage rate went from five to six, they do the percentage increase in that payment and then they say, well that's how much the home price needs to drop by, so they're just doing math. Rob, you want to take that? Please proceed with your question. We're selling at margins above what we just reported and have been, so we have a lot of room to navigate without -- while continuing to generate above average returns and above average operating margins and we have a lot of communities we're going to be opening that we tied up three years ago and you know what's happened to price in the last three years versus when we underwrote those assets. Please proceed with your question. Please proceed with your question. Rob, you want to take that? Please proceed with your question. Please proceed with your question. Please proceed with your question. Rob, you want to take that?"
}