{
    "symbol": "OESX",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-04 15:48:12",
    "content": " We remain focused on key growth opportunities, including our unique capabilities to execute large nationwide turnkey LED lighting projects for major accounts to building out our maintenance services division to expanding our controls and IoT capabilities as well as building on our healthy, safe and sustainable work environment solutions for our customers. Orion's first quarter fiscal '22 revenue increased $24.3 million to $35.1 million, principally due to strong business activity from 2 of our large national customer accounts. First quarter fiscal '22 operating expenses were $6.8 million versus $4.7 million in the first quarter of fiscal '21, but improved to 19.4% of sales as compared to 43.3% of sales in the prior year because of the significant increase in revenue. Orion generated EBITDA of $3.8 million in the first quarter fiscal '22 compared to an EBITDA loss of $1.7 million in Q1 '21, reflecting revenue and gross margin growth that leveraged our operating expense levels. I think when you look at the mathematics of what we have laid out and go through it, if you grow where we expect to be this current fiscal 2022 and grow that over 10% over a 5-year period, you get roughly to half of our goal, which would mean that we have a goal of making acquisitions over the 5-year period that can add roughly $250 million of revenues for our company. And we have seen a very nice robust pipeline at this point in time of things that we are looking at, which encourages us -- our premise that there are some companies out there that could help us grow and at the same time, we don't want to rule out that something somewhat larger than what's defined as a tuck-in could come along that we'd say it makes really good sense for our company and for our shareholders to do something larger. We have not, at this point, gotten far enough where we're going to say what the goal is for that maintenance services business over the 5-year period, other than that, we think it's going to be a significant part of our business over the long term."
}