{
    "symbol": "OESX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-09 13:05:17",
    "content": " We continue to expect full year fiscal '22 revenue to increase approximately 11% to about $130 million. Turning to our third quarter results, as anticipated, Orion's Q3 '22 revenue decreased to $30.7 million versus $44.3 million in Q3 '21, which had benefited from a rapid rebound activity following initial COVID-19 disruptions, particularly from our largest customer. Nonetheless, our revenue for the first nine months of fiscal '22 increased to $102.3 million versus $81.3 million a year ago an increase of 25.8%. We also achieved solid growth in our Energy Services Company, or ESCO channel, where revenue is up $7.2 million or 91.5% year-to-date. Based on the expanded scope of our combined businesses, we believe Orion has the potential for over $20 million of maintenance services revenue in our fiscal year '23, which begins April 1. We are maintaining our revenue expectation of approximately $130 million, which represents growth of 11% versus fiscal '21 revenue of $116.8 million. While current market conditions limit our visibility into fiscal '23, we do remain confident in our long-term strategic plan of building a $500 million annualized revenue business over about a 5-year period, capitalizing on average organic growth of at least 10% per year, supplemented with external growth through acquisitions, partnerships and other initiatives. Orion's third quarter fiscal '22 revenue of $30.7 million compares to $44.3 million in Q3 '21, a period in which we generated significant revenue from our largest customer as we were able to regain momentum on projects that had been postponed due to the original onset of the COVID-19 pandemic. In addition to a $14 million year-over-year decrease in revenue from our largest customer, Q3 '22 revenue was also impacted by LED project delays as our customers responded to supply chain disruptions and new COVID-19 variant impacts to their businesses. However, year-to-date net income improved to $7.3 million from $4 million in the first 9 months of fiscal '21, reflecting higher year-to-date business volume and margins. Orion's effective tax rate is 24.9% through the first 9 months of fiscal '22, although we do not expect to pay meaningful cash taxes for several years because of net operating loss carryforwards of nearly $70 million as of the close of fiscal 2021. For the first 9 months of fiscal '22, Orion's EBITDA improved to $10.9 million compared to $5.5 million for the first 9 months of fiscal '21. We continue to expect full year fiscal '22 revenue to increase approximately 11% to about $130 million. We feel and have concluded that most of the shortfall, I will call it, for fiscal '22 of our move to telling you we feel we're going to be in the $130 million range is caused by our customers' supply chain and/or COVID challenges."
}