{
    "symbol": "OESX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-07 13:41:05",
    "content": " Despite a variety of external business and economic challenges, Orion was able to grow fiscal ‘22 revenue by 6.5% over last year to $124.4 million. We are particularly encouraged by our traction in the Energy Service Company or ESCO partner channel, where in fiscal ‘22 we grew revenue by 71% to $19.6 million. This maintenance business is on track to generate meaningful growth in fiscal ‘23 with at least $20 million of revenue, up from $5.8 million in fiscal ’22 and we expect this business can deliver a gross profit percentage roughly in line with our existing business. We expect revenue from our largest customer to decline to approximately $25 million in fiscal ‘23, following the completion of the turnkey LED lighting and control retrofit of the bulk of the U.S. store footprint. As Mike mentioned, Orion grew fiscal ‘22 revenue 6.5% to $124.4 million, driven by growth outside our largest customer relationship, including our ESCO channel, which increased by $8.1 million and a $5.7 million increase in maintenance services. Fourth quarter fiscal ‘22 revenue decreased to $22.1 million from $35.5 million in Q4 21, which had benefited from strong national account project activity, enabled by the easing of work and travel restrictions following the onset of the COVID-19 pandemic. Orion reported fourth quarter fiscal ‘22 net loss of $1.2 million versus net income of $22.1 million in Q4 fiscal ‘21, which included a $20.9 million noncash tax benefit from the release of valuation allowance against Orion's deferred tax assets. Orion's effective tax rate was 26.2% in fiscal ’22, although we do not expect to pay meaningful cash taxes for several years because of net operating loss carry forwards of more than $60 million for federal tax purposes as of March, 2022. Your line is open. So starting with the Stay-Lite acquisition in January, that company is giving us a run rate going into fiscal ‘23 of around $10 million of revenue and we're expecting roughly $10 million of revenue from a couple of our other retail customers at this point in time. Your line is open. So with all of that kind of said, you probably would put a box around that of somewhere between $20 million and $25 million of business that we had expected that has been, was pushed back due to largely customer situations and decisions, and sometimes their own supply chain challenges and somewhat of a COVID mix in some situations in terms of access. Your line is open. Your line is open. Your line is open."
}