{
    "symbol": "AAN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 12:47:18",
    "content": " I'm pleased to report that our consolidated Company results for the fourth quarter were in line with internal expectations for both revenue and adjusted earnings, and that we delivered both consolidated Company and segment results for the full year 2022 that were within the revised outlook we provided on October 24. Although our lease portfolio size for our company operated stores enter the fourth quarter ahead of our internal expectations at $126.5 million, our lease portfolio size enters the fourth quarter 7.2% lower than the prior year quarter. Consolidated revenues for the fourth quarter of 2022 were $589.6 million, compared with $444.8 million, up primarily due to the BrandsMart acquisition and offset by lower revenues at the Aaron's business. Adjusted free cash flow was $24.7 million, up $1.1 million, or 4.7% due to higher cash provided by operations, primarily driven by lower inventory purchases at the Aaron's business to align with demand trends. Total revenues decreased 9.1% in the prior year to $404.3 million, primarily due to lower lease revenues, the result of both a lower lease portfolio size and a decline in customer payment activity. Adjusted EBITDA at the Aaronâ\u0080\u0099s business was $36.2 million, compared with $58.1 million due primarily to a decrease in gross profit and a higher provision for lease merchandise write-offs partially offset by lower personnel expenses. Our 2023 non-GAAP EPS outlook is $0.70 to $1.10 per share, which has been impacted by lower adjusted EBITDA in both segments, higher depreciation expense, higher interest expense and a higher effective tax rate versus last year. The primary factors influencing our 2023 outlook include starting in the year with a 7% lower lease portfolio size at the Aaronâ\u0080\u0099s business and lower customer demand, which is driven by expected lower traffic and lower average ticket size at both business segments, both partially offset by improving customer payment activity and cost savings we are achieving through our operational efficiency and optimization program. We believe an ongoing high inflationary environment in the first half of the year for both the company and our customers will continue to negatively pressure average ticket size in both businesses, Aaronâ\u0080\u0099s lease portfolio size, and the provision expense release merchandise write-offs as well as other segment level and corporate expensive. I would say in terms of the whole portfolio, we do expect churn in the first half of the year really related to be higher than the second half really related to the lease originations that we did at the peak of stimulus in 2021, there's the average term for our lease is about 20 months, and we expect those to have a higher impact on churn the first half of the year, but our decisioning, and all the things that we put in place in 2022, kicking in the second half of the year. As we look at opening new stores, we do expect and we included this in the presentation material that we provided on our website for the quarter, we are anticipating four wall economics and margins, they're about 8% at the store level, and you again, would be a loss in the first six months returning the positive thereafter, and then getting the full maturity with an EBITDA range of call it $3 million to $7 million per store in the third year. I think our customers are acclimating to a new normal in terms of inflation rates, although, we still do see some pressure, I think the majority of the improvement we're seeing are the decisioning changes and enhancements to our models we've made over the last year, we continue to look at it and make sure that we're always solving for risk adjusted margin, and really trying to set the customer up for success."
}