{
    "symbol": "NABL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 16:11:02",
    "content": " Once again, our Q3 results exceeded the high end of our outlook, with revenue of $93.5 million, growing year-over-year by 13% on a constant currency basis. We grow as our partners grow and our best-in-class data protection security offerings give our partners additional services to drive revenue expansion, whether it's our mail security protecting approximately 2.2 million mailboxes or EDR technology protecting around 1.2 million endpoints, or our past portal offering that provides password and credential protection, we give MSPs an integrated layered security approach that allows them to grow wallet share. As John mentioned, we finished the third quarter ahead of our outlook with total revenue of $93.5 million representing 6% year-over-year growth on a reported basis or 13% on a constant currency basis. Third quarter adjusted EBITDA came in well above the high end of our outlook at $28.9 million, representing approximately 31% EBITDA margin as we achieved strong cost management in the quarter. Using updated FX rate of â\u0082¬0.99 on the euro and Â£1.14 on the pound as well as changes in other currencies, our prior 2022 revenue guidance of $370 million to $372 million translates to $369 million to $371 million, reflecting approximately $1 million of additional FX impact in the fourth quarter. As it relates to our prior 2022 adjusted EBITDA outlook of $107 million to $109 million, using these updated FX rates, our adjusted EBITDA outlook translates to $106.5 million to $108.5 million, reflecting approximately $0.5 million of additional FX impact in the fourth quarter. While the global macro environment remains uncertain and FX rates may continue to fluctuate, based on our current FX assumptions, we expect our fourth quarter of 2022 total revenue in the range of $93.3 million to $93.8 million, representing approximately 5% year-over-year growth or approximately 11% to 12% on a constant currency basis. three million to $369.8 million, representing approximately 7% year-over-year growth on a reported basis or 12% to 13% growth on a constant currency basis, in line with the constant currency growth outlook in the previous quarter. For adjusted EBITDA, we expect the fourth quarter in the range of $27.5 million to $28 million, representing approximately 30% margin at the midpoint."
}