{
    "symbol": "MRC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 21:15:07",
    "content": " Gas utilities drove more than 40% of this quarter's sequential growth and hit a new milestone with $314 million of revenue in the second quarter, its highest quarterly revenue to-date. The good news is that our underlying international business is strengthening as we've increased our international backlog by $31 million since year-end, implying stronger international revenues in 2023 and beyond. In the second quarter, our backlog grew across all four business sectors and all three geographic segments and ended at $746 million, a 12% increase over the first quarter. Total sales for the second quarter were $848 million, a 14% sequential increase, outperforming our previous expectations of an upper single-digit improvement and returning our quarterly revenue rate to late 2019 pre-pandemic levels. The DIET sector, second quarter revenue was $259 million, an increase of $33 million or 15%. The upstream production sector revenue for the second quarter was $178 million, an increase of $20 million or 13%, led by the U.S. as well completion activity increased for our primary customer base. U.S. revenue was $717 million in the second quarter, a $99 million or 16% increase, also led by the gas utilities and DIET sectors with all sectors of mid-teen percentages. Canada revenue was $40 million in the second quarter, a 7% decline compared to the first quarter, primarily as a result of the spring break-up seasonal impact in the upstream production sector. International revenue was $91 million in the second quarter, a 12% increase with all sectors up despite a $4 million foreign currency headwind. Adjusted gross profit for the second quarter was $181 million, 21.3% of revenue, an 80 basis point improvement over the first quarter and the second time in our public company history, it has been over 21%.Compared to a year ago, it is 180 basis points higher as we continue to experience the benefit of higher sales volume, the positive impact of inflation, our preferred supplier position and proactive supply chain management. Before adjustments, our gross profit percentage was 17.8% in the second quarter, down 50 basis points from the first quarter, primarily due to increased LIFO expense, which was $20 million in the second quarter and $6 million in the first quarter. As we announced a month ago, we are projecting our revenue to come in at approximately $3.3 billion or a 24% growth with EBITDA at $230 million or 7% of sales, a 150 basis point improvement compared to last year. We reaffirm our guidance that MRC Global will achieve $3.3 billion in revenue and $230 million in EBITDA or 7% EBITDA margin this year, which would be our best EBITDA margin percentage since 2014.And finally, we believe we are in the early innings of multiyear growth for our business with many drivers of durable growth across all four sectors, particularly in gas utilities, chemicals, energy transition and traditional energy."
}