{
    "symbol": "MRC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 14:15:02",
    "content": " Drilling down into each sector, the gas utilities business continues to hit new milestones with $359 million of revenue in the third quarter, its highest quarterly revenue to-date growing 14% sequentially. Our chemical subsector revenue has grown 24% versus the third quarter of 2021 and the outlook remains positive, especially in the North America market, which benefits from low feedstock costs. And third, we are expecting to generate positive cash flow from operations this year even as we've grown our revenues by approximately 26% and our gross inventories by $197 million. Gas utilities sales were $359 million in the third quarter, a $45 million or 14% increase as our customers continue to progress on their integrity and meter replacement programs. The DIET sector third quarter revenue was $276 million, an increase of $17 million or 7%, driven by the U.S. followed by international. The upstream production sector revenue for the third quarter was $176 million, a decrease of $2 million or 1%, driven primarily by seasonality in Canada, partially offset by modest increases in the U.S. and international upstream businesses. U.S. revenue was $768 million in the third quarter, a $51 million or 7% increase led by the gas utility sector followed by the DIET and upstream production sectors, which we covered earlier. Canada revenue was $37 million in the third, a $3 million or 8% decline, compared to the second quarter, primarily due to seasonal impacts in the upstream production sector, which we expect to reverse in the fourth quarter. International revenue was $99 million in the third quarter, a 9% increase with DIET and upstream increasing despite $5 million foreign currency headwind. Adjusted gross profit for the third quarter was $198 million or 21.9% of revenue, a 60 basis point improvement over the second quarter and a sequential event. And although gross margins will continue to fluctuate each quarter due to many variables, including line pipe sales, we believe we can continue to generate overall average adjusted gross margins of 21% or higher in the coming quarters. EBITDA for the quarter was $82 million or 9.1%, a 340 basis point improvement over last year and a new MRC Global record for adjusted EBITDA margin. Due to our revenue growth, adjusted gross profit margin improvement and continued cost discipline, we were able to drive more revenue to the bottom line with incremental EBITDA of 20% in the third quarter versus last year, a level elevated from historical averages."
}