{
    "symbol": "MRC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 15:24:02",
    "content": " Revenue came in at $742 million, up 8% sequentially versus the fourth quarter, led by double-digit growth in our upstream production and diet sectors. Gas Utilities continues to be our largest sector, and we experienced 5% sequential growth to $271 million, tying our highest revenue quarter ever for this business. Therefore, we are raising our full year revenue guidance by $100 million to $3.1 billion, and we are now targeting $200 million of EBITDA for the full year, which represents 6.5% of sales. Total sales for the first quarter were $742 million, an 8% improvement and above our previous guidance expectations. Gas utility sales were $271 million in the first quarter, a $13 million or 5% increase as customer activity picked up after a typical year-end seasonal decline, and we expanded our product offerings with a key customer. In the diet sector, first quarter revenue was $226 million, an increase of $25 million or 12%, driven by increased refinery turnarounds and energy transition projects, primarily renewable biofuel projects in the U.S. The upstream production sector revenue for the first quarter was $158 million, an increase of $18 million or 13% sequentially. Midstream generally lags the upstream activity by a couple of quarters, and we continue to expect a double-digit improvement in our midstream pipeline business this year, supported by a backlog position that has increased 19% since year-end. U.S. revenue was $618 million in the first quarter, a 9% increase from the previous quarter, led by the diet sector, which was up $26 million or 18%, driven by increased turnaround activity from pent-up demand and an increase in renewable biofuel projects. Canada revenue was $43 million in the first quarter, up $3 million or 8% as compared to last quarter, with improvement in 3 of our 4 sectors. International revenue was $81 million in the first quarter, a 1% increase from the previous quarter, driven by upstream production, partially offset by the diet sector. Adjusted gross profit for the first quarter was $152 million or 20.5% of revenue, 110 basis points lower than our all-time high in the fourth quarter as certain high-margin project orders did not repeat. Tax expense in the first quarter was $7 million compared to $1 million of expense in the fourth quarter, and our effective tax rate increased in the first quarter to 30% due to discrete items primarily related to share-based compensation plans. Capital expenditures were only $2 million in the first quarter, but we continue to expect our full year 2022 capital spend to fall within a range of $10 million to $15 million as we invest in e-commerce, system upgrades and facility improvements. As Rob discussed earlier, we are raising our full year 2022 guidance, and we are now projecting our revenue to come in at approximately $3.1 billion or 16% growth with EBITDA at $200 million or 6.5% of sales, a 100 basis point improvement compared to last year. But in the near term, we see significant project activity and significant backlog build that gives us confidence that the previous guidance that we gave around energy transition coming in maybe $40 million to $50 million for this year, we could even do double that potentially, depending on the timing of the projects."
}