{
    "symbol": "FGEN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 22:59:06",
    "content": " Moving chronologically, we expect top line data from LELANTOS-1, our Phase 3 trial of pamrevlumab in non-ambulatory patients with DMD in the second quarter of 2023. We anticipate readouts from the MATTERHORN Phase 3 trial in patients with anemia or myelodysplastic syndromes in the second quarter of 2023, and data from our China Phase 3 study in patients with chemotherapy-induced anemia expected in the second quarter of 2023 as well. With a diagnosed prevalence of approximately 330,000 patients across the U.S., E.U., China and Japan, IPF represents a significant opportunity with the two approved therapies generating together almost $4 billion in global net revenue in 2021. We recorded $23.4 million of net product revenue for roxadustat sales in China, compared to $5.5 million in the fourth quarter of 2021, which represents an increase of $17.9 million or a 328% increase year-over-year. Total roxadustat net sales from the joint distribution entity, jointly owned by AstraZeneca and FibroGen or JDE was $53.1 million this quarter, compared to $32 million in the fourth quarter of 2021, an increase of 66%. FibroGen's net transfer price from sales to the JDE was $17.2 million for the fourth quarter, consistent with the 30% to 45% range of the JDE's roxadustat net sales, which we have continuously guided. And as noted, we expect topline data from three pamrevlumab pivotal Phase 3 studies in 2023, LELANTOS-1 in non-ambulatory patients with DMD in the second quarter of 2023. In addition, we expect topline data from two roxadustat pivotal Phase 3 studies, MATTERHORN in patients with anemia MDS in the second quarter of this year and China CIA study in the second quarter of this year as well. But assuming the profile of the product has the -- replicates the efficacy and good tolerability profile, I think we have to start by thinking about, okay, if 40% to 50% of the patients are discontinuing therapy within the first year, you can imagine that, that's a significant driver for many of those patients to go into a new therapy."
}