{
    "symbol": "AMBC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 00:42:08",
    "content": " This quarter represents a pivotal moment for Ambac, marked by the $1.84 billion settlement of our long-running RMBS litigations against Bank of America and the near-term resolution of our remaining Puerto Rico exposure, 2 of the largest outstanding obstacles impacting the pursuit of near- and long-term options to maximize value from our Legacy Financial Guarantee business. For the quarter ending September 30, 2022, Ambac reported a net income of $340 million or $7.41 per diluted share. Everspan Group, our Specialty P&C hybrid platform, had another strong quarter of growth with gross premium written of $30 million, representing a six-fold increase from the prior year period. For the third quarter of 2022, Ambac reported net income of $340 million or $7.41 per diluted share compared to net income of $17 million or $0.35 per diluted share in the third quarter of 2021. For the quarter, Everspanâ\u0080\u0099s $4 million earned premium growth mostly offset the $4.4 million earned premium contraction in the Legacy Financial Guarantee portfolio, which earned $6.6 million. In the third quarter of 2022, proactive derisking resulted in net negative accelerated earned premiums of $1.7 million. In addition, we would like to highlight that of the $30 million of Specialty P&C gross written premiums in the quarter, Everspan retained about 20% or $6 million. More specifically, the decrease in investment income during the third quarter related to a net loss on fund investments of about $5 million compared to a $6 million gain in the third quarter of 2021. Net gains on derivative contracts, which are positioned as a partial economic hedge against the interest rate exposure in the financial guarantee and investment portfolios, were $37 million for the third quarter compared to a gain of $5 million for the third quarter of 2021. The $5.93 per share increase is due to the $319 million settlement gain, partially offset by the adverse effect of foreign exchange translation losses and higher discount rates on the PV of financial guarantee installment premiums."
}