{
    "symbol": "BMRN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 00:40:01",
    "content": " VOXZOGO revenues of $34 million in the first half -- sorry, $54 million in the first half of the year contributed to these results and they were driven by continued rapid expansion of global commercial access for  achondroplasia. I'm very pleased with our record performance in the second quarter of 2022, resulting in $534 million in total revenues which represents 6% growth year-over-year, including in Kuvan and 13% growth, excluding Kuvan which continues to experience decreasing market share from prophylaxis in the United States. For Brineura, 24% growth year-over-year and revenue of $38 million in the second quarter was driven by 18% growth in commercial patients versus a year ago. While we expect meaningful year-over-year growth and saw continued net patient growth in the quarter, Palynziq performances trailed our expectations, resulting in an adjustment to full year guidance downward to between $250 million to $275 million. One comment on how our planned 2022 revenues are split between the first half and second half of the year is that while Naglazyme and Vimizim order timing were weighted to the first half of the year, as Jeff noted, second half revenues are expected to benefit from growing VOXZOGO and Palynziq revenues compared to the first half of the year, plus the potential for a modest amount of ROCTAVIAN revenue. Based on current exchange rates, we project that the net impact on our full year 2022 revenues after hedging will be a relatively modest negative effect of approximately $15 million versus our original 2022 guidance expectations which did incorporate some of the exchange rate volatility observed early in the year. R&D expenses for the second quarter were $158 million, a slight decrease as compared to the second quarter of 2021, reflecting decreased VOXZOGO development efforts after the marketing approvals in the second half of last year which was mostly offset by increased R&D on our early-stage programs. While the gain on the sale of the PRV remains the largest single contributor to first half GAAP net income, we are pleased to report GAAP net income during the second quarter of 2022, totaling $28 million and $149 million for the first half of the year. Based on this strong first half 2022 performance, we have slightly improved our full year 2022 GAAP net income guidance range by $10 million to $105 million to $145 million. With respect to non-GAAP income, Q2 2022 non-GAAP income of $109 million was slightly higher than 2021 second quarter non-GAAP income of $98 million and full year 2022 non-GAAP income guidance remains unchanged at between $350 million to $390 million. And based on the clinical trial data that we've got, both the Phase III full data set at 2 years early cohort of 3 years and the Phase I/II 6e13 dose data at 6 years, we judge that the risk of nonresponse is very, very low and the risk of going back to prophylaxis which is essentially what we would be needing through a period of time in these agreements is also similarly low. Although, as Jeff noted, because of the real strong response rates and durability in ROCTAVIAN -- and I believe it was only 6 out of 134 patients in the Phase III study that have resumed prophylaxis, that's going to mean that when we estimate what will be balance sheet reserves, the liabilities to capture these commitments, we believe they'll be modest."
}