{
    "symbol": "IHG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 14:21:08",
    "content": " Global RevPAR for the half was up 51% versus 2021, and we saw strong momentum build in Q2 with RevPAR just 4.5% behind pre-pandemic levels. By contrast, Greater China had a challenging period due to COVID-19 restrictions, although we have seen a strong recovery in recent trading as those restrictions have lifted. In terms of growth, our adjusted year-on-year net system size growth was 3% with gross growth of 4.8%. In total, 15,000 rooms were opened across nearly 100 hotels, and we passed the 6,000-hotel milestone globally. 31,000 rooms were added to our pipeline across 210 hotels. Our operating profit more than doubled versus last year, which puts it just 8% behind 2019 levels. And with net debt coming down further, together with the confidence we have in the strength and positioning of our business, we are pleased to be reinstating an interim dividend 10% higher than the interim payment in 2019, alongside launching a share buyback program that will additionally return $500 million of capital to our shareholders. Revenue of $840 million and operating profit of $377 million increased 49% and 101%, respectively, against 2021. Adjusted interest, including charges relating to the System Fund, decreased to $64 million. Our effective tax rate was 28%, down 8 percentage points. Taken together, this resulted in adjusted earnings per share of 121.7 cents. When looking at 2022 versus 2019, the 2 measures are closely aligned, RevPAR down 10.5% and fee business revenue down 10%. In terms of net system size, we had year-on-year gross growth of 4.8%, which includes opening 15,000 rooms in the first half of this year. Our underlying removals rate was 1.8%, making our net system growth 3.0% on an adjusted basis. That underlying removals rate excludes the impact of the Holiday Inn and Crowne Plaza quality review completed last year and 6,500 rooms related to ceasing operations in Russia. I've talked before about targeting for this year net system size growth of 4%, noting that doing so will be stretching. But given at the half year stage we are at 3.0%, this does require a challenging acceleration of openings in the second half of the year. Since the start of 2021, there continue to be variances in the shape of recovery across our regions. And pleasingly, we've seen improvement in trading in May and June, and this has continued in July. Starting with the Americas, where comparable RevPAR for the half was up 45% on 2021, resulting in a deficit of less than 2% versus 2019. By the second quarter, each month saw RevPAR exceed 2019 levels, resulting in the quarter being up 4% overall. Across our U.S. franchise estate, which is weighted to domestic demand in upper mid-scale hotels, Q2 RevPAR increased by 5% versus 2019. Underlying fee business revenue increased 40% on 2021, a deficit of only 1% on 2019. Meanwhile, underlying fee operating profit exceeded 2019 by 6%, which includes the benefit of our sustainable cost savings. Our owned, leased and managed lease portfolio generated operating profit of $9 million compared to a loss of $12 million in 2021. During the half, we opened 42 hotels -- or opened -- or over 4,000 rooms across the Americas, of which more than half were for the Holiday Inn Brand Family. We signed over 100 hotels, taking our Americas pipeline to over 100,000 rooms. The momentum behind leisure travel has continued with occupancy and particularly rate, exceeding 2019 levels. Business rate in the U.S. has exceeded 2019 levels in every month since March, while demand has also steadily increased. There remains further potential for business travel recovery, especially within the meetings, incentives, conferences and exhibitions segment. Moving now to Europe, Middle East, Asia and Africa, where RevPAR has also been recovering rapidly and was up 138% for the first half versus 2021. Compared to 2019 levels, RevPAR in the half was 21% lower, but the second quarter was down only 10%, indicative of the improving momentum through the period. In the U.K., RevPAR for the half was only 8% behind 2019. Restrictions in these markets were generally slower to be lifted, resulting in first half RevPAR performance down 22% versus 2019. However, as travel limitations were eased in the second quarter, RevPAR improved to a deficit of only 6%. Lifting restrictions has taken longer in a number of other markets in Asia, but strong improvements in trading have been seen there more recently, too. The owned, leased and managed lease portfolio saw its operating losses narrowed to just $4 million in the first half of 2022. Looking briefly at the development environment, we opened 7,000 rooms in the half. We removed 9,000 rooms from the system, the vast majority due to exiting 28 hotels in Russia. We signed 8,000 rooms in the half with conversions accounting for around 45%. And with these feeder markets effectively shut down, Tiers 2 to 4 and resort locations were also impacted. Underlying fee revenue was down 32% against the prior year, a decline of 48% on 2019. We opened 19 hotels or 4,000 rooms in a challenging development environment. By comparison, 36 hotels were opened in the first half of last year. The momentum behind our Crowne Plaza brand in Greater China continued with 16 signings across the region, and Holiday Inn Express saw further success with 15 hotels added to the pipeline. In respect to fee margin, our overall margin for the half grew 11.8 percentage points year-on-year. At 55.9%, this is ahead of 2019 despite the EMEAA region not yet being fully recovered and the challenges in Greater China. Margins are highest in our Americas region, where 90% of our hotels are franchised. The pace of demand recovery, along with our focus on costs, has meant that margins continue to grow, now at over 5 percentage points ahead of pre-pandemic levels. Given that many markets only opened for travel later in the half, margin recovery will continue. In Greater China, our fee margin remained positive despite unfavorable trading conditions throughout the half. We spent gross CapEx of $72 million, while net CapEx was an outflow of just $22 million after proceeds from disposals and System Fund inflows. Maintenance CapEx was up $6 million, reflecting our continued emphasis on investing in the business. Turning to the System Fund, we continue to benefit from depreciation levels exceeding CapEx now that the investment in GRS is complete. Taking these and other movements into account, we generated an adjusted free cash inflow of $142 million, broadly in line with $147 million generated in the first half of last year. After payment of the resumed dividend, net movement in cash for the half was an outflow of $24 million. However, noncash and foreign exchange movements resulted in net debt decreasing by $163 million. After investing behind long-term growth, which remains our foremost priority, we generated sufficient funds to reinstate and increase our interim dividend by 10% to $0.439 cents. Given the strong balance sheet position, we have announced today an initial $500 million buyback program, which we expect to complete in the next 6 months. This year's dividend payments to shareholders of around $235 million, together with the $500 million additional return of capital through the buyback are equivalent to around 7% of IHG's current market capitalization. So to conclude, we've seen trading improve significantly during the first half of the year with RevPAR for the group very close to pre-pandemic levels and our fee margin ahead of 2019. The proven, highly cash-generative nature of our business has allowed a 10% increase in the interim dividend and enabled us to restart returning surplus capital to shareholders. And with today's $500 million, it takes the aggregate capital returned to over $14 billion. There is no question that the last 2 years have challenged our industry, but its fundamental growth drivers remain very strong and give us great confidence in the future for this business. Whether for new experiences, to physically connect, interact or collaborate, people want to get out there and explore the world. While we understand there are uncertainties within the economic outlook, we are confident in our business model and the attractive industry fundamentals that will drive long-term growth. And while there'll be cycles, both up and down, during the lifetime of a hotel, we know that owners remain confident in the long-term cash generation and asset values this industry and our brands are able to offer. While this industry and IHG cannot, of course, be entirely immune to economic cycles, our expectation is that the industry will continue its track record of growing ahead of global economic growth that will continue to drive industry-leading levels of performance. Much of our confidence comes from the great strength and resiliency of our business model, as shown by our results over the last 2 years. Our system is formed of over 6,000 hotels across 17 brands in more than 100 countries. Our asset-light model, in which we franchise or manage 99% of the hotels in our estate, allows us to grow at a pace with low capital requirements. Our income is based upon high-quality, long-term fee streams, typically around 90% of which is directly linked to the revenue of hotels. And cumulatively, between 2015 and 2021, more than 100% of our earnings converted into free cash flow. Our pipeline of 278,000 rooms is more than 30% of our current system size and locks in multiple years of growth. And very importantly, we operate in a high barrier-to-entry environment, one where it's very challenging to replicate the scale and strength of the enterprise platform we have built over many decades. Our System Fund receives and spends over $1 billion a year on behalf of our owners, achieving massive scale advantage for them. This includes our recently transformed loyalty program, IHG One Rewards, which has over 100 million members and industry-leading technology which we have heavily invested behind. We also have highly effective procurement solutions that provide invaluable support to owners through all stages of the hotel life cycle, something that is critically important in today's world in terms of helping them access quicker solutions and manage costs. And for all of these reasons, coupled with the long-term growth drivers of this industry that we have real confidence in the future and to make sure we continue to build our capabilities and capitalize on growth, we continue to put all of our focus and investments into our four strategic priorities. First, building loved and trusted brands. Back in 2017, we identified white spaces in our portfolio where we could see a clear path to address long-term consumer trends and capitalize on notable sustainable growth opportunities. Fast forward to today, and through either organic development or acquisition, we've added 6 brands to our portfolio across our four segments of Suites, Essentials, Premium and Luxury & Lifestyle. We started in 2017 with the launch of avid, a large-scale opportunity driving high owner returns in the mid-scale segment. The following year, we launched voco, our conversion-focused premium brand which was recently named the World's Leading Premium Hotel Brand by the World Travel Awards. A year later, we acquired Six Senses, our high-end, luxury, resort-focused brand with wellness and sustainability at its core. That same year in 2019, we launched Atwell Suites, our upper mid-scale, extended-stay brand in the U.S. And most recently, we launched Vignette Collection in August last year, our Luxury & Lifestyle conversion brand which is off to a great start. While lots of work goes into expanding a brand portfolio, we, of course, remain focused on ensuring that we are driving the growth of all 17 individual brands, investing and developing our existing brands and integrating and scaling up our newer additions. Examples include Hotel Indigo, which we launched in 2004, and Six Senses, which we bought in 2019. Hotel Indigo, our premium lifestyle brand, reached its first 100 hotels opened after 14 years. Thanks to all the work going on into the brand, we expect to open the next 100 in less than half that time. During the half, we secured a further 16 signings, and we're on track for a record year of openings. On the right-hand side, you can see how we have accelerated Six Senses' growth. On acquisition, there were 16 open hotels and 18 in the pipeline. In the 3 years since, we've opened another 5 and nearly doubled the pipeline to 35, which is a direct benefit of putting the brand within the strength, scale and sophistication of IHG's enterprise platform. It has another 9,000 rooms in the pipeline, which will see the brand enter a further 10 new countries by 2025. When we acquired Kimpton in 2015, it was a leading boutique hotel brand that was solely based in the U.S. In the 7 years since, we've taken Kimpton to 12 countries, and its pipeline of 8,000 rooms across 40 hotels will extend that to 19 countries by 2025. And as we continue to add stunning flagship properties in prime locations and resort destinations, this will help further accelerate the brand's international expansion in the years to come. Against the backdrop of a fragmented global hotel supply, we've talked before about the increased importance of conversions as hotel owners look to benefit from our scale, revenue-generating systems, marketing and loyalty programs to drive performance, efficiencies and returns. With voco and Vignette Collection, we have added two brands that play primarily in the conversion space. For example, we had another 3 portfolio deals in EMEAA in the first half that added 10 hotels across 6 brands. Importantly, when you look at conversions over the past 2.5 years, they're going to represent 25% of our signings. And there is a spread of opportunity across our brands, with half coming from our Essentials segment and the other half split across Suites, Premium and Luxury & Lifestyle. We are focused on securing high-quality conversions across our brand portfolio, and owners are making significant investments to access IHG's brands and enterprise platform. Just to highlight some of our recent conversions, and going beyond those of voco and Vignette, you can see we can use conversion for flagship properties and to both help enter new markets and expand existing ones. Some examples here include our first Atwell Suites in Miami, our first Kimpton in Australia, expanding Staybridge Suites in Saudi Arabia and Hotel Indigo in the United States. I've talked a fair amount about our newer brands, but we're not standing still with our more established ones such as Holiday Inn and Crowne Plaza. You'll note that in 2021, we carried out a thorough portfolio review of these 2 brands, resulting in the removal of 151 hotels from our system. Since Kemmons Wilson opened the first Holiday Inn in 1952 in Memphis, Tennessee, this iconic brand has never stood still, be that its expansion to 220,000 rooms across 1,200 hotels today, its design and service or the work done to maximize owner returns. In our most recent evolution of our upper mid-scale full-service brand, we are focusing on three critical areas to meet both guests and owner needs through innovative design. Firstly, we relooked at our guest rooms to ensure that they are more attractive and suitable for both corporate travelers and leisure customers. Secondly, we reimagined the lobby layout, based upon consumer and owner feedback, to make it more social and drive improved guest satisfaction while also reducing staffing levels, a key area of focus for owners given labor pressure in many markets. And thirdly, we have evolved our guest-preferred breakfast buffet, again leading to increased guest satisfaction whilst also achieving significant reductions in food waste and further lowering food costs for owners. Having launched in 1983, the brand today has 110,000 rooms across more than 400 hotels. And we have around 115 hotels representing just under 30,000 rooms in the pipeline, equivalent to 27% of our existing estate. And as part of last year's review, we took the decision to remove 43 hotels from the estate and have been working with owners on transformational renovations. In fact, around 75% of our Americas estate has either recently opened, is under renovation or committed to renovate. This year, 28 renovations are expected to be completed, which is the equivalent to the last 4 years combined. I'm not going to provide an update on all 17 brands today, but I would like to briefly touch on Holiday Inn Express, avid and Atwell Suites before I move on to our next strategic pillar. Holiday Inn Express, our category killer in the upper mid-scale segment, continues its leadership and strong growth. Having reached 3,000 hotels in its 30th year, the pipeline remains very robust with more than 80,000 rooms or growth of 26% on its current size. This has been further reinforced by the first properties now being sold at premiums to their build costs, which can help demonstrate to other prospective owners the total returns that can be made from this great brand. During the half, Atwell Suites opened its first newbuild prototype property in Denver and an adaptive reuse in Miami. We'll have another conversion site open early next year, demonstrating the flexibility and potential of this new, extended-stay brand. When we refreshed our strategy several years ago, we set up a phased approach on to how we can drive customer centricity for guests and owners. We then continued to improve the quality across our existing estate, which included the Holiday Inn and Crowne Plaza review, the evolution of both brands that has followed and the introduction of new prototypes across our brands. We were then able to focus on transforming our loyalty program, elevating our mobile experience and innovating our digital channels. You can't expect to achieve results into providing a stronger, holistic experience, and that's what we are now seeing. If we look at loyalty, we have more than 100 million members enrolled in our IHG One Rewards program. They account for half our room nights, spend 20% more than nonmembers and are 9x more likely to book direct, which is the most profitable channel for our owners. So we transformed IHG One Rewards, supported by our largest marketing campaign in more than a decade to help raise awareness and drive more profitable hotel revenues for our owners, along with new, more compelling credit card offerings. Faster earn has included improving the value of our currency with the launch of dynamic reward pricing, revamping our tiers and giving members the ability to earn more bonus points as they move up tiers. The program empowers them to choose the perks that matter most to them with milestone rewards, where members are offered a choice from a selection of rewards every 10 nights. And with richer benefits, we have introduced enhancements like free breakfast for Diamond Elite members and access to reward night discounts and upgrades, additions that our loyalty members prefer, value and want to use. In addition to all the program changes, we've also invested to put loyalty in the palm of our guests' hands with the all-new IHG One Rewards mobile app. Although the app is designed for convenience of all customers, IHG One Rewards members will get the most out of the experience with the ability to easily track progress towards their next status and milestone reward choice. The app also offers a digital concierge, a chat-based experience giving members more seamless access to customer service. We're expecting it to drive further direct bookings, loyalty engagement and incremental spend during stays. Since its relaunch, revenue driven by our mobile app from the Americas and the EMEAA regions has been at 30% higher levels than 2019. Clearly, our direct digital channels are very important to us, to our owners and to our loyalty members. We are on a journey to ensure how customers book with us is intuitive, easy and streamlined, helping maximize guest conversion rates and drive higher revenues to our hotels. While there are multiple pieces and phases to the innovation being implemented by our teams over the coming years, I want to highlight some of the most recent developments that have gone live. By combining rooms and rates onto a single page, testing across our Holiday Inn Express portfolio has shown a 2% to 3% increase in revenue and a 10 percentage point improvement in loyalty enrollments. And we've introduced Add Extras page to support the cross-selling of nonroom extras such as purchasing loyalty points, parking, food and beverage vouchers and other unique experiences. This sets us up for the next phase of upsell or, in other words, our full attribute pricing rollout, which will enable owners to generate maximum value from the unique attributes of their room inventories. This pillar is all about ensuring our growth ambitions are achieved in the right way: taking care of our people, communities and planet. Our Journey to Tomorrow 2030 responsible business plan is focused on 5 critical areas: our people, communities, carbon and energy, waste and water. It is critical to our future success that we cultivate a culture of inclusion where everyone feels welcome, valued and able to thrive. Amongst a number of initiatives to drive further improvement, we are identifying and removing potential barriers to increase the female general manager population across our estate. To help support this, we have several initiatives, including unconscious bias training, new diverse hiring approaches and fresh talent and leadership development programs. Last December, we announced the Intercontinental brand's partnership with Byredo, and more recently, we announced our global collaboration with Unilever to replace single-use bathroom amenities in over 4,000 of our hotels. Unilever's largest brand, Dove, will supply bulk-sized bath amenities to IHG's Essentials and Suites brands, which account for around 80% of our global portfolio. The switch is expected to save at least 850 ton of plastic annually in the IHG Americas region alone, and the scale of our buying will provide hotels with savings of up to 30% versus current costs. IHG's markets are now covered by bulk bath amenity contracts, and we continue to push forward on other aspects of waste as well as the rest of our Journey to Tomorrow commitments. So to sum it up, we've seen strong trading in the first half of 2022 with increased demand in most of our markets. We opened nearly 100 properties and signed more than 200, with our pipeline growing 3% year-to-date to more than 1,850 hotels. Whilst there are uncertainties in the economic outlook, we are very confident in the industry fundamentals, the strength of our business model and our ability to drive long-term, sustainable growth. You referenced there, Paul, in the prepared remarks that it's clearly a stretched target now given the required acceleration in H2. In terms of our net growth, as you rightly say, I am targeting for us to get to 4%. And obviously, with the first half at 3%, it does become more challenging. I am pleased with the openings we've achieved at 4.8%, and I'm also pleased with the direction of travel on the removals. And you'll remember that I've said before that with the Holiday Inn and Crowne Plaza removals program that we went through last year, we should be able to get our removals down 2%, on average 1.5% a year. So to get to 4%, that means that we got to do 5.5% gross growth. And the question is going to be, how many of those, plus the ones that might be a bit delayed in the second half, are going to get through the system. We're now with our 17 brands and our strengthened platform delivering revenue, but owners are talking about bringing all of their hotels into IHG, which is going to be an interesting increment for us in terms of growth. And so overall, I'm optimistic of getting to the 4%, but it's not assured. Well, within this business, it can certainly do more than 4% net growth. And in terms of the signings outlook, again a lot of owners want to sign up hotels with us across our many brands. So we've got industry-leading propositions in all the categories that we operate in, and it's just getting those through the system as quickly as we can and out to -- as open hotels. Well, I guess we signed 31,000 rooms in the first half and 210 hotels. So with 17 brands, no reason why it can't get up to 80,000 again in due course. I mean, obviously, I can't tell exactly how many of those are going to come through in the second half of the year. Commercial, as you say, very important because they get the hotels through the pipeline faster. So a lot of pickup for voco, for Vignette and a lot of other brands that are converting into our system. So again, it's that enterprise platform delivering very strong revenues for owners. So we've got some great conversion brands, and I think they'll continue to contribute for us. And in the second half, they're going to need to because we need to get as many hotels as possible open. Just to that 4% net unit growth, just to be absolutely clear on -- with definition that, that's now adjusting for Russia, obviously, which wasn't announced when you bridged to get to target. They're sort of running at half sort of 2019 levels, half Q1 levels. And also, the openings in the Americas are a record low as it's going backwards. So in terms of the net unit growth, yes, we are adjusting for Russia. And there's no other adjustments because, as you say, the Holiday Inn and Crowne Plaza removals, they were all going out last year. In terms of the Americas, we had a very strong first quarter of signings, and we have a month every year where we have to basically resubmit our franchise contracts to local states for them to reauthorize the -- what we call a dark period. But there's a lot of demand, a lot of letters of intent signed, et cetera. And in terms of the openings, again it does tend to be back half weighted. In terms of costs, so the $75 million of sustainable cost savings that we've talked about before, those are locked in. We delivered those last year, and they're continuing into this year. And then on the rest of our cost base, about -- so 70% of it is people related, 15% or so is D&A and 15% is other costs. And in terms of the people related, they're sort of -- generally, 3% to 4% is what we've seen historically, and it's linked to the wage increases in the business. And as I think Keith mentioned, we're now seeing a number changing hands and owners making very good returns on their investment, and that's really important both for owners' confidence and also for lenders seeing that there's a strong secondary market for avid. And I think that as openings accelerate, then we'll see a lot more avids getting out into the market. Firstly, to follow up on Paul's questions on the demand -- Paul's comments on the demand recovery and corporate travel. And then on a different topic, just to follow up quickly on Jamie's question on inflation. I'll take the conversation around demand, and then I'll let Paul talk about inflation and margin growth. I mean as you saw in the presentation, we've had sequential improvement in RevPAR every month as the year has progressed and then with real strength coming in our business. And so if you break it into three different areas, you're looking at leisure travel. So we're seeing that strength of leisure, as you highlighted. Demand is somewhat behind 2019, but rates are up. So in June, we were just 1% behind in terms of revenue for business. So what you're seeing is leisure demand up versus 2019, business demand getting closer to 2019, and groups lagging but still getting sequentially better with rates going up across the board. And overall, I think what we've shown as an industry and as a company with the advancements we've made in our revenue management technology, that even as demand was still low, we were able to get pricing up. And I've been very, very focused about leveraging our new technology systems and revenue/demand forecasting to make sure we're well positioned, too. But when you think about our 2023 revenue profile, demand profile, you've got tailwinds because China will reopen. And we've seen China, when restrictions are lifted, demand comes back incredibly quickly to levels very close to 2019 or above. So even if there is a little bit of demand cooling in some of the other markets, we're going to have that tailwind. And again, we still think ADR is going to be a part of the recovery because our pricing actually hasn't kept pace with inflation. And in terms of the question on costs and how we're going to manage those, Leo, you're absolutely right when you talk about EMEAA and China, that they haven't yet seen the full revenue recovery. The Americas has seen a big increase on the margin we were running in 2019, which is driving the overall group margin up. But more broadly, just sort of step back a bit, and I've talked about how we manage inflation, if you go back over the last 20 years, the nature of this business, whereby we grow without having to add significant additional costs into the business, will continue. And over the 20 years, we've added on average sort of 125 basis points of margin per annum. There's been some very different commentary from different hotels in terms of how to model inflation, I guess, one extreme saying whatever you think is going to happen with inflation at the cost base, just put it through on the ADR and we think it will get passed on, and some saying not that. Obviously, it's very difficult. And then in terms of the buyback, it obviously is similar in size to the large special dividends that you did, and that one didn't take you to sort of the top of your typical leverage guidance. I think I'll let Paul talk about long-term growth, gestation times and so forth, and I'll let him clearly talk about the buyback. We're quite confident that inflation is an issue in our cost base, but it's really about how do we drive owner returns. So, I mean, in terms of our aspirations around long-term growth, we've said before we want to be industry leading. In terms of how long it takes to get a hotel open once you sign it, it does vary, as you'd imagine, significantly by brand. In a normal environment, where there is access to construction crews and there's access to building materials, et cetera, then you -- at the fastest hotels, so in avid and some Holiday Inn Expresses, you might be talking about some -- say, 2 years. Others can take a large region, large -- Intercontinental could take 10 years to get all your planning, et cetera, et cetera. And we have 40% of our pipeline that is already under construction, so a lot of that is already baked in. And then we've talked before about the removals that we expect will come down to around the 1.5% level on average, and that gives us confidence in being able to move forward at an industry-leading rate of growth. In terms of the buyback, so you are right that when we get to the end of the year, based on expectations, it won't be to the top of this 2.5 to 3x range, but that is also probably about the maximum amount of shares that we could buy back in the next 6 months just with the volume that we have in the -- trading in the shares. And clearly, if you look over the last 20 years, we returned $14 billion of capital to shareholders. Oh, yes, in terms of inflation, I think this industry actually performs quite well in an inflationary environment, as I said earlier, because of our ability to price the product on a daily basis. And our brands are in such high demand as well to both the leisure and to the corporate customers given the range of the brand portfolio, the investments we've made in our loyalty program which make it significantly more compelling to that high-frequency travel or two. So we fundamentally believe we have pricing power in this industry that can continue moving forward because truthfully, ADR growth hasn't kept pace with inflation. And we're very, very focused on leveraging low-cost distribution channels, taking cost out for our owners. And I mentioned about the new Holiday Inn breakfast, lowering cost, new prototypes with cost to build being lower and  being lower, too. So in its entirety, when we talk about being customer centric, we say we've got guests and we've got owners. So we're constantly talking about internally cost to build, cost to operate, cost to renovate, how can we leverage our scale, things like with Unilever with Dove, taking down costs by 30% for bath amen. So it's a never-ending journey, though, and we have to make sure we're constantly focused on that and not standing still. And we're seeing our owners are able to, again, sell hotels today at significant premiums to what they were building them for and get -- generating those returns on the assets. So I think that it's an inflationary environment, but we're well positioned for it and make sure we're driving high returns for our owners. So if you had a good hotel and you were bringing it in from an independent or one of the weaker brands, you wanted those brands. But now having more conversion brands, so more opportunities, it does allow more owners to bring in their product. And what's your ambition there of -- again, I heard one of your peers talk about the fact they can get that number up to 75%, 80%. I think I'll take the loyalty program, and I'll take -- and let Paul talk about newbuilds and the demand outlook. So, I mean, in terms of the demand outlook and what we're seeing, clearly we have a relatively short window where bookings are on our books. And -- well, that's across all the different booking types, so whether leisure or business or group. And clearly, that -- business and group segment has some way to go back to normalization. We said, well, that's just not what we're seeing in the business, and that proved to be the case. In terms of newbuild versus conversion, I think what you really want is a great customer experience. And a newbuild hotel for, say, an avid, well, it's going to be a newbuild because they're all newbuilds. Something like an Intercontinental or Regent, actually some of those locations, the historic hotels, are irreplaceable. It's very, very difficult to get new locations. We have increased the ability for customers to quickly move up tiers, given them more choice with milestone benefits and more personalization, too. So it's a much richer program from a customer perspective and also makes sure that it protects the costs for our owners as well, too. It's about the brand portfolio, it's about the overall quality of your assets, it's about the geographic mix. Having a complete brand portfolio from Luxury & Lifestyle, from Six Senses to Intercontinental through mainstream and Premium makes you more compelling from a loyalty program perspective. So if you've got big gaps in your portfolio, then you're less appealing to certain segments of customers, too. And so fixing the brand portfolio, underpinning the quality of that brand portfolio with the work we did in Holiday Inn and Crowne Plaza, the investments we're making in technology, all those things come together to provide a stronger customer experience and a stronger loyalty program. 6, 7 weeks into the program, we're seeing enrollments are going up. And we would expect to see our contribution continue to grow each year moving forward as the program becomes more embedded, as we get more resonance with customers. We have some of our brands already there in some markets, and so we aspire to see us continue to go in that direction. But it's going to be a 2- to 3-year journey until we see a real step change just because, again, you have to pull people out of other programs because our program is more valuable to them and get that in the right cycle. And also, I see the continued recovery of business travel in the years to come. I just noticed in all of your regions, the number of Holiday Inn hotels has come down again quarter-on-quarter. The only adjustment, as we've said, is for Russia because by the end of this year, we will have cycled off the 2021 Holiday inn and Crowne Plaza program. And the second thing, obviously you've spoken a lot this morning about the loyalty program. I'll let Paul talk about operational performance, and I'll talk a little bit about loyalty in the credit card. But I think the way to think about it is that the franchise business is broadly linear to revenues, and you've got all the components of that and then you get the incentive management fees coming through as the business recovers. We've launched a number of new credit card offerings this year both for individuals and businesses and so forth, too. Unlike our peers, a significant portion of our income goes into the System Fund to support marketing efforts and driving that, and some does come to the P&L as well, though. We've got -- the new business card has no fees to it, really attracting that small business spend, which we haven't historically had. It's been great to connect with you all again, and we are really pleased with how the first half of the year has turned out."
}