{
    "symbol": "SNDL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 14:40:15",
    "content": " In terms of our investment segment, through the third quarter of 2022, SNDL had deployed capital to several cannabis related investments with an IFRS fair market value of approximately $678 million, including $527 million to the SunStream Bancorp joint venture. Our cash flow provided by operating activities was 8.6 million in the third quarter of 2022, compared to cash used in operating activities of 17.9 million in the second quarter of 2022 and cash used in operating activities of 56 million in the third quarter of 2021. Our gross margin grew to 50 million in Q3 2022, a record since SNDL's inception up 17% from Q2 2022, and an increase of over 2700% from Q3 2021. Gross revenue for liquor retail sales for the three banners combined was 152 million for the third quarter of 2022, an increase of 4% compared to the third quarter of 2021, despite Alberta's off premise liquor retail volume sales being down this past quarter compared to the same period last year. Gross margin was $35 million or 23% of sales in Q3 2022, compared to 33 million in Q3 2021. Gross revenue for the two banners combined in the third quarter of 2022 was $66 million compared to 6.1 million in the third quarter of 2021, a 985% increase. Our gross margin for Q3 2022 was 14.5 million or 22% of sales compared to 3.7 million in Q3 of 2021, and is primarily due to Value Budsâ\u0080\u0099 new locations, and aggressive pricing strategy. Gross revenue from the cannabis operations segment for the third quarter of 2022 was 16.5 million compared to 15.4 million, a 7% increase over the second quarter of 2022 and compared to 11 million in the third quarter of 2021, a 49% year-over-year increase. We're pleased to announced we achieved a record gross margin in the third quarter of 2022 of 0.2 million compared to negative 1.9 million for the three months ended September 30, 2021, and negative 4.3 million for the prior quarter. As of the end of Q3 2022, SNDL's cannabis related investments had a carrying value of 677 million, including 526 million in the SunStream Bancorp, Inc. joint venture. Effective July 25, 2022, SNDL's common shares were consolidated on a one share for each 10 shares outstanding basis as of September 30, 2022 and November 11, 2022 SNDL had an unrestricted cash balance of 291 million and 361 million respectively, and a total of 236 million post-consolidation shares outstanding as of November 11, 2022. Our third quarter results feature sales of 152.5 million, a 4.5% increase from the third quarter of 2021, and a 5% increase from the second quarter of 2022. Gross margin in the liquor retail segment was 35.6 million or 23% of sales in the third quarter of 2022 compared to 33.6 million in the third quarter of 2021, an increase of 5.7%. Preferred label sales were $10.7 million in the third quarter of 2022, an increase of approximately $1 million compared to the third quarter of 2021. Our third quarter sales results for Wine and Beyond were up $33.8 million, a 43% increase from the third quarter of 2021. Our focus on cultivation excellence continues to show positive returns as gross revenue from the cannabis operation segment for the third quarter of 2022 was 16.5 million, compared to 15.4 million, a 7% increase in the second quarter of 2022, and compared to 11 million a 49% year-over-year increase. SNDL achieved a record gross margin before fair value adjustments through the three months ended September 30, 2022 of 3.6 million or 31% compared to negative 4.9 million for Q3 2021, an increase of 8.6 million or 176%."
}