{
    "symbol": "SNDL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 13:39:03",
    "content": " In terms of results, our net revenue was $17.6 million, including 1 day of revenue from the acquisition of Alcanna on March 31, which represents an increase of over 78% over the first quarter of 2021. Had the acquisition of Alcanna occurred on January 1, 2022, and revenue would have increased by approximately $162 million, a single day of contribution from Alcanna and Nova in Q1 amounted to approximately $2 million in revenue. By the end of the first quarter of 2022, Sundial has deployed capital on several cannabis-related investments, resulting in a total of $650.2 million, including about $453 million to the SunStream Bancorp joint venture. For the first quarter of 2022, the investment portfolio generated interest and fee revenue of $3.9 million, equity pickup of $4.1 million from SunStream and an investment loss of $17.7 million on marketable securities, which includes unrealized losses on previously publicly disclosed strategic investments in Village Farms International and The Valens Company. Net revenue for the first quarter of 2022 was $17.6 million, including the 1 day of revenue on the acquisition of Alcanna, an increase of 78% over the first quarter of 2021. Had the acquisition of Alcanna occurred on January 1, 2022, revenue would have been approximately $164 million and gross margin would have been approximately $36 million. Our gross margin improved to $3.4 million for the first quarter of 2022 compared to a loss of $3.5 million in the first quarter of 2021, a 200% improvement. Gross margin for the first quarter of 2022 was negative $0.2 million compared to negative $3.5 million for the 3 months ended March 31, 2021. Gross revenue for the 3 months ended March 31, 2022, was $7.5 million, including $0.7 million, representing 1 day of sales for Nova. And system-wide retail sales were $34.6 million for the first quarter of 2022, including that 1 day of Nova revenue. And while Sundial does not account for the results of the Nova retail stores prior to the acquisition date, the NOVA results for the full quarter were gross revenue of $49.8 million and gross margin of $9.4 million or 18.8% of sales. By the end of the first quarter of 2022, the company had deployed capital on cannabis-related investments totaling $650 million, including $453 million to the SunStream Bancorp, Inc. joint venture."
}