{
    "symbol": "SNDL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 11:58:04",
    "content": " SNDLâ\u0080\u0099s second quarter of 2022 gross margin grew to $43.1 million, up 1,627% from its second quarter of 2021 loss of $2.8 million. By the end of the first quarter of 2022, Sundial had deployed capital into several cannabis-related investments with an IFRS fair value of $561.7 million, including $462 million to the Sunstream Bancorp joint venture. With this first full quarter subsequent to the acquisition of Alcanna, we achieved net revenue in the second quarter of 2022 of $223.7 million compared to $9.2 million in the second quarter of 2021, representing a more than 2,000% increase. Our gross margin grew to $43.1 million in the second quarter of 2022, the highest since SNDLâ\u0080\u0099s inception, up over 1,600% from a loss of $2.8 million in Q2 2021. The second quarter of 2022 is SNDLâ\u0080\u0099s first full quarter reporting liquor retail revenue subsequent to the acquisition on March 31, 2022, and the segmentâ\u0080\u0099s stable and growing cash flow profile along with best-in-class retail operations expertise has significantly impacted SNDLâ\u0080\u0099s growth. Gross revenue from the cannabis retail segment for the second quarter of 2022 was $63.5 million compared to $7.5 million for the first quarter of 2021, a 746% increase. System-wide cannabis retail sales, including sales from our franchise partners, was $92.8 million for the second quarter of 2022. Gross margin for cannabis retail this quarter was $13.9 million or 21.9% of sales, significantly increased from $3.3 million compared to Q1 2022. Gross revenue from the cannabis segment for the second quarter of 2022 was $15.4 million compared to $11.3 million in the first quarter of 2022, a 36% increase and a 21% sequential improvement from the first quarter of 2022. This represents SNDLâ\u0080\u0099s first positive adjusted EBITDA quarter in the cannabis segment, which can be attributed to higher sales volumes, improved margin on an adjusted basis, reductions to SMG&A, and greater discipline over inventory management driving a reduction in price discounts for provincial board sales during the first half of 2022. As of the end of the second quarter of 2022, SNDL had cannabis credit and equity investments with a fair value of $562 million, including $462 million related to the Sunstream joint venture and $100 million in Canadian credit and equity holdings. In terms of our financial highlights, gross revenue for liquor retail sales for the three banners combined was $148.6 million for the second quarter of 2022. Yes, so Pablo, I think when you look at the IPOs that have occurred and the other financing vehicles in the space, number one, I would just remind you that we have the largest Canadian-funded credit portfolio in the cannabis space; number two, a number of those IPOs which came out, theyâ\u0080\u0099re now trading--in the BDC realm and elsewhere, theyâ\u0080\u0099re trading at a meaningful discount to book, which means that their access to capital is meaningfully restricted, and so--and weâ\u0080\u0099re also keenly aware of the quality of credit and where we are in the cycle when it comes to U.S. opportunities, so I think youâ\u0080\u0099ll see those results from those financing vehicles really start to show in the coming quarters."
}