{
    "symbol": "ROAD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-05 18:54:05",
    "content": " Two additional factors that boosted the third quarterâ\u0080\u0099s top line were favorable weather across our region, as well as an approximately $10 million of revenue from liquid asphalt index adjustments due to the large increase in asphalt prices during the three month period. But the additional acquisitions that we've made, including the one just announced would probably add $75 million to $100 million of additional revenue or acquisitive revenue in next year, you've got that one that would be pretty much a full year's worth of revenue. We anticipate moving forward into next year, that we're going to continue to see a healthy organic growth CPI has historically done, between 6% and 10%, we certainly see that continuing into the future. But we had about 30%, if you go to the midpoint of our guidance, we did about 30% of that in the third quarter, and we're at the midpoint of our guidance, we're saying about 29% in the fourth quarter, which as you noted, if you take out the $10 million of the liquid asphalt, we're not going to be that far off from a 30:30\n Yes, that's fair. But one thing that I think doesn't show through in the financials, is the difference in our maintenance CaPex and our growth CaPex, to maintain our business, we typically are 3.25% to 3.50% of sales, this year, it's going to be on the low end of that around 3%. Part of what hit us obviously, in the third quarter is when you grow revenue, quarter-over-quarter basically a $100 million then, even though our average days in networking capital went down, that $100 million revenue growth quarter-over-quarter is going to chew up a lot of working capital. We envision that the bidding environments going to continue to be strong, and the IIJA is going to continue really, what we've been experienced in the last 12-months, the states we're in all have healthy state budgets, the COVID relief money this past year, has given them extra money. So even though we've got a higher top line of what that leverage can be, we don't see that changing our strategy as far as being patient with acquisitions, doing ones that make sense, and taking advantage of also the organic growth opportunities, because that's really a focus for us."
}