{
    "symbol": "H",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 13:16:04",
    "content": " This area of the world continues to lead the recovery, which was evident in April, where we saw comparable RevPAR in the Americas, up 3% to 2019 and ALG net package RevPAR in the Americas was up 12% as compared to 2019; third, group business, which accounts for a sizable portion of our stabilized total revenue base has accelerated meaningfully through March and April. Compared to 2019, group revenue  at our Americas managed hotels was down only 8% in April, while gross group revenue book for the same hotels was 20% higher in the first quarter, 37% higher in March alone and 42% higher in April for states that will take place this year. This positive leverage was on full display in the month of March, where we generated an adjusted EBITDA of $102 million, plus net deferrals of $10 million and net finance contracts of $2 million or nearly 60% of that total for the quarter. Our net rooms growth in the first quarter was 18.6% or 5.2% when excluding ALG, and we maintained a strong pipeline of 113,000 rooms or approximately 40% of our current base, ensuring the capacity to drive strong incremental fee revenue from net rooms growth well into the future. Group rooms revenue in our comparable Americas full service managed properties was down only 8% to 2019 levels in April and group pace for the remainder of the year from May through December is down only 12% to 2019, with tentative group bookings up 60% to 2019. Adjusted EBITDA for Hyatt, excluding ALG, was $113 million for the quarter and improved rapidly from $11 million in January to $70 million in March, a reflection of the RevPAR acceleration Mark mentioned. As we look deeper into the strong results, the improvement in our lodging business was primarily driven by the strength in the Americas region, which contributed $85 million in adjusted EBITDA in the quarter, down only 9% to 2019. In addition, base, incentive and franchise fees accelerated in both the Americas and Southwest Asia region, improving collectively from January, where fees were approximately 20% below 2019 levels to March or fees returned to 2019 levels, reflecting the quickly improving RevPAR environment and impact from our industry-leading net rooms growth. First, net package RevPAR for the same set of hotels in the Americas was down 8% to 2019 during the quarter and up 1% to 2019 in March, reflecting strong improvement in demand as the impact from Omicron quickly dissipated by mid-February. Distribution and Destination Management revenue was $246 million in the quarter, a material increase from prior quarters, driven by favorable unit pricing, which was up 16% in 2019 and a heavier mix of business to more beach destinations. And as a reminder, net package RevPAR is close to 2019 levels, which drove about $30 million in fees on the AMR business. If we're clicking along at something that looks like a $10 million or $12 million increase over 2019 levels in bookings, and we have an $85 million gap to fill, you can understand why of the beliefs that we will exit this year at a run rate for group business higher than where we were in 2019. That business across those 3 properties that are now fully operational for the first year since we acquired Miraval because we've been in the midst of doing a lot of renovation work are on track, we believe, to earn something on the order of $40 million in EBITDA this year, a 30% margin to revenues."
}