{
    "symbol": "H",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 15:17:04",
    "content": " To put the magnitude of our growth into perspective, the sum of these three numbers is more than 40% above the $563 million of adjusted EBITDA we generated during the first nine months of 2019. And it's notable that these strong results have been achieved while group, business transient and cross-border travel were in a state of limited recovery during the first half of this year with system-wide RevPAR 14% below 2019 levels over that time frame. Group room revenue also experienced momentum during the third quarter, finishing approximately 3% below 2019 levels with very strong bookings during the quarter for future periods. In the third quarter, we booked 30% more in group business into 2023 for our Americas full service managed properties as compared to the same booking period in 2019 and the rates at which we are booking business are more than 17% higher. This quarter, ALG performed exceptionally well with net package RevPAR for all inclusive properties managed by ALG in the Americas, up 29% in the third quarter compared to 2019. Looking ahead, gross package revenue, which typically has a longer booking window, is pacing approximately 30% ahead of 2019 for the remainder of the year, and as we look into the first quarter of 2023. Total management franchise and other fees were $224 million, an increase of 50% from the third quarter of 2019, driven by the significant fee contribution from ALG and our industry leading organic growth over the past five years. Adjusted EBITDA was $174 million for the quarter, which is approximately 31% higher than 2019 adjusted for currency and the net impact of transactions. Additionally, our owned and leased segment generated $66 million in adjusted EBITDA for the quarter, down 10% to 2019 on a reported basis, while being up 41% to 2019 when adjusted for the net impact of transactions. Your line is open. As we look at, we are building confidence here in the forward-looking bookings that we're seeing that we are experiencing both on the group side with â\u0080\u0093 in the quarter, for the quarter, third quarter group bookings up 20% in the fourth â\u0080\u0093 for the fourth quarter and the festive period that we have extending now between November and December, up 30% for the AMR properties. Your line is open. Given the momentum in growing the ALG footprint, which we obviously seen in the last two quarters, as well as some of the things you discussed earlier, Mark, do you think that 6.5% net rooms growth rate is sustainable through 2023 based on what you know now about the pipeline? Your line is open. Your line is open. Your line is open. Our own portfolio on a FX adjusted and net transactions adjusted basis, EBITDA was 40% higher in the third quarter of 2022 versus 2019, 40%. Your line is open."
}