{
    "symbol": "H",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 13:06:03",
    "content": " We concluded the year with another record breaking quarter, bringing our full year adjusted EBITDA to $908 million plus $94 million of net deferrals and $63 million of net finance contracts, with the sum of these three numbers more than 40% above the adjusted EBITDA we generated in 2019. The owned real estate that we sold was estimated to need on a run rate basis approximately $130 million in capital expenditures per year while by comparison, the three platforms that we acquired, which are predominantly asset light, collectively needed only $40 million of capital expenditures in 2022. The success of this strategy is reflected in both the transformation of our cash flow from operations and our capital expenditures, which resulted in free cash flow of $473 million, a number that is nearly 50% higher than any previous year in Hyatt's history. It's important to also note that this record free cash flow was achieved in 2022, while RevPAR was below 2019 levels and includes approximately $55 million in cash taxes paid related to our real estate dispositions. The fourth quarter completed a transformative year for Hyatt, and as a result, we generated a record level of fees in the quarter with total management franchise, license and other fees of $226 million, an increase of 40% from the fourth quarter of 2019, driven by the continued success of our asset light transformation. Adjusted EBITDA was $189 million for the quarter, which is approximately 12% higher than 2019, adjusted for currency and the net impact of transactions. Additionally, our owned and leased segment generated $88 million in adjusted EBITDA for the quarter, down 11% to 2019 on a reported basis while up 10% to 2019 when adjusted for the net impact of transactions. The success of our strategy is reflected in both the transformation of our cash flow from operations, which was $674 million in 2022, approximately 70% higher than 2019 and our capital expenditures, which were $201 million, approximately 46% lower than 2019. In the fourth quarter of 2022, the net tax benefit for income taxes in the consolidated statement of income included a $250 million adjustment representing the reversal of this previous expense now that both recent and future expected pretax US income level provide sufficient evidence that our US deferred tax assets are likely to be realized. Second, ALG revenue and adjusted EBITDA benefited in 2022 by approximately $4 million in the third quarter and approximately $23 million in the fourth quarter, primarily from the expiration of unredeemed pandemic related travel credits. So the number one investment in the integration spend in 2023 has to do with digital investment in improving the World of Hyatt experience for those World of Hyatt members staying at ALG properties, which is highly relevant because we launched World of Hyatt in May, we ended the year at a 17% room penetration for World of Hyatt members, which is extraordinary in a short space of time, and we signed up over 315,000 new World of Hyatt members at ALG properties."
}