{
    "symbol": "EC",
    "quarter": 3,
    "year": 2021,
    "date": "2021-11-11 02:41:06",
    "content": " Let's move on to the next slide, please. Let's move on to the next slide, please. Let's move on to the next slide, please. In September, Ecopetrol started the operation of a mobile environmental laboratory for the Magdalena Medio region so that communities have a better knowledge of the environmental variables present in their surroundings and that will allow once the pilot starts to monitor their behavior, abroad, Permian reached a gross production level for Ecopetrol of 24,400 barrels of oil equivalent per day in the third quarter, evidence in the ramp-up of conventional with a cumulative EBITDA margin of 83%. Let's move on to the next slide, please. Let's move on to the next slide, please. Let's move on to the next slide, please. This increase is mainly explained by a higher EBITDA generation of COP15.5 trillion, where the following factors stand out, a positive net effect of COP13 trillion due to realization prices, higher crude oil spreads and foreign exchange increase for purchases and sales, a positive valuation of inventories for COP4.2 trillion, related to market prices and increasing ships in transit to India and the U.S., given the new delivery at place commercial strategy and the consolidation of 100% of ISA's EBITDA, COP4.7 trillion corresponding to 1-month of operation after closing the acquisition. The above was partially offset by lower volume purchases and sales for COP1.5 trillion affected by schedule and corrected maintenance activities within the refineries, higher operating activity costs for COP600 billion, mainly associated to maintenance and higher materials consumption as a result of the economic reactivation and other effects in the EBITDA for COP400 billion, mainly related to the increase in exploratory expenses, recognition of public work provisions and environmental provisions, among other aspects. We estimate that so far this year, the commercial effort has contributed around $339 million, equivalent to $1.19 per barrel to the Ecopetrol's group EBITDA as a result of export strategies, purchase of new crudes or the refineries, benefits from using our crudes and savings from energy efficiencies, among others."
}