{
    "symbol": "STVN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 14:25:27",
    "content": " We finished the year with record revenue from high value solutions, which represented approximately 30% of revenue for fiscal 2022. For the fourth quarter, revenue increased 26% to â\u0082¬292.1 million or 23% on a constant currency basis, driven by growth in both segments, the shift to high value solutions and currency. We are making relevant progress growing our mix of high value solutions, which increased 31% to â\u0082¬87.2 million in the fourth quarter. For the fourth quarter, gross profit margin increased by 290 basis points to 34.3%, due to higher revenue, a favorable mix, better leverage of fixed costs and the recovery of inflationary costs. On the bottom line, this resulted in: A better-than-expected net profit of â\u0082¬48.3 million, or 18 cents of diluted earnings per share, adjusted net profit of â\u0082¬49.6 million or adjusted diluted EPS 0.19 cents, and adjusted EBITDA totaling â\u0082¬81.9 million, reflecting an adjusted EBITDA margin of 28%, which was up 270 basis points over last year. Turning to slide 13, on a full year basis, revenue increased 17% to â\u0082¬983.7 million, driven by growth in both segments, the mix shift to high value solutions and currency. As expected, full year revenue growth was partially offset by lower revenue from COVID-19 which represented 11% of total revenue in 2022, compared to 15% in 2021. For 2022, high value solutions grew 41% to a record of â\u0082¬293.2 million and represented approximately 30% of revenue. For the fourth quarter, revenue increased 25% to â\u0082¬231.5 million, and 21% on a constant currency basis over the prior year. Financial results for the Engineering Segment were better than expected in the fourth quarter and revenue increased 30% to â\u0082¬60.6 million, mostly due to the timing and progression of projects. For the full year, revenue increased 23% to â\u0082¬184.0 million driven by growth in all business lines. This implies growth between 10% and 13%; Excluding COVID, growth is estimated to be greater than 20%, Adjusted diluted EPS in the range of 58 cents to 62 cents, Adjusted EBITDA in the range of â\u0082¬290.5 million to â\u0082¬302.5 million, Our 2023 guidance assumes headwinds and tailwinds, and considers the following: First, we expect that our second half results will be stronger than the first half, and growth will be linear throughout the year."
}