{
    "symbol": "STVN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 12:16:02",
    "content": " On Slide 7, for the third quarter of 2022, we delivered another solid quarter of double-digit revenue growth and achieved adjusted EBITDA margin of 26.8%. Revenue from high-value solutions grew 54% to â\u0082¬74.4 million, representing 30% of total revenue in the third quarter of 2022. Excluding COVID, new order intake increased by approximately 6% in the third quarter of 2022 compared to last year, demonstrating that the underlying demand trends remain strong. Revenue for the third quarter of 2022 increased 14% to â\u0082¬245.3 million over last year, driven by growth in the Biopharmaceutical and Diagnostic Solutions segment and favorable currency translation. Gross profit margin in the third quarter of 2022 increased 210 basis points to 31.6%, principally driven by the strategic mix shift to more accretive high-value solutions, improved margin in Engineering segment, and favorable currency translation. For the third quarter of 2022, this resulted in net profit of â\u0082¬36.3 million, or â\u0082¬0.14 of diluted earnings per share; adjusted net profit of â\u0082¬37.7 million, or adjusted diluted EPS of â\u0082¬0.14; and adjusted EBITDA of â\u0082¬65.8 million, which reflects an adjusted EBITDA margin of 26.8%. For the third quarter of 2022, revenue increased 20% to â\u0082¬207.1 million compared to the same period last year, driven by strong growth in our core drug containment products as new capacity comes online. For the third quarter of 2022, gross profit margin increased 150 basis points to 32.7% compared to last year, driven by favorable mix shift to high-value solutions and currency effects, which have offset the inflationary costs. For the third quarter of 2022, revenue decreased 9% to â\u0082¬38.2 million compared to the same period last year, mostly due to timing and progression of projects in certain business lines. For the third quarter of 2022, gross profit margin increased to 21.5% compared to 15.4% last year, driven by an increase in mix of revenue for more accretive business lines and ongoing optimization effort. As a result, operating profit margin in the third quarter of 2022 increased to 14% due to improved gross profit and lower G&A expenses."
}