{
    "symbol": "STVN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 12:12:07",
    "content": " For the first quarter of 2022, we delivered double-digit revenue growth, grew high value solutions and increased order intake compared to last year. For the first quarter of 2022, new order intake increased 29% to approximately €324 million, which led to a committed backlog of approximately €992 million, up from €665 million last year. I want to point out that the first quarter last year included a €5.5 million revenue benefit in our BDS segment from a licensing agreement all of which dropped to the bottom line and boosted margin, net profit and earnings in the first quarter of 2021. For the first quarter of 2022, revenue related to COVID represented approximately 10% of revenue compared to 14% for the same period last year. As Franco noted, the mix of high value solutions increased to 29% of revenue in the first quarter, up from 23% last year. Gross profit margin in the first quarter of 2022 was 31.8% and benefited from a higher mix of high value solutions, which was offset by a temporary slowdown in production due to the higher absentees during the month of January and February related to COVID-19, and to a lesser extent, inflationary costs. For the first quarter, BDS segment revenue increased 7%, or 5% on a constant currency basis over last year to €172.4 million. Revenue growth for the BDS segment in the first quarter was driven by our high value solutions, which increased 37% year-over-year to €61.5 million, while revenue from other containment and delivery solution was down 4% to €110.9 million due to the revenue benefit in Q1 last year. For the first quarter, revenue derived from external customers increased 23% to €39.6 million compared to the prior year, driven by strong sales in our glass forming and visual inspection machines; separately, the increase in inter-segment revenue was due to the company's ongoing capacity expansion efforts under its strategic plan."
}