{
    "symbol": "APLE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 12:54:08",
    "content": " As a result, second quarter operations were significantly ahead of the same period last year with comparable hotels total revenue up more than 39% relative to the second quarter of 2021, we achieved comparable hotels adjusted hotel EBITDA of $137 million, up 46% to the same period of 2021 and up 4% for the same period of 2019. We achieved comparable hotels adjusted hotel EBITDA margin of 40% and up $100 million from operations was $111 million or $0.48 per share, in line with second quarter 2019 results. Given our outperformance since the onset of the pandemic, the strength and flexibility of our balance sheet and the additional borrowing capacity under our amended credit facility, we are incredibly well positioned with just 3.7x net debt to EBITDA, extended and staggered maturities, a relatively young portfolio and over $700 million in current total liquidity, we are able to be both patient and flexible as we work to capitalize on potential dislocations in the market. As we look at demand segments and business transient trends, travel patterns are beginning to normalize with 56% of our portfolio produced RevPAR above pre-pandemic levels during the quarter with improvement in demand impacting nearly every market. Other top producers included our hotels in Atlanta, Gainesville, our portfolio has benefited from continued strength in leisure demand with improvements in business transient and group further lifting overall results and enabling us to produce RevPAR slightly higher than 2019 for the quarter lifting performance in a growing number of markets and providing us with meaningful upside for our portfolio. Other accounts moved from 27% in the first quarter continued growth in business demand and group was 16% for the quarter, in line with the first quarter and slightly higher than the second quarter of 2019. Strong rate growth and effective cost control despite the challenging labor and hotel EBITDA of approximately $137 million and comparable adjusted hotel EBITDA margin of approximately 40%, up 10 basis points for the second quarter of 2019. Following similar trends, MFFO also improved sequentially each month and was approximately $111 million or $0.48 per share for the second quarter, up 74% compared to the second quarter of 2021 and in line with the second quarter of 2019. As of June 30, 2022, we had $1.4 billion in total outstanding debt, approximately 3.7x our trailing 12 months EBITDA with a weighted average interest rate of 3.6% and availability under our Total outstanding debt, excluding unamortized debt issuance costs and fair value adjustments is comprised of approximately $366 million in property-level debt secured by 22 hotels and approximately $1 billion outstanding on our unsecured credit facilities. We repaid and sold the $56 million note payable related to the purchase of the fee interest in the land at our Seattle Resonant In, and we repaid 6 property level secured more in July, subsequent to quarter end, we amended and restated our existing $850 million credit facility, increasing the borrowing capacity to approximately $1.2 billion, extending maturity dates and achieving improved pricing across the facility."
}