{
    "symbol": "APLE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 13:16:06",
    "content": " With comparable hotel’s total revenue up more than 70%relative to the first quarter of 2021, we achieved comparable hotels adjusted hotel EBITDA margin of 34% despite weaker occupancies early in the quarter, adjusted EBITDAre of $78 million and modified funds from operations of $63 million or $0.28 per share. For the quarter, 33% of our hotels achieved RevPAR at or exceeding 2019 levels, even without a full recovery in business transient, which has historically represented more than half of our total revenue mix and despite reduced travel during the quarter related to the Omicron variant. We are optimistic about the remainder of the year, especially our seasonally strong second and third quarters, as preliminary April results show continued increases in occupancy, ADR and RevPAR pushing past 2019 RevPAR level, a meaningful milestone for our portfolio. As Justin mentioned, 33% of our hotels had RevPAR for the quarter exceeding the same period in 2019, a decrease from the fourth quarter of 2021 due in part to the impact of the variant in January and February. Looking at total room nights booked, GDS bookings increased 36% in the first quarter over the fourth quarter another positive data point as we review business transient trends. Our team's persistent efforts to control costs and maximize profitability resulted in first quarter, comparable adjusted hotel EBITDA of approximately $88 million and comparable adjusted hotel EBITDA margin of approximately 34%, down 250 basis points to first quarter of 2019. While lower occupancy in January and February, combined with continued supply chain challenges and wage and inflationary pressures, negatively impacted margins, relative to 2019 early in the quarter, hotel EBITDA margin improved with occupancy sequentially and March finished approximately 190 basis points higher than March of 2019. Although, external economic and pandemic-related factors continue to add a layer of uncertainty, with the ongoing strength in leisure demand and increase in business transient demand and a demonstrated ability to achieve meaningful rate growth as occupancies improve, we believe our portfolio could continue to reach and potentially exceed 2019 RevPAR levels, if current trends continue. I think where we're most encouraged is that the teams have done such a great job our hotel managers have really worked hard consistently and haven't let up to try to drive profitability, coupled with the ability to increased rate as we shift business and our shift mix in our hotels and increased occupancy levels, as we have in the past peak night midweek. I think looking for update our portfolio and where we have outperformed over the past several months and where we've underperformed and the likely trajectory of those markets, combined with what we anticipate will be a continued evolution in the recovery of business travel."
}