{
    "symbol": "GRBK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 17:15:02",
    "content": " As shown on slide 12, and 13 communities that have been delayed in the DFW area are more periphery locations, while the majority of our land book in DFW and Atlanta or in infill locations, we've projected our land and lot development spending will decline approximately 45% next year from full year 2022. So about 60% of the quarter-to-quarter increase from 8.2% to 10.9% was that function of math, just having a bigger denominator versus your costs, because cost excluding commission's were in about the same other than the other 40% about a 1% Delta related to a cumulative year to date incentive comp adjustment, an increase for the kind of year that we're having. So that's why I think that maybe, may is the operative word, be opportunities in 2023 purchasing a private builder for the first time, because I think you're going to see optimism revert to realism and pricing adjust accordingly, the perfect scenario would be defined a private builder that fits our culture, and more importantly, fits our economic hurdle rates in a south or southeastern market. Not just us but the whole industry to say, where it's costing close to 2000 -- $200,000 a house to build and we think we can beat those down in 150 to 175 range, and really deliver, as Jim pointed out a much cheaper product at a very industry standard, historically nice gross margin of 25%, 26%. Now, if I could ask one more, some builders have said that they plan on maintaining a certain sales pace, let's say three or four months, and that they're just going to keep finding the market clearing price. And if we start whittling them down 10% to 20% per line item, we're going to see some really, a totally different cost structure, then these homes that we started back in March and April this year that are now closing over the next 30 days, or sorry, next 30 to 120 days. So transitioning from an old community to a new community or transitioning to modify the number of superintendents that you've got is certainly the cost related to our field overhead is going to be variable over the next six to 12 months, just based on what we see from a sales standpoint, because we're measuring our starts based on our sales pace."
}