{
    "symbol": "AGTC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-14 13:01:03",
    "content": " Before we get started, I would like to remind everyone that during this call, AGTC may make forward-looking statements, including statements about the company's financial results, financial guidance, its future business strategies and operations and its product development and regulatory progress, including statements about the timing and outcomes from data expected in its SKYLINE and VISTA trials and the type of data that may support registration and potential approval. Key accomplishments in our XLRP program included reporting additional data from the ongoing Phase 1/2 clinical trial of AGTC-501, our XLRP gene therapy candidate and completing enrollment in the SKYLINE trial. Importantly, based on the data generated to date, we intend to advance our AGTC-401, our product candidate for patients with a CNGB3 gene mutation that causes achromatopsia into the next stage of clinical development pending feedback from an End-of-Phase 2 meeting with the U.S. Food and Drug Administration, or FDA, expected in the first half of this year. Based on these data, we believe that AGTC-401 has best-in-class potential for the treatment of achromatopsia B3 and we look forward to sharing information in the first half of this year on the next steps in clinical development following our end of Phase 2 meeting with the FDA. Furthermore, we are seeing evidence of a continued durability of response up to 24 months after treatment based on data from a subset of patients in the Phase 1/2 trial, who have reached this time point. As many of you are aware, SKYLINE is a multi-site masked Phase 2 expansion of the ongoing Phase 1 study in which patients are randomized to either a high or low dose of AGTC-501 with the primary objective to identify the proportion of treated eyes that demonstrate improvement from baseline in measures of visual sensitivity and visual acuity as well as the patient's ability to navigate a mobility maze with changing obstacles and under varying like conditions. Importantly, this is our first clinical trial that has the potential to demonstrate a correlation between visual sensitivity and/or visual acuity with maze outcomes, a new functional endpoint also added to the VISTA Phase 2/3 clinical trial. Based on the body of safety data from our Phase 1/2 clinical trial, we have confidence that SKYLINE safety outcomes will continue to show that our XLRP candidate is generally safe and well tolerated. Data to date from the Phase 1/2 trial have demonstrated a 50% response rate in higher dose groups when including patients who meet the entry criteria for the SKYLINE and VISTA trials, and the VISTA trial is powered to show a statistically significant difference at a 50% response rate. Finally, while we are assessing changes in macular structure in the SKYLINE trial, we do not believe based on data from the Phase 1/2 study that we will see any consistent changes in structure at the three-month interim analysis as this time point is too early to capture these changes. If the three-month interim data achieved these expectations, we believe we will have significantly derisked the VISTA clinical trial which together with data from both the Phase 1/2 study and the SKYLINE Phase 2 expansion study is intended to support a BLA filing. As we have previously discussed, EZ degeneration and loss over time is a hallmark of XLRP and we've shared data from the Phase 1/2 trial, demonstrating a significant association between improvements in visual sensitivity measured by MAIA and improvements in retinal health, measured by improvement in EZ in Groups' four to six. However, as we have stated previously, we believe that given this is an orphan indication that an approval will likely be based on the totality of the data including the mean improvement in visual sensitivity over the entire treated area, supportive improvements in visual acuity and structure, a favorable risk-benefit profile and improvement in patient reported outcomes or PROs. At the time of the first Vista interim analysis, we expect to have 12-month SKYLINE data and 24-month data from the Phase 1/2 clinical trial, which will enable us to have a robust data package to review."
}