{
    "symbol": "AGTC",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-09 12:54:06",
    "content": "  Before we get started, I would like to remind everyone that during this conference call, AGTC may make forward-looking statements including statements about the Company's financial results, financial guidance, its future business strategies and operations, and its product development and regulatory progress, including statements about its ongoing and planned clinical trials and preclinical programs. This includes 12 months data from patients in the 2 highest dose groups in this trial, demonstrating a 50% response rate among patients who meet the inclusion criteria for the ongoing skyline and vista trials, as well as improvements in visual acuity across a wide range of patients that provide supportive evidence of biological response. As a reminder, we believe that our Skyline and Vista trials will be successful if we are able to demonstrate the same 50% response rate as we did in patients in the ongoing Phase 1-2 trial that meet the inclusion criteria in assuming that we see a favorable safety profile. In September, our clinical collaborator, Dr. Paul Yang, Assistant Professor of Ophthalmology at the Casey Eye Institute, presented data from a 12-month analysis of Macular Structure using optical coherence to evaluate patients in the Phase I/II XLRP Trial. Based on the totality of the data generated to-date, improvements in visual sensitivity, improvements in visual acuity, positive patient anecdotes, and Dr. Yang's observations of improvements in macular structure, we believe that our XLRP Gene Therapy may provide meaningful and durable benefits to patients. I'm pleased to join my first call as AGTC's Chief Medical Officer and I'm excited to have the opportunity to share several positive updates for both of our  As Sue mentioned, Dr. Paul Yang presented promising new data from the ongoing Phase 1-2 XLRP clinical trials, at the 14th International Symposium on retinal degeneration in September. As Sue also mentioned, we are actively enrolling and dosing patients in both the Skyline and Vista trials, and expect to report multiple datasets from these trials in 2022, including 3-month Interim Skyline trial results in the first half of 2022, 24-month trial results from the ongoing Phase 1-2 clinical trial in the third quarter of 2022. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions."
}