{
    "symbol": "VERO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 14:51:24",
    "content": " While the expected shift towards cash sales has an impact on our total revenue expectations for 2022, the improvement in our cash flow conversion in the second half of '22 justifies our efforts in this area. The prior year period also included a $2.8 million non-cash gain on forgiveness of government assistance loans, which did not benefit our GAAP OpEx in the second quarter of 2022. Excluding the impacts of bad debt expense and recovery in both periods, as well as the non-cash gain last year, our non-GAAP operating expenses increased $1 million or 4% year-over-year. We now expect GAAP operating expenses of approximately $95 million to $97 million for the full year 2022 compared to our prior guidance, which had assumed GAAP OpEx in the range of $98 million to $101 million. The company now expects total revenue for the 12 months ending December 31, 2022, in the range of $110 million to $113 million, representing an increase of approximately 4% to 7% year-over-year compared to total revenue of $105.6 million for the 12 months ended December 31, 2021. First, our updated total revenue range reflects the following, the largest driver of the change in our guidance range, representing roughly two thirds of the total revision comes from our strategic initiative to drive more cash flow from the sale of our systems, specifically in shifting our revenue mix towards cash sales versus subscription sales. As Dom mentioned earlier, while the expected shift towards cash sales has an impact on our total revenue expectations for 2022, the improvement in our cash flow conversion in the second half of 2022 justifies our efforts in this area. The remaining one third of the revision to our 2022 revenue guidance range comes from the combination of the softer-than-expected sales results in the second quarter and the impact of our strategic initiatives to streamline our global operations, specifically the transition from a direct to distributor based sales model in certain international markets during the second half of 2022. It also reflects the early benefits of the strategic initiatives we have implemented to streamline our global operations, which we estimate together represent roughly $5 million to $6 million of savings over the second half of 2022. And that combined with the OpEx cuts that we're making in the second half of between $5 million and $6 million, we should render us profitable in that fourth quarter based on of revenue and our gross margins in around 67%."
}