{
    "symbol": "VERO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-27 13:11:10",
    "content": " Our revenue base is well diversified across our current portfolio of products with nearly two-thirds of the company's total revenue in 2022 coming from key energy based medical device, aesthetics, system sales of Versa, Legacy, Velocity, Bliss, and Bliss Max and the industry leading minimally invasive Robotic Hair Restoration platform, ARTAS iX. We believe that our newly defined strategic plan positions us to deliver positive cash flow from operations in the second half of 2024 and GAAP operating profitability and single-digit adjusted EBITDA margins on a full-year basis in 2025, driven by prudent expense management, strong contributions to our total revenue growth from robotic system sales increasing at a 40% CAGR over the next three years and sustained performance in our energy based portfolio. The percentage of total systems revenue derived from the company's subscription model was approximately 29% in the fourth quarter of 2022, compared to 40% in the prior year period. Specifically, fourth quarter working capital performance was driven by 8.4 million of cash from the combination of lower DSOs as we prioritize cash sales versus subscription sales, lower inventory investment, and reductions in advances to suppliers, which were partially offset by increases in cash used to lower payables â\u0080\u0093 due to lower payables and higher accrued expenses as compared to our working capital performance in the third quarter of 2022. The company expects total revenue for the 12-months ending December 31, 2023 and the range of 90 million to 95 million, representing a decrease in the range of approximately 9.5% to 4.5% year-over-year. This revenue mix shift is expected to result in a decline in lease revenue of approximately 16 million, offset partially by the expected growth in sales of cash systems, which we expect will increase in the high teens year-over-year. The 2023 GAAP operating expense guidance range also includes approximately 10.3 million of non-cash expenses, compared to approximately 13.9 million for fiscal year 2022."
}