{
    "symbol": "VERO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 21:33:11",
    "content": " Specifically, excluding our VeroGrafters program revenue, sales in our growth franchises increased 19% year-over-year in Q1 fueled by Salesforce focus and execution continued with strong demand for artists iEX robotic systems, and the early clearance and initial commercial launch of our Bliss Max in March. Given Dom's detailed review of our revenue results, I will begin with a review of our financial performance across the rest of the P&L for the avoidance of doubt unless otherwise noted, my prepared remarks will focus on the company's reported results for the first quarter of 2022 on a GAAP basis, and all growth related items are on a year-over-year basis. First quarter operating expense growth reflects the strategic investments we're making to support our key growth initiatives including our commercial launch of the Bliss Max, and our development, regulatory and clinical programs for AIme, we continue to expect GAAP operating expenses in the range of $98 million to $101 million for the full year 2022 periods. The company continues to expect total revenue for the 12-months ending December 31 2022 in the range of $126 million 230 million, representing an increase of approximately 20% to 23% year-over-year, compared to total revenue of $105.6 million for the 12 months ended December 31 2021. Specifically, we expect GAAP operating expenses in the range of $98 million to $101 million, representing growth of 10% to 13% year-over-year, compared to our total revenue growth range of 20% to 23% this year. First, we continue to expect our body franchise to be a material driver of total company growth this year, fueled by commercialization of our Venus Bliss and OUS markets, and the commercialization of our Venus Bliss Max in the U.S.  We do expect growth in our body franchise to be stronger over second half of 2022 given the timing and expected ramp from our recent reduction of the Bliss Ma. We intend to update the investment community on the potential contributions from the initial commercial release of AIme following the receipt of 510(k) clearance  While AIme is not expected to materially impact our 2022 growth, it is fair to assume that we will be highly focused on ensuring that we are well prepared to execute our commercial strategy for this highly differentiated robotic technology as soon as possible following receipt of regulatory clearance, and what expecting me to be a material contributor, or a total company growth getting in fiscal year 2023 and beyond. Bliss Max was a key driver with 60% growth with our body franchise, we continue to expand our KOL install base in body and we expect the growth to continue based on the initial market acceptance of the only platform that addresses fat skin and muscle. Our 2022 total revenue outlooks continues to assume that more than 75% of our total revenue growth year-over-year comes from two key growth franchises specifically our body franchise, which includes systems and procedure revenue related to the Bliss Max and Venus Bliss products and our hair restoration franchise which includes systems and procedure related revenue for our ARTAS and NeoGraft products."
}