{
    "symbol": "MWA",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-03 15:03:04",
    "content": " Our consolidated net sales increased 15.6% to $314.8 million compared to the prior year, with growth in both Water Flow Solutions and Water Management Solutions. However, gross margin of 29.6%, decreased 260 basis points compared with the prior year as benefits from higher pricing were more than offset by increased cost associated with unfavorable manufacturing performance, inflation and lower volumes. Selling, general and administrative expenses of $62.9 million in the quarter, increased 11.7% compared with the prior year. Operating income of $34 million, increased 17.6% in the quarter compared with $28.9 million in the prior year. Adjusted EBITDA of $44.2 million, decreased 6.9% in the quarter, leading to an adjusted EBITDA margin of 14% compared with 17.4% in the prior year. Net sales increased 6.9% compared with the prior year, primarily due to higher pricing across most of the segment's product lines. Adjusted operating income of $19.6 million, increased 70.4% in the quarter, benefits from higher pricing and volumes more than offset increased costs associated with unfavorable manufacturing performance, primarily at our foundry operations, inflation and additional SG&A expenses. Adjusted EBITDA of $26.6 million, increased 38.5% in the quarter, leading to an adjusted EBITDA margin of 17.8% compared with 16.4% last year. Net cash used in operating activities for the quarter ended December 31, 2022, was $6.5 million compared with $19.8 million of net cash provided by operating activities in the prior year. Average net working capital using the 5-point method as a percent of net sales increased to 28.2% compared with 25.4% in the first quarter of last year, primarily due to higher inventory levels. Free cash flow for the quarter was negative $16.4 million compared with positive $8.8 million in the prior year, primarily due to the decrease in cash provided by operating activities, partially offset by lower capital expenditures. We expect our adjusted EBITDA will increase between 10% and 14% as compared with the prior year, primarily driven by benefits from higher price realization and operational improvements in the second half of the year. As we work through our 2023 and certainly consistent with the guidance that we have reiterated with respect to full year free cash flow being in the 40% to 60% of our adjusted net income, that improvement year -- through the year, we expect to be largely driven by working capital improvements and that's going to come from inventory turn. So I'm going to say, as we -- as our production teams are focused on improving the lead times, as Scott just talked through, lowering the backlog levels, particularly with the short-cycle products that we've had and with the outsourcing, I think that as you -- we've had more of that philosophy of we're going to bring any inventory in the needed parts just in case rather than just in time, all the supply chain disruptions. So we're still not accretive to inflation over the entire cycle going back to 2020 but we expect that we will be back to breakeven on the dilution effect at 20 -- sometime this year if the price that's trapped in the backlog and the throughput assumptions we have in there, we'll kind of get back the price piece sometime in 2023. I guess to simplify that progression, it would be getting back to recovering margin price/cost this year, stamping out inefficiencies into next year and then allowing for the read-through of the projects once you are past completion and at that full run rate, driving the -- I think it's $30 million or so in benefits that you've called that would be '24 into '25. What I do think normalization looks like though is that what we call the short-cycle business, the smaller gate valves, let's call them 4 6 8s and the 5.25% Super Centurion or the couple of the wet barrel size hydrants, those have to get inside 2 weeks because that has to be the rapid turn for the channel. And so if you look at what's happened with price, so you take your baseline going in and you add -- I'm making this up, don't take this by 30% to 40% of the increase in inventory that you've seen in the channel is just price driven. I think in the first quarter, total material cost inflation, keep me right here, Martie but -- it included purchase price remains elevated and was somewhere around 8% year-over-year versus approximately 14% a year ago, while negative impact of inflation improved sequentially."
}