{
    "symbol": "KOP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 16:21:40",
    "content": " 07:08 On Slide six, consolidated sales for the first quarter of 2022 were $459 million, an increase of nearly $52 million or 13%, compared with $408 million in the prior year. Sales for Performance Chemicals increased by $13 million or 10%, while sales for CM&C increased by $48 million or 52% compared to the prior-year quarter. 07:37 On Slide seven, we see that first quarter adjusted EBITDA on a consolidated basis totaled $53 million or 11.5%, compared with $55 million or 13.5% in the prior year. Sales for RUPS were $183 million, compared to sales of $192 million in the prior-year quarter, primarily due to lower utility pole volume in the U.S. and Australia, along with lower sales volumes for crossties for both Class 1 and commercial railroads, partly offset by pricing increases and higher maintenance of way demand. 08:58 As shown on Slide nine, PC had record first quarter sales at $136 million, compared to sales of $124 million in the prior-year quarter, driven by price increases and higher volumes for preservatives. CM&C delivered adjusted EBITDA of $20 million, compared to $10 million in the prior year as a result of a favorable demand and pricing environment, partly offset by higher selling, general and administrative, as well as raw material costs. 26:31 And then also, while we're working on product development projects that are designed to increase sales and profitability, which include: improving pitch yields from tar from 50% of production to nearly 70%, which I mentioned previously as a component of the $8 million benefits in 2022, and enhanced carbon products used as a coatings for battery anode materials. 27:06 On Slide 30, our sales forecast for 2022 is approximately $1.9 billion, compared with $1.68 billion in the prior year to reflect a projected topline improvement in every business segment, largely driven by higher prices. Despite the impact on supply from the Russia-Ukraine conflict, we believe its strong market dynamics can still support an environment that results in EBITDA that is relatively close to last year's performance as we are currently projecting CM&C to finish at around $70 million or $6 million below last year."
}