{
    "symbol": "KOP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 18:52:04",
    "content": " Consolidated sales of $483 million, a quarterly record, increased by $77 million or 19% compared with $405 million in the prior year. In addition, we generated adjusted EBITDA of $52 million, which was a record quarter compared with the prior year quarter of $49 million in EBITDA. Adjusted EBITDA was $228 million, reflecting a record year on profitability exceeding 2021 results of $223.5 million, and it's the eighth straight year-over-year improvement in EBITDA, excluding the since divested KJCC operations. Adjusted earnings per share were $4.14, just shy of our 2021 record results of $4.21 and we generated operating cash flow of $102 million, the fourth straight year over $100 million and seventh year out of the last eight. But during the year, we also paid out our first dividend since 2014, a total $4 million throughout the year, we spent $24 million in share repurchases at an average price over 20% lower than where we've traded on average in the early part of 2023. On Slide 12, as Leroy said, our fourth quarter consolidated sales were a record $483 million, up 19% compared to the fourth quarter of 2021. By segment, RUPS sales increased $37 million or 24% from the prior year quarter. As shown on Slide 13, Koppers also delivered record consolidated sales for full year 2022 at $1.98 billion, an increase of $300 million or 18% over the prior year. Sales for PC increased by $77 million or 15%, and CM&C sales increased by $157 million or 37.5% compared to the prior year. By segment, for the full year, RUPS generated EBITDA of $54 million or 7%, the PC segment had EBITDA of $76 million or 13%, and CM&C had EBITDA of $99 million or 16%. On Slide 16, RUPS had record fourth quarter sales of $193 million compared with prior year sales of $156 million for the fourth quarter. On Slide 17, PC had record fourth quarter sales of $141 million, up from $119 million in 2021 as a result of higher volumes in the Americas and price increases implemented globally, offset in part by volume decreases in Europe and Australasia. CM&C adjusted EBITDA was $21 million compared with $25 million in the prior year quarter, reflecting higher raw material costs and other operating expenses, offset in part by a favorable pricing environment."
}