{
    "symbol": "KOP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 15:48:06",
    "content": " On Slide 9, we had record consolidated sales of $536 million for the quarter, an increase of $111 million or 26% over the prior year and our third consecutive quarter of record sales. By segment, sales for RUPS increased by $21 million or 11%; sales for PC increased by $38 million or 33%; and sales for CM&C increased by $52 million or 43% compared to this quarter last year. On Slide 10, third quarter, adjusted EBITDA on a consolidated basis totaled $69 million or 12.8% compare with $54 million or 12.7% in the prior year. On Slide 11, sales for RUPS were $208 million compared to $187 million in the prior year with the increase being the result of higher pricing across all markets, especially crossties and utility poles, along with increased activity in our railroad bridge services business. Adjusted EBITDA for RUPS was $16 million compared with $11 million in the prior year as we saw improvements in our utility pole and maintenance-of-way businesses from price increases and favorable cost absorption, partly offset by higher raw materials and operating cost. Slide 13 shows third quarter sales for CM&C business of $175 million compared to $123 million in the prior year, on higher pricing across all product lines, partly offset by slightly lower volumes on non-pitch products. First and foremost, where the significant cost increases weâ\u0080\u0099ve experienced this year that have only been partly offset to date through the $46 million in price increases realized year-to-date. Now, through a combination of investments to take out costs and a series of price increases in the U.S., we were able to reach an all time high and quarterly profitability while also reaching double digits and quarterly margin for the first time and over the past five months, find ourselves on an annualized rate to exceed our highest profit year in this business by more than 50%. Now, moving to Carbon Materials and Chemicals or CMC as seen on Slide 28, this business has defied the odds this year by over becoming a reduction in raw material supply due to the Russian-Ukraine war and the pullback in traditional steel production, high energy costs that have curtail production in key aluminum markets and the stronger dollar that has eroded our strong foreign profitability as it gets translated to U.S. dollars. Turning to Slide 29, while we donâ\u0080\u0099t expect profitability like weâ\u0080\u0099re seeing this year in 2023, as some of these current market dynamics are bound to change, we also have other opportunities to drive profit improvement through our continued focus on petroleum enhanced products, create a volume increases through our PS production increases, create â\u0080\u0093 so price increases due to current pricing thatâ\u0080\u0099s well below market and enhanced carbon products increase our carbon pitch yields and eventually for electric vehicle battery coatings. Our U.S. income profile should improve considerably in 2023 with the expected increases coming from our U.S. based PC and RUPS businesses, while the international pieces of our CMC business are not expected to perform at 2022 levels coupled with a ninth straight expected increase in EBITDA next year, that should enable us to easily generate a new all time high in adjusted earnings per share. So now Iâ\u0080\u0099d say the next â\u0080\u0093 the next few years are still going to be in that $100 million range, but a third of that is the capital thatâ\u0080\u0099s getting spent to actually get us and move us from where we were at $211 million at the end of 2020 to this $300 million mark by the end of 2025."
}