{
    "symbol": "IPI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 15:40:06",
    "content": " And when comparing both figures to total sales of $271 million for the first 9 months of the year results in respective margins of 44% and 25%, both of which are among the highest in Intrepid's history. The strong financial performance has primarily been driven by high fertilizer prices with our average net realized sales price for potash and Trio coming in at $734 per ton and $488 per ton, respectively, in the third quarter as well as $718 per ton and $482 per ton, respectively, for the first 9 months of the year. For those tracking potash, it's no surprise that we've seen a moderate pullback in pricing in the past few months with key drivers being the preference for just-in-time purchasing in the agricultural markets and seasonally higher global inventories, which in turn drove lower third quarter market transactions. Crop pricing into the next year's harvest is also very strong with December 2023 futures for corn trading at roughly $6.25 a bushel, November 2023 soybeans in the high $13 per bushel range while September 2023 wheat futures are actually higher than current spot prices, trading at just under $9 per bushel. As Bob noted, high net realized sales prices for potash and Trio helped drive another strong quarter of financial performance for Intrepid despite sales volumes being slower to ramp up than we initially expected. In our potash segment, sales volumes in the third quarter totaled 46,000 tons, down from 62,000 tons in the prior year as distributors ended the 2022 spring season with more inventory than expected and buyers continue to focus on just-in-time purchases for potash. Total potash cost of goods sold per ton increased compared to the prior period as a slow start to fall sales led to more tons being sold from our HB facility, which carry a higher relative cost of sales. For now, we expect to sell between 45,000 to 55,000 tons of potash in the fourth quarter at an average net realized sales price per ton of $665 to $675. Sales volumes followed a similar trend as potash in Q3 with 39,000 tons sold, down from 46,000 tons sold in the prior year as carryover inventory and a preference for just-in-time shipments limited restock during the quarter particularly given the increased seasonality of our Trio products. We expect fourth quarter sales volumes to be between 35,000 and 40,000 tons at an average net realized sales price of $465 to $475 per ton. Through the first 9 months of the year, we've generated cash flow from operations of approximately $69 million even after repaying the approximately $33 million customer prepayment in the third quarter and we spent approximately $37 million on CapEx."
}