{
    "symbol": "RSKD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 13:08:18",
    "content": " I would now like to hand the conference over to your speaker today, Chett Mandel, Head of Investor Relations. My name is Chett Mandel, Riskified Head of Investor Relations. Riskified is hosting this call to discuss its second quarter earnings results for the period ended June 30, 2020. Participating on todayâ\u0080\u0099s call are Eido Gal, Riskifiedâ\u0080\u0099s Co-Founder and CEO; and Agi Dotcheva, Riskifiedâ\u0080\u0099s Chief Financial Officer. Earlier this morning, Riskified issued a press release announcing its financial results for the second quarter of 2022. A copy of this press release has been furnished with the SEC on Form 6-K. Before we begin, I want to remind you that matters discussed on todayâ\u0080\u0099s call will include forward-looking statements related to our operating performance, financial goals and business outlook, which are based on managementâ\u0080\u0099s current beliefs and assumptions, and are not guarantees of future performance. Please note that these forward-looking statements reflect our opinions as of the date of this call, and except as required by applicable law, we undertake no obligation to revise this information as a result of new developments that may occur. Forward-looking statements are subject to various risks, uncertainties and other factors, some of which are beyond our control that could cause our actual results to differ materially from those expected and described today. In addition, we are subject to a number of risks that may significantly impact our business and financial results. For a more detailed description of our risk factors, we encourage you to read Riskifiedâ\u0080\u0099s periodic and other SEC filings, where you can review a discussion of factors that could cause the companyâ\u0080\u0099s actual results to differ materially from these statements. I would also like to remind you that during the call, we will discuss some non-GAAP measures when talking about Riskifiedâ\u0080\u0099s performance. We use these non-GAAP financial measures for financial and operational decision-making, and as a means to evaluate period-to-period comparisons. We believe that these measures provide useful information about operating results, enhance the overall understanding of past financial performance and future prospects and allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making. You can find a reconciliation of those non-GAAP measures to the nearest comparable GAAP measures in the earnings press release issued and furnished on Form 6-K today and in our prior filings with the SEC, all of which is posted on our website at ir.riskified.com. I will now turn the call over to do Eido Gal, Riskifiedâ\u0080\u0099s Co-Founder and CEO. Since the year started, I have been and remained very confident in our go-to-market strategy, the traction with our pipeline of new and existing clients, our strong financial position and our ability to optimize our expense base through careful cost saving measures as we will further discuss on this call. We continued our positive momentum from the first quarter with another strong quarter, having achieved quarterly revenue of $60 million, up 8% year-over-year. In the face of the current macro economic landscape, I am pleased that we were able to continue to increase the amount of gross merchandise volume that we reviewed with 25 billion reviewed during the quarter, up 18% year-over-year. Overall, for the first six months of the year, our business continues to perform well and we generated exceptional outcomes for our merchants, while continuing to grow, capture market share and scale our platform. The good news for Riskified is that in times like these, we have the ability to help merchants solve this problem through increasing conversion rates, while simultaneously decreasing their fraud-related expenses. We believe that the ROI that we can offer to-date is even more compelling and itâ\u0080\u0099s a much stronger value proposition than non-guaranteed decision, which canâ\u0080\u0099t address these same problems. Proof of the continuing success that we are having with our merchant was seen in our revenue growth during the quarter, which was primarily driven by new merchants revenue added in the past 12 months and upsells within portions of our existing customer base. With the addition of these new merchants, we continue to see our top merchant concentration decrease as a percentage of total to reflect a more balanced portfolio. In addition, we continue to be well-diversified across verticals and geographies. In fact, our top 10 new merchants in the quarter were spread across five different industry areas and three separate geographies. Overall, Iâ\u0080\u0099m very encouraged by our first half performance and our ability to execute on the goals that we set for ourselves at the beginning of the year. In order to accomplish this and to help accelerate our path to profitability, we recently reevaluated a number of areas in our expense base, which we will further discuss on this call. As part of this process, we came away with a clear plan, lower hiring pace, a deeper understanding of where to prioritize our investment dollars and how to limit incremental spend, while finding opportunities to reduce our overall cost structure. But before that, I want to reiterate a few key points on our ability to deliver long-term value for our merchants and shareholders. First, I continue to believe that the overall addressable market is large and growing, despite a recent general slowdown in some areas of the global economy. Within this larger universe, we are a clear market leader of fraud solutions. We believe that we have a superior data advantage to enable the best outcome and operational improvements for our merchants, which is recognized throughout our relationships with many of the worldâ\u0080\u0099s largest and highest quality merchants. Second, the stickiness of these relationships is seen through an incredible over 99% customer retention rate. Third, I am excited to partner with Riskified the President of Worldwide Field Operations, Ravi Kumaraswami on our go-to-market strategy. Fourth, through our very strong balance sheets and financial position, we believe that we have the financial flexibility to pursue profitable growth. And finally, I believe that we have a tremendous asset and the fact that we have operated the company in a profitable manner in prior periods and we know the levers to pull and processes to prioritize in order to get back. Thank you, Eido, and thank you everyone for joining todayâ\u0080\u0099s call. As Eido mentioned, our GMV for the second quarter was $25 billion, reflecting an 18% year-over-year increase. We also achieved record second quarter revenue of $60 million, up 8% year-over-year. The growth in GMV and revenue during the quarter was primarily driven by the continued expansion of our platform across new merchants and ourselves, and further penetration across industries and geographies. During the second quarter, we enjoyed ongoing growth across our emerging categories and continue to benefit from sustained growth across other categories like fashion and luxury goods and electronics. Alongside the positive traction weâ\u0080\u0099re seeing in the business, some of our more mature merchants declined year-over-year due to softening global ecommerce activity and other macroeconomic factors, such as the easing of COVID restrictions, easy to rising interest rates and supply chain issues. From a geographic standpoint, while we saw ongoing softness in the U.S., particularly in the stay-at-home category, we continue to have momentum outside of the U.S., with the strength in EMEA following the recovery of tickets and travel, and through the addition of new merchants, and once again in APEC, which is an important and growing market for us. Continuing with gross profit margin, as weâ\u0080\u0099ve mentioned in the past, gross profit margin is a metric that is best analyzed on an annual basis, as individual quarters can fluctuate mainly due to the changes in the industry mix of our billing, seasonality factors, the ramping of new merchants, the varying risk profiles, transactions approved and other business priorities. Total non-GAAP operating expenses for the second quarter were $44.6 million, up 39% year-over-year. During the second quarter, we initiated a plan to efficiently and thoughtfully reduce our operating expenses. The investments that we made in 2021 through 2022 were instrumental to help our growing merchant base, manage a broader range of high value use cases and enhance our ability to support our new geographies. Going forward, in order to match the additional level of investment to the opportunities in the current macro environment, we undertook a widespread evaluation of our overall expense base and identified key areas of cost optimization. As a result of this process, we successfully identified areas of public improvement, which in total to generate savings of at least $10 million in 2022. For the remainder of 2022, we expect to slow hiring to only the most strategic and high impact areas of the company. Some other areas including optimizing so consistent through negotiation of long-term contracts and usage, evaluating non-essential marketing spend and identifying processes to increase the productivity of our current internal team. We believe that weâ\u0080\u0099ll be able to reduce spend in these areas, while keeping our long-term plans for growth intact. We successfully decreased our adjusted EBITDA loss from our previous guidance, and are excited and confident about our more aggressive trajectory to profitability. In addition, free cash flow was negative $13.3 million for the second quarter and negative $23.3 million for the first six months of the year. Moving to the balance sheet, we maintain a very strong liquidity position, which we anticipate to be more than sufficient to support the investments weâ\u0080\u0099re contemplating as we aim to move towards profitability. And now turning to our updated guidance outlook for 2022, for the full year of 2022, we are revising upward our guidance ranges that we introduced in late February and that we will reaffirm last quarter. For the full year 2022, we now anticipate revenues will be between $255 million and $258 million up from our previous guidance of $254 million to $257 million. The updated revenue guidance assumes currency rates against the USD remain stable to current levels and we will monitor other macroeconomic factors such as supply chain issues, inflation and the broader e-commerce environment. In terms of quarterly pacing, we expect our third quarter revenue to maintain strength in ticket and travel, and the fourth quarter to reflect the seasonal softness this broader e-commerce and retail uncertainty that may proceed during the holiday shopping season. For modeling of 2022 annual EPS, we expected a weighted average share count of approximately 157 million. Overall, weâ\u0080\u0099re pleased with our second quarter and first half results, and we remain excited about our continuous prospects for long-term growth. We are encouraged by our ongoing success with the merchantâ\u0080\u0099s reopening trends in the tickets and travel industry, and the contributions from our global go-to-market investments. Operator, we are ready to take the first question, please. Nice solid performance here in 2Q and then also the higher outlook, so nice job on that. Could you kind of double click though in 2Q, because you do have some large customers there, but was it broad based across kind of the whole universe of your T&T customers and was it more existing customers, just really having their business perk up or did you have some newer ones that were coming online also that affected the tickets and travel? Terry, thank you for the question. So since the second half of last year, we have been seeing strong performance in tickets and travel clients with many returning itâ\u0080\u0099s pre or above pandemic level, more or less. And additionally, as you just mentioned, we have been adding merchants in this area and expanding with existing merchants. And regarding Q3, overall, weâ\u0080\u0099re optimistic, but also cautiously observing these trends into the later quarters, because of the year just to see how the momentum kind of goes on. And then just the second question, itâ\u0080\u0099s nice to see the faster pace to profitability. And the second part of this is, Ravi is on Board. So, yeah, weâ\u0080\u0099re definitely very happy and excited about that reevaluation that resulted in an accelerated path to profitability. I think we could do more with less headcount, just optimizing systems, processes and costs, so becoming a bit leaner, while keeping the long-term trajectory intact. And as we kind of progress throughout the year and get closer to guy for 2023, we can talk about how that would impact those numbers. With Ravi, weâ\u0080\u0099re incredibly excited to have him on Board. I think, Ariba kind of led him to go-to-market functions there and the success heâ\u0080\u0099s had over there. And most recently, he was CEO of a company called Crownpeak and he was really able to drive profitable growth. And I think we both feel that with this updated plan, he definitely has the tools he needs to go out and achieve success in the market. I was curious if youâ\u0080\u0099re changing your risk appetite at all, given some signals of potentially a weaker consumer and what that might mean for your financials, if thatâ\u0080\u0099s the case. Iâ\u0080\u0099m asking because weâ\u0080\u0099ve heard this earning season a shift towards credit, for example, and some credit tightening with some of the different players. I know that, obviously, the gross margin and whatnot was great. Well, thatâ\u0080\u0099s a great question. I think really what we did to give a few examples to make it a bit more concrete, right, letâ\u0080\u0099s say, thereâ\u0080\u0099s a new geography weâ\u0080\u0099re going after. Ramsey, thank you for the question. So I think what we mentioned in the past, we were at around 2%, but itâ\u0080\u0099s -- just when COVID hit, but that was also partly driven of the shrinking of the industry. And as I just mentioned earlier, on one hand was seeing the recovery and just on that face, we see most of our merchants, and of course, thereâ\u0080\u0099s variability between different ones, but most of them are pre-pandemic levels, some are still below. But overall as a cohort, as a group, we think that they are somewhere at or above. And separately, the other part is, weâ\u0080\u0099ve been adding new logos and new merchants and I think this is like a very important driver to continue to expand in this category. And a follow up from me is, I just wanted to ask about the sales pipeline. I was just curious, just, A, for an update on the sales pipeline, but, B, is the macro environment having an impact on decisioning. Ramsey, so we feel very excited and happy with the performance of the go-to-market teams in the first half and really good about the pipeline entering the second half. I think that the current macro environment is helping our messaging resonate more and more with merchants, because remember, weâ\u0080\u0099re guaranteeing in cost savings, while driving incremental sales. I wanted to just ask a, I think you made the comment something along the lines of like, this isnâ\u0080\u0099t a one-time reduction, but something that should benefit you guys going forward and it doesnâ\u0080\u0099t change the long-term growth trajectory. And then a follow-up question, I just wanted to ask about distribution strategy after the recent FIS partnership with a competitor. Now when we think about kind of how do we attack the lower tier, itâ\u0080\u0099s definitely something that, these various partnerships could be helpful with and I know that Ravi, heâ\u0080\u0099s kind of ironing out the overall go-to-market strategy and plan. Number two, I think, itâ\u0080\u0099s a great validation of the chargeback guarantee model in the market, which we continue to benefit from. Maybe first question, Dylan . So to answer the second part first, if I think about the market share, as I said, we are expanding both through existing customers, but also adding new. I donâ\u0080\u0099t have the exact numbers on top of my head, but itâ\u0080\u0099s a very nice meaningful growth overall compared to last year. So weâ\u0080\u0099re very diversified and if I look at all the trends that are impacting our portfolio of merchants, Iâ\u0080\u0099ll probably not call out this one as a major one. This is a trend that is much more prevailed and heâ\u0080\u0099s a good driver and that weâ\u0080\u0099re seeing some of the kind of the stay-at-home merchants and some of their reports, as well as the public companies, theyâ\u0080\u0099ve shown like a tough year-over-year comparison as well and if the trend of continuing to decline. And in terms of discretionary and non-discretionary, as I said, I donâ\u0080\u0099t think thereâ\u0080\u0099s anything meaningful to impact to kind of report on anything different from last quarter. So, actually, over the past year, weâ\u0080\u0099ve seen a lot of traction and movement in the ticket and travel space, as weâ\u0080\u0099ve helped them streamline and automate their operations in a very scalable way. And now that volumes are picking up, weâ\u0080\u0099re really seeing that and enjoying that. And definitely, as weâ\u0080\u0099re seeing more and more success, weâ\u0080\u0099re able to improve performance for everyone within our network, especially within tickets and travel domain. We mentioned that, weâ\u0080\u0099re on a runway to do $100 billion plus guarantee GMV, that puts us certainly the largest guarantee vendor, but also one of the largest vendors in that space. So itâ\u0080\u0099s -- yes, itâ\u0080\u0099s a competitive moat like you mentioned. And then, Agi, as you just think about some of the cost improvement you now have put in place in the model. If I think of some of the areas that weâ\u0080\u0099ve looked into, which is kind of starting with some of the modifying of the current frame, but also looking efficiency across a number of processes and tools that we use, I think, itâ\u0080\u0099s a very meaningful and very exciting step and step forward and which accelerates our path to profitability. Thereâ\u0080\u0099s always areas well continue to sharpen our pencils, we continue to progress. Question, I think, I mean, your target growth rate was has been 25% to 30%, with a combination of 10% to 15% e-commerce growth, 15% growth in new logos, does still -- what is your, I mean, thereâ\u0080\u0099s a lot of discussion and disagreement around the e-commerce growth rate over the long-term. So, look, weâ\u0080\u0099re really happy with the performance in the first half and the second quarter similar to the first quarter, most of kind of the game was driven by net new logos and upsells to our existing clients. Well, I think, we know, weâ\u0080\u0099ve run the business on a profitable basis before and we know that different levers to pull in order to get there. We want to be thoughtful as we think about 2023 over the next few quarters and once we do that, weâ\u0080\u0099ll be happy to share kind of more updates and a better guide. So, with that, Iâ\u0080\u0099ll hand the call back over to Eido for closing remarks."
}