{
    "symbol": "DSEY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 13:25:05",
    "content": " Adjusted EBITDA margin of 9.1% were in line with our expectations for the quarter, and our forecast has significantly improved sequentially throughout the year as our pricing and cost containment initiatives are implemented and continue to mature. Net sales for the quarter were 660 million, an increase of 28.5 million or 4.5% as compared to the first quarter of the prior year and 7% organic constant currency growth. First quarter revenue was 395.8 million, a 26% increase over the prior year quarter, driven by a combination of new customer wins and continued expansion with existing customers, as we continue progressing towards a return to pre-pandemic levels. Our infection prevention business, which represents approximately 10% of our revenue, began to return to more normalized levels beginning in the second quarter of 2021 and continued throughout the year. First quarter infection prevention revenue of 76 million represents a 50% decline versus prior year, and what we believe to be a sustainable run rate reflective of this business as we move forward. Consolidated adjusted EBITDA for the first quarter was 60.3 million, a 35% decrease as compared to the prior year quarter. While we do not plan to provide quarterly earnings guidance, our current forecast is that approximately 37% of our full year adjusted EBITDA will be earned in the first half of 2022, with the remaining 63% in the back half of the year. And in terms of putting it into numbers, given direct material costs are roughly 33% of revenue, that 28% inflation is worth about 240 million in the year, which is what we're seeking to overcome in terms of dollar inflation first, and that takes some time to implement given the price cost time lag, that we've discussed, in the future. And then I'd say maybe 10 million of ongoing M&A, which puts to our kind of growth algorithm of a couple of points with inorganic growth each year and about 25 million of restructuring, which helps us towards our progression to 20% EBITDA margin outlook. And then we're going to have this year about 130 of CapEx, of which about 25 million to 30 million links to our North American footprint project, which then after this year, allows us to reset around that 3% cash kind of target investment on an ongoing basis in CapEx. And if you want to think about your cash tax modeling, you might take about 12.5% of the incremental EBITDA and apply that to cash taxes, because we have some significant positive attributes to allow for that, around 3% of CapEx going forward and our one-time should migrate towards this $40 million, $45 million going forward, which then will clearly generate significant increases in '23 free cash flow over '22 even."
}