{
    "symbol": "DSEY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 07:29:06",
    "content": " Firstly, revenue improved by 10% as compared to the prior year and over 20% on a constant currency basis, reflecting strong organic growth in both pricing and new customer wins. We're also continuing to invest in opportunities to expand margins further next year and beyond like our plant investment in Kentucky, which remains on track to be completed by the end of this year and is expected to improve total company margins by roughly 100 basis points starting in 2023 as we work to deliver our targeted long-term EBITDA margin of 20% in the coming years. Net sales for the quarter were $715 million, an increase of $65 million or 10% as compared to Q2 prior year and 20.6% on a constant currency basis, reflecting strong top line growth across both of our business segments. I'm happy to report our Institutional business, which is roughly 70% of our revenue, reported $510 million or a 7% increase over Q2 prior year. On a constant currency basis, our Institutional business revenues increased by 17.4% driven by a combination of new customer wins, pricing actions and expansion with existing customers as we continue to progress towards a return to pre-pandemic levels. Consolidated adjusted EBITDA for Q2 was $88.4 million, a 12.7% decrease compared to prior year as reported, but nearly flat in constant currency. The third quarter outlook reflects volume growth and price increases that are expected to build throughout the year, offset by the historical seasonality of Diversey's business and the impact of opening our new Kentucky warehouse, which could have some timing impact between Q3 and Q4, along with incremental onetime costs. May proceed with your question. May proceed with your question. May proceed with your question. And based on your second half guide, I think you're going to get to probably like a 16% to 17% exit rate in the fourth quarter on a two-year basis. May proceed with your question. We reported 15.7% margins back last year, and then we need to get up back on to the 50 to 100 basis points train as we go back to focusing on our supply chain initiatives, our procurement and more pricing and the SG&A savings. May proceed with your question."
}