{
    "symbol": "VBNK",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-08 14:18:01",
    "content": " Total consolidated revenue increased 42% year-over-year and 7% sequentially to a record 25.9 million with the increase driven primarily by higher net interest income derived from our digital banking operations resulting from the strong growth in our loan portfolio that I mentioned earlier, and the maintenance of our net interest margin. Consolidated net income for Q1 increased 69% year-over-year and 46% sequentially to a new record 9.4 million, excluding Q1, 2017, which is attributed primarily to a one-time recognition of deferred income tax assets pursuant to the amalgamation of VersaBank with PwC capital as David mentioned earlier. Primary driver of growth in our loan portfolio was once again our point-of-sale financing business, which increased 68% year-over-year and surpassing the 2.4 billion mark just continue to be driven, this growth continued to be driven mainly by strong demand for home, home improvement, HVAC and our receivable financing. Q1 of this year saw a sequential growth in the point of sale portfolio of 9% relative to Q4 of last year and we believe sequentially, quarterly growth in the same range throughout the remainder of the year is achievable is consumer spending in the sectors on which we focus remains active. Turning to the income statement for our digital banking operations net interest margin on loans that is excluding cash security and other assets decreased 20 basis points or 6% year-over-year, but was unchanged sequentially at 3.03%. Cost of funds for Q1 was 2.95% of 166 basis points year-over-year and up 50 basis points sequentially, but both increases due mainly to the larger proportion of Wealth Management Deposits relative to our lower cost and solvency professional deposits versus the comparative periods, as well as the general increase in marketing interest rates. So to answer your question, there's a huge number of points of well don't call them point of sale financing states, but let's call them receivable purchase program partners and United States that are really keenly interested in itching up to our program."
}