{
    "symbol": "AMRC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 23:04:03",
    "content": " Please refer to today's earnings materials, the safe harbor language on Slide 2, and our SEC filings for a discussion of the major risk factors that could cause our actual results to differ from those in our forward-looking statements. We started 2022 with excellent quarterly performance as the team executed on our contracted backlog, we are also booking significant future opportunities across all of our lines of business. First, as a reminder, the Southern California Edison project is actually three separate contracts which we are executing independently when it comes to individual budgets, procurement items and completion schedules. Second, Ameresco has a proven track record for completing some of the most complex energy projects in our industry. The actual engineering and construction of these battery projects are nowhere near as complex as well as we have successfully achieved in our other projects, such as the Savannah River Biomass plant or our various green gas plants, which we have been constructing and operating since 2001. And like in all of our projects, we do risk materials and labor as much as possible before going to contract. However, given the scale of the Southern California Edison battery projects, we took extra precautions. Our contract with them allows for financial and delayed relief for force majeure events such as COVID, and we are in discussions with Southern California Edison. Based on this, together with the contingencies built into the projects, we do not expect our margin to be materially impacted by these delays. As noted in the April 10 press release, and as shown in our quarterly results, many significant milestones in the Southern California Edison projects progressed during the quarter, driving Q1 revenue ahead of our expectations. Ameresco continues to actively work with the suppliers and Southern California Edison to avoid or mitigate potential delays, included working with the ports on the West Coast on expediated ship and container heavily. Apart from the battery deliveries, we expect to complete all other aspects of the three projects construction by the original, August 1 deadline, including the installation of the batteries that are currently in transit. We added 60 megawatts of energy assets in development, including a 50-megawatt battery asset and a new R&D  opportunity, while our O&M business booked over $100 million in additional multi-year contracts. During the quarter, we also added over $400 million in new project awards as customers continue to seek solutions to address their increasing energy costs, resiliency needs, and carbon reduction goals. This project is actually the second largest award in Ameresco's history, only behind the Southern California Edison contract. Once contracted, the unique 20-year partnership will encompass a full range of advanced technologies, energy efficiency and renewable solutions involving project work, O&M, as well as energy asset ownership. As one of the largest energy services companies in the U.K., Ameresco is very well positioned to continue winning and executing on such transformative projects. As George noted, the Ameresco team overcame continued industry-wide supply chain and inflationary pressures to deliver excellent results. And while our projects business led to very impressive top line growth, it is important to note that all four of our lines of business grew nicely during the quarter. Just as important, our continued robust new business activity allowed us to grow our total project backlog even while converting a record amount of backlog to revenue during the quarter. Aspects of the SoCalEd project's custom procurement and construction milestones progressed more quickly than anticipated, driving stronger revenue during the quarter. Adjusted cash from operations was impacted by the working capital needs of the SoCalEd project; though subsequent to quarter-end, we collected $99 million that we had previously invoiced. Overall, we had anticipated these temporary uses of cash from the onset of the contract, and I'm pleased to announce that during the quarter, we amended our senior credit facility to improve our short-term liquidity needs and provide more financial flexibility to continue to scale our business. Not unlike recent quarters, the year-over-year increase in revenue from our energy asset business was driven by improved performance of our existing operating assets, the growth of new assets placed in service and strength in RIN prices. Despite lower overall gross margins due to the SoCalEd project, we still achieved an impressive year-over-year adjusted EBITDA growth. We're very pleased to have increased our total project backlog to a record $3.1 billion, increasing 1% sequentially and 34% year-over-year. Customer interest in bidding activity remains strong, and we are pursuing and winning many large complex projects, including our recently announced Bristol City collaboration in the U.K. During the quarter, we placed 10 megawatts of assets into operation while also backfilling our assets in development, which now stands at 464 megawatts. I'd like to provide some commentary around the high-profile industry-wide supply chain and inflation issues, and the ways that Ameresco has been able to overcome many of these challenges. As our investors know, Ameresco leverages the most advanced technologies across all suppliers to meet the unique needs of each customer; this reduces our exposure to any one manufacturer or technology. Likewise, because we are working on so many projects around the country, plus Europe and Canada, every quarter we're able to also opportunistically move products and human capital around to maximize execution efficiency. And finally, our contracts generally provide force majeure type protections if we face disruptions, like the delivery delays caused by the COVID-related shutdowns in Shanghai. Ameresco proactively protects itself by securing and contracting a significant portion of the products and labor needed for any given project, well in advance of moving from an award into a contract, helping us to mitigate unanticipated cost overruns. Lastly, as a reminder, approximately 60% to 70% of our EBITDA generally comes from contracted recurring revenue business lines demonstrating the overall resiliency inherent in our business model. Importantly, the widely observed recent increase in the prices of raw materials used in battery cells have not impacted the pricing of the batteries for the SoCalEd project. So while we certainly see and even experience some of these global issues, the diversified business model that we have created, the processes we have in place, and our excellent team of professionals helped to minimize the impact on the company's results. Your line is open. Your line is open. So with some of the associated battery storage project revenue shifting into 2H, but keeping the gross margin guide at 14%. I mean Q2 will still have -- will still be substantially impacted by the SoCalEd project, but nothing outside of that that would -- that's notable, that would impact the margins. Your line is open. And the projects that we have identified today and we reported as awards is projects we identified were very with them -- that they will be done and that's what we would be doing, the work that we would be doing associated that we reported. Your line is open. It just as tremendously and the fact that we have developed the company to be able to do what I call, the holistic approach of the particular solutions, whether it's a  or a particular industrial customer, not do only the energy efficiency, but all the renewables associated with all the advanced technologies, and that helped us a lot in order to be able to win this particular project. And I would say this much, after the win, we mentioned a couple of members in the United States, they said they loved the concept but it takes time for institutional momentum for those people to move; it will take some time but at the end, it's going to happen. In Europe, because of the energy prices, the way they are right now, I don't know if it's exactly the same form, but you will see more projects coming out of Europe."
}