{
    "symbol": "WTI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 14:13:10",
    "content": " And in the third quarter, we produced $71.1 million of free cash flow. Year-to-date, we've totaled $497.6 million in adjusted EBITDA and $351.5 million in free cash flow. So our free cash flow in the first nine months of 2022 were $351.5 million, is more than double the free cash flow that we generated in all of 2020 and 2021 combined. Our net debt decreased by $77.1 million in the third quarter of 2022 to $254.3 million due to the increase in cash and cash equivalents resulting from strong cash flows throughout the quarter, driven by stable production and higher oil and natural gas prices. Now as of September 30, 2022, we had available liquidity of $497.1 million, comprised of $447.1 million in cash and cash equivalents and $50 million of borrowing availability under our revolving credit facility. Should capital markets remain volatile, weâ\u0080\u0099re confident that weâ\u0080\u0099re able to repay these notes prior to maturity out of future expected free cash flows, our substantial cash on hand of $447 million and access to our unused $100 million aftermarket equity program. Looking ahead to the fourth quarter of 2022, our guidance for production is between 38,000 to 42,000 barrels of oil equivalent per day and fourth quarter lease operating expense is expected to be between $67 million and $73 million, which includes increased workover and facilities expense activity. In regard to ARO expenditures, given the spending incurred to date, including $21.5 million in the third quarter, we adjusted our range for P&A expenditures to between $65 million and $75 million. Our substantial cash position of $447.1 million, ability to generate free cash flow from operations and access to an additional $150 million to $200 million in liquidity via our undrawn RBL ATM equity sales program and monetization of long calls provide clear line of sight to either eliminate or refinance our decreasing debt position."
}