{
    "symbol": "CW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 14:06:02",
    "content": " So it is an area that has gone very well, you know, we do our monthly financial reviews across all the teams, and they report out, you know, how theyâ\u0080\u0099re tracking towards targets that weâ\u0080\u0099ve set, and we can really see itâ\u0080\u0099s bringing results to the organization, which you know most fundamentally is seen in our ability to expand operating margin, because there is no doubt that, you know, the inflationary pressures on material is real, you know, we are working to make sure weâ\u0080\u0099re paying our staff at a rate that is, you know, market competitive and, you know, keeps them, you know, enthused to be working at Curtiss-Wright. And I think what thatâ\u0080\u0099s going to do is itâ\u0080\u0099s going to put us on the revolver you know typically Q1 is a cash outflow quarter for us anyway, but weâ\u0080\u0099ll be on the revolver to the tune of about $150 million, I would say, you know, average across, you know, three quarters and you know we were looking at the variable interest rates and you know, we are, you know, conservatively estimating that those will climb to about 6% they might be slightly below there, but you know, with a few more movements here we can easily be in that 6% range. And, you know, we still challenge ourselves to meet those financial goals, and maybe it raises the bar a bit for an acquisition that we would consider, but, you know, really, you know when we find a good strategic fit, you know, even if it doesnâ\u0080\u0099t, you know, isnâ\u0080\u0099t accretive to our 17% overall margin, you know, in year one, we definitely donâ\u0080\u0099t â\u0080\u0093 not consider it, you know, thatâ\u0080\u0099s part of our, you know, our ongoing operational excellence initiatives is to create margin dollars to cover dilution from acquisitions that, but again, you know, those are ones we are willing to do that when weâ\u0080\u0099re really confident of the strategic fit and the growth trajectories out of that business. So, you know, our preference as youâ\u0080\u0099ve seen over the past handful of years has been defense, I would definitely say, we are not limited to that, but it is an area we very much have focused on and you know, mission-critical safety systems, the Defense Electronics area, are all areas that are top priority for us, but you know, weâ\u0080\u0099re definitely you know, as you look at our growth trajectories across our end markets."
}