{
    "symbol": "CRUS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-07-28 23:56:03",
    "content": " Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. And the way to think about that in relation to our customers is -- and the general shape of our business is when it comes to our largest customers and the major strategic relationships we have, we have -- we've put a lot of effort, and we have a very experienced team working on the long-range planning associated with that, securing capacity, working deeply with our customers and our foundry partners to ensure that we have everything we need for our biggest products, and our biggest customers. We've had notable success with the closed-loop controller but now we're bringing to market in the back half of this year in our power controlling -- conversion control, I see something that has meaningfully higher value on a pay as unit basis than the closed-loop controller, and that's something that we can build on. Your line is open. And then, obviously, entering into a strategic supply agreement for -- with the foundry partner for wafer supply that represents a pretty significant chunk of our business gives us added confidence in the ability to grow next year given that, that's a significant step-up in our wafer allocation as we go into calendar '22. Your line is open. So really, just over the past 1.5 years, they've seen -- or a couple of years, they've seen an incredible acceleration of demand -- and that's really driven by the fact that, especially at the higher end of Android devices, there's a lot of competitive differentiation around the speed of phone charging and the user experience that goes along. So in the coming year, I would say that, that is still going to be driving most of the revenue and design wins for the products that the Lion team developed, it's -- there's still plenty of headroom in the Android market for continuing that momentum alongside which we, of course, want to be developing products and taking the solutions to the market."
}