{
    "symbol": "CRUS",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-01 21:26:02",
    "content": " I want to explain that some of the way we think about this is, that we really want to give more ammunition to the Lion team and help them build out their road map and expand across customers and into other new markets as rapidly as possible, of course integration is a goal because we believe the technology that the Lion team had developed, can be highly complementary to other things we’re doing, but actually the first priority is execute on pretty significant raft of opportunities they have in front of them. So, we’ve picked up a reasonable amount of codec business, especially over this year we’ll continue to build on that, I think there are reasons why a number of those customers will want to continue using our technology, we tend to be fairly difficult to dislodge once we, once we get in somewhere, but the underlying factors which is what we were shooting for originally, of a transition more towards boosted amplifiers, transition towards potentially haptic trackpads  and that kind of growing requirements around audio and video, those were things that we saw happening with or without any COVID related supply chain disruption. Our estimate of that over the next five years is it that looks like something along the lines of a $400 million SAM for us to tilt at, so that's, that’s focused on the segments where we would, we would play, it would tend to be at the upper end of the notebook market, it would tend to be the devices which are really focused on premium performance and having very high power efficiency and so on, but given that we see opportunities across audio, may be haptics, may be power in those segments, it means the total ASP bit of device and total content per device, may actually be pretty significant that's reflected in that SAM. Your line is open. We don't want to talk in detail about our customers product plans, but I’m on fairly safe ground given that for the most part I don't know them in relation to this area, but I think if you look at what we are planning to do, and what we're investing in, I think you would probably see some kind of patent whereby we're bringing in increased functionality at the top end, and then there is some mix of those devices across the products over time. Your line is open. Your line is open. One is just a really big tangible step in the direction of we’ve been talking about of diversifying really meaningfully the technology areas where we have proven expertise, and leadership and I think that can really help the business long term as well as obviously the revenue contribution that we see today. Right now that's custom silicone obviously, and we are very focused on the team on serving our biggest customer first and foremost, and kind of continuing to execute on that is priority number one for the team, but it's also clear from everything we’re seeing that we're making a lot of investment in this area and we really believe we can be innovative around battery, so that certainly represents a great opportunity to broaden, and expand our business. Your line is open. Your line is open. Your line is open. Your line is open. So, you're not going to see us building it, but we have a really, really strong cash flow, we have no need for financing at this point in time, we may go we have that need if we go down the road of M&A or some things like that, but for running our business right now we're fine, we won't draw on the revolver or any financing and you’ll see as we move through the end of this year, the March quarter and the December quarter are much our highest generation for cash, so you’ll see us start moving back up towards the end of the fiscal year. Your line is open. Your line is open."
}