{
    "symbol": "CRUS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-01-31 20:33:07",
    "content": " But as regards -- looking out to the March quarter, the guidance is mostly driven by the strength of demand for our products and our customers’ products and us working to meet that demand. When we had this call relating to the previous quarter, I think there was a lot of -- there were a lot of open questions about what was going to happen to demand and what seasonality looked like as we went into the March quarter, just given the fact that everybody knew products we’re struggling to keep up with demand. So if you look into Q1, again, moving forward, at least one quarter, we’re not really guiding that, but you would -- when you take a look at what that will come in at, it will be lower than the Q4 results or the March results and probably a touch higher than what we saw maybe earlier in the year, and that can kind of give you a gauge. I know there’s a lot of focus from some folks about kind of moving -- diversifying away from smartphones, but it seems to me that the priority number one is to increase the dollar content in smartphones beyond just providing audio and then kind of branching outside of your top customer and kind of replicating that scenario in the Android market. We believe that we have a really, really solid foundation of our current core audio business and great growth and opportunities in high-performance mixed-signal, that’s obviously driving a lot of growth in the current fiscal year. And that’s an area where -- you heard in my earlier comments with the addition of boosted amplifiers or the first boosted amplifier design-ins to laptops in the December quarter, we continue to see some long-term opportunity for us to diversify our audio revenues as well. I mean, I think at one level, really, all we’re trying to say here is we have a significantly stronger March quarter than we normally do, which looks like it will, as I said, take us to -- based on the midpoint of guidance to somewhere around 25% growth for the full fiscal year."
}