{
    "symbol": "FA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 10:49:05",
    "content": " On a constant currency basis, our revenue would have been approximately $3.5 million higher, representing 8.6% year-over-year growth. Our continued growth in the third quarter, albeit at more moderated levels, follows 8 consecutive quarters of extremely robust double-digit revenue growth and was achieved despite the difficult macro environment, foreign currency headwinds and cycling over the remarkable 41% revenue growth we experienced in the prior year period. Continued resilience in our business helped us achieve year-over-year revenue growth of 6.8% or 8.6% on a constant currency basis, marking our second highest revenue producing quarter in our history. Versus the prior year, our third quarter revenue grew 6.8% to $206 million or grew 8.6% to $209.4 million on a constant currency basis. In our Americas segment, revenues of $176.1 million were up 10.8% from Q3 2021, driven by strong new business growth and acquisitions. On a constant currency basis, our revenues would have been $3.3 million higher or only down 1.8% year-over-year. Adjusted EBITDA for the quarter was $64.2 million, an increase of 0.4% compared to Q3 of 2021, during which we grew adjusted EBITDA by a very high 47.7%. In the third quarter, operating cash flows increased 67.2% to $46.4 million, driven by our revenue growth and profitability as well as reflecting our strong cash flow conversion, which we expect will continue throughout the year. And as context, we currently have approximately $390 million of cash on our balance sheet, and we generated operating cash flow of $46.4 million in Q3 alone, $142.8 million on a year-to-date basis and over $200 million over the last 12 months. During the third quarter, a portion of the outperformance from the first half was essentially given back to due to increasing strong foreign currency headwinds, macro-related declines in our International segment and more moderate but still positive organic growth in our Americas business. We now expect to generate full year 2022 revenues in the range of $813 million to $820 million, representing approximately 14% to 15% year-over-year growth, down slightly from prior guidance and equating to 9% to 10% growth on an organic basis. On a constant currency basis, this represents 16% to 17% year-over-year growth or a range of $823 million to $831 million. We expect 2022 adjusted EBITDA to be in the range of $247 million to $251 million, representing approximately 9% to 11% year-over-year growth. On a constant currency basis, our implied adjusted EBITDA range is $250 million to $255 million or 11% to 13% year-over-year growth."
}