{
    "symbol": "FA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-03 15:35:23",
    "content": " We also generated record operating cash flow of $212.8 million in 2022, growing an impressive 43% versus the prior year. Despite this, we grew Q4 adjusted EBITDA, further growing from our record quarter in Q4 2021 as we expanded our adjusted EBITDA margins by 40 basis points to over 33% and we generated substantial operating cash flows. In our Americas segment, revenues of $188 million were up 3% from Q4 2021 which is incremental to the strong Q4 of 2021, which was up 26.7%. In our International segment, revenues of $26.2 million were down 17.6% from Q4 2021 as we cycled over a strong Q4 of '21, which had 83.8% year-over-year organic growth. On a constant currency basis, our Q4 revenues would have been $3.5 million higher or down only 6.6% year-over-year. In the fourth quarter, year-over-year revenue decline from existing customers was $13.7 million and can be attributed to both our Americas and International existing customer bases. Adjusted EBITDA for the quarter was $70.3 million, an increase of 1.2% compared to Q4 of 2021, during which we grew adjusted EBITDA by over 55%. Versus the prior year, our full year 2022 revenue increased 13.7% to $810 million or 15.2% to $820.3 million on a constant currency basis. In our Americas segment, revenues of $695 million were up 15% from full year 2021 driven by acquisitions and new business growth. In our International segment, revenues of $122.6 million were up 7.5% from full year 2021. On a constant currency basis, our International revenues would have been $9.8 million higher or 16.1% year-over-year. For full year 2022, year-over-year revenue from existing customers increased by $25.3 million and can be attributed to strength across our Americas business in the first half of the year, offset by the impact of slower hiring and the effects of changes in foreign currencies. Adjusted EBITDA for full year 2022 was $248.9 million, an increase of 10% year-over-year. Overall revenue growth attributable to new and existing customers primarily during the first half of the year, selective price increases, cost reductions implemented primarily in the second half of the year, acquisitions and cost structure benefits due to increased automation, operational efficiencies and operating leverage were partially offset by those items previously discussed. Despite the softening hiring environment in the fourth quarter of 2022 and flat revenues, we still expanded adjusted EBITDA margins 40 basis points to 33.1%, underscoring our ability to manage costs through our dynamic and flexible cost structure. For full year 2022, cash flow from operations was a robust $212.8 million, up 43% year-over-year due to our strong cash flow conversion which we expect will continue going forward. Based on our full year 2022 adjusted EBITDA of $249 million, we had a net leverage ratio of 0.7x as of December 31. As a result of the above, we expect to generate full year 2023 revenues in the range of $770 million to $810 million resulting in flat to negative 5% year-over-year growth, all of which is organic. On a constant currency basis, we expect revenues of $774 million to $814 million, with the high end of the range exceeding prior year results. We expect 2023 adjusted EBITDA in the range of $240 million to $255 million, representing negative 4% to positive 2% year-over-year growth. Based on actual financial results to date, we expect Q1 year-over-year consolidated revenues to decline 8% to 11% as the macroeconomic headwinds previously described continue and we cycle over Q1 2022, which saw exceptionally high revenue growth of 44%. We expect our full year adjusted EBITDA margins to be approximately 31%, additional evidence of our focus on managing the business for profitability and leveraging our flexible cost structure."
}