{
    "symbol": "IPA",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-13 22:34:04",
    "content": " Research and development expense increased $2.8 million from $1 million in 2020, due to the strategic investments the company is undertaking in research and development of its Talem owned therapeutic antibody assets. Adjusted EBITDA is management’s view of operating earnings, for the three months period ended October 31, 2021, the company’s adjusted EBITDA was a loss of $2.9 million, compared to a gain of $797,000 in 2020, a reduction of $3.7 million, predominantly from investments in research and development, an increase of $1,799,000, increased insurance costs of $419,000 and a decrease in grant and subsidy income of $1,429,000. A few comments about IPA’s liquidity and capital markets activity, on October 13th, the company established an aftermarket equity offering facility, which entitles the company at its discretion and from time-to-time during the term of the ATM agreement to sell through its agent H.C. Wainwright & Co. common shares of the company having an aggregate gross sales price of up to US$50 million. The company achieved revenues of $9.3 million during the six months ended October 31, 2021, a 9.3% increase from the same period last year. Gross profit totaled $5.1 million during the six months ended October 31, 2021, compared to $5.2 million last year, with gross profit margin of 55% for 2021 and 61% for 2020. Expenses for the six months of the year were up $4.8 million, most notably related to investments in research and development for the Talem owned therapeutic antibody assets. Last year, the company had a net loss of $1 million, compared to $8.2 million through the six-month period ended October 31, 2021. The primary changes include, $2.6 million expense related to investments in research and development of Talem owned therapeutic antibody assets, $1.1 million in D&O insurance and professional and consulting fees to support the company’s strategies and compliance, $1.2 million in non-cash share-based payment expense related to stock options, and $2.1 million lower grant and subsidy income in the current year, and $200,000 made up of other smaller differences."
}