{
    "symbol": "CSTM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 16:06:03",
    "content": " Such statements include statements regarding the companyâ\u0080\u0099s anticipated financial and operating performance, future events and expectations and may involve known and unknown risks and uncertainties. For a summary of specific risk factors that could cause results to differ materially from those expressed in the forward-looking statements, please refer to the factors presented under the heading Risk Factors in our Annual Report on Form 20-F. All information in this presentation is as of the date of the presentation. After a strong first quarter performance, our recordable case rate climb in a second quarter leading to rate of 2.2 per million hours worked for the first half of the year. This is a humbling reminder that while we always strive to deliver best-in-class safety performance, we need to constantly maintain our focus on safety to achieve the ambitious targets we have set. Shipments were 424,000 tons, up 4% compared to the second quarter of 2021 due to higher shipments in each of our segments. Revenue increased 50% to â\u0082¬2.3 billion as a result of higher metal prices, improved price and mix and increased volumes. As we have said previously, while our revenues are affected by changes in metal prices we operate a pass-through business model, which minimizes our exposure to metal price risk. Our value-added revenue, which reflects our sales excluding the cost of metal was â\u0082¬704 million, up 22% compared to the second quarter last year. The decrease in net income is primarily related to a â\u0082¬158 million unfavorable change in unrealized gains and losses on derivatives, mostly related to our metal hedging position. As you can see in the bridge on the top right, adjusted EBITDA was â\u0082¬198 million, 17% above the second quarter of 2021. The combination of stronger demand, pricing power, solid execution by our team and a stronger US dollar drove better results despite the significant cost pressures, which Peter will discuss later in more detail. As you can see on the bottom right of the slide, we demonstrated our continuing commitment to deleveraging, ending the second quarter at 3.0 times or down almost 0.5 times from the end of 2021. We remain committed to achieving our leverage target of 2.5 times and maintaining our long-term leverage target range of 1.5 to 2.5 times. Overall, I am very proud of our second quarter performance. And we expect inflationary pressures to continue, especially for inputs like energy, in regions more directly affected by the ongoing war in Ukraine. As a consequence, we are optimistic about our prospects for the remainder of this year, while therefore raising our 2022 adjusted EBITDA guidance to a range of â\u0082¬670 million to â\u0082¬690 million. In addition, we continue to expect free cash flow in excess of â\u0082¬170 million in 2022. Turning to slide 6, and before I handing it over to Peter, I want to directly address the topic I know you are all focused on and so are we, which is natural gas prices and availability in Europe. It is difficult to know, if or when this may offer, though we believe there is good logic for Russia to gradually reduce the flow of gas to Europe. We noted, stream one recent return to service at a lower flow rate than pre-maintenance level and well below capacity. This includes finding alternative sources of gas, the European Commission's 15% demand plan -- demand reduction plan and a broader plan to end dependence on Russian gas in the future. As you all know, Russian gas dependence varies widely by country across Europe. In addition, we believe a 15% reduction in gas supply would lead to much less than a 15% reduction in our production capacity. Value-added revenue or VAR was â\u0082¬704 million in the second quarter of 2022, up 22% compared to the same quarter of last year. Metal impact for a headwind of â\u0082¬21 million, as inflation on inputs such as hardeners and alloying elements more than offset our scrap performance in the quarter. Finally, â\u0082¬35 million of the increase was due to favorable FX translation tied to a stronger U.S. dollar. First as Jean-Marc noted, the top line dynamics in our business remained favorable in the quarter. Second, with adjusted EBITDA of â\u0082¬198 million in the quarter our margin on value-added revenue was 28.1%. And third, to put our performance in context, compared to the first half of 2019 VAR in the first half of this year was up 11% and our adjusted EBITDA margin on VAR was up approximately 200 basis points. Automotive shipments increased 3% in the quarter versus last year as new platforms began to ramp up, but overall demand continues to be well below pre-COVID levels due to the semiconductor shortage and other supply chain challenges. Price and mix was a tailwind of â\u0082¬15 million, primarily on improved contract pricing including inflation-related pass-throughs. Costs were a headwind of â\u0082¬26 million, as higher operating costs mainly due to inflation more than offset favorable metal costs. Volume was a tailwind of â\u0082¬12 million, as aerospace shipments were up 54% compared to last year. Price and mix was a â\u0082¬24 million tailwind, primarily due to improved contract pricing including inflation-related pass-throughs. In the second quarter as expected, we experienced significant inflationary pressures across our business many of which were exacerbated by the war in Ukraine. That said, metal supply remains tight today with high energy prices increasingly forcing smelters to shut down. Nonmetal costs are also higher this year, particularly European energy. As previously noted, we purchased energy on a rolling forward basis which has helped mitigate some of the current cost pressures. However, our energy costs will run significantly higher this year particularly in Europe given the unprecedented energy price increases. Currently, we expect total energy costs to be closer to â\u0082¬250 million in 2022, with additional increases in 2023. While not to the same extent, we are experiencing significant cost pressures across most other categories, which we expect to continue throughout the balance of 2022. The extraordinary increases in European energy crisis, for example -- European energy prices, for example, support the need for an energy surcharge mechanism. While inflation continues to be significant in 2022, we believe it's manageable and it will be largely offset by improved pricing and our relentless focus on cost control. Now, let's turn to slide 13 and discuss our free cash flow. We generated â\u0082¬60 million of free cash flow in the second quarter, bringing our year-to-date total to â\u0082¬86 million. As you can see on the bottom left of the slide, we have continued to deliver on our commitment to generate consistent strong free cash flow. Since the beginning of 2019, we have generated over â\u0082¬550 million of free cash flow. Looking at 2022, we expect to generate free cash flow in excess of â\u0082¬170 million. We expect CapEx to be between â\u0082¬265 million and â\u0082¬275 million, up from our previous guidance of â\u0082¬250 million to â\u0082¬260 million, due to a combination of inflationary pressures and a stronger US dollar. Now, turn to slide 14, and let's discuss our balance sheet and liquidity position. At the end of the second quarter, our net debt was â\u0082¬2 billion. Our leverage reached a multiyear low of three times at the end of the second quarter, were down almost 0.5 from the end of 2021. Given our revised 2022 guidance for adjusted EBITDA and free cash flow, we expect leverage to continue to decline and to fall below three times by the end of this year. We remain committed to achieving our leverage target of 2.5 times and maintaining our long-term leverage target range of 1.5 to 2.5 times. Despite this, our liquidity of â\u0082¬899 million, increased compared to the end of the first quarter. Let's turn to slide 16, and discuss our current end market outlook. As I mentioned before, demand generally remains very strong in the markets we serve. We are benefiting from sustainability-driven secular growth trends such as consumer preference for infinitely recyclable aluminum cans, light weighting in transportation and the electrification of the automotive fleet. The packaging market is strong in both North America and Europe, and domestic supply remains tight. We expect mid-single digit demand growth in the medium term, which is supported by already announced can-maker capacity additions in both regions, as well as recent announcements of greenfield investments here in the US to build new aluminum rolling mill. OEMs experienced production stoppages, again, in the second quarter. From an end market demand perspective, however, we remain very positive on this market, and in its growth potential given low inventories, high consumer demand, electrification trends, and continued penetration of aluminum. Aerospace treatments were up over 50% in the second quarter versus last year, and up 25% sequentially. It is also of note that, many of the sustainability driven secular growth trends impacting our other core markets are very much at play here as well. While we have begun to see some preliminary signs of potential weakness in certain end markets, our specialties markets in both Europe and North America are still strong today. First, our diversified portfolio serves a range of resilient end markets that are well positioned today. Automotive is operating well below pre-COVID build rates, with substantial pent-up demand. Together, these three end markets represent roughly 75% of our revenue base. Second, the demand for aluminum in our core market is growing, due to durable sustainability-driven secular growth trends. Third, we have demonstrated our pricing power over the last several quarters with our ability to pass through most of the inflationary cost increases. Fourth, we have built a strong track record of execution and a proven ability to control our costs, across both contracting and expanding business environments. And finally, our balance sheet is rapidly approaching our target leverage range and we have no near-term bond maturity and we have a strong liquidity position. So let's turn to slide 18 to wrap-up, before we open the line for Q&A. We delivered record adjusted EBITDA of â\u0082¬198 million through solid operational performance, and strong cost control in the face of significant inflationary pressures. We extended our track record of free cash flow generation, and our net debt to adjusted EBITDA of 3.0 times is a multiyear low. Looking forward, we are well positioned to deliver strong full year performance in 2022 and beyond. For 2022, we are now targeting adjusted EBITDA of â\u0082¬670 million to â\u0082¬690 million, and free cash flow in excess of â\u0082¬170 million. We remain focused on operational performance cost control, free cash flow generation, the achievement of our ESG objectives and shareholder value creation. Your line is open. I mean, when you look at kind of your net leverage and certainly going forward in the free cash flow outlook, it seems like your balance sheet is getting to be roughly speaking where you want it. And then I guess maybe -- I know you don't give kind of quarterly guidance, but as we think about sort of sequential progression into 3Q, it seems like momentum obviously in A&T is very good. Talking about auto, we don't anticipate much of a change in terms of all the supply chain issues that the OEM customers are going through. And yes year-over-year if you look at the first half of 2022, we're slightly up to overall automotive shipments and we think we'll stay around these levels seasonally adjusted for the second half. I mean, our lines are running very well and so we're ready to absorb incremental demand. So it's a pretty significant step function change capacity coming into the market 2025, 2026. I would think a lot of those -- I know you can't speak to them, but clearly they've got commitments for some of that capacity beyond which suggests more growth ahead. So how fast they come up online and they ramp up and how quickly they ramp up, how successfully they ramp up may create either a very tight supply-demand balance or some excess supply if everything comes on stream quickly and ramps up very quickly in kind of 2026-2027 horizon. Your line is open. Good morning, Jean-Marc and Peter. However as I said in the prepared remarks, we also think given the extraordinary increases that there is a need for some type of energy surcharge mechanism. Magnesium costs again as I said in the prepared remarks, we've put in place the kind of pass-through mechanisms on magnesium costs some of them with delay. Your line is open. Good morning, Jean-Marc and Peter. So the rule of thumb which was historically it's most of the time five years sometimes three years so you're kind of renewing every year 22%, 25% of the volume. So we don't have anything really much to negotiate anymore because most of our contracts are already agreed and locked in for the period 2023, 2024, 2025. So in the first half, in the first quarter on a year-over-year basis, we had about a â\u0082¬5 million impact and in the second quarter we had about a â\u0082¬10 million impact. So relative to last year, we're talking about a â\u0082¬15 million-ish tailwind from FX in the quarter and \n EBITDA. And then, if you look at kind of -- I assume you want to know the impact on our balance sheet and our balance sheet, it really kind of flows into the translation impact on our net debt, which is negative, which is the strengthening of the US dollar, is really the reason why our debt balance is maintained persistently around â\u0082¬2 billion, despite the repayments that we've been making. But then on a cash flow basis, the FX it should be modestly positive to neutral because the benefit that we get on the EBITDA side gets absorbed in things like interest expense and CapEx and so forth. Your line is open. Just within aerospace and congrats on the strong growth here, but curious, as engines remain a gating factor for OEM deliveries. I mean remember Josh, for two years build rates were down by 30% and we are delivering at 50% less than what we were. So we don't see this as a -- we don't see there being a risk that this slows down in the kind of 2022, 2023 time frame \n And then just given the impressive EBITDA per ton at A&T and then just thinking about the aluminum lithium product. I mean, it's heavily mix dependent. You know that quite a bit of our aluminum lithium alloys goes on A350, which is a wide-body aircraft, which is not experiencing -- wide-bodies are recovering a little bit more slowly than narrow-body. Your line is open. I wonder if you could comment a little bit more on energy supply, just given the volatility we've seen in natural gas supply to Europe and your thoughts around operating the business in that environment. Well, Karl, the way I think of it is, I mean, two bookends and I'm not saying they are fixed and will never change. The other bookend is, what the Commission has published, which is a 15% reduction in demand from Europe and which would trigger certainly even more expensive gas prices as part of a rationing scenario. I think, what's important to understand is, for us, a 15% reduction in natural gas availability translates into less than that in terms of peter-out  production. But if this is a widespread, kind of, share the pain equally across all segments and all geographies in Europe, then you're in a place where the reduction is, for us, is much less in terms of our activity level, much less than a 15% reduction. The other point is, different regions in Europe are exposed to different levels to a Russian gas supply. And it's important to note that, that 15% is an overall European number, it's not clear whether it would be different depending on the countries and depending on their level of exposure to Russian gas. We are operated, as I mentioned in the prepared remarks, mostly in countries where the dependency on the European -- on Russian gas, sorry, is less, so that would help us as well to some extent. We've already done desktop exercises as to what happens if gas is reduced by X, Y, Z, how do we run our operations, how do we engage with our customers. And I think to the extent it's a 15% reduction, it's very manageable. But I think, given some of the uncertainty around, we're going to be a little bit patient in that and see what comes. Your line is open. I guess my first question, I was curious if there are any opportunities for you to build inventory, ahead of any potential curtailments, whether on the â\u0080\u0093â\u0080\u0093 obviously, not on the energy side but on the metal side. Well, you will have noted Sean that our â\u0080\u0093 we've raised our EBITDA guidance but we haven't retouched our free cash flow guidance and we want to maintain that flexibility to be able to increase inventory, if we believe it's the right business decision for us to make. We're looking at it and we certainly â\u0080\u0093 again, our whole job is to put the company in a place where we can select the best options and we are not constrained by our financial situation or our operating performance. And then my second question, I was just curious if â\u0080\u0093 particularly around the auto segment, we had another issuer sort of commenting that SAR had been sort of depressed the past two years and they believe that there's a lot of pent-up auto demand out there. And then just lastly, Peter you've outlined a number of things today. We're curious, given that it's potentially an option out there some of your bonds are trading at a discount. Potentially and that kind of follows on to my comment that I made to Karl, absolutely it's an option for us and we're kind of monitoring that. And as Jean-Marc said, I think one of the nice things that we've done as a company over the last several years is we've really put ourselves in a position, where we can be opportunistic. You would have noted as Peter mentioned in his remarks that our level of activity today as evidenced by the VAR is higher than it was pre-COVID, despite arguably quite a few of our segments being still in a recession. Our operating performance in terms of VAR margin or EBITDA margin is stronger than where you before COVID and I think that's a testament to a great job by everybody at Constellium to make sure that we work on what we can control, put the company in a good place, so that we can be opportunistic and make the most of whatever situation is being turned out."
}