{
    "symbol": "CSTM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 17:33:04",
    "content": " On the call today, we have our Chief Executive Officer, Jean-Marc Germain; and our Chief Financial Officer, Peter Matt. A copy of the slide presentation for todayâ\u0080\u0099s call is available on our website at constellium.com, and todayâ\u0080\u0099s call is being recorded. Before we begin, Iâ\u0080\u0099d like to encourage everyone to visit the companyâ\u0080\u0099s website and take a look at our recent filings. Such statements include statements regarding the companyâ\u0080\u0099s anticipated financial and operating performance, future events and expectations and may involve known and unknown risks and uncertainties. For a summary of specific risk factors that could cause results to differ materially from those expressed in the forward-looking statements, please refer to the factors presented under the heading â\u0080\u009cRisk Factorsâ\u0080\u009d in our Annual Report on Form 20-F. All information in this presentation is as of the date of the presentation. We undertake no obligation to update or revise any forward-looking statements as a result of new information, future events or otherwise, except as required by law. In addition, todayâ\u0080\u0099s presentation includes information regarding certain non-GAAP financial measures. Please see the reconciliations of non-GAAP financial measures attached in todayâ\u0080\u0099s slide presentation, which supplement our IFRS disclosures. Without further ado, I would now like to turn the call over to Jean-Marc. In the third quarter, several of our sites achieved safety milestone. Our research center C-TEC in France, achieved the one year milestone without a recordable case. Nanjing, China achieved two years and both Vigo, Spain and Astrex in Canada, we achieved three years. Turning to our financial results, shipments were 387,000 tons down 2% compared to the third quarter of 2021. As we have said previously while our revenues are affected by changes in metal prices, we operate a pass through business model, which minimizes our exposure to metal price risk. As you can see in the bridge on the top right, adjusted EBITDA was â\u0082¬160 million, 12%, double the third quarter of 2021. Packaging demand continues to be resilient, though our shipments were down in the quarter due to operating challenges at our Muscle Shoals facility, in large part due to a shortage of experienced engineers and operators. While we are seeing signs of weakness across certain industrial markets, we like our overall end market positioning. The combination of solid demand, pricing power and good execution by our team and a stronger U.S. dollar drove better results despite the significant cost pressures, which Peter will discuss later in more detail. Moving now to cash flow, we extended our track record of consistent free cash flow generation with â\u0082¬74 million in the quarter. As you can see on the bottom right hand side, we demonstrated our continuing commitment to deleveraging ending the third quarter at three times or down 0.6 times from the end of the third quarter last year. Overall, I'm very proud of our third quarter performance. Looking at the balance of 2022 macroeconomic and geopolitical risks remain elevated, and we expect inflationary pressures to continue, especially for inputs like energy and in regions more directly affected by the on-going war in Ukraine. Despite seeing signs of weakness across certain industrial markets, we have not experienced a material reduction in demand in our core end market. As I mentioned, we are dealing with some operating challenges at our Muscle Shoals facility. We expect to finish 2022 with adjusted EBITDA landing at the low end of our guidance range of â\u0082¬670 million to â\u0082¬690 million, which would be a new record year for the company. Turning to slide six before handing it over to Peter, I want to give an overview of the environment we are currently facing in Europe. European energy markets are in disarray today, largely as a result of the war in Ukraine, and Russia's significant reduction of its gas flow to Europe. Both gas and electricity prices have been significantly above historical levels, at some point more than 10 times since the start of the war. To date, our operations have not been affected from an availability standpoint, and we feel comfortable that gas will continue to be available in the near term. As a result of substantially higher energy costs several smelters have curtailed operations, which is impacting aluminum and alloy availability. Higher energy costs, also creating certain inflationary pressures across a wide range of inputs to our business. Further, the risk of lower demand due to the impact of slowing markets has increased compared to where we were three months ago. As you should expect, given the performance track record of the Constellium team, we are working hard to manage the company through this current environment. On the energy front, we have a company wide effort to reduce our energy consumption across our operation. Finally, thanks to the great efforts of our procurement and operations team, we have thus far been able to successfully manage a number of supply chain challenges. Overall, our plants are running well without interruption and keenly focused on controlling costs. We're obviously monitoring the situation very closely, and we'll continue to update you on developments. Value added revenue or VAR was â\u0082¬673 million in the third quarter of 2022, up 21% compared to the same quarter last year. Volume was a headwind of â\u0082¬11 million, as higher shipments in A&T and AS&I were more than offset by lower shipments and in part. Finally, metal impacts were a headwind of â\u0082¬27 million as inflation on input costs such as hardeners and alloying elements more than offset our scrap performance in the quarter. First, we grew our value added revenue by 21% in the quarter versus last year. Pricing mix and price specifically, is the biggest increment of our year-over-year variance and is helping us combat inflationary pressures. And third, with adjusted EBITDA of â\u0082¬160 million in the quarter our margin on value added revenue in the quarter was 23.7% which is better than our 2019 VAR margin. Now, turn to slide nine and let's focus on our PARP segment performance. Volume was a headwind of â\u0082¬9 million, with higher shipments in automotive, more than offset by lower shipments and packaging and specialty road product. Automotive shipments increased 16% in the quarter versus last year, as new platforms began to ramp up. Packaging shipments decreased 9% versus last year, while demand and packaging continued to be resilient. Our Muscle Shoals team is highly dedicated and is working hard to recruit and train new hires, but this will take some time. Pricing mix was a town of â\u0082¬22 million primarily on improved contract pricing, including inflation related pastures. FX translation, which is non-cash was a tailwind of â\u0082¬6 million in the quarter due to a stronger U.S. dollar. Volume was a tailwind of â\u0082¬4 million with higher aerospace shipments, more than offsetting lower TID shipments. Shipments in TID were down 8% versus last year, reflecting a slowdown in certain industrial markets. Price and mix was a tailwind of â\u0082¬47 million on improved contract pricing, including inflation related pastures and a stronger mix with more aerospace. However, the business continues to be impacted by the semiconductor shortage and other supply chain challenges. Price and mix was a â\u0082¬22 million tailwind primarily due to improve contract pricing, including inflation related factors. In the third quarter, as expected, we continued to experience significant inflationary pressures across our business, many of which are exacerbated by the war in Ukraine. As you know, we operate a pasture  business model so we are not materially exposed to changes in the price of aluminum, our most significant cost input. That said, metal supply remains tight today, with high energy prices in Europe increasingly forcing smelters to reduce or eliminate capacity. We currently expect to be able to source our needs, but in certain cases at an incremental cost. The cost of alloying elements like magnesium and lithium are significantly higher this year, due to supply disruptions and to the actions we took previously to secure our 2022 supply. However, supply disruptions in certain cases are forcing us to resource alloy inputs at elevated market prices and will add significant incremental costs to the second half of 2022. Non-metal costs are also higher this year, particularly European energy. As previously noted, we purchased energy on a multi-year rolling forward basis, which has helped us to mitigate some of the current cost pressures. However, our energy costs will run significantly higher this year, particularly in Europe. Currently, we expect total energy costs to be around â\u0082¬250 million in 2022, and we expect total energy costs to be materially higher in 2023. As Jean-Marc noted, we are in active dialogue with our customers on passing through these costs and are making very good progress across all of our end markets. While not to the same extent, weâ\u0080\u0099re also experiencing significant cost pressures across most other categories, which we expect to continue through the balance of 2022 and into 2023. Given these cost pressures, we are working across our across a number of fronts to mitigate their impact on our results. Our businesses continued to deliver strong cost performance in the quarter, and our recently announced Vision â\u0080\u009825 initiative is helping. Across the company, we are working to increase our efficiency, reduce our consumption of expensive inputs, and lower our fixed costs. On the commercial side, many of our existing contracts have inflationary protections, such as PPI inflators or surcharge mechanisms, where and where they do not we are working with our customers to include them. And we have already been successful in adding one in a number of existing contracts, where we are signing new contracts, they are coming with better pricing and a range of inflationary protection. As you can see, in the bridge on the right, year-to-date we have been very successful with pricing mix, the largest increment being priced in offsetting inflationary pressures. While inflation continues to be significant in 2022, we believe it's manageable, and that it will be largely offset by improved pricing and our relentless focus on cost control. 2022 has been a challenging year, from the standpoint of inflationary cost pressures that have run north of â\u0082¬200 million. Looking forward to 2023, with energy prices at current levels, and inflation generally remaining stubbornly elevated we expect the inflationary pressures in 2023 to be greater than in 2022. Consistent with our past practice, it is too early to provide any specific guidance for 2023, especially this year given the current environment and the number of open initiatives. However, based on our current view of 2023 costs and business conditions and the potential lag between when cost materials and when they can be passed through we believe that our 2023 adjusted EBITDA will be moderately lower than our 2022 adjusted EBITDA. We generated â\u0082¬74 million of free cash flow in the third quarter, bringing our year-to-date total to â\u0082¬160 million. As you can see, on the bottom left of the slide, we have continued to deliver on our commitment to generate consistent, strong free cash flow. At the end of the third quarter, our net debt was â\u0082¬2 billion. Our leverage remained at a multi-year low of three times at the end of the third quarter, or down 0.6 times versus the end of the third quarter last year. Given our 2022 guidance for adjusted EBITDA and free cash flow, and the impact of the stronger U.S. dollar, we expect leverage to end the year around three times. In North America, we have seen some short term inventory adjustments at the can-makers, but we believe this will be short lived. Even announced can-maker capacity additions in both regions, as well as recent announcements of Greenfield investments here in North America. Weâ\u0080\u0099ll participate in these growth in both North America and Europe through a series of projects to unlock 200,000 tons of capacity by 2025 as announced at our Analyst Day earlier this year. Turning to automotive, near term, the demand continues to be hindered by the semiconductor shortage and other supply chain challenges and the industry is already operating at a low utilization rate. Inventories are low, consumer demand remains high and vehicle electrification and sustainability trends will continue to increase the demand for light-weighting and low CO2 recycled content. Aerospace shipments were up around 50% in the third quarter versus last year, but are still only back to approximately two thirds of pre-COVID levels. We remain confident that the fundamentals driving aerospace demand remain intact, including growing passenger traffic and greater demand for new, more fuel efficient aircraft. It is also of note though, that many of the sustainability trends supporting growth in our core markets are very much at play here as well, in markets like those for semiconductors, rail and solar. On balance, even across our specialties portfolio, we like our hand to. Constellium delivered strong performance in the quarter, including record sales quarter adjusted EBITDA of â\u0082¬160 million. Achieving this will be a strong result, particularly given the significant number of unforeseeable challenges we have faced this year. Looking forward, 2023 will be another challenging year, given the extraordinary inflationary pressures we are facing, particularly on European energy costs and given the recent slowdown in certain industrial market. As Peter noted, we are currently expecting higher inflationary pressures in 2023 than in 2022 but we remain confident in our ability to pass through most of these costs in 2023, or in future periods. As inflationary pressures subside, we believe we will emerge an even stronger company. We have a diversified portfolio and our end market positioning will enable us to take advantage of sustainability driven secular growth trends, such as consumer preference or infinitely recyclable aluminum cans light weighting in transportation, and the electrification of the automotive fleet. As a result, we are reiterating our long term guidance of adjusted EBITDA in excess of â\u0082¬800 million by 2025 and target leverage range of 1.5 times to 2.5 times. We remain focused on operational performance, custom role, free cash flow generation, the achievement of our ESG objectives, and shareholder value creation. And so if you take kind of a three year horizon, that's typically what we're working with. And we aim to be approximately, kind of 75% to 80% hedge before the beginning of the year. So without saying exactly kind of what our kind of hedge position is for 2023, you can kind of figure it out in rough order of magnitude from that. And in the past, I believe you've mentioned that you're no longer consuming Russian metal across your portfolio as well. So weâ\u0080\u0099ll purchase some Russian metal, just for the record, and we've got contracts, so which we honor, I mean as you know Rusal is not sanctioned. I think, it's very difficult to ascertain what would happen if there was the sanctions and what kind of sanctions there would be against Rusal and whether they would apply to Europe or to America both. And what happened was, obviously, secession of purchases from Rusal, and a big spike in NME and premiums, which means on one hand, it gets a little bit more difficult in the short term to find the metal we need, but on the other hand, our scrap profits are increasing because the LME goes up. And I think, we'll be monitoring the situation complying with all the laws, regulations or sanctions, obviously. But I think from any business standpoint, that shouldn't be a catastrophe from it. And just one thing to jump into enhance what Jean-Marc said, we buy less than 5% of our metal from Rusal. Great, that's very helpful. And if we look at year-to-date this year, based on your bridge, it seems like you're roughly â\u0082¬30 million ahead on price versus cost. And obviously, you're outlining materially higher energy and continued inflation next year. So, the 210 buckets year-to-date, can you kind of give us a little bit of idea that, if you're ahead this year, then are you kind of thinking that you're going to see a reversal of maybe the same magnitude. So theoretically, it's kind of like what you're saying the operating leverage is getting negated by price cost. I mean, we're not giving guidance, gentlemen. We're trying to give you some color as to how we look in the future, given the pressures, we are feeling on the cost side on the with the inflation. And you're right, I mean if you look at page 12. However, there is a lag in terms of what we can do, how we can push through the cost pressures, and we are seeing more inflation on energy in the second half of this year than we are than we have seen in the first half compared to 2021. So our judgment at this point in time is, if I look at the big bucket, from a volume standpoint, we've got 76% of our business as Peter was saying in markets that we like that we like very much our key strategic market packaging should continue to be a resilient arrow, there are no signs of weakening whatsoever. And then in, in automotive, and we've been down, in 20, in 21 in 22, kind of 20% below the trend rate in terms of auto build. And in our specialties, there's more than half of them which are going to be very good going into next year. So we think on the volume side, it's no, it's not too bad in this and with the weakness we're seeing may continue into next year. In terms of pricing, we've been very strong and very good at pushing through price increases. There are more, there's more price increases coming. We've got PPI protection, typically a PPI would apply to the, the price, we compute the PPI on the prior period, inflation and then push it into the next period. So I think that's what we're trying to describe with our best view, kind of under the current conditions. We think that life is going to penalize us going into next year, but to us it's a temporary squeeze. And once we factor that in, we still feel very comfortable with 2025 guidance, we just think there's going to be kind of a pinch next year as the slope of increase has been so tremendous. In Europe, I mean, German PPI was up at 45% in September. I mean, it's, I mean, we're such in an extraordinary environment, that the PPI mechanism itself has not been tested with energy prices that good by 500% or 600% 700%. But then, also we were pushing through energy surcharges with success with some customers, but you're getting three months sooner or three months later, that does make a difference. You mentioned, the operation or setback at the Muscle Shoal facility. So in terms of the operational issues at Muscle Shoals, they essentially boil down to the key factor, which is the finding and retaining talents. I mean, I saw a stat recently that turnover staff turnover in the U.S. in manufacturing is around 40%. But that's painful in terms of bringing in new people, training them, and we have jobs that need pretty solid qualification and experience. So if it takes one year, two years to bring somebody to the top of their game, obviously, as you have more new people, the multiannual people spend time training them that gets that has an impact on productivity. And in addition, there's been some inventory adjustments in the North American system, as the market is growing very fast. And, that's never linear when the market grows too fast. I mean, the root cause, and also the cost side, the lack of experienced trained operators, engineers, is costing us a little bit in volume and a little bit in costs. We've got another factor too, which is with a decrease in LME and Midwest premium price. Our recycling operations are a little bit less profitable than we used to say that we had something around â\u0082¬5 million of benefit to scrub spreads in the past, they are not here anymore. I mean, training experienced people leading to higher cost and lower volumes and scrap spreads that are creating the situation. In percentage terms, it continues to be very favorable, itâ\u0080\u0099s just that there is the LME is lower but I think getting the situation back to a target product which has Muscle Shoals we will take a few quarters We have stabilized the situation. We used to have 150 open positions weâ\u0080\u0099re around 30, 40 now, so we're making progress, but it's going to take six months, nine months to, to get back on track. And in terms of the packaging market, I continue to see it as the free, strong and solid. And next year, you're right to point out that there is seasonality. And typically Q4 is going to be lower than Q3, which and the best quarter for balance  sheet is three to two. So that's, that's kind of my answer to your question. No, there is a there is a portion of it, which comes from the fact that lacking enough staff, trained staff, we have not been able to run at the rate of productivity that we wished we would have. So there is some of it, which is inventory adjustments in the market. I wanted to just touch again, on the inventory situation with lower prices. We've been kind of watchful, of inventory and work down. And I know, you mentioned that there's a reason to keep strategic inventories of certain alloys and so on. I think, well, first of all, remember that we, we hedge our inventory. So from a kind of a metal price variability, there might be some translation impacts, but there shouldn't be material cash impacts on us. But in terms of the, what we're seeing, we still see a decent amount of uncertainty in the market, in terms of metal supply, in terms of, end market demand and so forth. So as we see more stability and I think more stability would probably mean that, just to paint the picture, that we've got a little bit clearer guide on the direction of the economy, that number two, we have a little bit clearer guide on kind of where energy prices are going. And therefore, kind of the output from various smelters on metals and alloys is clear, then we'd be prepared to, to bring that down. But it's a, it's definitely an opportunity for us. I guess, the along the same lines, this quarter, you talked about and with your leverage on the call, you said at three times, and then the prior earnings. Last quarter, you had said below 33 times and of your leverage expectation. Number one, moving to the low end of the EBTIDA guide definitely impacts it. So we're generating all this, this free cash flow, but the FX is offsetting it. And if you kind of do the math on this, the incremental EBITDA that we get from kind of FX tailwind is not does not offset the negative that we get from the FX translation on the dollar debt. So as a consequence, we are, our leverage ends up being a little bit higher than what we expected it to be. I mean, we're running at a free high utilization, rate. So there's not that much, even if they were economical advantages which they are really not so much. And then just on the aerospace side, what are you seeing relative to OEM inventory stocking ahead of upcoming production increases, historically we would see policy in the line to prepare for these increases, clearly unique cycle. As I think Iâ\u0080\u0099m mentioned them for two years, markets were down by 30%, we were shipping at 50% of what we used to be shipping. And now that settles, I think it's too early to tell. Peter, you kind of pre-empted one of my questions there as to why not buy back some debt, given where it's trading. Well, again, if you think about what we said consistently, we want to lower growth debt. So that kind of points us in the direction of kind of paying down debt, as opposed to just extending. The other thing I'd say is that, despite some of these headwinds that we have, and as Jean-Marc said, we're kind of going through this blip of energy prices in Europe. But when we look at the overall kind of Horizon, we see a lot of opportunities for the company, internal opportunities that we can do, take advantage of to be better projects that we can do. So our one our product, so that leads us to more forcefully direct ourselves towards getting that balance sheet to a place where, what regardless of what the environment is, we can pursue these because we really believe that there are some opportunities to really enhance the returns of the company by some of these initiatives. If you look at the quantum of what becomes due in 2026, and you compare it to the free cash flow generation of the company, and to the level of inventory we have now that we will not have by that time, we should be paying that down quite handsomely. Well, we, I think you should expect it to be fairly linear. So however, within the context of the policy, we also have the ability to get the team together and decide there's a good opportunity here, or we should on the other hand, we should wait a little bit. But generally speaking, we're following the policy. Yes, that's a fair statement. It's not like everything you read, the Shoal's done is pure gravy. I mean, it's, it's definitely our best margin product, right. And then I guess, just switching the CapEx a little bit, obviously, you haven't given guidance or respect that. But I think in the past, Peter, you've sort of talked about the flexibility to adjust CapEx and market conditions. And I think we're, the frustrating thing for us is that we're really almost there. But the one thing is, is that when we look at this, and this goes a little bit to the response that we gave to Karl's question. We think we've gotten to a place where we need to run the company for the long term benefit of our stakeholders, right. And therefore, we think that we can continue with our CapEx plan the plan that we outlined in the in the analyst day, and put some of those projects in place to deliver returns, even though we might be a little bit lower on the adjusted EBITDA side. So, so for the time being, I mean, again, never say never, but for the time being, our plan is to is to stick to the CapEx plan that we had outlined at the analyst day and build the company for the future, taking advantage of the opportunities we see. And actually, on some of these projects that we have in the site that we I liked it that the April's analysts day their profitability, their returns are improving. I mean, the higher energy costs are making quite a few of these projects around the recycling and efficiencies very attractive to us. So yes, when the plan would be to plough ahead in 2023, and onwards, because we think these are very good projects in the long in the short and long run for shareholders."
}