{
    "symbol": "OSK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 12:45:05",
    "content": " As I mentioned in my opening comments, our Access Equipment team delivered strong performance in the third quarter with a 420 basis point adjusted operating income margin improvement sequentially and a nearly 800 basis point improvement year-over-year, while supply chain dynamics continued to limit production as well as contribute to elevated freight and expediting costs. Adjusted operating income of $114 million for the third quarter was in line with our expectations despite the unplanned revenue shortfall of approximately $130 million, primarily due to supply chain disruptions. Further, our revised outlook for higher inflation projections in our Defense segment but due an unfavorable cumulative catch-up adjustment during the quarter of approximately $14 million versus our most recent expectations. Defense and Fire & Emergency sales were down by $132 million and $91 million, respectively, driven primarily by supply chain disruptions impacting production as well as expected lower DoD tactical wheeled vehicle requirements in the Defense segment and lower RF demand in the Fire & Emergency segment as airport spending has not returned to pre-pandemic levels. Fire & Emergency operating income was down $28 million versus the prior year as a result of lower sales volume, driven in part by supply chain disruptions and unfavorable price/cost dynamics. Please proceed with your question. And I'm wondering if we're looking for pricing to be up mid- to high single-digits next year, would that get you to your historical low to mid-teens margin profiles at this $4-plus billion revenue run rate in Access Equipment. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}