{
    "symbol": "NYCB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 11:37:06",
    "content": " On the liability front, we also grew our deposits during the quarter despite higher interest rates, which led to outflows in certain categories, total deposits increased $461 million compared to the previous quarter and have increased $6.6 billion or 25% annualized so far during 2022 to nearly $42 billion. On a year-to-date basis, loan-related deposits were up just under $800 million or 26% annualized since we started refocusing on this deposit channel during the first quarter of 2021, total loan-related deposits have increased $1.3 billion or about 37%. Our BaaS deposits fall generally into three verticals: Traditional BaaS, which totals $5.3 billion in deposits; Mortgage-as-a-Service, which caters to mortgage banking and servicing companies totaling $2 billion; and Government Banking-as-a-Service, which caters states and municipalities as well as the U.S. Treasury's preloaded debit card program totaling $579 million. Third quarter net interest income totaled $326 million, up $8 million or 3% on a year-over-year basis. Please proceed with your question. Please proceed with your question. The coupon is extremely strong, given the -- I mean you look on a year-over-year comparison basis, we're going from a 3% market to a 6% market overnight, which is powerful towards repricing this book of business. Please proceed with your question. So this is something we're focusing on a daily basis, it's fourth quarter, and we're excited about the new government piece of business that's coming on as well as the potential of balance sheet consolidation, which will give us some significant choices as we embark upon a transformational opportunity here. Please proceed with your question. So that is embedded within the franchise within our operating people, but we're going to move people around, and we're going to make sure we have the right support for these lines of businesses I will tell you the challenges is onboarding some of the unique opportunities in traditional bats because obviously, it takes time, and it's API interfacing within the core, and we're working on new opportunities within the core that can make it a lot more efficient but we are staffing in that area. Please proceed with your question. Please proceed with your question."
}