{
    "symbol": "NYCB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 11:51:11",
    "content": " Banking-as-a-Service deposits totaled $7.8 billion at June 30, 2022, which is significant progress considering we started this business from scratch in the first quarter of last year with virtually zero deposits. Our Banking-as-a-Service related deposits for largely into three categories; traditional BAS, which primarily encompasses fintech-related deposits totaling $5.5 billion; government Banking-as-a-Service, serving municipalities and eventually the U.S. Treasury's prepaid debit card program totaling $652 million; and Mortgage-as-a-Service, Cadence on mortgage banking and servicing companies and consisting of escrow accounts for P&I payments totaling $1.6 billion. Total loan-related deposits rose just under $500 million during the second quarter to $4.9 billion, up 44% annualized on a linked-quarter basis. All totaled, since we're focusing on this deposit source in the first quarter of last year, loan-related deposits have grown $1.4 billion, up about 40%. This quarter's loan growth was driven by our multifamily portfolio, where we continue to make market share gains as competition abates along with heightened refinancing activity as market interest rates move higher during the quarter forcing many borrowers to come to the table to refinance the property sooner rather than later. At June 30, the multifamily portfolio was $36.8 billion, up $1 billion or 11% on an annualized basis compared to the previous quarter, while the specialty finance portfolio totaled $4.1 billion, up $806 million on a linked quarter basis or 24%. Loan originations set a new record as we originated $5.3 billion during the second quarter, up 49% compared to the previous quarter and up 72% compared to the second quarter of last year. Second quarter net interest income totaled $359 million, up $28 million or 8% on a year-over-year basis. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}