{
    "symbol": "GT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 10:49:12",
    "content": " At this time, I would like to welcome everyone to Goodyear's Fourth Quarter 2022 Earnings Call. Today on the call, we have Rich Kramer, Goodyear's Chairman and Chief Executive Officer; Christina Zamarro, Chief Financial Officer and Darren Wells, Chief Administrative Officer..  During this call, Goodyear, we'll refer to forward-looking statements and non-GAAP financial measures. Forward-looking statements involve risks, assumptions and uncertainties that could cause actual results to differ materially from those forward-looking statements. For more information on the most significant factors that could affect future results, please refer to the important disclosures section of Goodyear's fourth quarter 2022 Investors letter and their filings with the SEC, which can be found on their website at investor.goodyear.com, where a replay of this call will also be available. So as we did last quarter, we use this time again to focus solely on your questions. As you saw with the announcement in December, Christina became our Chief Financial Officer as of January one, replacing Darren who moved into a new role of Chief Administrative Officer. And given the transition, Darren is joining us on the call today, but Christina and I will take the lead in responding to your questions on these calls as we go forward. So with that, Ashley, let's open up the call for the first question. First question, maybe I think last year, around the same time, I think you had helped us out with sort of like framing sort of a base case scenario for what could happen to free cash flow for you guys for the full year ahead under certain conditions. And I have to send out thanks to our teams, this has been a great push by our Investor Relations Team, FPNA our controlling teams, all the put that together. And again, we've received really great feedback on that. And if you look through the drivers, we've laid out as part of our letter, and if you were to take the assumption, and so just stay with me on the assumption, if you were to take the assumption that our EBIT was going to be flat in 2023 with our EBIT in 2022, which was about $1.1 billion. Emmanuel, what I'd add to that is, it's not that we're targeting flat earnings. And after a really tough setup in the first quarter, as you read in the letter, the trajectory should improve meaningfully as we move to the remainder of the year. In the second quarter, our goal is for segment operating income to approach 2022's levels, with volume stabilizing and given in lower year-over-year raw material cost increases that we're expecting in the second quarter. Assuming a relatively stable economic outlook, then we would begin to see the benefits in the second half of higher volume on either comparables, strong growth in Asia-Pacific driven by a recovery in China and lower inflation levels that we're expecting in the first half of the year. And then of course, at current spot prices, tailwinds and our raw material cost. Historically, this has been the time in the cycle where we've seen growth in earnings and growth in our margins as well. This compares to maybe a $1.2 billion $1.3 billion framework that you discussed previously, in terms of the investments you need to make in gross. And so what I will tell you is, as we went through 2022, we just scale back our plans for capital expenditures, just given the outlook for the global macroeconomic environment. As we look at 2023, we expect to continue to invest in the Americas and in Asia-Pacific, although investment levels in EMEA will decline, just given the current macroeconomic outlook there. Yeah, Emmanuel, I'll just jump in and echo Christina's points. And then when we do that we really don't shortchange ourselves, excuse me on what we see as long-term growth projects that we have to do. And I would just tell you, even if you see things like things that we did at CES around intelligent tire and around sustainable tire. There are projects, growth projects, industry leading sort of technological projects that we're going to continue to move forward within the capacity of the spend that we have. And then just very finally, I guess, since you're mentioning the environment, can you maybe just provide a little bit your perspective on some of the drivers of this market, demand weakness that seems to be across every region, every major region, I guess. We reacted not only to the Americas, but Europe as well, as you saw on our Investor Letter by taking production down with that focus on making sure we don't have excess inventory, a bit of a slowing market, and to focus on cash as Christina went through. But as Emmanuel, as I think about the Americas going forward, you also saw in our letter, we saw that our channel inventories are up about 10%. I mean our distributors are really rebuilding their inventory, we didn't see any buy ahead, so I'd say in anticipation of any price reductions or anything like that. A little slow to start, but I think we have a stronger second half coming, a little slow to start, because we're bringing some of those costs on the balance sheet of unobserved inventory into the first quarter as well. Picture, sell out was about flat in the fourth quarter, and year-over-year in the fourth quarter. Europe, I think, a little bit different story. I would take a step back and say we feel really good about the initiatives, we've put in place in Europe. In the quarter, we got volume, we got price mix ahead of raw materials, again, and we had share gains in a down market across the board for I think the 11th or 12th quarter in a row. We also as you know, took a lot of actions there to get our costs in line. But obviously, in Europe, we've seen big energy inflation in Q4 driven by the war. And we saw in anticipation of these high energy costs, really sort of the reduced consumer demand out there, as we saw really weak markets in the consumer replacement business, particularly in November and December, where we saw a consumer base thinking about big energy bills, and the channel sort of slowing down on wanting to buy more inventory. First half especially second half again, as Christina said will be better. And remember in Europe, we've done a lot in terms of restructuring our footprint head and full value, so we did in UK in Belgium. And we have a higher mix into EVs a high EV win rate a high luxury SUV in truck, win rate as well with the domestic OEMs or Chinese OEMs. And as COVID, sort of as we get through COVID, if I can say that's going to happen toward the second half, we see a big stronger pull and it makes up in replacement as well. And to get ready for that we continue to invest in distribution in the key markets in China and in India, as well. So, so overall, look, we got to get through Q1 first half if you will, as we see some of this tumultuousness. But beyond that, we do see some upside and feel relatively good. Rod, from how we're looking, I guess, I'll say price mix and how we're looking at the raw material environment that's obviously related to that. That's true for Goodyear, true for the industry as well, and we need to recover that. I would tell you, our momentum has been very good. And in two of the businesses in Europe not being one of them, we also offset some of the other cost increases we had as well. Now as Christina mentioned as well, we see this potential decrease for raw materials. And I would tell you, our plan is to capture the benefits of those raw materials and see that in margin improvements as we continue to capture our value proposition out in the marketplace. And I think, Rod, you know this well, having been with us so long, historically, in a period of declining raw materials, we're able to grow margins, we're able to drop through those benefits into the -- into our earnings. And also tell you what can help them, excuse me, is we also see the OE business coming back, which means they'll be a pull on the best capacity that the industry is making. And then finally, Rod, I'll just tell you, in terms of what we're seeing in the marketplace, we have not seen any decreased demand or trade down in our Tier 1 volumes at all. But I'll tell you, I'm not sure that's a trade down or a price issue as much as it is. All those sort of imported tires that were backordered and paid upfront in cash by the distribution, particularly in the U.S. I'm talking here that sort of hit the docks in the past quarters, that obviously drove the industry numbers. But again, that doesn't really impact sort of our Tier 1 tires or the value proposition for those. That was principally driven by our chemical business, as you know, that's a pass-through margin business. As I look to 2023, expecting good growth in these areas, really driven by our aviation business, seeing and expecting strength in volumes, strength in pricing and mix. And we're seeing that across the portfolio, especially given the reopening and demand pull out of China. I have to say, over the last two to three years, we do feel that we've made significant progress on closing our conversion cost per tire gap versus our competitors. I would say two or three years ago, we had estimated that gap to be in and around $4 per tire. And today, we have said with the closure of a very high cost facility in Gaston in the U.S., a big restructuring in EMEA. And then, of course, you add a benefit in as much as many of our competitors had low-cost supply coming into Western Europe out of Russia. Put all those together, and we think our disadvantage right now is nearly half of what it would have been, say, two or three or four years ago. And what I'll tell you is that the investments that we have in the plan we started last year and continuing in 2023 in the Americas, in Asia-Pacific are very high return projects and as much as they're more expansionary instead of greenfield type plants. Well, I think the way I'd answer that, John, and the one thing I would say is we operate as a team. So whether Darren is in the CFO role or in a different role, helping us with strategy where Christina and Darren have worked together for so long, I think this was a really natural and elegant transition, if I can say. And I look to the leaders of our business units as well as our CTO, Chris Helsel. I think that when you look at what we're doing, it's the team that really is where the value is. But I will say from a strategic perspective, I think, one, I would highlight what Christina just talked about, which is to say that we are keenly focused that we have to get our cost structure continuingly in line, not only relative to competitors who also get better. We're keenly aware of that, and we need to make sure that our operations continue to get more efficient every day. That means what we do in our factories on conversion cost, it means where our factories are, we've taken footprint actions. And we're going to get -- we're going to continue to get I would say, Darren, I'll say creative on how we make sure that we do that. And like we did with Cooper, we need to think about how we can use that capacity more wisely as we move ahead. Secondly, I think I always tell my team, we have to have the best products in the industry. We have the freshest product portfolio we've ever had in Asia and Latin America and in the U.S., and that's both in commercial and in consumer. We don't talk about it as much, but we don't talk about a lot of the things that are working as well as they are. They're not revenue generating today, but the changes we're seeing in mobility, the changes from just making a, if you will, a dumb tire to an intelligent tire, that actually has a place on an intelligent vehicle, a connected tire that improves the safety and performance of vehicles. And it actually has a role that becomes part of those vehicles operating systems, both in terms of how it's integrated to the vehicle and the service element of it is something that gets us excited about where mobility is going and what the role of Goodyear and the tire is. It's the basics and it's the technological trends that the industry is going, our ability to execute on both of those simultaneously is going to continue what separates us going forward. And the reason I say that -- for instance, our retail stores now have Cooper product in it, and that is and has turned into in terms of the performance of those stores sort of a 1 plus 1 equals 3 in terms of how they're operating, how we're taking care of customers and the products that we're offering them. And they can do some of those things really well, and we are not going to touch those. We're going to make sure what they did really well and candidly, what they were better at than we are. We're going to keep the best of that, and we are, while we're integrating where it makes sense to do. And I would tell you, both the terms of the synergies, we're on the run rate synergies that we said we were going to get. And I think that the market side, we said we weren't going to do anything rash right out of the box. Correct me if I'm wrong here, but the second quarter, it should have a similar overhead absorption impact in the first quarter, and maybe that's $60 million to $70 million. And then from there, the three buckets -- key buckets as I see it would be unit volumes, price mix versus raws and then the non-raw materials inflation piece. Yeah, just any color on that would be super helpful. So I guess I would start by saying, in the second quarter, we see volumes stabilizing. Obviously, there's a very significant step down in raw material price increases from Q1 to Q2. And then just -- well, then how to how do you foresee the elevated channel inventories in Europe, I think a 30% above year ago levels. With the price increase and with replacement sell-in demand down for the industry, a mid-teens entering '23. It's a great question, James. And so what happened in the first quarter is, we see a shift from winter tire sell-in in the fourth quarter. In the first quarter, we shipped into a summer tire sell-in season. And there are no further questions at this time, and this will conclude today's Goodyear fourth quarter 2022 earnings call."
}