{
    "symbol": "IVT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 13:12:02",
    "content": "  Operator: Thank you for standing by, and welcome to InvenTrust Second Quarter 2022 Earnings Conference Call. Before we begin, I would like to remind all listeners that today's presentation is being recorded and a replay will be available on the investor section of the company's website at inventrustproperties.com. I would now like to turn the call over Mr. Dan Lombardo, Vice President of Investor Relations. With me, are DJ Busch, President and Chief Executive Officer; Mike Phillips, Chief Financial Officer; Christy David, Chief Operating Officer; and Dave Heimberger, Chief Investment Officer. Some of today's comments may contain forward-looking statements about the company's views on the future of our business and financial performance, including forward-looking earnings guidance and future market conditions. Any forward-looking statements speak only as of today's date, and we assume no obligation to update any forward-looking statements made on today's call or that are in the quarterly financial supplemental or press release. The comparable GAAP financial measures are included in this quarter's earnings materials, which are posted on our Investor Relations website. Our simple and focused business plan continues to produce strong results near the top end of our sector, and we believe this strategy has well-positioned to navigate any potential volatility in the economy and the capital markets. Our almost exclusive Sun Belt portfolio differentiates us from our Strip Center peers, which continues to see strong migration and job creation patterns. From Texas to Florida, North Carolina Sun Belt remains desirable for business relocation. Companies such as Apple, Tesla, Citadel and Honeywell to name a few, have all recently announced new or additional locations in one of our markets, bringing new population in high paying jobs to our already growing communities. These factors and the high traffic patterns that our properties do not go unnoticed by retailers, which is in turn drive continued demand for leasing our space. ESG is not new to InvenTrust, and this report encapsulates the various activities across our company and the objectives we are motivated to pursue. These efforts align with our commitment to transparency and outlines our pledge for being an even greater corporate partner to the environment, communities that we serve and all of our stakeholders. We invest in our properties, creating community gathering spaces, and prioritizing the installation of energy management systems and electric vehicle charging stations across our portfolio. InvenTrust analyzes the center's current state of environmental practices, as well as any opportunities to implement additional activities to support an environmentally friendly portfolio. Equally important to our sustainability pursuits, we are also currently in the process of adding diversity to our board of directors. Our boards guidance, experience and leadership is and will continue to be an integral part to our long term success. While pricing for core Sun Belt assets appears resilient, we remain extremely disciplined in our evaluation of new opportunities, and their corresponding contribution to our potential external growth. During the quarter, we acquired Bay Landing, grocery-anchored center just outside of Naples, which is an area seeing excellent demographic trends. With that, I'm going to turn the call over to Mike to discuss our financial results and guidance in more detail. As we reported yesterday, our core FFO grew to $57.7 million for the first six months of 2022 or $0.85 per share, representing a year-over-year increase of 33%. In addition, we realized G&A savings of $0.06, due to non-recurring costs of our succession planning in 2021, and we saw a positive $0.04 impact on our $100 million share repurchase in Q4 of last year. Pro rata same-property NOI year to-date reach $74.8 million, growing 9.9%. The increase was primarily driven by contractual rent increases, occupancy gains and the timing of collections of cash basis tenants. In June utilizing its investment grade rating, InvenTrust completed a $250 million private placement offering. Using the delayed draw feature, funding will occur on August 11, and we intend to use the proceeds for general corporate purposes including the repayment of debt and future acquisitions. Next, I would like to update our full year 2022 guidance. We're lifting the low end of our core FFO range to $1.52, while maintaining the high end of the range at $1.56 per share. As we mentioned last quarter, we continue to expect our quarterly pro rata same-property NOI and core FFO growth to decelerate in the back half of the year, due to significant out of period rent received in Q3 of 2021, an increase in property operating expenses and increased interest expense. Bottom line for the full year, we expect to deliver meaningful NOI and core FFO growth, and the strong results will be near the top end of the sector. With that, I'm going to turn the call to Christy to discuss our portfolio activity. As DJ mentioned, InvenTrust continues to experience strong operational and leasing performance. Our lease occupancy ended the quarter at 95.4%, a 100 basis points above Q1 and 250 basis points above this period last year. Our anchor lease percentage for the first six months of the year increased to 98.2%, and our small shop remained at 90.5%. Both all time highs, giving us significant pricing power when negotiating leases. With our occupancy levels increasing, our goal is to minimize the spread between our economic and lease occupancy rates. Even in these times of supply chain challenges, we are finding creative ways to reduce delays and open tenants on time and on budget. Our annual base rent as of June 30 for the pro rata same-property portfolio was $19.03, an increase of 2.7% compared to June 30 of 2021. In the second quarter, we signed 78 leases totaling approximately 289,000 square feet of GLA. Our leasing team continued to see interest in many retail categories with tenants citing new leases, including Towline , Homegoods, Crunch Fitness and Burlington. In an environment where new tenant CapEx is increasing, we view our strong retention rate as a strength. These results further demonstrate our conviction around the ability of our Sun Belt assets to attract new tenants, maintain occupancy and most importantly drive rent. Although, we are experiencing strong demand for space, we continue to closely monitor how inflation is affecting our tenants and our consumers. Due to the necessity based nature of our assets, sales for our tenants remain healthy. But currently, tenants are adjusting to mitigate risk or any significant disruption to their operations. To conclude, I wanted to highlight a redevelopment project that we are extremely proud the InvenTrust team was able to complete and handed space over to the tenant this quarter. In a time of rising costs and supply chain delays, the team was able to hit both our budget and delivery timeline in the rebuilding of a brand new Publix at our Suncrest Village property in Orlando. On top of that, we expect this project to generate significant NOI growth for this center, a true win-win for InvenTrust and tenants at the property. These include, repurchasing $100 million of shares at $25 per share. Moving closer to 100% Sun Belt portfolio by acquiring $190 million of assets in Austin, Texas, and selling two of our Colorado assets. Putting in place an ATM program and a share repurchase program, receiving our inaugural investment grade rating from Fitch Ratings, executing on a $250 million private placement to fund our growth strategy and diversify our debt capital structure, and publishing our inaugural ESG report. These accomplishments, as well as our inclusion in numerous indices, has moved our institutional ownership closer to 60%. Every day, the InvenTrust team is motivated by our core principles, and we will continue to strive to bring value to our stakeholders. And I would love to get your comments on, we're sort of in unprecedented for the portfolio anyway, occupancy levels already. No, it's obviously an important observation. I think we're not alone in the sense that we're getting certainly past pre pandemic occupancy levels, but getting close or past peak occupancy levels, which is a tremendous tailwind as we think about pricing power. We're actually having success in areas of our centers that have struggled to be leased in the past, whether it's just a suboptimal location or something else. I do think to your point on leasing costs, that's more of a mix issue than trying to get space that's been maybe long period of time vacant. Because we want to make sure if it has been a space that has struggled in the past, that we're not putting too much capital that in the case that it may come back to us. So we're actually being more cautious, not only from a base rent perspective, to make sure those tenants that are taking some space that's struggled in the past to be more successful, but also with the capital that we're investing in those as well. Obviously, in the current economic backdrop, we are in unprecedented territory as far as the lack of bankruptcies. Certainly, I'm not sure that that will last forever, but it's obviously been a huge boon for us in the interim. And obviously, you're predominantly Sun Belt. Obviously, we like all three of the markets that you mentioned, Dallas, Atlanta, and Austin. I think when we think about the total returns that we need to get to or we want the word underwriting, obviously Austin is going to be on the lower end of that spectrum because of the dynamics and the growth prospects in that market, not only from a demand perspective, but from a lack of supply perspective. And it doesn't have the same level, I guess, for lack of a better word, nimbyism  that, places like Austin, and even, the triangle in North Carolina have. Those, we expect to obviously continue to invest in those markets. But we are to point out some other markets that we are equally or maybe even more excited about the dynamics that we've seen in central and west Florida and been very exciting on just the assets we have, which goes to our acquisition of Bay Landing. And then we would love to get further investment in concentration in the Carolinas, where many of our peers have assets as well, but the dynamics, excuse me, there. From our perspective, and what we're seeing on the ground, are a little bit closer to Austin than maybe a Dallas or Houston or Atlanta. And maybe another in terms of cap rates, the view is, well, interest rates have gone up significantly. The market, certainly the stock market has repriced everything as if cap rates are going to increase. I think it's just, and I mentioned in our prepared remarks, it's just more discipline. Because to your point, what we've seen in our current pipeline is pretty sticky pricing. And obviously, most of the stuff that we're looking at, continues to be core grocery in the markets that were already in. A lot of that is due to the core grocery centers usually can be bought on balance sheet, they don't -- they're not as highly dependent on secured financing. I think if the larger assets, perhaps in the power center space, I think that is more dependent on the mortgage market, probably has moved a little bit and may move a little bit more. We haven't seen the same, but I would I would agree with your sentiment that, we could expect a pullback. Obviously, we had a fantastic run up in values and down in cap rates just from our observations over the last 18 to 24 months. And if that cools off a little bit, that's okay."
}