{
    "symbol": "JBSS",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-02 14:59:05",
    "content": "  During the second quarter, net sales increased over $21 million or 8.3% compared to last year's second quarter, and we delivered strong bottom line growth as our diluted EPS increased 26.5% to a $1.45 per share. Our sales volume grew over 3% in the consumer channel, excluding the one-time loss of a private brand grocery customer, compared to the overall decline in the snack nut category. Starting with the income statement, net sales for second quarter of fiscal 2023 increased 8.3% to $274.3 million, compared net sales of $253.2 million for the second quarter of fiscal 2022. The increase in net sales was due to a 12.7% increase in the weighted average sales price per pound, partially offset by a 3.8% decrease in sales volume, which is defined as pound sold to customers. Sales volume decreased 2% in the consumer distribution channel, primarily due to a 5% decrease in sales volume for our branded products, which include Fisher recipe nuts, Fisher snack nuts, Orchard Valley Harvest, and Southern Style Nuts. Total operating expenses for the current second quarter decreased $1.9 million in a quarterly comparison due to decreases in advertising spend, incentive compensation, loss on asset disposals and freight expense, which were partially offset by an increase in base and equity compensation. Now, taking a look at inventory, the total value of inventory on hand at the end of this current second quarter decreased $5.7 million or 3.2% compared to total value of inventory on hand at the end of the second quarter of fiscal 2022. The weighted average cost per pound of raw nut and dry fruit input stock on hand at the end of the current quarter decreased 24.2% compared to weighted average cost per pound at the end of the second quarter of fiscal 2022 and was mainly due to lower acquisition costs for all major tree nuts. The increase in net sales was primarily attributable to 11.1% increase in the weighted average selling price per pound, partially offset by 1.1% decline in sales volume. Our produce nut brand Orchard Valley Harvest declined 8% in dollars and 8% in pound sales, driven by distribution declines in mass, offsetting strong performance in the grocery channel."
}