{
    "symbol": "CVAC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-16 16:33:05",
    "content": " We intend to access and translate available data into a meaningful pipeline of new mRNA cancer vaccine candidates driven out of the former Frame Cancer Therapeutics site in Amsterdam, which we plan to make our cancer antigen discovery hub. I am now on Slide 12 to walk you through our development plans in oncology for 2023 and beyond, and how we plan to translate our mRNA technology into new cancer vaccine candidates. Looking at the concept of shared antigens introduced earlier in this presentation, data suggests that an off-the-shelf vaccine addressing, for example, the four most frequently shared tumor associated antigens for breast cancer can address about a quarter or even a third of all triple negative breast cancer patients. In the context of our strategic focus on the development of mRNA based cancer vaccine candidates that target tumor specific antigens, the clinically validated immuno-modulatory characteristics of CV8102 represents a valuable and potentially complementary technology. To round up the components of our oncology roadmap on Slide 16 and 17, let me briefly address the two oncology enablers that Ulrike already highlighted on Slide 12, the first being a new and proprietary lipid nanoparticle, or LNP program, for potential application with our cancer vaccine candidates. Moving on to the second oncology enabler on Slide 18, I would like to look at the role The RNA Printer is envisaged to play not only in the internal expansion of our oncology pipeline, but also in the opening of new avenues for personalized mRNA based cancer therapies. In 2023, we plan to start two clinical trials in oncology to integrate this highly differentiated platform with our versatile second-generation mRNA backbone to strengthen our clinical development pipeline with novel cancer vaccine candidates supported by The RNA Printer and our new LNP technology. Thanks for taking my question. Thanks for taking my question. So the expectation, and this is what we tried to put into the presentation there as well, the readouts, what we want to see is certainly chemical modified versus non-chemical modified as we tried to explain that the second-generation backbone is playing a role on our technology level, then also for oncology where we want to start clinical trials in the next year. So it's going far beyond infectious disease, therefore, non-chemical modified as well as chemical modified, then certainly the monovalent versus the multivalent, which is the first clinical trial we started in South America earlier this year, to see exactly this one because this is a technological effort there as well, if you put more RNAs into the same vial, especially starting with a low dose, and that certainly, of course, is our three other points. Thanks for taking my question. Thanks for taking my question."
}