{
    "symbol": "BDN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 15:01:05",
    "content": " Our overall leasing pipeline stands at $4.1 million square feet, broken down between $1.3 million on our operating portfolio and $2.8 million square feet on our development projects. The $1.3 million square feet pipeline on our existing portfolio has approximately 350,000 square feet in advanced stages of negotiations with, as I mentioned a moment ago, 25% of that pipeline consisting of prospects looking to move up the quality curve. The leasing pipeline on our development projects of $2.8 million square feet increased 493,000 square feet or 20% during the first quarter. We deployed $28.6 million of these land sale proceeds into a 20% equity stake in Cira Square, which is an 863,000 square feet property located adjacent to our Cira South and Schuylkill Yards Projects in University City. Of the 14.2 million square feet we can build, only about 25% is dedicated office with the ability to do between 3 million square feet and 4 million square feet of Life Science space and incorporating that in that square footage pipeline is the ability to do that 4,000 apartment units. Portfolio operating income totaled $70 million and was below our fourth quarter guidance of 2 million -- of about $2 million, primarily due to higher seasonal Portfolio Operating expenses, but sequentially flat as compared to the fourth quarter despite the 252,000 square feet of negative absorption. Your line is open. Your line is open. To kind of close out that building at 250 Radnor we've got a lease out for 12 and then we've got some advanced dialog with some other Life Science companies of about 100,000 square feet and then at Schuylkill Yards and kind of some early negotiations and discussions at 3151, we've got an ever-increasing building pipeline there. Your line is open. Your line is open. Your line is open. The in terms of the overall contracts, I think you'll see us look to lighten our investment base in Philadelphia over the next couple of years both in CBD Philadelphia, as well as the inner ring suburbs, so certainly as we take a look at our overall operating portfolio that's certainly a key component of that you saw us do a little bit of that few years ago with the, the joint venture with the sovereign wealth fund at Commerce Square."
}