{
    "symbol": "NTCT",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-26 13:41:05",
    "content": " In the third quarter, we delivered solid financial results with Q3 revenue of $269.5 million, representing year-over-year growth of approximately 3%. As a result of this top-line growth and our healthy operating leverage, we delivered $1 of diluted earnings per share in the third quarter, representing a growth rate of approximately 12% year-over-year. On a year-over-year basis, product revenue grew nearly 10% and service revenue grew approximately 3%, while service assurance revenue grew by more than 8% and cybersecurity revenue grew by more than 1%. Additionally, we delivered $1.81 of diluted earnings per share in the first nine months of fiscal year 2023, representing approximately 16% year-over-year growth, more than double that of our revenue growth rate over the same period. In our service provider vertical, revenue grew by more than 9% year-over-year in the first nine months of fiscal year 2023. In our enterprise customer vertical, revenue grew by approximately 3% year-over-year in the first nine months of fiscal year 2023. Focusing first on our quarterly performance, total revenue grew 2.8% year-over-year to $269.5 million. At the end of the third quarter, our backlog was approximately $54 million, consisting of approximately $31 million of fulfillable orders and approximately $23 million of radio frequency propagation modeling projects, with most of the radio frequency propagation modeling amount categorized as deferred revenue from a financial reporting perspective. In the first nine months of fiscal year 2023, our service provider customer vertical revenue grew 9.3%, while our enterprise customer vertical revenue grew 3.2%, both on a year-over-year basis. For the first nine months of fiscal year 2023, our service assurance revenue increased by 8.1%, while our cybersecurity revenue increased by 1.4%, both on a year-over-year basis. In the first nine months of fiscal year 2023, our revenue was more concentrated in the US year-over-year, primarily due to the increase in revenue related to radio frequency propagation modeling projects from Tier 1 domestic carriers. Additionally, one customer represented 10% or more of our total revenue in the third quarter and first nine months of our fiscal year 2023. We ended the third quarter with $416.2 million in cash, cash equivalents, and short- and long-term marketable securities, representing an increase of $49.1 million since the end of the second quarter of fiscal year 2023. During the third quarter of fiscal year 2023, we concluded our Accelerated Share Repurchase transaction, receiving the final 1.3 million shares, which resulted in a total repurchase amount of $150 million or approximately 4.6 million shares, at a weighted average price per share of $32.97."
}