{
    "symbol": "PDS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 20:34:07",
    "content": " Precision's revenue in the third quarter was $429 million, 69% higher than the same period last year, while adjusted EBITDA was $120 million, an increase of 163% from Q3 2021. With repricing of spot market rigs impact of Alpha Technologies Evergreen solutions, we project normalized average margins to increase to approximately USD 11,500 per day in Q4 and we expect a similar sequential increase to average margins of USD 1,000 per day to USD 2,000 per day in Q1 of 2023. To deliver on our customer-backed rig upgrades, of which we now expect to have over 30 during 2022 and certain drill pipe commitments, we are increasing our capital budget to $165 million this year from $149 million. While term contracts in Canada are less common, customers are increasingly looking to secure access to our Super Triple rigs by locking in those rigs with long-term take-or-pay contracts rather than running the risk -- the availability risk of the traditional pricing agreement with no firm use commitment. With strong commodity prices and a weaker Canadian dollar, conventional heavy oil and Clearwater activity is accelerating, driving high customer demand for our super single rigs which are achieving the highest utilization level since 2014 and we expect continued growth into next year. 2014's $25 million rig with today's super-spec equipment, scope and steel inflation would likely cost over $35 million to build and that's only if the components are available in the supply chain which is highly unlikely. So it's fair to conclude that while day rates are well up from the lows of 2020, the value and cost of our rigs, the crews and technology has been substantially increased and the value we provide to our customers has never been better. So I think if your expectations for activity increases next year are a certain percentage say, 20% higher than this year, then the baseline would be a maintenance capital that's 20% higher than what we had in -- or what we're anticipating in 2022. I thought our rig count would get into the high 70s, maybe 80, maybe get a bit above 80 in Q1 which would be about 15% higher than last year for activity and that's based on customer conversations and indications and for bookings that we have. On the super-spec front in Canada, I think the market is probably short -- probably short 4 or 5 rigs in Q1 which means that customers may then look to push some more work into Q2 which should give us a stronger push into Q2. The drilling contractors in general and Precision, for sure, I think have been able to manage that a little better, particularly with contracted rigs where you can attract crews because they know they've got a stable work for a long period of time and it's a structured, not call out-style work."
}