{
    "symbol": "BLZE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 08:46:02",
    "content": " Our B2 Cloud Storage business grew at strong 48% comprising 36% of total revenue, and our Computer Backup business grew 18% year-on-year. While the Computer Backup business remains the larger of our two cloud service offerings at the moment, our strategy and increasing investments center around capitalizing on the roughly $100 billion total combined 2025 addressable markets for B2 Cloud Storage as projected by IDC. To help prospective customers, we were excited to launch our Universal Data Migration program, which is a set of integrated services that make it easy and free for eligible customers to move data from a wide variety of sources, including other cloud storage providers and all the common on-premise storage solutions. With Universal Data Migration, customers can easily and freely migrate data from where it may be locked in today and immediately start getting the benefits of B2 Cloud Storage, including ready access to all data, a dramatic cost savings over alternative offerings and the ease of use of our platform. Additionally, B2 Reserve offers new benefits, including our Universal Data Migration service to help customers move their data into B2 Cloud Storage, premium support and more. By unlocking an improved customer experience for these Alliance Partners, our Partner API allows them to easily build additional cloud services into their product portfolio, which in turn drives increased demand for Backblaze B2 as the cloud storage back end for those services. CTERA offers cloud-based Network Attached Storage or NAS for short, and uses Backblaze's B2 as the storage cloud underlying the offering. By switching to Backblaze's B2, Fortune Media was able to store those hundreds of thousands of hours of video on a storage platform that enabled them to quickly access any footage, thus eliminating multiple layers of their previous archiving system, reducing their storage costs by almost two-third and dramatically reducing the need for IT support. This reflects planned expenses from higher investments in both sales and marketing and R&D as we continue to increase investments, pursuing the large market potential for B2 Cloud Storage, as well as increased G&A expenses chiefly related to public company costs. Your line is open. So and like you said, Universal Data Migration is a good benefit for customers who are locked into either other cloud providers where they feel like the egress fees are excessive or there's a lots to do on-premise storage that they want to get out and move to the cloud. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. B2 Cloud Storage actually came about in part because so many businesses came to us saying they loved our laptop, desktop computer backup service and they wanted us to help them with their other storage needs. So today, already thousands of our customers use Computer Backup for laptops and desktop backup and B2 Cloud Storage for their network and server backup needs and being able to use this makes it easy and cost-efficient storage available for both types of use cases. And so as much as we continue to make it easy to store, use and protect that data, we continue to innovate and offer new features and benefits just as we showed this quarter with the announcement today to serve that mission and to – and by investing in sales and marketing to bring those features and benefits to more customers as we add value to our products, which add value to our customers, that results in value for Backblaze."
}