{
    "symbol": "BLZE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 20:47:03",
    "content": " Given the ever-growing importance of data to businesses and consumers alike, and the high cost and complexity of traditional cloud providers, we are seeking to aggressively scale our B2 cloud storage business to provide an easier, more cost effective solution at a time when it is needed most, when businesses are feeling the pain of runaway cloud infrastructure costs. While our computer backup business remains the larger of our two cloud service offerings at the moment, our strategy and increasing investments center around capitalizing on the approximately 100 billion total 2025 market opportunity for B2 cloud storage, based on projections from IDC and company analysis. Second, specialized cloud providers like back boys offer best of breed services that are differentiated and valuable, in our case with dramatically lower cost, better ease of use, and free or low cost data transfer. Second, we are continuing to cultivate our relationships with developers for application storage use cases, which we define as customers that use B2 Cloud Storage as the storage infrastructure for their SaaS, e-commerce or other business. We have executed well despite a turbulent financial market and record inflation, risks of recession and a tight labor market while focusing on the approximately 100 billion market opportunity and successfully growing B2 over 40%, roughly twice the rate of the broader public cloud market, we are actively managing expenses and intend to be approaching adjusted EBITDA breakeven in Q4 of 2023. B2 Cloud storage ARPU grew to $437 versus $360 one year ago, and computer backup ARPU was $124 up from $113 one year ago. Year-over-year, the lower adjusted EBITDA margin reflects planned expenses from higher investments, primarily in sales and marketing and R&D, as we continue to pursue the large market potential for B2 cloud storage. I will say that, we also, from a product functionality perspective, we highlighted on our blog not too long ago, one of our team members showed how to actually build an AI training model, using AI tools that are out there and using Backblaze B2 as the storage cloud for all the datasets for the training model. And considering the cloud market is entering this third phase with customers wanting these open cloud solutions, wanting the best free services, we believe we are well-positioned to continue down this path."
}