{
    "symbol": "CHUY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 12:22:05",
    "content": " Comparable restaurant sales in the third quarter increased 2.6% versus last year, driven by a 6.2% increase in average check, offset by a 3.6% decrease in average weekly customers. Overall, commodity inflation during the third quarter was in line with our expectations at approximately 21% and partially offset by menu price increases taken during the year. This was partially offset by menu price increases taken during the year as we continue to look at the remainder of the year, we expect hourly inflation to remain at elevated levels of approximately 8% for the fourth quarter of 2022 as compared to 2021, in addition to a continuation of year-over-year staffing level increases. And general and administrative expenses decreased to $6.7 million in the third quarter from $7 million in the same period last year, driven by lower performance-based bonuses, partially offset by an increase in management salaries, higher legal and professional service costs as well as an increase in recruitment fees. In summary, net income for the third quarter of 2022 was $5 million or $0.27 per diluted share compared to $6 million or $0.30 per diluted share in the same period last year. During the third quarter of 2022, we incurred $1.2 million or $0.05 per diluted share in impairment, closed restaurants and other costs compared to $4 million or $0.15 per diluted share in the same period last year. Taking that into account, adjusted net income for the third quarter of 2022 was $5.9 million or $0.31 per diluted share compared to $9.1 million or $0.45 per diluted share in the same period last year. Please proceed with your question. Please proceed with your question. As I said in my last call, I think in the last quarter, as we move forward, specifically in quarter three and four of next year, youâ\u0080\u0099re going to see two out of the three items would probably look very much like the price points within our current menu. Please proceed with your question. Well, we are seeing a little relief like in chicken and some things like that, but thatâ\u0080\u0099s being offset by what weâ\u0080\u0099re experiencing and lettuce and tomatoes right now, and theyâ\u0080\u0099re talking about that all through the fourth quarter, lettuce is hitting almost all-time highs right now, and tomatoes are up as well over the last eight weeks by about 60%. Weâ\u0080\u0099re very pleased, as I mentioned in the script that weâ\u0080\u0099ve moved rather well into this quarter getting to where Iâ\u0080\u0099d say weâ\u0080\u0099re about 90%, 95% staffed in all our units, which you never ever staffed in the unit, so youâ\u0080\u0099re always constantly hiring. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}