{
    "symbol": "CHUY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 21:43:05",
    "content": " Comparable restaurant sales in the fourth quarter increased 3.4% versus last year, primarily driven by a 6.1% increase in average check, partially offset by a 2.7% decrease in average weekly customers. Labor costs, as a percentage of revenue, increased approximately 140 basis points to 30.5%, primarily due to hourly labor inflation of approximately 9%, at comparable restaurants as well as an improvement in our hourly staffing levels as compared to last year. Operating costs as a percentage of revenue increased 120 basis points to 16.6%, due to higher delivery charges and to-go supplies as well as continued inflationary pressure on other operating expenses including increase in utility cost, restaurant repair and maintenance costs, insurance premiums and credit card fees. General and administrative expenses increased $6.5 million in the fourth quarter from $6.1 million in the same period last year, driven by higher management salaries as well as an increase in public company and travel cost. In summary, net income for the fourth quarter of 2022 was $2.5 million or $0.14 per diluted share compared to $6 million or $0.30 per diluted share in the same period last year. During the fourth quarter of 2022, we incurred $3.2 million or $0.14 per diluted share in impairment closed restaurants and other costs compared to $2.5 million or 10% per diluted share in the same period last year. As we mentioned on our last call, during the fourth quarter of 2022, we purchased approximately 327,000 shares of our common stock for a total of $7.8 million and completed our existing $50 million repurchase program. Turning to our 2023 outlook, we are currently expecting adjusted EPS of $1.60 to $1.65 per share, which includes an estimated $0.08 to $0.10 per share positive impact to the fourth quarter of 2023, containing 14 weeks versus the normal 13 weeks in fiscal 2022. G&A expenses of $28 million to $29 million, six to seven new restaurants, net capital expenditures of approximately $35 million to $39 million, restaurant pre-opening expenses of approximately $2.5 million to $3 million, effective annual rate of -- effective annual tax rate of approximately 13% and annual weighted diluted shares outstanding of 18.1 million to 18.2 million shares."
}