{
    "symbol": "VEEV",
    "quarter": 1,
    "year": 2022,
    "date": "2021-05-27 20:34:03",
    "content": " After the speakers’ presentation, there will be a question-and-answer session. Good afternoon, and welcome to Veeva’s fiscal 2022 first quarter earnings conference call for the quarter ended April 30, 2021. As a reminder, we posted prepared remarks on Veeva’s Investor Relations website just after 1:00 p.m. Pacific today. But what I will say, we’re very pleased with the overall service business, the strength that we saw on the development side and broadly. Yes, we did have another strong quarter overall in Quality, really broadly across Development Cloud and in Quality in particular. And I guess, I’d started at the highest level, the unified vision that we have in Development Cloud is working, and Quality is just a perfect example where we’re bringing together documentation with quality management with training, and they’re all progressing really, really well. Customers are buying into that overall vision, and then they’re rolling out and kind of driving that vision over time. And companies are looking to modernize in the Quality space, and they’re looking at Veeva to be that partner to help them there. So, we’re really pleased with our progress. Just like to hear maybe a little bit more, if you would all share with us some of your thoughts around the pharma sales force globally. It seems like from the prepared comments, you’re walking back some of your concerns or maybe pushing them out. But, we haven’t seen any of the reductions so far that we’ve talked about, I guess, two quarters ago now. So, I wouldn’t classify it as a walking back. And then, I guess, in recent quarters, there’s been a lot of buzz around decentralized clinical trials across the CRO space and pharma in general. Yes, decentralized trials, that’s part of what we call digital trials, so that’s moving clinical trials to paperless and patient-centric. Decentralized trials itself refers to, most often, to being able to do parts of the trial process with the patient in the patient’s home, still supervised by a caregiver, but that may be through an in-home nurse, or that may be through a Zoom call, something like that. That’s things like MyVeeva for patients, for example. What we’re doing for eConsent, our Site Connect product. And then, we’ll connect that into our Clinical Suite for the sponsor. So, it’s a big opportunity and area of investment. Well, I’ll play -- this is Peter and I’ll play left fielder today and I got that one out of left field. That’s not an area where we’re focused at this time when you keep an eye on it, and you never say never in the future. Peter, when we talk to our contacts in the life science industry, a theme that keeps popping up is kind of this past year led to a potential reimagining of clinical workflows, from trials to submission to post production, which could potentially lead to a replatforming for many customers. Ken, that’s fair to think that the customers are definitely reimagining things COVID, and across all industries has caused people to think maybe some assumptions that they had in the past were not valid. And so, now, they’re trying to question everything more open to innovation, I think, tremendous downside of COVID in terms of loss of life, increasing mobility, that type of thing. So, that is what’s going on. When we look at replatforming, I think really, what I see from the customers is, yes, reimagining efficiency, digital data investment. And yes, I think we’re getting a slight tailwind from that. So, it’s not something that you’re going to immediately see but that will be a continued and moderate tailwind for us for the next three, four years, really. And it’s a positive trend when customers look to innovation, because our product footprint is well positioned. We did a lot of things as we moved into digital last year, especially with MyVeeva and the digital trials and Veeva Engage that position us well. So, I think we’re in a good position and a favorable position, Ken. Any sense if there’s a good amount of pent-up demand for when you guys finally roll out the rest of the prescription data and kind of across U.S. and, to the extent, international at some point? So, we’re certainly focused on the U.S. market at this point. So, we’re really proud of the success and the value that we’re creating for customers in the early market. I guess, first, as we’re seeing kind of an increased willingness here, you noted kind of several customers throughout the quarter looking to standardize across your Clinical Suite and leverage those solutions. What’s going on is, they’re looking for an integrated suite, not so much -- standardization on technology is nice and that’s useful. That’s the essence of a life sciences company, getting products approved to market quickly. So, it’s not the standardization of technology but it’s the seamless business process that they’re looking for. And I don’t want to dig kind of too deep into it, but I guess, can you talk about -- well, you just kind of mentioned some of the early traction around the Data Cloud piece. There’s no impact in terms of IQVIA, and there’s obviously been a lot of noise in the marketplace and kind of their competitive behaviors that they have a history of, but that really has no impact at all on Data Cloud. So, I love your early take on how you’re thinking about these players. Yes,, certainly, not just in health tech overall, the market, early market’s awash with capital right now. Now, you get lower quality entrants on the average because you’re getting diffusity and monies in a surplus. So, I think that’s what’s going on. M&A, I would say not different in that space versus other places that we’ve been in. So, where we can get a seed of something that will really either help the industry overall and thereby help Veeva. So, that’s what we would look for. Sorry, I didn’t finish. So, I just have a quick one because I feel like Ato’s done so much work on this. So, you’ve heard a lot of noise about IQVIA. But that situation there with their anticompetitive behavior, the case is all upside for Veeva because the status quo is this restricted data environment that IQVIA’s created. So, that’s the status quo. But, we’ll see and that’s in 2023. Peter, I’m glad Stephanie just kind of poked at the IQVIA thread there a little bit. And then, conversely, are they opening up and saying, hey, we really, really do want the choice, and it’s about the time we get this choice. So, I’d love to know which way they’re pushing on that thread. Tom, I’ll take that one. So, they feel like, hey, there’s two kids fighting on the lawn. Who started the fight or why, it’s just noise for them. So, they don’t appreciate it. I would say -- I think, they generally know that it’s caused by IQVIA but still it doesn’t matter. They’re not nervous with IQVIA, our customers, they’re life sciences companies. They’re really Veeva and IQVIA, we are the partners with suppliers to the industry. So, I don’t feel any nervousness from our customers. They knew that if IQVIA would do something, like not allow their data into Veeva CRM, a, they’d find another way to analyze that data; and b, they wouldn’t appreciate that from IQVIA to end up IQVIA losing business. So, they’re not willing to be pushed around by IQVIA. So, I think Data Cloud, for example, that’s really enthusiastic for the customers. Noise about fighting in press releases, that’s not a positive -- sorry, more choice is a positive for customers. I mean, we look at these gross margins and they’re at all-time highs here. Seemingly, no reason why they can’t continue. And it just sort of brings to mind anytime you can kind of end-of-life customers on one platform and move them all over to a modernized version, there might be lasting benefits to the gross margin line there. Yes, this was an outstanding quarter, obviously, from an op margin perspective, the highest op margin quarter that we’ve had to date. And how I think about it is, we’re in growth mode right now. And we’re aggressively hiring specifically in the products, sales and services area. So, there’s a lot of things that happened in Q1 that drove the high op margin percentage. Yes, we’re on track with outside of life sciences there. Maybe to add some customers and expand in existing customers, we believe we’re on track to sort of in the $100 million, bringing the business for 2025. So, we’re on track for that. I’m really pleased with the customer success, and that’s what’s fueling our business there. And I guess, I’d characterize the demand around digital events, which is ramping up. That’s been ramping up for some time now and we’re really -- we focused our business on to supporting customers, doing digital events. The good news is, we’re focused on supporting both. So, as customers prefer, we can support whether it’s digital or whether it’s in-person. And I wanted to just go back to one of the earlier questions around the headcount, the overall reduction in headcount across the health care and the pharmaceutical sales industry. So, we don’t anticipate any material impact one way or the other. And typically, those kinds of things, whether we saw a smaller or a larger reduction, one, we’ve modeled the name; and two, those things tend to play out over time, based on renewal cycles. I guess, what I was trying to say is as much as maybe those -- the potential head cuts -- headcount cuts would come in the back half of this year or begin to maybe impact you and you guys are on the long-term strategic annual plus contract. So, Stan, it’s Brent. So, we didn’t see any increase in the reductions in Q1. So, I’ll talk about fiscal year ‘22 and what we’re seeing a bit. So, we’re seeing travel start to return to normalization. All of that’s been contemplated into our guide, and that’s why I explicitly stated about 175 bps of tailwind. So, if you think about the broader Engage opportunity, we have -- we’ve captured roughly 60% of the market. And we’ll expect to see continued growth in Engage, normalizing to where it was. So, Crossix is generally independent of the kinds of reductions that you’re seeing. And fundamentally, Crossix’ business is based on supporting media and advertising and marketing, which is digital. Peter, I’d be curious just to hear your thoughts on what do you think is causing sort of this increased reliance on consulting services from customers. In terms of the percentage revenue and how that grows going forward, I don’t expect any material change there. Consulting business is growing but it’s still small as when you look at the bulk of our business, which is actually subscription and professional services. Consulting is a bit, a higher-value service that focuses on business process -- business process type things, not just implementing our software. So, it’s growing but it’s never going to be the biggest part of Veeva, that type of thing. So, it’s been very complementary. So, one of the things with consulting is very good for us, stitching together the business processes that are needed when you’re implementing processes, for example, across clinical and regulatory or commercial and medical. So, that’s where you get a lot of the value and when you redesign these business processes, roles and responsibilities. So, necessary and view it as icing on the cake, but it’s not the cake. And then, I just had a quick question regarding -- we are starting to see more customers going in full suite, especially in the last quarter and current quarter in like Quality and Regulatory and including new customers or in Commercial Cloud. Generally, that will be with smaller biotechs because they’re nimble, they don’t have existing infrastructure. But, that’s not really so applicable to our large enterprises, because they have lots of people, lots of processes and they have to pick the parts that they optimize. Thank you, everyone, for joining today’s call."
}