{
    "symbol": "WTS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 11:59:02",
    "content": " The strong first quarter performance and additional price increases should be able to offset headwinds in the second half, particularly around the war in Ukraine and its potential impact on the economy in Europe. The Americas had a strong quarter, with organic sales up approximately 14%, despite a volume headwind of approximately 4% resulting from the freeze impact in the South Central region of the U.S. in the first quarter of 2021. We expect a solid year-over-year compared despite the headwinds related to the freeze benefit in the second quarter of 2021 in the U.S. As Bob mentioned, we have announced an additional price increase globally to offset incremental commodity and supply chain inflation. We estimate our adjusted operating margin could range from 15.1% to 15.5% for the second quarter, driven by price and productivity and offset partially by incremental investment spending of $5 million and incremental cost of $3 million related to the return of normalized business costs. We expect that interest expense should be approximately $2 million in the second quarter of 2022, an increase versus the first quarter due to an increase in outstanding debt end rising interest rates. This implies a reduction of 8% year-over-year in the second quarter, which equates to a reduction of $13 million in sales and $0.05 a share in EPS versus prior year, and a $3 million reduction in sales and a $0.01 a share in EPS versus our previous guidance. We are increasing our full year operating margin expansion outlook, and are maintaining our full year organic growth expectations with our strong start and incremental price increases able to offset second half headwinds from the war in Ukraine. Your line is open. Your line is open. Your line is open. Your line is open. So, in the first quarter, just globally, our -- approximately of our growth about 10% was in price realization, a little bit more in the Americas, a little bit less in APMEA, and then Europe kind of in the middle there. Your line is open."
}