{
    "symbol": "ARAY",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-10 20:35:08",
    "content": " Accuray technology is strongly positioned to capitalize on the expected demand for ultra hypofractionated treatments, which we believe will be a market catalyst to drive over 2200 technology replacements, aged 10 years or older over the next five years and representing a $5 billion total market potential in the US and Western Europe alone. The China JV now has an organization that will be 200 people strong in China, a state-of-the-art manufacturing facility, an incredible training center that will be able to serve global customers, a greater than 75% win rate in the Type A premium market over the past three years and strong backlog for revenue conversion. Additionally, we will continue to compete in the Type B segment with our current product portfolio accessing the largest segment of the China market, where 1800 systems in the next five years are expected to be sold, representing market potential of approximately $600 million annually. On a full year basis, total revenue was $430 million, which was up 8.5% from prior year, and a record revenue number for the company driven by strong execution from our cross functional teams despite all the macroeconomic headwinds. Product revenue for the fourth quarter was $58 million, an increase of 3.4% from prior year. On a full year basis, product revenue was $214.7 million, an increase of 21.5% year-over-year, representing strong customer demand for our key innovation. On a full year basis, service revenue was $215 million, a decrease of 2% from the prior year, again, mainly impacted by FX headwinds. Gross orders played out as expected with fourth quarter orders at $88 million, which was down 22% from the fourth quarter of the prior year, which had challenging comps. We ended the fourth quarter with backlog of approximately $564 million, which is 9% lower than prior year. This year approximately $35 million of orders aged back in during fiscal 2022, which is the highest aging activity we have reported over the last five years, validating our views that our 30 months age-out policy does not translate into an order loss as our teams remain focused on revenue conversion, including from deals that have aged-out. Service gross margin for the quarter was 32.5% compared to 37.3% from the prior year, primarily due to lower contract revenue in our non-US markets driven by recent FX headwinds. On a full year basis, operating expenses were $151.8 million compared to $137.3 million from the prior year driven by strategic investments in R&D and incremental sales and marketing expenses as business returns to a more normalized run rate in the post COVID 19 environment. For FY â\u0080\u009923, we expect revenue in the range of $447 million to $455 million with a midpoint of approximately 5% growth year over year, which would outpace the market."
}