{
    "symbol": "DXC",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-03 20:39:10",
    "content": " These efforts to better manage this form of financing allowed us to reduce our debt and ultimately our capital lease cash outflows from $245 million in Q1 half-life 21 to a $177 million this quarter, we expect further reductions, in our quarterly cash outflows to around a $150 million per quarter at the end of FY22 and further below that level going forward We delivered these reductions while also better managing capital expenditures. Free cash flow for the quarter was $404 million, up 33% compared to prior year and moves us to positive free cash flow for the first half of FY22 of a $100 million. These cash outflows include $700 million tax payments associated with taxable gains on our divestitures, $500 million to normalize vendor payments, $332 million related to readying the U.S. state and local health and human services business for sale, $114 million to end an AR Securitization program, $88 million to end a value destructive pay-to-pay agreement. Our restructuring in TSI efforts are highly focused and we believe our improving investment in the business, addressing our outsize costs structure in certain countries, and to reduce our facilities footprint to align to our virtual model, we remain on track to reduce restructuring in TSI from an average of $900 million per year over the last 4 years to $550 million in FY22. Your line is open. Your line is open. The second thing is, I know it's small growth, but applications that's the second quarter in a row, we've grown applications to, again, we're competing in the high-end work and what we need to continue to do is make sure that we're also fixing the GIS business and what you're seeing there is that we got to continue to stay focused on Modern Workplace. My quick follow-up just maybe for Ken just on the, I know good work and reduce the capital lease obligations, on Slide 20, just want to clarify the excess cash allocation inside the circle there, that means after retaining the $2.5 billion in cash to run the business I just want to make sure I understood that, thanks. Your line is open. I mean, we haven't really given quarter-to-quarter free cash flow guidance, but I think if you back those items out, I would expect to be around plus or minus $50 million positive, maybe $50 million negative, a $100 million, call it $50 million to a $100 million somewhere in that range. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}