{
    "symbol": "AORT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 21:42:09",
    "content": " Starting with our year-over-year revenue performance for the fourth quarter, we saw strong top line constant currency growth and stent grafts which grew 16% and On-X which grew 11%. If customers had not made these increased BioGlu purchasing Q3, our total growth for the fourth quarter would have been around 7% on a constant currency basis compared to the prior year. As mentioned previously, stent graft revenues rebounded in the fourth quarter increase to 60% on a constant currency basis, compared to the fourth quarter last year. On a constant currency basis compared to the fourth quarter of 21 stent grafts grew 16%, On-X grew 11%, tissue processing increased 2% and BioGlue revenues decreased 8%. For context, we generated approximately $3 million in revenue from the TMR product line last year and therefore do not see this as a meaningful impediment to long term growth. Additionally, giving the meaningful contribution of synth graphs to our growth, we expect revenue growth for the first half of the year to be closer to the lower end of our range of revenue guidance, as recent hires in Germany will take time to become fully productive. Please proceed with your question. I mean if you look back at kind of what we presented in March of last year roughly 15, we projected roughly 15% to 20% growth for stent grafts, we came in at 20% for the year. Please proceed with your question. I mean, my, our sales team over there running around moving product around because as I mentioned earlier we had a hard time hiring in our facility in Germany, and once we changed those labor rates, to get in line with kind of the German market rates, we were able to hire very quickly in the fourth quarter and filled the factory up and those people are being trained now. So, but as far as the product lines, I mean, weâ\u0080\u0099re seeing really good growth across all of our products and thatâ\u0080\u0099s really one of the itâ\u0080\u0099s an opportunity weâ\u0080\u0099ve got such unique technology and in the Neo frozen elephant trunk up in the arch, the two offerings in the thoracoabdominal area for inside in our what we call extra design, that we just got to make sure we got the product where it needs to be on time. Please proceed with your question. I mean, I hear and when I think about it, again, Germany getting better as the year unfolds, it sounds like supply chains, less an issue, currency, lesser effect, staffing, I should make sure weâ\u0080\u0099re real clear on the key macro driver being led in â\u0080\u009823. Please proceed with your question. I mean, if you if you just do the math, and one of the things we said at the kind of analyst day was that we were going to return 50% of the incremental gross margin as EBITDA which is pretty much what weâ\u0080\u0099re doing this year, that which again, gets you to the 50 million. Please proceed with your question."
}