{
    "symbol": "NR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 11:11:06",
    "content": " Consolidated revenues were $194 million for the second quarter, delivering adjusted EBITDA of $13.3 million and adjusted earnings per share of $0.01 per share. Compensating for the reduction in rental and service income, the quarter benefited from $19 million of revenue from product sales, reflecting strong orders from the utility sector as well as the impact of previously discussed deliveries that shifted from Q1 to Q2. During the quarter, we progressed our efforts to expand our participation in the growing circular plastics economy, leveraging our historical investments and R&D capabilities and adaptable manufacturing processes, we are on track to utilize approximately 1 million pounds of recycled and alternate materials in our mat production in 2022. As a result, our operating loss in the Gulf of Mexico increased sequentially by roughly $1 million, overshadowing the solid progress we're making in other areas. Internationally, revenues increased sequentially despite the impact of the strengthening U.S. dollar as we saw the benefits of customer drilling programs commencing in the quarter that have been delayed through the pandemic. Not only does the award maintain meaningful revenues for the next 3 years in this important market but also resets pricing to more appropriately reflect raw material cost inflation, which should provide a lift to profitability beginning in the fourth quarter. Raw material cost inflation, the build of inventory for the delayed project in the Gulf of Mexico and required prepayments on barite purchases for our mineral grinding business led to a $20 million increase in our Fluids inventory levels for the quarter. Overall, aside from the Gulf of Mexico operations and the asset impairment that Matthew discussed, our second quarter operating results were fairly in line with our expectations, reflecting a $1.6 million increase in adjusted EBITDA largely driven by improvements in our Industrial Solutions segment. On the rental and services side, despite a strong start to the second quarter, revenues were down slightly from Q1, impacted by the exceptionally dry and warm start to the summer in the Southern U.S. as well as unanticipated delays in customer projects associated with various customer labor constraints and supply chain disruptions. In terms of revenues by end market, the utility sector remains our primary customer base, contributing the majority of rental and service revenues and substantially all of our direct sales, while E&P customers contributed roughly 20% of segment revenues in the quarter. The Industrial Solutions operating income was $9.8 million for the second quarter, reflecting a 20% operating margin. Comparing to the second quarter of last year, Industrial Solutions revenues were up $6 million or 13%, with stronger product sales being somewhat offset by an 8% year-over-year decline in rental and service revenues. Segment operating income declined $1.5 million from last year, although it should be noted that Q2 of 2021 benefited from a $1 million gain from a legal settlement. In Fluid Systems, total segment revenues improved 3% sequentially to $145 million in the second quarter despite the seasonal headwind of spring breakup in Canada and the strengthening U.S. dollar. Total U.S. land revenues, which included $12 million of third-party revenues from our mineral grinding business increased 14% sequentially to $78 million, relatively in line with a 13% improvement in market rig count. In the Gulf of Mexico, revenues increased $5 million sequentially, though as Matthew touched on, fell short of our expectations due to our customers' unexpected change in drilling plans on 2 deepwater drillship projects. In Canada, the seasonable pullback in drilling activity led to an $11 million or 49% sequential decline in revenues though it's worth noting that the Canadian market activity remained more robust this year as compared to typical spring breakups of past years. Outside of North America, revenues improved to $49 million in the second quarter with improvements in Asia Pacific and the start-up of the long-awaited project in Cyprus being mostly offset by lower activity in Kuwait and parts of Europe as well as the strengthening U.S. dollar. Operating income for the Fluids Systems segment remained in positive territory but declined sequentially by $2.9 million due to the anticipated seasonable pullback in Canada, along with an incremental $1 million operating loss from the Gulf of Mexico. Internationally, while we are encouraged by our ability to secure price increases for some of our customers, we continue to absorb raw material cost inflation on certain long-term contracts where customer pricing is fixed providing a headwind in the quarter of roughly 1 point to our Fluids segment margin. On a year-over-year basis, our Fluid Systems revenues increased $48 million or 50%. North America land revenues improved by $35 million or 64%, benefiting from the recovery in market rig count and Canadian market share gains, while Gulf of Mexico was essentially flat to last year. International revenues improved $13 million or 37%, benefiting from broad-based improvements in customer activity across most EMEA and Asia Pacific markets partially offset by a $5 million reduction resulting from the stronger U.S. dollar. The second quarter loss from the Industrial Blending segment was $8.9 million, including a $7.9 million noncash impairment charge as well as other costs related to the exit and ongoing process to sell these assets. Corporate office expenses decreased to $7.5 million for the second quarter but came in modestly higher than anticipated primarily due to a $600,000 increase to the accrual for long-term incentives tied to our 3-year share price performance relative to our peer group. Considering the elevated long-term incentive expense, the remaining corporate expense was $6.9 million for the second quarter, in line with our expectations. Interest expense increased sequentially to $1.6 million in the second quarter, with the increase reflecting the write-off of capitalized loan fees resulting from our recent ABL facility amendment, along with the impact of increased benchmark borrowing rates and increased borrowings. Despite reporting a $7.3 million pretax loss for the second quarter, the quarter's tax provision reflects a $500,000 expense as we were unable to record a tax benefit associated with the industrial blending impairment charge. Operating activities used cash of $26 million in the second quarter, primarily reflecting an increase in working capital. Inventories used $24 million of cash reflecting ongoing inflation on raw material costs, activity-driven increases and increased vendor prepayments on purchases as well as higher levels of contingency stocks to ensure our ability to deliver for our customers as drilling activity recovers. With the higher revenue level, receivables also used $11 million of cash in the quarter, though the sharp increase in site access product sales helped drive a 7-day improvement in our consolidated DSOs. Overall, we expect segment revenues and operating income will remain close to Q2 levels with third quarter direct sales activity remaining robust. Focusing on the near-term outlook, we expect the Fluids segment to take another step forward in both revenues and profitability in Q3 led by activity increases in the international business units and the seasonal rebound in Canada. With respect to the exited industrial blending business, we expect to carry roughly $400,000 of expense per quarter, primarily consisting of property taxes, insurance and remaining depreciation and until the Conroe facility and assets are ultimately sold. Regarding corporate office expenses, third quarter spending should come in below the $7 million mark as we focus on streamlining our cost structure in line with the evolving business. We anticipate interest expense will increase closer to $2 million for the third quarter, primarily reflecting higher borrowing rates, while the tax rate will likely remain in the mid-30s range for the remainder of 2022. For CapEx, our full year expectation is relatively unchanged with gross expenditures in the $20 million to $25 million range for 2022, roughly 80% of which is directed to Industrial Solutions. In terms of cash flow, while the first half of the year has been impacted by the increase in working capital associated with the strong revenue growth as well as the challenging supply chain environment, we expect the ongoing improvement in business performance to generate positive operating cash flow in the third quarter. In addition, we expect our announced divestitures as well as efforts to optimize investments in the deepwater Gulf of Mexico, provide line of sight to more than $70 million of cash generation in the coming months, providing additional liquidity to reduce our debt, redeploy into value-creating opportunities, including investments in strategic growth markets or return to shareholders through share repurchases. While the business is approaching the highest levels of working capital efficiency, it has seen in several years, the persistent raw material cost inflation is impacting their cash generation and all efforts are focused on passing through the necessary pricing actions to expand margins and achieve acceptable value for our products and services. While T&D project activity in Q3 is always lighter due to peak summer loading on the electrical grid necessitating a pause in projects, we're encouraged by the building project pipeline later in the quarter and are engaging with key customers to pass through the persistent impacts of elevated labor and transportation costs."
}