{
    "symbol": "NR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 12:18:16",
    "content": " As highlighted in yesterday's earnings release, prior to the consideration of the third quarter impairments, the Excalibar and Gulf of Mexico operations have contributed a combined $63 million of revenues and a $7 million operating loss in the first nine months of 2022. Overall, our third quarter operating results were stronger than our outlook provided in August, reflecting a $6.3 million sequential increase in adjusted EBITDA, largely driven by improvements in our Fluid Systems segment, while the Industrial Solutions performance remains solid. Industrial Solutions revenue improved 5% sequentially to $51 million in the third quarter as the benefit from our geographic expansion in the utility sector, along with improvements in oil and gas customer activity successfully offset the typical Q3 seasonal market softness. Industrial Solutions operating income improved modestly to $10 million in the third quarter, reflecting a 20% operating margin, impacted somewhat by the weaker revenue mix in Q3 as service revenues represented a higher proportion of our rental and service projects. In Fluid Systems, total segment revenues improved 16% sequentially to $169 million in the third quarter, reflecting double-digit percentage growth in both, North American land and international markets. Outside of North America, revenues improved 13% sequentially to $55 million in the third quarter with solid improvements seen across several European markets despite a $2 million headwind from the strengthening U.S. dollar. Bringing up the impact of the pending divestitures to the overall Fluids segment performance, the Excalibar and Gulf of Mexico operations contributed $26 million of combined revenues and a $2.6 million combined operating loss to the Fluid Systems' third quarter 2022 results excluding the $29.4 million impairment charge. Although the visibility on product sales is always somewhat limited and challenging to predict, overall, we anticipate the Industrial Solutions segment revenues could reach the $60 million level in the fourth quarter, with operating margins likely in the low to mid-20s range, which would mark the strongest quarterly performance for this business in several years. Excluding the business units being exited, we expect the Fluids segment revenues will pull back modestly as compared to the $142 million of revenues in Q3, reflecting the timing of projects in both, North America land and international markets, including some level of seasonal slowdown around the year-end holidays."
}