{
    "symbol": "YTEN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 21:48:07",
    "content": " We'll also provide an update on our drone contracting and seed production, winter field trials with a focus on development of herbicide tolerant Camelina varieties, review key drivers in the biofuel feedstock oil market, present the third quarter financials and summarize key milestones. By the end of the third quarter, all of our spring field testing sites were harvested, data is being collected and analyze by our team and this will allow us to generate further proof points in our traits and will allow us to identify Camelina's â\u0080\u0093 Camelina lines for commercial development. Thanks, Oli, and good afternoon everyone. Thanks, Oli, and good afternoon everyone. Our net operating cash usage was $2.7 million for the third quarter of 2022 as compared to $2.0 million for the third quarter of 2021 and for the full year 2022 we continue to estimate total net cash usage of $12 million to $12.5 million to fund our operations, including our expanded research and development activities and our preparations for the future commercial launch of our Camelina products. As we progress until the end of 2022, we will continue to focus on executing our key milestones including expanding our commercial activities, targeting the renewable diesel and aviation biofuel markets, engaging with growers to introduce the benefits of growing Camelina and continue to build our differentiated elite Camelina germplasm collection, collecting and analyzing data from our 2022 field testing program, executing and seed production and building inventory for future contracts. I mean, there's no question you're going to see opportunities for increased soy and canola yields for increased seed oil content in soy and canola, but ultimately when you start looking at 6 billion gallons by 2030, I believe the number is, and that's just for R&D renewable diesel and you add-in 3 billion gallons for aviation biofuel, and then you see that being boosted to 29 billion gallons by 2050. And of course, cover crops have these benefits in terms of sustainability, whether it's improving soil carbon, keeping moisture in the soil, producing nutrient runoff, but ultimately a cash cover crop like Camelina or other oil seeds like perhaps pennycress and even potentially , if it can be fitted seamlessly into those rotations, offers the grower additional revenue. Right now what's missing in the biofuel market is new feedstocks, in other words, new sources of oilseed grain that can be processed in existing infrastructure to produce oil and protein to boost an oil that can actually fit readily into the biofuel, the markets and obviously Camelina already has run its credits and obviously it looks like it's going to have a very attractive CI score."
}