{
    "symbol": "YTEN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 20:31:05",
    "content": " Today, we'll provide an update on our business, including recent accomplishments, the market opportunity in the biofuel market, our progress towards developing herbicide tolerant Camelina varieties, our plan to begin scale of omega-3 Camelina, present 2022 financials and summarize key milestones. As 2023 progresses, we expect to continue discussions with multiple additional entities in the biofuel value chain, which will enable Yield10 to establish a network of alliances to supply Camelina feedstock oil to biofuels. In our goal as a green originator and performance trade developer, we'll continue to scale up seed to enable contract growing in thousands of acres in the near term, with a ramp of acres accelerating with the introduction of herbicide tolerant for right Camelina varieties. Our vision for the business is to contract with growers from large-scale production and build a network of alliances for contracted off take of the grain for biofuels and meal for animal feed and we'll use with Mitsubishi and American Airlines, demonstrate the potential for establishing downstream alliances committed to accelerating the ramp up of Camelina acres to supply the biofuel market. For the most part, we view these in oil seed crops and players as fellow travelers to address this very high and growing demand for free stock oils, but uniquely among them, however, Yield10 elected early on to use all of the tools in the crop development toolbox to enhance the value of Camelina as a preferred crop for farmers and to our knowledge, we are further ahead with the advanced wheat control technology. For 2023, we expect total net cash usage will be in the range of $13 million to $14 million to fund our operations, including our product development activities related to developing herbicide tolerance and Omega-3 Camelina, as well as our early commercial activity related to supporting the adoption of Camelina for the biofuel space. We are approaching the scaling of our Camelina grain production business using our currently varieties tactically over the next one to two years, with a strong focus in building the relationships with growers and demonstrating the fuel value chain with our partners. As 2023 unfolds, we will continue to focus on executing our key milestones and footing to expand our commercial activities, target R&D and sustainable aviation fuel markets, engage with growers to introduce the benefits of growing Camelina, and execute on seed production and building inventory for future grower contracts, progress the commercial launch plan for Camelina Omega-3 oils and advance the optimization of our PHA bioplastic trade. And I would say in that regard, we've been -- we've been -- we added to our seed operations team late last year, and we're very excited about what we're hearing from growers in general, keeping in mind that, previous attempts to launch Camelina really didn't have any advanced technology in them."
}