{
    "symbol": "MSGE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-09 13:01:04",
    "content": " Although, Omicron had a temporary impact on operations and demand at the start of the fiscal third quarter, Tao's business started to pick up again in February and in March, Tao posted its highest monthly revenue total since capacity restrictions were lifted in key markets last summer, which we believe sets the stage for a strong fourth quarter. So as we look back on the quarter for our Entertainment and Tao Group segments, we are proud of the resiliency our business has shown and we're excited about the road ahead, particularly as we prepare to open MSG Sphere in Las Vegas next year. With regard to our fiscal third quarter financial performance, while affiliate revenue in the period continue to reflect the impact of our non-renewal with Comcast, we once again delivered exceptionally strong advertising results, which puts us on a path to a record year in advertising revenue for our NBA and NHL teams. For the quarter, we generated total revenues of $460.1 million and adjusted operating income of $46.5 million, a significant improvement over last year's COVID impacted quarter. The Entertainment segment had $194.6 million in revenue, primarily reflecting the impact of our arena license agreements with MSG Sports and our busy schedule of events during the quarter, as well as strong performance across suites and sponsorships. This result reflects the strong performance of our core entertainment business, offset by expenses related to MSG Sphere content development and technology, as we prepare for the opening of MSG Sphere at The Venetian in the second half of calendar 2023, as well as the impact of severance related costs in the current year period. As I mentioned before, the early part of Tao's third quarter was impacted by the Omicron variant while AOI also reflected pre-opening costs related to both recent and planned new venues. First off, looking at the Entertainment segment results for the quarter, the AOI loss reflects strong and profitable performance for our traditional core live entertainment business, and also has -- the results also include expenses related to Sphere."
}