{
    "symbol": "NMIH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 22:56:03",
    "content": " National MI continued to outperform in the second quarter, delivering significant new business production, strong growth in our high-quality insured portfolio, continued success in the reinsurance market, and record results across every key financial metric. We delivered record financial results in the second quarter with strong new business volume, significant growth in our insured portfolio, continued resiliency in our credit performance, and expense efficiency driving record profitability. The impact of the new treaty on pre-tax income, effectively its all-in cost is expected to be approximately $1 million per quarter compared to $1.6 million combined for the -- for our first and fourth ILN in their last full quarter's outstanding. Overall, we had a terrific quarter with significant new business production, increasing persistency, and growth in our high quality and short portfolio driving record revenue, and favorable credit performance and expense discipline driving record profitability and strong returns. And maybe just to balance these comments, I would just say the hardening environment, I think could provide us with some benefit, but that's really on new production, and that's been a really depend a lot on the risk mix, how NIW involves, kind of how cancellation earnings trend, I think we're seeing them trend down, we'll probably see them to continue to trend down. But when we look forward, I think you know we're always very focused on being efficient with 246 employees, we have the smallest footprint in the industry by far, and I would just say we probably expect some growth in our gross expenses, but we're going to continue to invest in our people, our systems, and in risk management, and I think the other part to really factor in is the impact of the season QSR, and so that 35% ceding commission is going to be an offset to OpEx in the future. And so, we look what are those markets that have seen the most significant house price appreciation that has also seen the most significant supply build in recent period, either because they are markets where there is a much larger concentration of new construction where new home sales have accounted for a larger and larger percentage of overall home sales than the rest of the country, or where inventory of existing homes is building, and we pair that with some other data that we look at to try to get a sense for, and we're on top of that, do we see a greater disconnect from income levels, local economic opportunity, and affordability. We activated 35 new lender customers in the quarter, which is sort of -- that's consistent with where we've been, there's still some white space for us for large moving accounts, which were included in there, but in a particular quarter, the accounts that we activate, the new customers that we activate have very, very little impact on the NIW that they -- that we generate rather those new accounts that we bring on, have the potential over time to help drive future NIW opportunity and NIW growth."
}