{
    "symbol": "PH",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-03 14:08:06",
    "content": "  Operator: Thank you for standing by, and welcome to the Parker-Hannifin Fiscal 2023 First Quarter Earnings Conference Call and Webcast. As a reminder, today's program is being recorded. I would now like to introduce your host for today's program, Mr. Todd Leombruno, Chief Financial Officer. Good morning, everyone, and thank you for joining Parker's fiscal year 2023 Q1 earnings release webcast. And joining me today is our Chairman and Chief Executive Officer, Tom Williams; our Vice Chairman and President, Lee Banks; and our current Chief Operating Officer and Chief Executive Officer elect, Jenny Parmentier. The presentation today will address non-GAAP measures, and reconciliations for those non-GAAP measures are available in this presentation and all of this is available on the Investors section at parker.com and will remain available for 1 year. And then we'll touch on the leadership transition that we announced last week, and we'll finish the call with Q&A. So if I could ask you to reference Slide 3, and I'll hand it over to Tom to begin. We had an impressive first quarter -- first quarter record sales, net income, EPS and several margin records. So if you look at this slide, the first bullet, safety is our top priority. If you look at that on a safety incident rates, there would be a number of incidents per 100 team members, that will put us in the top quartile versus our proxy peer group, which is fantastic results. Sales were $4.2 billion, an increase of 12% versus the prior year. Organic was very strong at a plus 14% versus the prior, and we had strength across all regions and segments. We had a 70 basis point improvement versus prior year, again, excellent improvement in pretty tough conditions. As I mentioned, we completed the Meggitt acquisition integration, is well underway. So if you look at the quarter and really the last several years, is that takeaway that you see in this slide, The Win Strategy, the portfolio changes working together to deliver record performance. We had Parker executives at every Meggitt site globally, 34 sites around the world. Very positive meetings, and we're off to a good start putting the 2 companies together. If you go to Slide 5, I went through this in a fair amount of detail on the September 28 investor call, but just to orientate you on the page on the left-hand side, the blue bars of the synergies, gold is cost achieved. This is by fiscal year, it shows you the walk to a $300 million worth of synergies in FY '26. That would take us to approximately 30% adjusted EBITDA margin over a period of time, so a significant improvement in profitability. On the right-hand side, is really the how, how we'll get to $300 million synergies. If you go to Slide 6, really, the combination of the portfolio changes that we've made so the doubling of filtration, doubling of Engineered Materials and the doubling of Aerospace over the last 8 years. If you put that together with our technology offering, which is very much aligned to the secular trends of today and the future aerospace, digital electrification and clean technologies, that combination is going to have a profound shift in our sales mix. So if you look at where we were in FY '15 and you go out to FY '27 on an illustrative basis, you'd see we have 85% of the company, either industrial aftermarket or a longer cycle. If I was only allowed one slide on these earnings calls, this is probably the slide I'll show up. So on the left is adjusted EPS, and we've updated that for the FY '23 guide, you see the $18.95 at the midpoint. And the adjusted EBITDA margins on the right-hand side, an almost 800 basis point improvement over this period of time. It's hard to make metrics go at a 45-degree in a little rate, but it's a fantastic job by our people, portfolio changes and the strategy of the company. Arguably, the most improved industrial company over this period of time and a great company to invest in. And with that, I'm going to hand it over to Todd to talk more about the quarter. And our team members just really globally continue to execute and deploy The Win Strategy, and we're very proud of the results that they were able to put up. Tom mentioned this, but sales are up 12.5% versus the prior year. The organic growth in Q1 was extremely strong, 14%. Everyone is seeing the strengthening of the dollar, and that has created a currency headwind for us. All in, net of that, it added 4% to our sales for the quarter. Adjusted segment operating margins, 22.7%. And really, this year-over-year margin, both the adjusted segment operating margins and the EBITDA margin improvements, really just demonstrate the power of Win Strategy 3.0. When you look at adjusted net income, the number is $616 million, that's a 14.5% ROS. It's up $0.48 from prior year, and that's really despite some currency headwinds that we saw in the quarter. So all in, this is a really a fantastic start to our fiscal year. If you go to Slide 10, this is just a bridge on the year-over-year EPS improvement. I've already mentioned it, but the strong Q1 operating performance, obviously, the main driver there. When you look at everything else, the net of corporate G&A, other tax and shares outstanding, all of that nets to $0.03. And you can see the big line there, interest expense is $0.35 headwind. But 100% of that is related to the Meggitt acquisition, and we knew that, that was going to be a headwind. So all in, that's $4.34, that's 11% increase from prior year. If we go to Slide 11, just looking at the segments, you can see organic growth, again, very strong in the quarter. Orders remained positive in every segment, despite some notably tough comps versus prior year. Total company orders are up 5%, and we continue to see broad-based demand across all the end markets that we serve. Strong incrementals drove that margin expansion, that 70 basis point margin expansion versus prior year. And again, our team members just really continue to be agile in the current environment, and I'm very proud that they were able to generate record sales and operating margins. Looking at North America, the organic growth was extremely strong in North America. Nearly 18% sales came in at $2.1 billion, significant margin expansion, 200 basis points over prior year, that reached 23.74%. But again, we've talked over the last couple of quarters about the specific regional supply chain challenges. Our team has just been very resilient, working on our operational efficiencies, and that really is the main driver on driving this strong margin performance. Incrementals in North America, ex acquisitions, was 38%. Organic growth, again, strong there at 12% organic growth. And again, that's all in light of some currency headwinds that obviously more heavily impact this segment. They have done a great job recovering from those shipment delays that were a result of COVID shutdowns, and we feel that, that is kind of mostly played out in Q1 here. If you remember, about 82% of the Meggitt transaction does get reported in this segment. But if you look at organic growth, very strong there as well, 7.4%. When you look at operating margins, that was impacted really by Meggitt coming in, Wheel and Brake coming out and then there were some nonrecurring program timing charges that were in respect to our OEM business. So all in, that's a onetime issue, and we don't see that continuing going forward. If you look at Aerospace orders on a 12-month rolling basis, it's plus 5. But you remember, we've talked about these multiyear military orders. That will anniversary next quarter if we adjust for that, orders were positive 29% in Aerospace. If you look at our cash flow from operations, that was 10.8% of sales. The transaction costs that we've talked about did impact CFOA and free cash flow pretty significantly in the quarter, it's about 450 basis points of impact. Those will minimize as we go on throughout the year, but I just wanted to call it out that, that was a drag in our Q1 cash flow. We do still expect free cash flow for the year to be in the mid-teens, so no worries on that. On Slide 13, I just want to give you a couple of updates on the capital deployment. Last week, our Board approved a quarterly dividend payout of $1.33 per share. At the end of Q1, leverage now reflects all Meggitt-related debt for the transaction. If you look at our gross debt to adjusted EBITDA at 3.8%, net debt is 3.6%. And those numbers are presented on a trailing 12-month basis, and they do not include any Meggitt pre-closed EBITDA. So that is basically base Parker adjusted EBITDA, doesn't really include any Meggitt EBITDA, and we fully expect that to improve as we go throughout the year and we start to include that Meggitt EBITDA. We are fully committed to our delevering plan, and I'm really proud to say since we made this announcement last August or really August of 2021, we've applied over $2 billion of cash towards the purchase price of Meggitt. And Tom mentioned this, we're increasing the sales growth range now to a range of 11% to 14% or 12.5% at the midpoint. When you look at adjusted segment operating margins, the range is now 21.7 to 22.1 or 21.9% at the midpoint. So that is all-in, includes Meggitt and excludes Wheel and Brake obviously, our strong Q1 performance. On an adjusted basis, corporate G&A is expected to be $207 million. Interest expense, that's all in, including everything from Meggitt 5 10. And just looking a little bit more forward into Q2, we see adjusted EPS to be $4.46 at the midpoint for our second quarter. Lastly, all the adjustments that we've been talking about on a pretax level are listed in this table, which now includes at least the current estimate we have for the Meggitt-related intangible amortization of 220. And it also includes integration costs to achieve, specifically for Meggitt of $70 million for the remainder of the year. Especially with the acquisition expense to date, we've adjusted for all of those. Obviously, we started the year with our initial guidance of $18.50. Really our strong Q1, there's a little bit of moving pieces here because of Meggitt coming in and Wheel and Brake coming out. And for the remainder of the year, we've really increased the Q2 organic growth just slightly, and we've held the second half to exactly what we said in our original guidance. Right now, we feel like that's a $0.42 headwind. Really, there's nothing else notably changed to our guide for the full year. And all in, we increased our full year adjusted EPS guide to $18.95 at the midpoint. So with that, I'll hand it back to you, Tom and it's all yours. So on Slide 16, we've got the leadership transition. In coordination with the Board, I have been planning my transition for many years. To help facilitate a smooth transition, I plan to continue as Executive Chairman from January 1 of next year to December 31, 2023. My thanks to the Parker Board of Directors for just creative advice counsel not just to me, but to our management team. To the analysts who pretty soon are going to ask me lots of questions, thank you for an open and constructive and a transparent relationship. To all the Parker team members, just incredible people who take ownership in everything that they do. It's our culture, it's our people that are the secret behind our success to the Parker leadership team. Without a doubt, the best leadership team that I've had a chance to work with. And to the office of Chief Executives of people are sitting around the table with me today, Lee, Jenny, Todd and now Andy, thank you for helping me to lead the company. For 19 years, we've been business partners. We talk to each other and together, we hope Parker to be a better company. Going into the new year, I think it's going to be a big help to the team. Jenny is currently Chief Operating Officer, has been a Group President Twice and General Manager twice. She's a great person and a great leader, proven track record of success, and I have complete confidence in Jenny to lead the company in the future. With that, I'm going to turn it over to Jenny to make a few comments and finish the presentation. Lee, Todd and I have been part of this team for some time, and we welcome Andy to the role of Chief Operating Officer. As I look to the new calendar year and the second half of our fiscal year, my priority is to build upon the success of Parker's transformation. We are focused on integrating Meggitt into the Parker family, achieving the synergies we've committed to and delivering a record FY '23. and our portfolio transformation, coupled with the secular growth trends, makes us more than confident in achieving our FY '27 goal. We're going to get there quickly, but we've got 1 more thank you to have happen here. So Tom, on behalf of 60,000-plus teammates around the world, our management team and really from myself, thank you for 8 exceptional years as leadership and our Chief Executive Officer. You said we're going to be the safest company in the industry, and we're going to have the highest engaged team that thinks and acts like an owner. Since your time in office, we've reduced our incident rate by 73%, and we annually qualify and measure a s one of the top engaged workforces amongst our peers. You mentioned it in your slides earlier, you drove us to be a top quartile financial performer. And lastly, I remember us talking about this, we're going to be great generators and great deployers of cash. Excluding today's numbers, your time and office, we've increased the enterprise value of this company by $30 billion, $48.8 billion. Total shareholder return, not including today, 180%. And dividend increase, quarterly dividend increase, a 111% increase from $0.63 to $1.33. Capital deployed during this time period, $25 billion. But I think most importantly, Tom, is you're leaving us with the company, not only in management, talent but portfolio. Jonathan, we're going to go to Q&A. I'll let Tom catch his breath here a little bit, but I want to make one clarification. The number that we're looking for, for FY '23, Q2 was $4.31 at the midpoint. Tom, a high integrity 8 years. Our focus is -- our key focus is integrating Meggitt, bringing them into the family and achieving the synergies that we've committed to. And we're obviously, we're going to continue on our journey to top quartile performance and delivering long-term value for the shareholders. I mean how would you compare your kind of leadership style or differences or strengths and weaknesses versus Tom, if you will. Well, I think that we have a lot of the same leadership style. And I don't know that I want to get into my weaknesses just yet, but I've had 2 good mentors here who have helped me develop some strength over time. But from a leadership perspective, very passionate about safety and our team members, just the same as Tom is. One of the things that Lee and I did when we were changing the Win Strategy, whether it was 2.0 or recently 3.0, this was very much an inclusive process where it wasn't the 2 of us scrolled away in a corner coming up with all the answers. Obviously, we had to guide it, but it was very much lots of input and Jenny was part of that. And it was part of all those changes, and she's very capable of driving the ship going forward. And once again, I want to extend my thanks to Tom and congratulations to Jenny. There are a couple of companies this earnings season that have called out sort of, I think, some clouds in the horizon in terms of short cycle and frankly, these management teams that I do respect. So inventory in the channel went up a little bit, I'm referring to our distributor channel, but nothing really sequentially all that material. But maybe what you're getting in and so many words is kind of what's our thinking about the rest of the guidance period, what gives us confidence, et cetera. So our guidance really utilizes that input, our backlog, the AI model, feedback from obviously customers and distributors. However, to the point you're getting at, it's going to moderate as the fiscal year progresses. Yes, supply chain is healing, but I would say it's healing slowly, and it's not really making, I would say, that big a difference on lead times, at least not yet. So as a result, we did bump up our guidance -- I'm referring to organic sales guidance. We took our first half, if I compare to prior guide to now, was 5.5%. We left the same was the second half, and that the second half basically around 2% organic growth. I think for us, even though we've got the backlog and we've got this broad-based strength, we're cautiously optimistic. And the reason I say that is that we'd like to see how the year-end -- I'm talking about the calendar year ends for our OEMs and how do they start with their order patterns, particularly their demand signals to us in January. So I think the start of the new year will be a good indicator, which is why we didn't change this. But in general, we're still very positive. And we have a lot of things going for us when we think about the secular trends, the changes we've done from acquisitions. In general, I think there's a decade of better CapEx investments for Industrial. No, look, our survey work is fairly consistent with what you're seeing, but obviously, you have a live view. My follow-up question is, clearly, cash flow has been one of the strongest suits at Parker for a long, long time, and I know you're laser-focused on cash conversion. With rising interest expense, right, it seems that floor financing is getting more expensive, right, just running inventories as more expensive, both for your customers and your distributors. Obviously, the cash flow generation profile of the company is something that we all work extremely hard on virtually every day. As we bring Meggitt into the company, we see opportunities there on payment terms and receivables terms. And the other thing that I would note is, we've talked about the ACIP conversion, right, our annual variable incentive plan. I feel confident in telling you that we see free cash flow in the mid-teens number, and that is all part of our commitment to that delevering plan that we spoke about. Once again, Lee, thank you and Jenny, congrats -- not Lee, sorry Tom. I don't want to tear anybody up here and get all choked up or anything, but Tom really, congrats and thanks. If you don't mind,  thick, it's okay. Where we're at now, I think Tom said, supply chain is healing a little bit, not materially. And also just kind of the factory and efficiency side of kind of the ongoing lack of all, how much maybe pain you had to absorb in fiscal '22 and how you think that might play out in '23. There's still a lot of friction in the supply chain where even though raw commodities may have peaked, the finishing of those raw commodities before they get to us sometimes a real supply chain issues. And there's still lots of inflation up and down, you name it. I think the thing that helps us through a lot of this is we just use our Parker lean system, and we go in and we just figure out how we're going to reconstruct the value stream and bring out the efficiencies and get better throughput, et cetera. I can't put a number on what the difference is going to be, but we're on top of it, and we're making -- you see it in the margins in the company. Clearly, it's actually impressive. Yes, Jeff, it's Tom. So we're at almost $8 billion on the legacy portion of the company, had another $2 billion plus for Meggitt so it would be a little over $10 billion of backlog. So obviously, we have well more than a quarter for the backlog. I think the thing that we want to watch, we feel very good about Aerospace's backlog. And Tom, I guess, my comment to you or you're just going to echo what everybody else has already said. So I guess my first question, I know we're all trying to get at this volume question really in the second half of the year. And Tom, I guess, as you kind of look at your curves, it still seems like the environment is healthy. I'm just trying to really understand the expectation still for second half volumes to be negative, assuming that is still the expectation across the industrial businesses. So it's interesting, Joe -- it's Tom, that forecast in the second half. Because if we look at backlog and we look at the orders that we saw and what we did in the first quarter, it would tend to make you think, well, we could do more in the second half. And there's a chance we could, and we'll have to wait and see how that turns out. But given the amount of uncertainties that we see in some of the AI model data, which we've been building over time and is that  based on the data, we're projecting that things are going to moderate as we go into the second half. And with the price that's baked in there, the time we get somewhere between the third and the fourth quarter, we probably are going to have some unit volume declines. But when we look at the outlook for '23 on all the end markets, with the exception of aerospace, military and a little bit of weakness in HVAC primarily because of residential, everything is either neutral to strongly positive. Just as we go into the deeper end of the year, we have more end markets guiding to that kind of low single-digit neutral category, which is what makes up our forecast. Most of the time, our customers want to make a change. That's why my comments about watching demand signals from the OEMs at the beginning of next calendar year will be an important indicator right now, our OEMs are very positive about the future. And Jenny, I look forward to spending more time with you as well. We don't split them out, but given it's such a big part of the company, it would have been the orders that we reported for the 312. And then when it comes to the second half of the fiscal year, I appreciate all the commentary about just being prudent. Just given the size of the backlog, how it looks like you're going to start at least fiscal second half with a pretty healthy backlog. But I guess, it's just the lack of the unknowns very really seeing a monetary policy with this kind of high inflation land the plane softly on the surface of the aircraft carrier. We're very positive given that are -- the breadth of the end markets that are strong is pretty much across the board and to your point, the backlog. But they won't necessarily cancel the backlog, they just shift dates to the right if they decide that they don't need it. So when we do our next call, it will be in February, at least have January to reflect on how did the OEMs come back in the end of their fiscal year. If they come back the same way, we'll be looking to update this. I think on the pricing, and as Lee had mentioned, we'll stay on top of it. It's still there, and we're going to have to continue to look at that and stay on top of them. Look forward to that part of\n So maybe this is a Jenny question, and I apologize, it may be a little bit too early, but sort of one of the feedback things that I hear relative to other sort of premier industrials is that Parker doesn't have at least quite as much an obvious sort of recurring revenue story or SaaS-type revenue story. And secondarily, that you guys don't really do much in the way of divestitures, which have become kind of I guess, fashionable amongst these industrial companies. So on the recurring revenue, you're right, maybe a Software as a Service, but if you look at our recurring revenue, with half of our industrial business going through distribution, and that's almost all aftermarket. With Meggitt and the additions that we made there on the Aerospace side, our aftermarket piece is going to go from 36% to 41%, so that's 500 basis points of improvement that we talked about Meggitt brings. And some of you might remember from the Investor Day, we talked about increasing the international distribution, which we bumped up 100 basis points every year. It's been one of the key ingredients, International's margins are now at parity with North America, which most people that have tracked us for a long time, never thought that would happen. On the divestitures, we like -- I've always used this tree analogy. There are some branches that we'd like to trim off, and we're working on that as we speak. And when we're ready, we'll announce those, but they're not going to be materially significant. So we'll do divestitures, but we -- this portfolio has been very thoughtfully built and that these technologies are very well interconnected. So they like that we can come in with a strong bill of material, drive their cost ownership down and help them with their sustainability issues. But you'll see us do more on the divestiture side, but it won't be materially significant. Tom, it has been an honor working with you through all these years. I just -- my first question on your Industrial segment, Q1 came in better than you expected, and I'm trying to understand what the sources of upside were here. Well, I think in Q1, we had a lot of help pretty much across the board. I'm looking at all the inter markets, I'm not going to read all of them to you. Obviously, when distribution comes in, it came in at 15% to 20% range. It has, by the size of it, it automatically pulls a lot of the industrial numbers up. And I kind of ask because, again, going back to that second half discussion, it seems to me like a lot of your OEM customers have significant backlogs. And if anything, they're actually trying to increase production volumes in calendar '23 which is a little bit at odds with how you have your guidance structured. But back to the point of next year, that's a possibility of what you just described. If it doesn't, and maybe it doesn't start to temper within our fiscal year, and we'll update that guidance in February when we have more current data. But that was the thinking now that we're forecast, and we're not any smart than anybody else other than we just want to get a little closer to the target before we get a little more bullish on the second half. And normally, 1Q would be sort of the lower point of the -- for both segments. So just wondering, maybe Todd, if you could just address sort of like the thinking on the margin cadence here. No, it's a great question. Obviously, we -- specifically, we are including the Meggitt acquisition. Nigel, is a -- it's the legacy portion of the company actually goes up 20 bps on margins and the legacy portion of the company is at mid-30s incremental MROS. So it's all the factors that Todd described, which is causing the slight decline versus the prior year. No, that's really helpful. There's obviously hedges in place for U.S. dollar and euro versus British pound, which makes a ton of sense as a British company. Nigel, that's a great question. And we feel really confident in our macro hedging program across the legacy business, we will obviously integrate Meggitt into that process as well. Jonathan, just in -- taking the time, I think we have time for one more question. I guess just to, I don't think you've commented on trends specifically that you're seeing in Europe or in China. So the -- Jamie, it's Tom. The comments on China, China in Q1 was a positive approximately 10% organic and the rest of Asia, it was about the same, 10% organic. To your point, if the macros were to weaken, we've got backlog, we could use supply chain. I don't think supply chain can get worse, so that's probably going to be a positive side. At one chart, just for people that have said is my favorite one chart, that was over 2 industrial recessions of pandemic in the current supply chain issues. Obviously, we do appreciate all the thanks and congratulations for Tom. So Robin, we thank you for everything that you've done, and we wish you nothing but the best in your next chapter. Thanks, everyone, for joining us and anything we discuss today and interest in Parker. Thank you, ladies and gentlemen, for your participation in today's conference."
}