{
    "symbol": "CVNA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-20 18:59:05",
    "content": " We do think it's a -- has the potential to be a truly transformative transaction, giving us a nationwide footprint, the capacity to produce a lot more cars, the ability to put those cars closer to customers to shrink delivery times to reduce delivery costs, to enhance the customer experience, and to do it at greater volume and to do it all faster and also to accelerate our path to our long-term financial model because of the benefits of those locations. And so, we think that, given the opportunity that we've got, the size of that opportunity, the strength of which our customers have responded to our offering over the last nine years, the market share that we've seen continually growing across our markets, the continued market share growth that we've seen, the addition of ADESA and the ability for us to build into that opportunity. I think we're extremely excited about the opportunity in front of us to take meaningful market share to drive strong unit economics, to take advantage of the ADESA acquisition, to get additional reconditioning capacity closer to more customers to improve customer experience and fast speed delivery times, take advantage of the logistics network benefits that come from having a more broadly distributed footprint. And so I think that there is kind of this term that's often used that we've used in the past as well that interest rates are somewhat sticky where when they're going up, it's sometimes difficult to pass all of the increases on to customers instantly in a way that is economically optimal. And then I think probably the single biggest input to car prices today and the single biggest input to a lot of the unique dynamics that are happening across the new car market and the used car market is just new car production levels, which are obviously much lower than they've historically been. I also think because of the dynamics discussed with kind of the gap between the wholesale market and the retail market, it's not obvious that headwind would be as strong as it might look. And if you saw wholesale prices move down and then also would clearly be a benefit to our customers if car prices were lower, and that would probably play a big part in returning the industry to normal, which would cause kind of the industry dynamics to reverse from what's been a headwind recently to a tailwind, which we think would be great for the business."
}