{
    "symbol": "CVNA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 21:46:03",
    "content": " Our sequential decline in retail units sold was only slightly larger than the industry's sequential decline of 12%, despite several actions we are taking to increase near-term profitability, including: one, normalizing inventory size; two, reducing advertising; three, proactively adjusting to increases in benchmark interest rates; and four, continuing to focus on executing our profitability initiatives. Retail GPU was impacted by a $52 million or $598 per unit adjustment to our retail inventory allowance, which was primarily driven by elevated industry-wide retail depreciation rates and higher than normalized inventory size relative to sales volumes. I think just to take that point home, I do think we've made really strong moves in normalizing our inventory size in Q4 and so far in Q1, our inventory size is much closer to a normal size relative to sales volumes than certainly it was in Q4. I think there's many areas across that component of SG&A, where we're very focused on efficiency and do expect to gain savings from that component as part of our plan over the next two quarters. And then, I think for the last year, we saw those volumes at the industry level drop by -- on the order of 10%, give or take, and I certainly think that has correlated with a bunch of choices that we've made to shrink up and to focus on profitability, and I think basically with more pressure on independence even relative to franchise dealers. I think for those buying certainly from auction, it's been a very tough environment because the auction is the place where there's also been dramatic changes over the last couple of years, and it's been hard to acquire cars to carry a normal relative to history margin there. And I think that we found that in this environment, in most cases, there's room for us to probably pull back quite a bit on marketing because we're not getting the return that we've got in the past. And so, I think what we've seen over the last 3 or 4 months is more of our projects are probably having bigger operational gains than we may have kind of hoped for, but they're also pushing in the direction of fewer sales. And that's basically like a slight decline in units, low $3,000s in total GPU, SG&A improvements like you've discussed and so kind of $1 billion plus of cash burn if you include the interest expense."
}