{
    "symbol": "CVNA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 21:41:02",
    "content": " And I think we're certainly reducing the speed at which we're growing today given the shift in focus, but our hope and belief is that by getting more efficient it makes it easier to grow faster in the future because you have kind of less work to do per sale. I think when we look to our goals we -- there's kind of two ways that we can make progress toward $4,000 cash SG&A ex ADESA. But I think in general, the trends are -- as you'd expect that I think we're seeing higher incomes in general kind of fare a little bit better in this environment, higher FICOs in general fare a little bit better in this environment. And so, I think, when we look forward we don't quite know if we're exactly at the trough for auctions, but I think there's lots of reasons to be somewhat optimistic. So I don't think we know exactly how that will play out, but I think over time there's certainly room for volume to continue to come back and ADESA's built a great business with a lot of great customers. So first on the time buffers, I do think that's been associated with just ensuring that we're delivering the cleanest and fastest experience to our customers on the registration front that we possibly can. I think as we look from $4,000 down to kind of the midterm goal of $3,000 and beyond that to our long-term model, I think it's just about driving additional efficiencies. And again, I think the simplest way to think about that or at least the way that we think about that is that the amount of work it takes to increase sales by any given amount is in many ways kind of proportionate to your expenses per unit because they kind of represent the work that's being done inside the company to sell a unit. And so I think that so far at least it feels like the team at ADESA has done a good job, weathering the turbulence of that transaction which obviously causes everyone to kind of stop and reevaluate for a moment but it feels like we're in a pretty good spot."
}