{
    "symbol": "AQMS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 00:09:01",
    "content": " Our high purity lithium hydroxide is unique and we’ll talk about some of the attributes of that, but that's quite a milestone and we believe that we are the first company that has produced high-purity lithium hydroxide from black mass in the lithium-ion recycling world. So we have one more metal to get to the high purity production to go, which is the cobalt as we prepare, as we move towards to the Green Line for Q2, Q3 deployment at ACME in Taiwan, our led recycling which we're very excited about and we'll talk about more, and we're also preparing by Q3 of 2022 our pilot scale operational testing of our end-to-end black mass to end product lithium-ion AquaRefining system, right here at the Innovation Center at Tahoe-Reno Industrial Center. First off is that our lithium AquaRefinery here in the Innovation Center, the black mass with the critical metals production is nearly complete, and as I referenced earlier, produced the world's first lithium hydroxide, what we believe is the world's first high purity copper metal in metal form, and the world's first high purity nickel metal in metal form from varied battery chemistries and varied black mass sources. As you'll see in our press release that we put out today, and I'll show you a picture of it in the next slide, we not only produced nickels in metal form, we easily were able to take that nickel and metal form and make a nickel sulfate, and that is a really important step in getting to battery precursors with a known process, which is the way the primary metals are mined and today turned into those precursors from those pure metals. We've also produced the copper in metal form for copper foil production for new batteries and today's announcement of the high purity nickel, also easily to getting to nickel sulfate from that high purity nickel is a great step forward in the full length of getting from black mass to the end products. For the last three quarters of 2021 we had minimal use of the ATM; however, in Q1 of 2022 we did strategically and opportunistically make use of the ATM to strengthen our lithium battery recycling efforts, and this including securing the black mass, investing in equipment for the pilot plant at the innovation center and adding optionality of scaling the plants with larger size core infrastructure, all with the intent to get to revenues sooner. In our own black mass production capabilities, which we would be doing at our pilot plant that will turn into a demonstration plant, we believe that the predictability of those revenues as long as we're producing those materials will also be subject really to only to the variables of the metals markets, and then the added element of our ability to operate it."
}