{
    "symbol": "PRIM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 14:02:09",
    "content": " However, we secured a large pipeline project in third quarter valued at more than $120 million to help set us on a course back to profitability going into 2023. Our fourth quarter revenue was $1.3 billion, an increase of $445 million or 50% compared to the prior year. The increase was primarily driven by substantial growth in our Energy Renewables segment, which was up $272 million from the prior year, and the acquisitions of PLH and B Comm, which contributed $228 million. Gross profit was approximately $70 million, an increase of 34% compared to the prior year, and gross margins were 12.1%, up from 11.7% in the prior year, driven by favorable mix of communications and power delivery work. Energy and Renewables revenue increased $272 million compared to the prior year on the continued strength of our renewables business increased industrial activity in California and the Gulf Coast, and PLH, which contributed $56 million. Gross profit more than doubled to $80 million, and gross margins increased to 12.4% compared to 10.4% in the prior year. For the full-year 2022, revenue grew $923 million to a little over $4.4 billion and gross profit increased by $40 million or approximately 10%, primarily due to our Energy Renewables segment, as well as contributions from PLH and B Comm. Looking at the segments, Utilities gross profit increased by roughly $24 million or 13%, primarily due to our acquisitions, which contributed $26 million. We closed the year with a record $5.5 billion in backlog, an increase of $1.5 billion or 37% compared to the prior year with $570 million of the increase coming from acquisitions. We are also providing adjusted EBITDA guidance in the range of $350 million to $370 million for 2023, a 23% to 30% increase over the prior year. Your line is open. So as they become bigger, it becomes a that, that that percentage drops a little bit, but they're going to -- it's still going to be in that $300 million to $500 million a year range. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Well, I see it growing, but as I said earlier, it's going to grow at a pace of roughly $300 million to $400 million, maybe $500 million -- but maybe as much as $500 million a year for us. Your line is open."
}