{
    "symbol": "PRIM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 16:24:04",
    "content": " Despite some continued headwinds from both the Pipeline segment and inflation across the board, gross profit was up almost 22% from the third quarter of last year and up 68% from the second quarter of 2022 as we benefited from higher revenues and rate increases that we negotiated with a number of our key clients to ease some of the inflationary pressures. Similarly, our backlog has roughly doubled from the third quarter of last year to $5.5 billion, of which, nearly 8% is organic growth from our Utilities and Energy/Renewables segments. We recently announced another $400 million of awarded projects in our Energy/Renewables segment across our solar, power and heavy civil businesses that are not reflected in these totals. In our communications business, we've moved past some early growing pains and pandemic-related delays to generate a great third quarter, as both revenues and margins grew at least 50% from the third quarter last year. As Tom mentioned, our third quarter revenue was a record for Primoris, reaching approximately $1.3 billion, a new record for the second consecutive quarter, and an increase of $371 million or 41% compared to the prior year and an increase of $261 million or 26% from the second quarter of 2022. Our Utilities segment increased $158 million or 34.8%, primarily driven by increased revenues with existing customers in power delivery, contributions from new PLH customers and expansion of our communications business. Gross profit for the third quarter was almost $155 million, an increase of $27 million from the prior year, driven primarily by strong contributions from solar, improved industrial's profitability and the addition of PLH and B Comm, partially offset by the decline in pipeline. In our Utilities segment, gross profit was $78 million or $14.3 million increase from the prior year due to higher revenues in power delivery and communications and $10 million from the B Comm and PLH acquisitions. Energy/Renewables gross profit was $80.1 million for the quarter, a $44.2 million increase from the prior year, primarily due to higher renewables and industrial revenue and margins. Pipeline segment gross profit decreased by $31.1 million from the prior year due to decline in revenues, which continued to drive underabsorption of segment fixed costs. This use of cash was driven by the investment in working capital to support our revenue growth, the investment we continue to make in buying materials for our solar projects, which is roughly $80 million year-to-date, partially offset by a reduction in DSOs from improved collections and improved terms with vendors and suppliers. Fixed backlog was $3.4 billion, an increase of $605 million during the quarter, driven by new solar and pipeline awards and roughly $200 million of added backlog from PLH. Your line is open. Your line is open. Your line is open. I think, Jerry, if you look back over the course of this year, the quarterly sequential growth has been a little lumpy, and it all really just depends on the timing of new projects starting relative to older projects finishing or existing projects finishing as well as the availability of crews, as we've talked before about the new crews that we're training. Your line is open. Your line is open. Your line is open. Your line is open."
}