{
    "symbol": "PRIM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 15:38:09",
    "content": " Our performance this quarter was led by continued strength in our growth markets, Utilities and Energy/Renewables, which entirely offset revenue declines in our Pipeline segment. Our Utilities segment revenue came in at $476.1 million, a 12% increase over the prior year period. We are continuing to drive stable growth within both our power delivery and communication businesses as we see higher levels of activity from customers, bringing in $510 million in new business during the quarter. Backlog in the segment grew by $155 million versus the prior year, creating substantial new revenue opportunities as new management teams  recent acquisitions are integrated and work is synchronized. Our Energy/Renewables revenue came in at $486.3 million, up 45% over the prior year, well exceeding our expectations, with over $887 million of new projects signed during the second quarter. These types of heavy single projects are consistently contributing to our overall Energy/Renewables segment backlog, which we expect to increase to approximately $2.7 billion by the end of the year. As Tom mentioned, our second quarter revenue was a little over $1 billion, a new record for us and an increase of $141.3 million compared to the prior year. Our Utilities segment increased $50.7 million, primarily driven by increased revenues with existing customers in power delivery and in communications. Energy/Renewables revenue grew by $151.3 million, primarily due to growth in our renewables business as well as growth in our industrial businesses. Gross profit for the second quarter was $92.1 million, a decrease of $20.9 million, primarily driven by lower volumes in our Pipeline segment and higher cost in our Utilities segment, partially offset by higher margins in our Energy/Renewables segment. In our Utilities segment, gross profit was $40.4 million, an $8.5 million decrease from the prior year due to lower gross margins, partially offset by higher revenues. Energy/Renewables gross profit was $53.1 million for the quarter, a $19.9 million increase from the prior year, primarily due to higher renewables and industrial revenue and margins. Pipeline segment gross profit decreased by $32.3 million from the prior year due to the sharp decline in revenue, which resulted in underabsorption of segment fixed costs. SG&A expenses in the second quarter were $59.7 million, an increase of $2 million over the prior year as we continue to invest in technology and human resources initiatives to support our company's growth. And MSA backlog was almost $1.8 billion, an increase of $159 million during the quarter, driven primarily by an expected increase in work from existing customers. With the continued strength of our solar business, the rate changes we've negotiated with our Utilities customers and the addition of PLH, we feel very good about the balance of the year and see strong prospects for both our Utilities and our Energy/Renewables underscored by our record backlog. Looking ahead, we are increasingly focused on the Utilities and Energy/Renewables markets and less so on pipeline construction, which made up less than 6% of our revenues this quarter and will continue to be a smaller part of our overall business going forward."
}