{
    "symbol": "QMCO",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-07 10:27:07",
    "content": " Revenue came in just above the high end of guidance at $97.1 million, representing an increase of 9% year-over-year and 2%, compared to $95.2 million in the prior quarter. Backlog at the end of the first quarter was approximately $47 million, primarily reflecting the timing of large orders, and subsequently, increased to a new record of approximately $67 million at July 31, 2022. Another key metric we introduced was total contract value or TCV, which sequentially increased by 16% to $16 million at the end of the first quarter, up from $15.8 million in the prior quarter. GAAP operating expenses in the first quarter were $41.1 million, compared to $41.8 million in the prior quarter. Non-GAAP operating expenses during the first quarter decreased $0.9 million to $36.3 million, as compared to $37.2 million in the prior quarter. We continue to expect to reduce the quarterly operating expense run rate, targeting approximately $35 million by the end of fiscal 2023. Excluding stock compensation, restructuring charges and nonrecurring charges, non-GAAP adjusted net loss in the first quarter was $3.7 million or $0.04 per share, compared to adjusted net loss of $2.8 million or $0.05 per share in the prior quarter. Adjusted EBITDA for the first quarter was just above the midpoint of guidance at $0.3 million, compared to $0.4 million in the prior quarter. At the end of the first quarter, the outstanding balance on the companyâ\u0080\u0099s revolving line of credit was $17.3 million, compared to $17.7 million in the prior quarter. In the first quarter, interest expense decreased to $2.1 million, compared to $2.5 million in the prior quarter and $3.9 million during the same quarter a year ago. Excluding changes in assets and liabilities, net cash used by operating activities for the quarter was $3.1 million, of which approximately two-thirds represented interest expense. The net cash used related to changes in assets and liabilities was $15.2 million, driven primarily by season -- seasonality related declines in deferred revenue. In addition to the normal seasonality, one other factor contributing the current quarter sequential decline of $13.6 million in deferred revenue was the lengthy contract renewal negotiation with one of our largest customers that was not completed by the end of the quarter and represented an annual contract value of just over $4 million. Also, a use of cash during the quarter was an increase in other current assets of approximately $2.7 million, represented by the prepayment for key inventory, as well as annual subscription for group insurance. The net cash provided by financing activities during the quarter was $44.6 million and primarily represented the net proceeds of the rights offering, less approximately $20.6 million used to pay down outstanding term debt. We expect revenue for the second quarter to be in the range of $95 million, plus or minus $4 million, non-GAAP adjusted net loss is expected to be $1.5 million, plus or minus $1 million, and adjusted net loss per share of $0.02, plus or minus $0.02 per share, using an anticipated basic share count of 94.5 million shares. We expect adjusted EBITDA in the second quarter to be $2.5 million, plus or minus $1 million. Obviously, all of our -- huge amount of our effort is all around EBITDA and thatâ\u0080\u0099s where I feel really good for the first time in several quarters where that EBITDA is jumping from $300,000 to $2.5 million. And then, Jamie, last quarter, you talked about your four levers to achieving a $25 million EBITDA in, I wouldnâ\u0080\u0099t say, the near future, but near- to mid-term future and then the $50 million annualized EBITDA target mid- to long-term basis."
}