{
    "symbol": "QMCO",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-06 04:31:05",
    "content": " During the quarter, we also executed additional cost containment measures that lowered our operating expenses to our target quarterly run rate of $35 million which will support driving increased EBITDA as we continue to grow the top line. Revenue came in just above the high end of the guidance at $99.1 million, representing an increase of 6% year-over-year and 2% compared to $97.1 million in the prior quarter. In the second quarter, secondary storage revenues were up 33% sequentially to 44% of revenue, primarily driven by ongoing strong demand from hyperscale customers and, to a lesser extent, an increase in enterprise, backup and data protection products. In terms of the supplemental metrics we use to track our ongoing transition to emphasize our recurring software subscription model, Annual Recurring Revenue, or ARR, increased 14% sequentially to $9.4 million. In terms of total contract value, TCV, increased 9% sequentially to $17.5 million at the end of the second quarter, up $16 million in the prior quarter, up from $16 million in the prior quarter. While we have seen benefits from our previously implemented initiatives related to price increases, prudent management of discounting, reductions in PPV and other related supply chain costs, these were collectively offset during the quarter by approximately 2 percentage point gross margin decrease as a result of a less favorable product mix that was more heavily weighted towards our hyperscale customers. Excluding stock compensation, restructuring charges and nonrecurring charges, non-GAAP adjusted net loss in the second quarter was $0.5 million or $0.01 per share compared to adjusted net loss of $3.6 million or $0.04 per share in the prior quarter. Included in the second quarter adjusted EBITDA was $2.4 million of other income related primarily to a benefit from foreign currency exchange rates and the sale of certain intangible assets compared to $0.8 million of other income in the prior quarter, related primarily to a benefit from fluctuations in foreign currency exchange rates. At the end of the second quarter, the outstanding balance on the company's revolving line of credit was $21.5 million compared to $17.3 million in the prior quarter. The net cash provided by financing activities during the quarter was $3.4 million and primarily represented increased borrowings and the revolving line of credit of approximately $4.2 million, offset by $1.2 million used to pay down outstanding term debt. Although the pressure on gross margins associated with revenue mix remains a near-term challenge, we believe we are positioned to realize improvements in the coming quarters as our sales teams' ramp and secure additional wins for our higher-margin products and solutions. With our expectation for continued improvements in the supply chain, we are guiding revenue for the third quarter to be above $100 million at the midpoint which will be the first time since 2019. So of the two components, the shippable component declined, it looks like by about 20% and it's around $20 million, while the future period is up about 3x. The reason for the gross margin pressure is that as we increase our hyperscaler sales, every additional $1 million that we bring in dilutes gross margin because it's margin-dilutive business. And that's why we're kind of moving to more of a more natural shippable backlog of $10 million or $12 million when we used to be down to $2 million or $3 million because products where we get orders in the last 2 or 3 weeks of the quarter, we're not going to pay expediting fees to get that. And so you're forecasting growth but you're forecasting flat gross margins which would imply that all of the growth is coming from hyperscalers and yet you're also talking about these 15 new sales guys which I'm excited about, gaining traction in things like primary storage and federal and media and entertainment and that somehow should imply higher gross margins. My last one, so roughly, you're doing $100 million in revenue, you've got 35% gross margin which is $35 million. I mean, even though you're guiding to $3.5 million in EBITDA, you did generate a little cash this quarter. We've identified up to another $2 million per quarter of cost we can take out, some on a run rate, some on a onetime. And that's what I'm trying to get to is now we're in -- I mean, it was just a few quarters ago, we were at $300,000 in EBITDA."
}