{
    "symbol": "TSLA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-20 21:44:03",
    "content": "  Martin Viecha: Good afternoon, everyone, and welcome to Tesla’s First Quarter 2022 Q&A Webcast. My name is Martin Viecha, VP of Investor Relations, and I’m joined today by Elon Musk, Zachary Kirkhorn and a number of other executives. During the question-and-answer portion of today’s call, please limit yourself to one question and one follow-up. Despite numerous supply interruptions, including shuts at our Shanghai factory and nearby suppliers due to COVID, we’ve continued making progress and achieved our best-ever vehicle deliveries. First, we’ve lost about a month of build volume out of our factory in Shanghai due to COVID-related shutdowns. Production is resuming at limited levels, and we’re working to get back to full production as quickly as possible. Second, as I’ve mentioned before, Austin and Berlin are just starting their ramps. Thank you very much. Some of my remarks will be redundant with Zach’s, but it’s maybe worth repeating. So, I’d really like to congratulate the Tesla team on achieving record profitability and output despite many, many difficult headwinds, and especially the Tesla China team in our Shanghai factory. So, we’re also working on a new vehicle that I alluded to at the Giga Texas opening, which is a dedicated robotaxi. That’s highly optimized for autonomy, meaning it would not have steering wheel or pedals. And so, it’s, I think, going to be a very powerful product where we aspire to reach volume production of that in 2024. So, I think that really will be a massive driver of Tesla’s growth. So, it’s basically -- once again, I’d like to thank the Tesla employees for their hard work, but also I’d like to thank our suppliers who’ve really gone the extra mile. They -- we have an amazing supplier group, and I want say heartfelt thanks to the suppliers that have really worked day and night to ensure that Tesla is able to keep the factories running. So, we’re basically 5% along the way towards our goal. And we remain confident of exceeding 50% annual growth for the foreseeable future for basically several of the next years, I mean, so yes. And then, there’s, of course, Optimus, which I was surprised that people did not realize the magnitude of the Optimus robot program. Thank you very much. Well, with respect to full self-driving, of any technology development I’ve ever been involved in, I’ve never really seen more kind of false dawns or where it seems like we’re going to break through, but we don’t, as I’ve seen in full self-driving. So, that’s my recommendation, is join the full self-driving beta program and experience it for yourself and take note of the rate of improvement with every release. And you’ll see a little bit of two steps forward, one step back. So, that’s my recommendation for reaching your own assessment is literally try it. So, that means the most likely vehicle production in Q2 will be similar to Q1, maybe slightly lower, but it’s also possible we may pull a rabbit out of the hat and be slightly higher. But it’s really, call it, roughly on par. So, it seems likely that we’ll be able to produce over 1.5 million cars this year is my -- that’s my best guess. It’s important for new factories to be focused on -- and have the least amount of complexity and variation, which is why Giga Berlin and Giga Texas are focused on the Model Y. It’s -- from the point in which you have a factory complete and you’re making a small number of units to the point where it’s producing high-quality vehicles in volume is sort of 9 to 12 months from start of production. So, now hopefully, we’re getting better at that ramp, so maybe it’s a little less. Actually, on the price increase front, I should mention that it may seem like maybe we’re being unreasonable about increasing the prices of our vehicles, given that we had record profitability this quarter, but the wait list for our vehicles is quite long. So, our prices of vehicles ordered now are really anticipating supplier and logistics cost growth that we’re aware of and believe will happen over the next 6 to 12 months. So, that’s why we have the price increases today because the car ordered today will arrive, in some cases, a year from now. So, we have a very long wait list, and we’re obviously not demand-limited. Just to add to what Elon is saying, there’s different ways to calculate raw material exposure. I think the simple way, we estimate we’re around 10% to 15% of our cost structure exposed to raw materials. So, we’ve been experiencing increases in cost in general, but also raw materials for a number of quarters now. And as indices move, it doesn’t impact us immediately or directly. And so, to Elon’s point, what we’re trying to do here, because it’s quite an unprecedented situation of raw material movement and all of these various lags and uncertainty around renegotiating contracts, is we’re trying to anticipate where things will go and make sure the pricing that we have put in place at the time that those raw material cost increases hit us that they align and that the company can remain financially healthy in various scenarios as we look out over the next four quarters. Thank you very much. So, from Tesla’s standpoint, obviously, we’d like to have federal legislation that allows direct sales in all states, but we have not seen willingness on the part of the Congress to enact such law that would override a variety of state laws. On the 800-volt thing, yes, so it’s really a case-by-case thing. For the smaller platform vehicles like 3 and Y, there’s some wins and losses with 800 volts, not everything is better. And so, we look at that platform, and we’re not like ignoring the reality that you can go to a higher voltage, but there’s nothing really encouraging us to do so on that platform. So I mean, in the U.S., you’ve got 110-volt household power -- or voltage. But really, it doesn’t make that much of a difference, and appliances work pretty much as well in, say, Europe as they do in the U.S. So, there’s some -- the advantages are small and the cost is high. Like I said, it’s long-term, like years now, it makes sense probably to an 800-volt architecture probably, but it really needs a very big vehicle volume to pay for the cost of changing from 400 to 800 volts. It’s roughly like a spreadsheet exercise, like you have to get through the full program to the end to see that maybe it’s been whittled away to $50 or less. On bigger vehicles, where you’re talking about higher power on the charging side or higher power from the battery to the power electronics or you need more torque, so the current requirements go up, there’s a little bit more semiconductor and actual conductor savings of going to the higher voltage. For robotaxi, yes, it doesn’t make sense. We’re working in all the areas we shared on Battery Day, and we have sort of consistent progress across all of those areas towards achieving the five-year cost trajectory goals for the cost within our control, but we do not control all the commodity costs. So, that’s an exception I needed to call out. Similar to Model 3, it will take us several years to get rate and yields to the point where everything that we’ve discussed is achieved. Like we’ve built the facility here in Texas, like we know how much we spent on capital equipment in the facility. So, we’re saving huge on CapEx, on utilities and personnel. It’s really about rate and yield, which will come in time, as Elon said, over the course of this year and next. But certainly looking at, like, say, the $5 million, $10 million, $20 million -- 5 million, 10 million, 20 million vehicle levels, you really have to analyze the sort of macroeconomic, just like what is the tonnage of lithium that you need, of nickel, of iron phosphate, of graphite separators, electrolytes. And when we need to think about this for the world as a whole, because just -- we want to -- what are limiting factors for accelerating the advent of a sustainable energy future. So, right now, we think mining and refining lithium is -- appears to be a limiting factor, and it certainly is responsible for quite a bit of cost growth in the sales. Although just for those who don’t totally know this, the actual content of lithium in lithium ion cell is maybe around 2% or 3% of the cell, so. It’s not -- it’s called lithium ion cell, but by far, like the most expensive and heaviest item in the cell is the cathode. So, that’s the nickel or the iron phosphate. And I think we’ve got -- we don’t have enough time on this call to really go through all those details, but we are thinking about these things. So, we’re looking at the beginning and end of life needs here. And that’s true like since Reno, we built a Gigafactory and we started doing that with batteries. And so, we’re really concerned about raw materials, not just like mining them and consuming them, but when we get them in the door, using all 100% of them. No, that’s a great point. So, we’re storing -- we’re installing sort of furnaces  for probably for aluminum like sort for the Model Y that we’ve built here in Giga Texas has both a front and a rear body casting. So, we’re casting almost two-thirds of the body. And then, as Elon was saying, also take any stampings and any other aluminum scrap and also through that in the melting pot, matter of fact, we’ve also figured out that we can use wheels from practically any car. So, we’re going to be recycling the casting aluminum wheels from legacy gasoline cars as well and throwing that in the melting pot for our aluminum cast body of Model Y. And so, we don’t want to get complacent or entitled, but this should be a faster ramp because we have learned more, and we have done a lot to simplify the production prices of Model Y that should lead us to a faster ramp within Texas and Berlin. So, really, like I think about this and the way we think about cars, if you’re waiting for the best Tesla, you’re going to be waiting forever. If you’re waiting for investment, you’re also going to be waiting forever because every new factory is better than the last one because we take all that learning and triple it…\n Yes. So, I think we want to hold up on -- we don’t want to jump the gun on an exciting product announcement too much. So, I think, we’ll aim to -- we do a product event for robotaxi next year and get into more detail, but we are aiming for volume production in 2024. So, they’re not constrained by 4680. We also have, just as a risk mitigation, 2170 nonstructural pack capability in -- here at Giga Texas as well. But -- if things go according to plan, we will be in volume production with 4680 sometime perhaps towards the end of the third quarter and certainly in the fourth quarter. And the other thing I would add is like with the China COVID shutdown and the semiconductor bottlenecks we had through Q4 and hence a little bit in Q1, we have sizable cell inventory at the moment, and excess cells to support the 2022 volume targets you described. 4680 output is not a risk to achieving 1.5 million vehicles produced this year, but it would become a risk next year if we do not solve volume production by early 2023, but we’re highly confident of doing so. Thank you very much. We’re also seeing some progress in manufacturing efficiencies in Fremont, particularly on the S and X side as volume increases improves there. And to Elon’s point, the Fremont team and also the Shanghai team has been extremely dynamic with the unpredictable nature of our part arrivals, and our supply chain team, in particular, production planning portion of supply chain. We often get very little notice when there’s part shortage is coming, and it’s kind of a scramble couple of days before that part is supposed to arrive to figure out how to get it here. There’s a saying in the military, it’s like amateurs talk about tactics, professionals talk about logistics when it comes to war. So, there were some inherent cost improvements, as I mentioned, but there’s also offsets that we’ve talked about previously on raw materials, commodities. We know that there’s inflation that you’re battling through, and some of that needs to be passed through the price of the vehicles. So, it’s one of the points. It’s been very difficult with the -- I mean, I think, inflation is at like a 40 or 50-year high. And that inflation appears to be likely to continue for at least the remainder of this year is what -- when we’re talking to suppliers, suppliers are under severe cost pressure. So, yes, and in some cases, we’re seeing suppliers request 20% to 30% cost increases for parts from last year to the end of this year. So, it’s -- there’s a lot of cost pressure there. That’s why we raised our prices because we -- when things are on -- with respect to inflation, you know it’s high, then -- and we’ve got orders that go out a year or more in some cases, then we have to anticipate those cost increases. But I think, especially with the robotaxi and autonomy, I think we will end up providing consumers with, by far, the lowest cost per mile of transport that they’ve ever experienced. I mean with robotaxi, like maybe 5 to 10 times cost per mile. Thank you very much. But what’s sort of keeping our costs down, at least in the short term, is that we have long-term contracts with suppliers, but those long-term contracts will obviously run out and then the year we’ll start to see potentially significant cost increases. And it’s not that -- to be clear, it’s not that there’s a shortage of lithium ore in the world. So, we think we’re going to need to help the industry on this front, but the -- I mean, the industry is very fast. I mean, if the -- I think it’s something -- I think there’s a -- I mean, -- correct me if I’m wrong, but I think we’re seeing cases where the spot lithium price is 10 times higher than the cost of extraction. So, like we’re talking 19% margins here. So, I guess, we’ll stay tuned to see what happens from that. My second question is it’s impressive to see just a modest increase in cost per vehicle -- cost of goods sold per vehicle, given what we’ve seen in terms of commodities actually. But obviously, we don’t control the macroeconomic environment. If governments keep printing vast amounts of money and if there’s -- if there are not significant increases in lithium extraction and refinement and other raw materials, such that everyone is competing for a limited amount of raw materials, then obviously, that will drive prices to high levels. So, if you have a crystal ball that can tell us what the future is going to be like, we’ll adjust accordingly. But, the current prices are what we -- the current prices are for a vehicle delivered in the future, like 6 to 12 months from now. And that’s similar to what we’ve done with everything else, like we built a Gigafactory in Reno because it needed to be done. So, we’ll see what $500 billion buys you in a decade, but it might be a lot less. So, I don’t know if we’ll -- that seems like a lot of cash. I mean, Zach, I don’t know -- I realize that’s problem, that’s for sure. And there are some decisions that, as Elon alluded to, just to share in the future about what the economic model looks like -- what the economic model looks like for robotaxi. So, our focus is to get to the point where robotaxis are on the road, Optimus is in use, get the economic model for that dialed in, and then evaluate the size of cash flows at that point and make decisions then as to what’s next. I mean, if you want to go down the like -- it depends on what kind of part. If we don’t count that, like the simplicity of our structure is significant versus a traditional pickup truck or any other vehicle, like as we’ve talked about their gigacastings, we save hundreds of parts there. So, we really have -- like we don’t have the door reinforcements. So, to your point, I haven’t counted them because I don’t often look back at old technologies to decide how well I’m doing. There’s a lot of room for expansion there, and we do expect to increase output from Nevada, but by far, the biggest increase in output will be from Giga Texas. Thank you very much. Obviously, if this COVID lockdown things gets out of hand, clearly, that’s going to continue impacting Shanghai. So, we don’t think this is going to be a big deal. Second question, obviously, the higher profitability that you guys have been able to experience over the last couple of quarters, a lot of that is reflecting sort of \"real\" improvement. Another part of it is because we’re no longer paying you, Elon, as much as we were. And so I’m wondering the extent to which you and the Board are in the process of contemplating another one of these long-term compensation packages, which in the past have seemed to work quite well. I mean, I’ll take the LFP question. Like, it says so in our letter, like half of our products were LFP last quarter, which shows how quickly we were able to respond to -- well, honestly, it wasn’t because of a raw material shortage, but just because it seemed like the right thing to do, we could change our cathode chemistry. So, we -- I guess, what I would say is, specifically on the cathode side, like flexibility is the way we’re going to achieve this. And if all of the batteries in the world use those cathodes, it’s less than a 1% increase in total annual output. So, that’s the cathode side. Some resources like just getting rocks out of the ground, expanding the amount of rock that you’re getting out of the ground is maybe a little bit of paperwork and some additional sort of blasting and trucking operations. The refining is maybe where there’s -- it’s a little bit more chunky to bring it on line, but also the refining doesn’t -- it’s not like an oil refinery. It’s a much smaller operation to refine lithium out of spodumene or for liquid, like a brine or a salt pond evaporation. Some of what’s going on in the lithium market this year doesn’t actually have truth to bear to the like fundamentals of supply and demand, which is also a little frustrating. But yes, if we look past this year or next year, into 2030 when we need to 15 to 20 terawatt hours of this stuff to get on the growth trajectory -- stay on the growth trajectory we’re on, we need everybody to do more in the lithium space than they currently are. Thank you very much. So, let’s go to the last question from Mark Delaney from Goldman Sachs. But Tesla is able to have enough capacity, it could be a really good way to bring other vehicle owners into the Tesla network, perhaps help Tesla to sustain its network benefits and maybe make more people likely to buy a Tesla vehicles in the future. As Elon has said and as we’ve publicly committed, yes, we do plan to provide third-party vehicle access in all over the world, not just in Europe, where our original pilot was. Yes, I think that’s -- there’s nothing more to be said on that, but we’re -- yes, we want to do the right thing with respect to the whole system. With the growth of the cars that we’re producing and then anticipating what you were discussing, overall charger capacity is really important. And possibly by the end of this quarter, maybe early next quarter, we’ll be the largest insurer of Teslas. And so, we’re quite encouraged by that. And we’re working as quickly as we can to get to 80% of customers having access to a Tesla Insurance product by the end of this year in the United States, at which point we’ll pivot our attention to expansion outside of the U.S. The other thing I’ll say on insurance is with these three new states, the model is different because we are now the underwriter, and we are also now holding the risk. With respect to the financials of the program, it’s still very early. And ones I noticed that we are seeing that the -- having real-time feedback for driving habits is actually resulting in Tesla owners driving the cars in a safer way because they can see the -- they get real-time feedback on, okay, this is affecting my insurance rate or it isn’t. And so, when people see it -- they can see a real-time score, they realize, if I make the following changes in my driving habits, then I pay less in insurance, then they have a very -- like a real-time feedback loop for driving for safer driving and an incentive to do so. So, it is -- actually, what we’re seeing is it is causing people to drive their cars in a safer manner, which is also net good. It’s safer on average, what we see in the data, to Elon’s point, and premiums are lower. And I think I’ve talked about this in the past, but this has become a real passion program for us for these benefits. We’re trying to do a good thing here for our customers, save people money and make the roads a little bit safer. It’s also a feedback loop for Tesla because we see if there is crash, both large or small, like we sort of see exactly what that caused. Like, aspirationally, it would be like a same-day repair of a collision, which is night and day difference compared to sometimes having to wait for a month while insurance claims are settled and figured out -- because Tesla is also doing collision repair. And so, we receive the notification that there’s an accident, we work to prepare the estimate. And so, it’s full end-to-end visibility. And all of that, to Elon’s, we can then identify areas of cost inefficiency, feed those back to our engineering teams or elsewhere, software teams, actually improve the product. So, it’s a full circle. And basically, the customer experience is just vastly better because if there’s an accident, there’s no argument. Thank you very much. Unfortunately, that’s all the time we have for this quarter. So, thank you very much for all your great questions, and we’ll speak to you again in three months."
}