{
    "symbol": "AGS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 03:47:03",
    "content": " In R&D, our accelerated investments have yielded an expanded and industry-leading hardware portfolio, a stable of strong for-sale core games led by the likes of Captain Riches and Lucky O’Reilly and a premium portfolio led by Rakin’ Bacon Deluxe that has us poised for growth in the quarters ahead. Finally, in the Interactive segment, we’ve been able to achieve relatively consistent performance as we continue to strategically reposition the business to better take advantage of our strong land-based product portfolio in the North American online markets. Highlights in the quarter included the first placement of our Pax S specialty game card shuffler with 14 units installed in six different jurisdictions at quarter-end, and over 50% sequential increase in our Bonus Spin Xtreme installed base to nearly 120 units and the execution of our 17th AGS Arsenal site license with our contracted business generating over $2 million of annualized revenue. Supported by growing customer demand for Pax and Bonus Spin Xtreme, coupled with scheduled controlled eyes  of additional AGS Arsenal site license contracts, including our first site license in Southern Nevada, we expect our string of seven consecutive quarters of sequential table products revenue growth to continue in the second quarter. Supported by the operational momentum we’ve continued to see within the business, the approximately $10 million of annualized cash interest savings we have started to realize as a result of the refinancing transaction and our organizational commitment to maximizing free cash flow, we remain confident in our ability to deliver upon our year-end 2022 net leverage target of less than four times. I think as we sort of messaged in the prepared materials, we do expect that base to grow in the second quarter, really on the backs of the momentum we’re seeing with our premium product. And if you think about core games in the last five quarters, where we’re seeing sequential growth in premium, we’re seeing growth now in five quarters in the core sales, and we’re seeing our team just really pump out great games. I think the other side is a real positive for us as well, is that if you look at where our lead times were pre-pandemic, like we’re able to maintain that today, because of some of the things that Brad mentioned earlier, our supply chain team, kind of getting in the front of it and also being able to strategically wrestle through it. I think another thing we called out specific to Q2 and why we say Q2 sort of will be below all other markets, what we feel is we do have our customer event that we’re bringing back this year for the first time, since pre-pandemic, which is Game On."
}