{
    "symbol": "AGS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 07:51:06",
    "content": " First, domestic EGM recurring revenue topped $45 million for the second consecutive quarter, exceeding prior year levels by over 4% and beating our Q3 2019 performance by 8%. Thoughtful capital investment, including the expansion of our premium game footprint for 11 consecutive quarters, continues to drive improved recurring revenue performance as we tactically strengthen the quality of our overall installed base. Third, our Table Products segment delivered sequential revenue and adjusted EBITDA growth for the ninth consecutive quarter, supported by further customer adoption of our PAX S card shuffler and industry-leading table game progressive technologies. Looking beyond our new cabinet and high-denom content, G2E also further cemented our position in the market's growing premium game segment, supported by a robust content pipeline, a number of proven AGS brands and an increasingly diverse array of product configurations, I'm confident we can continue to build on our 11 consecutive quarters of premium unit growth. Turning first to our domestic EGM gaming operations business, third quarter revenue increased 4% year-over-year to approximately $46 million. The recent positive underlying trends within our domestic EGM recurring revenue business continued into the third quarter, with domestic EGM RPD topping $30 for the sixth consecutive quarter and our domestic EGM installed base expanding for the second straight quarter. At the end of the third quarter, premium gains accounted for 14% of our domestic EGM installed base compared to 9% in the prior year period, with premium mix increasing approximately 200 basis points sequentially. In addition to the tailwinds created by our growing premium game footprint, continued implementation of our installed base optimization initiatives and remarkably consistent GGR trends across our served markets further supported our domestic EGM recurring revenue performance in the quarter. Looking ahead to the fourth quarter, we expect the continued strong performance of our Orion Curve Premium package and the expanded breadth of our premium segment game content and cabinet configuration offerings to drive further growth in our premium game footprint. These two strategic growth drivers, combined with the historically normal seasonal revenue trends we have observed quarter-to-date, should allow us to achieve sequential domestic EGM installed base growth for the third consecutive quarter and deliver domestic EGM RPD that comfortably exceeds prior year levels, extending our $30-plus RPD streak to a seventh consecutive quarter. During the third quarter, we elected to formally remove the approximately 7% of our international recurring revenue units previously identified as inactive from our reported international EGM installed base as we felt there was a low probability that these units would be turned back on following COVID restriction-induced shutdowns. Looking beyond AGMs, our table products business, once again, delivered record performance with third quarter revenue and adjusted EBITDA, eclipsing $4 million and $2.5 million, respectively. Looking ahead to Q4, despite a less prolific new casino opening and expansion calendar, we expect to achieve modest quarterly sequential table products revenue growth, building on the 15% sequential growth achieved in the third quarter. As we assess the intermediate-term outlook for our Table Products segment, we believe the accelerating shuffler rollout momentum, steady progressive product demand and additional site license adoption should sustain the trend of consistent quarterly sequential revenue growth within the business. Looking ahead, we believe the improved flow of AGS content into the online channel should begin to drive incremental interactive revenue growth, perhaps as early as Q4, while the activation of new B2C customer relationships, the introduction of new online-only game content and the expansion of our online content reach into additional North American jurisdictions should eventually steepen the rate of revenue growth we are able to achieve within the business. Looking ahead to the fourth quarter, while we should begin to realize a modest benefit from ongoing moderation in global supply chain and logistics disruption and the inclusion of our initial run of value-engineered Spectra cabinets which should be gross margin accretive, we expect our commitment to investing in R&D to support future revenue growth opportunities and a full complement of seasonal G2E-related expenses to produce a Q4 adjusted EBITDA margin that is in line with to slightly below the 44% achieved in the third quarter. Third quarter capital expenditures totaled approximately $20 million, bringing our year-to-date capital spend to approximately $50 million, driven by unwavering customer demand for a high-performance premium EGM products and the market's strong initial response to our new Spectra cabinet and high-denomination game content, we now expect full year capital expenditures to land near the top end of our previously issued $62 million to $67 million range."
}