{
    "symbol": "WDAY",
    "quarter": 4,
    "year": 2023,
    "date": "2023-02-27 18:14:06",
    "content": " Following a solid Q4, we are maintaining the midpoint of our preliminary FY 2024 subscription revenue guidance and narrowing the range to $6.525 billion to $6.575 billion, representing 17% to 18% year-over-year growth. In addition, we estimate the change in server and network equipment useful life will result in a roughly $100 million reduction to the GAAP and non-GAAP cost of subscription revenue in FY 2024, creating a benefit to operating margin of about 150 basis points this year. Please proceed with your question. Carl, since you have a relatively fresh pair of eyes looking at the business, I was wondering if you could just talk a little bit about what you're seeing in the close in 4Q and the pipeline that leads you to believe that getting back to 20% growth is achievable once we get into a more sort of normalized operating environment. As far as what we're seeing in the environment to think about getting back to a 20% growth, we see plenty of opportunity to continue to invest in the business, both on the go-to-market side with additional sales capacity in quota-carrying reps as well as continued investment in product and technology. Please proceed with your question. Please proceed with your question. In fact, there's -- two of the areas and changes we're making for this fiscal year is increasing sales capacity in two ways: one, with dedicated sellers to help convert the planning customers or those planning first customers into core financials, Accounting Center, Prism Analytics, some of the other solutions that are a nice follow-on to the office of the CFO. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And then if -- I don't think anyone's asked on your cash flow guide, if I could, I think a quick calculation suggests that you're guiding to operating margin improvement or percentage increase year-over-year of about 30% but your operating cash flow guidance implies more like a modest -- more modest 25% growth. Please proceed with your question."
}