{
    "symbol": "TCDA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 23:29:11",
    "content": " In today’s call, Gerrit Klaerner, our Founder, CEO and President, will provide an update on the ongoing VALOR-CKD renal outcomes trial and discuss our business progress. Please note that in today’s call, we will be making various statements that include forward-looking statements as defined under applicable securities laws. Forward-looking statements include our anticipated activities related to our ongoing VALOR-CKD renal outcome clinical trial, including early termination of the trial, anticipated endpoint events, accruals and the estimated timing for receipt of top line data as well as our expectations regarding our financial runway. Management’s assumptions, expectations and opinions reflected in these forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from any future results, performance or achievements discussed in or implied by such forward-looking statements. The trial has accrued 233 subjects with positively adjudicated primary endpoint events defined as renal death, end-stage renal disease, ESRD, or greater than or equal to 40% reduction in estimated glomerular filtration rate, eGFR. As we previously reported, based on our financial runway, we intend to stop the VALOR-CKD trial early for administrative reasons in the second quarter of 2022 with continued accrual of primary endpoint events into the third quarter of 2022. Based on the current event rate trend, we are updating the anticipated number of subjects with positively adjudicated primary endpoint events in the final analysis to 250 to 270. We anticipate reporting top line results from the VALOR-CKD trial early in the fourth quarter of 2022, which will allow for approximately 6 months of financial runway following the announcement. Assuming a true hazard ratio of 0.70, which corresponds to a 30% reduction in the veverimer placebo endpoint events, if there are 250 events in the final analysis, the trial has 78% power. Switching from power to observed hazard ratio statistics, we could be successful with 250 events, if the observed hazard ratio is 0.78 or lower and with 300 events if the observed hazard ratio is 0.79 or lower. Our first quarter results were in line with our expectations with R&D expense of $18.5 million and $32.2 million for the 3 months ended March 31, 2022 and 2021, respectively. G&A expense was $9.2 million and $9.9 million for the 3 months ended March 31, 2022 and 2021 respectively. Net loss was $29.6 million and $53.4 million, and non-GAAP net loss was $22.9 million and $38.3 million for the 3 months ended March 31, 2022 and 2021, respectively. We believe our current financial resources will fund our planned operations into early in the second quarter of 2023, which is anticipated to be approximately 6 months from the announcement of top line results for VALOR-CKD. Thanks for taking our questions. On the R&D expense, it was a bit lower than we were modeling, though it does seem like if this is your consistent R&D expense, that’s how you get to Q2 ‘23 cash runway. So Phil, R&D for Q2 and Q3 is estimated to be similar to Q1 with an uptick in Q4 probably somewhere between $8 million and $12 million uptick in Q4. Second on VALOR-CKD, it looks like there were maybe 16 events that were accrued over the last 2 months, which is a little bit higher than – in the past, you have suggested maybe 10 to 11 events per month. No, I think we – in the last 2 or 3 months, we do see more events. I think it’s still a modest uptick, but we have actually – that’s why we updated the projected number of primary endpoint events in the final analysis. And then last question again on VALOR-CKD, in the slides that you referenced, it calls out, as you suggested, the hazard ratio – observed hazard ratio of 0.78 to 0.79 for statistical significance based on events between 250 and 300. And I think what’s really, I think, consistent with what we said before is that 250 events is really a bit of a plateau. As you can see, every 50 events thereafter gives you may be around 0.01 of higher sort of threshold for hazard ratio. And remember, with 511 events, we would have been able to have statistical significance with I think it’s 0.83, so a hazard ratio of 0.83. Thanks for taking our questions. With regards to timing overall towards potential commercial launch, presuming we have the announcement of the VALOR study early in Q4, we would anticipate filing or resubmitting the NDA in Q2 of ‘23 and have a potential PDUFA date in Q4 of 2023. With regards to capital and runway, as I discussed earlier, we have sufficient capital based on our current plans through the first quarter of next year into the early part of Q2 of 2023. So, we have 7 million warrants outstanding with an exercise price of 11 and those warrants would expire 6 weeks after the announcement of VALOR-CKD data if, in fact, our stock price trades above $15 per share with a certain volume requirement. But assuming a good reaction to the VALOR positive data, we would have the opportunity to bring in $77 million through the exercise of those warrants, which would take us into late 2023 with regards to capital. Thanks for taking our questions. I think just to remember, the – I think the top line data is driven by our balance sheet and really sort of what we have discussed around the administrative stuff that this is really 6 months of cash left. I think we will obviously look at the primary endpoint and that – and then as we have said between what’s appropriate to put into the initial press release, what’s appropriate in – I think if it’s positive data, obviously, into one of the top journals, we are not going to reinvent the playbook here."
}