{
    "symbol": "RTLR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 14:40:28",
    "content": " During our conference call today, we will reference an updated investor presentation which can be found on Rattler’s website. Representing Rattler today are Travis Stice, CEO; and Kaes Van’t Hof, President. During this conference call, the participants may make certain forward-looking statements relating to the company’s financial condition, results of operations, plans, objectives, future performance and businesses. Welcome, everyone, and thank you for listening to Rattler Midstream’s first quarter 2022 earnings call. Despite limiting volume growth in the near-term, the flat production guidance of Rattler sponsored Diamondback Energy allows Rattler to efficiently manage its business and minimize unnecessary operating and capital outlays. Additionally, in keeping with the expected growth of the overall Permian Basin volume and years to come, these projects are expected to continue to grow volumes and accordingly cash flow for years to come. In combination with the operated CapEx, which is expected to decline dramatically once Rattler completes the construction of its centralized gathering system. The return of capital from these joint ventures will bolster Rattler’s free cash flow as the gap between equity method distributions and the growing equity method of EBITDA converges. I certainly think large scale M&A or new equity method JVs are off the table today, given what we’ve done in the last 9 months or so. It’s not really anything that’s going to move the needle much on the corporate level, but certainly can help at the asset level and that’s kind of where we’re focused. I think just like you’ve seen over the course of Rattler’s public history, we are focused on JVs in participating somewhere where Diamondback has a significant amount of volume or acreage dedicated to that particular JV or system. And, right now, on the Greenfield side, Diamondback doesn’t have control of enough gas molecules to contribute to a Greenfield pipe. We’re certainly pushing, putting my Diamondback hat on, we’re certainly pushing the G&Ps to commit to a new long haul pipe, but it won’t be through the Diamondback gain or the Rattler investment alongside it. This year is certainly a heavy year for operating CapEx, $80 million to $100 million, I think, we still feel good about that range, despite inflationary pressures. I would say that that’s going to encompass the majority of our necessary build out across our Martin County system, and then things will kind of move back down into a   maintenance/new battery connection type of capital. So, if you look back at kind of where we were last year, before we started building these new systems in Martin County is kind of a – $8 million to 12 million a quarter of CapEx. And then, when you think about capital allocation of the Rattler level. It’s certainly become a harder debate as the stock has improved in price, the flip between distribution and buyback. We’re very aggressive on the buyback back half of the year last year, it’s still out there. But, it’s still out there in times of weakness. I think, generally, we think the distribution is the primary return vehicle for Rattler as well as other midstream companies. I just think, this year, we spent some money in Q1 on the BANGL pipeline and we got a lot of CapEx relative to the forward outlook which is coming down. So, I think, a distribution increase is certainly something the board is going to discuss as we get more confidence in the free cash flow. So, I think, there’s discussion to be had in future quarters on raising the distribution quarterly or more consistently. I’d now like to turn the conference back to Travis Stice, CEO. If you’ve got any questions, please reach out to us using the contact information provided."
}