{
    "symbol": "NVS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 10:15:26",
    "content": " You'll remember that in September at our Meet the Management, we rolled out our new focused strategy, and we've been diligently -- diligently been implementing this across the company: five core therapeutic areas, two plus three technology platforms, four priority geographies, a mindset to really focus on high-value medicines to accelerate growth, delivering the return profile we believe the company can achieve, and you saw that already in quarter four and a continued commitment to culture, data science and building trust with society. We've also guided to improve financials with this new focused company, with 4% sales growth, a goal of core operating income margin of 40%, as I previously stated, continued improvement on free cash flow, and importantly, an improving and attractive return on invested capital profile. We're transforming the company to a pure-play IM company, five core TAs, five core technology platforms and our core geographic focus is a focus on the US, nine multibillion-dollar potential brands, a real emphasis on improving our R&D productivity towards high-impact assets and high-value assets, a focus on key TAs and building depth in those TAs, improving our financials, as you've seen with the margin delivery and the ongoing efforts we have to continue to improve the overall financial picture, shareholder focused capital allocation as we've shown with our dividend increase share buybacks and continued approach to how we dispose or move forward with assets such as Sandoz to our shareholders and continuing to strengthen our foundations with ESG and human capital. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}