{
    "symbol": "PEAK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 13:34:10",
    "content": " We delivered 500,000 square feet of new development including three new 100% leased Class A Life Science buildings, represent an investment of $262 million, along with three HCA on-campus MOBs represented an investment of $68 million. CCRCs are benefiting from strong demand and support of housing values with almost no new competition and CCRCs require 8 years to 10 years from predevelopment through stabilization, and our portfolio's replacement costs would be at least three times our cost basis. When you look at the 6-plus million square feet of land bank in the life science portfolio alone, just under half of it represents vacant land like Vantage in South San Francisco or excess land on properties that we acquired over the past few years like the post or the towers in South San Francisco. So on the quantitative side, you would look at things like cash on hand and the cash burn rate is -- we're looking at -- is this a company that's got less than 12 months of cash here, or is this a company that's raised a significant amount of money, that's going to carry them through the next three to four years. Obviously, we'd be willing to accept a little bit less creditworthiness if it's somebody is taken as a deal and we're not putting any more money into it as opposed to a tenant that's looking for a heavier investment from the landlord. Those companies end up at least a number of them needing a lot of space and you want to be their incumbent landlord, but it's not a high percentage less than 5%, but certainly not 100% investment-grade tenants. Now certainly with a four to five year average lease term, we're not repricing our contracts every day like some sectors, but it's not a super long lease term either at four to five years on average that, if inflation continues at the pace that it has been and construction costs continue to increase, our expectation is that market rents would eventually reflect that rapid growth and the same would be true with the escalator. And the expansion potential that we have is so significant and we have such competitive advantage, it leaves us in a place as we sit here today why would we go through the cost and effort and risk of taking on something very large when in fact it might produce an inferior outcome to what we consider to be an excellent strategy as we look forward over the next number of years where we do have competitive edge we have land at a low basis and densification opportunities and global relationships and MOBs, and even in CCRCs, a business that can't be replicated."
}