{
    "symbol": "SPGI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 15:45:41",
    "content": " Importantly, we're not moving Engineering Solutions to discontinued operations, so both of these figures include the half year contribution we expect from Engineering Solutions in 2023, excluding the impact of Engineering Solutions, we would have expected revenue growth to be approximately 6% to 8%. Excluding the ratings business, revenue growth would have been 6% in 2022 and adjusted operating margin would have expanded by approximately 200 basis points. While 2023 expected maturities have unsurprisingly decreased over the course of 2022, if we look at maturities in the years 2025 to 2027, we see a 12% increase from last year's study. We also originally expected 50% of our revenue synergies in 2024, but with the divestiture of engineering solutions, we now expect approximately 45%, though the full target of $350 million is unchanged. Market Intelligence revenue increased 3%, with strong growth in data and advisory solutions, offset by slower growth in desktop and declines in enterprise solutions. Looking across market intelligence, there was growth in most categories and on a pro forma basis, desktop revenue grew 3%, data and advisory solutions revenue grew 7%, enterprise solutions revenue was down 4% and credit and risk solutions revenue grew 4%. For enterprise solutions, softness in our capital markets volume-based products continued to weigh in on the business line's performance as revenue decreased 4%. Looking across the Commodity Insights business categories, price assessments grew 5% compared to prior year, driven by continued commercial momentum and strong subscription growth for market data offerings, particularly in gas and power and liquefied natural gas. Advisory and transactional services increased 3% in the quarter as we saw higher demand from energy transition advisory solutions, partially offset by revenues generated from a 2021 event that wasn't repeated in the fourth quarter of 2022. Moving to Upstream, I'm pleased to report the business line grew 4% in the fourth quarter, while upstream ACV has had good momentum ex-Russia, the revenue growth this quarter was primarily driven by upfront revenue recognition of certain software products that are not recurring. Turning to S&P Dow Jones Indices, revenue increased 4% year-over-year as growth in exchange rated derivatives offset declines in asset-linked fees revenue. We'll also continue to invest in technology as we drive innovation and position the company for accelerating growth in order to help investors see and assess the positive impact of these investments, we'll begin disclosing a few new metrics with our first quarter 2023 results, including our vitality revenue, which is the revenue generated by innovation, either new or enhanced products from across the organization. For revenue, we expect 4% to 6% growth, reflecting our continued belief of a mild recession in the first half of 2023 and then some economic strengthening in the back half of the year. As we mentioned at our Investor Day, this is skilled business that's well positioned in growing markets such as private markets and supply chain, and we're confident in our ability to accelerate growth as we lap the 2022 headwinds from volume driven businesses and FX. In Mobility, we expect revenue to grow between 6.5% and 8.5% and margins between 39% and 40%, driven by some normalization of auto supply chain, price realization, new business and new products adoption."
}