{
    "symbol": "ISEE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 14:04:08",
    "content": " As we continue to provide these exploratory analyses from GATHER1, we continue to see a pattern of the potential for us to observe in GATHER2 a reduction in the rate of GA growth for patients receiving Zimura as compared to patients receiving sham similar to that observed in GATHER1. At this year's Angiogenesis, Exudation and Degeneration conference, results from a post-hoc analysis that evaluated various GA growth parameters to explore the rate of disease progression within various regions of the fovea in a subset of patients from GATHER1 were presented. Consistent with the overall results of GATHER1 in the post-hoc analysis, a reduction in lesion growth in five standardized regions surrounding and including the central foveal area was observed for patients receiving Zimura two milligrams as compared to patients receiving sham over a period of 18 months. Last month, working with an independent and masked reading center, we provided the results of a post-hoc analysis of the cases of choroidal neovascularization, or CNV, in the Zimura two-milligram group, 67 patients total from GATHER1. Based on this definition, among the eight CNV cases in the Zimura two-milligram group in GATHER1 at month 12, four cases of exudative MNV translating to 6% of patients, and two cases of non-exudative MNV translating to 3% of patients were reported. In this retrospective review, the reading center found that among the six GATHER1 patients in the Zimura two-milligram group who developed exudative MNV over 18 months, five of those patients had a double-layer sign at baseline. The reading center also found that neither of the GATHER1 patients in the Zimura two-milligram group who had non-exudative MNV at 12-month, 14-month and 18-month timepoint had a double-layer sign at baseline. The first thing that I would say is the difference between GATHER1 and GATHER2 is not an inclusion criteria, but there is one slight change in the exclusion, which is that, in GATHER1, when we started that trial, the Duke Reading Center did not know whether in those few patients who developed the choroidal neovascular membrane whether the lesion could be accurately measured or not. Look, we've seen this movie before and we saw that it would be anti-VEGF story, right, where in the beginning, and I'm old enough to remember this, where patients we would say, look, we would just have patients come in, the other eye is damaged and you're looking at a monocular patient that's coming in late in the course of the disease with bad vision, and then we realized that the anti-VEGFs will actually do better if we treat them earlier."
}