{
    "symbol": "EIX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 21:09:04",
    "content": " Just this week, the U.S. EPA announced the first $965 million tranche of funding for the electric school bus program authorized by the infrastructure built with about $35 million supporting school districts in SCE's area. Meanwhile, we are awaiting CPUC review of SCE's $677 million building electrification application which will help catalyze this market in tandem with California's plans to include around $1 billion in state budgets over the next 5 years. In the 2023 proceeding, SCE has requested an ROE of 10.53%, which is strongly supported by SCE's analysis and the current interest rate environment. Additionally, the range around the parent expense we've shown you in the past also incorporates a range of equity content needs, up to $250 million per year on average, and the amount will vary with rate base growth. In the short term, though, I think the work that Maria mentioned around catalyst builds on the work that SE has been doing for over a decade and looking at how we control the parts that we can control in our cost structures to minimize rate impacts to if we make more room for the capital that's needed every dollar that you see on O&M can save around -- or can allow us to invest around $7 in capital while keeping rates constant. As you think about '23 relative to the core of the outlook through '25, is it fair to say that there's sort of a nonlinear element to getting to that 5% to 7%, i.e., near-term pressures with respect to the refinancing, et cetera, but ultimately, between the cost savings that you've identified and latitude on timing of equity that you can get to that '25 outlook in kind of a nonlinear way? That's been part of the if you go back to when we first started to talk about the plan through 2025, we talked about $250 million per year on average but that get at the higher end of that range if you're at the higher end of the capital range."
}