{
    "symbol": "MEI",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-09 21:55:28",
    "content": " Our sales for the quarter were $280 million, they were down 4% compared to the prior year, but up 4% excluding a significant headwind from foreign exchange and a sharp drop in material spot buys and premium freight cost recovery. As you can see from this chart, since the beginning of fiscal year 2021, we have won approximately $400 million in EV awards. Please turn to slide nine, third quarter net sales were $280.1 million compared to $291.6 million in fiscal â\u0080\u009822, a decrease of $11.5 million or 3.9%. Third quarter impact from operations decreased 8.4% to $27.3 million from $29.8 million in fiscal â\u0080\u009822, mainly due to unfavorable currency translation and material cost inflation, partially offsetting those factors was lower selling and administrative expense. It is worth noting that absent the unfavorable foreign currency impact of $2.3 million, our operating income would have been flat year-over-year despite the $11 million in lower sales. Third quarter selling and administrative expenses as a percentage of sales was 11.7%, as compared to 11.8% in the fiscal year â\u0080\u009922, a 10-basis point decrease. Shifting to EBITDA, our non-GAAP financial measure third quarter EBITDA was $36.1 million versus $47.9 million in the same period last fiscal year, a 24.6% decrease. Third quarter EBITDA margin was 12.9% versus 16.4% in the same period last fiscal year, a 350-basis points decrease. Third quarter cash from operating activities was a healthy $55.7 million, as compared to $20.1 million in the fiscal year â\u0080\u009822. Third quarter capital expenditure was $12.8 million, as compared to $8.3 million in fiscal â\u0080\u009922, an increase of $4.5 million. Third quarter free cash flow another non-GAAP financial measure was $42.9 million, compared to $11.8 million in fiscal year â\u0080\u009922, an increase of $31.1 million. And this is ancient history, but if you go back to when we launched K2 from memory, I think it was from fiscal year â\u0080\u009813 to â\u0080\u009814, we had a $250 million jump in sales, when we were launching Center Council."
}