{
    "symbol": "MEI",
    "quarter": 2,
    "year": 2023,
    "date": "2022-12-01 18:42:04",
    "content": " Our sales for the quarter were a record $316 million, this was achieved despite a significant headwind from foreign exchange, which was partially offset by strong sales in China, loss sales due to the COVID lockdowns in China in the first quarter were recovered in the second quarter. Second quarter net sales were a record $315.9 million, compared to $295.5 million in fiscal â\u0080\u009922, an increase of $20.4 million or 6.9%, led by record sales in the Industrial segment. Second quarter income from operations decreased 1.2% to $32.8 million from $33.2 million in fiscal year â\u0080\u009922, mainly due to higher selling and administrative expenses, as well as unfavorable foreign currency translation. Second quarter selling and administrative expenses as a percentage of sales was 11.6%, compared to 10.6% in fiscal year â\u0080\u009820, a 100 basis point increase. Shifting to EBITDA, a non-GAAP financial measure, second quarter EBITDA was $46.1 million versus $47.4 million in the same period last year, a 2.7% decrease. Second quarter cash from operating activities was $15.4 million, as compared to $27 million in fiscal year â\u0080\u009822. Second quarter capital expenditures was $8.4 million, as compared to $5.4 million in fiscal â\u0080\u009822, an increase of $3 million. Second, free quarter cash flow a non-GAAP financial measure was $7 million, as compared to $21.6 million in fiscal â\u0080\u009822, a decrease of $14.6 million. And then second question for Ron, just regarding working capital inventory of course it's been ramping in the last year plus or so, but it kind of planned out this quarter instead, there is a big step up in AR side to the higher sales, can you just expand on how you're thinking about working capital into year-end and into next year both as it relates to cash flow, which already commented on to some extent, but I'm wondering maybe more importantly strategically relative to the current environment as well? The other thing we had there John was our power business into data centers, which is a nice business for us, kind of, lumpy business and in the first two quarters, we experienced really great sales from that and we -- in our guidance we contemplated a bit of lowering or tempering of not maintaining that level in the second half of the fiscal year."
}