{
    "symbol": "RMD",
    "quarter": 1,
    "year": 2023,
    "date": "2022-10-27 21:13:06",
    "content": " These financial results demonstrate solid performance across our entire business, driven by strong sales growth in the Americas region as well as ongoing high demand for our sleep and respiratory care devices and mask systems worldwide. Let me now review updates on ResMed's top 3 strategic priorities: number one, to grow and differentiate our core sleep apnea and respiratory care businesses; number two, to design, develop and deliver market-leading medical devices as well as digital health solutions that can be scaled globally; and number three, to innovate and grow the world's best software solutions for care delivered outside the hospital and especially in the home. In Europe, Asia and other markets, device sales decreased by 10% in constant currency terms, mainly as a result of the ongoing challenges in securing sufficient production components for connected devices and lower sales of higher acuity devices relative to the strong sales we experienced in the prior year quarter. Thanks for the question, Matt. Thanks for the question, Matt. We applied those same skills really these last 12, 15 months of having a global team looking at the 140 countries we operate in, looking on a humanitarian basis, as the needs for people who are suffocating now in our core market, suffocating with sleep apnea and other -- on the AirSense 10 platform, we do have other respiratory care and respiratory insufficiency capabilities as well and the AirSense 10 connected devices on bio levels. These huge population markets to look at different methods of getting to patients and ensuring that care is delivered across socioeconomic bounds and there's health equity and the delivery of our products in these high-growth markets or some really exciting things Justin Leon and his team are driving in our Asia, Latin America demand gen initiatives. It's interesting to note that with our really strong growth of masks, they're 11% in the quarter in U.S., Canada and Latin America. That's just the standard competitive market, and ResMed is out there fighting for it even with the lower flow of new patients, as we talked about earlier, due to the fact that not every patient who needs a new setup is getting it even though the vast majority of those sales are repeat sales to customers already in our installed base of amazing people being treated every day by ResMed masks."
}