{
    "symbol": "NICE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 11:31:06",
    "content": " We crossed $2 billion in total revenue, achieved 60% in cloud revenue as a percent of total revenue, continued to move swiftly towards the 30% plus operating margin, witnessed a massive expansion in AI adoption and had the best year ever for both new customer acquisition and new partner onboarding. Recurring revenue, which mainly comprises our Cloud and Maintenance revenue, increased further year-over-year to a record 85% of total revenue in the fourth quarter compared to 80% in the same period last year. Customer engagement revenues, which represented 82% of our total revenue in Q4 were $467 million, an 11% increase and 12% increase in constant currency compared to last year. Revenues from Financial Crime and Compliance, which represented 18% of our total revenue in Q4 and totaled $102 million, increased 6% year-over-year and 9% in constant currency. In Q4, operating income increased by 12% year-over-year to a quarterly record of $163 million, and our industry-leading operating margin increased to 28.6% compared to 28.2% last year. Our first quarter and full year 2023 revenue and EPS guidance is as follows: for the first quarter of 2023, we expect total revenue to be in the range of $559 million to $569 million representing 7% year-over-year growth at the midpoint. Please proceed with your question. So as you highlighted, we provided a range of cloud revenue growth expectation between 22% and 25% for the year â\u0080\u0093 of course, that's following a really impressive growth we had in our cloud of 27% for the full year last year and 26% in the fourth quarter. Please proceed with your question. And as a result of that, as Beth said, we are going to experience a decrease in product revenue, but it's the right thing for building ourselves as a very large and fast-growing Cloud company, especially with the fact that our Cloud is coming at north of 70% gross margin that is not just a top line play, it also allows us to build an extremely profitable business moving forward. Please proceed with your question. Please proceed with your question. And the reason why we've managed to be the first one is the fact that we have ENLIGHTEN fully embedded in CXone and we've been working on that for several years, and we have pretty mass adoption of ENLIGHTEN, which allows us to relatively easily integrate a variety of tools like Google Dialogflow, that is kind of a different thing, but obviously ChatGPT and I will mention or into the fact that don't forget that we also have a pretty unique partnership with Microsoft, which I think hinting to also certain elements down the road that we can do on this combination. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}