{
    "symbol": "NICE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 12:49:01",
    "content": " We continue to drive excellent top line growth and at the same time, further improve our unmatched profitability as demonstrated by a 16% increase in operating income, 17% growth in EPS and continued strong operating cash flow with a record of $193 million generated in Q1. Cloud as a percentage of the new bookings in our international business increased significantly year-over-year, led by several large cloud deals and the total number of international CXone deals more than doubled in Q1. Total revenue for the first quarter increased 15% year-over-year to $527 million, and non-GAAP fully diluted EPS increased 17% year-over-year to $1.80. Our total revenue growth is mainly attributed to the growing contribution from cloud revenue, which increased 28% year-over-year to a total of $295 million and represented a record 56% of total revenue, up from 50% in Q1 last year. Services revenue, which totaled $157 million and represented 30% of total revenue, decreased 3% year-over-year in line with expectations as existing on-premise customers continue to gradually shift to the cloud. Revenues from Financial Crime and Compliance, which represented 20% of our total revenue in Q1 and totaled $106 million increased 20% year-over-year, primarily coming from product revenue. We experienced another phenomenal quarter with industry-leading cash flow generated from our operations, which totaled $193 million in Q1, increasing 17% year-over-year. And the trend that you're seeing this year is what we expected that we've seen in prior years as well that, that will continue, where -- as a result of the fact that we have consistent strong growth in the cloud and a higher level of recurring revenue, that means we see a more equal distribution of both revenue and profitability throughout the year. What we see these days is that the framework I've talked about before of CXI, which is actually further convergence of what I said before, plus digital, plus self -- or smart service -- smart self-service is also starting to get into RFPs that customers understand that in order to make it a reality, they can't keep buying point solutions from multiple vendors and try to integrate a deal and they need to buy a platform that is native with all of those solutions."
}