{
    "symbol": "AGEN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 10:19:48",
    "content": " At this time, I would like to welcome everyone to the Agenus Second Quarter 2022 Financial Results Conference Call. Good morning, everyone, and welcome to our second quarter earnings results conference call. Iâ\u0080\u0099m Ethan Lovell, Agenus' Chief External Affairs and Communications Officer, and I have with me today on the call, Agenus', Chairman and CEO, Garo Armen; and the company's Vice President of Finance, Christine Klaskin. Also joining us today is the Genesis' Chief Medical Officer, Dr. Steven O'Day, who will be available during the Q&A portion of this call. Before I turn the call over to Garo for his prepared remarks, I would like to read our forward-looking statement disclosure. This call will include forward-looking statements, including statements regarding our clinical development, regulatory and commercial plans and timelines including time lines for data release and partnership opportunities. We will concentrate to start on our priority clinical programs, which have demonstrated highly exciting activity. We will also provide updates on our earlier stage programs, which we expect to deliver successful outcomes interconnect based on the robust research and preclinical data that's been generated so far. Our late-breaking submission was offered prime of place at the conference's opening session, and Dr. Anthony El-Khoueiry presented on heavily pretreated MSS colorectal patients who are treated with our novel adaptive innate immune activator called balstilimab in combination with our anti-PD-1 antibody balstilimab. We will call these buck bang for sure, but this combination delivered 24% overall response rates and 73% disease control rate with a substantial number of these patients showing responses at data care. In addition, these patients had tumors, which were PD-L1 negative with low tumor mutational burden responsive patients included those who had failed prior I-O therapies. All of these make the patients treated in our trial, highly unlikely to respond to immunotherapy or conventional immunotherapy and certainly, not other treatments either. While this trial was not randomized, experts in the field were satisfied with our criteria for selecting patients who are heavily pretreated and that we're not confounding factors, which would subjectively favor outcomes achieved in the study. This data has translated into significant interest in our upcoming clinical trials with botensilimab and we have received a substantial number of unsolicited inquiries from leaders in the field to participate in our upcoming CRC melanoma, and pancreatic cancer trials. The unique attributes of botensilimab and the unprecedented response that they achieved in patients with cold tumors, has also generated significant interest in future trials of other cold tumor cancers, such as gynecological cancers, gliomas, breast cancer and pediatric cancers. We're currently working with the FDA and other global regulatory agencies to start randomized Phase II clinical trials, which we hope will begin very shortly. This includes botensilimab, as a monotherapy and in combination with balstilimab. All of our pipeline products have been designed, and this is a very important point to note, to perform in unique ways as combination or monotherapies and all of our programs are designed to address the limitations of current I-O treatment to deliver improved and differentiated patient benefit. With Botensilimab, we're very encouraged to see the design performance of this molecule play out in what clinicians described to be the unprecedented clinical benefit in heavily pretreated cold tumor cancers. And this, of course, is beyond the next three cancers that we have defined as our Phase 2 clinical protocols to commence shortly. Among the attributes of balstilimab, is consistent activity we're seeing across nine solid tumors, including as we've talked about earlier, gynecological cancers, sarcomas, which have not responded to available isle of treatments. Powered by our sophisticated discovery, antibody engineering and vision platforms weâ\u0080\u0099ve design, for example, our CD137 agonist AGEN2373, a to retain or enhance the efficacy of first generation of CD137 agonists, while avoiding liver toxicity that derail the development of other such molecules. Thus far, we've seen early signals of activity with no liver toxicity in the clinic and are moving to complete our enrollment in a combination study of AGEN2373 and Botensilimab in relapsed refractory melanoma to start. AGEN1571 is a potent inhibitor of ILT2, a broadly expressed receptor that suppresses myeloid and lymphoid responses and which is believed to contribute to PD-1 and CTLA-4 resistance. That is suppression all myeloid and lymphoid responses, we believe are responsible partly for PD-1 and CTLA-4 resistance. We're very optimistic about AGEN1571, given our competitive positioning is and the encouraging activity of a similar antibody, we discovered and licensed to Merck. Merck has published data demonstrating strong activity in heavily pretreated patients, with solid tumors, when combined with anti-PD-1 therapy, including a 45% response rate in patients who have progressed on prior PD-1 therapy alone. Naturally, the question of access to ample resources, to make these programs, to take these programs to the finish line has come up from time-to-time in both internal and strategic planning and external discussions. Tactics we've used included prioritization of key near-term value drivers, building internal capabilities to reduce dependence on outside vendors, including suit-to-nut commercial manufacturing of our products, clinical trial management and execution through our own CROs and of course, our own internal discovery engine and development. Our largest cash resources over the past half a dozen years have been corporate transactions, which have netted us over $800 million. Regarding our partnered antibodies in active development, in addition to the earlier mentioned MERC-licensed antibody, MK-4830, the list includes our anti-TIGIT bispecific AGEN1777 licensed to Bristol-Myers along with our four immunotherapies licensed to Incyte. These are all advancing in the clinic and as these programs successfully progress, they have the potential to trigger milestone payments to Agenus totaling close to $3 billion in addition to sales-based royalties for those molecules that reach commercial launch. In the half -- past half a dozen years, Agenus has delivered exceptional productivity by advancing 15 antibodies and cell therapies. Biopharmaceutical discovery and development is a high-risk, high-reward endeavor and we believe we have a powerful set of capabilities when it comes to choosing targets, combinations, and design elements for IO innovation and success. We recognized revenue of $21 million for the second quarter ended June 2022, which represents an increase of $10 million from the $11 million reported for the same period in 2021. Revenue for the six months ended June 2022 was $47 million, an increase of $25 million from the same period in 2021. For the second quarter ended June 2022, our cash used in operations was $43 million, compared to $56 million for the same period in 2021. Our net loss for the quarter ended June 2022 was $49 million or $0.17 per share, compared to a net loss of $84 million or $0.37 per share for the quarter ended June 2021. Non-cash operating expenses for the second quarter ended June 2022 were $19 million, compared to $30 million for the second quarter ended of 2021. Our cash used in operations for the six months ended June 2022 was $96 million with a net loss of $100 million or $0.35 per share, compared to cash used in operations of $98 million and a net loss for the same period in 2021 of $138 million or $0.65 per share. Thank you very much, Christine, and I think we're ready for any questions that you may have from the field. Your line is now open. So I'm going to ask Dr. O'Day and perhaps even Dhan Chand, who has joined us today for why we have query this in preclinical models and the research rationale and perhaps Dr. Oâ\u0080\u0099Day can elaborate on that more. But first is that you will recall from our â\u0080\u0093 our AACR poster actually earlier this year, demonstrating the high expression of ILT2 and ILT2 positive myeloid cells in patients that did not respond to checkpoint therapy. The second is that we've demonstrated in preclinical disease relevant models that the combination of PD-1 and AGEN1571 enhances T cell activation, NK cell activation and NKT activation and the combination of botensilimab and AGe1571 potentiates immune activation. One of the reasons for this is that ILT2 is known to inhibit Fc Gamma R signaling, which is critical for therapies like botensilimab and AGEN1571 release that. And then lastly, when you look at patient sample, particularly tumor-infiltrating lymphocytes and tumor cells, as shown in our AACR poster, you'll notice that PD-L1 and HLA-G, the ligand for ILT2 are expressed on different subsets of tumor cells and in cells. This suggests that a combination of balstilimab, botensilimab with AGEN1571, where we leverage different arms of immune system with potential anti-human unity. And yes, we're very excited about this ILT2 program as potentially best first-in-class based on Dan said, the preclinical data suggests that we have both a myeloid and lymphoid checkpoint that could be quite synergistic and really build into some of the mechanism of resistance of PD-1 and CTLA-4. And obviously, the ILT4 program that we -- our antibody that Merck is â\u0080\u0093 is using is obviously advancing in the clinic with objective responses. And what's exciting about this program is we will be looking for monotherapy, single-agent activity but obviously, the program is designed to fold in both tau ILT2 combinations and Botensilimab combination. So more to come, but a very exciting program that's now in the clinic after some tremendous preclinical work and drug design. So the question is to be answered at an upcoming major conference that's going to release data, not just for the additional patients that have been enrolled and studied in the CRC cohort, but some of the major cohorts as well. Now, as far as any particular milestones, as we've said publicly and I think we've alluded to this during the course of our press release that we expect this year to receive a total of approximately $25 million from the payment that's due to us as part of the transaction that we consummated with HCR for QS-21. So that will happen during the course of this year, and that's, of course, a non-dilutive component, but additional partnership discussions and consummation of these discussions to take them to conclusion, we'll wait for more specific deal announcements for that. Your line is now open. So, I think, in terms of the specific design of the trials, I mean, as you know, Matt, we have said specifically that we expect to start three randomized Phase 2 trials, those will commence soon. So, the plan is for us to present the -- a number of cohorts of this study at another major conference coming up, which we have not announced yet. Your line is now open. Sorry, the question is what is the impact of Nivo LAG-3 in the melanoma space with our trial design. Well, I think that the exhaustion checkpoints like LAG-3 and TIM-3 and obviously PD-1 are obviously very different targets than CTLA-4. So obviously, with first-line melanoma, now there's three frontline options, CTLA-4 with PD-1, PD-1 monotherapy and then PD-1 LAG-3. So, we'll be addressing all those cohorts with our design of our Botensilimab, which we think is obviously, a very unique different checkpoint than the exhaustion checkpoints. In closing, I'd like to just reiterate the point that with the data disclosure of Botensilimab plus balstilimab, we have received many accolades about the robustness of the responses that we've seen, in fact, many of the long-term experts in the field, including certainly CRC experts have commented on the fact that they have not seen such responses with conventional immunotherapy. And that will set the stage for us to be able to do our next set of trials, randomized trials with the hope that we will get to the finish line with the collaboration of many of the experts in the field, as well as regulatory agencies throughout the world. So, I'll end my comments and if you have any additional questions and queries, please don't hesitate to get in touch with us."
}