{
    "symbol": "AGEN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 12:36:06",
    "content": " Over the last 12 months, we've made substantive progress addressing the ongoing botensilimab development program, including having dosed over 300 heavily pretreated patients with advanced solid tumors as part of our Phase 1b trial. Based on the unprecedented clinical responses in these patients, we have initiated three global randomized Phase 2 trial, evaluating the efficacy and safety of botensilimab monotherapy or combination therapy with balstilimab in MSS colorectal cancer, melanoma, and pancreatic cancer. We aim to initiate a Phase 3 study in MSS colorectal cancer later on this year in the hope that the cumulative data that we've generated between Phase 1, the Phase 2 randomized trials and the initiation of our Phase 3 trials will lead to a rapid approval path for the benefit of the patients. Together with our investigators, we were pleased to have had the opportunity to present data updates from the botensilimab and balstilimab development program at five medical meetings over a nine-month period, including plenary sessions at ESMO World Congress on Gastrointestinal Cancer, the Society for Immunotherapy of Cancer, otherwise known as SITC, the Connective Tissue Oncology Society, known as CTOS along with a late-breaking oral session at the American Society of Clinical Oncology Gastrointestinal Cancer Symposium this past January, and finally, an oral plenary session at the upcoming Society of Gynecologic Oncology Annual Meeting. These presentations highlighted the durable responses and meaningful clinical benefits of the botensilimab, balstilimab combination compared to what has been reported with standard of care and other investigational therapies in patients with MS stable colorectal cancer, non-small cell lung cancer, ovarian cancer and sarcoma. In metastatic MS stable colorectal cancer after failure of first and second line therapies, the current standard of care is a 12-month overall survival rate of approximately 25% and an overall response rate of only 1% to 2%. Our latest update of botensilimab program in metastatic MS-stable colorectal cancer was from an expanded cohort of 70 evaluable patients presented at ASCO GI by Dr. Anthony El-Khoueiry, Associate Director for Clinical Research at USC Norris Comprehensive Cancer Center and the Keck School of Medicine at USC. This presentation showed that treatment with botensilimab, balstilimab combination resulted in a 12-month survival rate of 63% and including a 12-month survival rate of 81% in patients with no active liver metastasis and a 40% 12-month survival rate in patients with active liver metastasis, suggesting a favorable overall survival in each of these patient subpopulations. In 19 evaluable patients with platinum relapsed refractory ovarian cancer, we observed high responses for an overall response rate of 26% and a disease control rate of 63%. We have launched a randomized Phase 2 trial of botensilimab and the botensilimab, balstilimab combination therapy in patients without active liver metastasis who have received one or two prior lines of standard of care therapy. We intend to submit a regulatory review of MS stable colorectal cancer in 2024, a data package with this randomized Phase 2 study, along with data for more than 300 patients in the Phase 1b study. In metastatic pancreas cancer, we are evaluating a second line patients in a Phase 2 randomized study comparing standard of care gem-abraxane to gem-abraxane in combination with botensilimab therapy. As we progress trials to support potential registration in colorectal cancer, melanoma and lung cancer, we plan to leverage these important partnerships to expand development in indications such as sarcoma and ovarian cancer as well as other areas where botensilimab has already demonstrated promising potential clinical benefit. We're expecting to complete enrollment of our global randomized Phase 2 activate studies of botensilimab in MSS colorectal cancer, melanoma and pancreatic cancer plus we expect to initiate a Phase 3 study of botensilimab with balstilimab in MSS colorectal cancer complete enrollment of our Phase 1b study of botensilimab and AGEN2373. Your line is open. And even though there are some and it had cancer for the most part, but there are a number of patients that fail current therapies, including I-O regimens in combination with other agents and that's the patient population that we've targeted in our Phase 1 trial that would be the patient population targeted in our expanded cohorts, and that's the patent population that we will go after in our registration strategy. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}