{
    "symbol": "ARGO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 13:35:19",
    "content": " Operating earnings per diluted share of $1.24 increased from $0.44 in the prior year first quarter, while our annualized operating return on common equity of 11.4% improved from 3.7% a year ago. However, in our ongoing business growth written premiums increased approximately 6.9% compared with the prior year first quarter. In the first quarter of 2022, we reported a loss ratio of 59% and improvement of seven percentage points from the 66% were reported in the prior year period. The main driver’s improvement in the loss ratio is reduced cap losses, and our cap losses totaled $8.7 million, or just under two percentage points of the combined ratio in the first quarter of 2022. The current accident year ex-cat loss ratio 56.5% in the first quarter of 2022, is up marginally over the 55.6% were reported in the first quarter of last year. Our U.S. operations underwriting income of $22.5 million for the first quarter of 2022 increased $11.2 million from the prior year first quarter, while a combined ratio of 93.3% improved 3.1 percentage points from a year ago. The expense ratio 32% decrease 2.2 percentage points from the prior year first quarter, and was driven by a 3.3 percentage point improvement in the G&A expense ratio. The reduction in the G&A expense ratio was driven by $7 million decrease in general and administrative expenses, coupled with a 7% increase in net earned premium in the first quarter of 2022. Our international operations reported underwriting income of $13.3 million in the first quarter of 2022 compared to an underwriting loss of $21.8 million in the prior year first quarter. Catastrophe losses of $4.7 million during the first quarter of 2022 or 3.3 percentage points on the combined ratio compared favorably to cap losses of $26.6 million or 17.6 percentage points on the combined ratio in the prior year first quarter. The expense ratio of 38.1% decreased 3.3 percentage points in the prior quarter driven by changes in business mix, aimed at exiting business with higher acquisition costs, which have benefited the acquisition ratio and improvement in the G&A expense ratio reflecting a lower level of general and administrative spend. The reduction in shareholders equity during the first quarter of 2022 is largely attributable to $143.6 million of unrealized investment losses, net of tax and our fixed income portfolio due to the increases in interest rates. First, I’m hoping to start with the expense ratio just given where it came in for the first quarter and maintaining the 36% target for the year."
}