{
    "symbol": "RDN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 23:47:04",
    "content": " At September 30, the Radian Group maintained nearly $850 million of total holding company liquidity and Radian Guaranty's available assets under PMIERs totaled approximately $5.4 billion, resulting in a PMIERs cushion of $1.6 billion or 44%, which we believe positions us well to navigate this environment. To recap our financial results issued last evening, we reported GAAP net income of $198.3 million or $1.20 per diluted share for the third quarter of 2022 as compared to $1.15 per diluted share in the second quarter of 2022 and $0.67 per diluted share in the third quarter of 2021. Our reported Homegenius pretax operating loss before allocated corporate operating expenses was $20 million for the third quarter of 2022 compared to $12 million for the second quarter of 2022 and $600,000 for the third quarter of 2021. Our reported Homegenius adjusted gross profit for the third quarter of 2022 was $6.3 million compared to $11.2 million for the second quarter of 2022, and $17.9 million for the third quarter of 2021. As noted on webcast Slide 15, we had a benefit of $97.5 million in our mortgage provision for losses for the third quarter of 2022 compared to a benefit of $114.2 million in the second quarter of 2022 and a loss of $16.8 million in the third quarter of 2021. Also, as noted on webcast Slide 15, the provision for losses for the third quarter of 2022 includes positive reserve development on prior defaults of $136.7 million. While the strong home price appreciation experienced in recent years is also expected to benefit our current period new defaults, we maintained our prior quarter assumptions for those defaults for the third quarter of 2022, including the default to claim rate assumption on new defaults at 8% as we continue to closely monitor the trends in cures and claims for our default inventory while also weighing the risks and uncertainties associated with the current economic landscape. Other operating expenses were $91.3 million in the third quarter of 2022, an increase compared to $90.5 million in the second quarter of 2022 and $86.5 million in the third quarter of 2021. The increase in other operating expenses as compared to the same quarter prior year is primarily related to increased employee expenses in our Homegenius segment since prior year of $8.4 million, partially offset by a $4 million decrease in mortgage operating expenses. To aid in the analysis of our operating expenses, we have provided additional segment level detail on press release Exhibit E. And as Rick mentioned earlier, we have embarked on a significant effort to better align our expenses and workforce to our current and expected work environment and efficiency goals in response to what had been an upward trend in our expense base to almost $90 million a quarter on a normalized basis. As of September 30, 2022, we have reduced Radian Guaranty's PMIERs minimum asset requirements by $1.2 billion by distributing risk through both insurance-linked notes reinsurance and other third-party reinsurance arrangements as noted on press release Exhibit K. As previously announced, in July 2022, Radian Guaranty agreed to terms on a quota share reinsurance arrangement with a panel of highly rated third-party reinsurance providers."
}