{
    "symbol": "RDN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 19:09:12",
    "content": " For our Homegenius segment, total revenues for the quarter were $33.9 million, a 31% increase compared to the first quarter of 2021. To recap our financial results issued last evening, we reported GAAP net income of $181.1 million or $1.01 per diluted share for the first quarter of 2022 as compared to $1.07 per diluted share in the fourth quarter of 2021. Total net premiums earned were $254.2 million in the first quarter of 2022, down compared to $261.4 million in the fourth quarter of 2021 and $271.9 million in the first quarter of 2021. As noted in the prior quarter, the in force yield for the fourth quarter of 2021 would have been approximately 40.1 basis points, absent $5.5 million of adjustments noted earlier. Our Homegenius segment revenues were $33.9 million for the first quarter of 2022, compared to $44.7 million for the fourth quarter and $25.8 million in the first quarter of 2021, which is a 31% increase year-over-year. Title premiums of $9 million in the first quarter of 2022 were up 25% from the first quarter of 2021, but down 23% from the fourth quarter of 2021. As noted on webcast Slide 14, we had a benefit of $84.2 million in our mortgage provision for losses for the first quarter of 2022 compared to a benefit of $46.5 million in the fourth quarter of 2021 and a loss of $45.9 million in the first quarter of 2021. Also, as noted on webcast Slide 14, the provision for losses for the first quarter 2022 includes positive reserve development on prior defaults of $124.9 million. For additional context, based on the continued strong cure volume, we reduced the default to claim rate assumption for the large population of defaults first reported in the second quarter of 2020 to an ultimate rate of approximately 4% this quarter compared to 6.5% last quarter and our original assumption of 8.5% set in the second quarter of 2020. Other operating expenses were $89.5 million in the first quarter of 2022, an increase compared to $80.5 million in the fourth quarter of 2021 and $70.3 million in the first quarter of 2021. Radian Guaranty's excess PMIERs available assets over minimum required assets was $1.6 billion as of the end of the first quarter, which represents a 44% PMIERs cushion. As of March 31, 2022, we have reduced Radian Guaranty's PMIERs minimum required asset requirements by $1.2 billion, by distributing risk through both insurance-linked note reinsurance and other third-party reinsurance arrangements as noted on press release Exhibit K. As of March 31, 2022, Radian Guaranty had risk distribution covering approximately 67% of our risk in force. During the first quarter of 2022, we returned approximately $36 million to shareholders through dividends."
}