{
    "symbol": "FCRD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 18:35:05",
    "content": "  Operator: Good morning, and welcome to First Eagle Alternative Capital BDC, Inc. earnings conference call for its first fiscal quarter ended March 31, 2022. It is my pleasure to turn the call over to Sabrina Rusnak-Carlson of First Eagle Alternative Capital BDC, Inc. Ms. Rusnak-Carlson, you may begin. Joining me on today’s call are Chris Flynn, President of First Eagle Alternative Credit; Jen Wilson, our Chief Accounting Officer; Jim Fellows, our Chief Investment Officer. The uncertainties and other factors are, in some ways, beyond management’s control and include the factors included in the section entitled Risk Factors in our most recent annual report on Form 10-K as updated by our quarterly report on Form 10-Q and our periodic and other filings with the Securities and Exchange Commission. With that, I’ll turn the call over to Chris. On today’s call, I want to discuss recent actions we’ve taken to drive strategic initiatives as well as review our first quarter results and share some portfolio highlights. From there, I’ll hand the call over to Jen to discuss our portfolio and financial results in more detail. We had a busy quarter working toward our 3 strategic initiatives: one, reducing our cost of debt; two, increasing our portfolio yield; and three, increasing our portfolio diversification. First, we’ve effectively reduced our debt financing. Second, we refinanced the Logan JV into a middle market CLO structure, which we expect to increase the dividend to FCRD as a result of this incremental leverage. Despite a challenging market stemming from the war in Ukraine, inflationary pressures, competition for AAA buyers, we were able to secure a deal that we believe is favorable to our shareholders, and that’s thanks to the overall strength of our platform. Moreover, we expect the Logan JV return on equity to increase from around 10% historically to approximately 14% going forward with this new structure. To show our alignment with shareholders, we agreed to waive $400,000 of our management fee in Q1 and part of the management fee waiver in Q2 in order to maintain the $0.10 dividend. We noted during our last call in connection with increasing portfolio yield, we aim to increase our leverage range and increase our allocation to higher-yielding asset-based loans. In connection with the amendment to the credit facility, we have increased the credit facility size to $175 million and pushed out our maturity date, which allowed us to further increase leverage. We ended the quarter with a net asset value of $6.12 per share, down 3.5% on a quarter-over-quarter basis. Similar to the broader market trends, we have seen a few of our portfolio companies facing supply chain challenges, labor shortages as well as inflationary pressures, including in-place wages and material costs. As we’ve noted before, portfolio diversification and stabilization of our investment portfolio is of paramount focus. In line with that trend, the FCRD portfolio invested $2.3 million in a new portfolio investment in Q1 with an additional $17.5 million invested in follow-on investments, including revolvers and delayed draw fundings. The growth of the platform allows the BDC to hold a more diversified portfolio, with the number of positions up from 45 in Q1 of 2018 to 77 this quarter, while also allowing First Eagle to provide more capital to middle market businesses. First Eagle’s Direct Lending platform has remained robust, and we expect it to continue to provide us with attractive investment opportunities. With that, I’ll turn the call over to Jen. First, I’ll start off with some investment and portfolio highlights. As Chris mentioned, Q1 was a relatively muted quarter for a new activity with 1 new and several follow-on investments totaling $9.8 million at a blended yield of 6.5%. As of March 31, our portfolio was valued at $400.7 million, up slightly from $392.1 million at the end of Q4. The remaining 4% of the BDC’s portfolio was held in second lien debt and other nonincome-producing and equity holdings, including our restructured equity-like second lien investment in OEM. The weighted average yield on the debt and income-producing portfolio, based on costs and including Logan, was 6.5% in Q1, which was flat with Q4. Total nonaccruals as a percentage of our portfolio at fair value and at cost were 2% and 4.5%, respectively. During Q1, we recognized $7.4 million of investment income primarily from interest and dividends. Interest income decreased approximately $548,000 from Q4 to $5.5 million for Q1. The decrease was primarily driven by the decline in accelerated amortization of OID from $367,000 in Q4 to $17,000 in Q1. Dividend income from Logan JV was relatively flat quarter-over-quarter at $1.7 million, and other income of $230,000 was approximately half of Q4. Total expenses net of management fee waivers for the quarter were $4.5 million, down from $5.3 million in Q4. The biggest driver of the decrease were a $379,000 decrease in interest and fees on borrowings during the quarter due to our 2023 notes being fully redeemed prior to year-end as well as the $433,000 decrease in management fees due to a decrease in our net asset value and a $400,000 waiver during Q1. With that, I’ll turn the call back over to Chris. Before I turn the call over to Q&A, I wanted to take a moment to assure our shareholders that we’re committed to doing what’s right here. We have the benefit of a $20 billion platform in direct and tradable credit assets where we successively managed private funds, CLOs, separately managed accounts, levered and unlevered for institutional investors. As noted in previous releases, now that Logan is closed later than budgeted, we should be in a position to see NII growth, which should result in a dividend increase starting in Q3. If the dividend is not able to be increased or stock continues to trade at a significant discount to our peer group, we recognize the status quo isn’t acceptable to our shareholders. And to be clear, it’s not acceptable to the management team. While our track record on executing this plan has been far from perfect, our track record of supporting the shareholders and doing what’s right for the shareholders has been impeccable. But basically, I really question whether we’re at a size which makes sense for us to be publicly owned. I’ll get them out on the table and I’d like to get your response, some of which you’ve already anticipated. With $400,000, it’s about $0.01 and a fraction. Our cost of capital is too high, and Wall Street has created a lot of companies in the BDC, MLP, REIT space that only worked if they were able to sell stock at a premium to NAV. But we’re on a vicious cycle, the wrong way. You can’t sell stock, and you know the story. I’m going to take them probably in a random order, if that’s okay. Just as a rule of thumb, as you look at the market today, I think being a public company at less than $1 billion of equity is probably punitive. We’re too small, and that puts us at somewhat of a disadvantage. As it relates to waivers, we’ve said publicly that we’ll support the dividend through Q2 on that $0.10. We expect to have a waiver of some sort in Q2 to maintain the $0.10, primarily related to the expenses associated with putting these financing packages in place. As it relates to the dividend, I think we said in the press release that based on our expectations of the new financing that you could see the dividend go up by anywhere from some 20% from where we are, so call it, $0.11 to $0.12. Excess capital, we have more capital now that we’re able to -- we have more flexibility of capital that we were able to upsize the ING facility. We do have a program in place where we are buying shares, albeit at modest amounts just given the way the program works and the fact that our stock doesn’t trade that much. Your second question, which was related to a sale of the business, I’m not in a position to comment on that today. And if the play results in our stock price sitting where it is today, obviously, it didn’t work, and we’ve always come back and said that we’ll do what’s right for the shareholders. So I’m in a wait-and-see mode, but the period of time that we’re going to wait and see is probably much shorter than it was historically. I’m not happy with the results, and the environment has become more hostile. I mean, mathematically, it’s easy, we’d rather buy back stock. If you look at what we did in the portfolio, we primarily just supported our existing portfolio of companies, which is -- that’s part of doing this business. So we’re trying to find a balance between the 2, but we have been actively buying stock in the market, and we’ll continue to do so on the program that we have in place that was approved by the Board. I appreciate your answer, and I wish you well, and you’re a good guy. Chris, I wanted to follow up a little bit on Lee’s question. If I look at your slide deck, you have Slide number 11 and Slide 29 that really shows kind of the growth of your overall direct lending platform at First Eagle. And it shows that FCRD is really just a small component of the overall direct lending platform as far as the deals you participate in, and then Slide 29 shows that you all have deployed $2.4 billion of capital across the platform, and obviously, FCRD was a really small percentage of that. Obviously, FCRD , it’s not been a good run for shareholders for the last 5 or 6 years as there’s been the notable issues that you all have been trying to work through. I can’t imagine -- as you’ve been very shareholder-friendly, I can’t imagine this has really, FCRD’s, been a super profitable entity for the overall First Eagle manager given all the fee waivers and the low fees it generates. If you think about the beginning of, I guess, it was legacy THL and now First Eagle Direct Lending platform, the BDC used to be the only vehicle that we had. I mean at one point, I think it was like a $750 million vehicle. Unfortunately, due to lots of things that we’ve talked about in the past, they had some portfolio issues. That vehicle has shrunk from $750 million down to, call it, $400 million. Outside of that, we basically have grown private markets business from 0 to over $5 billion. And therefore, we’re bringing in a significant amount of capital alongside the BDC. And like I said in my prepared remarks, is if it works and the dividend is able to be increased and we narrow the gap in book, that’s great. If we don’t, listen, we’re 100% aligned with the shareholders because where you are the single -- we’re still the larger shareholder in the platform. And when it’s trading as Lee said, when they’re above book, you can have -- you can generate a lot of value. And as I said, we’ll know here in short order how the market is going to react, and we’ll plan accordingly. But I’ll tell you as we sit back and we’re underwriting new business and we’re looking at our portfolio of companies, listen, we’re credit people. So to the extent there is something that there’s a shock to the system, we’re able to navigate that. Right now, I think it’s hard to come back and put a number on it, but I would just say, to your point, yes, we’re probably more bearish than bullish as it relates to how we’re underwriting credit. Now we’re trying to reposition the portfolio, hence the reason why we’re not chasing yield right now, we’re not going deep on the capital structure. When we are deploying, we’re going to do it on a controlled basis at the top of the capital structure to minimize any loss given default if there is a step back in the economy. The other question that I had was you talked -- you have, obviously -- you’ve already started working on -- you outlined some initiatives, some of they’ve already been executed like refinancing and restructuring Logan to increase the ROE for that entity. And obviously, I know there’s a lot of uncertainties out there. I mean we’ve got some differentiated strategies with like ABL lending, where I think you can pick up some incremental yield. But being in a position now with a much more diversified portfolio to lower the liability side is what’s driving what we believe to be, going forward, a more stable ROE. If you look at the balance sheet of FCRD on a stand-alone basis, that should be in the, call it, the 8% to 8.5% range in this market. When you add in Logan, because we’re using more synthetic leverage there, we’ve already quoted that, that’s around a 14% ROE. So if you blend those out, you’ve got 15% of the portfolio out of 14%, you get the balance at an 8% or 9%. And I’m not going to do that math in my head because I’ll get it wrong, but that’s basically where things stand. Lowering that cost of debt was mission-critical because we never want to be in a position, even though our cost of debt was higher than it should have been, where we’re taking excessive risk in chasing yield. Now we’ve got the balance sheet ripe, now we can lower our cost of debt to drive a much more stable ROE on a combined basis. And then as far as the ABL lending, I know that’s kind of a newer initiative. If you look at ABL across the entire platform, it’s, call it, a 10% to 15% allocation. There could be SMAs or asset-specific funds where that’s 100% allocation to ABL for institutions that want direct access, but think of it as about 10% to 15% of the book across the entire $5 billion. Some rough approximations, but if you were able to raise your dividend by $0.02, there would be a $0.48 annual dividend. And I would just say that very strongly, listen, everything you’re saying, you seem to be very objective, but I think the conclusion is obvious. And that’s the way you want to run the company, and I appreciate that given the risks out there. And ladies and gentlemen, this concludes today’s conference call."
}