{
    "symbol": "FCRD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 15:00:07",
    "content": "  Operator: Good morning, and welcome to First Eagle Alternative Capital BDC, Incorporated Earnings Conference Call for its second fiscal quarter ended June 30, 2022. It is my pleasure to turn the call over to Sabrina Rusnak-Carlson of First Eagle Alternative Capital BDC, Incorporated, Ms. Rusnak-Carlson, you may begin. On today's call, I'll review our second quarter results and share some portfolio highlights. We ended the quarter with a net asset value of $5.30 per share, down 13.4% on a quarter-over-quarter basis. This drop in NAV can be broken down as follows: $0.36 of the decline is related to the Logan JV, which generally follows the drop off in the Credit Suisse Leveraged Loan Index during Q2. The balance of the NAV decline was primarily related to 3 specific investment's: Matilda Jane, $0.21; Loadmaster, $0.14 and OEM $0.06. As part of this transaction, there was a $12.8 million return of capital to the BDC in July. As previously mentioned, the Logan JV contributed $0.36 or approximately 5.9% to the decline in NAV from Q1. From March 31 to June 30, the average price on the Logan JV portfolio declined from $95.7 million to $92.8 million. At the end of the second quarter, 2.3% of the total portfolio based on fair market value was on non-accrual. FCRD participated in $25.9 million, of which $4.6 million was in a new portfolio investment with the remainder invested and follow-on investments, including revolvers and delayed draw fundings. The growth of the platform allows the BDC to hold a more diversified portfolio with this number of positions up from 45 in Q1 of 2018 to 71 this quarter, which also allows First Eagle to provide more capital to middle market companies. As Chris mentioned, Q2 was relatively muted quarter for new activity with 1 new addition to the portfolio at $4.6 million. However, we did have several follow-on investments in funding of commitments totaling an additional $21.3 million in capital deployed. Additionally, we had 7 notable realizations during the quarter, receiving total proceeds of $33.3 million. As of June 30, our portfolio was valued at $366.8 million, down from $400.7 million at the end of Q1. The remaining 3.1% of the BDC's portfolio was held in second lien debt and other non-income producing and equity holdings, including our restructured equity-like second-lien investment in OEM. The weighted average yield on the debt and income-producing portfolio, based on costs and including Logan was 6.8% as of the end of Q2, which is up slightly from 6.5% at the end of Q1. During Q2, we recognized $6.9 million of investment income primarily from interest and dividend income. Interest income increased approximately $866,000 from Q1 to $6.3 million for Q2. As expected, the dividend income from Logan JV decreased significantly from Q1 to $320,000 in Q2. Total expenses, net of management fee waivers for the quarter were $4 million, down from $4.5 million in Q1."
}