{
    "symbol": "IMUX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 10:54:10",
    "content": " In conjunction with the Eco Congress as you may recall, we also announced the blinded baseline characteristics of our Phase III CALDOSE-1 trial of vidofludimus calcium  Patients in the trial had active to moderate severe disease. Moving on to notably one of our most important upcoming value inflection points will be the highly anticipated readout of our Phase II CALDOSE-1 trial of vidofludimus calcium in patients with moderate-to-severe UC, which we previously reported having completed enrollment during the fourth quarter of last year. With regards to our ongoing Phase I clinical trial of IMU-856, with the single-ascending dose partly -- part already completed and multiple-ascending dose currently ongoing, we eagerly anticipate reporting the unblinded safety data from these healthy volunteer parts in the third quarter of 2022. First of all, you may remember that there was a small interim analysis done after 25% of the patients have been -- have completed the 10-week induction phase, and the data review committee at that time had suggested to continue with all active doses because none of the dose was expected to be ineffective compared with placebo. And coming to the study population, I think if you look on other trials, you should not spread too wide because a reasonably good activity of psoriasis is required to see a -- a real data between placebo and active. We -- I looked around or with the team looked around on other trials and we found on the baseline characteristics, maybe the best competitive would be the ozanimod Phase 2 trial, which was -- has seen level of precluded patients also severe achievers comparable. But, as you know, it's a good opportunity to remind everybody that the drug has shown -- its rate has shown wonderful, good activity in the very big Phase 2 trial in relapsing MS and therefore, we think or we continue believing that the drug is likely successful in the Phase 3 RMS phase trial as the insured trials. But we were also quite throughout about the potential in progressive MS and that's usually not covered too much in the press and everywhere but we think that mode of action and the features we have seen and recently had also some data in the context of our 10-K findings from our second quarter to minimum dose cohort that we see a lot of  is really neuro protective and may have a very strong benefit also for progressive patients with PMS there and, so that's also an important piece we're working on."
}