{
    "symbol": "SPNT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 12:12:37",
    "content": " Driven by leisure travel returned to pre-pandemic levels, we're seeing strong momentum in IMG's results with $1.7 million of income in the first quarter versus breaking even in the same quarter last year. Following the substantial and ongoing re-underwriting and reallocation in our reinsurance segment, premiums written for the quarter was $524 million with a segment income of $3 million and a 99% combined ratio. David will address our specific Ukraine-Russian catastrophe losses but this includes our current modest underwriting loss estimate for Russia and Ukraine of $13 million and combined with catastrophe losses net of reinsurance and restatement premiums of $7 million, which falls within our budgeted cat loads for the quarter. More generally, we've made major changes in our reinsurance segment in the last 15 months, having exited or non-renewed approximately $700 million of business reflecting major re-underwriting across our portfolio. We achieved an underwriting profit of $34 million, with a combined ratio of 93.7%, reflecting a $10 million or 160 basis point improvement quarter-over-quarter, marking the fourth quarter with an underwriting profit out of the five quarters, since we launched SiriusPoint. Core segment income was $27 million for the first quarter of 2022, including underwriting income of $13 million, and a combined ratio of 97.5%, which compares to a $15 million and a combined ratio of 93.7% in the first quarter of 2021, which only included partial results from Sirius Group as the acquisition closed at the end of February last year. Core underwriting income was driven by benign net cat activity and favorable prior year loss development, partially offset by a $13 million loss provision for the events in Russia and Ukraine. Insurance and services produced segment income of $24 million, consisting of $14 million net services income and underwriting profit of $10 million and a combined ratio of 95.5%. Corporate expenses, excluding service expenses, were $34 million in the quarter, driven by elevated provisions for expected credit losses of $13 million, largely due to reinsurance exposures to Russia and Florida. Corporate generated an underwriting loss of $6 million for the three months ended March 31, 2022, due to a risk-attaching political islands contract with exposure to Ukraine, which was non-renewed last year as part of our portfolio re-underwriting, and where we have a booked loss, even though we have not yet received a formal last notification. The net investment loss for the first quarter was $205 million, driven by losses from our related party investments of $131 million, our return in 1Q 2022 from the Third Point Enhanced fund, the bulk of our related party investments was negative 15.3%."
}