{
    "symbol": "TU",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 18:06:16",
    "content": " Throughout 2022, TELUS achieved strong operational and financial results across our business, leading our North American peer group with respect to 2022 operating revenue, adjusted EBITDA and free cash flow growth, along with most operating metrics. Our robust performance in the fourth quarter and for the full year reflects the chemistry of our globally leading broadband networks and customers first culture, driving our hallmark combination of profitable customer growth alongside strong financial results. With more than 20 years of global experience leading organizations with a focus on innovative healthcare technology and services, Sid is exceedingly well-positioned to lead the ongoing transformation and scaled growth of TELUS Health. Despite a challenging macroeconomic environment, this morning TELUS International announced strong 2022 results, including double-digit revenue growth, leading profitability and robust cash flow for the full year. In closing the TELUS teamâ\u0080\u0099s ability to consistently drive profitable growth over the longer term on the back of a differentiated asset base, best-in-class customer experiences, world leading networks and our unique growth businesses provide us with our confidence in the robust outlook for our business and our ability to deliver on the ambitious annual targets that we announced today. Our targets will be supported by the healthy guidance for 2023 announced this morning by TELUS International, once again, targeting double-digit revenue and EBITDA growth alongside leading margins as they continue to drive solid and profitable operating momentum. And what you know, what I think is notable, especially as we look across other global B2B communication service providers is that TELUSâ\u0080\u0099s B2B team delivered strong growth not only on an EBITDA basis, but also revenue, margin and cash. Next question please, Carl. Next question please, Carl."
}