{
    "symbol": "MASS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 14:18:03",
    "content": " The key takeaway here is that we have a robust roadmap and strategy of process analytical technologies beyond any one product we are creating a full portfolio of complementary devices, ZipChip, REBEL, MAVEN, and another new product weâ\u0080\u0099ll announce later this year, which will also be exciting and very differentiated. Product and service revenue from desktops was $14.9 million for the full year 2022, growing 25% year-over-year and in line with our expectations of 2 times our overall growth rate. Looking ahead in 2023, we expect revenue to be in the range of $48 million to $52 million, representing growth of 2% to 11% over a full year 2022, 7% growth at the midpoint. But over the quarter, we placed 13 desktops over the quarter, and that included about $0.5 million of new products, MAVEN and related, so 80 devices over the year not including MAVEN in that number. No, thatâ\u0080\u0099s super helpful. And the primary drivers were our service revenue for both handhelds and desktop contributed about 45% of that 100% pie and the handheld Aero accessories and consumables contributed about 40% and the rest what â\u0080\u0093 the remainder was from growth on our desktop consumables and overall weâ\u0080\u0099re encouraged by the building desktop recurring revenue in 2022, which grew quarter-over-quarter each quarter in 2022 in REBEL kits a big piece of that story even with that approximately half utilization today. No, thatâ\u0080\u0099s super helpful. So contemplated within the guidance range includes moderate unit growth across all our devices with stronger growth in the back half of the year, especially with our desktops, weâ\u0080\u0099re focusing on that broadening of the portfolio products as a whole with one sales force driving our desktops, one touch to the customer and weâ\u0080\u0099re thinking through what the right metrics are to focus on as we evolve here in 2023. But we are still thinking this through and we do see a path just to stress, to growth on a unit basis, even with the army devices in 2022, we see growth on unit basis, but you took our products both handhelds and desktops, and weâ\u0080\u0099ll see how the year plays out. So we see MAVEN as a 2023 growth driver, as we will have a full year sales opportunity, but it was based upon the technology through our Trace acquisition and for the full year, pro forma basis, Trace was about $1.8 million, $1.9 million, and we see growth on that overall business as we go through 2023. And I think again, where weâ\u0080\u0099re looking at it is just that complete set of desktop devices which we did place 13 in the quarter and including that $0.5 million of the new MAVENs and 80 devices over the year."
}