{
    "symbol": "ITI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-01 20:29:03",
    "content": " The company reported record fiscal 2022 fourth quarter total revenue of $34.2 million and record fiscal 2022 full year total revenue of $133.6 million, representing a respective 8% and 14% year-over-year increase. In the fourth quarter we reported record total net bookings of $41.9 million, representing a 27% increase compared to the same prior year period. Of our $34.2 million in fourth quarter total revenue, 49.9% was recorded as product revenue and 50.1% was recorded as service revenue. Our fiscal 2022 fourth quarter product revenue was $17.1 million versus $15.9 million in the same prior year period, representing an 8% increase year-over-year. While this is respectable organic growth, the result was below our expectations due to supply chain constraints that prevented us from shipping $2.2 million in fourth quarter Vantage sensor backlog. If not for the fiscal fourth quarter supply chain constraints, our fourth quarter product revenue would have been $19.3 million or 21% higher in the same prior year period and our full year product revenue would have been $70.9 million or 13% higher than the same prior year period. Additionally, please note that our fourth quarter product revenue growth is due to an increase in unit sales in the period since the 10% price increase we implemented for our Vantage sensors on January 1, 2022, has not started to bleed into our revenue results. Furthermore, our Vantage Next sensor was selected as the detection standard for many of the nation's largest signal modernization initiatives resulting in the following notable fourth quarter purchase orders, a $9.4 million purchase order for Miami Dade Florida for the first phase of a multi-phase project to modernize the county’s signalized intersections, a $3 million order from Baton Rouge, Louisiana to deploy our Vantage Next sensor across the city’s signalized intersections, a $2 million order from Concord, California to modernize the city’s signalized intersections with our Vantage Next sensor with hybrid video and RADAR detection, a $1.2 million order from Fremont, California to deploy our Vantage Next sensors, and a $500,000 order from the Colorado Department of Transportation to deploy our Vantage Next sensor with hybrid video and RADAR detection. On a full year basis, fiscal 2022 service revenue was $64.8 million versus $54.2 million in the same prior year period, representing a 20% year-over-year increase. Turning to our revenue mix, the product revenues increased 8% to $17.1 million compared to $15.9 million in the same quarter last year, taking into account the $2.2 million of revenue that was not recognized because of component shortages, the revenue growth would have been 21% quarter-over-quarter. Our service gross revenues grew 8% to $17.1 million compared to $15.8 million in the prior year quarter, as Joe mentioned in the fourth quarter, 25% of the total revenue was annual recurring revenue, which was consistent with prior quarters. Adjusted EBITDA for the fourth quarter was a loss of $1.1 million or a negative 3.1% of revenue, which compares to $1.8 million or 5.5% of revenue in the third quarter of last year. As a result of this reorganization, Iteris will take a pre-tax restructuring charge of $0.7 million in our fiscal 2023 first quarter and generate annualized cost savings of approximately $1.2 million, which in addition to the aforementioned benefits will help offset materials cost variances until we begin to realize the full benefit of our supply chain mitigation plan. Based on our current record backlog and anticipated bookings growth, we forecast fiscal 2023 total revenue of $147 million to $155 million, which would represent organic growth of 13% at the midpoint of the guidance range."
}