{
    "symbol": "ITI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-03 23:36:06",
    "content": " 02:25 The company reported fiscal 2022 third quarter total revenue of $32 million and fiscal 2022 year to date total revenue of $99.3 million, representing a respective 14% and 16% year-over-year increase. At the same time, our third quarter annual recurring revenue of $8.1 million increased 27% year-over-year, while year-to-date annual recurring revenue of $24.9 million increased 43% year-over-year. 03:16 Due to the continued favorable customer response to our ClearMobility platform, we reported record third quarter total net bookings of $40.9 million, representing a 99% increase compared to the same prior year period. 04:48 Our fiscal 2022 third quarter product revenue was $15.9 million versus $16.4 million in the same prior year period, representing a 3% decrease year-over-year. These issues presented us or prevented us from shipping approximately $1.9 million in Vantage sensor product orders, limiting the revenue growth for our own products to 10% as just noted and precluding us from offsetting the third-party product revenue variance. Our fiscal 2022 third-quarter services revenue was $16.1 million versus $11.8 million in the same prior year period, representing a 37% year-over-year increase. On a year-to-date basis fiscal 2022 services revenue was $47.7 million versus $38.4 million in the same prior year period, representing a 24% year-over-year increase. 08:22 As mentioned earlier, our third quarter annual recurring revenue of $8.1 million increased 27% year-over-year and our year-to-date annual recurring revenue of $24.9 million increased 43% year-over-year. Total revenue for the fiscal 2020 third quarter increased 14% to $32 million, compared to $28.2 million in the same quarter a year ago. Our service gross margins grew 37% -- excuse me, service revenues grew 37% to $16.1 million compared to $11.8 million in the prior year quarter. 14:12 We reported a GAAP operating loss in the third quarter of $2 million compared with the GAAP operating loss of $309,000 in the same quarter a year ago, this was driven by the supply chain issues as previously mentioned. 14:41 Adjusted EBITDA for the third quarter was $100,000 or 0.3% of revenue, which compares to approximately $1.5 million or 5.2% of revenue in the third quarter of last year. This particular quarter, as we mentioned, we were unable to ship about $1.9 million in our own product and we are anticipating that -- even though we are forecasting double-digit organic growth in the fourth quarter, we believe we could have done better than that, if not, for the supply chain and third-party supplier constraints that we're facing. I mean if you just look at the year-to-date -- the third quarter bookings and the year-to-date backlog, I think it's like the backlog growth, which was 20% on a year-to-date basis, would indicate that there is certainly more than low double digit demand for our products and services."
}