{
    "symbol": "ITI",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-08 09:55:08",
    "content": " The company reported record total revenue of $34.1 million in the first quarter of our new fiscal year, representing a 22% year-over-year increase. Our fiscal 2022 first quarter product revenue was $18 million versus $14.4 million in the same prior year period, representing a 25% year-over-year increase. Our fiscal 2022 first quarter services revenue was $16.1 million versus $13.6 million in the same prior year period, representing an 18% year-over-year increase. First, we're focused on increasing the adoption rate of our family of SaaS solutions; second, bundling our SaaS solutions into our multi-year consulting projects; third, developing and commercializing a portfolio of cloud-enabled managed services that leverage our SaaS solutions; and fourth, evolving our ClearMobility platform to support new innovative platform as a service and data platform as a service offers that address emerging needs of both public agencies and commercial entities, whose business models depend on mobility infrastructure. In the first quarter, we recorded $16.2 million in net services bookings, of which 60% will be recognized as annual recurring revenue in future periods. Some of the notable first services – I'm sorry, some of the notable first quarter services bookings include a seven-figure data platform as a service contract extension to provide traffic flow and incident data to a North American media company, a $2.4 million extension for a managed services contract with the San Francisco Bay Area Metropolitan Transportation Commission. Total revenue for the fiscal 2022 first quarter, increased 22% to $34.1 million compared to $28 million in the same quarter a year ago. The product revenues grew 25% to $18 million, compared to $14.4 million in the same quarter last year. Adjusted EBITDA for the first quarter was $2.5 million or 7.4% of revenue, which compares to $2.3 million or 8.2% of revenue in the first quarter of last year. With first quarter record backlog of $79.9 million, this positions us well for the remainder of fiscal year 2022, which is why we raised the bottom end of our revenue guidance from $132 million to $134 million."
}