{
    "symbol": "ADES",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 15:10:02",
    "content": " These risks and uncertainties include, but are not limited to, those factors identified on Slide 2 of today's slide presentation, in our Form 10-Q for the quarter ended March 31, 2022, and other filings with the Securities and Exchange Commission. Before we discuss our results, I would like to take a moment to remind everyone listening that as of December 31, 2021, all of the remaining refined coal facilities reached the end of their respective tax credit generation periods. Turning to our first quarter highlights on Slide 3, demand for our activated carbon technologies remained strong throughout the first quarter supported by both macroeconomic and industry factors. Sales of consumable products were $26.4 million, which reflects year-over-year growth of 42%. Our gross margin was 18.5% compared to 24.6% in the prior year, as the need to supplement production with third-party sources of activated carbon to meet customer demand increases our average product cost, as the average cost of third-party activated carbon purchases is higher than the cost of producing comparable products in-house. We recorded a net loss for the period of $3 million, compared to net income of $13.7 million in the prior year. Tinuum’s first quarter 2022 distributions to ADES totaled 2.5 million, which was in line with our expectations. Importantly, production volume and our Red River Plant exceeded our internal expectations for the quarter, allowing us to increase inventory levels within the quarter as we prepare for the seasonally strong upcoming summer months. As a result, we have seen our average selling price trend higher over the past few quarters, which is partially offsetting cost pressures related to areas such as inventory and logistics. Regarding our capital allocation, our priority remains the organic investment in our manufacturing capabilities to ensure production, improving the operating profile of our manufacturing assets and fulfilling customer obligations. We ended the first quarter with a cash balance including restricted cash of $89.8 million and our only remaining debt outstanding or finance lease liabilities, totaling $3.9 million. We expect our top line to remain strong, as demand for our activated carbon technologies has been robust and we continue to improve our overall contractual terms on contracts. As stated previously, our margins are expected to remain under pressure due to tight inventory conditions and the anticipated full year impact of incremental carbon purchases to supplement inventory, as well as broader supply chain challenges that are applying upward pressure on costs related to transportation and freight, as well as other necessary product inputs. As I mentioned, we continue to seek to offset these pressures through overall improvements in commercial terms, product mix optimization, and top grading our overall customer mix. Lastly, we expect to collect net after tax cash flows from Tinuum of between $0.5 million to $1 million in the second quarter of 2022. A number of these utility customers have already begun to purchase our front-end technology or activated carbon products, which will help to drive incremental revenue and margin on a go forward basis. With that, I will turn the call over to Morgan to review our first quarter financial performance in greater detail. First quarter revenues and cost of revenues were $26.4 million and $21.5 million, respectively, compared to 22.6 million and 14 million for the first quarter of 2021. The increase in revenue was the result of a $7.9 million increase in the sales of consumable products, which more than offset the revenue benefit of $4.1 million in prior year royalty earnings from the former refined coal segment. First quarter other operating expenses were 8.2 million, compared to 8.3 million for the first quarter of 2021. The decline was primarily the result of lower depreciation and amortization expense, which was partially offset by higher payroll and benefits as well as higher legal and professional fees generally related to the strategic process. The decrease in earnings from equity method investments is the result of all remaining invested refined coal facilities reaching the end of their tax generation period as of December 31, 2021. First quarter interest expense was $0.1 million, compared to $0.8 million in the first quarter of 2021. First quarter consolidated adjusted EBITDA was 0.9 million, compared to 26.1 million in the prior year. The decrease in adjusted EBITDA was primarily the result of a decline in earnings from the former RC segment related to our Tinuum investments, which contributed 27.2 million of adjusted EBITDA during the first quarter of 2021. As of March 31, 2022, our cash balances including restricted cash totaled $89.8 million, an increase of $1 million compared to the prior year. The restricted cash stems from our surety bond and the requirement to post collateral of $10 million for the obligations due under the reclamation contract related to the mine in Marshall, Texas. The company's only debt outstanding are finance lease obligations, which totaled $3.9 million as of the end of the quarter. Our total obligation related to reclamation activities for the Marshall and Five Forks mines, currently stands at $8.3 million. Reclamation activity at the Marshall Mine remains ahead of schedule, and as a result, we have attained cumulative savings to date of approximately $2.7 million. Additionally, due to Norit’s change of control occurring in the first quarter, we collected $10.6 million of reimbursements related to Norit share of the Marshall Mine reclamation costs, shared capital payments and other amounts owed from Norit to a third-party. Today we possess a much more diversified commercial in market mix after considerable time and effort, growing and expanding our commercial and technical relationships and conducting product tests with new potential customers in the industrial and water markets. We also continue to see strong customer interests in other growing market opportunities, utilizing both existing and developing product technologies and capabilities that may provide earnings opportunities in areas where the legacy carbon solutions business had not previously competed. We are an expect to continue to be a leading provider of choice for these activated carbon technologies, and believe our strong financial position and superior assets have as well positioned going forward. For the full year 2022, we expect our consumables revenue to be comparable with 2021 with the potential for incremental growth, as high demand for our power generation customers continues and as we continue to see an overall improvement in customer and product mix. This will involve ongoing improvement to pricing as well as expanding volume commitments and protections which will allow us to offset headwinds, we may face relating to building back inventory levels and overall supply chain challenges. Aside from our core focus within the activated carbon markets we have historically served, we will also work to accelerate the progress we made in 2021, and look to further diversify product and customer mix through ongoing investment and new product development. Similar to past quarters, we included an invitation to submit questions ahead of time at the bottom of the conference call announcement press release as well as yesterday afternoon’s earnings press release. We will continue to evaluate market conditions, normalized inventory levels and internal production capabilities as we plan for 2023, which will help us estimate the required levels of third-party sourcing that will likely be needed going forward. As it relates to growing capacity, we continue to work to improve and optimize the Red River facility production capabilities, and have seen volume improvements during Q1 of 2022 that have allowed us to increase our inventory levels while meeting current demand. Each year the prices for the products sold to Norit, formerly known as Cabot are reevaluated and adjusted for the following year, based on anticipated volumes, the impacts of such volumes on product mix manufacturing and related production costs. Regarding the second part of the question, aside from the applicable change control payments that have occurred during the first quarter of 2022, which were contemplated when the master supply agreement was originally executed, we continue to operate under the terms of the master supply agreement as written as we were required to fulfill our obligations to Norit."
}