{
    "symbol": "LEA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 13:14:05",
    "content": " For the first quarter, sales outperformed global industry production by four percentage points, driven primarily by the impact of new business in both segments, with the seating growing 5 points above market and E-Systems growing 1 above market. The decline in margins reflected primarily lower volumes on Lear platforms and higher commodity costs, partially offset by positive net operating performance in margin accretive backlog. The decline in margins reflected primarily lower volumes on Lear platforms and higher commodity costs, partially offset by positive net operating performance in margin accretive backlog. And so the first half of the year, we're expecting to be a little bit higher than it was at the second half of last year and the second half of this year, given what's happening recently with the war in Ukraine, it's going to be a similar impact, maybe even slightly worse than in the second half of the year in Europe. But let me take a step back to and I think you recall very clearly when we talked about what we're going to do as far as the E-Systems business was obviously set the organization of define it very clearly into product groups that we're focused on return on invested capital, and obviously that's all behind us. So all those things taken together give us a real high degree of confidence in that '24 outlook in addition to Ray 's comments about the strong growth that we're seeing particularly in electrification, and the profitability that new business it's rolling on. And I think it's very important, because the reason why we're vertically integrated to the level that we are and being able to manufacture our own components to create a value proposition that is, like I talked about with thermal management, it's a very important driver that we've been able to differentiate ourselves even early on right now, even in the most recent acquisition of Kongsberg, that when you walk in to a customer and you can tell them and talk to them about a value proposition that incorporates a number of different components. Jason in the example on the most recent one that was really a relationship that we had an outstanding reputation for delivering quality and built credibility around what we could do for them in longer term, but with other customers, this vertical integration does differentiate us and even into the extent like I said in my presentation, their willingness to open up the directed door is open and we're seeing, we're putting it in our contracts in some extent, more  the business our ability to source our own components because you think about Seating. And then in Seating, which typically converts at 15% to 20%, we're converting above 20% primarily because our China business does tend to run a little bit higher margin than the average in Seating that's the factor in just the mix of programs that in the level of vertical integration and the programs that are down in North America and Europe is also a factor that's driving that."
}