{
    "symbol": "LEA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 16:33:04",
    "content": " In 2022, we had another great year of new business wins in E-Systems that will continue to drive growth over market of six percentage points, including about $500 million of business for electrification projects including high voltage wiring and connection systems and battery disconnect units. Our sales increased 10% year-over-year to $5.4 billion, excluding the impact of foreign exchange, commodities and acquisitions, sales were up by 13%, reflecting the addition of new business in both of our business segments and increased production on key Lear platforms. Strong net operating performance in the quarter, which included a $10 million benefit from the commercial settlement of a patent matter was offset by higher spending on engineering and launch costs to support our strong 2023 new business backlog and recent conquest awards. Sales in the fourth quarter were $1.3 billion, an increase of 8% from 2021, excluding the impact of foreign exchange and commodities, sales were up 12%, driven primarily by higher volumes on Lear platforms and our strong backlog. Please go ahead with your question. In E-Systems, second half margins were 4.4%, so we do have a modest increase in operating margins at the midpoint of the guidance to 4.5 for 2023 and that's really driven by volume mix and backlog are about 20 basis points, performance is about 10 basis points and then that's partially offset by higher engineering and launch costs, sequentially, again from the second half of 2022 to the full year of 2023 about 20 basis points. Please go ahead with your question. The second issue is with GMs ramp up of the battery electric truck Factory Zero and the Equinox EV in Mexico, the assumptions that we had used last year compared to now results in about $150 million reduction to the Seating backlog in 2023, but no impact to the three year backlog. Now if you look out over a three year time period, the backlog in E-Systems is $25 million higher than it was last year and it's the second largest three year backlog that we've ever had in E-Systems and if you look at Seatings backlog for three years at $1.8 billion, its higher than the 10 year average that we've had in the seat business. Please go ahead with your question. Please go ahead with your question. As we look out to 2024, you look again at our backlog, I point out that we would expect growth over market could be as much as seven points If you just look at the value of the backlog at $1.5 billion well with Seating that's six points above market and E-Systems at 10 points of growth above market just driven by the backlog. As we fast-forward to 2024 and 2025, what I would encourage you to do and sort of look at that in conjunction with our ability to deliver margin improvement through net performance, our cost reduction programs, our commercial negotiations more broadly, and so, I would expect to see margin growth in both segments of around 50 basis points each year in 2024 and 2025 as a result of that. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question."
}