{
    "symbol": "LEA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 14:17:05",
    "content": " Sales for the second quarter were $3.9 billion, an increase of $266 million or 7% from 2021 driven primarily by our strong backlog and an increase in volumes on their platforms. So I'm not expecting all of that to come back, but I still think it's reasonable to assume that half of the $340 million comes back over the next two years. And then I'm looking at the first half to second half bridge on Slide 12 and was curious about how you're thinking about net performance from the first half to the second half because it looks like the incrementals are sort of in the high-teen similar to what we would typically see in seating, but I didn't see anything explicitly listed here for performance. So that's part of the volume differential, also the backlog is more back-end loaded in these systems than in seating, it was a little bit more ratable across the quarters in seating and so that's embedded in that 150 basis points, as well as the roll-on of the backlog in e-systems, commodities will be slightly positive. In terms of order of magnitude it's a bit difficult to call right now, but we would expect, 100 basis points or more of margin improvement in E-Systems sequentially and a little less than that, probably half that in Seating, from Q2 to Q3 as we sit here today. But as we look at volumes recovering, commodity cost moderating stability in the production schedule, plus the things that we're doing to control our cost and drive growth with Connection Systems, we do see margins recovering over the next two years in these systems, sort of in that 7% to 8% range with some reasonable level of volume at that point in time. So, certainly we see some of that continuing in the second half of this year and even into 2023, but if you look out to 2024, I would expect a $90 million improvement in the business as a result of that overhang going away. And if I look at 2023 and 2024, we're expecting that business to grow by 50% over the next two years from roughly $500 million this year to $750 million in 2024 on its way to our $1 billion target that we talked about, we had talked about $900 million to a $1 billion in 2025."
}