{
    "symbol": "MRAI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 10:34:09",
    "content": " I would now like to hand the conference over to Marpai's CFO, Yoram Bibring. Please go ahead I would now like to hand a conference over to Simon Li, Vice President with Marpai. With me on the call today are Marpai's Chief Executive Officer, Edmundo Gonzalez; and Chief Financial Officer, Yoram Bibring. Before turning the call over to Edmundo, please note that we'll be discussing certain non-GAAP financial measures that we believe are important when evaluating Marpai's performance. Such forward looking statements are subject to risks, uncertainties and other factors that could cause the actual results for Marpai to differ materially from those expressed or implied on this call. For additional information, please refer to our cautionary statements in our press release, and our filings with the SEC, all of which are available at marpaihealth.com. And with that, I will turn the call over to Marpai's CEO, Edmundo Gonzalez. Now, as you probably know, on August 4th we announced the acquisition of Maestro Health. Yoram will describe the terms of the deal later on, but let me tell you a little bit about Marpai and why I believe this is a transformational acquisition for Marpai. First, the acquisition approximately doubles our revenue. Second, we are getting value added products that we didn't have. Four, the seller is also leaving almost $60 million of cash on the Maestro balance sheet and this will fund our integration plan. Five, we believe that this acquisition with planned synergies realized propels us closer to our EBITDA breakeven level and beyond. In many ways, Maestro is very similar to Marpai. Maestro services approximately 80 employers who self-insure their 25,000 employees, while Marpai currently services also around 80 employers who self-insure approximately 21,000 employees. The reason Maestro's revenues are lower than ours is that they don't resell low margin, third-party services to their customers. Instead, they let their customer's contract directly with the third-party providers as needed. Also, they have two important value added services, which they provide with their own resources. Now, until now Marpai has been providing these two services to our customers by reselling third-party services. When you resell a third-party service, you keep a fraction of the amount paid by the customer and pass along most of the revenues to that third-party service provider. By providing these services using its own resources, which include its people and proprietary technology Maestro is keeping all of the revenues from these two services. As you know, Marpai predicts costly events. This could mean less ER visits, proactive matching of care for members and of course we know healthier members means lower costs for our clients, the self-insured employers. A claim for $100,000 for example that is settled for $20,000 generates $80,000 of savings for the client. Again, moving a monthly drug bill of say $20,000 a month to $5,000 a month generates real hard savings for the client. On the revenue side, we have Maestro's two homegrown products that we hope to sell to our customer base and our own AI driven value added services that we hope to sell into the Maestro customers. On the expense side, we're expecting to become one company over the next six to 12 months, which should lead to substantial savings. While the contract closing calls for â\u0080\u0093 closing within 60 days, we expect the actual closing to occur soon after Labor Day. The management teams of both companies are now working hard on an integration plan, and my goal is to start executing on the integration plan, right after closing. As we stated in the release, we are not providing guidance for the third quarters as it is difficult for us to estimate how much of Maestro's revenues will be included in the third quarter figures. Moving on to the second quarter, our revenues came in at $5.6 million, slightly higher than our guidance. We are continuing to work hard to ensure that we have an excellent January 1, 2023, meaning that we will add a large number of new customers with thousands of new employee lives. The reason for the termination is that in our opinion, the customers are failing to fulfill terms of their contract with us. This has nothing to do with Marpai; it's purely an internal issue with these customers, which we were obligated to address through the termination of these contracts. Now, although I always hate to lose a customer in this case, this is the right thing to do. We are pushing hard so our new lives from organic growth activities, including new ads by 1/ 1/2023 will far exceed the loss of these. Now, before I hand over to Yoram to go through the deal terms and quarterly numbers, I want to thank all the people that worked extremely hard to make the Maestro acquisition a reality. Of course, the work is just starting and yet I think making the deal happen is indeed transformational. So thank you to all the employees and advisors, as well as Maestro employees, consultants and representatives of AXA, who is the seller in this deal. Number one, we're buying 100% of Maestro in the stock deal. Edmundo describes to you the business assets that Maestro has in which we find extremely appealing, and I'll recap then in a minute. Number two, Maestro will have on its balance sheet at the closing $15.79 million free cash, which is available to finance the operations of Marpai and Maestro without any restrictions or limitations. Number three, it will agreed that the working capital of Maestro at the closing will be within a certain range that it's usually has been operating with. The consideration of $22.1 million is due on April 1, 2024. If we don't have the cash on that date and assuming we have met our obligations under the contract, which we expect to do the seller will finance the deal with a 10% annual cost of cash. We're obligated to make minimum payments of $5 million on December 31, 2024; $6 million on December 31, 2025; $8 million on December 31, 2026; and $9 million on December 31, 2027. The reason that the total minimum payments are $28 million and not $22.1 million is a 10% annual interest that starts accruing on April 1, 2024. In addition, a minimum of 35% of the proceeds of any equity offering must be used to repay this debt. To the extent we make such payments, these will reduce the minimum payment obligations factoring in the 10% interest, which I just explained. In other words, if we pay earlier than the due dates, I just listed we will be saving on interest costs. So from our perspective, the bottom line is this that we are getting $15.79 million in cash,  grew 25,000 employee lives and two strategic products. I believe this is a very good strategic transaction for Marpai, and we are very happy to do it. Moving on to the quarter, our revenue from the second quarter of 2022 were approximately $5.6 million compared to approximately $6.2 million in the first quarter of 2022 and revenues of $5.9 million for the fourth quarter of 2021. As you recall, our Q2 guidance was $5.2 million to $5.5 million. As you know, TPA calculate their fees mostly based on per employee per month basis, and therefore employee lives is a key revenue and growth indicator in our business. When we say employee lives, we refer to the employees of our customers who are covered under the self insurance plan that we administer. We finish the second quarter with 21,074 employee lives almost unchanged from 21,139 on March 31, 2022, and down from 25,195 at the end of 2021. As you can tell from these figures, the reason revenue declined from Q1 was that the customer â\u0080\u0093 was the customers that we actually lost in the first quarter. The lag is in part because of the contract may have ended during the quarter in order to start of the quarter and in part, because when a customer decides not to renew a contract and to change TPA or switch to self-insured, which is usually the case by the way. Cost of revenues include our cost of processing and adjudication claims, our customer service costs and the amounts charged by third-party vendors for the services that we resell to our customers. Our second quarter operating expenses not including cost of revenues, depreciation and theorization and stock based compensation increased by approximately 500,000 compared to the first quarter. Approximately $200,000 of this increase was due to decreased capitalization of software expenses. The costs that were previously capitalized were expensed while other operating expenses increased by $300,000 due to increased investments in technology, product marketing, as well as other sales and marketing expenses. Excluding stock-based compensation of $1.1 million and depreciation and modernization and asset write-off expenses of $776,000, adjusted EBITDA for the second quarter was a negative of approximately $4.7 million compared to a negative of $4 million in the first quarter. In terms of guidance, as Edmundo told you, we are not providing Q3 revenue guidance due to the Maestro acquisition, which we expect to close before the end of the third quarter. So I have a bunch, if there's other people in the queue, let me know and I'll get back or I'll just keep going. So you'll remember the business that we purchased in 2021 Continental Benefits, the TPA was an ongoing business with its own history and clients. We have obviously said about transforming that business and creating really a TPA of the future, a payer of the future. This means that when you're in the machine, right, you are receiving requests for proposals as a matter of course. It's not just a relationship based or knowing some guy or some executive, but it's in the normal course. What I mean is that the â\u0080\u0093 an RFP is brilliant, an invitation to bid, right, and at bat, if you will. I mean, at the end of the day, they are still in this industry, the gatekeepers, right, for who gets business, who doesn't. And in order to get business you have to bid on a lot of business that the â\u0080\u0093 the last point I would make to that is that the sales cycle against one-one, although it has started it's really at the beginning, right. So there's a lot more, our brand new RFPs to mind here over the next two months, let's say. Then you talked about, I think last call about how you've used technology to adjudicate claims more efficiently. Look, we have made big strides in essentially turning this service provider that pays claims into a technology company. For example, in the â\u0080\u0093 in our core cost per claim when we bought Continental Benefits, we had a cost per claim that was approximately 3 times â\u0080\u0093 2.5 to 3 three times what it is now. Because you're employing technology to do that, that's our commitment. Its process, people and obviously a lot of technology, a lot of our machine learning and prediction deal with prediction of disease states. Well, Allen, as you may know the price variation for a knee replacement for example can be 3 to 8X, not 3% to 8% but three to eight times. So what we're doing is predicting that event months and months before it happens, not when the member is already asking for pre-certification, but months before, because that gives our team time to intervene, to essentially educate that member that there are certain doctors with different quality metrics and basically help that member make the right choice for his own health. And obviously there's many interactions here, the best choice also for the company health plan. We're seeking that event way before it happens when it is actionable, meaning when we can actually do something about it. So by focusing a lot on the, pardon me, the matchmaking and the selection of members we think we can actually pinpoint and identify a whole cadre of members that are just not in scope. Now, what that means financially is obviously more utilization of these products. We did not have substantial in the second quarter, we didn't did not have substantial expenses relating to the deal. No in terms of one-time we didn't have any and we had some one-time cost, but they're not â\u0080\u0093 don't want certain vendor here and there. The main thing was that we capitalized much less software expenses this quarter than the prior quarter, about $200,000. So basically cash wise we are in the same situation â\u0080\u0093 the same expenses, except less we're capitalized. And this has to do with gap is not as a substantive thing and about $300,000 of increased expenses, and I'm talking about cash expenses. I'm not talking about stock-based compensation and not equal stock based compensation, approximately $300,000 where expenses in product marketing, technology, sales and marketing things of that nature. And some of them were one-time, but these one-time tend to repeat themselves once every three quarters, so I don't think they're worth mentioning specifically. And then the comment around half of Maestro's revenues come from these two offerings they have, and that they don't sell a third-party solutions at lower margin. So with regard to the gross margins, so the way â\u0080\u0093 the way they do their gross margin, if you look, you know our financials. If you look at our financials, the way we and we say â\u0080\u0093 and I say it every time we do the call, I explain what's included in cost of goods sold and it's basically those third-party costs, which we just â\u0080\u0093 you just mentioned. They take a lot of this IT and put it in â\u0080\u0093 into cost of goods sold and other things they do, I guess, you could call it the better job, almost like management accounting, because they're a private company after all, so they could do it a little bit differently. In other words, if we adapt what they do to the way we do today, which is most likely the case, not 100% sure yet. We still have to do some, a gap work here but assuming that's the case, then yes, the gross margin will definitely go up. Just Allen in terms of the ability here to cross sell and you're on, maybe mute while I'm sharing just there's background noise. So Allen, obviously there's a tremendous amount of opportunity to cross sell these products to our base, right. So right now I'm executing these functions, meaning we have care management, we have cost containment. The only thing is we don't do them, meaning, I have partners that actually execute this on behalf of our clients. So in the background here, what we want to do obviously is use the resources, the products that Maestro has because we would keep 100% of that revenue, 100% of that generated gross profit, right, from these activities. It's to follow up on that, is it â\u0080\u0093 is the goal to try to get the cross selling opportunity available for the January 1, 2023 renewals\n Look, it certainly is, but we have to. And again, sorry, there's a little background noise here, but we have to consider better where we are in sales cycle and when we can actually start, I mean, it's not hours officially yet, right. The exciting part here, Allan is that I believe for some segment of the market at least or for some sec section of our book, we can actually do these swaps in the background, if that makes sense, right. The only thing is, again, it's through a vendor. So the â\u0080\u0093 the cost containment, yes, there's other vendors there that we would have to clear, but certainly on the care management side, that's just a swap on our end. We're in the same business, obviously there's a lot of similarities but we can't go into the details and the numbers beyond what the information that we already provided to the public. So we will be filing financials within the 70 days or so after the closing, and we'll provide more information obviously on our next call, but at this point beyond this â\u0080\u0093 beyond giving you the employee life numbers, and we gave you the revenue numbers. Yes, that's approximately 4,000. This is, I just want to stress, this is obviously painful but it's not â\u0080\u0093 this is not a Marpai issue. Basically this group of customers it's just not meeting their, their obligations for the contract. It does have more to do with how these groups were underwritten, and so in order to protect all parties we decided to â\u0080\u0093 we decided actually to give this termination. So it's not something we take lightly, but I believe this is in the best interest of the company. My goal and hope here is obviously that this is not even a wash, but that this is not only replaced but â\u0080\u0093 replaced several times over with new lives coming in the fall, and of course in the all important one-one. Last question, just want to make sure I understand, I believe when you made the announcement of the potential acquisition of Maestro, you talked about 18 months that there was enough cash being brought in for 18 months to bring to around profitability. The new Marpai with Maestro, so that is, that is the goal in our plan of integration. You know, we'll obviously have that as the overall goal here. I agree 100% what you said Edmundo, this is a target for us which we believe we can meet, but we're not saying anything beyond that. We think this transaction is going to help us move us towards that, but we're not saying anything beyond that. We wish you a very good day and look forward to meeting again next quarter, but thank you very much for your participation."
}