{
    "symbol": "VOD",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-17 09:05:03",
    "content": " Before we take your questions, I thought I would just cover four key points related to our results. Firstly, our financial performance in the year was good and our results were in line with both the expectations for the year and the medium-term financial ambition we set out earlier in this year. We grew adjusted free cash flow to €5.4 billion and delivered a real inflection point in returns with 170 basis points increase in return on capital to 7.2%, well on the trajectory for returns to be above our weighted cost of capital. Second, this good performance is a direct result of all the execution we have been doing on our organic strategy. And alongside that long-term strategy, we have very clear operational priorities, which obviously include Germany. Third, we are not immune to the macroeconomic challenges in Europe and Africa, but we are very well structured to deal with it. And fourth, we remain fully committed to improving returns for shareholders through both a sustainable organic growth strategy, and at the same time, targeted actions to strengthen and simplify our portfolio. And it’s a tough macroeconomic environment that we face, but both the board and management feel very sure to drive forward on the plans that we have both organically and for our portfolio. And on that, let me hand over to questions. Thank you very much. Maybe if you could start off with the elephant in the room, which is the progress on in-market M&A or rather the lack of progress. I mean, the slides you do talk about German fiber and Spain options, but you seem to miss out on Spanish M&A with Orange and Masmovil turning down Iliad. I would say, first of all, and I want to be in no doubt at all that the priorities we set out in November on the portfolio are absolutely at the forefront of everything that we are focused and are executing on, both the Board and the management team. Secondly, we want to simplify our portfolio down to assets that are really leveraging our regional scale. Third, we want to make sure that we move Vantage Towers into a co-control situation. Why co-control, we want to take it off balance sheet, have the right financial and capital structure moving forward for Vantage Towers to make the most of the growth opportunities in what is still a consolidating sector and we want to be part of shaping that consolidation. Obviously, in the process, we would monetize. And that goes to the fourth point, which is we want to take proceeds from all of the actions that we do to strengthen our balance sheet going forward to ensure that we have more financial flexibility. To your point of progress in market consolidation, we highlighted the markets that we were focused on. I’d say when it comes to towers, we are very much focused on that co-control model with both industrial and financial players and there is very strong interest and engagement from many players. Clearly, if we were to ever get to the point where we were finding co-control was going to be an issue, of course, we can always monetize separately. And so therefore we can, if you like, sequence that if we want to. And then the final thing is, obviously, Egypt. I mean, clearly, these are sensitive transactions. I can’t share blow-by-blow what is happening for obvious reasons, but for sure, the Board and management are very much focused on it. Yes, hi, good morning, Nick and Margherita. I had a question on Germany, if I could please, just to better understand your turnaround plans in the context, obviously, a slightly weak quarter this period. I guess mechanically, the customer losses will impact financials in the next few quarters. Obviously, there has been CEO change in Germany. Akhil, really important question on a multipart basis. So maybe, Margherita, you can cover the second part regarding the financial outlook. First of all, I would say, before I start, that the financial performance of Germany has been good over the course of the year. I mean, very good EBITDA progress and growth, and that’s been on a multiyear basis. So, I think that there has been good progress financially. I did call out in November that, however, commercial performance was not where we wanted it to be. So first of all, during the pandemic, we really called out two things that we observed that caused us commercial issues. The first was, obviously, we had a huge volume increase in the pandemic on the network that added a challenge in terms of capacity in some of the clusters. I would say secondly, our footfall in retail, which is a really important channel for us, was obviously significantly down throughout the pandemic and has been slow to recover. Germany is running around, I’d say, 70% of pre-pandemic levels overall. And there has been more of a shift, I would say, to digital, where I think we could strengthen more going forward. And on top of those challenges, the third bit, which was in Q3 that we had the new Telecom Law and the new regulation. So, customers were no longer automatically being renewed for 12 months. We put through these changes into an IT platform with a new set of processes for customer journeys and frankly, they are cumbersome. So, if I break down what those issues were, well, first of all, we had a process during the recontracting that was an e-mail based. So, the customer had to confirm back via e-mail. And in April, we are seeing availability of those systems now greater than 99.5%, which is the targeted level, i.e., less than 2 hours of downtime for maintenance each month. On the financial side, different situation from the commercial side. As Nick has just said, commercially, we will see gradual improvement from there. And it’s result of the action as well as the mechanical effect of the pull-forward of terms generated by the new Telco Law, which will wind down in the course of the next few quarters. On the financial side, you have seen the consistency of our growth in Germany so far. And therefore, what you will see in the near term is a further slowdown of the fixed broadband revenue growth. The point that is worth making in terms of overall financial performance of Germany is that this is one of our growth drivers, but the three orders growth drivers that we have in Germany are performing very well. And then finally, if I move from service revenue to cost, you have seen us calling the achievement of the cost and CapEx synergy of the Liberty acquisition over 2 years in advance of the original targets. And Akhil, just to your final point, which was on choice of CEO. He has strong knowledge both in telco and technology, which I think is increasingly important going forward. He has that commercial agility, so bringing together sales, marketing, brand, products, propositions together for the customer in a great experience. We have also strengthened the wider team, leadership team in Germany. So, it isn’t a case of waiting for Philipp to come on board. Thank you very much. On the guidance, let me try and maybe first paint the picture of what is our – I would describe it as mid-case expectation for service revenue growth in Europe and broader EBITDA performance. I’d say, first, as Nick was mentioning, we are pleased with our consistent service revenue growth so far in FY ‘22. As we look into FY ‘23, there is a degree of macro uncertainty for the industry overall. For us, specifically, I think the factors you need to think about in terms of evolution of our service revenue growth are three. Number one, what we have just discussed with Akhil, we will see service revenue growth slowing down in Germany in the near-term as a result of the weak fixed broadband performance. We have connected over 0.5 million contract customers in consumer in the last year, lowest churn on record and also, of course, from April, we are seeing now the benefits in our revenue growth of the pricing measures around inflation. And then finally, the third point to keep in mind also supportive to growth is the impact the European recovery funds are going to have in Southern Europe. I would say, particularly in Spain, we are seeing strong success in the context of the digital toolkit investment allocation from the government. Net-net, if you take all this, at the midpoint of our guidance range, we expect Europe to continue growing in FY ‘23 and of course broadening the picture, good growth also in Africa and in the group as a whole. On the cost front, as if I move to EBITDA, you have two offsetting elements. On one hand, our, I would argue, strong efficiency delivery machine is well set to exceed another €300 million of net OpEx reduction in Europe with our own initiatives. However, the net is not met anymore, because we have exceptional inflation coming the other way, particularly on energy and wage inflation that will compensate for that. But we are resilient, which is why in all scenarios in our guidance, we’re guiding for growth on EBITDA 2% at the midpoint of the range and another year of return on capital acceleration, which is clearly very important. I said the pricing will be supportive in the UK, but let me say that we have pricing initiatives going on across the board in Europe. So UK and Ireland have already gone live in April, and we will see the orders following in the rest of the year. And in the markets without CPI Plus, we are working on the base in different ways. As we speak, we have done a radical simplification of our back book portfolio. And we are in the progress of migrating our customers to the plans, which are more suitable for them, which will be both increasing transparency and be ARPU accretive for us in the end. So a range of options and really critical moment, I think, in terms of delivering this through for us. Just when you mentioned at the midpoint, you expect European growth. If that’s what you’re looking for, yes. I think what is going to have an impact around this midpoint, if I think about the range overall, is going to be a combination of macro. If you want to build a downside case, you think inflation affecting consumption, can’t rule out further lockdowns for pandemic reasons. At the – on the positive end, I would like to consider pricing. I think the governments are seeing the success, and they could allocate even more funding than they have just done to SME digitization, which would be positive for us. Good morning, Nick, Margherita, if possible, could I come back to Germany again. I think in November, you talked about two-thirds of your homes passed being in housing associations. I think at that stage, you indicated about third might be tested. So it just seems to get a kind of update on the scope potentially that, that JV might include. And I mean I think if this is smaller in scope now, you’re giving a bigger vote of confidence, i.e., to DOCSIS 4 going forward. So as we’ve said for the last two earnings releases, we’ve been engaged with the housing associations really around the conversation of the new regulation coming in, in July 24, which is around the elimination of collective TV billing. And in that process, we’ve been sort of expanding on our road map of the cable upgrade plan that we plan to do. But in the process, we also ask housing associations are you interested in fiber to the building as well. I mean we have not had an overwhelmingly, yes, I want fiber. We’ve had many, many more actually say, now you’ve explained the cable upgrade plan that will suffice for us. And there is a logic to that because in the end, we have a strong network. However, the majority still and we have contacted now, what, 8,000 of our largest housing associations, which represents about 20% of the households covered. And what’s sort of coming out of that conversation is very much, you are our natural partner. At some point in the future, I may want trade my building. So from the conversations and the analysis, what we said is we think that there is an opportunity over and above the upgrade plan we’re going to do to our normal cable network, which we talked about, high split going to DOCSIS 4.0 over a period of time. We’ve said, shall we do a targeted JV FTTB build to the scope of about 4 million to 7 million households. And what we would do is primarily target our MDUs, they are large housing associations, and the surrounding area because, obviously, it’s more efficient for us to do a build of that nature. Number one, they bring build capabilities. And the second thing is that, obviously, financing at low affordable cost. And we’re doing a JV because, obviously, this means that it’s completely off balance sheet from a Vodafone perspective. So I think we’ve got a good combination, good overall upgrade path for the 24 million households covered, targeted FTTB build in a JV model, and got we’ve some very strong potential partners that we’re currently engaged with and we’re advancing in those talks as we speak. From the financial perspective, clearly, our cable road map is well integrated into our long-range plan organically off balance sheet when we have been looking at what could be the best solution for those housing associations that may want over the longer term to have fiber. Nick was saying, we will base the rollout around anchor housing associations. But we have then catchment areas around those, and this can be on footprint, but also off footprint. And then finally, there are synergies, as you know, with the mobile network as well. All in all, we have concluded on this four to seven size, but the situation will be refined further as we progress with our discussions. We need to still decide, as you can see, it’s a range. Thank you very much. Thanks for taking the question and good morning, to you both. I just wanted to ask a few questions, short ones, about the United Kingdom specifically, please. And then thirdly, if you were to consolidate the mobile market in the United Kingdom, I’d love to know why is it that you trust Ofcom to do the right thing, given that earlier this year, they published a think piece in which they said that in their view, Vodafone UK earned zero return on capital employed since 2017, EE earned 20% and even Three had earned a much higher return on capital than Vodafone UK? Okay, John, let me go through the three components. So first of all, in terms of access to competitive fixed infrastructure, actually, I really feel that we’re in an excellent position. We are, if you like, building a base that increasingly is attractive to an infrastructure player to have onboard to drive their returns and economics. We have BT, obviously, is building at speed. But they are engaging with Ofcom to say, could we offer larger discounts to encourage more people to come on to our network like we have contingent-type models in Europe. They are keenly engaged to say, could they get some anchor tenant. I’d say secondly, in terms of TalkTalk, look, I think we made clear what our priorities are. Our priorities are in-market mobile consolidation, and we have a big enough agenda already in other activities. And then third, in terms of in-market consolidation, and let’s call Ofcom CMA. I think you have to look back at the U.S. as an example where T-Mobile did the merger, went down out to three players. They increased their investment, and then you saw the other two big players increasing their investment. I think, increasingly, governments, politicians, regulators are understanding the benefits of that and the vulnerabilities of fragmentation. And therefore, they want to ensure that the digital infrastructure that underpins the country is going to allow global competitiveness. And therefore, I think the agenda has very much and the narrative has very much moved on. Of course, it needs to be supported by the fact pattern. And therefore, I’m not saying all combinations will be treated the same way, but I think we have an opportunity in the UK. Given that Ofcom is an evidence-based regulator, and they start the conversation by saying that on our calculations, they say, you Vodafone have earned nothing. Because if we’ve earned nothing in terms of returns and Three is below their weighted cost of capital, therefore, both are in an unsustainable position as subscale players. And therefore, a combination would make a stronger player in the marketplace. So we’ve always said local scale matters, and then we add regional scale on top. Thank you very much. So my question, please, is on the Italian market. Clearly, the competitive backdrop is still pretty intense there and maybe some emerging macro headwinds. We have closed the year in which despite the competitive environment, we have, at the same time, increased service revenue market share and delivered stable EBITDA once you exclude the exceptional impact of the settlement from a legal perspective. Just focusing on the outlook from here, our growth has the benefit of growing wholesale in the past 12 months. And of course, the market will remain competitive. But if I think about the puts and takes, we now have the benefit of the European recovery fund. Italy has allocated €600 million in vouchers for connectivity, so impacting directly the telcos, operators over the next couple of years. Stepping back, I think I would like to call out that in terms of key for our relatively strong performance in Italy, business is a key factor. And we were gaining market share and performing well even before the European recovery fund, particularly through digital. And then in the very contested consumer environment, we are also competing well with our dual-brand strategy, and we are now expanding into FWA. And then if I move to EBITDA, I can’t give EBITDA loan. You know that Italy is considered one of the most efficient operators in the industry in Europe, and we will continue to work on our efficiency levers, digitization and the like. So, I would say, really good performance in Italy at the moment. So, of course, companies like ours get a lot of legacy built up over time, price plans, etcetera. And he really said, look, we really need to try and find a way of radically simplifying down. So, we did a lot of cohort analysis of customers, price plans, products, services, etcetera. As we execute that through on top of the IT transformation we are doing, we will have a lot cleaner estate moving forward. And I think that will mean that we will be a lot more agile, a lot simpler business and drive further efficiencies, as Margherita said, on top of what is already a very efficient operation. So, that execution is going according to business plan. We have been working on it for probably the last nine months in terms of the planning and the execution, and we are rolling that through. If that is successful, which we have got confidence we will see that through, I think there is applications throughout many of our markets in Europe where we could deploy that methodology going forward. So, yes, it’s an example of how we learn as a group, how we drive synergies and stay commercially relevant in individual markets. You did decline the offer that Iliad made for your business there, I guess because of the price that was offered. And you are talking currently in mobile for 1 gig, €0.15 on an average usage. And then you look at Iliad’s convergence, fixed pricing and you don’t make any money on that. So, you stand back from that and say things will have to change. People are going to have to force to collaborate, combine due diligence. Thank you very much. Thank you very much. Well, Polo, I got the call on Saturday from Hatem, and he explained that he had taken the 9.8% position. And in that call, he was at pains to go through the rationale and all the elements of the communication that would be going out. I mean he really wanted to stress the fact that this was a passive investment, supportive of the Board, management strategy in its execution, that all the things we were doing on the portfolio were the things that they believe were the right things to do. Clearly, we know them, they know us as industry players. And therefore, I really think that there is an opportunity to develop a commercial collaboration moving forward. I am sure there is areas in procurement, in R&D, technology that we can do maybe shared service centers. And look, we look forward to developing a long-term relationship with them. Thank you very much. And secondly, on Turkey, you had about 300 million of free cash flow in FY ‘22. Energy, we are, at the moment, 75% hedged on FY ‘23. And effectively, we have always had rolling hedges over time. And we found ourselves pre-Ukraine crisis very well covered, I would say, all the way to December, but of course, hedges rolling off after that. Since the Ukraine crisis, we have not changed much in terms of coverage. And you are right, it’s not an easy decision to make on when and how to intervene. And of course, everything that goes together with the general sort of taxes and subsidies around energy, we think this is more important structurally. So, that’s for the energy side. Clearly, it would be a headwind. In this fiscal year, we are sizing it at current pricing at just under €200 million, so materially in our overall equation. Turkey, management of Turkey, clearly always from our side, we look at it in hard currency. You know our principles, you need to grow revenues ahead of inflation and cost below inflation. This year, we don’t have particular issues on the technical front to your specific point. So, if I take just the example of pricing, which is really critical, you will have seen us raising pricing 33x in six months. The last time was March, 30%. So, very active in ensuring that in the, let’s say, mid-term, we come out on the other side with stronger cash flow generation. And it’s probably worth just noting and of course, it is quite beneficial that the other two major players are government-owned entities, because then they take a view of the overall industry and what’s healthy for the overall industry. So, €200 million is the headwind without Q4. And that’s the uncertainty that you’ve tried to bake into your guidance, I suppose. So, the central case includes the €200 million. And if you take the forward rates of energy today, that’s the effect you have on the full year. If prices were to go up further, that’s where the range comes into play or go down, because I think over time, you could also see that. We have time for one more question today, which will come from David Wright from Bank of America/Merrill Lynch. Hello guys, hopefully, you can hear me and everything is working. So, it was just a question really on the guidance and specifically the mid-term guidance that you have reiterated in the presentation. Because if it was given at full year ‘21 and say it was a 3-year outlook, then you have done 5%. So, to get back to that kind of mid-single level, you are going to have to do high-single digit. And even if we were to extend it another year or so, it feels like you need to achieve a high-single digit run rate, especially given some of those hedging pressures are also going to be present in full year ‘24. But I guess I am just wondering how you bridge that gap to the high-single digit EBITDA growth, which is the asset that kind of gets you there. And I speak with Germany, obviously, a little slower this year, some TV headwinds, etcetera. So, if you could just outline that guidance more specifically and the building actually hit it. So, starting from the logic of our mid-term ambition, starting point FY ‘21. In terms of how do we stand against that today and your question on bridging, well, first of all, we have just closed the first year in line or exceeding the progression that we have set for ourselves, growth in Europe and Africa, mid-single digit EBITDA growth. And the return on capital, you have seen the big step-up that we have had in year one, which was 170 basis point. Clearly, FY ‘23 is likely to be slower if we take the midpoint of the EBITDA guidance that we have given, which is around 2% for the reasons we have just discussed, including energy. However, let me also take the opportunity to flag that if you look at our free cash flow growth, the circa €5.3 billion expected into FY ‘23 is actually underlying representing a 10% increase over the 2 years. So, if you think about the mid-single digit free cash flow growth at the midpoint of our guidance, we are there. Why that is, it’s because, as we have flagged earlier this morning, we had a deferral of a €200 million payment across ‘22 and ‘23 in taxes in Germany. So, underlying effectively, we will be moving from €5 billion to €5.5 billion, which is bang on the midpoint of our mid-term ambition. And then as we look at return on capital, again, now we are at 7.2 pretax, guiding for a further increase above that. So, I think we are well positioned to continue in that trajectory. I think that there is a range of, how can I say, options on our the outlook may turn on EBITDA for the years beyond FY ‘23. This year, we have had these impacts, for example, for inflation. You need to assess will that last forever or will at some point, for example, the energy price switch and move into the other direction. I think here, we are talking about the mid-term and we are also talking about ranges. And therefore, first, we need to see how we close ‘23. Can I just sneak a quick one, I was just very intrigued yesterday, I think as were most investors by the shift from Vantage into this sort of hybrid reseller model in Germany potentially on the build-to-suit. David, it’s very much a case of Vodafone has coverage and performance obligations that came with the spectrum. And that’s where the 5,500 towers came from or BTSs came from. What we were really doing was saying to Vantage, look, you have the option to go source them up to 1,200 if you need to moving forward, so it’s optionality, it’s not an obligation. Obviously, it depends on the ease at which they can find locations and do builds. Obviously, you know Germany is notoriously slow as a country to get permits, approvals and build through. So, given that was the last question, thank you very much for joining Margherita and myself. We had a good financial year in FY ‘22 with strong growth in many of the parameters and, importantly, return on capital employed. So, we look forward to updating you in future quarters on our progress."
}