{
    "symbol": "PODD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 20:59:05",
    "content": " We exceeded our expectations once again, achieving revenue growth of 45% in the U.S. and over 35% for total Omnipod and our U.S. and global new customer starts were at record levels. And we continue to build on that momentum throughout the year, adding CE Mark approval and quickly extending our label in the U.S. to include pediatric customers down to age 2 for Omnipod 5, as well as completing the 510(k) submission for our type 2 basal-only pod. This was driven primarily by new Omnipod 5 customers including conversions from Omnipod DASH and Classic Omnipod, where we again benefited from some customers simultaneously getting both their starter kits and first order of refills as well as some initial stocking in retail pharmacies. During Q4, Omnipod 5 and Omnipod DASH new customer starts combined were 100% of our total U.S. new customer starts. We delivered total Omnipod revenue growth of 27% and total company revenue growth of 22%, which reflects the incredible demand for Omnipod 5 ongoing contribution from Omnipod DASH throughout our global markets and the benefit of our annuity-based business model. For U.S. Omnipod, we expect revenue growth of 21% to 26%, driven by strong Omnipod 5 adoption coming from both new customer starts, and conversions from another Omnipod product as well as the continued adoption of Omnipod DASH and the benefits of our pay-as-you-go business model. We currently expect the cadence of our revenue growth to be more weighted to the first half of the year, given a tougher comparison in the second half of the year, resulting from the Omnipod 5 full market release in the U.S. in August of 2022. We -- while we're excited to introduce Omnipod 5 to our first international markets later this year, given our annuity model, we are not expecting a material contribution to growth in our international markets for Omnipod 5 in 2023. We expect the core drivers of growth to be the ongoing adoption of Omnipod 5, including the benefits of the U.S. pharmacy channel and our consistent record new customer starts as well as our annuity model. Omnipod 5 is going to be such a revolutionary offer -- it's such a great experience for customers is delivering such great results that we think demand will continue to persist for the long -- not just through '23, but for the long haul. So the new converters, obviously, as our current customers, classic Omnipod and DASH customers convert Omnipod 5, and we're assuming most of them will be done by the end of 2023. So how fast can new patients start MDI win competitive converts, those kind of things ramp in the international markets relative to what we've seen so strong here out of the gate in the U.S. We know there's a lot of pent demand for Omnipod 5 and just tons of interest. And from an investment strategy standpoint, we had a choice to make, and we decided that instead of reducing our investment in commercial expansion and research and development, that we would continue to invest through this inflationary cycle -- and even though we're paying higher cost for components and it's putting pressure on our gross margins, in addition to some of the business model challenges like with Omnipod 5 at a slightly higher cost and our U.S. manufacturing facility taking some time to hit an inflection point and still a higher cost facility for us. So -- as far as the 85,000 retail pharmacies as far as the are there and how much Omnipod is on the shelf, it's really not that much because when a physician sends a prescription to a pharmacy, it's about 24 hours that a wholesaler will send Omnipod to that retail pharmacy. And so as we're significantly ramping up new customers here, that's one of the impacts that the Omnipod 5 product cost impacts our gross margins. The far larger components are volume, including the initial volume ramp here with Omnipod 5 and this 2-script benefit that we're getting at the early stages here in the first couple of quarters -- and so we don't break out that metric for you, but it's something that's been positive for us, and we think it will continue to be positive for us in the pharmacy channel. And then here in the third and fourth quarter, we've called out this additional script benefit, $16 million in Q3 and $15 -- so when you normalize for those, we're talking about a 4% impact in the U.S. And so not to the orders of magnitude you were getting at, but something that we certainly want to be aware of because most of that volume benefit is being driven by converting customers. It's -- as we launch Omnipod 5, the new customer will get a starter kit, which is their personal diabetes manager as well as their initial order of pods."
}