{
    "symbol": "PODD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 12:04:18",
    "content": " In Q2, the first full quarter of limited market release, Omnipod 5 already represented over 25% of our US new customer starts. Weâ\u0080\u0099ve made great progress in Q2 as we delivered another quarter of record US and global new customer starts and achieved a number of notable milestones, including the US full commercial launch of Omnipod 5 within the time range we expected. Revenue growth continues to be driven by the compounding benefit from record new customer starts and increasing volume through the US pharmacy channel, including initial contributions from Omnipod 5. Omnipod 5 and Omnipod DASH new customer starts combined, were up sequentially to over 90% of our total US new customer starts, comprised of Omnipod DASH at approximately 65% and Omnipod 5, over 25%. The primary drivers were the expected higher mix of costs and manufacturing inefficiencies as we ramp our US manufacturing operations, a higher warranty accrual for costs related to Omnipod DASH PDMs for battery lives as they age, as well as higher costs given the mix impact of Omnipod 5 ramping, all partially offset by growing volume through the US pharmacy channel. As a reminder, the higher mix of volume at our US manufacturing facility, growing Omnipod 5 volume and the higher component costs included in our inventory balance will continue to pressure gross margin for the remainder of this year as we sell the product out of inventory. Excluding these charges, operating expenses were higher than Q2 of last year, due to continued investments in sales and marketing, such as our Omnipod 5 launch efforts, international expansion, continued investments in innovation and scaling our global business to support our growth. Revenue growth will be driven primarily by increased Omnipod DASH volume through the pharmacy channel, the benefit of our pay-as-you-go model, which should expand both our Type 1 and Type 2 customer base, and increasing volume for Omnipod 5, following our full market release. We now expect a range of 65% to 66%, representing a decline of 200 basis points from our previous expectation as we continue to encounter higher costs associated with ramping US manufacturing and Omnipod 5 volumes, higher warranty costs, and the ongoing inflationary and supply chain pressures in the broader macro environment. On a year-over-year basis, our gross margin will be impacted by product line mix from lower drug delivery revenue, higher costs associated with our US manufacturing ramp, product mix, including ramping Omnipod 5, manufacturing components due to inflation and warranty costs. For US Omnipod, we expect growth of 24% to 27%, driven by the benefits of our recurring revenue model, growing Omnipod DASH volume through the US pharmacy channel and ramping contributions from Omnipod 5. We expect Q3 international Omnipod growth of 7% to 10%, driven by the ongoing Omnipod DASH adoption, partially offset by competitive AID headwinds and the compounding impact on new customer starts in 2021 and into 2022, largely due to the pandemic. And then internationally, weâ\u0080\u0099ve got a significant amount of work going across many functions, marketing, and in particular, in IT, and weâ\u0080\u0099ve got a significant amount of work to do country-by-country from the infrastructure that needs to be built to support our cloud infrastructure and what we have you know to bring with our Omnipod 5 system is really this differentiated system that works in the cloud and brings a lot of benefits to both the HCPs and the customers. Iâ\u0080\u0099ll just tag on the back of that, Bret, that one thing to bear in mind is, you know as we launch Omnipod 5 and we go market-by-market, with all of that work weâ\u0080\u0099re doing to pioneer the cloud-based offerings, weâ\u0080\u0099re also digging a huge moat."
}