{
    "symbol": "DIOD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-06 23:16:06",
    "content": " Revenue for the fourth quarter 2022 was $496.2 million, increasing 3.3% from $480.2 million in the fourth quarter 2021 and down 4.8% from the $521.3 million in the third quarter 2022. Gross profit for the fourth quarter was $206.2 million or 41.6% of revenue, increasing from $190.7 million or 39.7% of revenue in the prior year quarter and down from $217.8 million or 41.8% of revenue in the prior quarter. For the full year, GAAP gross profit was a record $827.2 million, a 23.4% increase over 2021 and GAAP gross margin improved 420 basis points to a record 41.3%. GAAP operating expenses for the fourth quarter were $109.7 million or 22.1% of revenue and on a non-GAAP basis were $105.9 million or 21.3% of revenue, which excludes $3.8 million of amortization of acquisition related intangible asset expenses. GAAP net income for the fourth quarter 2022 was $92.1 million or $2 per diluted share, compared to $65.5 million or $1.43 per diluted share in the fourth quarter 2021 and $86.4 million or $1.88 per diluted share in the third quarter of 2022. For the full year 2022, GAAP net income was a record $331.3 million or a record $7.20 per diluted share, which was approximately 45% increase from the $228.8 million or $5 per diluted share in 2021. Non-GAAP adjusted net income in the fourth quarter was $79.6 million or $1.73 per diluted share, which excluded net of tax million of acquisition related intangible asset costs. For the full year, non-GAAP adjusted net income was a record $339 million or a record $7.36 per diluted share, an increase of approximately 43% from the $237.2 million or $5.18 per diluted share in 2021. Excluding non-cash share-based compensation expense of net of tax for the fourth quarter and $28.7 million for the full year, both GAAP earnings per share and non-GAAP adjusted EPS would have increased by $0.16 per diluted share and $0.62 per diluted share, respectively. EBITDA for the fourth quarter was $129.6 million or 26.1% of revenue, compared to $139 million or 28.9% of revenue in the fourth quarter of 2021 and $141.9 million or 27.2% of revenue in the prior quarter. For the full year, EBITDA improved 19.7% to a record $520.4 million or 26% of revenue, compared to $434.6 million or 24.1% of revenue in 2021. Capital expenditures on a cash basis were $63.8 million for the fourth quarter, and for the full year, approximately $211.7 million or 10.6% of revenue. For the first quarter of 2023, we expect revenue to be approximately $467 million plus or minus 3%."
}