{
    "symbol": "DIOD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 22:30:06",
    "content": " We once again set new record across key financial metrics, including the sixth consecutive quarter of record revenue and gross profit, record gross margin that exceeded 40% for the first time in the company's history, and the fifth consecutive quarter of record non-GAAP earning per share. Looking forward, the growth and the demand for all products remain at higher level across all target end market and the geographies, and we are guiding for our 9th consecutive quarter of growth and our 7th consecutive quarter of record revenue in the second quarter, and also anticipating another solid year of strong growth and profitability for Diodes. Revenue for the first quarter 2022 was a record $482.1 million, an increase of 0.4% from $480.2 million in the fourth quarter 2021. Gross profit for the first quarter was also a record at $196.7 million, representing a record 40.8% of revenue, increasing 3.1% or 110 basis points from $190.7 million, or 39.7% of revenue in the fourth quarter 2021. GAAP operating expenses for the first quarter 2022 were $103.6 million, or 21.5% of revenue, and on a non GAAP basis were $99.5 million or 20.6% of revenue, which excludes $3.9 million of amortization of acquisition related intangible asset expenses, and $0.3 million of acquisition related costs. Income before taxes and non-controlling interest in the first quarter 2022 was $90.8 million compared to $108.8 million in the previous quarter, due primarily to a couple of non-GAAP items that included the gain on the sale of a manufacturing subsidiary last quarter and unrealized loss on investments in the first quarter. GAAP net income for the first quarter 2022 was $72.7 million, or $1.59 per diluted share, compared to GAAP net income of $65.5 million, or $1.43 per diluted share in the fourth quarter 2021. Non-GAAP adjusted net income in the first quarter was a record $80.3 million or $1.75 per diluted share, which excluded net of tax $4.2 million non-cash mark-to-market adjustment of investments 3.2 million of acquisition related intangible asset costs and 0.2 million of acquisition related costs. This represents a 9.4% improvement from last quarter of $1.60 per diluted share, or $73.3 million and an 88.2% improvement from $0.93 per diluted share, or $42 million in the first quarter of 2021. Excluding share based compensation expense of $6.4 million for the first quarter, both GAAP earnings per share and non-GAAP adjusted EPS would have increased by $0.14 per diluted share for the first quarter. EBITA for the first quarter was $118.2 million, or 24.5% of revenue, compared to $139 million, or 28.9% of revenue in the prior quarter. On a year-over-year basis, EBITDA increased 44.8% from $81.7 million in the first quarter of 2021, highlighting our continued improvements over the past year. Capital expenditures on a cash basis for the first quarter 2022 were $38.5 million or 8% of revenue, which is within our target model of 5% to 9%. With our excellent execution and recent improvements, we are guiding for sequential growth and expect revenue to be approximately $500 million plus or minus 3%, and GAAP gross margin to be 41.0% plus or minus 1%."
}