{
    "symbol": "DIOD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 23:06:05",
    "content": " Revenue for the second quarter 2022 was a record $501 million, an increase of 3.9% from the $482.1 million in the first quarter 2022. Gross profit for the second quarter was also a record at $206.5 million, representing a record 41.2% of revenue, increasing 5% or 40 basis points from $196.7 million or 40.8% of revenue in the first quarter 2022. GAAP operating expenses for the second quarter of 2022 were $100.3 million or 20% of revenue, and on a non-GAAP basis were $99.7 million or 19.9% of revenue, which excludes $4 million of amortization of acquisition-related intangible asset expenses, $0.2 million of acquisition-related costs and a $3.6 million gain on insurance recovery. GAAP net income for the second quarter of 2022 was a record $80.2 million or $1.75 per diluted share, compared to GAAP net income of $72.7 million or $1.59 per diluted share in the first quarter of 2022. Non-GAAP adjusted net income in the second quarter was a record $86.9 million or $1.90 per diluted share, which excluded net of tax, $6.2 million of non-cash mark-to-market adjustment of investments, $3.3 million of acquisition-related intangible asset costs, $0.2 million of acquisition-related costs and $2.9 million gain on insurance recovery. EBITDA for the second quarter was $130.6 million or 26% of revenue, compared to $118.2 million or 24.5% of revenue in the prior quarter. On a year-over-year basis, EBITDA increased 31.1% from $99.4 million in the second quarter 2021, highlighting our continued improvements over the past year. Iâ\u0080\u0099d like to make the point that if we excluded non-cash gains and losses on securities from our EBITDA calculation for a more accurate assessment of our operating performance, it would have been a record $137.2 million, representing an increase of 10% sequentially and 45% year-over-year. Capital expenditures on a cash basis for the second quarter of 2022 were $39.6 million or 7.9% of revenue, which is within our target model of 5% to 9%. With our excellent execution and product mix improvements, we are guiding for our 10th consecutive quarter of sequential growth and expect revenue to be approximately $521 million, plus or minus 3% and GAAP gross margin to be 41.5%, plus or minus 1%. Our income tax rate is expected to be 18.5%, plus or minus 3%, and shares used to calculate diluted EPS for the third quarter are anticipated to be approximately $46.2 million. In our industrial market, revenue was also a record and increased 43% year-over-year representing growth for the fifth consecutive quarter."
}