{
    "symbol": "VRDN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 13:52:12",
    "content": " So data today are from our first cohort of 8 to 10 patients, six of whom received 10 milligrams per kilogram of VRDN-001, two of whom who received placebo, the drug was infused twice, first on day zero, then again on day 21. Both to evaluate VRDN-001 in chronic TED patients, we plan to begin enrolling this cohort in the fourth quarter of this year, and expect to have data in the first half of â\u0080\u009823. So to summarize, we've presented data in six treated patients and two placebo patients demonstrating a positive response for VRDN-001, and overall response proptosis response, proptosis reduction, CAS change and CAS improving to zero or one and diplopia resolution. This is something that company has incorporated into its Phase 3 plans by evaluating both a standard 8 infusion treatment course like Tepezza on and a shorter 5 infusion 12-week treatment course, which can be a lot easier for patients. Each of these randomized placebo controlled trials will have three arms, with 40 patients in each arm, as illustrated here, and 8 infusion regimen matching Tepezza, a shorter 5 infusion regimen which would allow patients to complete their treatment course in just three months, 43% faster than Tepezza and a placebo arm. Fourth, VRDN-002 half-life extension provides a longer than expected extended activity in humans, tripling the half-life of first generation IGF-1R antibodies, and its PK PD profile paves the way for our proof of concept study of 200 mils -- of two milliliters contain 300 milligrams, subcutaneous injection, either every two weeks or every four weeks. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}