{
    "symbol": "VRDN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 20:32:02",
    "content": " After a very productive 2021, we continued our momentum in the first quarter with substantial progress in our Phase I/II proof-of-concept clinical trial for VRDN-001 and the initiation of our first-in-human clinical trial for VRDN-002, both trials are poised to deliver top line data in the third quarter. While we eagerly anticipate reviewing our first data from TED patients, I'm pleased to share today some highly encouraging interim data for the healthy volunteer portion of this trial, which includes 13 subjects receiving 2 doses of placebo or VRDN-001 at 3, 10 or 20 mgs per kg. Interim data show a rapid sevenfold increase in IGF-1 from baseline to all doses tested, including 3 mgs per kg, suggesting doses as low as 3 mgs per kg are sufficient to achieve maximal IGF-1R inhibition. And based on these results, we now plan to evaluate an additional cohort of TED patients at a dose of 3 mg per kg following the completion of the proof-of-concept portion of the ongoing trial. Based on the VRDN-001 healthy volunteer data we shared a few moments ago, we're now increasingly optimistic that a low dose of 001 might allow a self-administered subcutaneous dosing paradigm, and we're excited it has the potential to move rapidly and become the first subcutaneous therapy for Thyroid Eye Disease. We've completed dose escalation and expect to announce top line data from this trial in the third quarter, either concurrently with or following shortly after our VRDN-001 proof-of-concept readout. And in fact, we believe, based on the old oncology data that as you lower the dose much below 3 mgs per kg, it becomes PK limited improving affinity further is not likely to help. And given the fact that we have sub-nanomolar affinity and we're well above 10 micrograms per ml exposure, if you look back at the old oncology data for this drug, it's very reasonable to hypothesize that we're saturating the receptor and could deliver full efficacy at this dose."
}