{
    "symbol": "HCI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 12:21:49",
    "content": "  Operator: Good morning, ladies and gentlemen, and welcome to the PCTEL Second Quarter 2022 Earnings Release Conference Call. At the conclusion of our prepared remarks, we will conduct a question-and-answer session. I will now turn the call over to Kevin McGowan (sic) , the company's CFO. On today's call is Karin Coleman, HCI's Chief Operating Officer; Mark Harmsworth's, HCI's Chief Financial Officer; and Paresh Patel, HCI's Chairman and Chief Executive Officer. Following Karin's opening remarks, Mark will review our financial performance for the second quarter of 2022 and then Paresh will provide an operational outlook. To access today's webcast, please visit the Investor Information section of our corporate website at hcigroup.com. Before we begin, I'd like to take the opportunity to remind our listeners that today's presentation and responses to questions may contain forward-looking statements made pursuant to the Private Securities Litigation Reform Act of 1995. Words such as anticipate, estimate, expect, intend, plan and project and other similar words and expressions are intended to signify forward-looking statements. Should any risks or uncertainties develop into actual events, these developments should have material adverse effects on the Company's business, financial conditions and results of operations. Now with that, I'd like to turn the call over to Karin Coleman, Chief Operating Officer. Our insurance division gross premiums earning were up 30%, and our national expansion continues with premium outside of Florida approaching a quarter of our business. First, investment income with unrealized losses were impacted by market declines, and second, we strengthened reserves in response to inflation and litigation. To offset this, we filed meaningful rate increases, 10% at Homeowners Choice, and 12% at TypTap. First, we raised more than $170 million through issuance of convertible notes, increasing our flexibility at a time when capital is scarce across our industry. Second, we finalized our reinsurance with pricing in terms comparable to last year, while maintaining a conservative program with modest retentions and substantial limits. With reinsurance in place, Demotech reaffirmed our A exceptional ratings at both Homeowners Choice and TypTap. And third, we continue to optimize our balance sheet, repositioning our investment portfolio to generate income. Finally, we remain committed to returning capital to shareholders through dividends and share repurchases and continue to view our stock as an attractive investment. During the quarter, we repurchased shares representing approximately 10% of the company, and we paid a dividend of $0.40 per share, our 47th consecutive quarterly dividend. In summary, we continue to position HCI to take advantage of the opportunities in front of us, while managing the business to maximize shareholder returns - return for our shareholders. And now I'll return it - I'll turn it over to Mark, who will provide more detail on our financial results. In the second quarter last year, net income was $3.8 million. In the second quarter of this year, we had a net loss of $8.5 million. The balance of the difference came from a higher loss ratio, which increased from 40.1% to 47.9%. First, business mix simply relates to premium growth coming from lines with a higher loss ratio. The second reason with inflation, which resulted in this making higher current period loss selection. In the first six months of this year, non-cat claims paid were $30 million less than what we expensed. Second, as Karin mentioned, we completed our reinsurance program for the new treaty year. Our Net Premiums ceded assuming no storms are expected to be $245 million for the treaty year that started June 1, and we expect reinsurance as a percentage of premiums to continue to be lower this year than last. Third, policy acquisition expenses as a percentage of gross premiums earned were coming down because TypTap is paying lower commissions. So far this year, we have bought over $350 million of short duration, fixed-term securities. Lastly, we are continuing to adjust rates to compensate for inflation. As Karin mentioned, in August, we implemented rate increases for Florida homeowners in both TypTap and Homeowners Choice and as these higher rates are earned, we expect the loss ratio to start to improve. Both of our insurance companies are in strong surplus position, and we have significant dry powder at the holding company level. Just a couple of other quick points, our share count for purposes of calculating book value per share and paying dividends is now 9,048,000. In conclusion, this quarter we addressed our rate needs to combat inflationary pressures, we continue to build reserves, we secured our reinsurance program and we bought back almost 10% of the company. As discussed by Karin and Mark, the main items affecting HCI Group in Q2 were inflation and volatility in equity markets. However, we are aware of the turmoil in the Florida homeowners market. These pressures brought about by a combination of increased weather events, inflation and litigation, has and will continue to disrupt existing markets. In fact, as a company that has successfully navigated the Florida market for 15 years, this turmoil provides a substantial opportunity. To take advantage of this opportunity, the first step was to ensure that we had ample capital, and we have completed that in Q2. In the coming weeks, we intend to apply to set up additional insurance carriers in the state of Florida. And secondly, we are focused on the long-term opportunity and intend to capitalize on that opportunity. Paresh, I just wanted to follow up on actually that last point you brought up about planning to set up some new companies and be ready to write business next year. And I guess, we think about kind of HCI as it stands today, you've got TypTap, that's kind of organic growth, the independent agents, you got Homeowners Choice, that is - has a history of being a bit more of a specialist doing book rolls and citizens take outs and things like that. They will look very similar or hybrid of HCI - Homeowners Choice and TypTap, yet they will be different. You mentioned on the kind of the upward movement in the loss ratio, the seven or eight points or so, it was a few different things kind of business mix, the impacts of inflation and prior-period development. Yes, so in terms of those percentages, so the loss ratio is up about 7.8% from the second quarter of last year to the second quarter of this year. About 3.3% of that is inflation, and 2.7% is prior-year development. And then one last one if I could sneak it in, Mark, also a numbers question. TypTap surplus at the end of June is, just give me one second here, $90.2 million. So Homeowners Choice, there was a $2 million of adverse development in Homeowners Choice. But if we look back at that assumption in 2020, we tweaked that loss ratio up a bit. The other thing that's going on is we've got - I think we've talked about a couple of times before, but tropical storm Ada from November of 2020, pretty significant difference between the number of lawsuits that we thought we'd get off of the 1,200 or 1,300 claims that were there than expected. So again, that's largely litigation driven. And then in TypTap, we've got a couple of accident quarters again from 2020 where we're adjusting up our litigation picks. Just in terms of the litigation trends generally, litigation and that reported litigation in the second quarter of this year was significantly lower than it was in the second quarter of last year. So assuming that - so we've got some rate increases that we mentioned, and inflation has been obviously higher than our rate increases. They've gone up, but I don't think anyone is expecting they'll go down. If they stay flat, sort of stay at these elevated levels, then as the rate increases work their way into the book, I would expect the loss ratio to drop a couple of points each quarter for the next couple of quarters. Yes, Mark, as you know the loss ratio are not immediately in the second quarter. The rate increases that we've put through, which are greater than the increase in the loss ratio will take several months to earn in. And so consequently, as that happens, the loss ratio will drop, but it will be a multi-month process, multi-quarter process. As more of the book renews, the blended commission rate comes down. So you - kind of the easing off during storm season means there is more concentration in renewals in the period, and so... I mean, look, it's simple math in a weird way. as in a sense of the first year when you $100 million of business, it's all new business. Second year you add a $100 million of new business, half of it is renewal, half of it is new business. Third year, you add $100 million, it's $200 million of renewal business and only $100 million of new business. So the renewal rate tend to, over time, dominate the new business rates. You said - I think you've done very well historically, keeping losses under control and then substantially better than your peers. This kind of the appearance of inflation here, Florida has been - and your competitors have been undergoing some stress for a while. I think you've touched on this, but I just wanted to kind of flesh it out a little more, if there is anything else to be said, why the mix, I understand, the prior-year development mix there is, then inflation having a more of a incremental impact. And one of the big things was, and I'll quote, I think the Federal Reserve Chairman, a shift in belief but inflation is transitory, inflation is permanent. And if you remember Mark's earlier comments, Mark Harmsworth's earlier comment, that he is not expecting prices to come down anytime soon. We can't always predict the future, but whenever the present becomes obvious, we take corrective action, quickly and efficiently. Because of the turmoil in Florida, we actually see a greater opportunity at this moment in time unfolding in the fourth quarter than maybe we saw six months ago. So TypTap Insurance Company's plans and expansion plans, that's at Florida, are going unabated, unchanged. I would now like to turn the call back over to Paresh Patel, who has a few closing remarks. On behalf of the entire management team, I would like to thank our shareholders, employees, agents and most importantly, our policyholders for their continued support."
}