{
    "symbol": "MKL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 12:28:02",
    "content": " Our 2022 combined ratio included $70 million of net losses attributed to Hurricane Ian, and $35 million attributed to the Russia-Ukraine conflict, which combined added two points to the year-to-date combined ratio. With regards to prior year loss reserve development, prior year loss reserves developed favorably by $204 million in the first nine months of this year compared to $366 million in the first nine months of last year. Net investment losses included in net income were $2.2 billion in the first nine months of the year were primarily attributable to a decrease in the fair value of our equity portfolio, driven by significant declines in the public equity markets during the period. This compares to net investment gains of $1.2 billion for the first nine months of last year, attributable to an increase in the fair value of our equity portfolio driven by favorable market value movements. With regards to net investment income, we reported $274 million in the first nine months of this year compared to $284 million in the same period last year. Net unrealized investment gains decreased $1.3 billion net of taxes during the first nine months of this year, reflecting a decline in the fair value of our fixed maturity portfolio, resulting from increases in interest rates. The current year combined ratio included $90 million or just under two points of net losses related to Hurricane Ian and the Russia-Ukraine war versus $89 million or just over two points of net losses last year, related to 2021 catastrophes. Excluding the impact from these event losses, the combined ratio increased by three points due to less favorable development on prior year losses, partially offset by a lower expense ratio due to benefit from higher earned premiums and relatively flat operating expenses. Excluding the impact from these events, the Reinsurance segment combined ratio decreased by five points from a year ago, primarily due to favorable development on prior accident year losses this year versus adverse development last year. Our program services and other funding operations continue to grow with total premium production of $2.6 billion this year versus $2.3 billion last year and produced total revenues of $105 million this year, up 18% from a year ago. I don't know where that will stand this year just simply because of -- like you say, Ian, I think there's going to be quite a bit of focus on making sure you get reserves correct for Ian also in terms of this is the cap time that you do capital raising."
}