{
    "symbol": "MKL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:10:17",
    "content": " Looking at our underwriting results, gross written premiums were $2.5 billion for the first quarter of 2022, compared to $2.2 billion in 2021, an increase of 16%. Our consolidated combined ratio for the first quarter of 2022 was an 89%, which included $35 million or 2 points of net losses in loss adjustment expenses and $12.3 million of ceded reinstatement premiums attributed to the Russia-Ukraine conflict. This compares to a 94% combined ratio for the same period last year, which included $64 million or 4 points of losses attributable to Winter Storm Uri and $19 million or 1 point of adverse development arising from a change in our estimate of COVID-19 ultimate losses a year ago. Excluding these loss impacts from both years, our consolidated combined ratio for the first quarter of 2022 was an 87%, compared to an 88% for the same period of 2021. With regards to prior year loss reserve development, prior year loss reserves developed favorably by $96 million in the first quarter of this year, compared to $91 million in the first quarter of last year. Net investment losses were $358 million in the first quarter of 2022 and were primarily attributable to a decrease in the fair value of our equity portfolio, driven by unfavorable market value movements. This comparison net investment gains of $527 million in the first quarter of 2021, attributable to an increase in the fair value of our equity portfolio driven by favorable market value movements. With regards to net investment income, we reported $73 million in the first quarter of 2022, compared to $97 million in the same period last year. Net unrealized investment gains decreased $476 million net of taxes during the first quarter of this year, reflecting a decline in the fair value of our fixed maturity portfolio, resulting from increases in interest rates during the first quarter. Revenues from Markel Ventures increased 35% to $950 million in the first quarter of 2022, compared to $707 million for the comparable quarter last year. EBITDA for Market Ventures was $96 million in the first quarter of 2022, compared to $81 million during the same period last year. We reported a net loss of common share to common shareholders of $53 million in the first quarter of 2022, compared to net income to common shareholders of $574 million in the same period a year ago, largely attributed to the year-over-year swing in changes to our public equity portfolio valuation. Guidance of loss to shareholders for the first quarter of 2022 was $529 million, compared to comprehensive income to shareholders of $359 million in the first quarter a year ago, again, driven by both fixed maturity and public equity valuations. We also made $102 million in additional payments net of Insurance proceeds to or for the benefit of investors in exchange for releases of all claims related to the transaction, the CATCo businesses and investors’ investments in the funds including any pending litigation, which was recognized as an expense during the first quarter of 2022. Net cash provided by operating activities was $415 million for the first quarter of 2022, compared to $318 million for the first quarter of last year. Business production continues to be robust, with 16% growth in our underwriting operations, with gross written premium surpassing $2.5 billion for the quarter and that that’s the first time we have done that and 17% growth within our program services operations. The current year combined ratio included $15 million or 5 points of net losses from the Russia-Ukraine conflict, compared to $25 million or 10 points of losses last year related to Winter Storm Uri. Excluding the impact from these events, the Reinsurance segment combined ratio decreased 2 points due to lower adverse development on prior accident years’ losses, partially offset by a slightly higher current accident year attritional loss ratio."
}