{
    "symbol": "MKL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 13:14:12",
    "content": " While growth in our insurance and Markel Ventures operations drove meaningful contributions to our operating results, the volatility within the public equity markets and the effects of rising interest rates on our bond portfolio significantly impacted our investment results this year. Gross written premiums were $5 billion for the first half of 2022 compared to $4.3 billion in 2021, an increase of 18%. Excluding these loss impacts from both years, our consolidated combined ratio for the first half of 2022 was an 89% compared to 88% for the same period in 2021. The increase reflects the impact of less favorable development on prior accident year loss reserves with our insurance segment this year compared to last year, partially offset by a lower expense ratio and lower attritional loss ratio within our insurance segment. This compares to net investment gains of $1.2 billion in the first half of 2021 attributable to an increase in the fair value of our equity portfolio, driven by favorable market value movements. With regards to net investment income, we reported $166 million in the first half of '22 compared to $193 million in the same period last year. EBITDA for Markel Ventures was $250 million for the first half of this year, compared to $220 million for the same period last year. Looking at our consolidated results for the first half of the year, we reported a net loss to common shareholders of $987 million for the first half of the year, compared to net income to common shareholders of $1.3 billion in the same period a year ago. Comprehensive loss for shareholders for the first half 2022 was $1.8 billion, compared to comprehensive income to shareholders of $1.2 billion in the first half of 2021, again this was driven by both fixed maturity and public equity valuations. Gross written premiums in the insurance segment were up 21% for the first half of the year with just over $4 billion in premium writings, while earned premiums were up 20% for the first half of the year. Excluding the impact from these event losses, the combined ratio increased by 2 points, due to less favorable development on prior accident year losses partially offset by a lower current accident year attritional loss ratio and lower expense ratio. The 2022 current accident year attritional loss ratio decreased by 2 points spread across several product lines, but most notably in our general liability and professional liability lines due to the impact from favorable premium rates and our expanded premium writings in deferred product classes. The lower 2022 favorable development on prior accident year's losses was driven by adverse development in our professional liability lines, primarily in airs and emissions and financial institutions classes on accident years 2015 to 2019. Excluding the impact from these events, the Reinsurance segment combined ratio decreased by six points from a year ago, primarily due to lower adverse development on prior accident year losses. Our program services and other funding operations continue to grow with total premium production of $1.6 billion this year versus $1.4 billion last year and produced total revenues of $64 million this year, up 14% from a year ago. Markel Ventures produced record revenues of $2.3 billion, up from $1.8 billion and, more importantly, record EBITDA of $250 million, compared to $220 million last year. On the front of the income statement, we reported net investment losses of $1.9 billion through the first half of 2022, compared to a gain of $1.2 billion in the first half of 2021. Even after the first half drama, of the worst first half for the S&P 500 -- 50 years, we still have an unrealized gain on our equity portfolio of $4.2 billion. While that gain is down from $6.2 billion at year-end 2021, I think it's fair to say that our long-term track record of earning excellent returns in our equity portfolio remains true. Today, as we stated, it stands at $4.2 billion, even after the worst first half start for equity markets in 50 years."
}