{
    "symbol": "TEVA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 12:22:09",
    "content": "  Operator: Good day, and thank you for standing by, and welcome to Teva's First Quarter 2022 Financial Results Conference Call. I would now like to hand the conference over to your first speaker today, Ran Meir, Senior Vice President, Investor Relations. Thank you, everyone, for joining us today to discuss Teva's first quarter 2022 financial results. To begin today's call, Kåre Schultz, Teva's CEO, will provide an overview of the first quarter performance, recent events and priorities going forward. Our CFO, Eli Kalif, will follow up by reviewing the financial results in more detail, including our 2022 financial outlook. Joining Kåre and Eli on the call today is Sven Dethlefs, Teva's Head of North America Commercial, who will be available during the question-and-answer session that will follow the presentation. I'm happy to present a solid first quarter of this year, with continued progress on many fronts. If we take a look at the financials, then revenues came in at $3.7 billion, our adjusted EBITDA came in at $1.1 billion and our GAAP diluted loss per share was $0.86 and our non-GAAP diluted EPS came in at $0.55. Free cash flow came in at $117 million, and we're happy to show you that the debt reduction continued and net debt is now reduced to $20.7 billion. On the business side, we were very happy to see continued growth of AUSTEDO prescriptions, growing to a new all-time high. And at the same time, we also saw a growth in market share for our other key growth driver AJOVY, where we saw a strong development in Europe and also a nice progress in the U.S. So, we saw a comeback of volumes and a nice continued strong market position in all key markets. North American generics, we are very happy to launch the new generic Revlimid, which did very well, and that was partly compensating for the lack of Truvada and Atripla sales that we had last year and also a decline in ProAir sales. We're excited about biosimilar Humira, which we now have a settled entry date of July 2023 for next year. If we move to the next slide, then you can see a highlight on the opioid litigation. And then, we have based on this also changed our accrual on the balance sheet and Eli Kalif will comment a bit on that later. There are two ongoing trials right now, one in West Virginia and one in San Francisco, both are bench trials, which means, there is a judge presiding over it, there's no jury. We are in ongoing negotiations, and we are hopefully that we can settle this with a nationwide settlement for all states sometime before the end of this year. If we go to the next slide, and here you can see our revenue development. And you can see that in the first quarter, we had two, you could say, negative developments compared to the first quarter of '21. One was that the exchange rate between Europe and U.S. between the euro and the dollar worsened, so there was a significant increase in the dollar value in euros. And we see, as I said before, a positive development of volumes in the generic space in Europe. In the U.S., the key difference here is really, like I mentioned before, that we had Truvada and Atripla sales in the first quarter of '21, and we have had REVLIMID sales in first quarter '22, but not to the same extent. If we go to the next slide, then here, as I comment on AUSTEDO, you can see that we have an all-time high TRx count in the end of the first quarter. If you look at the revenues, then we had the usual swing there where the first quarter is always low and there are really two main reasons for it. And the other one is the fact that the donut-hole effects reset of patient deductible programs and therefore, we see less demand in the first quarter. We expect the demand, of course, to swing back up as it has done all years based on the prescriptions, and we are still maintaining the outlook for AUSTEDO for the year of $8 billion in sales. If we go to the next slide, and here, you can see AJOVY. And in the U.S., you can see that we also there have an all-time high of the TRx. And you can also see that in Europe, we have an all-time high of the monthly volume market share, which is now up to 30%. I've said before that we are in all key markets, including Europe and U.S. So, we are really aiming for at least a 33% market share in both North America and Europe, and we are slowly getting there, which is You can also see here on the sales numbers that the sales in Europe are now getting up and being close to the U.S. sales, and we expect that to continue going forward. If you go to the next slide, then we have the news here that we communicated some weeks ago that we received a CRL on risperidone LAI. So, we still believe to get this product approved, but there will likely be a delay of up to 12 months on it. Another thing you can see here is illustrated on the next slide, and that's the fact that we have a very broad biosimilar portfolio. And of course, we are very excited about the big launch that's upcoming next year, the Humira launch. It's the high concentration version, citrate free and interchangeable. And we also have now that this year, we will see a launch in Europe of a Lucentis biosimilar. So all in all, it's going very well on the biosimilar side. And longer term, of course, we are aiming for addressing some roughly 80% of the value in biologic products going off patent, both in North America and in Europe. On the next slide, you see another important element of our restructuring, which is basically, you could say, post the patent cliff of COPAXONE to get our operating margin back up where it should be. And just for the record, I would like to say, even though the graph could look like it's flattening out, then, of course, we're not going to stop at 28%. We will set new long-term targets, which will be an improvement and we will communicate those targets within the coming year. The same goes for the next slide where we have another of our key financial targets shown, that's the net debt reduction. We have a target for end of '23, below three, and we'll be setting a new long-term financial target also for the net debt to EBITDA within the coming year. On the next page, you can see we're making a little commercial for our upcoming ESG progress report, which will come out in about a week's time. And we've been working very hard on this for a number of years, and we are setting some very ambitious targets. We also have secured now that our -- you could say, our financing, our debt is linked to sustainability. Eli Kalif will tell you later on about our new RCF, which also has a sustainability element. And although, we are very happy about our performance, and we're also happy that it's been seen outside the Company. So we see improved performance on our ESG ratings, which, of course, is a good sign that we are doing the right thing. If we go to the next slide, then that's a slide that those of you who follow the Company, you've seen it many times. I look forward to that, of course, and I also look forward to meeting these targets at the end of 2023. I'll begin my review of the first quarter of 2022 financial results on Slide 16, starting with our GAAP performance. Revenues in the first quarter of 2022 were $3.7 billion, a decrease of 8% or 5% in local currency terms compared to the first quarter of 2021. This decrease was mainly due to lower revenues in our North America segment, mainly driven by generics products and COPAXONE, partially offset by higher revenue from ANDA and generic products in our Europe segment. However, the decrease in our revenues from generic products in North America is still affected by the low number of launches in 2021. In Q1 2022, we recorded a GAAP operating loss of $713 million compared to operating income of $434 million in Q1 2021. GAAP operating loss, net loss and loss per share were mainly driven by higher legal settlement expenses related to an update of the estimated settlement provision recorded in connection with the remaining opioid cases in the first quarter of 2022. Foreign exchange rate movements during the first quarter of 2022, including hedging effects negatively impacted revenue and GAAP operating income by $133 million and $56 million, respectively, compared to the first quarter of 2021. As a reminder, approximately 50% of our revenues come from sales denominated in non-U.S. dollar currency. Non-GAAP operating income, net income and earnings per share for the first quarter of 2022 were adjusted to exclude these items. Amortization of purchased intangible assets totaling $200 million, the majority of which is included in cost of goods sold and impairment of long-lived assets totaling $165 million. I've already discussed our first quarter revenues, which totaled approximately $3.7 billion. Despite the 7% quarter-over-quarter decline in non-GAAP gross profit, our total non-GAAP gross profit margin improved to 54.2% compared to 53.8% in Q1 2021. The increase in non-GAAP gross profit margin was mainly driven by our continuous efforts to improve our cost of goods sold, network consolidation activities as well as a change in product portfolio mix in our international market segments partially offset by unfavorable mix of generic products in our North America segment and the lower revenues from COPAXONE. This increase was driven mainly by higher gross profit margin mentioned above, and lower operating expenses, which I will discuss in the next slide. We ended the quarter with a non-GAAP earnings per share of $0.55 compared to $0.63 in Q1 2021, mostly due to lower revenue which were negatively impacted by $133 million from exchange rate fluctuation. We see that our quarterly spend base declined by $257 million, or $183 million net of FX. Most of the decrease was due to a lower cost of goods sold, partially related to lower sales as well as to our ongoing efforts to transform our global operational network. Lower operating expenses also contributed to the decline in our spend base, mainly due to the ongoing active management of such expenses. These ongoing efforts are expected to help us partially mitigate the global macroeconomic headwinds, including inflation and higher cost of labor and eventually lead to stabilize our operating margin above the level of 27% in 2022, with the ultimate goal of 28% operating margin by end of 2023. In addition, we faced challenges due to timing of certain items related to our working capital as a result of operational ramp-up in relation to our annual production plan. Today, we are reaffirming our 2022 free cash flow guidance which we provided in February. However, we expect it to be further decline as we continue to make progress towards our 2023 target of being below 3x by the end of that year. Upcoming maturities include $1.4 billion in 2022, which will be covered by our liquidity and expected cash flow generation. I would like to inform you that we recently entered into an unsecured syndicated sustainability-linked revolving credit facility of $1.8 billion, replacing our existing facility. While we have experienced some recovery in many countries and products from effect of the global pandemic, we are unfortunately also seeing a strong foreign exchange headwinds affect our results. Therefore, we believe, at this time, it is prudent to adjust our guidance range for full year revenue from the original range of $15.6 billion to $16.2 billion to the new range of $15.4 billion to $16 billion. For our 2022 financials, operating income, EBITDA, earnings per share and free cash flow, we are reaffirming the range provided in February. We expect a gradual pickup in the second quarter following the first quarter, which is expected to be the lowest of our four quarters for sales and margins. As discussed earlier, we also still expect continued impact of foreign exchange fluctuations on our results. Firstly, on global opioid settlement, Kåre, I couldn't help notice that you seem to call out a more specific time line this time around for the first time, stating that you expect to see a settlement by the end of the year. You seem to have been mentioning a more specific time line for the first time, stating that you expect some progress by the end of the year. So I'll take the first question, and then Sven can comment on Humira in the U.S. and those elements. So on the opioids, you can see that we have been doing a number of settlements on a state-by-state basis so far and you can see that there are some common elements there in all the settlements, which, you could say, two main elements. One is, it's a combination of product that can benefit people suffering from substance abuse. And of course, the reason why we need to pay over a longer period of time is due to our balance sheet and the debt we just talked about. And the other thing is, of course, we can bring value to the table due to the fact that we are one of the biggest manufacturers of generics in the world, if not the biggest, and also in North America, we have generic Narcan, which can be used to help people if they overdose. And in conjunction with that, we, of course, also have ongoing negotiations on a nationwide settlement, and we also believe we're getting closer there. So, I'm slightly more optimistic on the time schedule now, and that's why I hope that we will see a nationwide settlement before the end of this year. So on the biosimilars for Humira, we have now a clear situation due to the settlement between Alvotech and AbbVie concerning the launch of this product. The product features themselves, I would say every single feature in itself is, of course, not a decisive factor, but it is the whole package of our product that makes it attractive. So it's citrate free, it's interchangeable, and its high concentration and it also has an attractive auto-injector. And what we know with the payer discussions is that payers very well, of course, analyze the features of each product offering coming to the market in July next year. The second one is, of course, to create pull-through in the market once you have the product in the market because this product launch will behave not like a classical generic launch in the U.S., but it has more features of a European branded generic launch. So, we are quite happy with the Alvotech, Humira biosimilar that we will launch next year. Please ask your question. Your line is now open. So, I wanted to get some additional thoughts from you, Kåre, regarding business development and M&A and specifically, the extent to which you're prioritizing the addition of brand assets. So first of all, of course, it will be nice to do some interesting M&A, but you've got to look at our balance sheet, and we don't really have any cash or significant debt capacity on our balance sheet. What you will see us doing, which is what we have been doing is, you could say, early stage in-licensing of interesting assets that we can take through development on our own all together with a partner. And that we will continue to do, of course, but you will not see us doing any major M&A transactions. We simply do not have the balance sheet for that as we speak, and that's with or without an opioid settlement. You could say M&A based on, you could say,  based on share capital is a theoretical option, not with our current ratios that would be value destroying for the shareholders. But cash-based acquisitions, no, that, you'll not see in the coming years. Those are the two areas where we have the most knowledge, and that's where we have our current portfolio. Please ask your question. Your line is now open. Lately, we've been seeing a lot more of the states from the -- that opted out of the agreements on a state-by-state basis. If you look at, you could say, Texas and Florida, then, of course, it's a -- all the deals are slightly different, but the key elements are that, of course, we see products in there, we see cash in there, we see a long payment period in there, and that's what we've been saying from the beginning. If you want to think philosophically about what has changed then compared to the nationwide settlement where the four other big companies, the three big distributors and J&J, they offered cash only. And of course, it goes hand-in-hand with the fact that we have the capability now of paying slightly more cash than we could some years ago. And if you sort of look at what we're doing right now with the individual states that we're settling, this is very much in line with what we would hope to do on a nationwide basis. I think actually, the consensus numbers for the U.S. are pretty close on a full year basis. It's correct that if you look at the quarters, as I showed you, then we had this big swing always between fourth quarter, first quarter due to the spec buying and the donut hole. And we're also seeing that this year, but we are reconfirming our AUSTEDO outlook of $1 billion. So -- and that is the way I remember it from different consensus as I've seen, that's pretty close to the consensus in the marketplace. Please ask your question. Your line is now open. I guess, first on the next set of guidance targets, I know you're going to give that later this year, but it seems like the past five years, we're kind of stabilizing the business, really focused on margin improvement. And I know we'll get more details later this year, but any color there would be appreciated. You're talking about this kind of 45-55 split for the year, which I think is a bit more back-end loaded than we typically see. I guess, how much of that ramp is tied to products where you have is a full clearly on approval and a more commercial execution related versus how much of that is tied to assets where maybe you're still waiting for approval. So if you think about what we will be communicating in terms of long-term guidance later sometime in the coming year, then you should really think about it as explaining the same plus more, I would say. So as I said before, we also want to give a target for continued margin improvement. But you're also right that, of course, we would also like to see the business returning into a growth mode with increasing revenues. So, I think you should expect -- you could say, more of the same with an addition would be the way I would phrase it by now. We also have a number of launches that we knew would happen, and that would have a positive effect, which are, you could say, date certain. And then we have, of course, an accumulated effect also of the progress -- ongoing progress of AUSTEDO, AJOVY and so on is doing very well, as you've seen in Europe, and we see very nice script numbers on AUSTEDO. And then, of course, we also have some launches in the U.S. where we don't have the actual approval yet. So maybe Sven, you can comment on some of the most exciting things that will happen in the rest of the year in the U.S. So for AJOVY, we expect a steady development that is based on improved market access and improved market share. For AUSTEDO, we see a pretty good development now with our key campaign and the patient activation in script count. In generics, of course, we had in the first quarter now a significant step down in Truvada and Atripla. We also had, as a reminder, last year in Q1, a loading effect for EpiPen because the approval of the COVID vaccine led to an EpiPen spike that we've seen in 2021. But for generics, the outlook, of course, is that we are not independent of the macro environment in the U.S. with the price deflation, but we have now launched Revlimid in March 2022, so just four weeks ago. The most important one for us is FORTEO, which would be also a significant contributor to our sales in 2022. So, the bottom line is that we expect a gradual development throughout the year and the buildup of revenues towards the end of the year. Please ask your question. Your line is now open. Perhaps for Eli, just wanted to ask a question around the operating profit impact from the reduction to your top line guidance, owing to currency, specifically, and then thinking about the combined impact of currency assuming that there is one combined with lower expected profit contribution from COPAXONE, which is not insignificant still. And then I had a follow-up question for you, Kåre, on the legal settlement provision this quarter. So, we still stick to what we said in February in terms of the margin, which means that according to our long-term financial targets with the baseline of '19 onwards to total t50 basis points up to the 28% OP, which is leading us to top this year as well, like 0.7% year-over-year on gross margin. And the flow-through will be going to OP, part of those, I would say, elements impacting our revenue. As you know, we're also operating in those countries that actually we are getting kind of less on the expenses. But because of our ongoing activities, mainly on COGS reduction and we see it quarter-over-quarter and the fact that we remove certain fixed costs, mainly with manufacturing footprint from our portfolio, and we see now kind of a benefit that already help us to offset those things. So, all in all, if you look on our current midpoint on the new guidance, we should land at the same more or less margin that we talked already in Q1, around 27.5% to 27.7% for the year. And on the legal provision, the legal provision for the opioid litigation is now at US$2.6 billion, which is an increase of 1.1 billion versus the last quarter. And it's really the result of a holistic assessment of what's the effect of the settlements we've done so far, what's the most likely, outcome based on our current negotiations. And of course, there's a lot of detailed factors in there, there's products in there of various volumes, there's cash in there over various periods and so on. Please ask your question. Your line is now open. Eli, if you can tell us what this $2.6 billion in provision for the opioid settlement, mean in terms of undiscounted dollars, essentially, there's some discounting assumption thrown in there about how long it will take to pay, but how much is kind of like the non-discounted dollar value it represents? So the first one, the CRL, I can't tell you all the details, but I can tell you it has nothing to do with, you could say, efficacy and safety. But it's to do with some details around how you could say the whole execution of the clinical trials have been done and some details there, which we are confident that we can address and correct and communicate, back to FDA within maximum six months. So, we still have high trust in the fact that we can get the product approved at the end of the day. I believe this is dependent on the market access strategy of payers, how they think about the switchover between AbbVie to the biosimilar offering. So of course, we are committed to come to market in 2023 in the summer and also to have a broad offering. Of course, one is the product feature, then the reliability of supplies of all the companies coming to market because that is a significant volume market in the U.S. And of course, AbbVie able to cover 100% of the volume, then it will be driven by, of course, attractive prices. And then, as I said, the experience and to create a pull-through in the market itself once you have contracted, and I think these four factors will define the market access strategy overall. And once we have the contracting right, at that moment -- only at that moment, we can say whether it is a material event for us in 2023 or in 2024. And of course, Ronny, I would say I would be disappointed if it's not a material event in '23 because, of course, we are aiming at launching for the settlement date. And we are happy, of course, that the Alvotech product is already being sold in Europe, so it's in the marketplace. On the last question to Eli, just inspiration for you, the settlements we've done, as you've seen, had basically nearly all of them being something like 13 or 15 years payment. So Ronny, you can understand that it's a very, I would say, detailed detail because there are certain layers on what we already settled and the rest of the things. But all in all, it's an average between 13 to 15 years. We're using our company WACC, and this one is kind of a discounting, but we need to understand that most of the discounting related to the cash and because of those players that we already settled a part of them already happening in the first years and part of the one that we didn't settle for longer years. And also, we need to understand that embedded their part of the fees and as well part of the element of the product. So -- but all in all, it's like between 13 to 15 years discounted the net of 2.6%. Please ask your question. Your line is now open. So, the operating margin expansion will primarily come from a combination of gross margin improvement and you could say, product portfolio improvement, but it's really basic product portfolio improvement. So, it's also improving the manufacturing cost of product families by consolidation. So, it's not that we're expecting a major shift, let's say, from generics to specialty. It's more the fact that we can, within all the product groups we have, keep on optimizing. As you know, last couple of years -- last four years, we moved from 80 manufacturing sites down to 50. So all in all, the majority of the benefit will come from gross margin improvements, and there will be limited improvements on, you could say, the commercial cost structure because that's relatively lean by now. If you then speculate how much improvement can you see, then it's my experience that when you haven't reached sort of the world-class situation on your manufacturing, then you can do something like 50 to 100 basis points per annum. On the AUSTEDO, maybe Sven, you can give some details on how we see AUSTEDO developing and why we are confident that we can meet the $1 billion sales guidance. Also when you harmonize over two quarters the sales to eliminate the effect of the spec buying and the donut hole in Q1 and Q4 of last year, we also see that the sales are absolutely on track with roundabout plus 32% over these two quarters. And for that reason, I'm quite confident that we can get to $1 billion sales from AUSTEDO in North America. And maybe we should just add in the sort of known fact that, of course, one of the key things driving increased scripts and volume for AUSTEDO is tardive dyskinesia. And right now, we are estimating that's significantly less than 10% of the population or the patients population suffering from tardive dyskinesia are getting therapy. So, there's a huge unmet potential among the 500,000 suffering from tardive dyskinesia in the United States. So there's a huge unmet medical need there, which we will be more than happy to, of course, satisfy. Please ask your question. Your line is now open. I'd just day that in general, when you talk about biosimilar products or for that matter, competing biologics, then, of course, it's always important to have some firm commitments on supplies. And you can see some patterns of course, in what's realistic to get when you have a multiplayer competitive situation. So our partner is here , they do the drug substance manufacturing and also the drug product manufacturing, and we are the commercial partner in the U.S. Humira, Alvotech is already approved in the European Union, and it will be launched before we come here to the U.S. market. There's, of course, also a plan about how volume will be ramped up over time for this product. So, that will be something that we would balance for the product launch next year, but we are quite confident that we will be in shape for this product launch. Of course, we had the spec buying effect in Q4 of last year, and then you always have an inventory, let's say, a reduction on the wholesaling channel in Q1 this year. In addition, there is the donut-hole effect that comes in, in January, February of this year, and that leads to the sales volatility of AUSTEDO. Yes, there was a Revlemid where we have a volume-based settlement, and you can correct me if I'm wrong, Sven, but the way I remember it, there's a volume limitation this year but also in '23 and '24. So, we'll probably see all-out competition in '25, and we'll see some, you could say, volume limitations for us in '23 and '24. It was a pleasure, and we'll see you next quarter."
}