{
    "symbol": "TEVA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 12:21:02",
    "content": " Revenues in the fourth quarter of 2022 were $3.9 billion, representing a decrease of 5% or an increase of 1% in local currency terms compared to the fourth quarter of 2021. The strengthening of the U.S. dollar versus other currencies during the fourth quarter of 2022, including hedging effects, negatively impacted our revenue and GAAP operating income by $270 million and $132 million, respectively, compared to the fourth quarter of 2021. We ended the quarter with a non-GAAP earnings per share of $0.71 compared to $0.77 in Q4 2021, mainly due to the negative impact from foreign exchange fluctuations and the lower gross profit, partially offset by lower operating expenses as well as lower tax rate. For the full year 2022, our total spend base declined by $690 million or $174 million net of FX, annual decrease in our spend base was due to a lower cost of goods sold related to a lower annual revenue as well as ongoing active management of operating expenses. And adding to Richard's comments about the complex generics of the U.S. generics business and our run rate, so the run rate was $3.75 billion in 2021 and $3.55 billion in 2022. Now if you look on the lower end, it's actually 1.7, part of the refinancing that we're planning in '23, actually planning to actually get a bit lower debt take for '23, '24 and '25 to the level of 1.7, 1.8 in order to make sure that we have enough cushions to drive the business mostly because of those developments that I mentioned. Now there is also a kind of element on revenue mix, and you can actually see that the -- with the growth of AUSTEDO and as well on AJOVY and a few other elements that we are actually working on, we're going to see a very modest increase but not more to the level of , I would say, in '23, which means that our ability to keep the current level on the OpEx will stay the same and the residual amount will flow through the OP margin."
}