{
    "symbol": "XNET",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 14:26:02",
    "content": " Specifically in third quarter of 2022, we realized $88.3 million in total revenue with a 12.8% quarter-over-quarter increase. Our subscription business delivered essentially stable performance and generated approximately $25 million in revenue, down 1.7% compared to last quarter, mainly due to the impact on the currency devaluation and a slight decrease in the number of subscribers, partially offset by higher average revenue per user, is reported in renminbi. Our live streaming and other Internet value-added services was the fastest-growing business line in the third quarter of 2022, accounted for approximately 38.8% of our total revenues in third quarter, surpassing cloud computing and membership subscription, which accounted for approximately 33% and 28.3%, respectively, of our total revenues. In the third quarter, our live streaming and other Internet value-added services reached a record level of $34.2 million in revenue with a 39.4% quarter-over-quarter increase. Total revenues were $88.3 million, resenting an increase of 12.8% from the previous quarter. Revenues from cloud computing were $29.1 million resenting an increase of 2.7%, from the previous quarter. Revenues from subscriptions were $25 million, representing a decrease of 1.7% from the previous quarter. Revenues from live streaming and other IVAS were $34.2 million, representing an increase of 39.4% from the previous quarter. Cost of revenues were $52.8 million, representing 59.9% of our total revenues, compared with $44.3 million or 56.6% of the total revenues in the previous quarter. Bandwidth cost is included in the cost of revenues were $25.3 million, representing 28.6% of our total revenues, compared with $25.5 million or 32.6% of the total revenues in the previous quarter. Research and development expenses for the third quarter were $16.4 million, representing 18.3% of our total revenues compared with $60 million or 20.4% of our total revenues in the previous quarter. Sales and marketing expenses for the third quarter were $5,8 million, representing 6.6% of our total revenues compared with $5 million or 6.4% of our total revenues in the previous quarter. G&A expenses for the third quarter were $8.2 million, representing 9.6% of our total revenues compared with $12 million or 15.4% of our total revenues in the previous quarter. The company estimates total revenues to be between $90 million and $95 million, and at the midpoint of the range represents a quarter-over-quarter increase of approximately 4.8%."
}