{
    "symbol": "XNET",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 20:06:02",
    "content": " In the first quarter, our total revenues reached $79 million, an increase of 11.1% compared to that of the previous quarter. We also made progress on our subscription business, which realized $25.3 million in revenue, an increase of 7% from the previous quarter. In the first quarter, our live streaming and other Internet value-added services made a significant improvement, too, which generated $23.5 million in revenue, an increase of 22.1% from the last quarter. For the fourth quarter of 2022, total revenues were $79 million, representing an increase of 11.1% from the previous quarter. Revenues from cloud computing were $30.2 million, representing a sequential increase of 7% as compared with $28.2 million in the previous quarter. Revenues from subscriptions were $25.3 million, representing an increase of 7% from the previous quarter. Revenues from live streaming and other IVAS were $23.5 million, representing an increase of 22.1% as compared with $19.2 million in the previous quarter. Cost of revenues were $43.9 million, representing 55.5% of our total revenues compared with $37.6 million or 52.8% of the total revenues in the previous quarter. Bandwidth costs, as included in cost of revenues, were $26.9 million, representing 34% of our total revenues compared with $22.8 million or 32.1% of the total revenues in the previous quarter. Gross profit for the first quarter was $34.9 million, representing an increase of 4.9% from the previous quarter. The increase in gross profit was mainly due to increased live streaming, cloud computing and subscription revenues. Research and development expenses for the first quarter were $16.3 million, representing 20.6% of our total revenues compared with $16.6 million or 23.3% of our total revenues in the previous quarter. Sales and marketing expenses for the first quarter were $5.3 million, representing 6.8% of our total revenues, compared with $6.6 million or 9.3% of our total revenues in the previous quarter. General and administrative expenses for the first quarter were $9.6 million, representing 12.2% of our total revenues, compared with $11.1 million or 15.6% of our total revenues in the previous quarter. The increase in gross profit was mainly due to increased live streaming, cloud computing and subscription revenues."
}