{
    "symbol": "XNET",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 12:36:04",
    "content": "  Fiscal year 2022 was a landmark year for Xunlei and we are thrilled to end the year with record setting revenues of $97 million, up 9.8% sequentially in the fourth quarter as compared with the previous quarter. In the fourth quarter, the revenue generated from live streaming and IVAS businesses reached $40.2 million, which accounted for 41.4% of total revenues representing 17.3% quarter-over-quarter growth and 108.6% year-over-year growth. In the fourth quarter, revenue generated from cloud computing business reached to $31.9 million, which accounted for 32.9% of total revenues, up 9.7% sequentially and 13.1% year-over-year. Revenues from live streaming and other IVAS were $40.2 million, representing an increase of 17.3% from the previous quarter. Cost of revenues were $59 million, representing 60.9% of our total revenues compared with $52.8 million or 59.9% of the total revenues in the previous quarter. Bandwidth costs as included in cost of revenues were $26.9 million, representing 27.7% of our total revenues compared with $25.3 million or 28.6% of the total revenues in the previous quarter. Research and development expenses for the fourth quarter were $19.2 million, representing 19.8% of our total revenues compared with $16.2 million or 18.3% of our total revenues in the previous quarter. G&A expenses for the fourth quarter were $9.8 million, representing 10.1% of our total revenues compared with $8.2 million or 9.6% of our total revenues in the previous quarter. Bandwidth costs as included in cost of revenues were $104.6 million, representing 30.5% of our total revenues compared with $80.7 million or 33.7% of the total revenues in the previous quarter. Research and development expenses for the year were $67.7 million, representing 19.8% of our total revenues, compared with $61.9 million or 25.8% of total revenues in the previous year. Sales and marketing expenses for the year were $24.8 million, representing 7.3% of our total revenues, compared with $24.6 million or 10.3% of our total revenues in the previous year. G&A expenses for the year were $39.7 million, representing 11.6% of our total revenues, compared with $36.9 million or 15.4% of our total revenues in the previous year."
}