{
    "symbol": "HTH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-22 14:31:01",
    "content": " Average loans at the bank increased $130 million in the quarter or 8% annualized, as both core commercial loans and retained mortgage balances increased. As such, credit quality improved with nonperforming loans declining by $7 million or 13% from the fourth quarter, and the net charge-off ratio to average bank loans was only 2 basis points. Total average deposits increased by $340 million or 3% quarter-over-quarter and by $1.4 billion or 12% year-over-year, largely due to growth from existing customers. With the expectation of higher interest rates in the near term, municipal and mortgage capital markets volumes were at historic lows and were responsible for almost the entire $26 million shortfall in income compared to prior year. Compared to prior quarter, our tangible book value per share did decline by $0.90 or 3%, as a result of a $120 million pretax increase in net unrealized losses within our available-for-sale investment portfolio. Net interest margin declined versus the fourth quarter of 2021 by 8 basis points to 236 basis points, driven primarily by the impacts of continued growth in excess cash levels and lower yields on loans HFI, which were somewhat impacted by lower accretion and PPP related fees and interest income. As a result of the 25 basis point increase in the federal funds rate during the first quarter, approximately $900 million of loans moved to or above their floor levels, and we expect these loans will begin to reprice to higher rate levels over the coming months. First quarter mortgage-related income and fees decreased by $167 million versus the first quarter of '21, driven by the evolving environment in mortgage banking, which moved quickly to a more purchase-focused market and reflected a more traditional cyclical pattern than we saw during the prior year period. Versus the prior year quarter, purchase mortgage volumes decreased by $150 million or 5%, and refinance volumes declined much more substantially decreasing by $2.3 billion or 69%. Other income decreased by $35 million, driven by primarily declines in structured finance lock volumes, which declined by $823 million or 43% and a challenging trading environment in fixed income services whereby revenues declined by $15 million versus the prior year period. Average HFI loans equated to $7.8 billion in the first quarter, increasing by approximately $200 million from the prior year levels. Michael, please go ahead. Michael, please go ahead. Matt, please go ahead. Matt, please go ahead."
}