{
    "symbol": "MTN",
    "quarter": 1,
    "year": 2022,
    "date": "2021-12-09 22:26:01",
    "content": " Pass product sales through December 5, 2021 for the 2021-2022 North American ski season increased approximately 76% in units and approximately 45% in sales dollars as compared to the sales for the 2019 2020 North American ski season through December 8, 2019, with pass product sales adjusted to include peak resorts pass sales in both periods. Driven in part by the 20% price reduction in passes for the 2021-2022 season, we expect that the total number of guests on all advanced commitment products this year will exceed 2.1 million, including all pass products for a North American and Australian resorts, representing an increase of approximately 700,000 pass holders from last year and an increase of approximately 900,000 pass holders from two years ago. For the full pass sales season, we saw a strong unit growth from renewing pass holders and significantly stronger unit growth from new pass holders, which includes guests in our database who previously purchased lift tickets or passes but did not buy a pass in the previous season, as well as guests who are completely new to our database. As announced on November 16, we have taken additional steps to prioritize the on mountain experience of pass holders this season, including limiting lift ticket sales during the three most popular holiday periods, deploying a new operating plan, which includes significantly improving how efficiently we load, lifts, and gondolas, launching a new daily forecast of lift line wait times and the EpicMix app, and investing in new lifts and expanded terrain to reduce wait times in order to ensure skiers and riders have an experience of a lifetime at our resorts this season. We are encouraged by our very strong pass sales heading into the season, our favorable first quarter results and the strong demand we are seeing across leisure travel and in our US booking trends, it's important to note that our growth in pass sales is expected to be partially offset by reduced lift ticket sales as we continue to successfully convert guests from lift tickets to pass products. As announced in September, we are excited to be proceeding with our ambitious capital investment plan for calendar year 2022 of approximately $318 million to $328 million across our resorts to significantly increase lift capacity and enhance the guest experience as we drive increased loyalty from our guests and continuously improve the value proposition of our advanced commitment products. We’re yes incredibly pleased with the results of our season pass sales I think it's important to remember that while we exceeded our expectations, a portion of the pass holders are coming from people who are already coming to our resorts and that we're moving them into an advance commitment. When we think about, there are significant benefits to our business, our employees, our communities, as well as the value we provide to guests and doing that, the second part of your question about the guest experience is obviously key to enabling all of those pass holders to have an experience of a lifetime, what you saw us do this past year is make some deliberate steps and investments and decisions that will enable that experience and I do think what I would anticipate over the next few years is that you will continue to see us do that specifically on capital investments, this year we have new terrain and new list. And then the follow-up is really going back to the, going back to the Seven Springs, and I know you've mentioned $15 million of EBITDA in fiscal 2023, and I think historically right when you make acquisitions and you bring the Epic Pass in there, it seems like it takes -- you get a bigger benefit a couple of seasons after that. And Seven Springs really hits all of the that we look at acquire and Seven Springs really hit all of the criteria we look for, particularly as it relates to our regional destinations, close to urban areas as I think Kirsten explain you know earlier and so I think you know when you look at it, from a scale perspective, you know it’s a sizeable resort, attracting guests from multiple major metropolitan areas, you know we think that just in year one, it'll generate $15 million I EBITDA which if you just do the multiple math on that is very attractive for us from the get go and as I described earlier, certainly with all of these deals, we certainly look to continue to expand the impact both from a guest experience perspective, but also financially and as you start to integrate resorts like this into the network. So we're very excited about it, both from the network perspective and also financially, I think the - I think that the - the question as to you know other acquisitions in North America, we absolutely think that there's additional opportunities for us as I think we've been quite clear with our expansion, both in terms of destination resorts and regional and urban resorts over time, we certainly believe that we have to be very, very selective as we look at that."
}