{
    "symbol": "MTN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-06-09 23:23:08",
    "content": " Overall, our results throughout the 2021/2022 North American ski season highlight the stability resulting from our advanced commitment pass products in a season with challenging early season conditions, staffing challenges and COVID-19 impacts and demonstrate our strong operational execution following the holiday period through the end of the season. Based on the strong finish to the season, particularly driven by destination guest visitation and lift ticket sales in Colorado, Utah and Whistler Blackcomb that exceeded our expectations, we now expect net income attributable to Vail Resorts for fiscal 2022 to be between $314 million and $348 million and resort reported EBITDA for fiscal 2022 to be between $828 million and $842 million. The guidance range includes an estimated $16 million of resort reported EBITDA for the Seven Springs Resorts for the period from the transaction closing on December 31, 2021 through the end of the fiscal year, partially offset by $7 million of acquisition and integration-related expenses associated with the Seven Springs Resorts transaction and the expected acquisition of Andermatt-Sedrun. Following a rapid acceleration of growth in our advanced commitment strategy over the last two years that nearly doubled the number of guests in advanced commitment products, we are very pleased with the results for our spring season pass sales to date with strong unit growth over the record pass sales results we had last spring. Pass product sales through May 31, 2022, for the upcoming 2022/2023 North American ski season increased approximately 9% in units and approximately 11% in sales dollars as compared to the period in the prior year through June 1, 2021. Pass sales dollars are benefiting from the 7.5% price increase relative to the 2021/2022 season, largely offset by the impact of the growth of Epic Day Pass products, including our new lower-priced Epic Day Pass offering. As part of this strategy, we are focused on continuing to offer pass products with access across our network of resorts, including our lower-priced resorts to continue bringing more guests into our advanced commitment products. It is important to highlight that the continued growth of our pass sales creates significant stability for our business and validates the compelling network of resorts, guest experience and value that our advanced commitment products provide for our guests. This past season, approximately 72% of all Vail Resorts 2021/2022 North American skier visitation was on a pass product, excluding employee and complementary visitation, which compares to approximately 60% and approximately 51% for the 2018/2019 and 2014/2015 North American ski seasons, respectively, creating stability through the company through variable weather, travel patterns and other challenges. We are committed to consistently increasing capacity through lift, terrain and food and beverage expansion projects and are making a significant onetime incremental investment this year to accelerate that strategy with our ambitious capital investment plan for calendar 2022 of approximately $315 million to $325 million across our resorts, excluding onetime investments related to integration activities, employee housing development projects and real estate-related projects. We plan to spend approximately $9 million on integration activities related to the recently acquired Seven Springs resorts, including onetime investments related to integration activities and $3 million associated with real estate-related projects, our total capital plan is expected to be approximately $327 million to $337 million. Including our calendar year 2022 capital plan, Vail Resorts will have invested over $2 billion in capital since launching the Epic Pass, increasing capacity, improving the guest experience and creating an integrated resort network. That's a pretty big commitment to make and the value proposition and the price point that we're offering in exchange for that behavior is very -- at least as the early indicators, which show based on our results last year, and our spring results that, that is a very compelling proposition for our renewing pass holders and also as we acquire new pass holders, whether those new pass holders are moving from a lift ticket last year or they used to be a pass holder or they used to be a lift ticket holder they're brand new to our network of resorts."
}