{
    "symbol": "MTN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-28 21:26:07",
    "content": " The strong performance was driven by the stability from our advanced commitment pass products with approximately 72% of skier visitation at our North American resorts coming from pass holders who committed in advance of the season, strong destination guests visitation, including demand for lift tickets, and an improved guest experience from January through the remainder of the season, demonstrating strong underlying demand for the experience at our resorts. Our Australian resorts experienced record visitation, driven by strong demand following two years of COVID-19 related disruptions, continued momentum and advance commitment pass sales following the addition of Hotham and Falls Creek in April of 2019, and favorable early season conditions that continued throughout the quarter. Through September 23, 2022, North American ski season pass sales increased approximately 6% in units and 7% in sales dollars as compared to the period in the prior year through September 24, 2021, including sales for the Seven Springs Resorts in both periods and adjusted to eliminate the impact of foreign currency by applying an exchange rate of $0.76 between the Canadian Dollar and U.S. dollar in both periods for Whistler Black pass sales. These results are particularly strong, considering the company achieved growth of approximately 42% in units and 17% in sales dollars last year through September 17, 2021, compared to the prior year through September 18, 2020, including sales to the Seven Springs Resorts in both periods. The strongest product growth was from Epic Day pass products are attracting new pass holders who are lower frequency guests into advanced commitment products, including the new tier of products launched in 2022-2023 with access to select regional and local resorts. Pass sales dollars continue to benefit from the 7.5% initial price increase and subsequent incremental price increases relative to the 2021-2022 season, largely offset by the mixed impact of the growth of new pass holders into Epic Day pass products, including our new lower price Epic Day pass offerings. Our employee investment of approximately $175 million to return to full staffing levels and operational footprints, along with our expected capital investment of over $300 million in calendar year 2022 are expected to further elevate the guest experience this season and increase the capacity of our resorts. We are committed to consistently increasing capacity through lift, terrain, and food and beverage expansion projects and are on track to complete 18 new or replacement lifts across 12 resorts, in advance of the 2022-2023 North American ski season as part of our one time incremental investment this year to accelerate that strategy, which will meaningfully increase lift capacity at those lifts locations. We now expect our capital plan for calendar year 2022 to be approximately $323 million to $333 million, including one-time investments in real estate related projects, $4 million related to the addition of Andermatt-Sedrun, and integration activities associated with the Seven Springs Resorts. In addition to the $10 million of cost deferred from calendar year 2022, the Company expects to incur approximately $20 million in additional costs related to the Park City and Keystone lift projects, which is included in our calendar year 2023 capital plan.\" We expect our capital plan for calendar year 2023 to be approximately $180 million to $185 million, including $2 million of maintenance capital for Andermatt-Sedrun and excluding $1 million of one-time investments related to integration activities and $10 million of deferred capital associated with the Keystone and Park City projects. Hi, good afternoon, everyone. And I think importantly, this year, as we look to return the business to full staffing, and our full operating capacity to really focus on the guest experience, we're also doing that in a way that's very focused on the discipline across our P&L, and how we're going to drive the most revenue growth with that full operating capacity, but also investing where we need to, to ensure the sustainability of our workforce and the investments that we want to make in the employee side. Hi, good afternoon, everyone. And yeah, that's going to be very much the focus is both how we can invest to improve the resort, and how we can partner with ASA in the base area, and yet deliver the guest experience in the next few years, and certainly start to introduce our Epic pass holders to the resort, which will be a great opportunity for our guests. Highlighting though, for all of you, the drivers of why we're able to grow 6% on top of 42% unit growth, is this combination of strength that we see in our renewing pass holders, in particular those first time pass holders that just joined last year, which to me, I take as a really great validation of the guest experience, the resort network, the investments, we're making, the value that we have. Hi, good afternoon, everyone. I noted earlier that we do have strong renewals overall, that includes on Epic and Epic Local, and that when you think about the product line, and how we're going to capture the majority of new people coming in incrementally to the pass program, their total addressable market that is remaining tends to be the lower frequency skiers, or the skiers that are skiing at lower price point resorts in our portfolio."
}