{
    "symbol": "MTN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-03-14 20:25:05",
    "content": " Resort net revenue for the second fiscal quarter of 2022 decreased 2% relative to the comparable period in fiscal year 2020, primarily as a result of the headwinds in our ancillary lines of business, and approximately $33 million of past revenue that would have been recognized in the second fiscal quarter of 2022, but was deferred to the third quarter as a result of delayed openings for a number of our resorts. Given the significant impacts of COVID-19 in the prior year period, including significant capacity restrictions that limited skier visits and ancillary revenue, we're also providing metrics relative to the comparable fiscal year 2020 season-to-date period, which was prior to our announcement to close our resorts on March 15, 2020, for the remainder of the 2019, 2020 season. Despite significant growth of our pass program this year, visitation for the season-to-date period was modestly up 2.8% compared to fiscal 2020 given the Company's strategy to shift lift ticket guests into an advanced commitment past product. The outperformance is partially offset by the challenging U.S. destination and international visitation trends at Whistler Blackcomb, the $20 million investment in frontline staff bonuses, increased wages for our summer operations and the inclusion of an estimated $6 million in acquisition and integration-related expenses specific to the Seven Springs resorts. The updated outlook for fiscal year 2022 assumes normal conditions and operations across our resorts for the remainder of the ski season and no incremental travel or operating restrictions associated with COVID-19 that could negatively impact our results, including for our Australian resorts in the fourth quarter. We are pleased to announce a significant investment in our employees for the 2022, 2023 North American ski season with an increase in the minimum hourly wage offered across all 37 of our North American resorts to $20 per hour for all U.S. employees and CAD20 per hour for all Canadian employees as well as an increase in wage rates for hourly employees as we maintain all leadership and career stage differentials. The increase in wages and the return to normal staffing levels will represent an approximately $175 million increase and expected labor expense in fiscal 2023 compared to the fiscal 2022 expected labor expense, including inflationary adjustments. As previously announced on September 23, 2021, we are excited to be proceeding with our ambitious capital investment plan for calendar year 2022 of approximately $315 million to $325 million across our resorts, excluding onetime investments related to integration activities, employee housing development projects and real estate-related projects. Including our calendar year 2022 capital plan, Vail Resorts will have invested over $2 billion in capital investments since launching the Epic Pass, increasing capacity, improving the guest experience and creating an integrated resort network. Returning our ancillary business to normalized levels would result in estimated incremental resort reported EBITDA of approximately $75 million in fiscal 2022 which includes the incremental revenue and operating expense associated with normal capacity, but excludes incremental labor expense. One, the capital investment of over $300 million into lift and specifically addressing capacity at the resorts as well as the terrain expansion, and then the other investment, which is in staffing because our business is very much tied to talent and our employees to deliver that incredible guest experience."
}