{
    "symbol": "SEVN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 18:13:03",
    "content": "  Operator: Good morning, and welcome to the Seven Hills Realty Trust Second Quarter 2022 Earnings Conference Call. In just a moment, they will provide details about our business and our performance for the second quarter of 2022. First, I would like to note that the recording and retransmission of today's conference call is strictly prohibited without Seven Hills Realty Trust's prior written consent. These forward-looking statements are based on Seven Hills' beliefs and expectations as of today, Thursday, July 28, 2022, and actual results may differ materially from those that we project. In addition, we will be discussing non-GAAP numbers during this call, including distributable earnings, distributable earnings per share, adjusted distributable earnings, adjusted distributable earnings per share and adjusted book value per share. For a reconciliation of GAAP to non-GAAP financial measures, please see our quarterly earnings release, which is available on our website, sevnreit.com. Good morning, everyone, and welcome to the second quarter earnings call for Seven Hills Realty Trust. Last night, we reported a solid quarter, highlighted by strong year-over-year earnings growth and continued execution on our plan to fully invest Seven Hills' capital. We continue to advance our key priorities focused on fully deploying our capital to nearly $1 billion in assets, increasing and diversifying our capital base and increasing returns to our shareholders. At the same time, we are closely monitoring the ongoing macroeconomic changes related to rising inflation, higher interest rates and recessionary concerns. Commercial lenders of all types, including banks and life insurance companies, have reduced advance rates and credit spreads have widened in the secondary market for CMBS and CLOs. As a result, CRE transaction volume has moderated as buyers and sellers adjust to this new environment of higher rates and lower leverage. Despite the choppy conditions, we believe the industry remains well positioned to face this volatility and alternative lenders like Seven Hills will continue to see attractive opportunities to deploy debt capital. We closed on $60 million of high-quality loan originations, bringing our production for the first half of the year to more than $150 million and increasing our committed capital to $735 million, which represents a threefold increase in our loan book compared to a year ago. Distributable earnings per share increased 85% year-over-year to $0.24 per share, reflecting the continued expansion of our loan portfolio. To put this into context, 1-month term SOFR at the end of the second quarter was approximately 170 basis points, and it is projected to be approximately 330 basis points at the end of the year. Our manager, Tremont Realty Capital, originated 2 new loans for approximately $60 million of committed capital and funded an additional $5 million of follow-on fundings. The loans carry a weighted average spread of 322 basis points and a weighted average loan-to-value of 68%, indicating our continued focus on underwriting quality assets with attractive yields. We ended the second quarter with 28 first mortgage loans, with an aggregate commitment of $735 million, representing approximately 7% growth in Seven Hills' loan book on a sequential quarter basis. In aggregate, the portfolio has a weighted average loan-to-value of 68% and a weighted average maximum maturity of 3.6 years when including extension options. Credit quality remains a top priority, and we feel very good about the quality of our loans and their risk-adjusted returns. During the quarter, we upgraded 3 loans driven by progress on the underlying business plans, which has resulted in increased debt yield and debt coverage. Since the beginning of the year, we've improved our mix of property types reducing our exposure to office by 800 basis points to 40% and increasing our mix of multifamily loans by 10 percentage points to 29%. Our favorite property types remain multifamily and industrial, while select retail, office and hospitality opportunities continue to present themselves as well. We have a steady pipeline with compelling transactions with which to grow our asset base, including 2 loans under applications totaling $70 million, which we expect to close during the third quarter subject to our final diligence. We believe we are well positioned to navigate the current uncertain economic outlook, and we remain confident that our strategy will generate higher risk-adjusted returns for our shareholders. In addition, our manager recently demonstrated further commitment to our platform, increasing its equity ownership of Seven Hills to approximately 12% during the second quarter. Yesterday afternoon, we reported GAAP net income of $4.6 million or $0.31 per share during the second quarter. As a reminder, our GAAP earnings include purchase discount accretion related to our merger with Tremont Mortgage Trust last fall, which amounted to $1.6 million or $0.11 per share. On a sequential basis, this represents a 14% increase compared to adjusted distributable earnings per share of $0.21, after excluding $0.16 of prepayment income in the preceding quarter. Interest income from investments was $8.9 million, an increase of 24% sequentially, excluding $2.4 million of prepayment income during the prior quarter. In April, we further optimized our balance sheet by upsizing our non-mark-to-market facility with BMO Harris Bank to $150 million raising our maximum borrowing capacity to more than $800 million. With respect to interest rates, short-term rates have risen considerably year-to-date and are likely to increase further. While this has increased our cost of capital, rising rates are a benefit for us since all of our assets and all of our funding liabilities are floating rate. Interest rate floors on all of our loans are currently below term SOFR or LIBOR as the case may be, positioning Seven Hills to improve net interest margin as rates rise. All of our loans are structured with risk mitigation mechanisms such as cash flow sweeps, interest reserves and rebalancing requirements to help protect us against investment losses. As of quarter end, our portfolio weighted average rate cap strike stood at 245 basis points, which provides substantial support to our borrowers' debt service coverage. We also underwrite our loans with conservative forward view of rates and their impact on future debt service coverage, cap rates and collateral value. Earlier this month, we announced our quarterly dividend of $0.25 per share. Yes, we've seen some -- we've seen pressure on cap rates, obviously just given there's still a disconnect rate between buyers and sellers out there, and we're seeing that as we bid on transactions. I would -- depending on the property types that we're looking at, I would say that anything that has any of the single tenant-type transactions have seen a wider cap rate expansion. But keep in mind that the cap rates that we're seeing on the multis and in the value-add industrial deals, those buyers are typically looking at their exit, and they're looking at their IRR versus their spot cap rate when they're buying the transaction, right, because there's typically a significant value-add play. But as a general rule, we have certainly seen those widen -- it's probably 25 basis points at this point, and we expect that there's going to be continued pressure on that going forward. So while the pipeline has moderated by no means has it slowed down to the point where it's below, where it was prior to the run-up at the end of '21. So on the pace of deployment, I think it was the last call, you talked about possibly reaching $1 billion in assets at some point this summer. Chris, I think we're being -- like everybody, I think we're being a little more diligent right now just given the price discovery that we continue to see in the market. The -- as Doug mentioned, we've got about $140 million to fully invest. Thank you, Joe, and thank you, everyone, for joining us today and for your continued interest in Seven Hills Realty Trust."
}