{
    "symbol": "SEVN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 07:43:04",
    "content": "  Operator: Good morning, and welcome to Seven Hills Realty Trust's Third Quarter 2022 Financial Results Conference Call. First, I would like to note that the recording and retransmission of today's conference call is strictly prohibited without Seven Hills Realty Trust's prior written consent. These forward-looking statements are based on Seven Hills beliefs and expectations as of today, Thursday, October 27, 2022, and actual results may differ materially from those that we project. In addition, we will be discussing non-GAAP numbers during this call, including distributable earnings, distributable earnings per share and adjusted book value per share. Good morning, everyone and welcome to the third quarter earnings call for Seven Hills Realty Trust. Tiffany brings more than 20 years of accounting experience, including 15 years in public accounting as well as various corporate finance and accounting leadership roles within The RMR Group and other public companies. Last night, we reported another solid quarter of earnings growth, supported by continued investment activity, along with the growing benefit of rising interest rates on our floating rate loan portfolio. During the quarter, distributable earnings per share increased 13% on a sequential quarter basis. Our quarterly distribution of $0.25 per share was well covered, and total committed capital increased to more than $760 million. The credit quality of our portfolio remains strong with all of our loans current at debt service, and our weighted average risk rating remains below 3. We continue to closely monitor the ongoing macroeconomic landscape in the capital market volatility, driven by the Fed's aggressive increases in short-term interest rates this year. While these rising rates provide favorable tailwinds for floating rate lenders such as Southern Hills, the rising cost of capital put pressure on debt covenant ratios and underwriting standards across the CRE debt markets, weighing on commercial mortgage securitizations and real estate values. And while our lending partners continue to fund our loans, credits for us have widened for new loans due to the scarcity of balance sheet capacity. To maximize net interest income, we may temporarily make unlevered loans with the plan to add leverage as the market conditions improve. In September, we closed a $47 million loan secured by an industrial property and a strong submarket of Northern New Jersey. During the quarter, we received $19.5 million of repayment proceeds from our retail loan in Coppell, Texas. In addition, late last week, we received a $22.5 million repayment of an unlevered loan on a retail property in Los Angeles. As of September 30, Seven Hills portfolio consisted of 28 first mortgage loans with total commitments of $763 million, representing a 45% increase compared to a year ago. Despite the market backdrop, our portfolio is performing well and we feel very good about the quality of our loans and their risk adjusted returns. In aggregate, the portfolio has a weighted average loan-to-value of 68% and a weighted average maximum maturity of 3.5 years when including extension options. At the end of the third quarter, our total loan portfolio consisted of 39% office, 28% multifamily, 19% retail and 14% industrial. While we have a pipeline of $500 million of potential transactions, our lending activity over the rest of the year will largely depend on capital availability and the overall market environment. Our general focus remains consistent with our recent production, favoring multifamily and industrial loans to middle market institutionally backed sponsors. We currently have a $24 million loan under application for the acquisition of an industrial property, which we expect to close next month, subject to our final due diligence. Additionally, we have an accepted term sheet for acquisition financing of an additional industrial property with a respective loan balance of $26.5 million. Seven Hills generated distributable earnings, or DE, of $3.9 million or $0.27 per share. On a sequential quarter basis, this represents an increase of approximately 13% compared to DE of $0.24 per share in the previous quarter. Despite our continued growth, our stock is trading at approximately a half of our September 30th adjusted book value of $18.80 per share. We believe that we have a tremendous opportunity to reduce this discount as we continue to execute our business strategy, invest in accretive loans and further demonstrate the strength of our lending platform to the investment community. We ended the quarter with approximately $506 million drawn on our secured financing facilities and unused, but available capacity of $176 million. We continue to increase our debt-to-equity ratio to 1.9 times from 1.7, and we had $76 million of cash on hand at quarter end. As it relates to interest rates, Seven Hills earnings should continue to benefit in the quarters ahead from anticipated future increases in short-term rates. While higher interest rates raised our cost of capital, 100% of our assets are floating rate. And as of the end of the third quarter, none of our loans had active interest rate floors. In terms of sensitivity, one month's term over at the end of the third quarter was approximately 300 basis points and is projected to be 440 basis points at the end of the year. As a reminder, all of our loans are structured with risk mitigation provisions such as cash flow sweeps, interest reserves and rebalancing requirements to help protect us against possible investment losses. As of quarter end, our portfolio weighted average cap was approximately 260 basis points, which provides substantial debt service support for our loans. We also underwrite our loans with a conservative forward-looking view of interest rates and their impact on future debt service coverage, cap rates and collateral value. Earlier this month, we announced our regular quarterly dividend of $0.25 per share. Looking ahead, we expect that our run rate earnings will continue to benefit through the end of the year and into 2023 from further increases in interest rates and from additional investments we plan to make with our available capital. So, we're seeing some stress in offices in larger cities as return to office has been a little slower than most hoped, but you guys aren't -- you don't lend in those larger cities. What we are seeing for new transactions where offices has a very high bar, and it's not necessarily a product type that we're looking to expand upon, I will tell you that we do see in transactions generally that we're looking at where tenants are -- they are reducing space as leases come due, given kind of the work-from-home dynamic and they are certainly concerned about an ongoing -- if we get into a recession, that's another compounding effect on top of office. We have a couple of our sponsors now are looking to exit our loans through sales, which is -- which I think is telling that they have strong assets, and there is demand for that. But as far as looking for new transactions, office is not really high on the list for us at the moment, just given the overall dynamics of the office market, regardless of which particular market you're in. We do have capacity to write new loans, which we will continue to do, as we said, kind of on a measured basis. And payoffs, we anticipate in 2023 may slow, because some sponsors will opt to extend those loans that qualify rather than going to the sales market. And then, as far as leverage, Tiffany can speak to that, but we do anticipate increasing our leverage from the current -- from our current 1.9% going into 2023 as we deploy more capital. Given where things are in the market, we feel like that's a conservative range, but we still are looking to further lever up our loans. And from our perspective really we would prefer to put our capital to work to grow the asset base of the firm, right, and put that capital to work generating returns from our loan book. Share repurchases, given our float and that we're thinly traded, it's probably been at the best use of our capital from our perspective. So, we're seeing cap rates on long-term single tenant lease transactions, right, those are probably moving more than some of the value-add transactions. However, there has been continued pressure on cap rates, and we think there will be continued pressure on cap rates really until there's more clarity as to what the Fed is going to do long-term and where that's going to shake out. I mean, it's important certainly, but they're really looking at their exit and the IRR over the hold of that loan."
}