{
    "symbol": "DELL",
    "quarter": 1,
    "year": 2023,
    "date": "2022-05-26 21:37:11",
    "content": " CSG also delivered a record Q1 with revenue of $15.6 billion, up 17% on top of a strong prior year comp of 20% growth. The net of strong commercial performance, peripheral growth and disciplined cost management with strong profitability, the business delivered an op-inc margin of 7.2%, and we have delivered roughly $1 billion of op inc or better over the last seven quarters. As Jeff highlighted earlier, we delivered record Q1 revenue of $26.1 billion, up 16%, driven by strong growth in both CSG and ISG. As we look at the balance of fiscal year '23, we're watching a few macroeconomic dynamics, including the geopolitical environment, inflation, interest rates, slowing economic growth, currency and continued COVID impacts disrupting supply chains and business activity. While we believe these macro dynamics will have some impact on overall IT investment spending, with what we know today, our updated framework has revenue growth of approximately 6% with both CSG and ISG growing for the year and earnings per share growth faster than revenue in the range of 12% or better. There's a rotation right now of budgets from client to infrastructure, and that's across the board in our portfolio, whether it's our fifth consecutive overall growth in ISG, our sixth consecutive quarter of server P&L growth for this question, 9% storage revenue growth after four consecutive quarters of demand growth. We did see that driven by, I think, the strong performance in the client business, particularly the commercial business, also the strong storage growth that we saw, a 9% revenue growth. I think at an individual business unit level, as we think about clients that -- we should see a bit more commercial client in the quarter coming from the elevated backlog, but that's going to have some headwinds on cost as we talked about in pricing. If you think about our performance now six quarters in a row of server growth and the shortage of parts and servers as customers are working to build out on-prem, to build out their digital transformation, as Chuck said, build out their multi-cloud infrastructure and certainly our architecture and strategic drive to be at the center of that, customers continue to come to Dell because our commitment to delivery date is pretty darn high. Obviously, part of our view that we would see moderating growth this year coming off a 27% growth in CSG last year is we're lapping some pretty strong compares in second half performance."
}