{
    "symbol": "CCJ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 11:32:02",
    "content": " We expect an enhanced ability to compete at a time when the western nuclear fuel cycle needs to provide reliable and secure uranium conversion, enrichment, fabrication parts and service solutions to nuclear power plants that are absolutely critical in dealing with todayâ\u0080\u0099s dual energy and climate crisis. With a long-term contract portfolio like Camecoâ\u0080\u0099s, we expect Westinghouse to not only be well positioned to compete for growing nuclear demand, but also well protected from any current macroeconomic headwinds as utility customers run their critical nuclear power plants. From an industry perspective, we are providing investors with upstream exposure to valuable and strategic mining and milling assets, downstream exposure to valuable and strategic fuel service assets, and ultimately leverage to improving prices and the growing cash flows and earnings that come from responsible long-term contracting across the nuclear fuel cycle. But youâ\u0080\u0099re asking a longer term question, which is a good one and that is as we have success building that contract book as we resume production and obviously at some point get â\u0080\u0093 shed the last little bit of supply discipline and get to full capacity production at our Tier 1 assets, then it will be time to turn our attention to where that growth comes from. And if you look at it against what some of the trade reporters are saying, what Cameco is doing 91% of the term contracting in the market, obviously it means thereâ\u0080\u0099s more contracting going on than, than whatâ\u0080\u0099s being picked up by the trade press, which is good, which is going to be, I think, quite eye opening for those who have maybe been waiting in the contracting queue and thinking that they have a bit more time. We see a lot of opportunity ahead of us with the demand for safe, reliable, affordable, and carbon free base load electricity coming from across the globe as a strategic commercial supplier with a strong balance sheet, investments in long-lived Tier 1 assets across the fuel cycle, a proven operating track record, and line of sight to return to our Tier 1 cost structure."
}