{
    "symbol": "CCJ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 14:27:02",
    "content": " As a result, we have temporarily seen their focus shift from securing uranium to the more immediate need in their supply chain for enrichment and conversion services, where Russian capacity plays a much bigger role. Our strategy, which includes contracting discipline, supply discipline and financial discipline will allow us to achieve our vision, the vision of energizing a clean air world and thereby delivering long-term value in a market where demand for safe, secure, reliable and affordable clean energy is growing. It is as supply disciplined rates, of course, plus we have idled assets, but we have other assets outside that jurisdiction, we have an inventory for moments just like this, that inventory is located in Western markets, we have access to long-term purchase commitments that we have entered into that we could bring forward today in order to access material, we have licensed facilities that would allow us to borrow pounds if needed. But sort of a shock on the uranium side, it could take a bit longer for utilities to put in place all of that replacement service business, we are seeing obviously, the benefits on the conversion side, we can be strategically patient on the uranium side and the leverage for when that demand comes into the market. And once we see the services replaced, and confidence of the utilities, that they have got their enrichment lined up and excluding Russia, and they have got their conversion, we could actually see demand in the uranium side come in a far more concentrated fashion than would have been the case prior to February 24th. So in a world where conversion prices have hit historic levels, but letâ\u0080\u0099s remember conversion has more ability, more idle productive capacity that can come back to the market than I would say uranium or enrichment enjoy. We are not looking to just land volumes to bring back all of our supply at name plate production, because, we think prices have to adjust and reflect the need for Western supply, the need for Western supply in an inflationary market, the need for Western supply that has proven ESG performance. And on the commercial side, we are anxious to see what comes out of the numerous U.S. government initiatives to look at dealing with the bifurcation of the market and the current reliance on you Russian enrichment and conversion services, and the need to develop a supply of value to support the advanced SMR industry as a whole."
}