{
    "symbol": "WEYS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 13:05:03",
    "content": " Net sales for the fourth quarter of 2022 were $99 million, down 2% compared to last year's fourth quarter net sales of $101.4 million. Quarterly operating earnings rose to a record $15.1 million, up 18% compared to $12.8 million in the fourth quarter of 2021. Fourth quarter 2022 net earnings were $10.2 million or $1.06 per diluted share, compared to $10.3 million or $1.07 per diluted share last year. In the North American wholesale segment, net sales for the quarter were $75.5 million, down 6% from $79.9 million last year. Selling and administrative expenses were $20.5 million or 27% of net sales for the quarter compared to $17.5 million or 22% of net sales, last year. Operating earnings rose to $10.7 million for the quarter, up 14% over $9.4 million in last year's fourth quarter, due mainly to higher gross margin. Net sales in our North American retail segment were a record $14.2 million for the quarter, up 6% compared to $13.5 million last year. Selling and administrative expenses totaled $5.9 million or 41% of net sales for the quarter compared to $5.6 million or 42% of net sales last year. Retail operating earnings were $3.3 million in the fourth quarter of both 2022 and 2021 as higher sales were offset by lower gross margins and higher expenses this year. Other net sales were $9.2 million, up 16% compared to $8 million in the fourth quarter of 2021. Consolidated net sales for the full year were a record $351.7 million, up 31% compared to $267.6 million in 2021. 2022 net earnings were a record $29.5 million or $3.07 per diluted share, up 44% compared to $20.6 million or $2.12 per diluted share in 2021. North American wholesale net sales were a record $283 million in 2022, up 38% compared to $205 million in 2021. Wholesale operating earnings reached a record $32.6 million in 2022, up 68% over $19.5 million in 2021, due mainly to higher sales and gross margins this year. In the North American retail segment, net sales were a record $36.7 million in 2022, up 16% compared to $31.6 million in 2021. Retail, selling and administrative expenses were $18.1 million or 49% of net sales for the year compared to $14.3 million or 45% of net sales last year."
}