{
    "symbol": "RPM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-05 15:37:06",
    "content": " Consolidated adjusted EBIT for the quarter was $157.3 million, a decrease of 21%, which was in line with our outlook, and was a result of continued material wage and freight inflation, as well as supply chain disruptions that were exacerbated by Hurricane Ida at the beginning of the second quarter, and increased our conversion costs. During the second quarter of fiscal 2022, three of our four operating segments Construction Products Group, Performance Coatings Group and Specialty Products Group generated strong double digit sales growth. While our construction products and Performance Coating Group generated strong adjusted EBIT growth, the speciality products and consumer group faced extreme supply chain constraints that put pressure on their earnings. The consumer group continued to experience inflationary pressures, as well as shortages of key raw materials driven largely by last year's production outage at a key resin supplier that negatively impacted conversion costs. Adjusted EBIT decreased 29.4% due to higher raw material and conversion costs from supply disruptions as well as unfavorable product mix, particularly in our disaster restoration equipment business, which has been hindered by the semiconductor chip shortage as Frank had mentioned. As Rick mentioned in his opening comments, the consumer group also faced a challenging comparison to the prior year period when sales increased 21.4% and adjusted EBIT increased 65.8% due to extraordinarily high demand for its home improvement products during the first phase of the pandemic. In spite of these challenges, we expect to generate double digit consolidated sales growth in the fiscal 2022 third quarter versus last year's record third quarter sales, which increased 8.1%. So I don't know how likely we are to be showing the 8% or 10% unit volume growth in the 20% revenue growth and growing, but certainly for the next couple of quarters, you'll see out of the non-consumer segments, which you referenced, the same type of strength that we've seen that with better leverage the bottom line. And as we get into next year, hopefully you'll be seeing better flow through improved supply chains and in that case, pretty significantly disrupted performance results in the quarters in fiscal 22 and consumer. We're back on track in two of our three businesses already, which is Construction Products and Performance Coatings, and which need to get through these supply disruptions and supply chain challenges. And so, seeing where that settles out in terms of demand, and consumer is the area where I think we have the least visibility, just because once we can get the supply chain disruptions in place, we should have really strong performance for a period of time if for no other reason to get inventory levels at our customers in our own shop, back to normal levels."
}