{
    "symbol": "RPM",
    "quarter": 1,
    "year": 2022,
    "date": "2021-10-06 13:29:05",
    "content": " For the first quarter of fiscal '22, 3 of our 4 operating segments, our Construction Products Group, Performance Coatings Group and Specialty Products Group generated solid sales and adjusted EBIT growth. Due to the supply disruption, we lost the equivalent of nearly 300 production days across RPM facilities around the globe during the 2022 first quarter, more days that were lost due to COVID-related shutdowns in last year's first quarter. On a consolidated basis, our sales increased to a record $1.65 billion, up 2.7% over a strong fiscal 2021 first quarter, which grew 9.1%, largely due to the unprecedented demand for our Consumer Group's home improvement products during the pandemic. Our consolidated adjusted EBIT of $206.8 million decreased 23.2% due to supply chain challenges, inflation and the Consumer Group's tough comparison against the prior year. On Slide 8, you'll see that sales recovered at our Performance Coatings Group as they increased at nearly all of its major business units, partially aided by comparisons to last year's first quarter once pandemic restrictions did not allow contractors on work sites and poor energy market conditions led to deferrals and industrial maintenance spending. During the first quarter of fiscal 2022, this segment experienced a negative sales impact of roughly $100 million from production outages due to supply constraints and disruptions. However, the Consumer Group's fiscal 2022 first quarter sales were 12.3% above pre-pandemic levels of the first quarter of fiscal 2020 and in spite of the negative sales impact from supply chain challenges during the current year. In addition, we faced another difficult comparison to the prior year when sales on a consolidated basis increased 6% and adjusted EBIT increased nearly 30%, driven by a 66% increase in the Consumer Segment's adjusted EBIT. Moving forward, we intend to maintain the positive momentum created by our operating improvement program as we complete its remaining projects, such as the one plant closure completed during Q1 of F '22, leverage resources across RPM to manage supply chain issues and meet customer demand, identify new opportunities for efficiencies through our continuous improvement culture and make investments in growth opportunities, including capacity expansions."
}