{
    "symbol": "RPM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-25 14:54:09",
    "content": " Our Construction Products Group generated fourth quarter record net sales of $745.9 million, up 18.5% compared to the fiscal 2021 fourth quarter. Our Performance Coatings Group fiscal 2022 fourth quarter net sales were a record $329.4 million, an increase of 16.3% over the year-ago period. Adjusted EBIT increased 37.3% to a record $42.6 million in the fourth quarter of fiscal 2022, driven by volume growth, selling price increases, revenue growth leveraging good product mix and operational improvements. The Specialty Products Group reported record net sales of $225.8 million for the fourth quarter of fiscal 2022, an increase of 11.4% compared to the fiscal 2021 fourth quarter. SPG's adjusted EBIT was a record $44.2 million in the fiscal 2022 fourth quarter, an increase of 21.8% compared to adjusted EBIT of $36.3 million in last year's quarter. Our Consumer Group achieved record net sales of $682.8 million for the fourth quarter of fiscal 2022, an increase of 8.6% compared to the fourth quarter of fiscal 2021. Fiscal 2022 fourth quarter adjusted EBIT was $80.3 million, an increase -- a decrease of 14.2% compared to adjusted EBIT of $93.6 million reported for the prior year period. Based on these factors, we expect to generate fiscal 2023 first quarter consolidated sales growth in the mid-teens over last year's record first quarter sales. It is likely that the consumer group will generate the highest growth of the four segments due to; Number one, selling price increases that should allow it to catch up with inflation; number two, improved alkyd resin supply; and number three, investments made in new capacity and continuous improvement initiatives. I will tell you that the demand continues to be strong, and we feel pretty good about the literally, hundreds of billions of dollars that came from the American rescue plan in February of '21, and the $1.9 trillion infrastructure bill, at least $800 billion of which will go into real hardcore infrastructure, both of which bodes well for the dynamics in the markets that our Construction Products Group and Performance Coatings Group serve and again, those are principally driven in the United States. Silicones have been the primary largest year-over-year, up hundreds, a couple of hundred percent in terms of costs and our Construction Products Group, silicone polymers are up 211% versus last year in the fourth quarter. Our Construction Products Group just missed, and it just missed is -- if you would just -- impact, we're about equal to record margins of last year's fourth quarter. And so we have a higher level on a relative -- raw material inventory than we've ever had and then in certain other places, the other thing that's strange is and again not unique to RPM, we would have the largest chunk of something, we have relative little of which is whip and so you can products like in our Legend Brands business or in some -- in our Construction Products Group or Consumer Group that are partially finished and in the case of Legend Brands, literally waiting for a chip or batches that are partially completed, but waiting for a key element. Lastly, I'd say that the cooperation and communication across our businesses post-MAP to Growth in a center-led approach across many functions, but particularly in manufacturing and operations, makes it possible and it's working -- really wasn't, and it's working exceptionally well to be sharing manufacturing assets and so that is definitely a shared manufacturing asset. And so as I commented earlier by segment, I would expect us to see mid- to high single-digit unit growth in Construction Products Group and Performance Coatings Group qualified by any raw material availability challenges, which might pop up again, both for our products and/or components that are on projects -- construction projects that were a part of that might hold things up."
}