{
    "symbol": "U",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 20:05:12",
    "content": " Create delivered a very strong first quarter, with $116 million in revenue, an increase of 65% from last year's first quarter. For the second quarter, we expect revenue of $290 million to $295 million, representing growth of 6% to 8% from last year's second quarter, which was our strongest quarter last year with 48% year-over-year growth. So when I look at sort of like the cadence of growth that's implied by the new guidance, assuming it kind of accelerates as we move through the year, it's something maybe like from $295 in 2Q, maybe adding $50 million and maybe $100 million in 3Q and 4Q to get to the high-end of the full year guide just round numbers. The other part that we continue to strengthen together is the work between, that Operate has been doing and what they call Unity Game Services, where it's not just the Monetization side but also the other areas around analytics around voice and multiplayer around sort of cloud content and delivery that ties in very deeply into both the creation and in the long-term operation. One of the things that I've seen, is if I go back to five years ago, and I mentioned this before I talked to my first person into working on this business three years ago, I'd show up with a customer and we'd get handed off to a relatively junior person in the organization and three engineers, one of whom has a kid that programs in Unity, they're just curious to meet us. So what we see is there's a very common pattern, where these companies want to ingest the huge amounts of data that they have in 3D, which by the way can in many cases be much larger than the content even in large games, in terms of polygons, in terms of meshes or point cloud data, when they're looking at sort of what they have. And so, the 3D capability to be able to transform from kind of static creation at the front end of a process, through every phase of creation, whether it's simulation, management, configuration, all the way to the end user following the exact same pattern that we've seen in games, which is customers want access to thing across the screens that matter for them, whether that's a PC, a laptop or a mobile phone or MDR."
}