{
    "symbol": "U",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 20:35:25",
    "content": " And so thereâ\u0080\u0099s not a significant impact in our Q1 from the market share gains weâ\u0080\u0099re seeing, but we are expecting to gain market share in Q1 and throughout the year, which is why we were confident in predicting growth for the business for the year. Itâ\u0080\u0099s â\u0080\u0093 essentially, what weâ\u0080\u0099re trying to say is weâ\u0080\u0099re seeing starting in the middle of last year, a stable market for the advertising business. And so thereâ\u0080\u0099s a lot of work that Tomer on the growth side and Mark on the create side are working to drive synergies between the platforms, in terms of how we go to market and how we bring customers onto our platform, we think thatâ\u0080\u0099s going to pay a lot of dividends over time. Now the second thing weâ\u0080\u0099re doing now is we are engineering in â\u0080\u0093 for example, supersonic indoor editor to make it an easy platform for our customers to take their products directly to market without ever leaving the environment. Thereâ\u0080\u0099s a lot of places where the tool set, whether itâ\u0080\u0099s Luna or itâ\u0080\u0099s supersonic or itâ\u0080\u0099s parts of LevelPlay and the integration and where it shows up into the mix, where our customers are going to take advantage of a more performant platform for them to create, to publish user require or monetized directly. Again, which is why weâ\u0080\u0099re emphasizing right now, what weâ\u0080\u0099re seeing is really strong consumer engagement in games, really strong pipeline outside of games and Create, stabilization in the ads business based on strong consumer engagement and slightly weaker eCPMs, which is typical of a recessionary period around which you some â\u0080\u0093 we recover at some point. So youâ\u0080\u0099re going to see another effort on the nongaming where weâ\u0080\u0099re really trying to monetize our customers much better, and that includes subscription businesses, that includes consumption business models and really better â\u0080\u0093 getting more of the value that weâ\u0080\u0099re creating for our customers. What I wonâ\u0080\u0099t do for you on this call is in conversations that are in flight to close around those products this year to tell you who weâ\u0080\u0099re talking to, but itâ\u0080\u0099s the likely suspects that you would expect, but we donâ\u0080\u0099t preannounced deals that weâ\u0080\u0099re now in the process of negotiating. we think itâ\u0080\u0099s better for our market share overall, although we think thatâ\u0080\u0099s why, weâ\u0080\u0099re looking at the exact customers coming over and our migrations that our engineering teams are implementing."
}