{
    "symbol": "CFR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 18:37:03",
    "content": " Now taking a closer look at the quarter, loan growth was solid and above our long-term expectation of high single-digit annual growth, average loans, excluding PPP in the fourth quarter were just over $17 billion compared with average loans of $15.4 billion in the fourth quarter of 2021, an increase of 10.6%. We booked $2.2 billion in new commercial commitments in the fourth quarter, and this is up by a non-annualized 9% from the third quarter and demonstrated our staff success from our calling and prospecting efforts earlier in the year. Average deposits in the fourth quarter were $44.8 billion, an increase of more than 9% compared with the $41 billion in the fourth quarter of last year. And for the full year 2022, average total deposits were $44.6 billion, up 15.9% over 2021, and Jerry will talk more about recent deposit trends in his comments. Average consumer loans were $2.3 billion in the fourth quarter, up by 22.6% over the fourth quarter last year. Problem loans, which we define as risk grade 10 and higher, totaled $322 million at the end of the fourth quarter compared with $387 million at the end of the previous quarter and $691 million a year ago. The total investment portfolio averaged $20.1 billion during the fourth quarter, up $727 million from the third quarter average as we continue to deploy some of our excess liquidity during the quarter. We made investment purchases during the quarter of approximately $1.2 billion, which included $735 million in Agency MBS securities with a yield of 5.43% and $470 million in municipal securities with a taxable equivalent yield of about 5.38%. The taxable portfolio, which averaged $12 billion, up approximately $534 million from the prior quarter had a yield of 2.41% up 21 basis points from the prior quarter, impacted by the higher yields on recently purchased Agency MBS securities. Our tax-exempt municipal portfolio averages about $8.1 billion during the fourth quarter, up about $193 million from the third quarter and had a taxable equivalent yield of 4.17%, up 8 basis points from the prior quarter. On a linked-quarter basis, average deposits were down $1 billion or 2.3% with about half of the decrease coming from demand deposits and half coming from interest-bearing deposits. Total combined deposits and customer repos in the fourth quarter averaged $48.3 billion, up $571 million from the prior quarter. Insurance commissions and fees were down $1.5 million or 11.2% from the third quarter as a result of lower life insurance commissions, which were down $706,000 and also impacted by our normal business cycle. Regarding total non-interest expenses, total non-interest expense was up $23.4 million or 9.1% compared to the third quarter. The increase in other non-interest expense of $13.3 million was impacted by higher fraud-related losses up $4.7 million, $4 million related to a licensing negotiation and marketing and advertising up $2.7 million, which is typically higher in the fourth quarter."
}