{
    "symbol": "CFR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 17:02:11",
    "content": " Average loans, excluding PPP in the second quarter were $16.5 billion or 13.2% higher than the average loans of $14.6 billion in the second quarter of 2021. Average deposits in the second quarter were $44.7 billion, an increase of 16.9% compared with the second quarter of last year. We made investment purchases during the quarter of approximately $1.8 billion, which included about $1 billion in treasury, yielding about 3%, $400 million in agency MBS securities with a yield of about 4% and about $400 million in municipal securities with a taxable equivalent yield of about 4.7%. The taxable portfolio, which averaged $10.3 billion, up $1.3 billion from the prior quarter at a yield of 2.04%, up 14 basis points from the first quarter. Our tax-exempt municipal portfolio averaged about $7.8 billion during the second quarter, down about $363 million from the first quarter and had a taxable yield of 4.04%, up 1 basis point from the prior quarter. Excluding the impact of PPP loans, the average growth in the prior quarter would have been $446 million or 2.8%. Please proceed with your question. Please proceed with your question. So, I think that if I were you, I would stick with my full year guidance and then just kind of take the next two quarters, but really donâ\u0080\u0099t want the slide to cheese too thin, and Iâ\u0080\u0099ll just kind of speak to that full year guidance, it says just look at 2021 and grow that on a low double-digit growth, and I think youâ\u0080\u0099ll kind of be kind of what weâ\u0080\u0099re projecting currently based on what weâ\u0080\u0099re seeing. Please proceed with your question. So if you look at cash to average earning assets, it finished the quarter at about 27%, you put another $3.2 billion of cash in the bonds it feels like by the end of the year, it could be closer to 20% or so. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}