{
    "symbol": "CFR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 18:56:03",
    "content": " Consumer deposits grew nearly $1 billion in the quarter, giving us a 20% year-over-year increase and loan demand has picked up on the consumer side helping us grow loan balances by a little over 7% year-over-year and helping to set the stage for the launch of our mortgage product later this year. Our tax exempt municipal portfolio averaged about $8.2 billion during the first quarter, down about $200 million from the fourth quarter, with a taxable equivalent yield of 4.03%, up 2 basis points from the prior quarter. So it looks like the amount of securities that you’re going to repurchase is clearly higher than I think the $7 billion that you talked about last quarter, obviously, the rate hikes appear to becoming a little bit more intense and a little faster than expected. I’m going to say, looking at kind of where we’re going from here is that we’d probably be talking something closer to a 20% Beta on – and let me grab my notes here just to make sure that I’m giving you the right information. I don’t think we are – we’d be foolish to project a 20% growth year-over-year, although I probably said that last year, and we still had 20%. Yes, I think we talked a little bit about in the quarter – last year’s quarter that on a TE basis, full year growth I think it’d be in the high – higher than the mid-teens but not 20% sort of range is kind of what I’m thinking, given on our current assumptions with the rate hikes, obviously, the December hike doesn’t do much for us at all. Please proceed with your question. For the first quarter, we really didn’t have a whole lot of coming off I think we had just $300 million. And I think the blended rate there was $35 million as I look at kind of what we’re going to see through the rest of the year, I don’t see any really significant maturities that I would feel that we would want to call out. Please proceed with your question. I think our loans there like, I don’t know, $1.5 million, which is not bad in four months, but – and you look at what is in this case, it is a more consumer-oriented more of a house top location, whereas we typically tend to go to a more where you have got a lot more concentration of businesses since that’s more wheelhouse. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}