{
    "symbol": "CFR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 19:02:11",
    "content": " Average loans, excluding PPP, in the third quarter, were $16.75 billion or a 13% higher level than the average loans of $14.82 billion in the third quarter of 2021. We booked about $2.04 billion in new commercial commitments in the third quarter, and this was up 12% from a year ago and down 7% from the second quarter. Average deposits in the third quarter were $45.8 billion, an increase of 17% compared to the third quarter of last year and up 9.6% on an annualized basis over the previous quarter. Average consumer loans were $2.1 billion in the third quarter, up by 15.9% over the third quarter last year and up an un-annualized 6.9% compared to the previous quarter. The favorable rate of problem resolutions that we began seeing late last year via payoffs, payments and upgrades continued through the third quarter totaling $381 million to date. You may remember that in our second quarter conference call, I reported that we had achieved our goal of mid-single-digit concentration level in the energy portfolio, and Iâ\u0080\u0099m happy to report that we stuck to our goal with energy loans excluding PPP, representing 5.4% of loans at the end of the third quarter. We made investment purchases during the quarter of approximately $2.2 billion, which included about $790 million in treasuries, yielding about 3.15%, $840 million in agency MBS securities with a yield of about 4.62%, and about $520 million in municipal securities with a taxable equivalent yield of about 4.85%. The taxable portfolio, which averaged $11.5 billion, up $1.2 billion from the prior quarter had a yield of 2.20%, up 16 basis points from the prior quarter. Our tax-exempt municipal portfolio averaged about $7.9 billion during the third quarter up about $113 million from the second quarter and had a taxable equivalent yield of 4.09%, up 5 basis points from the prior quarter. The linked quarter growth in deposits has come primarily from growth in average interest-bearing deposits, which were up $921 million or 14% on an annualized basis. Insurance commissions and fees were up $1.4 million or 11.7% from the second quarter as a result of higher life insurance commissions, which were up $600,000 and also impacted by our normal business cycle, which results in higher commissions on both P&C and Group Benefits in the third quarter versus the second. I think that youâ\u0080\u0099ll just see that if you guys kind of put that out there trajectory-wise, youâ\u0080\u0099re going to see that if Iâ\u0080\u0099m giving you guidance that I would expect the fourth quarter to increase, it really blows that low 20% growth out of the water."
}