{
    "symbol": "DIS",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-08 20:29:01",
    "content": " Excluding certain items, our companyâ\u0080\u0099s diluted earnings per share for the first fiscal quarter of 2023 was $0.99, a decrease of $0.07 versus the prior year as continued strength at our Parks, Experiences and Products business was more than offset by a year-over-year decline at our Media Entertainment and Distribution segment. Turning to Parks, Experiences and Products, we are thrilled with the results we achieved this quarter with operating income increasing 25% versus the prior year to over $3 billion, reflecting increases at our domestic and international parks and experiences businesses. At domestic parks and experiences, significant revenue and operating income growth in the quarter was achieved despite purposefully reducing capacity during select peak holiday periods by approximately 20% versus pre-pandemic levels in order to prioritize the guest experience. Moving on to our Media and Entertainment Distribution segment, operating income in the first quarter decreased by over $800 million versus the prior year, driven by year-over-year declines across direct-to-consumer, linear networks and content sales, licensing and others. Disney+ core ARPU decreased by $0.19 versus the prior quarter, driven by an unfavorable foreign exchange impact and a higher mix of subscribers to our multiproduct offerings, partially offset by a benefit from the recent domestic price increase, which occurred towards the end of the first fiscal quarter. Total domestic affiliate revenue in the first quarter increased by 1% from the prior year, driven by 6 points of growth from contractual rate increases, partially offset by a 5-point decline due to a decrease in subscribers. International channels operating income decreased versus the prior year due to lower advertising revenue and unfavorable foreign exchange impact and a decrease in affiliate revenue, partially offset by a decrease in programming and production costs. First, recall that domestic Linear Networks operating income increased in Q1 versus the prior year, benefiting from the timing of costs under a new agreement for the NFL and a timing impact for CFP. And at content sales, licensing and other operating results decreased versus the prior year by $114 million as higher theatrical results were more than offset by lower TV/SVOD operating income, higher overhead costs and a decrease in home entertainment operating income. Forward-looking statements are subject to a number of risks and uncertainties, and actual results may differ materially from the results expressed or implied in light of a variety of factors, including economic or industry factors, execution risk including in connection with our organizational structure and operating changes, cost savings and efficiencies, workforce reductions and DTC business plans relating to content, future subscribers and revenue growth and profitability."
}