{
    "symbol": "KLTR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 10:42:10",
    "content": " Important factors that could cause actual results to differ from forward-looking statements can be found in the Risk Factors section of Kalturaâ\u0080\u0099s annual report on Form 10-K for the fiscal year ended December 31, 2021 and other periodic SEC filings, including the quarterly report on Form 10-Q for the quarterly period ended June 30, 2022 to be filed with the SEC. Today, we reported total revenue for the second quarter of 2022 of $42 million, up 1% year-over-year and subscription revenue of $38 million, up 4% year-over-year. In the second quarter, we resumed sequential growth across a number of metrics, including total revenue, subscription revenue, ARR and RPO and saw leading indicators such as conversion of longer cell cycle deals, sales force productivity and new subscription bookings which we believe supports an expected increase in growth in quarter four. In summary, while it has been a challenging year for the tech world, video industry and Kaltura, weâ\u0080\u0099re encouraged to enter the second half of the year with increased booking levels, a fully commercialized event platform and new self-serve products on the way and a more nimble and agile organization that we believe will bring us back to profitable growth. Total revenue for the second quarter ended June 30, 2022 was $42 million, up 1% year-over-year. Within our EE&T segment, total revenue for the second quarter was $30.4 million, up 1% year-over-year. Within our M&T segment, total revenue for the second quarter was $11.6 million, up 2% year-over-year. Within our EE&T segment, gross profit for the second quarter was $20.7 million, representing a gross margin of 68%, down from 70% gross margin in Q2 2021. Within our M&T segment, gross profit for the second quarter was $6 million, representing a gross margin of 52%, up from 42% gross margin in Q2 2021. In summary, as Ron mentioned, our outlook reflects an expected to return to growth in the fourth quarter of this year, in line with our regional focus of acceleration during the second half of this year, albeit a little delayed within the second half because of this year unforeseen macro circumstances. So taking the two line items of the revenue continue to accelerate and at the same time, save at least $18 million on an annual basis, we believe that next year, adjusted EBITDA is going to be in the 1-digit, and we will do our best to take it as close to the breakeven. And that, coupled with the fact that as mentioned, the adjusted EBITDA profitability of a single digit, hopefully mid-single digit next year and the breakeven on the cash thatâ\u0080\u0099s going to come after and specifically in the second half of this year, being at that single-digit cash, I think puts us in a different place, and we are looking forward to that."
}