{
    "symbol": "KLTR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 12:53:15",
    "content": " Important factors that could cause actual results to differ from forward-looking statements can be found in the Risk Factors section of Kaltura's annual report on Form 10-K for the fiscal year ended December 31, 2021, and other periodic SEC filings, including the quarterly report on Form 10-Q for the quarterly period ended September 30, 2022, to be filed with the SEC. Today, we reported total revenue for the third quarter of 2022 of $41.1 million, down 4% year-over-year and subscription revenue of $37.9 million, up 1% year-over-year. An expected return to revenue growth in Q4, fueling a higher year-over-year growth rate in 2023, expected gradual quarterly improvements in adjusted EBITDA towards a single-digit loss next year, and an expected significant improvement in cash flow with a forecasted single-digit aggregate cash flow from operations loss in the second half of this year. After a tough year that saw an initial quarterly decline in subscription and total revenues, followed by close to flat revenues we are forecasting for Q4, a sequential revenue growth rate at a level that we have not seen since the first half of last year. Total revenue for the third quarter ended September 30, 2022, was $41.1 million, down 4% year-over-year. So one, we're still seeing, of course, the devaluation of the euro and that continues to affect us because we have a fair bit of our revenue coming from the euro, and that's affecting our financials in Q3 and also Q4 and earlier. Obviously, you need to take also the growth that's going to happen from the top line even if you take just the current run rate of the revenue for this quarter and take it with no additional bookings, net booking, then you get to a very similar growth rate for next year, but we believe that the number will be higher, which will help us to balance the expense base. The second, on NDR and Yaron addressed our gross retention that indeed has always been good and continued and is even better this past quarter and that there's a gap and the impact between that because NDR looks trailing 12 months looks at historical gross retention, but also looks at the comp here being a tough year with COVID and also looks at FX. And by the way, if you look at the numbers that are looked there, given the guidance range we've put, it kind of turns it into a record quarter in the sense of revenue because at the beginning of the year, we had it down because of the single customer and then flat because of the behavior of this year, some downs and flats depending if you look at subscription in total, now it's coming up and guided to be actually a top record revenue quarter compared to Q3 the year before, which was a last record. Also, I'm not sure what's going to happen with the currency exchange it for the last 3 or 4 quarters, had a negative impact on us due to the fact that we have pretty significant part of our revenue coming, especially by the way, media and telecom coming from Europe and Europe started 115 a year, now it's around 1."
}