{
    "symbol": "WOLF",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-17 18:44:11",
    "content": " Given the positive momentum we're seeing and the progress that we've made from all the accomplishments Gregg spoke about earlier, we expect to exit this calendar year on a $1 billion revenue run rate and expect to generate more than $1 billion in revenue in fiscal 2023. So when you look at that increase in capacity, including we talked about potentially an additional fab after Mohawk Valley, we talked about more materials -- a second materials facility that we might need as well, when you think about all of those things, that would be required and we have talked about this before, roughly kind of 2:1 kind of CapEx to revenue ratio. Yes, as it relates to capacity, one of things to think about pretty much entirely the change in the revenue out in '26 â\u0080\u0093 change in revenue is related to power devices so we're seeing that just a lot higher. Obviously, with the design-in numbers that we've seen, we're making a lot of commitments to our customers I think having capacity for both the fab and then, of course, materials and substrates that support that fab is important. And I would say thank goodness, we stuck to netting on that thing and continue to process despite the fact that we had a global pandemic happening because we're able to open that fab in April of this year, and now we've got material flowing, we'll have full flow material going through that fab by the end of this calendar quarter and then ramping initial production by the end of this fiscal year. I would say the fact that we're talking about additional wafer fab capacity being required, there's obviously a sign that Mohawk Valley isn't going to be enough in the out years. It's going to have to run through the fab and if you look at the capacity in a factory and like I said before, we're talking about $1.5 billion to $2 billion of revenue potentially out of Mohawk Valley even at the high end of that range, we'd be running up against some pretty heavy utilization numbers at that point. We'll leverage that as much as we can, but I think what that tells us we're going to need additional fab capacity even beyond Mohawk Valley in Durham and then secondly, we're going to need additional materials factory and likely somewhere outside of our current Durham site right now, we're going to need additional capacity for a second material site. Just trying to get a sense for -- I know on the fiscal 2026 target increase here, it's mostly device, but do you anticipate kind of seeing continued demand on the LTAs for the wafers and did that also drive some upside in the out years as you get new capacity online. I think all of that gives us good confidence between the demand and the supply improvement as well as what we're seeing that will ship out of Mohawk Valley, some good confidence in terms of executing revenue to the kind of $1.5 billion 2024 target. So, we have a lot of customers that have said, I can't get silicon, so why don't I take the opportunity to have our designers redesign the systems and move to a more efficient silicon carbide-based system where you've got a company out there that has stuck a shovel in the ground 2.5 years ago and is now bringing our capacity today. The one thing that I would say is we've we have been pretty direct with our customers, especially on large opportunities where if they've made a choice to go with somebody else as a primary source, we'd love to be that primary source and that's an area that we're obviously focused on -- but we basically don't have the bandwidth right now to be an alternative source for any of these opportunities. We've got capacity that's in limited supply, and we want to focus our capacity where customers have kind of gone and put a lot of the chips on the table on our side of things and chasing something down as an alternate source, whether that's through pricing or what have you is something that's not really in our quiver right now."
}