{
    "symbol": "WOLF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-04 20:27:10",
    "content": " Aside from key partners and customers, top policymakers have also come to the site to see firsthand how the new fab will help drive the auto industry's transition from internal combustion engines to electrified powertrains and support innovative power management solutions for the industrial and energy industries. Our third quarter non-GAAP earnings exclude $52.2 million of expense net of tax or $0.42 per diluted share for noncash stock-based compensation, acquired intangibles amortization, accretion under convertible notes, project transformation transaction costs, factory optimization start-up costs and other items outlined in today's earnings release. The progress we've made at the Mohawk Valley fab, paired with another record-setting design-in total for the quarter, demonstrates how Wolfspeed is expanding its market-leading position and driving the transition to silicon carbide devices in the automotive and industrial end markets. Well, first of all, as we said previously, right now, the cost structure in Durham at 150-millimeter is lower than what you're seeing Durham versus what we would expect as we start going on 200-millimeter running out of Mohawk Valley. And so when you think about 45% of those customers over the last 3 -- 45% of those opportunities over the last 3 years that are designed in have now moved into initial production ramp, that's actually quite astounding from my perspective. On the CapEx side of things, I mean, I know you alluded, but just doing that math out, does seem like if Mohawk's $1.5 billion at full capacity or roughly speaking, you're going to need more soon. But I think we'll wait until we get a better view on that going forward to give you kind of an update on what that total picture would look like, probably sometime later in this calendar year, and that's what we're kind of looking at right now. Some just want to have relationships, but it's -- they definitely learned from this past 2 years that having a connection with key players in the semiconductor industry, and I think especially in the compound semiconductor industry and silicon carbide, is going to be a real key thing for them going forward. So I'd like to ask you, so now that the Mohawk Valley fab is up and running, that's the first 200-millimeter fab in the world for silicon carbide, I was wondering how you see the 200-millimeter ecosystem developing globally."
}