{
    "symbol": "WOLF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-26 19:06:13",
    "content": " Our second quarter non-GAAP earnings exclude $78.1 million of expense, net of tax, or $0.67 per diluted share for non-cash stock-based compensation, acquired intangibles amortization, accretion on our convertible notes, project transformation and transaction costs, factory optimization start-up costs, loss on debt extinguishment and other items outlined in today's earnings release. It's that device revenue, where we're seeing the momentum -- and what I would say is there's three things that are really kind of driving all of this. Now we won't be fully utilized from a 4-wall perspective in that time frame, and we laid out kind of that $2.1 billion kind of revenue target plan, but that is something -- that's clearly the factory has opportunity to move above that. I wanted to understand how long would it take for you given the demand dynamics you're seeing to be able to get to a utilization that you consider acceptable, let's say, breakeven cash breakeven profitability, whatever metrics you use -- and then when you talk about four-wall capacity, I want to understand, there must be room, I suppose, for additional lines to go on. If we could bring that up, I think we're -- as we bring that up and probably not even at full utilization, the first 50%, I think we're in pretty good shape in terms of the fab in terms of the profitability and the capability it's going to be bringing to us. I think a lot of customers are telling us, they're seeing a transition from 400, maybe some 400 transition some of the earlier models that they maybe designed in previously, but anything really new that's coming online is predominantly 800-vol. Yes, and then in terms of the revenue outlook Ed, I think you're right, I think first of all, I think our aspirations and what we can do in the Durham are probably higher now as we're seeing some of the performance over the last several months since we put new leadership into the factory."
}