{
    "symbol": "NH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 18:45:17",
    "content": "  Robert Jaffe: Welcome, everyone, and thank you for joining us today to discuss NantHealth's 2022 second quarter financial results. On the call today are Ron Louks, Chief Operating Officer; and Bob Petrou, our Chief Financial Officer. The company's discussion today will include forward-looking information reflecting management's current forecast of certain aspects of the company's future, and actual results could differ materially from those stated or implied. In addition, during the course of this call, we refer to non-GAAP financial measures that are not prepared in accordance with U.S. generally accepted accounting principles and may be different from non-GAAP financial measures used by other companies. Investors are encouraged to review NantHealth's press release announcing its full 2022 second quarter financial results for the company's reasons for including those non-GAAP financial measures in its financial results announcement. Good afternoon, everyone, and welcome to NantHealth's 2022 Second Quarter Financial Results Conference Call. We reported total revenue of $16.5 million, the third consecutive quarter of top line growth. As you will hear in a moment, during the quarter we continued to launch new products, enhanced existing ones, and with regard to our Eviti Connect for autoimmune disease program, we continued to roll out new drugs and new drug regimens. In the second quarter, Eviti Connect for Oncology won the Spring Digital Health \"Connected Digital Health Merit Award\", in recognition of the product's credibility and relevance of content and design. In May, we won the MedTech Breakthrough \"Healthcare Insurance Innovation Award\" in recognition of the platform's ability to break through digital health and technology markets. In June, we won the Spring Digital Health \"Connected Digital Health Merit Award\" from the Health Information Resource Center, which honors the world's best health resources created for consumers and health professionals. We added a new line of business with a major health care payer and strategic partner, which along with two other lines of business, is expected to go live in the second half of the current year. And we added new capabilities to NaviNet's Open Authorizations, including the ability to collect situational patient information as part of a prior authorization submission, making it easier for health plans to meet state and regulatory requirements. We released OpenNMS Horizon 30, which introduced advancements that help organizations detect anomalies and changes in network traffic, ensuring that networks stay healthy and bandwidth-related issues are promptly identified. Also, we continue to roll out new drugs and new drug regimens for Eviti Connect for Autoimmune Diseases product and expect to launch the IVIG treatment soon. With that overview of our business, I'll turn the call over to Bob to discuss our financial results in more detail. For Q2 2022, total revenue was $16.5 million compared with $16.1 million in the prior year second quarter. Gross profit for the quarter was $9.2 million, which is a slight increase from $9.1 million in the same quarter last year. Gross profit percent was 55%, down from 56% this quarter last year. For Q2 2022, net loss from continuing operations was $12.5 million or $0.11 per share. On a non-GAAP basis, net loss from continuing operations in Q2 2022 was $11.4 million, or $0.10 per share. Finally, cash and cash equivalents were approximately $5.7 million at June 30, 2022, which is compared with $16.1 million at March 31, 2022. Usage of cash was approximately $10.4 million, which was driven by interest payments, labor expenses and other working capital needs."
}