{
    "symbol": "NH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 07:04:04",
    "content": "  Robert Jaffe: Welcome everyone and thank you for joining us today to discuss NantHealth's 2022 Third Quarter Financial Results. In addition, during the course of this call, we refer to non-GAAP financial measures that are not prepared in accordance with US Generally Accepted Accounting Principles and may be different from non-GAAP financial measures used by other companies. Investors are encouraged to review NantHealth's press release announcing its full 2022 third quarter financial results for the company's reasons for including those non-GAAP financial measures in its financial results announcement. Good afternoon everyone and welcome to NantHealth's 2022 third quarter financial results conference call. We reported total revenue of $16.6 million, the fourth consecutive quarter of top line growth. In October, we secured a three-year contract extension with a large national commercial insurer that provides coverage to over two million of their Medicaid members across multiple states. Our existing customer, Maryland Physicians Care signed a two-year renewal agreement, ensuring it continues to receive a unique and tailored solution for its member with auto -- for its members with autoimmune diseases and we added to Eviti Connect, a new capability that it allows payer clients to comply seamlessly with state-mandated preferred drug list. This initial deployment has been completed with further roll outs planned in the current fourth quarter, and we added new platform functionality to speed up prior authorization process. To sum up, revenues increased for the fourth consecutive quarter and gross margin of around 58% was high since the fourth quarter of 2020. During the third quarter and thus far into the fourth, we signed multiple renewal agreements and contract extensions, some of them include additional products and services. With that overview of our business, I'll turn the call over to Bob to discuss our financial results in more detail. For Q3 2022, total revenue was $16.6 million, compared with $14.4 million in the prior year third quarter. Year-to-date revenue for 2022 was up approximately 6% from the same period last year at $49.5 million versus $46.6 million. Gross profit for the quarter was $9.7 million, which is an increase from the $7.5 million in the same quarter last year. Gross profit percent was 58%, up from 52% this quarter last year. Year-to-date gross margin for 2022 was up approximately 9% from the same period last year, which is mostly tied to the increase in revenue. Total operating expenses increased to 28.3% and $23.9 million from $18.6 million in the prior year third quarter. For Q3 2022, net loss attributable to NantHealth was $13.7 million, or $0.12 per share. This compared with $10.8 million, or $0.09 per share in the prior year third quarter. On a non-GAAP basis net loss from continuing operations in Q3 2022 was $14 million, or $0.12 per share is compared with $11.5 million, or $0.10 per share for the third quarter of last year. Finally, cash and cash equivalents were approximately $0.6 million at September 30, which is compared with $5.7 million at June 30, 2022. Usage of cash was approximately $5.1 million, which was driven by normal working capital needs."
}