{
    "symbol": "FRGE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 21:32:18",
    "content": " At a recap full-year of 2022, in fiscal year 2022, Forge's total revenue less transaction-based expenses was $68.9 million, down from $125 million a year ago, driven by lower trading volumes, which we primarily attribute to macroeconomic and geopolitical instability. Your line is now open. Your line is now open. So I'm seeing really interesting things right now and we've described in previous calls that some percentage of our trades are roper required trades and some trade through funds like SPVs that a significant portion of actual finalized trades may be delayed for 30-plus days, while the market -- even if the market data has indicated people are coming back to buy. I mean, when you looked at 2022, there was a lot of one-time costs related to going public in the early quarters, net loss has a lot of movement in non-cash items like stock compensation expense and one mark-to-market, which get taken out when you look at adjusted EBITDA, but as we've communicated in stress, trying to manage to a flat headcount. Your line is now open. Your line is now open. And look, we recognize that when things are starting up and they're small and they're off a small base, that may not be something that's sustainable, but we think that the diversification of the revenue, the actual margin in a product like this and the stickiness and predictability of it as a component of our revenue, that's one of the reasons why cited the exchanges, they didn't start out as data companies and figured out that data was a big part of their revenue going forward. Your line is now open. In terms of potential pricing pressure around take rate markets mentioned this in the past, particularly as it relates to large block trades, I'd say that as a reality being the market leader, we will increasingly draw third-parties or others who traded away from us to Forge just by virtue of the fact that you're going to go where liquidity is to clear your trade. Your line is now open."
}