{
    "symbol": "AVB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 17:32:05",
    "content": " If you turn to slide 17, we do expect roughly $900 million in development starts this year across 7 different projects with roughly half in our new expansion regions, and we will continue to target yields at 100 to 150 basis-point spread over prevailing cap rates. And that's just because those were the regions that had more embedded growth in the rent roll and lower cap rates a year or two ago that -- so as interest rates have risen, basically, a lot of the markets where we're selling, the buyers were already kind of buying for yield as opposed to growth. But in the range of 10% upper enterprise value that we want to have under construction at a particular period of time, we're light of that today, and that's a reflection of that we have retrenched on development starts over the last couple of years given the operating environment. And on that last point, our funding capacity, we're probably set up to be able to start and self-fund through free cash flow, asset sales and leveraged EBITDA growth somewhere between $1 billion and $1.5 billion worth of new development a year. And Chandni, this is -- Matt, just to emphasize sort of the broader market, we do expect our capital through the -- through our SIP to be more attractive to developers this year than it has been over the last couple of years, which inherently then means we're going to have the opportunity to be more selective, right, about quality of the sponsor, amount of capital they're putting in, our views on the underlying real estate. So, we are looking to lean in and increase development starts in the next two years if the environment is broadly accommodative of our doing so and is a reasonably stable environment from a capital markets perspective and a macroeconomic perspective with respect to the likelihood for realizing decent NOI growth. As things stand in terms of what's already underway, we are well positioned just on the $2.2 billion of development under construction that's essentially paid for to deliver robust NOI growth irrespective of what we start in the next year or two."
}