{
    "symbol": "NIO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-07 13:19:03",
    "content": "  Operator: Hello, ladies and gentlemen, thank you for standing by, and welcome to the NIO Inc. Second Quarter 2022 Earnings Conference Call. On today's call, we have Mr. William Li, Founder, Chairman of the Board and Chief Executive Officer; Mr. Steven Feng, Chief Financial Officer; Mr. Stanley Qu, Senior VP of Finance and Miss. Before we continue, please be kindly reminded that today's discussion will contain forward-looking statements made under the safe harbor provisions of the U.S. Further information regarding risks and uncertainties is included in certain filings of the company with the U.S. Securities and Exchange Commission, the Stock Exchange of Hong Kong Limited and the Singapore Exchange Securities Trading Limited. NIO delivered a total of 25,069 vehicles in Q2 2022, representing a 14.4% increase year-over-year. In July and August 2022, NIO delivered 10,052 and 10,677 vehicles, respectively, marking increases of 26.7% and 81.6% year-over-year. During this period, the company's vehicle production and delivery were faced with the challenges from the COVID-19 pandemic, extreme weather conditions and supply chain uncertainties. Benefiting from the continued demand growth for premium electric vehicles and new outstanding product and service competitiveness, we believe the vehicle deliveries will witness robust growth in the second half of 2022. The delivery and production ramp-up of ET7, ES7 and ET5 based on the NT2 platform. Hence the upgraded 2022 ES8, ES6 and EC6, we expect the total delivery in the third quarter of 2022 to be between 31,000 to 33,000 units. In terms of our financial performance, despite the significant increase in battery costs in Q2, the vehicle gross margin reached 16.7%, contributed by the deliveries of ET7 with high specifications. At NIO, the first products based on the NT2 platform, the ET7, has demonstrated strong product competitiveness in the mid-large premium sedan segment, with its industry-leading software and hardware platforms and the smart digital experience. On June 15, NIO launched the ES 7 of mid-large 5-seater SUV based on the NT2 platform, inheriting NIOâ\u0080\u0099s high-performance DNA, the ES7 both autonomous driving, handling and the safety performance, creating comfort and the intelligent experiences beyond the expectations. Since the start of the user test drive in August, the ES7 has been well received in the market and kicked off deliveries at scale starting from August 28. We have also launched the 2022 ES8, ES6 and EC6 fitted with the new digital system order, with comprehensively enhance the perception unit and computing power. The mass production preparation of the ET5 and midsize smart electric sedan based on NT2 is also in full swing, while its performance and configuration have been further optimized and enhanced compared with those at the time of the product launch. With pure and progressive design ultimate performance and outstanding intelligent experience, the comprehensive competitiveness of the ET5 far surpasses the peers in the same segment. The production order confirmation of ET5 will start from September 9, and the first batch will be delivered to users on September 30. With regards to digital systems, we released the Banyan 1.1.0 based on NT2 in August with over 60 new features and optimizations. In terms of the digital corporate and the driving experience, this update has introduced more modes under the parking scenario, diversified the audio and video experience in the cabin and further optimize the suspension comfort and the vehicle handling. In the aspect of the advanced driver assistance system, we have further upgraded the environment simulation display and automatic emergency braking, which has to enhance the action experience and driving safety for the users. As for production, we rolled the first batch of ET5 preproduction vehicles off the production lines at NIOâ\u0080\u0099s Factory 2 at NIO Park, and we plan to start the mass production this month. With regards to sales and service network, we now have 395 new houses and new spaces in 149 cities across the globe and 263 new service centers and delivery centers covering 151 cities in the world. In terms of the charging and swapping network, we have built an expressway power swapping network, covering 5 verticals and 3 horizontal expressways and 4 metropolitan areas in China. We have installed 1,094 swap stations, including 285 situated by the express ways and completed over 12 million battery swaps for our users. At the same time, we have deployed 1,873 power charger stations, including 5,341 power chargers and 5,466 destination charges and connected with more than 5,600 third-party charges, offering over 860,000 times of in fleet for power services. NIO is dedicated to putting in place a power system with chargeable, swappable and upgradable experiences, making the recharging experience better than refilling. As for the global markets, with the new ET7 being shipped to Europe in August, the order placement and user delivery of our new products will take place in Germany, the Netherlands, Denmark and Norway this year. On August 28, was chosen by our user community as the host city for NIO Day 2022 and the preparation for the events have been officially kicked off. The player in the smart electric vehicle industry, NIO has been devoted to practicing corporate social responsibility and supporting global sustainable developments. On August 15, NIO officially entered into a partnership with the United Nations development program, UNDT. As a partner of the Green Park's platforms, the UNDP will conduct in-depth collaborations with NIO in areas such as the environmental protection of protected areas and the natural reserves and supporting social and partnership to encourage young innovators to explore business solutions to advance biodiversity conservation and ecological protection. The second half of 2022 will be a critical period for the delivery and production ramp-up of multiple new products of NIO, which will present huge pressure on the supply chain, production, delivery and services. The team will work closely with our partners to improve system efficiency, accelerated the mass production and the delivery of our vehicles and ensure high-quality products and the service experience. With that, I will now turn the floor over to Steven to provide you the financial details for the second quarter. Our total revenues in the second quarter were RMB 10.3 billion, with an increase of 21.8% year-over-year and 3.9% quarter-on-quarter. Vehicle sales in the second quarter was RMB 9.6 billion, representing increase of 21% year-over-year and 3.5% quarter-over-quarter. Other sales in the second quarter was RMB 0.7 billion, which is an increase of 34.6% year-over-year and 8.2% quarter-over-quarter. The increase in other sales year-over-year was mainly attributed to increased revenue derived from auto financing services, sales of service and energy packages and sales of used cars. The decrease of gross margin year-over-year was attributed to the decrease of vehicle margin and reduction of other sales margins, resulting from expanded investment in power and service network. More specifically, regarding the second quarter was 16.7% compared with 2.3% in the second quarter of 2021 and 18.1% in the first quarter of 2022. The decrease of vehicle margin year-over-year and quarter-to-quarter was mainly attributed to increased battery cost per unit, which was partially offset by favorable changes in sales mix of ET7. R&D expenses in the second quarter were RMB 2.1 billion, which is an increase 143.2% year-over-year, 22% quarter-over-quarter. In credit year-over-year and quarter, increased patent costs and development countries as we add incremental design and development costs for new products and technologies. G&A expenses in the second quarter was RMB 2.3 billion, which is an increase of 52.4% year-over-year and 13.3% quarter-over-quarter. Loss from operations in the second quarter was RMB 2.8 billion, which an increase of 272.8% year-over-year and 30% quarter-over-quarter. Net loss in the second quarter was RMB 2.8 billion, represent an increase of 360.6% year-over-year and 37% quarter-to-quarter. Net loss attributable to NIO's ordinary shareholders in the second quarter was RMB 2.7 billion, which is an increase 316.4% year-over-year and 50.4% quarter-over-quarter. In the third quarter, especially in terms of July and August, we have some supply chain hiccups. But based on our experience, accumulated throughout the March and the April experience in Shanghai, we believe that the COVID-19 impact is under control compared with that of the quarter. Regarding the macro casting components, the yield rate is below our expectation, and this has affected the vehicle delivery to us, but we have already taken multiple measures to use the yield rate of the macro casting components. At the same time, we have also introduced some new partners for the micro testing component. Of course, we are about our delivery in the fourth quarter, and we are confident that our delivery targets for the whole year. Of course, there will be many challenges ahead of us, but we will drive back to achieve the target and improve delivery performance in the fourth quarter. Regarding the U.S. shipment related with the AI training chipset, we believe that this will not have an impact on our business operations. Based on offer estimations over computing power is sufficient for our autonomous driving technology in in the aspect of the AI training for now, and we have been working very closely with our partner, NVIDIA. We understand -- there are also many AI chipsets type companies in China who are working on the mass production of their chipset, so we are evaluating a different kind of technical solutions for this AI training chipsets, and we would like to work with different companies on this respect. Basically, we believe that this is not going to affect our long-term strategy. At the same time, it can also help us to improve our technology powers and also offer gross margin as well. What is your latest guidance in the SG&A and the R&D ratio, considering more industry competition and also overall lower sales for the industry. Yes, in the industry, we have seen many companies launching good products in the market. And also for the SG&A, as a percentage of the revenue, we believe the long-term trend is -- this is going down. And we don't expect to change our pace or our strategy just because of the competition in the external environment, we would like to make sure we can focus and determined on our own strategy and pace. ET5 has attracted a lot of attention of the users, the public and the media, and we have received very good reviews and feedback from the user itself. Next year, we plan to further launch more products based on the NT2 technology platforms, and we plan to upgrade our parent ADV to the technology platform 2.0. We believe with all the product rolled over to the new technology platform 2.0, we will be very confident regarding our market performance at that time. Because if we look at the ET7, the ES7 and the ET5, we the comprehensive competitiveness of the NT2 technology platform. Of course, at this moment, I cannot share much details regarding the new product launch, and we would like to say that we are going to accelerate the ramp-up of our new products based on the new technology platform. Regarding the third question, of course, we would like to have more and more users to use of the products and enjoying of our technologies. At the same time, to pay attention to the users' needs and advance at different price range and users of a different brand may have a different need regarding the products and the technologies. So for us, we would like to have more smart EV users to experience our products and enjoy the benefits of those core technologies, and we will make decisive planning regarding this. As you already previous guide that second half this year, the volume guidance will be 100,000 units. If you're considering our third quarter guidance, that means fact in the last quarter, #4 quarter, your volume will be around 68,000 units. They told me tight 3 to 4 months with a new products, say, yes, 785. Previously, I've also mentioned that we will try our best to meet the delivery target for this year. Of course, this means that the fourth quarter is going to witness a lot of pressure and the challenges on our delivery and supply. We believe starting from the fourth quarter, we're going to have the 2 factories are running to make sure we can support the delivery demand. Actually, starting from the third quarter, have already kicked off of the tooling and the preparation for the mass production of ET5 at large scale in the factory II in the NIO part. At the beginning, we believe the production capacity of the Factory 2 is a relatively lower compared with the Factory 1 because the factory I will only need to manufacture one product that is ET5. So we believe in the fourth quarter, we are going to break record every month. And we are confident to achieve the record-breaking target for the fourth quarter, and we have been making active preparations to meet this target as well. Regarding the specific order information, we believe we haven't disclosed this information for a long time because different companies have different definitions and understanding regarding the orders. Actually, for the ES7, we believe the order performance at much better than our expectation. Recently, we believe that the bottleneck or the constraints and not about the demand, is mainly about the production capacity of the supply chain, of course, for our own production capacity. So we believe we have already made sufficient preparations, but the main constraint will be in the supply chain. Most of es7 starting to be delivered in Q3, our first addition with higher price and margins. But in short term, we are still facing great uncertainty and challenges regarding the battery cost which will be -- which will have a negative impact to our gross margin. So in order to meet our full year's target, the October to December month-on-month revenue it has to be at least a 30% level on every month. Yes, actually, I think for the production capacity ramp-up, everyone understands this will make some time and there's a process, especially when it comes to new product production ramp-up. And we believe the ET5 will have the opportunity to surpass the 10,000 units in 1 month. For the November and December, we believe we are going to break the delivery record month over month. Previously, I have also mentioned in October, the supply chain bottleneck will be resolved for the ES7 and the ET7 and around that time, we will also ramp up the production of the ET5. We believe in the fourth quarter, of course, we're going to experience any pressure in terms of the supply chain and production, but we are confident to make sure we can meet the target that we set for. So my question is if the production capacity is 10,000 --\n  Of course, for the reservation orders, there are some fluctuations and uncertainties. But for the production order confirmation, this is the starting point for us to make the arrangement of the actual production of ET5. If you would like to get your ET5 earlier, then, of course, you should place your orders as soon as possible. And then the second question is the original plan was to introduce a solid hybrid battery pack, I believe, in the fourth quarter. So at this time, I would like to visit our colleagues here in the U.S. and then I will also go to Europe to visit over colleagues over there. For the U.S. market entry, we have been making preparations for a long time. We have been thinking about the U.S. market entry strategy back in 2017, and this has been in planning for almost 5 years already. We believe â\u0080\u0093 so right now, we have a much clear plan regarding the U.S. market entry, and we have been making comprehensive preparations based on our plan and the strategy for the U.S. market. But we believe we have a clear strategy for the U.S. market entry, and we just need to be patient for the execution. But according to our current evaluation, we believe that probably we are not going to provide this service to our users in the fourth quarter. The first one is, have you realize that there might be some orders that have been placed by certain people who is not really intending to get the vehicle, but just to and try to sell the order to someone else for profit, which the order and give some misleading information for your production plan. My second question is regarding your secondary and tertiary brands preparation, Outpace and Firefly. Regarding the first question, of course, if we cannot meet the user demand in a timely manner then probably some users may transfer their orders to others. If you place a reservation order for now, then will follow up with you regarding the specific orders and then be converted to the actual production orders. In our current order backlog, we lead the percentage of users who are only placing the orders to make sure they can transfer the orders to others in the future to make a profit. Our plan for the mass market, the product is to follow the schedule and the cadence of offer latest technology platform that is the new technology platform 3.0. Yes, probably from the media and the supply chain, there have been some discussions about the third brand of NIO. Actually, in the past, we have recognized that if we want to accelerate the conversion from the ICE to EV, we will link to provide more products to cater to different user in different segments. And we believe in the past year, we have witnessed tremendous growth in terms of the EV demand at the entry-level market segment, which has also been driving the EV penetration here in the China market. If you have further questions, please feel free to contact NIO's Investor Relations team through the contact information provided on our website."
}