{
    "symbol": "SSNC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 22:14:06",
    "content": " Our results for the fourth quarter of $1.339 million in adjusted revenue, up 3.3% and our adjusted diluted earnings per share were $1.16, down 4 -- 9.4%. Adjusted consolidated EBITDA was $518.6 million, third highest in our history, and our EBITDA margin was 38.7%. In 2022, SS&C generated net cash from operating activities of $1.134 billion, including $67 million in deal related expenses. The results for the fourth quarter 2022 were GAAP revenues of $1.338 billion, GAAP net income of $207.5 million and diluted EPS of $0.81. Adjusted revenue was up 3.3% and adjusted operating income decreased 1.1% and adjusted diluted EPS was $1.16, a 9.4% decrease from Q4 2021. Overall, adjusted revenue increased $42.9 million or 3.3% from Q4 2021. Adjusted operating income in the fourth quarter was $502.1 million, a decrease of $5.4 million or 1.1% from Q4 2021. Adjusted operating margins were 37.5% in the fourth quarter of 2022, compared to $39.2 million in the fourth quarter of 2021. Adjusted consolidated EBITDA defined in note three of our earnings release, was $518.6 million or 38.7% of adjusted revenue, a decrease of $4.3 million or 0.8% from Q4 2021. Adjusted net income was $296.6 million and adjusted EPS of $1.16, and the effective tax rate used for adjusted net income was 26%. Adjusted for the transaction costs, cash flow was $1.21 billion or a decrease of $227 million or 15.9% compared to 2021. Capital expenditures and capitalized software totaled $208 million or 3.9% of adjusted revenue, compared to approximately $137 million in 2021. So for the first quarter of 2023, we expect revenue in the range of $1.332 billion to $1.372 billion, adjusted net income in the range of $282 million to $299 million and diluted shares in the range of $156 million to $157 million. For the full year 2023, we expect revenue in the range of $5.45 billion $5.655 billion, adjusted net income in the range of $1.190 billion to $1.285 billion and diluted shares in the range of $455 million to $258.5 million."
}