{
    "symbol": "MIGI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-22 20:06:03",
    "content": " As of last Friday night's close, Mawson has a market capitalization of approximately $60 million, is listed on the NASDAQ under the code MIGI, M-I-G-I and has five Bitcoin mining sites across the USA and Australia. Our installed hosting co-location capacity as at the end of July was approximately 1.8 exahash bringing our combined installed self-mining and hosting co-location capacity to 3.5 exahash, one of the largest installed Bitcoin mining operations amongst our NASDAQ listed peers. We have recently alluded to our second Bitcoin mining facility in Pennsylvania and are pleased to report today that we have received a favorable energy load study meaning that our Sharon, Pennsylvania facility is capable of operating at up to 120 megawatts or 4 exahash, meaning we are today upgrading our total energy capacity available for Bitcoin mining to 590 megawatts, which is one of the largest confirmed infrastructure pipelines amongst our NASDAQ listed peers. Resulting in total operations across our self-mining and hosting co-location at approximately 5.3 exahash by Q4 2022, again one of the largest installed Bitcoin mining capacities amongst our NASDAQ listed peers. Our hosting co-location business expanded materially growing from 16 megawatts or 0.5 to 54 megawatts or 1.8 exahash over the period with hosting revenue growing sequentially from $550,000 in Q1 to $3.57 million in revenue in Q2, up 536%. Our self-mining operation continued its growth, rising from approximately 1.35 exahash in March and touching an interim all time high of approximately 1.85 exahash in June and slightly ahead of July's run rate of 1.7 exahash, with our Bitcoin self-mining operations producing 490 Bitcoin, up 286% versus Q2 2021. Total assets grew from $166 million in quarter one to $191.8 million in quarter two, reflecting additions in property, plant and equipment from Bitcoin hardware deliveries, and the continued deployment of energy infrastructure across our facilities. As this slide demonstrates, a 2.3 exahash, we expect to be reducing approximately 10.5 Bitcoin per day, and assuming current network difficulty and a bitcoin price at 25,000, we would expect this to produce $95.8 million of annualized revenue, rising to $223.5 million of annualized revenue and 24.5 Bitcoin today, assuming a fully deployed fleet of 5.5 exahash in 2023. Our hosting co-location base business detailed here on Slide 7 has expanded significantly over the course of the second quarter, with revenue from this division, rising from -- rising 536% sequentially from 550,000 in Q1 2022 to $3.5 million in Q2. In Georgia, where we have recently been approved and commenced initial work to expand our facility threefold to 230 megawatts in 2023, there are two brand new nuclear reactors coming online in the next 6 to 12 months, Vogtle 3 and Vogtle 4, two 1100 megawatt Westinghouse pressure water reactors, bringing an additional 2.2 gigawatts, which is an additional 17% of energy into the existing 13 gigawatt Georgia grid. Well, over the last twelve months, we've grown our self-mining, hosting co-location business 17 times from 0.2 of exahash to 3.5 exahash as of July 2022 and anticipate growing this further by an additional 50% in the year end to 5.3 Exahash."
}