{
    "symbol": "MIGI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-25 10:39:10",
    "content": " Mawson has converted these headwinds with a continued focus on our diversified and total revenue model, particularly trade revenue shares; one being self-mining; two being hosting collocation; and three, our market-leading Energy Markets program. Some key highlights from the period include, the closing of our Georgia sale for over $40 million; completion of the build-out for Phase 1 of Midland, PA to 120 megawatts of capacity; securing some additional sites for growth, including firming up our 120-megawatt facility in Sharon, PA; and entry into a binding sale agreement for the Texas facility for $8.5 million, enabling us to continue our strategic focus on the PA region. Touching on some highlights of the full year results of 2022, Mawson has generated record revenue for year-to-date of $84.3 million, up 92% year-on-year; gross profit of $36.6 million, up 8% year-on-year; non-GAAP EBITDA of $30.4 million, up 70% year-on-year; and Bitcoin produced for self-mining increased 66% to 1,343 coins. And so we are looking for strong counterparties in hosting that we feel comfortable with that continue to obviously pay bills on time, fund their relative proportion of any CapEx or provide a security around that and be good profitable counterparties or failing that we are looking at whatâ\u0080\u0099s the mix of self-mining and we would like to do a bit of both, ultimately. But thereâ\u0080\u0099s obviously a lot of M&A potentially on the cards this year and in the industry and Mawson wants to be part, be at the table playing with everyone and we will obviously make sure that if anything is occurring in that space, we are out there talking to everyone and making sure we are looking at the right deals with counterparties to see if thereâ\u0080\u0099s any other opportunity to create value for shareholders. So we would like to think that we are leading the charge on that and itâ\u0080\u0099s important part of our investment criteria from an ESG lens is when we are looking at new sites, whatâ\u0080\u0099s the generational mix of the power and what they are going to do."
}