{
    "symbol": "HLI",
    "quarter": 2,
    "year": 2022,
    "date": "2021-10-28 22:10:24",
    "content": " By now, everyone should have access to our second quarter fiscal year 2022 earnings release, which can be found on the Houlihan Lokey website at www.hl.com in the Investor Relations section. Before we begin our formal remarks, we need to remind everyone that the discussion today will include forward-looking statements. During today's call, we will discuss non-GAAP financial measures, which we believe can be useful in evaluating the company's financial performance. Hosting the call today, we have Scott Beiser, Houlihan Lokey's Chief Executive Officer; and Lindsey Alley, Chief Financial Officer of the company. Welcome, everyone, to our second quarter fiscal year 2022 earnings call. This significant increase was driven by the ongoing robust business environment that we've experienced since the summer of 2020, and the comparison to a relatively weak second quarter last year, as a result of the pandemic. Corporate finance and financial and valuation advisory produced record quarterly results, and financial restructuring delivered solid results during a very challenging restructuring market environment. On the expense side, although we are starting to see some increases in travel and marketing costs consistent with increased business activity, we are maintaining an adjusted pre-tax margin of approximately 30%, which is well above pre-pandemic margins. For the second fiscal quarter of 2022, we reported $1.71 in adjusted earnings per share, up 128% from the same quarter last year. Activity levels remain strong with both corporate and sponsor clients, and all industry sectors are showing growth over previous years. And finally, our capital markets business continues to be one of the fastest-growing components within our corporate finance business. Although, the momentum we have in our corporate finance business sees no signs of letting up, we recognize that the economy, stock market and global M&A activity has been in an upward cycle for nearly 12-years now. Our FVA business reached a record $66 million in quarterly revenues, and delivered the fifth consecutive quarter of revenue growth. FVA has a trailing 12-month revenue run rate of nearly $250 million, with every major sub product area contributing to our growth. Although, FVA is our least volatile business segment, given the nature of the work, it has produced compound annual revenue growth in excess of 10% over the last five years, an impressive statistic for this business segment. The FVA business has benefited from a healthy market environment, exceptional execution, several new senior hires and additional revenues from SPAC activity. Currently, we have a record number of MDs, active projects and new business activity continues to grow. However, as we've said in previous quarters, business activity is similar to pre-pandemic levels, and we believe that we continue to hold on to our leading market share through this challenging restructuring cycle. We don't normally discuss single transactions during our earnings call, but in this latest quarter, we were hired on a restructuring assignment in China that highlights the strength and reputation of our global restructuring practice. We have been doing business in China for years, and have invested a lot of time and resources in that part of the world, as many of the Asian economies work to bring Western law and maturity to their capital markets. On the acquisition front, we are excited that we successfully closed the first step of the tender offer for GCA right after our quarter closed on October 4. Although, Lindsey and I refer to GCA for ease of discussion, we will be operating as a single firm, and we're very pleased with the integration efforts thus far. As previously reported by GCA, they continue to experience very strong results and are projecting a record calendar 2021. On a pro forma basis, we have trailing 12-month revenues of approximately $2.3 billion, and adjusted pre-tax income of approximately $600 million. In addition to the GCA transaction during the second quarter we hired or acquired for Managing Directors, one in corporate finance, one in financial restructuring and two in financial and valuation advisory. Overall, we are very pleased with our financial results and we look forward to continuing our recent strong performance with our new colleagues from GCA. Today I will do a quick review of HL’s second quarter, followed by comments about GCA and what to expect in the coming quarters. Revenues in corporate finance were $388 million for the quarter, up 259% when compared to the same quarter last year. We closed 134 transactions this quarter compared to 53 in the same period last year, and our average transaction fee on closed deals increased. The net restructuring revenues were $83 million for the quarter, a 34% decrease from the same quarter last year. In financial and valuation advisory, revenues were $66 million for the quarter, a 55% increase from the same period last year. Turning to expenses, OUR adjusted compensation expenses were $330 million for the second quarter, versus $175 million for the same period last year. Our adjusted non-compensation expenses were $43 million for the quarter versus $29 million for the same quarter last year, an increase of 51%. This resulted in an adjusted non-compensation expense ratio of 8.1% for the quarter, versus 10.4% in the same period last year. And for this quarter, we adjusted out of our non-compensation expenses $1.6 million in acquisition related amortization, and $1.6 million in acquisition related transaction costs, attributable to both the Baylor Klein acquisition which closed in July, and the GCA acquisition. As we did this quarter, we will adjust those costs out of our non-competition expense next quarter as well. Given the pandemic, we've been operating at a historically low non-compensation expense ratio. But we expect that our new target will fall well below our pre-pandemic range of 14% to 15%, as a result of the economies of scale that have occurred in our business over the last several quarters. Our adjusted other income and expense decreased for the quarter to an expense of approximately $853,000 versus income of approximately $196,000 in the same period last year. Our adjusted effective tax rate for the quarter was 27.9%, compared to 27.3% during the same quarter last year, in line with our long-term target of between 27% and 29%. Turning to the balance sheet, and uses of cash, as of the quarter end, we had approximately $963 million of unrestricted cash and equivalents and investment securities. As a reminder, we paid approximately $540 million in October to settle the first step of the acquisition of GCA, and we currently own 90% of the company. Finally, in this past quarter, we repurchased approximately 499,000 shares at an average price of $82.89 per share as part of our share repurchase program. Regarding GCA, we want to share some of the specifics around the acquisition to aid in your thinking over the next several quarters. Similar to other transactions, we will put in place a retention pool for the benefit of GCA employees that aggregates to no more than $133 million. We anticipate that the retention pool will be put in place in or around February, and vest over a four year period with the first vesting date, May 2023. Similar to other retention pools, we will be adjusting the corresponding expense out of our GAAP earnings as we view retention as a component of acquisition cost. In addition, we expect it will be a modest amount of integration costs associated with combining our businesses that will occur at least over the next four quarters. For GCA, this amortization will be significant and will be adjusted out of our GAAP earnings, similar to what we have done in the past. Regarding how the GCA transaction will affect HL’s long-term targets, we expect that we will maintain our compensation ratio consistent with our historical practice and our long-term target throughout the remainder of this fiscal year and beyond. One additional comment about GCAs compensation costs, GCA currently is a calendar year company, and we will pay bonuses in our fourth fiscal quarter based on their performances through December 2021. Historically, GCA paid their bonuses 100% in cash. For this calendar year, we intend to pay GCA bonuses consistent with HL’s deferred stock bonus structure. This will result in HL issuing stock in lieu of a portion of the cash bonus paid to GCA employees, and our fourth fiscal quarter as part of their bonus cycle. After this calendar year-end, going forward, GCA employees will operate on the same bonus schedule and structure that all HL employees do. Regarding the incremental non-compensation costs associated with the GCA acquisition, we do not expect to see synergies relating to non-compensation costs in the next few quarters as we integrate the two businesses. In fact, it is best to take a look at GCA’s publicly released non-compensation costs for the first six months of calendar year 2021, and assume that there will be some organic growth to those costs over the next several quarters. We fully expect that over time, the combined company will be able to operate at a non-compensation expense ratio, consistent with where HL has operated in the past on a standalone basis. We will update you over the coming quarters as we make progress on our integration, including certain milestones and the cost of the integration. One final comment, as a reminder, we will be consolidating GCA’s results for Q3. But we will be backing up approximately 4% of their profits through a minority interest investment, as we will not own 100% of the company for the entire quarter. For our entire fourth quarter, we expect to own 100% of GCA. Please proceed with your question. Hey, Devin, pipeline is still very solid, we're still seeing growth in almost all the metrics in terms of new business coming in, kind of size of deals that we're working on, potential for closings. And when we had a very strong quarter, we're still sitting with a large amount of activity to continue to work on. And I think with respect to velocity, I'm not sure there's been any notable change in how quickly deals are moving through the system. It's probably the most sizeable and notable one just in today's current marketplace, which I think continues to help with the brand and reputation. And we've been a dominant player out there in restructuring and obviously getting engaged on a project like that just continues to help us, continue to hopefully build market share out there. I mean, if I take kind of components of comp ratio over time, and then non-comp it sounds like it's going to take a bit of time. But effectively, you're saying that you think you can get GCA’s margins up toward Houlihan Lokey’s margins, which would be a meaningful kind of margin improvement for that. I think with respect to compensation, I think you heard me correctly, expectations are that from a compensation ratio standpoint, we'll be able to bring them to our kind of traditional ranges and kind of how we traditionally have operated fairly quickly as early as next quarter. Thanks for taking my questions. Please proceed with your question. So, Ken, we have decided not to disclose specifics around GCA for the September quarter. And with respect to backlog, I think we're going to stay away from the two separate firms backlogs. But in terms of pipelines, I think Scott's comments you can think about on a consolidated basis. From a banker perspective what we're really looking to do, as people both in their organization, ours sometimes view themselves along industry sectors, sometimes along product, sometimes along geography is to get them to meet the relevant people and our organization and vice versa. And that's why we've had numerous get together welcome events, retreats, whatever you want to call it. And so we're already kind of assembled along combined industry sectors, combined the geographies, combined products so that everybody can get introduced to the capabilities that on a pro forma basis exists. That will enable us to pursue, we believe, more pieces of business to be able to put collectively better people on projects to get hired and execute with better results. The classical integration costs are much more back office oriented, when you deal with different platforms, whether that's a CRM or an EPR system, or obviously, people have different kinds of policies and procedures. So really, it's trying to get people on the banker side to as quickly as possible, get it understand and know their colleagues and know where via an email, via call, via zoom, how can they get to the right person. And I think we're on target in our minds on how this happens, but it doesn't happen overnight. And that's what we say, can take a couple quarters a year or two, to really get everybody up to what we'll call a mature level. And Ken, just one thing I'll add that's different about this transaction, historically, and you've heard us say this, we have acquired much smaller companies. GCA is I think, well established in technology. So I don't think this is a brand new issue for either the historical Houlihan Lokey folks, or the historical GCA folks. So, we've always said approximately about 50% or so of our businesses are touched by sponsors. They're big sellers of businesses, buyers of our businesses, they sit on creditors committees and part of the restructuring franchise. Our goal is to cover as many of those sponsors as we think are relevant, and we can be helpful to, so we're always looking to increase the number of sponsors that we cover, and to look to increase the incremental amount of services that we can provide to the sponsor community, and has been noted by many organizations like yours and others is the sponsor community has been very active in deal making and transactional oriented issues, especially over the last year. And we've continued to I think, expand our presence with them, which has clearly helped our financial results as well over the last couple quarters and arguably really the last decade or two. So, I think we've always felt, at least on a consolidated basis, we do have some level of seasonality. You typically have seen our fiscal third and fourth quarter, generally better in our fiscal first and second quarter. What has been very positive in our minds, and I mentioned it in my comments, literally, it's been over the last, I think, five quarters that every single quarter, ignoring seasonality it continued to grow and do better. I think, they've got a great business profile at this point. Please proceed with your question. Yeah, we think the addition of the GCA bankers -- well, primarily, we think of them in on the corporate finance side, but they're also going to be helpful on the restructuring and the FVA side. On one hand, we clearly have far more presence than we ever did in Asia, which they weren't really historically at all focused in restructuring, they now have some connectivity, relationships, and we can bring the skillsets. They additionally have relationships, they've never focused at the same level we have on valuations, they'll do a little bit of valuation work, but not to the same brush that we have. And so, we think kind of the added number of bankers in areas of new geographies as well as in deeper strengths on the different industry sectors that they participate in, is going to drive some revenue synergies to this two other businesses, I mentioned as well. So, I'll take the restriction side first, I think these supply chain issues, which are more critically and negatively impacting business is starting to increase dialogue on the restructuring side. On the otherwise core M&A practice, there's always something in whether it's concerns about interest rate, changes in taxes, supply chain, the pandemic, political change, there's always things out there that become topical to either the C suite or the financial sponsors. Right now, I'd say it's clearly a topic, but it's not overwhelmingly driving at least our client base to need to want to do something quicker, or conversely, that it's meaningfully slowing down the prospects of completing a deal. It's a topic out there, but at this point, I wouldn't tell you that it's hugely financially impacting positive or negative our client base. Thanks for taking my questions. Please proceed with your question. Is restructuring kind of immune to those trends, just given the nature of the advice there they kind of have similar fee rates as the U.S. market? Having said that, the answer to your second question is what we have experienced is it's similar, it's monthly retainers, and the vast majority of it is in success, depending on how long the transaction goes on for. And I think it's hard to comment on whether the fees are lower on average than Europe or the U.S., simply because we don't have enough data points. But, look, our restructuring bankers are disciplined in their fee approach, and we're going to take on transactions that we think are profitable. So historically, you've managed to keep your share count flat to down, at least prior to the capital raise last year. And so part of its going to depend on when we do the next acquisition, because historically, acquisitions have been a nice way for us to maintain a relatively small amount of excess cash, because we think we can deploy it very profitably to our shareholders. If we have a long pause around integration, then you will likely see the result being increased share buybacks. Having said that, if there's some wonderful acquisition opportunities out there in the next two to three years, we'd rather put money towards those acquisitions if we think they're strategically smart acquisitions, and they're accretive to our shareholders versus doing share buybacks. Please proceed with your question. So the past couple quarters, you've seen a pretty substantial increase in the per deal. So this has been going on for at least the last decade or two in our organization, and I don't think this is a one quarter or one year phenomenon. But almost every single year, the average size of the company we're doing work for increases. I think the talents of the banker pool that we have, considering the long maturity of many of our bankers, they're more talented today as a group than they were three years ago, five years ago, et cetera. Some of its clearly helped by the market and a lot of it is, I think the tactical decisions and how we go about procuring and executing business. As for my follow-up, I know you mentioned in the prepared remarks that restructuring activity is running at similar levels to pre-pandemic. And in prior quarters, you sort of guided this sort of a range of between call it 2017 and 2020 levels, and 2022. I was just wondering how you're thinking around the potential floor for revenues has evolved given activity in the U.S. has remained fairly depressed, while we've obviously also seen acceleration activity in China? Under our definition of pre-pandemic, and you can look at our historical results, and I'm rounding, but we've been somewhere probably between $300 million and $350 million of historical annual restructuring revenues. The next comment I would make is, in every single cycle we've ever seen, going back probably three plus decades, each trough is higher than the previous trough, and each peak has been higher than the previous peak. But the market is growing, the number of companies that have significant amount of leveraged debt is much greater today than it was several years ago, spread across the globe. So whatever, which will eventually increase that default rate, there's just more business out there for ourselves and our peers, eventually to do incremental restructuring work. None of us are per se in control of our exact timing destiny here, but I would walk away from my comments of the market is bigger, it's just going to probably still take some time before that creates incremental revenue streams for us. Thanks for taking my questions. Please proceed with your question. When we look at MD productivity at GCA versus Houlihan Lokey, I mean, at least from what we can calculate, it looks to be quite a bit lower there than it is for you guys. First of all, I think we've always looked at whether we're hiring or acquiring small or big is, can we buy a business that will produce profitable results. And we tend not to get as hung up as others on peer revenues per employee revenues per MD or whatever metrics that everybody uses, our first comment. And the second comment is, we have historically seen in almost every single transaction that we've done, over a reasonably short period of time, but I'd call that a couple years, the productivity of bankers that we acquire clearly increases so that it becomes I'll call it almost blended from what historically Houlihan Lokey has done. That's a combination of an enhanced platform for which everybody to sell off of, we add financial sponsor activity and skills and connections they didn't have before. And while your comment and question up front is accurate, historically, they've had lower revenues per head. And I guess finally, looking at kind of cash level that I guess, ultimately to try and get it the potential for buybacks with GCA, cash being spent there. Because when I'm looking at the cash you have on the balance sheet now versus what you're paying out, it seems like the cash position is looking stronger than at least we thought it was. I think, I would just take it as a reloading, and we ended up doing it last quarter that it happened during our board meeting last quarter, which occurred this quarter. I want to thank you all for participating in our second quarter fiscal year 2022 earnings call, and we look forward to updating everyone on our progress when we discuss our third quarter results for fiscal 2022, this coming winter."
}