{
    "symbol": "GSM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 14:29:04",
    "content": "  Operator: Good morning, ladies and gentlemen, and welcome to Ferroglobe's first quarter 2022 earnings call. I would now like to turn the call over to Gaurav Mehta, Ferroglobe's Transformation Director and Executive Vice President of Corporate Strategy, Technology, and Investor Relations. Good morning, everyone, and thank you for joining Ferroglobe's first quarter 2022 conference call. Joining me today are Marco Levi, our Chief Executive Officer; Beatriz García-Cos, our Chief Financial Officer; and Benoist Ollivier, our Chief Operating Officer and Deputy CEO. Risk factors that could cause actual results to differ materially from these forward-looking statements can be found in Ferroglobe's most recent SEC filings and the exhibits to those filings which are available on our web page, www.ferroglobe.com. In addition, this discussion today includes references to EBITDA, adjusted EBITDA, adjusted gross debt, net debt, and adjusted diluted earnings per share, which are non-IFRS measures. I'm really excited to present our results, which set a new record in terms of our quarterly revenues, adjusted EBITDA, margins, net profit, and earnings per share. Our organization has worked very hard over the past few years, and reporting these stellar results is the validation of the earnings potential of this business. The improvements in our go-to-market strategy, our quick reaction time to market changes, the focus on continuous improvement, amongst many other things, all contributed to these results, and the new Ferroglobe we are creating. Whether it is changes in our customer needs and preferences coming out of the pandemic, or our need to quickly find new suppliers in the wake of the terrible Russia Ukraine war. Ironically enough, it is in the midst of this drastic changes and uncertainties that Ferroglobe is capitalizing on the full potential of its unique global asset footprint, more so than ever before. Our ability to service global customers locally is proven to be a great competitive advantage, particularly as customers put a premium on security of supply and seek shorter supply chain. In the face of an energy crisis, particularly in Europe, we have been able to leverage our operational flexibility, scaling back production in Spain, and servicing customers from facilities in Norway and France. As we look at what's happening around us from an economic, environmental and geopolitical standpoint. The decision to right size, the footprint and subsequently remaining discipline in not restarting capacity to quickly has also been a key contributor to this turnaround. That said, we do see some positive signs to consider additional capacity restarts and are assessing this now in the area of silicon metal. There are also positive developments regarding the financial restructuring, which I'll come back to momentarily. In addition to our operating assets, we're benefiting immensely from our vertical integration into critical raw material. This has provided us security of supply in areas like electrodes, and has helped us mitigate inflationary pressures in other areas, such as coal and cokes. During the first quarter, our revenues increased 26% to $750 million. And we achieved the adjusted EBITDA of $241 million, an increase of 182% over the prior quarter. And our earnings per share on a fully diluted basis was positive $0.80, a significant increase over $0.27 per diluted share, we delivered last quarter. Overall, our business continues to perform well across the entire product portfolio. As we realize that 108% increase in the average selling price in our shipments, excluding the joint ventures. In Europe, the index pricing did come down right at the beginning of the year, following an extremely robust Q4. Since mid Q1, we have seen some recovery in the index into Q2. While our shipments during the quarter dropped, I want to be very clear that this is not the result of demand destruction in any of our end market. A transportation strike in Spain this match, which has been leading to some spillover of volumes into Q2, and the delay the restart of the first furnace itself. At the moment, the energy intensive aluminum sector is feeling the direct impact of higher energy prices, particularly in Europe. Many of our customers are thinking about their strategy, but we have not seen a big pickup in this year just yet. Overall, we saw a significant improvement in the contribution from silicon metal with quarterly adjusted EBITDA, increasing to $150.4 million. There will be always some month-to-month fluctuations, driven by trade flows and demand side issues, but the fundamentals remain solid. Looking ahead, we see the supply demand tension holding supporting favorable pricing levels. In light of the situation, we have commenced our assessment around the restart of our 55,000 ton silicon facility in Polokwane, South Africa. Given the positive responses for our customers, who have been testing our high priority silicon powders over the past year. As our customers' needs continue to evolve, we feel this product and the perfect innovation behind it will be an important part of the Ferroglobe story in the future. This light drop in sales volumes was in Europe, and is linked to lower production in Spain due to the energy related curtailment. A production issue in South Africa, which has since been addressed and logistical issues in South Africa limiting our ability to procure containers, and more foundry products. However, the current situation in the CIS region, coupled with other logistical issues elsewhere is supporting a market tightness for ferrosilicon. At the moment, the price appreciation is more than offsetting any cost pressure driving margin expansion. Since the beginning of the war, the prices of our manganese alloys have increased. Similar to ferrosilicon, the price lag in our context means we realize these benefits in Q2. In terms of volumes, our 75,000 tons of shipments was in line with our expectations given the situation in Spain. As a reminder 97,000 tons shipped the previous quarter was the result of some inventory build and catch up volumes at year-end. On the cost side, we have seen a direct impact of inflationary pressures on manganese ore, coke and other reductions. Given the evolving situation in Russia and Ukraine, we see some near-term opportunities in this part of our portfolio. As we look at the year-end, there are a few key areas of focus, 2022 would be the second year of the execution phase of our value creation plan. Building on last year success, we have identified a new pipeline of initiatives, which are expected to deliver an additional $65 million of in-year EBITDA. This cost savings target is spread across footprint optimization, centralized procurement, continuous plan improvements, and the benefits stemming from commercial excellence. On the point around footprint optimization, we recently announced an agreement with the French Works Council on March 30 relating to the process which started one year ago. Collectively, this agreement results in 195 potential job terminations and 35 employee transfers to other facilities. Overall, we are well ahead of schedule in delivering the $180 million of EBITDA uplift from cost cutting and commercial excellence which was initially targeted by the end of 2024. This year, we will also focus on looking beyond the financial targets. Overall there is tremendous opportunity for improvement by focusing on the core or bolstering our capabilities and ensuring we have the right support system in place to drive change, in order to create an edge and minimize value we have plans across our functions aimed at driving higher productivity, enhancing our operational efficiency, improving our customer experience, and driving sustainable results. Needless to say, ES&G is a critical pillar for all our stakeholders, and we are invested in ensuring that this becomes a part of our company's culture. In due course, we would be releasing details around the key areas of focus and the targets we're setting. That said, we continuously broaden the scope of our plan and execute on our new initiatives to unlock additional value. During the quarter, our top line grew by 26% to $750 million over the fourth quarter, primarily as a result of pricing in our silicon and silicon alloy product categories given the continued strength in selling prices across our product portfolio, combined with some expected recovery in volumes, there is further upside in top line growth into Q2. During the quarter, we face inflationary impact in key inputs, while we didn't encounter any operational disruptions, the sourcing from alternative suppliers for inputs previously purchased from Russia come at the highest costs. Despite these incremental costs, our margins in the first quarter improved due to a combination of higher pricing as well as improvements we have made to our overall business in optimizing our cost and improving the efficiency of our operations. Please note that with disregard to our Q4 figures, there have been some restatements specifically relating to the accrual of interest for the Reindus loan for $6.1 million and an update on the earn-out provision of $7.3 million related to selected manganese assets. Specifically, on the cost side, the impact of higher raw material prices accounted for nearly half of the cost impact. Energy prices increased adversely impacted us by another $14.5 million, while we've had some seasonal impact with the tariffs in France, the main country of focus remains Spain. There have been some positive developments in the Spain with the government recently announcing plans to cut the price of natural gas, which ultimately impacts the market price of energy. The timing of final cut prices have not yet been finalized, but we think it can have a positive impact for us in the second half of the year. Slide 12 please, our cash balance improved by $60 million, ending the quarter with $176 million. Despite the strong growth during the quarter, we maintain a flat level of working capital to say, thanks to the discipline and financial controls we introduced in operating our business over the past year. Following the decrease in account receivables, we have expanded our factoring facilities, which will help accelerate our cash duration going forward. Our working capital also includes some one-offs, like settlement of some overdue payables and the cash payment for CO2 to address our 2021 deficit. With improvement in our financial performance, we continue to worsen liquidity and enhance our overall carrier profile. Q1 represented the second consecutive quarter of positive operating cash flow with $66 million, up $44 million over Q4 driven by a strong quarter. Increases in account receivables and inventories yielded a working capital increase during the quarter, the actual cash impact of our CapEx expense was $9.1 million and the net impact of cash flow from financing activities was $2.6 million. As we highlighted on our prior calls, we were expecting a slower ramp up in free cash flow generation versus EBITDA growth in Q1. Given items such as the double coupon payment paid during the quarter, CO2 credit and increase in working capital. Slide 14 please, looking at the year ahead, our priorities for the cash, we expect to generate target two key areas. Through the past few years, our debt balance has increased and we are committed to reducing the debt significantly. The logical place for us to start are the 9% super senior notes, which we can pay back at par through October 2022, when it comes to the capital structure, more broadly, our first objective is to add an asset based loan to fund working capital that would generate -- for general corporate purpose. We have been working on this over the past few months and are targeting to close a transaction by the end of Q2 with a goal of deleveraging, we are currently evaluating options for our capital structure, which offer a cost of debt in line with our current credit profile, sufficient flexibility to operate our business and also enables debt prepayment in a cost effective way. After several years of having a scale back on CapEx spending, the other priority is to increase our capital spend to $75 million, which we deemed to be a good level going forward. All-in-all, a lot of exciting prospects on the horizon as our financial results continue to improve. Please go ahead, your line is open. So last quarter, you noted an estimated EBITDA for January around $74 million. January is always not a full month and then there has been the usual price creep positive creep, mainly due to the alloys pricing dynamics. No, I would say no, no, it's mainly not too much spot is normal creep, because as you know the price of alloys gets adjusted either monthly or bimonthly or on a quarterly basis. I think on silicon-based alloys, you talked about margin expansion. Well, I meant I gave a few items during my reading my script, but in a nutshell, the way we see it in Q2 is pricing stronger than cost increase across our main -- all across our main product line. Okay, margin expansion across all the business segments. I mean, there was a notable step down and good cost management, quarter-over-quarter here. Well, the way we see it at this stage, there is the most of financial cost increases on silicon metals between 4% and 5%. And if I could one last one here, and you touched on this, reviewing the financials and capital allocation. Just with the change in the contracts this year that you're experiencing, which is helping with results from fixed price to index base. Well, if you talk about what we're referring to is silicon metal. And we moved from excluding joint ventures from contracts, which were covering about 70% of our traded volume in silicon metal with fixed yearly price to less than 10% of our volume on fixed yearly price. And those contracts, those still expiring at the end of this year, or those index based pricing contracts for multiple years. There are contracts which have longer tenure, three years, two years, one year, different quarters. And supply security really popped up last year in all the discussions, but is still pretty valid due to all the complexity that we -- everybody has been leaving in supply chain. Having, like I said, our back integration in cokes and partial back integration in coal are definitely an advantage for us in satisfying this customer demand or supply security. Okay, and then Beatriz, given -- I mean the results are strong this quarter, but the company's business over the long term is volatile. So I think today, we have recognized that the cost of debt does not reflect the credit profile of the company. And then, as we said, we plan to use our cash generation to cover two objectives. Number one is to continue to further reduce down debt and number two, to continue to invest in our assets with $75 million of CapEx in 2022 and we expect this level of CapEx to continue going forward. Well, that's something that we are working at the moment. Please go ahead, your line is open. Do you have, I appreciate there's a lot going on in the market, not least Ukraine, Russia energy prices, et cetera. Well, I can tell you what we see right now, we see our chemical business which is silicon metal related being pretty strong. Like I said, customers are planning for increased production, always related to silicon metal, we see the aluminum market is slowing down due to tremendous pressure related to energy costs. When you move to the steel business, they're quite different dynamics because, of course, the ore has an impact. The overall global production is down, but there are geographies where the production is all being due to the gap of the output in Eastern Europe. So overall, we don't see at this stage any drastic change in the demand profile. I mean, the Ukraine historically has been extremely large producer of manganese alloys, probably the biggest producer in Europe, and I think number three producer in the world. Russia is the big exporter of ferrosilicon and depending on the measures taken by the various countries, and the possibilities to pay material for sure, there is an impact overall on ferrosilicon demand related to the war. And my last question, perhaps just maybe trying to think about Brian's question about the capital structure, but in a slightly different way. I think our primary objective as we mentioned for this year in 2022, is with the cash that we are going to be generating increasingly from Q2 is to accomplish two objectives. One is to deliver that as much as we can be the company, we are working on that at the moment and second to invest in our CapEx program. What we are doing, as I think we already commented on that, we increase our factoring or working capital facilities, mainly on what we call factoring. Just a follow-up on the ABL in the U.S., what kind of size or what kind of range of size would the company think or is the company looking for? We have, I believe our borrowing base, it's at least of $100 million, and then we can we will decide what is the size of our -- the size of the ABL that we have. Once again, we're super excited about the quarterly results we have reported today and with the prospects for the company."
}