{
    "symbol": "GSM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-16 13:30:28",
    "content": " Specific to the third quarter, our revenues declined 29% from record levels in Q2 to $593 million, and our adjusted EBITDA declined by 39% to $185 million. Silicon metal revenues was $264 million in Q3, down 26% from the prior quarter. During the third quarter, we have seen European aluminum producers curtailing production by 50% due to unsustainable energy prices causing a decline in demand for silicon metal and negatively impacting our market price. The average realized price of our silicon metal sale was down 7.6% over the prior quarter, resulting in a negative impact to EBITDA of $11.1 million. While adjusted EBITDA contribution for silicon metal of $130 million was down from last quarter record level, it remains strong compared to prior years. Costs from silicon metal negatively impacted adjusted EBITDA by $8 million driven by higher raw material costs, particularly coal and energy, which impacted costs by $6.4 million and $1.4 million, respectively. Silicon-based alloys revenue was $170 million in Q3, down 24% over the prior quarter. Adjusted EBITDA was -- for Q3 was $60 million, down 39% from the second quarter. Sales volume declined 15% over the prior quarter, negatively impacted EBITDA by $10 million, while average realized pricing was down 11% over the same period, negatively impacting EBITDA by $26 million. Sales volumes declined 37% over the prior quarter, negatively impacting adjusted EBITDA by $10 million, while average realized pricing was down 20% over the same period, negatively impacting EBITDA by $32 million. Revenue for the third quarter was $593 million, down 29% from the second quarter due to volume declines and lower prices from record levels in the prior quarter across all our product categories. During Q3, the overall impact of energy prices in the Spain was unfavorable $2.8 million quarter-over-quarter, and our average realized unit cost of energy in Spain increased by approximately 11%. During Q3, we generated $5 million -- $55 million in operating cash flow, I repeat, $55 million versus a record level of $165 million in the prior quarter. Just for modeling purposes and given the South Africa restart and maybe taking a step back and looking at coming from 2021 to 2022, there was a pivot within the company away from -- and this is specifically for silicon metal that I'm discussing not the other business lines but a pivot away from fixed annual contract prices where it's a fairly de minimis amount of the contract structure in 2022."
}