{
    "symbol": "GSM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 15:01:01",
    "content": " Adjusted EBITDA for this segment declined from $130 million in Q3 to $89 million in Q4, down 21%. Our average realized price for silicon metal sales decreased 11% compared to the previous quarter, resulting in a negative impact on EBITDA of $16 million. Adjusted EBITDA for Q4 was $37 million, down 38% from the third quarter. Sales volumes declined 19% over the prior quarter, negatively impacting EBITDA by $9 million, while average realized pricing was down 13% over the same period negatively impacting EBITDA by $22 million. Cost was favorable relative to the prior quarter, mainly due to energy compensation in France of $8 million and CO2 compensation of $2 million, which was partially offset by higher coal price in Europe, which amounted to $2 million. Sales volumes were up slightly over the prior quarter having a negligible impact on adjusted EBITDA, while average realized pricing was down 7% over the same period, which negatively impacted EBITDA by $11 million. Our adjusted EBITDA in the fourth quarter was $130 million, down from $185 million in the prior quarter, representing a decline of 30%. Overall, volumes declined by 60% over the prior quarter, which had a negative impact to adjusted EBITDA of $41 million. Higher costs adversely impact adjusted EBITDA for the year by $324 million, driven by higher energy prices in Spain and higher raw material prices, partially offset by energy compensation in France of $50 million. We ended Q4 with a cash balance of $323 million up from $237 million in the prior quarter, an increase of $86 million driven by working capital release and EBITDA generation. Net debt declined from $194 million in the third quarter to $137 million at year-end, the lowest level in the company's history. What I can tell you is that, we have a pretty solid target reduction of $55 million in Q4, but we expect a reduction between $90 million and $120 million due to working capital in the first quarter. We will now take the next question. Your line is open. And going back to the annual 2023 EBITDA guidance range of $270 million to $300 million, I believe you offered a sensitivity of $8 million for a 1% change in volume. We will now take the next question. Your line is open. We will now take the next question. Your line is open. We will now take the next question. Your line is open. We will now take the next question. Your line is open. I was just going back to the presentation from February of 2021, where the estimates of the $470 million of EBITDA for 2023 remain decently lower silicon metal prices at least environment and a lower cost savings expectations. But there -- the key elements are; one, we have over delivered on our value creation plan, because at the beginning of the value creation plan, we expected the creation of a buffer of $180 million EBITDA, while we are creating more than that $225 million. We will now take the next question. Your line is open."
}