{
    "symbol": "EQIX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 20:11:02",
    "content": " Your line is open. And so, I think we've seen customers really, one, very committed to their digital transformation agenda; two, I do think that they -- even though they have that commitment, it's probably in the context of a sort of a broader belt-tightening environment for overall budgets. Your line is open. Your line is open. And so -- and in terms of power price increases on the rest of the portfolio, I think we're seeing it -- we're going kind of across the board in space, power as well as in the digital services, making adjustments that we think are appropriate in the market. And so, I think you're going to -- you're seeing the growth is certainly partially driven by strong pricing, and that's pretty consistent across the space, power and interconnect. And some people, you'll adjust down, but the bias is towards price increases, not only because that's how the model works, but you're really going to see that come through as again, you feel the inflationary impacts, you go through the power price increases, and it manifests itself in our -- on a currency-adjusted MRR per cabinet number across all three regions. Your line is open. As you then sort of fast forward to 2023, one of the things that we had mentioned in 2022 for the costs that we do not recover from Singapore in 2022 because we were out of market, market has moved to Equinix and part of the recovery that you're seeing and it's embedded in that $350 million is basically recovering cost that -- the cost increase in Singapore that we didn't recover in 2022. Your line is open. Your line is open. So, I'd expect to -- and then we did see a little bit of, in terms of these virtual BCs to cloud ZNs, a little lighter on gross adds, still very healthy gross adds, by the way, because the cloud -- I think cloud and workload migration continues very full tilt and despite sort of what people are saying about the reducing growth rates of their cloud business, we're still seeing that very. And then on the second part around digital services, I definitely think that we're starting to see a realization from customers and the ability of our sales teams to articulate that services like Metal and their ability to deliver more on-demand infrastructure that can help customers be more agile is something we're seeing an inflection point on."
}