{
    "symbol": "EQIX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 21:37:04",
    "content": " Your line is open. I think we're about 90% plus, or more than -- well over 90% hedged in our deregulated markets, and we're going to be topping off those positions in the coming weeks and months. And so, if you look at the -- just the quantum of growth that's happening in the cloud, in any given quarter, they're adding just the top five providers or adding $3 billion to $4 billion of incremental recurring revenue. Your line is open. As I said, I think we're going to be able to do that in a way that customers, even though they're certainly not going to applaud those price increases, I think, as they look at it, in a lot of those markets, they're feeling it as consumers and they're feeling at a very acute level. Your line is open. And I think feel really good about -- I candidly, I'm like -- I'm not sure that current level is, that's a little above the range that we've typically guided you guys to, but we will certainly take it and are pleased with the performance. Your line is open. Your line is open. And I think they see that same dynamic a little bit in cloud, right, which is people are saying, hey, we got to tighten up on our cloud bills, we got to -- we're going to reduce usage on non-mission critical workloads. Your line is open. I guess I'd sort of reposition the question to simply tell you that if you look at our performance of what we said we would do at Analyst Day -- at the Analyst Day and what we've now done, I think we continue to feel really good about the trajectory of the business. I think when the -- I think the other thing that's going to certainly aid many of us, particularly those that are U.S. domiciled, as currencies start to move the other direction, which I suspect that they will at some point, that you're also going to get wind at your back from currency. So not only do you have the momentum coming from what Charles alluded to, but I also think that you've got -- you're going to have currency movement when other -- where other sort of central banks move their rates up to the U.S. or the U.S. starts to slow down on their rate increase."
}