{
    "symbol": "EQIX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 19:42:10",
    "content": " According to IDC, by 2024, 65% of the Global 2000 will embed some sort of edge-first data stewardship, security and network practices into their organization's digital business processes, and we're already seeing the impact with an amazing 89% of recurring revenues, now coming from customers deployed in more than one metro. Global Q1 adjusted EBITDA was $800 million or 46% of revenues, up 5% over the same quarter last year at the high end of our guidance range due to strong operating performance and timing of spend, although it was impacted by the lower ex scale fees. And given the operating momentum in the business, we're raising our underlying 2022 AFFO by $22 million to now grow between 8% and 10% on a normalized and constant currency basis compared to the previous year, offset by the increased debt financing costs from the MainOne and Entel acquisitions. You may go ahead. You may go ahead. You may go ahead. You may go ahead. You may go ahead. But I will tell you that, for the most part, I think a lot of times, customers are saying, 'Hey, we're going to put -- we're going to use a mix of public cloud and private cloud, and we really need to place our data in a sort of -- in more of an inter-cloud kind of location to drive performance and to meet statutory requirements, et cetera. And so I feel good about the portfolio, and we're going to -- we stood up the digital services BU and are going to continue to make some investments there, and I think that's going to position us really well for continued enterprise momentum. You may go ahead. You may go ahead. You may go ahead. You may go ahead. And then pricing, I think in terms of its impact on MRR per cab, yes, I mean, I think that as we increase pricing due to various inflationary factors as well as due to the continued strength of our value proposition and our ability to continue to add more value for our customers, I think that's going to have a positive impact on our MRR per cab and just allow us to continue to preserve margins and drive the appropriate returns on capital. You may go ahead."
}