{
    "symbol": "OXM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-07 19:18:08",
    "content": " Sales in the aggregated group of Tommy Bahama, Lilly Pulitzer and emerging brands grew 19% and with Johnny Was contributing an additional $23 million of sales for the quarter. All of these factors, along with our repurchase activity helped drive a 23% or $0.27 increase in adjusted earnings per share from $1.19 last year to $1.46 this year. The biggest contributor to our increased earnings was our largest brand, Tommy Bahama, which delivered 20% top line growth and a $9 million increase in adjusted operating income for the quarter, with excellent results in all channels of distribution. The brand has an excellent balanced distribution model with 40% of sales coming through e-commerce bolstered by a fleet of 60 plus carefully located stores with attractive unit economics and a brand enhancing and mutually profitable wholesale business, currently generating annualized sales of over $200 million with operating margins in the mid to high-teen range, Johnny Was has a profitable growth trajectory ahead of it. As of the end of the quarter, our customer base, excluding Johnny Was customers, increased by 16% versus last year's third quarter. Consolidated net sales were $313 million for the third quarter, which included $23 million of sales for Johnny Was, growing 26% above last year's third quarter sales of $248 million, which included $4 million of sales from linear apparel. We also had $130 million of borrowings outstanding under our revolving credit agreement at the end of the third quarter of fiscal 2022, increasing from no borrowings at the end of the prior year period. We're excited to have added a business with annual net sales in excess of $200 million, the opportunity for double-digit top line growth in the future, the expectation of approximately 65% gross margins and mid to high-teen operating margins, excluding any inventory step-up charges and amortization of intangible assets."
}