{
    "symbol": "OXM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-23 22:42:01",
    "content": " Total sales grew 24% year-over-year, driven overwhelmingly by organic growth led by our largest brand, Tommy Bahama which was up 22% for the year, followed by Lilly Pulitzer and our Emerging Brands Group which increased 13% and 29%, respectively. Starting the year with $210 million in cash and short-term investments and generating substantial cash flow, we were able to invest $47 million in the future growth of our business, acquired the Johnny Was brand and all its potential for $270 million, buyback $92 million of our stock completed a $100 million repurchase program and return an additional $35 million to shareholders in the form of dividends. In 2022, consolidated net sales were $1.41 billion which included $73 million of sales for Johnny Was, growing 24% above last year's net sales of $1.14 billion which included $25 million of sales from Lanier Apparel. Additionally, we also had increased sales of $22 million in the Lilly Pulitzer's e-commerce flash sales and 14% in our outlets. Result of all this yielded $234 million of adjusted operating income or 16.6% operating margin compared to $174 million or 15.3% in 2021, with the improved adjusted operating income driven by the strong results in Tommy Bahama and the operating income of Johnny Was for the 19 weeks since acquisition in September. $20 million of additional inventory from our acquisition of Johnny Was and the early receipt of about $20 million -- excuse me, of about $25 million of incremental inventory to mitigate the risk of potential supply chain disruptions, increased raised inventory balances as well. For the full year, we expect net sales to be between $1.62 billion and $1.66 billion, growth of 15% to 18% compared to sales of $1.41 billion in 2022. The increased sales plan in the 53-week 2023 includes the benefit of the full year of Johnny Was as well as growth in our existing brands in the mid-single-digit range which consists of full price brick-and-mortar and e-commerce channel growth, generally flat wholesale and outlet store sales and lower e-commerce flash sales at Lilly Pulitzer, as Lilly Pulitzer is not having an e-commerce flash sale in the first quarter of 2023. We anticipate modest gross margin expansion in 2023, including the expectation of a higher proportion of full-price direct-to-consumer sales and a lower proportion of e-commerce flash and wholesale sales and the inclusion of the higher gross margin Johnny Was business for the full year 2023. These higher sales and improved gross margins are expected to be partially offset by increased SG&A which is expected to grow at a rate higher than sales in 2023 as we invest in our business, including information technology spend and SG&A, higher employment cost, additional brick-and-mortar locations opening in 2023 and increased depreciation expense resulting from both IT spend and brick-and-mortar locations. After considering these items, 2023 adjusted EPS is expected to be between $11.50 and $11.90 versus adjusted EPS of $10.88 last year with the inclusion of a full year of operating income of Johnny Was and increased operating income in our existing businesses being partially offset by the increased income tax expense and interest expense. In the first quarter of 2023, we expect sales of $405 million to $425 million compared to sales of $353 million in the first quarter of 2022. And by the last 1/3 of the year, we were going wide open in that function and we're very pleased that it's achieved very good results within the Emerging Brands Group and that was part of the reason that they were able to deliver that 29% year-over-year growth."
}