{
    "symbol": "OXM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-01 21:09:05",
    "content": " On an adjusted basis, we recorded consolidated second quarter sales of $363 million and EPS of $3.61, which was an 11% increase over last year's record second quarter EPS of $3.24. Our emerging brands group posted an impressive 31% year-over-year sales gain during the second quarter with all three brands Southern Tide, The Beaufort Bonnet Company and Duck Head delivering solid growth. In the second quarter of fiscal 2022, consolidated net sales were $363 million, an 11% increase over last year's second quarter net sales of $329 million. Also, inventory increases included early receipt of an incremental $27 million of fall inventory to mitigate supply chain delays or disruptions, inventory to support anticipated sales increases in the second half of fiscal 2022 and higher product costs. Full year sales are now expected to increase to a range of $1.3 billion to $1.325 billion compared to $1.142 billion in fiscal 2021, which included $25 million of Lanier Apparel sales. Third quarter sales are expected to increase from $248 million last year, which included $4 million of Lanier Apparel to a range of $270 million to $280 million, reflective of strong quarter-to-date results in our direct-to-consumer channels as well as substantial wholesale sales planned in the quarter. This expected gross margin expansion includes our expectation of lower freight costs and higher IMUs in the third quarter, partially offset by a change in sales mix with an increased proportion of Lilly Pulitzer's e-commerce flash clearance sales. Thus, as our business continues to expand, the higher SG&A associated with the growing business often results in deleveraging in the lower sales third quarter, but also allows for additional SG&A leverage and earnings growth in our higher sales quarters during the year. Another thing, I think we maybe you're having a little less disruption than many because we did adjust our merchandising calendars and we mentioned that at the end of the second quarter, we had $27 million more fall inventory on our books than we did at this time last year."
}