{
    "symbol": "SONY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-07-29 20:24:04",
    "content": " Thank you very much. FY22 Q1 consolidated sales increased 2% year-on year to Â¥2,311.5 billion, and consolidated operating income increased Â¥26.9 billion to Â¥307 billion, both of which were record high for the first quarter. FY22 Q1 sales decreased 3% year-on-year to Â¥604.1 billion primarily due to a decrease in software sales, including add-on content, partially offset by favorable impact from foreign exchange rates. Q1 sales increased a significant 21% year-on-year to Â¥308.1 billion, primarily due to the forex rate impact and the streaming revenue increase. FY22 Q1 sales increased a significant 67% year-on-year to Â¥341.4 billion, primarily due to the foreign exchange rate impact, and the increase in the delivery in Television Production and revenue increase from films released in the previous fiscal year in Motion Pictures. FY22 sales are expected to increase Â¥50 from our previous forecasts to Â¥2,450 mainly due to the forex impact partially offset by our -- incorporating the risk of market deceleration into our forecast for the second half of the fiscal year. Operating Income decreased Â¥8.8 billion year-on-year to Â¥21.7 billion, mainly due to an increase in R&D and depreciation expenses despite the positive forex impact. Operating Income increased a significant Â¥57.3 billion year-on-year to Â¥81.3 billion, mainly due to the recording of a gain on the sale of real estate completed in April and the absence of the loss record in the same quarter of the previous fiscal year from the unauthorized withdrawal of funds, both at Sony Life. Yes, we hear you. Thank you very much for the question. Yes, we hear you. Thank you very much. The impact of exchange rate at the start of the fiscal year for the consolidated operating income other than the financial services, Gaming, and ET&S and I&SS in these three segments, our sensitivity, the one yen down is Â¥1 billion and for euro that's Â¥7 billion difference. Yes, we hear you. Thank you very much. Thank you very much for the question. Thank you very much for the question. Thank you very much. Thank you very much for the question."
}