{
    "symbol": "SONY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-11-01 13:45:11",
    "content": " Consolidated sales for the quarter increased 16%, compared to the same quarter of the previous fiscal year, year-on-year to JPY2,751.9 billion, and consolidated operating income increased JPY25.6 billion to JPY344.0 billion, both record highs for the second quarter and first half. Q2 sales increased 12% year-on-year to JPY720.7 billion, primarily due to the impact of foreign exchange rates, despite a decrease in sales of third-party software. Operating income decreased a significant JPY40.5 billion year-on-year to JPY42.1 billion primarily due to the recording of expenses associated with acquisitions including Bungie, Inc., an increase in software development costs and the negative impact of foreign exchange rates, partially offset by a decrease in losses on hardware. The â\u0080\u009822 sales are expected to be JPY3.630 trillion, an increase of JPY10 billion from the previous forecast, due to the impact of foreign exchange rates, partially offset by a reduction in the sales forecast for third-party software reflecting the results of Q2. In addition, our forecast for expenses associated with acquisitions is expected to increase from the previous forecast by JPY4 billion, due to the impact of foreign exchange rates, and amount to approximately JPY61 billion. Although total gameplay time is spent by PlayStation users during Q2 increased slightly versus the previous quarter, it decreased 10% year-on-year, primarily due to the impact of an increase in opportunities to go outside resulting from a reduction in COVID-19 infections. Q2 sales increased a significant 32% year-on-year to JPY359.3 billion, mainly due to the impact of foreign exchange rates and an increase in streaming sales. Operating income was JPY78.7 billion, a significant increase of JPY28.1 billion year-on-year, mainly due to the positive impact of foreign exchange rates and the increase in sales. Primarily due to the impact of the foreign exchange rates and the results of the fiscal year so far, we upwardly revised both sales and operating income forecast, sales to  (ph) trillion, an increase of JPY90 billion from the previous forecast, and operating income to JPY265 point billion, and the increase of JPY35 billion from the previous forecast. Q2 sales increased 29% year-on-year to JPY337.5 billion, primarily due to the impact of foreign exchange rates. Fiscal year -- FY â\u0080\u009822 sales are expected to be JPY1.450 trillion, and the increase of JPY70 billion from the previous forecast primarily due to the impact of foreign exchange rates. Q2 sales increased a significant 16% year-on-year to JPY677 billion, mainly due to the impact of foreign exchange rates. Operating income increased JPY5.1 billion year-on-year to JPY77.8 billion, primarily due to the positive impact of foreign exchange rates and the impact of an increase in sales of digital cameras. Although we have incorporated the additional risk of a market slowdown in the second half of the fiscal year, our FY â\u0080\u009822 sales forecast is JPY2.510 trillion, an increase of JPY60 billion. Q2 sales increased a significant 43% year-on-year to JPY398.4 billion, mainly due to the impact of ForEx rates and higher sales of image sensors for mobile devices. Operating income was JPY74 billion, a significant increase of JPY24.3 billion year-on-year, mainly due to the positive impact of ForEx and the benefit from the increase in sales. We have upwardly revised our operating income forecast by JPY20 billion from the previous forecast to JPY220 billion, primarily due to the positive impact of foreign exchange rates. FY â\u0080\u009822 Q2 financial services revenue decreased 17% year-on-year to JPY304.5 billion, mainly due to the deterioration in net gains and losses on investments in the separate accounts at Sony Life Insurance. Operating income at Sony Life increased a significant JPY11.6 billion year-on-year to JPY54.6 billion, primarily due to the impact of the recovery of the funds that were subject of an unauthorized withdrawal."
}