{
    "symbol": "CAN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 15:02:08",
    "content": " Under these conditions we generated mining revenue of RMB 72.2 million in the fourth quarter, up 16.3% sequentially. Going into the first quarter of 2023, the bitcoin price is showing an upward trend and we are making further strides in our mining business. As a result, we delivered 1.9 million terahash per second in the quarter, contributing to approximately RMB 318 million in mining machine sales, which is better than we expected. With these positive developments in our mining collaborations recently, the company's total online mining machines are expected to reach a hash rate of 5 to 5.5 exahash per second by the end of the first quarter of 2023. Specifically, for our mining machine sales, the gross loss of RMB 136.7 million for the quarter was mainly due to an inventory write-down of RMB 205.3 million. In addition, we incurred depreciation costs of RMB 74.9 million in the fourth quarter from our growing number of deployed mining machines. Excluding depreciation, our mining profit or loss, defined as mining revenues deducting costs for energy and hosting was a loss of RMB 2.1 million for the fourth quarter. As our growing mining scale will continue to record higher depreciation and considering the modest selling price in the near term and the potential inventory write-downs as a result, we are not expecting substantial profits in the next one or two quarters. During the fourth quarter of 2022, we used approximately RMB 72 million, which is equivalent to USD 10.5 million to repurchase 3.5 million ADSs under our current stock repurchase program approved in March 2022 with an average repurchase price of $3 per ADS. In an environmental slow market recovery, I think we will actively explore mining projects and use more inventory for our mining business to generate bitcoin rewards, and we expect our installed computing power to be in the range of 5 to 5.5 exahash per second by the end of the first quarter of 2023. Regarding our mining business, we expect our mining revenue in the first quarter to further grow, assuming we increased the number of mining machines installed and online quarter-over-quarter, while the bitcoin price rebound during the first quarter."
}