{
    "symbol": "CAN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-19 14:15:22",
    "content": " Due to delivery delays during the first quarter of 2022, we have a total of 9.96 million terahash of computing power to be delivered and RMB1.77 billion of advances from customers as of the first quarter's end. By the end of the first quarter, our deployed computing power in Kazakhstan exceeded 2.4 million terahash per second, but there was volatility in the number of active machines which resulted in mining capacity during the period varying between 0 and 0.8 million terahash per second. In the first quarter of 2022, we recorded 4.3 million terahash in total computing power sold, representing a year-over-year increase of 119%. As mentioned in previous quarters, due to the continued wafer shortage across the semiconductor industry, the inevitable increase in wafer price further weighed on our profit margin, which narrowed to 61% in the first quarter of 2022, still higher than the average level of 57% in the full year 2021, but declining from 68% in the fourth quarter of 2021. During the first quarter of 2022, we repurchased a total of 2.1 million ADSs with an aggregate value of US$10.3 million, representing an average repurchase price of US$4.81 per ADS. Total operating expenses in the first quarter of 2022 were US$251.5 million, which equals to US$39.7 million, representing an increase of 21.0% from RMB207.9 million in the same period of 2021. Income from operations in the first quarter of 2022 was RMB578.3 million, which equals to US$91.2 million, compared to a loss from operations of RMB13.7 million in the same period of 2021. Net income attributable to ordinary shareholders in the first quarter of 2022 was RMB441.6 million, which equals to US$69.7 million, compared to a net income of RMB1.2 million in the same period of 2021. Non-GAAP adjusted net income in the first quarter of 2022 was RMB543.4 million, which equals to US$85.7 million, representing an increase of 279.5% from RMB143.2 million in the same period of 2021."
}