{
    "symbol": "UBER",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 22:58:03",
    "content": " Your line is now open. Your line is now open. There's a huge amount of technology that has to go into developing this kind of a system because essentially the pricing systems have to get signal based on earner behavior in order to hone in the pricing to truly price kind of that trip based on the market clearing price that earners are willing to accept that trip with, so there's a huge amount of ML data work that goes into that system, but we think it's fundamentally a better way, and the feedback that we're getting from our driver partners has been quite positive. It's exactly like introducing upfront fare to Uber riders and our being a multi-platform, multi-product business allows us to take learnings from one side of a business, apply it to the other, and instead of kind of starting from scratch, we've already – we're adolescence now using all open knowledge from our delivery business and passing it on to the mobility business. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And it maybe that the kind of consumer that's an Uber consumer is higher end, travels a lot, travels for business, et cetera, is coming to the platform pretty quickly, and obviously we're a beneficiary of that. It's not something that we have to lean into, and we're a lot less focused on, let's say, our competitors or competitors share as we are the opportunity to grow the business durably to add on new segments, such as taxi or hail-ables, two-wheelers, three-wheelers or lower cost product, whether it's high capacity vehicles, et cetera, that's really the focus and the share will take care of itself, although it has been taken care of itself. So when we think about the growth of our mobility business and the 10% incremental EBITDA margins that we are looking to deliver, our core products, let's say, Uber Eats, X, or Reserve or Black, those will tend to deliver higher than 10% incremental margins. Your line is now open. Your line is now open."
}