{
    "symbol": "ZD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 13:12:10",
    "content": " Although there was some improvement during the fourth quarter in the value of certain foreign currencies, FX negatively impacted the Q4 year-over-year growth rate, and if the comparable 2021 currency values were applied to our 2022 Q4 results, revenue would have declined by approximately 1.3%. Adjusted EBITDA from continuing operations was $168.3 million for Q4 2022, as compared with $161.6 million for the prior year period, reflecting growth of 4.1%, which would've been 5.5% when adjusted for FX. For our fiscal year 2022, total revenue grew 0.6% to $1.391 billion as compared with 2021 revenue, excluding divested businesses. Adjusted EBITDA grew 4.6% to $507.2 million as compared with fiscal year 2021 adjusted EBITDA, excluding divested businesses, and we had a 2022 adjusted EBITDA margin of 36.5%. Additionally, the company's Q4 2022 other revenues grew just over 30% year-over-year to $14.4 million, driven by sales of Ekahauâ\u0080\u0099s new Sidekick 2, which was launched in Q3 2022. Our businesses experienced the impacts of these and other factors in 2022, including the change in FX rates, and our organic revenue declines were higher in the second half of 2022 as compared with its first half. Note, as highlighted on our last call, our fourth quarter is typically a seasonally stronger quarter for revenue and adjusted EBITDA, but also typically reflects lower free cash flow conversion rate as a significant portion of our Q4 revenue is expected to be collected in Q1 2023. While our 2022 free cash flow as a ratio of adjusted EBITDA was less than 50%, we continue to target a conversion rate percentage for our core business in the mid to high 50s, excluding certain non-GAAP cash expenditures, M&A payments, and other discreet uses of cash. So, I think if we took a non-linear view on our advertising business and took a multi-year view, you'd actually see that it is not inconsistent with the kind of growth rates that we're looking for, which we've talked about as a company, we look for total growth of 15% top and bottom line with a mixture half and half roughly of organic and inorganic."
}