{
    "symbol": "ZD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 11:25:13",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to Ziff Davis First Quarter 2022 Earnings Call. On this call will be Vivek Shah, CEO of Ziff Davis; and Bret Richter, Chief Financial Officer of Ziff Davis. I will now turn the call over to Bret Richter, Chief Financial Officer of Ziff Davis. Good morning, everyone, and welcome to the Ziff Davis Investor Conference Call for Q1 2022. As the operator mentioned, I am Bret Richter, Chief Financial Officer of Ziff Davis; and I'm joined by our Chief Executive Officer, Vivek Shah. Some of those risks and uncertainties include, but are not limited to, the risk factors that we have disclosed in our SEC filings, including our 10-K filings, recent 10-Q filings, various proxy statements and 8-K filings as well as additional risk factors that we have included as part of the slide show for this webcast. Without question, the macroeconomic environment has become challenging and uncertain, with negative GDP growth, high inflation rising interest rates, continued supply chain problems, geopolitical conflict and labor shortages. Notwithstanding these challenges, Ziff Davis delivered a very strong set of first quarter results, with revenues and pro forma adjusted EBITDA, both up by over 5% year-over-year. And as I pointed out in our last call, this quarter was going to represent a hard comp for us given the relative strength of Q1 2021, and the lapping of our RetailMeNot acquisition. Overall, we're very pleased with our first quarter and to be in a position to reaffirm our guidance for the year. As we described in our last 2 calls, we've been concerned about the impact of supply chain disruptions on our advertising clients. We also saw fewer clicks from our properties to e-commerce sites, which is an important part of our performance marketing revenues. We also had the added challenge of RetailMeNot lapping itself in the quarter, which a year ago was being managed for lowered revenues but higher EBITDA. We saw double-digit growth in several of our subscription businesses, including our connectivity businesses, Ookla and Ekahau, and the benefit of several acquisitions, including RootMetrics and Moz SEO. Our cybersecurity business was a low single-digit decliner, with continued challenges in direct customer acquisition and some FX headwinds. We have a new Chief Revenue Officer at the VIPRE Group, who brings extensive experience in selling through the channel and managed service providers, which are key to the SMBs we serve. In martech, we did experience reduced email activity within our customer base in the first quarter. But when excluding RetailMeNot, which was early in its planned revenue reduction in Q1 2021 and FX headwinds, we were closer to being flat in organic revenues, which is a good outcome considering the macroeconomic challenges in the quarter. In fact, organic growth was a positive 4% when excluding our tech and shopping businesses, meaning health, gaming and entertainment, connectivity, martech and cybersecurity posted 4% organic growth. I'm also very pleased with our margins in Q1, which held at 32%, which means our acquired revenues were margin accretive, which is often difficult to accomplish in the first year of an acquisition. We will continue to be very judicious about expenditures, given the uncertain operating environment, but we'll also continue to invest in organic growth opportunities. In fact, a number of our verticals saw some strong organic growth rates in Q1, and we want to be sure to continue to support those businesses. With nearly $1 billion of cash and investments, we have the ability to deploy capital for growth, whether within our existing portfolio or to acquire new businesses. Speaking of M&A, in Q1, we acquired a U.K.-based portfolio of pregnancy and parenting brands, including Emma's Diary. The acquisition solidifies our category leadership position in the U.K., where our 3 primary brands: BabyCenter, What to Expect and Emma's Diary have a combined unduplicated reach of 2.7 million monthly users, and ranked in the #1 position among the competitive set. This transaction, like the other 2 in the quarter, is a relatively small tuck-in, but we continue to have very active discussions with larger acquisition targets company-wide. We continue to look for assets within our existing verticals: tech, connectivity, shopping, gaming and entertainment, health, cybersecurity and martech, as well as other verticals that share the high-value intent-driven nature of the ones we're in. Today, Ziff Davis is essentially a portfolio of assets that were required in the last decade, which was arguably one of the most robust sellers markets in recent memory. Nevertheless, our total acquisition spend over estimated adjusted EBITDA is just a tick over 5x. We believe we're terrific acquirers, and that a more benign market for buyers will only enhance our returns and shareholder value. First, we should have more favorable year-over-year comps for RetailMeNot; second, we expect to have new product launches that we believe have a lot of promise; third, we are getting signals of increased ad spend from major clients, including in the pharma category, where we anticipate a favorable drug pipeline, including important new drug launches and a streamlined post-COVID FDA approval process. At the same time, we have line of sight into acquisitions that could close during the balance of the year, which would leave us well positioned to add incremental revenue and adjusted EBITDA. We are excited for a new strategic partnership we're entering into with Group Black, which is a company attempting to transform the face of media ownership and investment. Group Black and Ziff Davis will collaborate to create, amplify and monetize content across Ziff Davis' portfolio of media brands. The partnership will also fund and provide new exposure for Group Black's Collective, a black-owned content creators by providing them a voice on Ziff Davis' editorial platforms, with Ziff Davis providing ad inventory to Group Black in an effort to support the deployment of advertising investments from Group Black's brand and advertising partners. We also made a $15 million investment in Group Black, which we think will generate great returns while also providing financial and strategic support to black-owned media. The report highlighted the findings from our first greenhouse gas inventory, and we have now officially committed to setting an emissions reduction target with the science-based targets initiative, known as SBTi. In recent months, we've also continued to respond proactively to some of the most pressing social issues and humanitarian crises we're collectively facing. In the early days of Russia's invasion of Ukraine, we helped evacuate our Ukraine-based consultants to Poland and our Humble Bundle community subsequently raised $20 million for several Ukraine-based charities. Needless to say, I'm incredibly proud of the work Ziff Davis has done and continues to do to respond to the enormous environmental, social and societal challenges upon us. As you may recall from our previous earnings calls, our U.K. Voice assets were sold in February 2021, and we completed the sale of our B2B backup business in September 2021. Our Q1 2021 GAAP income statement reflects the financial activity related to Consensus through October 7, 2021, in discontinued operations. We will focus our discussion today, and my commentary will primarily relate to our pro forma non-GAAP financial results from continuing operations, which exclude the contributions from the Consensus business for the periods up through the date of the spin, and exclude the contributions from our divested businesses for the period that they were owned by Ziff Davis. We reported pro forma revenue from continuing operations of $315.1 million for the first quarter as compared with $299.1 million for the prior year period, reflecting growth of 5.3%. Pro forma adjusted EBITDA from continuing operations was $100.8 million for Q1 2022 as compared with $95.9 million for the prior year period, reflecting growth of 5.1%. On Slides 5 and 6, we have provided performance summaries for our 2 primary sources of revenue: advertising and subscription. As you can see on Slide 5, and as discussed earlier by Vivek, Q1 pro forma advertising revenue declined by 4% as compared with the prior period. However, advertising revenue has grown 21% during the last 12 months. Our net advertising revenue retention and annual trailing 12-month statistic that we update quarterly, was 106.6%, above our 100% metric goal. As defined in the slide, in the first quarter, Ziff Davis had 1,950 advertisers, with average quarterly revenue per advertiser in excess of $87,000. In Q1, we reported a year-over-year increase in our number of advertisers as well as a year-over-year decline in revenue per advertiser. This primarily reflects 2 factors: the number of advertisers in our health and wellness business grew by more than 30% year-over-year, primarily due to the impact of M&A, including the acquisition of Lifecycle Marketing in Q1 2022. These acquired businesses added advertisers to our base, but are generally characterized by lower quarterly revenue per advertiser than certain of our other businesses. As noted earlier, we also experienced pullbacks and delays from a number of large advertisers, both in our health and wellness business, but also in technology, shopping and entertainment. Sequentially, our average monthly revenue per subscriber increased by nearly $1 to $21.28, driven by an increase in subscription revenues within our higher ARPs offerings, including within connectivity, which had roughly 13% sequential subscription growth and a slight decline in subscribers, primarily within our VPN solutions. Additionally, the company saw its Q1 2022 other revenues grow by more than 100% year-over-year to more than $9 million. Revenues from businesses owned for at least a full 12 months are included in organic revenue, while acquired revenues relate to businesses that we've owned for less than 12 months. For the last 12 months, we achieved a 7% organic revenue growth rate. As discussed earlier, for the company as a whole, organic revenue growth was negative 3% for the first quarter of 2022. Vivek highlighted a number of factors that contributed to this organic revenue decline, including the acquisition of RetailMeNot, and to a lesser extent, foreign exchange rates. We have significant cash liquidity with $629 million of cash and cash equivalents as of quarter end, more than $350 million of short- and long-term investments, and significant leverage capacity both on a gross and net leverage basis. We continue to be committed to keeping gross leverage at or below 3x adjusted EBITDA, and we are currently well within this metric with our Q1 2022 gross leverage of 2.3x trailing 12 months adjusted EBITDA. At quarter end, our net leverage was 1x and only 0.3x if you include the value of our financial investments. However, we believe that we have the flexibility to continue to pursue various capital allocation alternatives in an effort to enhance shareholder value, particularly M&A alternatives. As announced on our fourth quarter and full year 2021 call, during the early part of the first quarter of 2022, we repurchased $54.6 million of our 4.625% senior notes, and $58.7 million of our common shares. During the first quarter, we also deployed approximately $30.8 million in cash related to current and prior period acquisitions. As you may recall, the midpoints of our revenue, adjusted EBITDA and adjusted non-GAAP income per diluted share guidance imply growth rates of approximately 10%, 13% and 9%, respectively, as compared with the 2021 pro forma results from continuing operations that we presented in February. Following our business outlook slides are our supplemental materials, including reconciliation statements for the various non-GAAP measures to the nearest GAAP equivalent. Please also note that the cash and cash equivalents associated with discontinued operations as of the end of Q1 2021, as presented in our 10-Q as supplemental information related to our Q1 2021 condensed consolidated statement of cash flows, include certain pooled cash from certain of our retained cloud businesses, as during Q1 2021, certain of their cash was reflected in bank accounts that were ultimately assigned to Consensus. While our first quarter 2022 cash flow does not reflect impacts of the operations of Consensus or the recently divested assets, it does reflect the seasonally high impact of working capital activity. As I noted on our last call, the timing of working capital is subject to quarterly fluctuations, but most working capital elements do resolve within any 12-month period. As I noted on the prior call, on an annual basis, we expect free cash flow to approximate adjusted EBITDA less capital expenditures, interest and taxes, the impact of working capital and any sources and uses that are excluded from our non-GAAP financials. And again, given the timing of interest tax payments and changes in working capital, quarterly cash flows can fluctuate meaningfully. Overall, we are pleased with our Q1 2022 performance, having achieved growth in a number of our key financial metrics in a challenging environment. Vivek, you mentioned new product launches in the second half of the year. And then maybe for Bret, last quarter, you guided to ad growth in the high single digits this year and subscription growth in the low teens. With respect to second half product opportunities and rollouts, our Ekahau business, which is in our connectivity business unit, is going to roll out its second version of a product called Sidekick, which we're very excited for and see a great deal of potential in. We actually have an exciting partnership with the Cleveland Clinic within the Everyday Health Group, which will ramp up in the second half, and we believe will represent some incremental inventory. Our Baby Center business in our parenting and pregnancy unit has developed a set of courses, which we are going direct to consumer that we think have some great potential. So really, at every one of our businesses, there are a set of opportunities and products that we're rolling out that we had invested in developing really last year, and we think do have potential for us in the second half. With regards to that guidance, at this point in time, and it's earlier in the year, we're not going to revise that. We're subject to broad consumer trends as well as sort of meaningful decisions by discrete enterprises that we work with, particularly in the advertising community. On a quarterly basis, and even throughout the year, those trends could impact our performance. But importantly, in reaffirming our expectations for the full year, we think we're off to a good start, and we look forward to the balance of 2022. So look, it looked like net retention, it's above the 100%, but -- you talked about it, it did -- the advertising net retention did tick down, I think, meaningfully from Q4 to Q1. Look, I think that if you look at what took place in Q1, the advertising revenues did decline, and that decline came primarily from some of our larger clients pulling back. I think what really did happen in the first quarter is supply chain and the other challenges that I delineated did curtail their spend, not just with us. I mean, I think you're seeing this across the entire ecosystem. I think, look, the other thing I would also say is that the advertising business is lumpy. But really, I think it's just more a function of some of the headwinds we experienced in the advertising market in Q1. With regards to the churn rate, I mean, it's partly arithmetic in that it's a -- this is revenue churn versus customer churn. And since it reflects sort of a broad look over the business as opposed to sort of a key performance indicator that we manage across a set of businesses that have common characteristics, we're mixing large enterprise customers against small customers. We saw loss of revenue in a couple of spots in our connectivity business, which are large contracts. But interestingly, that was one of our best-performing businesses for the quarter and adding new revenue. And I believe we'll continue to look at these metrics and refine them and make sure that they're the right indications of the business overall, which again, is a complex mix of different businesses. So with respect to M&A, I take one step back and just reflect on what we accomplished last year, which I think is exciting when we think about our go-forward acquisition program. So through a variety of actions, including the spin-off of consensus, and the disposition of other assets back up, some voice assets, et cetera, what we now have today are 7 discrete platforms of the company, platforms for acquisitions. Each of those has a robust pipeline of opportunities and they're competing, as you know, for the company's capital. At the same time, at corporate, we're always looking for the eighth platform. What we're seeing on the seller side of the market is something I haven't seen in the 10 years that we've been doing this, which is sobriety. And so from our point of view, the combination of how we're structured today, the views amongst the -- in the marketplace amongst sellers, and then add to that, we've never had a balance sheet like this. But if we've been able to construct over the last 10 years, a company that, of our size, deploying $2.8 billion in capital doing, at our midpoint, $540 million, $550 million of EBITDA, I’d start to get very excited about what we can do in a different environment and how we can generate even better returns for shareholders. And with regards to the second question, first, thanks for recognizing we don't provide quarterly guidance, but maybe I can connect a couple of dots for you. And on our fourth quarter conference call when we presented our guidance for , we highlighted that we thought the revenue sort of distribution over the year would be lower in the first quarter on the order of 20%, we were in and around that, and higher in the fourth quarter on the order of 30%, which is our seasonally busiest and strongest quarter with regards to revenue, particularly advertising revenue. We're obviously expecting second half strength, and that is -- there's a lot of dependencies there, including the macroeconomic environment, which is get through the year, it's been less than friendly, but we feel good about the numbers, and we'll continue progressing towards those goals. Vivek, it sounds like it's a very exciting period for you guys. And we've talked about in the past, we generally -- because most of the activity is taking place at the various platforms, the various business units and verticals, by definition, the size of those deals are kind of small to midsized. And because there's such internal demand and we want to spread our capital, we tend to favor those sized deals. As I've also said, though, in the past, we have been open to larger deals: the Everyday Health deal, the RetailMeNot deal, those were deals in the $400 million territory, which is how I would define large for our company. So we do take a look at quite a bit, but I think our wheelhouse is in the $75 million to $150 million of value type proposition. In terms of frequency and velocity, we try not -- I try not to ever answer that question, because I don't want that to be what is a goal for anyone inside this company. To me, we're trying to deploy capital over long periods of time in the most thoughtful and sensible manner. And then, Vivek, you also mentioned in the advertising business, you guys saw fewer clicks on your sites. So in the advertising business, just as a reminder, the health and gaming and entertainment advertising businesses and categories were growers for us and did very nicely in Q1. That is the affiliate commerce business, that is an important part of our performance marketing business and an important part of the tech and shopping vertical. So when we say commerce clicks are down, it's the same as saying that e-commerce sales that we get compensated on were down, which is a, I think, probably seen in many places, very tough comp. For us, in particular, remember, we're lapping RetailMeNot, which is the single largest source of affiliate commerce and commerce clip, so that probably gives you some texture. It's all sort of saying the same thing, all where we've had our issues. What I will say to you is, though, that you're right, like our business model is such that it's the factors that create pressure, near-term pressure on our revenues exist. So for us, it's -- I can't say we're in a can't lose situation, but it does feel like we've got an interesting dynamic here. But at the same time, we believe that some of the pressures in Q1 are unique to us, and the RetailMeNot piece, by the second half, the comps get better and easier for us. And as I've said, the investments we've made up until this point in product I think will help us in the second half as well. But right now, we are seeing signs of some improvements that we think will show up mostly in the second half. Look, I think as Bret described, and as we have said in the past, as capital allocators, we are always weighing the various options for our capital, which generally, for us, our acquisitions, as you said, share repurchases, we've done some debt repurchases and then obviously, capital expenditure. And look, I think that when we see the market value in the company in the way it is today, we're at a historically low multiple. I think we have a, what I view as a very strong Q1 print, I feel like 5% top bottom line in this environment, really organic essentially getting close to flat if you take -- if you exclude RetailMeNot and some FX headwind, I think, a very good outcome, strong margins. At the same time, when we see the market presenting acquisition opportunities, we like to deploy capital that way. The good news right now is there's a fair amount of capital for us to really think through the capital allocation mix, and that's no different than at any other time. This has been the way we've been operating now for the last handful of years, really since I've come in as CEO."
}