{
    "symbol": "S",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-06 21:56:04",
    "content": " I would like to remind you that during todayâ\u0080\u0099s call, we will be making forward-looking statements regarding future events and financial performance, including our guidance for the fourth fiscal quarter and full fiscal year 2023, as well as certain long-term financial targets. Please refer to the documents that we file from time-to-time with the SEC, in particular, our annual report on Form 10-K and our quarterly reports on Form 10-Q, including our filings for Q2. Except as required by law, we assume no obligation to update these forward-looking statements publicly or to update the reasons the actual results could differ materially from those anticipated in the forward-looking statements even if new information becomes available in the future. During this call, unless otherwise stated, we will discuss non-GAAP financial measures. We reported another quarter of triple-digit revenue and ARR growth combined with significant margin expansion, meaningfully ahead of our guidance. Once again, we achieved a Rule of 60, we were raising our full year revenue and margin expectations. While the impact of macro challenges has become more pronounced, cybersecurity remains mission-critical. Our platform is purpose-built for leading efficacy, cost efficiency, scalability and ease of use. On todayâ\u0080\u0099s call, I will focus on two key areas; one, details of our quarterly performance including customer growth and expansion, as well as the broader demand and macro dynamics; and two, the actions we are taking to enable our path to profitability and execute in todayâ\u0080\u0099s environment. Financially, we have taken a more prudent approach to investments like moderating new headcount growth. We once again delivered triple-digit revenue and ARR growth fueled by the adoption of our Singularity XDR platform across endpoint, cloud and identity. We have consistently combined rapid growth with meaningful margin improvement, showcasing strong unit economics and scalability of our business model. Our customer base now exceeds 9,250. Thatâ\u0080\u0099s well over 3,000 more businesses added in just the last 12 months. Our customers with ARR over $100,000 grew nearly 100%, reflecting continued traction with larger enterprises. For example, an iconic media brand chose SentinelOne for our superior performance across endpoint, cloud and data retention. In another example, a global consumer brand consolidated on SentinelOneâ\u0080\u0099s cloud-native platform, reflecting several legacy and next-gen competitors. Building on our partnership with CISA, we also extended our success in the federal arena by securing three new agencies during the quarter. With existing customers, our net retention rate remained extremely strong at 134%. This is driven by footprint expansion and rapid adoption of our adjacent solutions by our 9,000 plus customers. Q3 was a record quarter for Singularity Cloud, which once again remained our fastest-growing solution in Q3. We are seeing strong adoption of cloud security among new and existing customers, reinforcing the ease of deployment and superior protection from our cloud workload security solution. A leading software company selected Singularity Cloud, despite having deployed a competitive next-gen EDR solution on their endpoints. Separately, a large existing customer expanded coverage for the third quarter in a row. Given the breadth of our platform and expanding customer base, we believe we are still in the early innings of a very large expansion opportunity. Our momentum with channel partners continues to shine, especially with our strategic partner ecosystem, including MSSPs and incidence response providers. Our partners and customers want automated solutions that reduce reliance on human intensive processes, while offering best-in-class protection. We have designed our platform to support multi-tenancy, fully customizable role-based access control and a full set of open and documented APIs. Consistent with many other software companies and even our competitors, we are seeing higher cost consciousness and prudence around IT budgets. Together, these factors contributed to a softer net new ARR than we had expected in decelerating growth. Still, we are growing at a very healthy pace with ARR growth over 100%. While we are not experiencing the cancellations, we are seeing elongated deal cycles and budget adjustments. For instance, several large units that pushed beyond Q3 have already closed in Q4 with some closings to-date after the quarter ended. Also, pricing remains healthy and our technical win rates remain extremely strong. Our pipeline once again grew to a new high, giving us confidence in the opportunity in front of us. Shifting gears to the second key topic, the steps we are taking to increase productivity and to enable our path to profitability. We are streamlining our teams, elevating executive leaders and ramping our sales reps. We believe we can elevate our execution further regardless of market conditions. Next, to further accelerate our new customer growth and shortened sales cycles we have combined sales and solution engineering under one organization to improve velocity of execution and customer engagement in every region. And finally, a more tactical change, replacing a higher emphasis on the largest account opportunities in our pipeline. Based on what we are seeing and the steps we are taking to adjust to evolving conditions, we are well positioned to deliver seasonally strong growth in Q4. We are gaining share across multiple large market segments, endpoint cloud and identity. We are increasing our focus on cost management and productivity, and calibrating our investments with the pace of growth. Over the last two quarters, we have adapted to evolving market conditions, taking a more prudent approach to investments. As a result, we have delivered significant margin upside for two consecutive quarters with over 25 percentage points of improvement in Q3. As we saw the early signs of macroeconomic challenges, we started to adjust investments accordingly, such as moderating the pace of hiring. Going forward, our focus as a team is to ensure that our time and to profitability does not deviate across different economic or growth scenarios. Taking a step back, over the past few years, we have built a truly disruptive and technically superior security platform. We have challenged the status quo of legacy and next-gen security vendor and the like in the pursuit of enterprise trust, collaboration and protection and we are succeeding. In addition to best-of-breed security, customers can optimize their total cost of ownership by consolidating on our Singularity platform. This value proposition is compelling, especially in a higher cost-conscious environment. We are the only company with leading results in all three macro evaluations across endpoint, identity and managed services, which demonstrates platform superiority of our product and services. We are committed to innovation, listening to our customers and empowering businesses with the best security resources. Todayâ\u0080\u0099s market requires a relentless focus on optimizing and efficient execution, as evidenced by our improving margin profile and strong magic number. We believe the opportunity in front of us across endpoint, cloud and identity security is larger than ever before. After more than five years of building the business, Nick has made a decision to transition from President of Security to an advisory role. As a reminder, all margins discussed are non-GAAP unless otherwise stated. We once again delivered high growth combined with meaningful margin expansion, showcasing the efficiency of our business model and strong unit economics. In the third quarter, we achieved year-over-year revenue and ARR growth of 106% and ARR grew to $487 million. We had a net new ARR of $49 million in the quarter, driven by a combination of new and existing customers. Compared to our expectations, the lower net new ARR was largely due to macroeconomic conditions impacting the timing and size of new enterprise deals. In many cases, we have either closed the deals in our fourth quarter or secured technical wins and are awaiting deal closure. Nonetheless, we are still delivering significant growth. Our customers with ARR over $100,000 grew nearly 100% year-over-year to 827, much faster than the total customer count and growth from customers with ARR over $1 million for even faster. Therefore, with some direct SMB customers facing budgetary pressures, much of that impact is offset by the strength and shift to our MSSP ecosystem. Our ARR per customer increased sequentially, reflecting the strength of our business among large enterprises and the adoption of more of the Singularity XDR platform in spite of recessionary concerns. Our net retention rate remained north of 130%, driven by strong subscription expansion and cross-sell of adjacent solutions. Our gross margin in Q3 was 71.5%, an increase of 5 percentage points year-over-year. I canâ\u0080\u0099t overstate the progress we have made on gross margins, improving nearly 20 percentage points since the beginning of last year. We are seeing continued benefits from economies of scale, data processing efficiencies now including a data set back end and module cross-sell. Looking at the rest of our P&L, we delivered substantial operating margin improvement expanding 26 percentage points year-over-year to negative 43%. As market conditions evolve throughout the quarter, we became more selective with our investments. As a result, we outperformed our EBIT margin guidance by14 percentage points. On a dollar basis, we also reduced our operating losses compared to the prior quarters of fiscal 2023. In Q4, we expect revenue of about $125 million, reflecting growth of 90% year-over-year. For the full year, we are raising our revenue outlook to $420 million to $421 million, reflecting 105% growth. While we donâ\u0080\u0099t specifically guide for ARR being a subscription business, our year-over-year revenue and total ARR growth tracked closely. To be clear, we expect Q4 net new ARR to increase by at least 20% sequentially compared to the third quarter. We believe this is a prudent view and reflects a continuation of the macro headwinds we experienced in Q3, yet we are in a position to deliver a seasonally strong end of the year. We have taken a major step forward as a company, operating above 71% gross margin and moving closer to the long-term gross margin target of 75% to 80% or higher. We expect Q4 operating margin of negative 39%, up 27 points year-over-year and implying a Rule of 50 for the quarter. At the same time, we are improving our full year margin outlook to negative 51% to negative 50%. Our long-term margin targets remain intact and our goal is to reach operating breakeven for fiscal year 2025, which is primarily calendar year 2024. Thinking longer term, let me shed some light on our growth drivers and our path to profitability. Over the past several quarters, we demonstrated the ability to remain dynamic and deliver significant margin outperformance even as growth moderates. While growth is slowing because of macro conditions in the near-term, we remain confident in our ability to deliver high levels of growth next year and beyond. Based on a prudent view of the current economic environment and expectations of further macro deceleration, we believe we will deliver at least 50% total ARR growth in fiscal year 2024. This is also based on our growing pipeline, strong win rates, high retention and expansion rates, and the enterprise need for security. From a bottoms-up perspective, expansion from our installed base of over 9,250 customers remains durable. On top of that base of growth, we are securing hundreds of new customers every quarter. We see tremendous potential in endpoint, cloud and identity, and expect to continue to take market share and expand with our existing customers, and our strategic channel partners like MSSPs give us a unique exposure to fast-growing portions of the market. As we crossed $0.5 billion in ARR, a milestone for any company, our focus is on continued growth and profitability. Indeed, we are looking carefully at our cost and parts of the business that can be more operationally efficient. We donâ\u0080\u0099t intend to sacrifice growth, but we are moderating the pace of our investments and focusing on the most strategic areas. When thinking about our path to profitability from here, consider our Q4 margin guidance. Continuing this progress forward, we expect another 25 points of operating margin improvement in fiscal year 2024 and our goal is to achieve profitability in fiscal year 2025. Our strategy is to dynamically invest in our technology and business, while enhancing our path to profitability. In summary, Q3 was another strong quarter despite the near-term turbulence. Your line is now open. Tomer, maybe just for you, a lot of helpful commentary around the macro, and clearly, itâ\u0080\u0099s hitting everyone. But I was wondering if you could just talk a little bit about the competitive landscape a bit, and in particular, Microsoft. I think that, by and large, the competitive dynamics stays relatively the same as we have seen in the past few quarters, past couple of years. All in all, folks look at best-of-breed security pretty much in the same token as they have had. If you look at integration costs, management costs and then DDR services or any affiliated service that actually bumps up the price in a pretty significant manner. The second dynamic I want to highlight is that we have seen more and more Microsoft displacements, customers rebounding from Microsoft offering. Some citing it as eventually an eventual cost terms, the most expensive solution they had to manage over the years. We havenâ\u0080\u0099t seen any major shift, and again, if at all, we are seeing more displacement. And we feel that better be security, even in an environment where people focus on cost will still prevail in a lot of the cases. MSSP for us, again, itâ\u0080\u0099s a highly strategic go-to-market motion. For the first time, we have actually enabled them to sell new modules that happened last quarter for the first time. Right now, we are still laser focused on addressing core security needs like EDR and EPP. So, all in all, we feel thatâ\u0080\u0099s going to be a sustained and resilient part of our business, especially as you see SMBs trying to avoid not the technology and software costs, but really the overhead in recruiting more and more headcount into their security teams and are looking to offset that by procuring direct services, scale services from the MSSP ecosystem. So, again, even in this environment, MSSP is definitely a shining point for us. Your line is now open. You gave a guide -- preliminary guide, I guess, is the right way to say it for FY 2024, 50% ARR growth. We think that the ARR, letâ\u0080\u0099s call it, tentative guidance for next year is really a floor. In terms of our OpEx spend, we have always said and you have definitely seen this over the past couple of quarters where we beat by 17% and 14% in terms of operating margins. So if you look, we have made great strides in the years past. It seems like business is really decelerating very sharply from September to October and then October into November, broadly. What we are seeing is that a lot of the linearity -- generally, linearity is something that is also under our control. So when we look at our deal inspections, when we dive deep into what we see in the pipeline, we reckon that at the end of the day, a lot of the ability to progress linearity lies within our hand. Itâ\u0080\u0099s something that we can, to an extent, mitigate by just performing better and itâ\u0080\u0099s something that as we kind of enter Q4, we see it as something that is much healthier than what we have seen in previous quarters. So to us right now, we feel pretty confident in the guide that we gave for Q4. To us it embodies every factor that we have seen in the past couple of quarters, and once again, we feel, given our seasonality, given our linearity is something that we can stand behind. Your line is now open. Tomer, I think, you alluded to some deals that slipped out of Q3, but closed in fiscal Q4 and these were some pretty large deals. And then secondly, for Dave, you mentioned, operating profitability in fiscal 2024. When we look at the deals that slipped, several millions closed in the days that follow. The second one we are seeing and oddly enough, we have actually added more and more large deals this quarter than ever before, more large logos than ever before. So, all in all, we kind of feel like we are recalibrating around the new realities in our market. But once, again, we feel highly confident that we can continue to operate in this environment. And Hamza, to answer your second question, we have talked about timing of free cash flow, in creating free positive cash flow. Your line is now open. Just wanted to start out with, maybe a little bit of additional color on how you think about driving more productivity out of your existing sales teams, while also driving this additional cost savings. I think we have mentioned that, we have just recruited a ton of great talent in the past year and a lot of these folks, especially on the sales side, are actually ramping and still ramping. And naturally, as they progress down the line, as you can imagine, people that have been in the company less than a year are not as productive as people that are in the company for year and a half or two. With that, we have also combined the solution engineering and sales engineering to create a more, sorry, and the sales organization to create a more curated experience for customers. As more and more of our business is moving upstream, that to us remains, again, a strategic go-to-market element and avenue that we feel is just getting stronger and stronger for us. But, all in all, the ramp, enablement and eventually the changes we have made in our go-to-market organization are already yielding results for us and we are going to continue and drive that into the future. I mean, they just want to procure for now versus any aspirational note counts that they might have planned for the future and that to me is the prevailing dynamic. I mean these customers are now choosing the core components of our platform and later on as they progress with time, we have the ability to go back and upsell them on adjacent models, on more seat counts and really stay true to what customers need in this environment versus just trying to sell them more and more. Your line is now open. Tomer, start with you just with respect to some of the items that you itemized around the go-to-market and sales operations changes. And then, Dave, for you, kind of building off the last question, you talked about cash conservation and cash management sensitivity in your customers. So when I look at your deferred revenue performance, it was a little bit lighter than we were looking for. So on Nickâ\u0080\u0099s succession, you might recall about 6 months ago, we have added Vats Srivatsan as our COO, and by now largely we moved a lot of these functions that were under Nick under Vats as well. The second part is that, obviously, I am taking a more active role in the go-to-market organization, and as a whole, we have put more emphasis on executive sponsorship throughout the entire process. But at the same time, we also remain opportunistic and if we feel like we can inject another highly tenured sales executive, we might hope to do so in the future. And Fatima, to answer your second question in regards to free cash flow, what -- I think you are seeing two dynamics. You are seeing, one, where customers just arenâ\u0080\u0099t prepaying for multiyears, which was more prevalent in the past and then you are also seeing the shift to MSSP, where they tend to be paying quarterly versus larger upfront deals. Your line is now open. Tomer, I was intrigued by the customer win you mentioned that chose Singularity Cloud despite running a competitor on their endpoints. And as you can imagine, we have got two main competitors, you can pick each one of them that you wish for the purpose of illustration. But at the end of the day, it allows us to come in with a truly unique offering right now for cloud workload protection that is far superior to what any other endpoint vendor can provide on the cloud side and on those merits we come in, we secure the cloud environment. We have had quite a few of those in the past couple of quarters and it remains, again, competitive advantage that we have, not only in our own existing accounts, not only is now a wider platform, wide offering that spends endpoint and cloud and serves as another differentiator. But once again, in the standalone situations, you are sometimes looking at footprints that are in the cloud are actually bigger than the footprints on the endpoint side. So for us, more cloud deals and the more cloud deals that we can do, itâ\u0080\u0099s incredibly serving to our go-to-market motion. Cloud was again our number one fastest-growing module, and we just invest more and more in an offering that right now is a leg above what anybody else can offer in the space. Others in the broader market are calling for no seasonal budget flush, no Christmas this year, even sequential declines in Q4. Well, we are assuming that the macro conditions continue and persist into Q4. One, we have a higher concentration of larger deals historically in Q4. If you look traditionally, we were about 40% sequential growth. Just to add to that, I mean, we feel like we have got all the raw materials to get there and right now we are just kind of re-rating on our ARR. And with that, as Dave mentioned, record pipelines entering into the quarter, better linearity than last quarter that I mentioned just a few moments ago, all of those give us increased confidence that we can hit the Q4 number, potentially even do better. We have never been a company, I think, that have companies just come to us and say, hey, I have got a bunch of budget I need to spend it. When customers work with us, we are trying to do whatâ\u0080\u0099s best for the customer and we are trying to make sure that we provide a solution for them. Your line is now open. I think, generally, I mean, it will be typical to our business. It might be a bit more smoothened out, but again, at large, I would say, it remains relatively the same. As we look into next year, we believe thatâ\u0080\u0099s going to be one of our stronger propositions. I mean to us, being still in the early days of our integration, we believe we havenâ\u0080\u0099t fully unlocked the potential in that acquisition and in identity security in general. With that, obviously, macro impacts everything and identity is no different. But, generally speaking, as we go into next year with a fully-integrated offering. We feel thatâ\u0080\u0099s the best way to unlock the identity perspective, both in terms of the go-to-market and our sellers being able to sell identity as a holistic part of the platform and also technologically speaking, the product will be completely integrated into our endpoint technology. Your line is now open. I mean, just given that dynamic that MSSP to an extent masks some of these things from us. But as we look at our own direct contribution in MSSP, it remained relatively in line with past trends. So we havenâ\u0080\u0099t seen anything too dramatic going in SMB, but what we have definitely seen is MSSP on the rise, MSSP taking more customers from the direct business. So even if you look at kind of our customer count as an example, a lot of these customers that we have added in the quarter are actually masked by one master MSSP service provider that basically onboard-s all of these customers. So, all in all, we feel that between MSSP and our direct strength in SMB, we have seen largely consistent execution, and we feel that should continue into the future as well. And then a lot of the congos we have had with cyber professionals, has just been around -- the next real frontier is IoT, which remains a lot West. If you ask me, itâ\u0080\u0099s a must-have, I donâ\u0080\u0099t know thatâ\u0080\u0099s the same in the eyes of customers just yet. I think market education always lags the tiny bit the threat landscape, but we believe that as you kind of go into more and more of this need to actually map out your entire asset environment, all your devices and get addressed when your entire network, Ranger is one of the imperatives that can help customers fast to map out their environment and then provide for better protection and better hygiene. So it remains, again, a leading module for us and one that I hope we will see even more contribution in the next couple of years. Your line is now open. Tomer, lots going on with macro, but I have an update on what you are seeing in terms of customer interest around the broader XDR strategy and the data set product. Itâ\u0080\u0099s actually one of the top most priority for a lot of enterprises out there just on the account that these XDR projects when they deal with two data ingestion, like the proposition that we have with Singularity XDR are actually means to offset cost away from legacy data processing solutions. So especially in this macro environment for true XDR data down solution and especially if itâ\u0080\u0099s one that already exists in your environment, if you are a user for Singularity XDR or for our EDR or for EPP, you can start ingesting data into it and save cost. Still very, very early in that cycle, still applicable to just a narrow band of use cases. But as we go and execute towards next year, we are adding more and more use cases for customers to be able to enjoy the cost benefit, but now also make sure that thereâ\u0080\u0099s a business outcome thatâ\u0080\u0099s associated with it across security and all the way to finance and business operations. Your line is now open. So you talked about gaining market share, seeing more Microsoft displacements, your pipeline is at an all-time high, your preliminary outlook for ARR suggests that net new ARR is only going to grow by 8%. I mean, a, we are really, really looking to put some form of a conservative prediction at a time where we donâ\u0080\u0099t believe we can predict anything really. Our assumption is that things are not going to get better anytime soon, and just on the account of that, we want to make sure that we donâ\u0080\u0099t put two aspirational target out there for our growth. And as Dave mentioned, to us, we have always been incredibly nimble, incredibly agile in how we spend and how we expect growth, and we will continue keeping an eye as to when we can maybe press more on the gas pedal and maybe accelerate growth versus taking a more prudent and conservative approach to our growth. So, all in all, this just to us means that we want to make sure that we are being responsible custodians and are giving the conservative view of the most that we can see, and right now, to be perfectly honest, thereâ\u0080\u0099s not much that we can predict to next year, so we are taking that view. I mean, obviously, these agencies are sometimes just incredibly sizable, and for us, I mean, even the initial land is a massive deal, but all of them are just initial lands that will grow over time. For some, thereâ\u0080\u0099s another vendor out there, but to us, itâ\u0080\u0099s just a massive, massive win and we continue to see traction in the federal, which is the most important part. Your line is now open. But I guess I am curious, are you also seeing customers may be taking Singularity core or control as opposed to complete and then as you look at the emerging products, it certainly it sounds like cloud security remains very high, but if you just had to look at cloud, identity, Ranger IoT, data protection, just kind of rank order which products are still seeing the most demand versus which have seen maybe a bigger impact to the macro and are getting pushed to the side? Singularity Control is still the number one package we have and we havenâ\u0080\u0099t seen people shift away to Singularity Core or, I am sorry, Singularity Complete is the number one package that we have. To us, it really is about the adjacent modules on top of Singularity Complete that sometimes folks would choose to not spend on right now. These could be adjacent capabilities like remote script execution, endpoint firewall controls that are not always the bare necessities. But when you look at the core needs, obviously, EPP and EDR remain front and center. And the second part there is that, obviously, anybody that has transitioned or started transitioning to the cloud and is now using the cloud as a production environment must deploy workload protection, run and protection into those. Again, thatâ\u0080\u0099s actually a cost saver to many folks out there where they can retain data with the Singularity platform versus maybe putting it in another costly data lake. I think for some of the other offerings that we have had, especially if you kind of look into endpoint management, thatâ\u0080\u0099s where sometimes people choose to pause and really focus on the ones that matters most. Your line is now open. The first one is, if I look at prior down cycles, there was always an issue for smaller companies to maintain the pace, because some customers are looking at balance sheet strength and are looking at cash flow, cash burn, losses and are shifting business to companies who are more financially stable. And the question is, are you concerned that what you are seeing today is only the short-term, meaning smaller companies just react really quickly to whatâ\u0080\u0099s happening in the market and slowing spending and we could see larger customers doing the same thing at the beginning of the year. So the question is as much as you can say, itâ\u0080\u0099s not qualitative -- itâ\u0080\u0099s not quantitative question, itâ\u0080\u0099s more qualitative, as much as you could see. First, on the first question, honestly, we havenâ\u0080\u0099t seen that and our cash balance is incredibly strong by I think any degree. I think customers still look at us as a very cost effective solution and one that on the TCO perspective helps them more than almost any other vendor out there and that comes again on the back of a public company with transparent financials and that has been, I think, just a stellar for in cybersecurity. To the second question, I think, we are seeing large enterprises react and they react by really right-sizing. I think if you couple the pipeline, you really understand that the customer intent is still there. So if you couple the pipeline strength and you couple the trends in deal right-sizing, I think, thatâ\u0080\u0099s the right dynamic that you are going to see and itâ\u0080\u0099s something that we have seen, I think, even starting a little bit last quarter, it did show up this quarter even in a more pronounced way and now we are kind of factoring it in. So, all in all, I donâ\u0080\u0099t feel like you are going to see large enterprises saying, I donâ\u0080\u0099t want to spend their security. They have to spend on the security, whether itâ\u0080\u0099s with the incumbent that they currently have or with a new vendor that can supply better security, probably, right around the same cost structure, they are going to have to spend it. Thatâ\u0080\u0099s why you see us, even in this macro environment improving on gross margin."
}