{
    "symbol": "FIGS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 22:48:16",
    "content": " Good afternoon, everyone, and thank you for joining today's call to discuss FIGS' fourth quarter and full year 2022 results, which we released this afternoon and can be found in our earnings press release and in the stockholder slide deck on our investor relations website at ir.wearfigs.com. This may include predictions, expectations or estimates, including about future financial performance, market opportunity, or business plans. Good afternoon, everyone, and thank you for joining us today for discussion of our fourth quarter results and an update on the progress we are making across our strategic priorities. For 2022, our first full year as a public company, we delivered net revenue growth of over 20%. We saw strong performance in our nonscrubs business, which increased 59%. Additionally, international sales grew 50%, resulting from increased brand awareness and repeat purchases. In TEAMS, our B2B business grew 41%. With respect to profitability, adjusted EBITDA margin for the year was 17.2%. For the fourth quarter results, we're ahead of our expectations, with net revenues up 13%. We achieved a record number of new customer acquisition, leading to a 23% increase in active customers. On an LTM basis, net revenue per customer was down 1% to $221 due to lower frequency rates, partially offset by higher AOB. Fourth quarter adjusted EBITDA margin of 13.6% reflects better than anticipated gross margin, as well as disciplined expense management. While our fourth quarter results exceeded our expectations, extending our market share gains, a number of interrelated factors that we discussed last quarter led to decelerated growth from previous quarters. These include macro headwinds, lower frequency trends, and color launches that did not perform to the elevated levels we saw last year. And therefore, we will continue to invest in our business as the investments we make today will position us as an even stronger company in the future. Starting with product, we continue to deliver innovation in our nonscrubwear assortment, which grew 39% to reach 21% of net revenues. In our scrubs business, we saw a deceleration in our sales trends, with color launches continuing to fall short of our expectations, which we will speak to shortly. Since our launch, these products drove 5% of new customers, and 2XL through 6XL reached double-digit sales penetration within the same selection of core scrubs offering. While word of mouth remains our biggest source of customer acquisition, we supplement this with best-in-class digital marketing and in-house creative to efficiently drive healthy new customer growth and retention. Moving to international, we saw 76% growth for the quarter and 50% for the year. These strategies, coupled with the impact of beauty subsidies and other efforts to reduce barriers to purchase, resulted in significant acceleration in sales, driven by both repeat and new customers, while seeing continued improvement in marketing efficiency. Throughout the last decade, we remain steadfast in executing across the core tenets of our business. Maintaining a deep connection with the healthcare community, leveraging our authentic category, defining brand, and delivering industry-leading product innovation. As we advance our business to $1 billion in net revenue, we remain hyper-focused on executing solutions-based product innovation and building and deepening our connection with the healthcare community. Beyond these strategic priorities, we are embracing our more nascent growth areas to expand our presence and engage with more healthcare professionals through our international business, our TEAMS business, and by building out our retail strategy. While remaining confident in our long-term potential, we see 2023 as a year of foundational focus as we move through inventory and deploy strategies to accelerate growth. Starting with products, we are putting more firepower behind our innovation by embedding greater technical features and functionality into our products across our layering system to further differentiate FIGS as the leading and premium scrubwear brand. Within our scrubs business, we are optimizing design, standardizing features such as trims and waistbands, and determining how we can maximize productivity with the optimal breadth of styles in our offering. For our 10-year anniversary, we kicked off 2023 with our FIGS10: Iconic Series, 10 weeks, 10 iconic colors, 10 years of FIGS. Our 360-degree  campaign, we are not done being the first, highlights FIGS as always the first brand to create products that redefine everything we know about the healthcare professional uniform. And as we raise the stakes on product innovation, we will also inform customers about product functionality, technical features, and use cases to emphasize the value in our premium product. As we address the trends we've seen around frequency, we are focused on driving more consistent and personalized engagement within the healthcare community. To fuel further discovery, we are building out our investor network with a focus on highly influential healthcare professionals who will not only stimulate brand awareness but act as boots on the ground to learn about individual needs and preferences within these communities. Importantly, we are committed to delivering growth internationally in a profitable way, just as we have grown the rest of our business. To support this initiative, we are creating a more robust technology platform to expand our product offerings, streamline the ordering experience, and offer additional payment and reporting capabilities. Based on the overwhelming engagement we thought our previous market activations and past pop-up shop, we have learned that healthcare professionals really want to experience FIGS in person. True to FIGS, this location will provide a customer experience unlike anything our healthcare professionals have seen before. And in his most recent role at Levi's, he helped to scale the company's infrastructure for long-term growth. In Devon's new role, she will be responsible for overseeing our international TEAMS businesses, as well as developing our retail opportunity. Her strategic thinking, operational experience, and deep understanding of the FIGS community make her the ideal fit to lead the growth of these businesses. In closing, throughout the last decade, we have remained committed to helping the global community of healthcare professional look, feel and perform at their best, 24/7, 365 days a year. We branded a previously unbranded industry and decommoditized a previously commoditized product, elevating scrubs and creating premium products for healthcare professionals. We have identified areas in which we can get even better, and we have an action plan in place: to be better at the level of innovation we deliver, better at delivering consistent product, better at connecting with our community to keep them coming back, and better at operational excellence. Our strong business model is underscored by product innovation, community connection, advocacy, and there is no close second. We have seen tremendous growth over the last four years, and we believe now is the right time to make the investments necessary to double our revenue once again. We are pleased to have exceeded our expectations in the fourth quarter, although recognize these results are below what we believe is sustainable for our business longer term. As Trina outlined, we believe that the actions and investments we are making today will set us up to achieve our growth potential in the future. I will begin my discussion with a review of our fourth quarter financial results, followed by our outlook for the first quarter and 2023. For the fourth quarter, net revenues grew 12.6% to 144.9 million, compared to 128.7 million in Q4 last year due to an increase in orders from new and existing customers. Active customer growth of 23% was fueled by ongoing initiatives to expand brand awareness globally, which led to the highest number of new customer ads in our company's history. For the quarter, AOB across the business was down 1% to $112 due to lower AUR. As Trina noted, we continue to see a year-over-year decrease in purchase frequency in the quarter, and we are taking actions by both increasing intention behind our product innovation and refining our strategies focused on existing customers. The 170 basis-point decline compared to Q4 last year was primarily due to the higher mix of promotions, as well as product mix and higher ocean freight expense due to the sell-through of previously shipped inventory. Selling expense for Q4 was 37.6 million, representing 26% of net revenues compared to 19.9% in Q4 2021. This 610 basis-point increase was primarily due to higher costs within fulfillment, largely due to warehouse storage necessary to house inventory we pulled forward. To a lesser degree, selling expense was impacted by higher shipping rates and duty subsidies compared to Q4 last year. Marketing expense for Q4 was 21.4 million, representing 14.8% of net revenues, compared to 12.9% in Q4 2021. This 190 basis-point increase was primarily due to increased investment in brand marketing initiatives, including commercial and our GiftFIGS campaign. Last year, we saw lower brand spend due to the timing of marketing initiatives. We continue to drive efficiency and spend on both new customer acquisition and retention, maintaining our focus on positive first order contribution margin with marketing spend on an annual basis roughly consistent at 15% of net revenues. G&A expense for Q4 was 36.5 million, representing 25.2% of net revenues, compared to 24.3% in Q4 2021. This compares to adjusted net income and diluted EPS as adjusted of 18.6 million and $0.09 per share in Q4 2021, respectively. Finally, our adjusted EBITDA for Q4 remained strong at 19.8 million for an adjusted EBITDA margin of 13.6%, compared to 24.8% in Q4 2021. Net revenues were 505.8 million, an increase of 20.6% year over year. Gross margin was 70.1%, a decrease of 170 basis points year over year, primarily due to a higher mix of promotional sales and, to a lesser extent, an increase in freight and costs related to elevated ocean freight costs and product mix shift. Operating expenses were 316.8 million, an increase of 9.1% year over year. As a percentage of net revenues, operating expenses decreased to 62.6% from 69.2% in the prior-year period. As a reminder, earlier this year, we made the decision to increase weeks of supply of our core styles to ensure we could adequately fulfill customer demand. This, combined with lower-than-expected demand for our color launches, led to heightened inventory levels. Over 60% is in core styles and classic colors, which we sell all-year round and remained always in-stock, leading to low risk of obsolescence. However, due to the aforementioned factors, we expect inventory to peak in the first quarter before getting closer to more normalized weeks of supply by the end of the year. Second, as we continue to work through inventory, we expect to deploy more promotional strategies as compared to last year. Looking at our profitability, we will continue to make investments, including fulfillment enhancements, that will enable us to scale our business for long-term growth. In addition to this, we will be working through certain temporary cost headwinds, in part due to macro and supply chain challenges we faced early last year. As a result of the factors I just talked about for 2023, we expect net revenues to increase in the mid single digits. We expect growth in our active customer base to moderate, given the lapping of the strong growth we have seen over the last several years. We expect UPT to continue to increase, largely offset by lower AUR, as we expect to see a higher mix of promotional sales as we move through inventory. Keep in mind, AOB increased 18% since 2020, so we are coming up against meaningful growth. Gross margin for the year is expected to be similar to our Q4 2022 gross margin rate, as we move through inventory and navigate what we anticipate will be a more promotional environment. In addition, despite tailwinds in inbound freight costing we are seeing, we are factoring in higher ocean freight expense due to the sell-through of previously shipped inventory. Turning to selling expense, we expect some pressure as a result of incremental storage facility costs to house additional inventory. We plan to invest in our fulfillment capabilities to increase reliability, flexibility, and efficiency, as well as improve order delivery times as we scale our business for growth. The costs associated with the implementation and execution of this initiative are currently expected to range between 16 million and 18 million, with about half falling into 2023, mostly in Q4 and half in the first quarter of next year. G&A is expected to deleverage for the full year, in part due to investments in software, personnel, and resources associated with growing our international and TEAMS businesses, as well as in product innovation. We also expect an increase in stock-based compensation and our accrual for future inventory donations, partially offset by lower legal expenses and professional fees. As a result, adjusted EBITDA margin for the full year 2023 is expected to be between 11% and 12%. In terms of Q1 2023 outlook, we expect net revenue growth to be in the low single digits. We expect new customer growth will be partially offset by the continued softening of frequency trends, as well as a decrease in AOB. Last year's AOB of $116 reflected an elevated mix of nonscrubwear associated with one of our largest New Balance sheet launches, as well as supply chain disruptions causing out of stocks on our core scrubs product. In addition, promotions are planned higher in 2023 versus 2022, given the macro environment and our efforts to move through inventory. We expect gross margin to decrease in Q1 due to the proportion of promotions and product mix, as well as higher ocean freight expense due to the sell-through of previously shipped inventory. As a result, we expect first quarter adjusted EBITDA margin to be between 9% and 10%. In conclusion, our growth outlook for 2023 is not representative of the growth we believe we can achieve longer term. We remain a distant leader in healthcare apparel, and we believe that we will deliver accelerated growth and adjusted EBITDA margin expansion in the future. Your line is now open. I guess the first thing that comes to mind is, just maybe you could help us connect to the longer-term EBITDA margin targets that we've discussed over the last few years within the context of the 11 to 12 that you just gave. Daniella, maybe, you know, I guess jump ball between how do we think about the path back to, you know, like a 20-type margin that I think we are targeting long term, if that's still the right margin. So, for your first question on EBITDA margin, based on what we see today, we believe we have the opportunity to drive EBITDA margin expansion beyond 2023. In 2023, we're seeing some margin pressure from a few factors, about 300 basis points from excess storage fees combined with fulfillment enhancement costs. Secondly, in 2023, we're going to be impacted by higher promotions, a couple of hundred basis points when we close out through the P&L. Looking to the future as we accelerate growth, we do expect G&A to leverage from where it is today. But our goal is to ensure we're making the right decisions for the long-term health of the business, and we're going to continue to do that. And I would just add, you know, we really want to grow our business in a healthy way like we always have. We really focused on growth, not for growth sake, but for doing it in disciplined and profitable way. So, our goal right now is investing strategically to support our scale and resources and people and technology, systems, really to make us stronger for the future. So, in 2023, net-net freight is likely to be neutral to a slight tailwind as we continue to sell through previously purchased inventory at higher ocean freight rates. Your line is now open. And then, I guess, you know, you've outlined a number of investments you're making on innovation. You know, I think as it relates to our color drops, right, we saw an extraordinary demand in our colors over the last years, and we really responded to that kind of meeting our customers where they are. And I think, you know, our healthcare professionals have evolved in our shifting, and we are evolving with them, as we're getting out of color and leaning more into technical features and functionality that's tied to use cases. And in many ways, we're getting back to our roots of providing essential foundational pieces that healthcare professionals need in their jobs to perform. So, right now, we're being mindful of our inventory balance and our commitment to providing our customers with fresh, innovative, and exciting products. And what you're going to see this year is new, awesome products, of course, but with more, you know, shallower buys on that front. Tie it back to our core scrubs, and also seamlessly layer it with what's in our inventory today. And so, you know, this year, we're not -- we are not exactly focused on expanding our assortment or tapering back or simplifying and bringing, ensure that moments of newness that will drive revenue across multiple categories. And so, you know, as we get to 2024 in more of an ideal state where we can hit the ground running, we're really focused on this foundational year. I wanted to ask one on inventory, about 107% year over year. I guess, you know, we sort of saw slowing demand trends in the fourth quarter, and we knew that things were getting a little bit tougher from a macro perspective. You know, first we did start to build inventory levels to avoid airfreight with longer lead times. And that, coupled with a lower sales outlook, it created an inventory build, especially around our color launches. And we're going to move through the remainder at a higher promotional rate, but still reflecting the discipline that we always do to protect the brand over the long term. So, going forward, we put processes in place to increase flexibility and be more disciplined around our inventory buys. And we, you know, we're going to return to a more normalized inventory position by the end of this year. So, our ideal state is around 16 to 20 weeks of supply, and we're expecting at the end of the year to be around 25 weeks of supply. Your line is now open. So, you're clearly -- we saw a decelerating pace here, Q3 to Q4. So, we're assuming that the macro remains challenged in 2023 with the potential to get worse from where we are today. And we're taking steps -- we are taking steps through our marketing strategies to drive higher engagement, through personalized messaging, by tailoring our content to our channel for our customer. However, you know, we're still early in these initiatives. And just given the uncertain macro environment, we're remaining cautious about what we baked into the guide. Again, it'll be increased 18% from 2020 until we've seen a lot of growth here. But we're recognizing that, in 2023, there is going to be pressure from higher promotions, and that's weighing on AUR in the short term. We're also lapping 20% growth in active customers, so we're being prudent in our growth outlook. So, Daniella, we talked a bit about, you know, in response to some of the questions in your prepared comments, you talked about promotions and your efforts to clear the inventory. And so while I think just given the macro environment, we are seeing more of a reaction to our promotions, we're really focused on protecting the long term of the brand. Your line is now open. Trina, I was hoping that you could elaborate a little bit more on the growth of the TEAMS business that you're seeing today. You know, I think the TEAMS opportunity is an incredibly exciting one that we've discussed a bit. But as we move forward, you know, this is an area that is about 15% of the market, but it's a lot smaller as a percent of our total business. You know, this is a primarily inbound, you know, sales process today, where people are coming to us because they're learning about us in other ways. Right now, we're looking to build a bigger platform to enable them to get access to more of our assortment. We're looking to create more features to have the process be as easy as possible to order, you know, hundreds, if not thousands of sets of scrubs for your team and make the process super easy as it relates to embroidery, putting your logo, putting your name, so that you can show the world who you are and what you do, which is a big part of why people choose FIGS. So, our extended offering really gives us an ability to partner with some of the largest institutions who said, \"You know, we have a number of people within our institution that can't wear FIGS today.\" So, you know, I think we're one of the few companies that, you know, we can outfit 10, 15, 20 people. We're really excited about it, and we're just getting started. And to address your second question, Brooke, you know, we're not providing targets, but we do expect international teams and nonscrubwear to continue to grow at an accelerated pace of the business and make up a larger proportion of our net revenues looking into 2023. I think as a result of that, you know, we are anticipating lower frequency to impact our scrubs business. You know, the impact will likely be more so in 2024 and beyond, but also, our marketing strategies and really focusing on the retention, focusing on evergreen messaging, and really setting the stage for accelerated growth in 2024. As you contemplate that answer, I was wondering if you could help us understand what needs to happen, whether that's a change in the macro environment or just actions against your initiatives to reaccelerate your top-line growth toward your long-term outlook. I mean, I think, you know, a lot of people are talking about the macro environment, but at FIGS, and I think the best brands don't use the macro to cover their sins, we're focused on what's in our control. And we're focused on what we can do from a product standpoint, from a messaging standpoint, from an advocacy standpoint. You know, our healthcare professionals have been through a lot over the last few years as they led us through this pandemic, and they're dealing with the same macro issues as well. And I think we're in a really interesting spot, just given the scale, given all this information and data that we have on our healthcare professionals, to understand them in a really unique way. And it comes down to these three areas, in addition to others, but innovation of product; messaging and really being segmenting -- segmented in our messaging, personalizing to people's needs; and advocacy, showing up for them and having their backs. Your line is now open. So, it's not necessarily that we're going to do a greater number of promotions or even at a higher discount rate. But what we are seeing is that in this macro environment, we are seeing customers react more to our promotional times. Outside of that, we are moving through inventory by having more evergreen promotional strategies like our Awesome Today Gone Tomorrow, which has been really effective in helping us tailor to different customer segments and really meet the consumer where they are. It sounds like between all the customer metrics, you think AOB can be an area of opportunity for maybe growth to accelerate higher than that. Your line is now open. You know, I think, you know, first off, we're really excited about bringing on Steve Berube. You know, he has 30 years of distribution and logistics experience and is really here to help us build out urban infrastructure. And, you know, he's been a strong leader at some of the best brands in the world, Nike, Lululemon, and Levi's. And we -- although we are making these investments, as you know, Dana, we're super focused on building in a disciplined way and being very mindful of our expenses and managing our expenses in a deliberate and sustainable way. Yeah, I think in terms of the market, you know, it continues to be what we've discussed in the past. And, you know, that's to be expected, given when you have a successful business, people do come after you and they try to copy you. It's FIGS, and we are focused on delivering product innovation and continuing to connect with our community. But from a TAM perspective, we're really focused on continuing to create the market, right, as the originals, continuing to bring and expand the categories that we're in, and enter new categories to really enhance the layering system that we have today. I guess when you look at what you're seeing there versus, you know, the last 10 years, just wondering if you could maybe give us a few insights into really what you're seeing in some of those early days at those -- the other -- the international markets that you're expanding into. And so, there, we're really about building the brand and growing the customer base, and we're excited to see where it evolves from here. Your line is now open. Just from a cash flow perspective, kind of with the efforts you're making to rightsize your inventory position this year. Following the first quarter, we do expect to generate cash for the remainder of the year, and this is largely a function of reduced inventory buys and also sell-through of our current inventory. Your line is now open. And so the first quarter guidance is not necessarily reflective of our growth rate quarter to date, but it's an expectation of our quarter in aggregate. And so, we're expecting AOB to be down more than it was in the fourth quarter for a couple of factors, mainly lapping the higher penetration of nonscrubs in Q1 of last year. We're lapping a really strong New Balance shoe launch, which boosted AOB through higher AUR. And also, as a reminder, last year, we were out of stock on some of our core scrubwear due to supply chain challenges, which boosted our nonscrubwear proportion. We are continuing to add a lot of new customers to the FIGS fold, which is great to see. We've spoken about, you know, recent cohorts just having a little bit of different purchasing trends, where they're elongating their purchase cycles and buying more when they do come back. But other than that, they look, you know, really similar to other customer cohorts. Your line is now open. You know, forgive me if I misheard, but I think you mentioned there's an L.A. store slated to open in the fall. So, if you could just, you know, provide any color on how you're thinking about a potential, you know, omnichannel approach to the business with kind of a physical footprint, or just how you think about an omnichannel approach to the business presently would be helpful. And what we've learned from these experiences is that healthcare professionals, you know, they want to experience FIGS in person. It's going to be in Century City this fall, and we're going to be, you know, really moving forward on the retail opportunity and identifying, you know, store -- evaluating store format, identifying the right location, being really measured about how we expand from a retail perspective. Between TEAMS, international, retail, these three growth levers, they really are going to be serving each other of -- you know, there's not one channel in a vacuum. So, as it relates to omnichannel and as we move forward and have more channels beyond digital, you know, word of mouth is going to continue to be driven, not just by what we're doing digitally, but also what we're going to be doing offline. And so, we're excited to have these different parts of our business and have them be working in tandem to support the growth long term."
}