{
    "symbol": "MCRB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 14:06:07",
    "content": " Beyond SER-109, our next most advanced program is investigational microbiome therapeutic SER-155 which we are developing to address infections, including antimicrobial resistant infections and graft versus host disease in individuals receiving allogeneic stem cell transplant. SER-155, along with SER-109, as part of our infection protection pipeline franchise, managing infections including the expanding challenge of antimicrobial-resistant infections - is an area of particular interest to Seres, in an area where we believe that microbiome therapeutics may provide a novel approach with widespread medical utility. Demonstrating favorable safety and highly immunocompromised patients, such as those in the SER-155 Phase Ib study, would be an important milestone for the expansion of microbiome therapeutics as a novel approach to manage bacterial and antimicrobial resistant infections. Looking ahead to pipeline expansion, we believe that our clinical and preclinical data provides strong evidence supporting the potential for microbiome therapeutics to prevent infection in patients at high risk of blood stream infections. Regarding our efforts and resources over the near term, we continue to be focused on a number of critical SER-109 related activities which include continuing to ramp up manufacturing operations for commercial supply, both internally and with our partner Recipharm, as well as increasing longer-term SER-109 product supply through our Bacthera collaboration; and in conjunction with Aimmune, continuing and accelerating launch readiness activities. In summary, the company continues to be well resourced to prepare for SER-109 commercialization and to drive our ongoing development and preclinical programs while also deploying resources to continue to advance our research platforms where we believe we have differentiated proprietary and sustainable advantages. Back to you, Eric. Back to you, Eric."
}