{
    "symbol": "MCRB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 11:14:11",
    "content": "  I would like to remind you that, we will be making forward-looking statements, including potential approval of SER-109 and its status as a first-in-class therapeutic, the timing of a BLA filing and potential product launch, the market for SER-109, the ultimate safety and efficacy data for our products, the use of cash to fund operations and other statements, which are not historical fact. Earlier this summer, we were delighted to report confirmatory results from ECOSPOR IV our SER-109 clinical study that has provided highly supportive safety and efficacy data in patients with recurrent CDI. Along with the SER-109 dosed patients in the ECOSPOR III study, this study provides a safety database of at least 300 patients as requested by the FDA, with a total of 326 subjects who received SER-109 completing 24-weeks of follow-up. Looking ahead to pipeline expansion, we have a strong R&D team in place and as we highlighted in detail during an investor event earlier this year, we believe that both our clinical and preclinical data provides strong evidence supporting the potential for microbiome therapeutics in preventing infection in patients that are at high risk of bloodstream infections, particularly in large patient populations that are immunocompromised such as cancer neutropenia, cirrhosis, and solid organ transplant. With respect to our operating expenses and efforts over the near term, we continue to be focused on a number of critical SER-109 related activities, which include continuing to ramp up manufacturing operations for commercial supply internally with our partner Recipharm, as well as increasing longer term SER-109 product supply through our Bacthera collaboration and in conjunction with Nestle continuing and accelerating launch readiness activities. Thanks for the question. Thanks for the question. Thanks for the question. It's pretty remarkable to see kind of a mid-single digit reference rate in that first of current group, but we were never counting on that number or that data -- those data to support our belief that -- and we think most physicians believe that there's really two categories of patients. Thanks for the question."
}