{
    "symbol": "AQUA",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-15 15:33:04",
    "content": " This conference call includes forward-looking statements, including first quarter and full fiscal year 2023 expectations, long-term financial targets, and statements relating to demand outlook, growth opportunities, our book-to-bill ratio, our net leverage ratio, capital expenditures, our acquisition strategy, regulatory actions, material and labor availability, inflation and general macroeconomic conditions. Fourth quarter adjusted EBITDA increased 13.8% to $93.2 million for an overall margin of 18.5%, a decrease of 70 basis points versus the prior year, driven primarily by inflationary impacts, higher service labor costs and lower productivity from training and onboarding of new service tax. For the full year, reported revenues were up 18.6% to approximately $1.7 billion, driven by higher volume and favorable price realization. Organic contribution of revenue growth was over 10%, primarily driven by increases in aftermarket services and capital as well as growth across all regions and most product lines versus the prior year. Full year adjusted EBITDA increased 18.7% to approximately $298 million for an overall margin of 17.1%, actually the same as the prior year. Fourth quarter adjusted EBITDA increased 10% to approximately $78 million, due to favorable price realization and higher sales volume from acquisitions. Full year revenues grew 23.4% to approximately $1.18 billion, with adjusted EBITDA, up 18% to $259 million. For the full year, adjusted EBITDA margins declined 90 basis points over the prior year, driven by material, fuel, freight inflation and labor costs and Mar Corâ\u0080\u0099s dilutive impacts. We continue to see strong year-over-year growth in ISS backlog, which was up $152 million or 20% over the prior year quarter, with growth coming from both capital and service orders. Organic contribution to revenue growth was 13.7% over the prior year, driven by price realization, volume across all product lines. Adjusted EBITDA margins grew 100 basis points over the prior year, with an increase in profitability driven by price realization higher sales volumes. Full year revenues grew 9.5% to $552 million, with adjusted EBITDA up 13.2% to $119.7 million, while margins improved 70 basis points versus the prior year. Organic contributed organic contribution to revenue growth was 12.1% over the prior year, driven by price realization and volume across all product lines. For the full year of fiscal 2023, with current visibility, we expect revenue and adjusted EBITDA to be in the range of $1.81 billion to $1.89 billion and $310 million to $330 million, respectively. And I think we will start to see in the latter half of this year, assuming things â\u0080\u0093 things start to abate on the inflationary side and into 2024 and 2025, I think you'll see us getting back on track to achieving that 20% EBITDA margin we're focused on."
}