{
    "symbol": "AQUA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-02 15:49:03",
    "content": " Weâ\u0080\u0099re particularly pleased to see broad-based diverse â\u0080\u0093 diversification of organic growth across all regions, most product lines as well as growth across aftermarket, capital and service. Itâ\u0080\u0099s actually weâ\u0080\u0099re â\u0080\u0093 weâ\u0080\u0099re seeing a trend that itâ\u0080\u0099s stabilizing a little more and â\u0080\u0093 and weâ\u0080\u0099re able to at least have good lead times you know, good price expectations, where things are going to be. Your line is open. Your line is open. And Andrew one â\u0080\u0093 one piece that youâ\u0080\u0099ll see in that, Mar Corâ\u0080\u0099s growth thatâ\u0080\u0099s coming in, part will â\u0080\u0093 will also show in as organic growth, because weâ\u0080\u0099re aligned on those customers, weâ\u0080\u0099re selling to a more broad customer base through ISS. Even as I highlighted on the â\u0080\u0093 on the end-market charts, where we see order conversions, delays, itâ\u0080\u0099s really only behalf of our customers being ready to accept the products that weâ\u0080\u0099re delivering, not â\u0080\u0093 not necessarily on our behalf, being able to deliver a lot of times, weâ\u0080\u0099re â\u0080\u0093 weâ\u0080\u0099re waiting for them to say go. But â\u0080\u0093 but Saree, itâ\u0080\u0099s â\u0080\u0093 itâ\u0080\u0099s a little like weâ\u0080\u0099ve highlighted in the past, I mean, we have a pipeline thatâ\u0080\u0099s north of $100 million, weâ\u0080\u0099re winning about a third of the projects that are left â\u0080\u0093 itâ\u0080\u0099s the projects we really choose to go after. Your line is open. Circling back to Mar Cor for a second, youâ\u0080\u0099ve noted the integration is on track, the â\u0080\u0093 you know key points that youâ\u0080\u0099re â\u0080\u0093 youâ\u0080\u0099re pacing toward the 25% margin target over the next 12 to 18 months youâ\u0080\u0099re very positive in that sense. But then, Smith gives us a great potential for top line growth in very key markets as I highlighted in the script, Life Sciences, Data Centers, Microelectronics, but itâ\u0080\u0099s â\u0080\u0093 itâ\u0080\u0099s bigger in â\u0080\u0093 in the Minneapolis areas where theyâ\u0080\u0099re located. Your line is open. I would tell you across wastewater, it is green, itâ\u0080\u0099ll continue to be green, we see for the foreseeable future, certainly with you know whatâ\u0080\u0099s â\u0080\u0093 whatâ\u0080\u0099s being addressed on the infrastructure spending bill, as well as whatâ\u0080\u0099s happening weâ\u0080\u0099re trying to recycle and reuse water. Your line is open. You know may â\u0080\u0093 maybe sort of a follow-on to the prior question here, just as you think about year end and â\u0080\u0093 and we try to sort of true-up the model you know, Ben, the â\u0080\u0093 the nice margin expansion in APT is the highest weâ\u0080\u0099ve seen since early fiscal â\u0080\u009821. It you know kind of varies by end-market, what weâ\u0080\u0099re seeing, but â\u0080\u0093 but I think itâ\u0080\u0099s versus the larger installations versus the smaller that tend to have more delays and a big challenge for us."
}