{
    "symbol": "TD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-03-03 18:34:05",
    "content": " Also present today to answer your questions are Michael Rhodes, Group Head, Canadian Personal Banking; Paul Douglas, Group Head, Canadian Business Banking; Raymond Chun, Group Head, Wealth & Insurance; Leo Salom, President and CEO, TD Bank, America's Most Convenient Bank; and Riaz Ahmed, Group Head, Wholesale Banking. Revenue increased 4%, reflecting higher volumes and fee-based revenue in the banking and wealth businesses and higher insurance volumes partly offset by our normalization in direct investing trading activity and lower retail margins. Revenue increased 6% reflecting higher fee-based revenue in the banking and wealth businesses and higher loan, deposit and insurance volumes, partially offset by lower direct investing transaction volumes and lower margins. U.S. Retail Bank net income was $806 million up 31% primarily reflecting higher revenue, lower PCL and lower noninterest expenses. The UIL net PCL ratio, including only the bank's share of PCL for the U.S. strategic cards portfolio, as an annualized percentage of credit volume was 0.04%, higher by 19 basis points sequentially. Expenses increased 7% year-over-year primarily reflecting higher employee-related costs and continued investment in the Wholesale Banking's U.S. dollar strategy, including the investments in TD Securities automated trading the electronic fixed income trading business we acquired from Headlands last year. The bank's impaired PCL was $329 million, increasing by $109 million quarter-over-quarter, reflecting some normalization of credit performance, including the reemergence of seasonal trends in the U.S. card and auto portfolios. The balance was really a reflection of the fact that we've got a great deal of confidence in the model that First Horizon is pursuing and their organic growth plans, and we wanted to facilitate the acceleration of those, whether that's organic branch expansion whether that's increasing of commercial banking coverage teams or simply getting after day two enhancements that would potentially position the firm for a more rapid future integration. So in terms of the expense growth in Canadian retail and you referenced the 8%, you have to disaggregate that a bit because there's -- the components, and I'm right here with me, wealth and insurance and the Canadian personal and commercial bank. If you look at the last page of the sub-pack, there was actually a breakdown of the Canadian Personal Bank, which actually shows about a 4% expense growth if my memory is correct on a year-over-year basis, and that's between Paul and myself and on the business banking side. From a wealth and insurance perspective, on a year-on-year expenses were up 14%, and it's mainly driven by investments in really the right areas across both wealth and insurance to drive better exceptional client experiences, new acquisition and accelerate our growth. So what I'm wondering is how concerned are you that this line, and I appreciate the added color on the new guidance, but how concerned are you that this may actually end up going to zero if you're thinking one or two years out, just with respect to seeing more banks actually eliminate this fee altogether and it's just hard for you to understand how we could get this divergence where some banks charge the fee and others don't."
}