{
    "symbol": "TD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-26 17:09:06",
    "content": " In our Wholesale Banking business, we delivered solid performance this quarter in a challenging market and geopolitical environment, with earnings of $359 million, driven largely by higher trading revenues. Reported and adjusted revenue increased 10% and 8% year-over-year, respectively, reflecting volume and margin growth in our banking businesses, higher fee-based revenue in our banking and wealth businesses, and prior year premium rebates for our insurance customers, partially offset by lower transaction revenue in our wealth business. Expenses increased 5% year-over-year, reflecting higher spend supporting business growth and higher employee-related expenses, partially offset by prior year store optimization costs. Reported total bank PTPP was up 16% year-over-year before these modifications and adjusted PTPP was up 11% after these modifications, mainly reflecting higher revenues in our personal and commercial banking businesses. Revenue increased 9%, reflecting volume growth, prior year premium rebates for insurance customers and higher fee-based revenue in our banking and wealth businesses, partially offset by lower transaction revenue in our wealth business. Insurance claims increased 34% year-over-year, reflecting the normalization of claims, partially offset by the favorable impact of a higher discount rate, which resulted in a similar decrease in fair value of investments supporting claims liability reported in noninterest income. Noninterest expenses increased 9% year-over-year, reflecting higher spend supporting business growth, including technology and marketing costs, higher employee-related expenses and variable compensation. U.S. Retail Bank's adjusted net income was US$769 million, down 10%, primarily due to a lower recovery of PCL, partially offset by higher revenue. Reported and adjusted revenue increased 12% and 3% year-over-year respectively, as the business overcame lower income from PPP loan forgiveness and lower gains on the sale of mortgage loans, with higher deposit volumes and margins and fee income growth from increased customer activity. Average loan volumes decreased 4% year-over-year, reflecting a 4% increase in personal loans and an 11% decline in business loans or 3%, excluding PPP loans, primarily due to continued pay downs of commercial loans. Net interest margin was 2.21%, flat sequentially, as higher deposit margins reflecting the rising interest rate environment were offset by lower PPP loan forgiveness, lower loan margins and higher prepayment income in the prior quarter. The U.S. Retail net PCL ratio, including only the bank's share of PCL for the U.S. strategic cards portfolio, as an annualized percentage of credit volume, was minus 0.04%, lower by 8 basis points sequentially. Expenses increased 2% year-over-year, reflecting higher employee-related expenses and business investments, partially offset by prior year store optimization costs, lower COVID-19 expenses and productivity savings in the current year. Wholesale net income for the quarter was $359 million, a decrease of 6% year-over-year, reflecting higher noninterest expenses and a lower PCL recovery, partially offset by higher revenues. Revenue was $1.3 billion, up 8% year-over-year, primarily reflecting higher trading-related revenue, partially offset by lower underwriting fees. Expenses increased 10% year-over-year, primarily reflecting the continued investments in Wholesale Banking's U.S. dollar strategy, including the hiring of banking, sales and trading, and technology professionals and the acquisition of TD Securities' automated trading, previously Headlands Tech Global Markets LLC. Conversely, should interest rates continue to rise, we would expect expanding margins for TD's Canadian and U.S. retail segment and higher fair value accounting adjustments upon closing of the First Horizon transaction, which would result in a higher initial capital requirement and higher accretion of the fair value adjustments into earnings over time."
}