{
    "symbol": "TD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-25 17:53:12",
    "content": " Turning to our wholesale banking business, net income for the quarter was $271 million, a decrease of 18% compared to the third quarter last year reflecting continued investments in our U.S. dollar strategy, including the hiring of banking, sales and trading and technology professionals. Reported and adjusted revenue increased 2% and 8% year-over-year, respectively, reflecting margin and volume growth in the Personal and Commercial Banking businesses. Revenue increased 7%, reflecting volume and margin growth, higher fee-based revenue in the banking business and higher insurance volumes partially offset by lower transaction and fee-based revenue in the wealth business. Net interest margin was 2.7%, up 8 basis points compared to the prior quarter, primarily due to higher deposit margins, reflecting the rising interest rate environment, partially offset by lower loan margins. Insurance claims decreased 1% year-over-year, reflecting favorable prior year claims development and the impact of a higher discount rate, which resulted in a similar decrease in fair value of investments supporting claims liabilities reported in noninterest income partially offset by higher current year claims. U.S. Retail Bank reported net income was USD 898 million, up 1% and reflecting higher revenue, partially offset by higher PCL and noninterest expenses. Net interest margin was 2.62%, up 41 basis points sequentially as higher deposit margins, reflecting the rising interest rate environment and positive balance sheet mix were partially offset by lower PPP loan forgiveness and lower loan margins. The U.S. retail net PCL ratio, including only the bank's share of PCL for the U.S. strategic cards portfolio as an annualized percentage of credit volume was 0.2%, higher by 24 basis points sequentially. Reported expenses increased 8% year-over-year, reflecting higher employee-related expenses and business investments, and acquisition and integration-related charges for the First Horizon acquisition, partially offset by productivity savings. The contribution from TD's investment in Schwab was USD 226 million, up 40% from a year ago, reflecting higher net interest income, partially offset by lower trading revenue. Wholesale Bank net income for the quarter was $271 million, a decrease of 18% year-over-year, reflecting higher noninterest expenses and PCL. Revenue was $1.1 billion, down 1% year-over-year reflecting lower underwriting fees and markdowns in certain loan underwriting commitments from widening credit spreads, partially offset by higher trading-related and global transaction banking revenue. Expenses increased 9% year-over-year primarily reflecting the continued investments in Wholesale Banking U.S. dollar strategy, including the hiring of banking, sales and trading and technology professionals partially offset by lower variable compensation. As we mentioned on our call relating to the Cowen acquisition earlier this month as part of our ongoing capital management activities and in light of heightened volatility in interest rate, reduction in our net interest income sensitivity with rising rates and continued uncertainty in the macroeconomic environment, during the third quarter we established a strategy to mitigate the CET1 ratio impact of further rate changes on goodwill in connection with the First Horizon acquisition. Now as interest rate change, certain interest rate swaps, which were de-designated from their previous hedge accounting relationships against TD's existing U.S. investments will mark-to-market through P&L, and mitigate the capital volatility due to interest rate changes and goodwill amount for the First Horizon acquisition."
}