{
    "symbol": "SONX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 20:38:03",
    "content": " And with that, I would like to hand over to our host of today's call, Matt Bacso, please go ahead when you're ready. Earlier today Sonendo released financial results for the quarter ended March 31st, 2022. All forward-looking statements, including those relating to our operating trends and future financial performance, the impact of COVID-19 on our business, expense management, expectations for hiring, growth in our organization, market opportunity, revenue guidance, commercial expansion, and product pipeline development are based upon our current estimates and various assumptions. Accordingly, you should not place undue reliance on these statements for a list in description of the risks and uncertainties associated with our business, please refer to the risk factors section of our most recent annual report on Form 10-K filed with the Securities and Exchange Commission on March 23rd, 2022, and available on EDGAR, and in our other public reports filed periodically with the SEC. This conference call contains time-sensitive information and is accurate only as of the live broadcast on May 10th, 2022, senator disclaims any intention or obligation except as required by law, to update or revise any financial projections of forward-looking statements, whether because of new information, future events, or otherwise. For today's call, I will provide opening comments and a business update, followed by Mike, who will provide additional detail regarding our quarterly results and updated 2022 guidance before opening the call to Q&A. Total revenue for the first quarter of 2022 was $9 million above our estimates, provided during the Q4, 2021 earnings call, representing growth of 22% over Q1 of 2021. As a reminder, first quarter capital equipment sales are typically our lowest seasonally adjusted quarter, following heightened calendar year and demand, which is influenced by various factors including tax benefits. As of March 31st, GentleWave's ending install base was approximately 850 units, compared to approximately 710 units on March 31st 2021, representing growth of 20%. Mike will later provide more details on our quarterly financial results, and additional detail regarding full year 2022 guidance. First being COVID, while we did see a slight temporary slowdown in patient volumes early in the quarter due to Omicron, this did not appear to materially impact performance. While our growth is heavily predicated on our ability to penetrate to root canal market and sell consoles to new users, the durability of patient volumes in  offices is a positive sign that the end market is strong, and there's demand for our technology. That's a reminder on our last earnings call in March, we communicated variability in the supply chain of certain raw materials, which cost us to incur additional costs in the fourth quarter of 2021, and first quarter of 2022. The impact has been limited to our procedure instruments, and despite this disruption, all customer orders were fulfilled in the first quarter of 2022. In future quarters, we expect to risk to gradually mitigate as we recover safety stock positions, as overall volumes transition to CleanFlow procedure instruments, which in most instances do not utilize the same raw materials and suppliers as our legacy procedure instruments. While we have been working diligently through our limited market release, AAE was a great event which allowed us to showcase our new procedure instrument to the entire market and allow customers to perform or observe a procedure using an extracted tooth in our booth in what we call a test drive. This was in full display at AAE as the Sonendo team reinformed the benefits of CleanFlow to not only existing, but prospective customers. During educational and clinical demonstrations at AAE, CleanFlow's simplicity and ease of use resonated with the endodontic community, which gives us more confidence in not only the CleanFlow launch, but to also in our ability to drive increased utilization at the practice level. As a reminder, the CleanFlow procedure instrument works with our existing consoles, so there is no need for existing customers to buy a new machine to access this latest technology. This will allow us to ship CleanFlow procedure instruments to new customers, and seamlessly convert existing customers. Given the simpler to sign up CleanFlow compared to the previous generation procedure instruments, there are fewer components which lowers material costs and allows for easier assembly, which we believe will drive increased production efficiencies at higher volumes. Additionally, our full market release will ensure our commercial and clinical education teams can provide a world class onboarding experience for new customers. As a reminder, we will continue to manufacture and sell our current generation procedure instruments for current gentlemen customers with the goal of educating and converting them overtime, allowing them to transition at their own pace. Conversely, our strategy will be to primarily train new customers using CleanFlow to ensure immediate adoption. Given this dynamic and the fact that we have an approximate 850 GentleWave installed base, we expect to full adoption of CleanFlow may take up to 24 months, as we expand the commercial use in a responsible and considerate manner. Turning to our commercial strategy, our bifurcated sales team remains an important driver of growth as we penetrate our core market of approximately 17 million root canal procedures performed annually in North America, representing a market opportunity of approximately $1.9 billion. Given the number of capital and consumable reps we have hired, our plan is to maintain the size of our commercial team at this level for the near term as we focus on sales force effectiveness, initiatives, and sales execution before expanding further. In connection with the expansion of the number of consumable reps and bifurcation of our sales force, we're starting to see early signs of increased productivity and pipeline generation from our capital reps, who are now fully focused on selling capital equipment to new customers. Regarding procedure instrument trends, we continue to receive positive feedback from new accounts that have completed our updated training protocol, as compared to legacy customers. While still early, we believe this is a positive indicator of increased utilization, as these endodontists are becoming more comfortable not only with the technology, but also being able to treat a broader range of root canal cases. As our sales force matures, specifically consumable reps, we believe their consistent training with new and existing customers will drive average utilization rates higher, as they support the clinical workflow, practice workflow, and patient demand generation for our doctors. Lastly, in April, we announced an amendment to our credit agreement with Perceptive Credit Holdings, which provided Sonendo an additional $20 million over available credit by extending the borrowing deadlines for two tranches of $10 million to September 2022 and June 2023, respectively. In addition to our strong balance sheet consisting of $66 million of cash, this restructuring provides optionality if needed, to further support the growth of our business. Additionally, we will continue to prioritize gross margin expansion in clinical practice efficiency with the full commercial launch of CleanFlow. Thanks Bjarne, as previously mentioned, Sonendo total revenue for the First Quarter of 2022 was $9 million compared to $7.4 million for the First Quarter of 2021, an increase of 22%. Growth in the quarter was primarily driven by increased procedure instrument sales, and increased GentleWave console sales. In the first quarter, GentleWave console revenue was $2.1 million compared to $1.8 million in the first quarter of 2021. GentleWave console 11, selling prices in the quarter, were roughly $60,000, an increase of approximately 6% compared to the prior period, while flat sequentially compared to the fourth quarter of 2021. Turning to procedure instruments, pi revenue was $4.3 million compared to $3.3 million in the first quarter of 2021, an increase of 29%. Procedure announcements on the quarter totaled approximately 66,000 representing growth of 20% compared to the prior year period. Total software revenue for the first quarter was $1.8 million compared to $1.6 million in the first quarter of 2021, an increase of 13%. The increase in gross margin was driven primarily by improved overhead absorption and average selling price, partially offset by increased costs relating to supply chain. Our cash and cash equivalents as of March 31st, 2022, was approximately $66 million, while our long-term borrowings totaled $30 million. As Bjarne previously mentioned, on April 6th, we expanded our credit to include an additional $20 million subject to certain milestones of which we have yet to access. As we move forward in 2022, we have several positive structural tailwinds, including a larger sales force, increased underlying demand for GentleWave, and the full commercial launch of CleanFlow. For 2022, we continue to expect annual revenue to range between $40 to $43 million, representing year-over-year annual growth between 20 and 30%. Given the supply chain dynamic mentioned previously, we expect our second quarter of 2022 gross margins to be in line with the first quarter of 2022. That said, as we transition into the back half of 2022, we expect sequential gross margin expansion with positive contribution from the adoption of CleanFlow and increased volume. Bjarne, I was hoping we could start with the full-year revenue guidance of $40 million to $43 million. And along those lines, because you could you discuss how you see the cadence playing out for new system sales and procedure instrument sales as we think through the progression of the year and consider those PI supply chain dynamics you referenced in prepared remarks. We see strong demand for consoles, and obviously we saw significant science of that at the AAE. But like I talked a little bit about in our prepared remarks, we are seeing some temporary supply chain headwinds specifically with the procedure instrument packaging. So because of that, we've decided to apply somewhat level of conservatism here on our numbers and reaffirm the total $40 million to $43 million number despite the top-line beat here in Q1. With respect to new system sales, we see strong demand for consoles and I think that's something that was very apparent. We had a busy booth, we had great activity level, and I think that is a strong leading indicator for not just console sales here in Q2, but also leading indicator for what we should expect to see into the year. Like we alluded to, we -- the thing that we're looking at right now is of course the temporary supply chain headwinds associated with procedure instrument packaging. And specifically, what we're talking about are the plastic lids that we have that we put on top of the single used procedure instrument kits. First, let me just give some color on AAE because I think that helps frame the question a little bit. We just talked about obviously, great activity level at the AAE, which is like we think, a leading indicator that we have -- that our pipeline is building and in fact have a strong pipeline. I had the opportunity to visit AAE call it 10 years ago, when the conversation on the financial floor was really all about files, and we had large file manufacturers having large booths discussing files. Effectively if we see an industry that's really right for disruption, so that's the AAE. Let me just comment on the capital equipment demand across the industry, and I think it's, obviously there's a number of different dental companies that are giving insight into the overall market. So like we've talked about before, we also obviously have a strong value prop, and I think as you have these external dynamics in the market, I think doctors will look for new revenue sources, and I think when applied correctly, GentleWave can really be really an opportunity to really obviously improve the overall efficiency at the practice and increase the overall revenue for those practices. So taking all that in and kind of summarizing that, we feel good about the sales funnel that we're developing and that we continue to develop into the year. And then to confirm one item, Bjarne I lead you said utilization was a growth driver year-over-year, just want to clarify that. So we think of cadence for utilization of what we have talked about and Bjarne can expand upon this when we talk about attraction with the consumable reps, that the consumable reps now are being introduced to a lot of their customers and they're getting very good reception on that. And we new protocol for training that we mentioned, and we believe that training protocol is driving more utilization from the start with these customers. But what we are seeing is increased utilization net with our new accounts, and then also our existing accounts driving further adoption as well. Maybe I'll start off by saying that -- just give some high-level commentary on our commercial team here, they've seen a lot of sales teams across dentistry, and I have to say that I believe that we have even more professional sales team not just on the capital sales side, but also in the consumable sales side. So to your point, the time we did higher, obviously more capital sales reps, more consumables sales reps in Q4 of last year. So yes, so we're still we still believe that that six months ramp that we've previously talked about. That's helpful if I compare that to supply chain a bit, sorry to go back here and you've given some very helpful color on just how you think these challenges play out. I know you again, give some good color on the cadence there, but might be helpful just as we think about maybe 2023. And I think for us, if we look at all the different things happening on the supply chain side, and with everything that we know today, like we alluded to in our initial comments, we believe that most of these things will be solved for by middle of this year, so that is obviously what we see today. We have good confidence in that, and that is also obviously -- by the way, it's another thing that will help facilitate lower margins for the business. Maybe just want to give some additional comments as maybe setting this up also a little bit for how Mike is going to talk about some of the elements for the margin side, because, the pathway to improve margin is something that's really important to us, and those are the pathway to profitability, something that we're working on and is very important to us. So the faster we can convert customers over to CleanFlow, obviously that's going to be a significant driver of gross margin. We're going to continue to obviously, work on our contribution margins on CleanFlow. We're also going to continue to increase overhead absorption, meaning expanding the business, selling more console, driving utilization like we've talked about. While we see -- while we are under some pressure now because of supply chain, we see this as a temporary issue and underlying programs that we have are on track to get us to our gross margin target. When we announced the full commercialization of CleanFlow in April, it was great exciting time for us, very exciting at AAE, and we're already seeing positive momentum in utilization and feedback on the procedure instrument. We're anticipating that we're going to see good adoption, customers are asking for it, and we'll also see further improvements in the cost structure of CleanFlow as we start to ramp up the volumes and replaces our existing molds instrument. We haven't given specific guidance on gross margins, but I think the way we should think about that as we work through the volumes and improve both adoption and everything, something in order of magnitude, low 30s as a percentage of gross margin. So I think the way we should view AAE is that this is really a way to really build our pipeline, not just for the quarter, but for the rest of the year. When we were looking at -- like all businesses we're continuing looking at our options and sources of capital and perceptive has been a great partner in that, so we're certainly appreciative that we're able to secure that additional $20 million. We're looking at all other sources as well, on our ongoing basis, but right now we're in a very good position and our main priority is to continue invest in the business and drive growth, and increase our GentleWave install base. Obviously, we're early in our launch of CleanFlow. We're going to continue to execute on the plan that we have, and just to give you a high-level overview of the key elements of that plan, obviously, we already have some customers that are already onboarded with CleanFlow, and we're going to continues to support them. And then the third element of this is that we are going to convert our existing install base of 850 customers, and this is where our consumable sales team will come in and play a significant part of actually converting those customers. But for us, the reason why we're going to continue to really push to convert that faster is that that ultimately helps us drive improved margins in the business. So you're going to see on our side here and in our consumable sales team, they're going to be working -- we're going to be working hard to really convert those customers quicker such that we can get access to better margins quicker. It's really fascinating to see that conversion and how conversations have changed at the AAE because those large file companies that had those large booths, they don't have large booths anymore and they don't have a strong presence anymore and the conversations like we talked about have changed to cleaning this infection. But we're still, like we talked about in our last one, and that we've talked about in other other areas, we're very confident that we have a superior technology in terms of enabling good cleaning and disinfections in the teeth and enabling good outcomes in endodontics. So with regards to the partnering side, I think the -- obviously that's something that we'll continuously be the monitoring. But we think that big value-creation opportunity here in the business, Erin, it's just to continue to build on the GentleWave technology that we have, continue to build around the GentleWave platform and to continue to drive efficiencies in these procedures. We are doing less than 2% of procedures across root canal therapy in the United States and Canada today, so obviously we see a very large opportunity ahead, and we're very bullish on our ability to continue to take share and grow the business within that -- within this market."
}