{
    "symbol": "CTIB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-19 11:02:06",
    "content": " During today’s presentation, all parties will be in a listen-only mode. This conference is being recorded today, May 19, 2022. On the call today, is Yunhong CTI’s Chief Executive Officer, Frank Cesario as well as Chief Operating Officer, Jana Schwan. The company's Form 10-K for the year ended December 31, 2021 lists some of the most important risk factors that could cause actual results to differ from its predictions. Please also note that the company's earnings press release make reference to the adjusted EBITDA, a non-GAAP financial measure. The company views adjusted EBITDA as an operating performance measure, and as such, the company believes that the GAAP financial measure most directly comparable to its net income or loss. For further information, please refer to the earnings press release and the company's periodic filings with the Securities and Exchange Commission. At this time, I would like to now turn the call over to Frank Cesario, Chief Executive Officer of Yunhong CTI. With a sizeable portion of our revenue driven by events such as Valentine’s Day, Mother’s Day and Graduation, the timing of our shipments is highly impactful to our quarterly results. Last year more went in March while this year, some of that shipped in April and you can see that in our inventory number. To get ahead of it, I don't know how that's going to shake out in 2023. Every year, we're making some kind of guess because it's just a matter of days from Q1 to Q2. You seen from our results that our revenue is down from $6.6 million to $5.8 million, but I know that our margin rate was similar despite the volume change and of course, our bottom line was much improved. While we're on the topic, we've decided to put a toe in the pool of forecasting and share that we expect to post more than $1.2 million in adjusted EBITDA in 2022. As our business continues to mature, we'll decide how to best share expectations at the right level. We could end up reporting adjusted EBITDA number for 2022 in excess of $1.2 million so that's a figurative line in the sand that we're drawing today. With all the caveats that you know and we heard about the beginning of the call, that's where we're going to start. To provide some perspective on these topics, I've asked Jana Schwan, our Chief Operating Officer to share what the market is looking like and how we're addressing these issues. In 2019, we had an immense commercial helium shortage in the marketplace that hurt everyone in our industry. Today, we are seeing a tightening in helium supply once again, with some customers struggling to get 100% of what they require. We've been presenting fabulous designs for 2023 Valentine's Day, Mother's Day, Graduation. And yes, even Father's Day. In closing, we entered the first quarter of 2022 with a more sound financial and operational position and are confident in our ability to continue to execute against our transformational strategy. Yes, that's my question that seems like a high receivable number. If you look at how that is run rate against total revenue, it's very much in line. Remember, in retail on average, terms are about 60 days on average, they're 30. There's longer depending on what you're selling to whom, but $3.3 million, if anything is, is a pretty good receivable position. Okay, my last question is, how do you define no payable officers subordination, 1.2 million this quarter, zero last quarter? It was there last quarter, but you have to look at long term versus short term liabilities. But the answer is that same note was there last quarter, but you have to go into current liabilities to see it. Great job so far, and look to meeting guys sometime in the future."
}