{
    "symbol": "CTIB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-16 13:02:07",
    "content": " The earnings press release accompanying this conference call was issued Tuesday, November 15, after the close of market. On the call today is Yunhong CTI's Chief Executive Officer; Frank Cesario, as well as Chief Operating Officer Jana Schwan. Before we begin, we want to note that you should read the forward-looking statements in the company's earnings press release. During today's call, Management will make certain predictive statements that reflect its current views about future performance and financial results. The Company's Form 10-K for the year ended December 31, 2021 lists some of the most important risk factors that could cause actual results to differ from its predictions. Please also note that the Company's earnings press release refer to adjusted EBITDA, a non-GAAP financial measure. The Company views adjusted EBITDA as an operating performance measure and as such, the company believes that the GAAP financial measure of most directly comparable to it is net income or loss. For further information, please refer to the earnings press release and the Company's periodic filings with the Securities and Exchange Commission. At this time, I would like to turn the call over to Frank Cesario, Chief Executive Officer of Yunhong CTI. Hopefully you've had a chance to look at our press release, we issued the close yesterday with some rise financial information. Three months ago, we highlighted the elevated price of helium being the primary determinant of our third quarter, as our top selling product line is foil balloons usually filled with helium by our customers. While the price of helium gradually improved during the past three months, it remains elevated and a challenge for our customers to manage particularly those constraints from passing some of those costs through pricing changes. Looking at adjusted EBITDA which detailed as non-GAAP measures our press release, we posted a $400,000 improvement on $5 million less income -- plus revenue pardon me. The fourth quarter is traditionally our best quarter and we have significant candy blossom orders which are immune from helium pricing, on top of our Valentine's Day orders expected to ship during the fourth quarter. During normal year roughly half of our business comes from everyday sales think birthdays, while the other half is event driven such as Valentine's Day. We already processing commitments for 2023 Mother's Day, Father's Day and graduation. Jana Schwan, our Chief Operating Officer, will walk us through the process of working with customers to prepare for and fulfill their needs for these significant events. We are very proud of our in-house creative team, we begin presenting design concepts tailored to our specific customers needs and preferences almost a year ahead of the holiday. Anyone on the call familiar with manufacturing will appreciate the value of significant lead times and navigating not only recent supply chain and freight related challenges, but also the ongoing challenge of effectively deploying resources. Now that we've dramatically reduced our debt load over the past three years, this should overwhelm the increase in financial costs related to the interest rate increases."
}