{
    "symbol": "CTIB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-25 22:02:14",
    "content": "  Operator: Good day, and welcome to the Yunhong CTI Fourth Quarter and Year End 2022 Earnings Conference Call. This conference is being recorded today, February 23 of 2023. The earnings press release accompanying this conference call was issued after the close of market on Wednesday, February 22. On the call today is Yunhong CTI's Chief Executive Officer, Frank Cesario; as well as Chief Operating Officer, Jana Schwan. Before we begin, we want to note that you should read the full forward-looking statements in the company's earnings press release. During today's call, management will make certain predictive statements that reflect its current views about future performance and financial results. The company's Form 10-K for the year ended December 31, 2021, lists some of the most important risk factors that could cause actual results to differ from its predictions. Please also note that the company's earnings press release make reference to adjusted EBITDA, a non-GAAP financial measure. And as such, the company believes that the GAAP financial measure most directly comparable to it is net income or loss. For further information, please refer to the earnings press release and the company's periodic filings with the Securities and Exchange Commission. At this time, I would like to turn the call over to Frank Cesario, Chief Executive Officer of Yunhong CTI. Good morning, and thank you, everyone, for joining us on our call today. Hopefully, you've had a chance to look at our press release issued at the close yesterday with summarized financial information. We saw nice improvement results during the fourth quarter as we sold product for Valentine's Day, our favorite holiday, and had a better mix of products that don't involve helium. Much of 2022 is plagued by the elevated price of helium, as our top-selling product line is foil balloons, usually filled with helium by our customers. It remains elevated and a challenge for our customers to manage, but far less so than it was last year. With more stable helium pricing, we have seen a nice recovery in demand. While the story of 2022 was the out of helium-related revenue challenges, we hung in on the bottom line and put some points on the board. Foil balloon sales were down $7 million last year, and yet we improved our overall gross margin from 15% to 17%. And as previously discussed with shareholders, we went from what we term a debt-rich position a few years ago to more of a debt-poor position today, and today is far better. Thanks to the efforts of our entire team, we demonstrated a resiliency that was not available a few years ago. Adjusted EBITDA of less than $100,000 during 2022 is a bad answer. 2022 was supposed to be our coming-out party as the last of our legacy subsidiaries was sold in the fourth quarter of 2021, and massive noncash charges were taken. Their comments include many of the same factors that affected us: helium prices and concerns over inflation, shipping costs and changing consumer behavior during and after the pandemic. One of the aspects that we have attacked in our business has been our debt load, going from about $20 million down to about $5 million. Jana Schwan, our Chief Operating Officer, will share what she sees in terms of operations and her customer-facing position. The payback on these investments are in less than 9 months, so it's a no-brainer for us to do. On the customer side, we are seeing improved availability and pricing of helium, which is opening up the foil balloon market. Having been through 4 helium situations in my career, the recovery tends to be good for us. We are ready to fulfill this market need with additional -- with the addition of several new designs for all occasions launching this year with , giving our customers the ability to fill select 17-inch standard balloons with air and hang from the ceiling for display or a traditional helium fill. Finally, it's worth noting that the availability of labor has improved during the past 12 months as has the cost and ease of moving goods. As the price of helium significantly reduces or reduced the sales of our foil balloons during 2022, we were able to redeploy resources into non-helium areas. We are first and foremost a foil balloon company, and foil balloons are primarily filled with helium. We all see challenges in the retail space broadly, so the helium issue was an unwelcome piling on. Looking at what we can do with our traditional business and what we can develop from the material solutions advanced by the Yunhong Group and other strategic partners, we ran, not walked, into 2023. But for anyone who's on the call live, we invite you to ask a question. Frank and Jana, thanks for the earnings call. And they're going to take time to get out commercially, certainly at scale, but we've been experimenting. We have prototypes, quite a different product, frankly, with these new materials, and we're working to make them better. And so what does that turn out to be for 2023, which is your specific question, I don't know. I don't know enough in February to know what sorts of revenue could be attributed, right, to these pushes. And we are fortunate to have some inroads to get there, so we're going to push that and see what comes. And insiders spend most of the year unable to transact stock, but your point is well taken. And even though last year was not the way we thought the story would be told, it did present us an opportunity to fight through challenges and get to a better spot. If we go into any sort of recession, that's typically good for a countercyclical company like us. So there are a lot of reasons that we are optimistic about our future this year, and I look forward to having a chat in a couple of months to talk about the first quarter and see how we've got started. This does conclude today's conference call, and you may disconnect your lines at this time."
}