{
    "symbol": "GLT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 15:23:05",
    "content": " Composite Fibers results lowered earnings by $0.20, driven primarily by adverse volume impact from the Russia/Ukraine crisis and escalating inflationary pressures in energy, raw materials and logistics, which exceeded our pace of price increases. Total revenues for the quarter were up nominally on a constant currency basis, driven by higher selling prices of $17.6 million, resulting from multiple pricing actions and energy surcharges taken last year and in the first quarter of this year. However, this was not enough to mitigate rising energy prices in Europe, which further spiked in the first quarter, due to the Russia/Ukraine conflict along with continued inflationary pressures in raw materials and logistics. Energy, wood pulp, and freight prices continue to escalate in the first quarter and negatively impacted results by $29 million versus the same prior year period. This included $61 million of Dresden asset impairment, $56 million of Composite Fibers goodwill impairment related to the long-term fair value implication of the conflict and the related unprecedented energy prices in Europe and a $4 million write-down of Russia and Ukraine accounts receivable and inventory. While these actions collectively held the segment to offset the higher raw material prices, they fell short of recovering the greater than anticipated energy prices – energy price increases unfavorably impacting results by $3.2 million. Selling prices and energy surcharges lifted results by $2.3 million versus the previous quarter, but were more than offset by input cost inflation totaling $2.9 million, particularly from synthetic fibers and energy costs at our European sites. For the first quarter, corporate costs were $1 million favorable versus the same period last year, mainly due to lower incentive accruals, cost control initiatives and the timing of spent. Q1 2022 adjusted free cash flow was lower by approximately $66 million versus the same quarter last year, mainly driven by working capital usage of $42 million and lower cash earnings of about $9 million."
}