{
    "symbol": "GLT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 10:57:09",
    "content": " Composite fibers results improved earnings by $0.01 as higher selling prices, lower depreciation from the Dresden impairment and favorable currency and related hedging more than offset the inflationary pressures and volume decline from EU sanctions. Airlaid Materials results increased earnings by $0.03, primarily due to the segment's ability to effectively pass through inflation to customers, coupled with favorable mix and strong operations supported by the higher demand in North America. Spunlace results lowered earnings by $0.07 as a result of input cost inflation that outpaced price increases, lower-than-expected volume and the high cost of production due to elevated waste rates, inefficiencies and labor shortages in the U.S. To note, spunlace was not in our results for Q3 2021 as the acquisition had closed at the end of October last year. Interest expense lowered earnings by $0.09 with the issuance of a new bond to finance two acquisitions, and taxes and other items were $0.17 unfavorable mainly due to a valuation allowance of $5.2 million related to our spunlace operations in Soultz, France. Revenues were up 18% on a constant currency basis versus the same prior year period, mainly driven by higher selling prices of approximately $23 million stemming from contractual cost pass-throughs as well as price increases initiated for customers without such arrangements. Volume is expected to be 2% to 3% lower, reflecting normal seasonality in the fourth quarter and unfavorably impacting results by $1 million to $2 million - by $1 million. The revenue increase was mainly due to higher selling prices of approximately $23 million as we have successfully converted approximately 55% of the revenue base to a floating price mechanism, coupled with multiple pricing actions and energy surcharges taken in 2022 to offset inflation. Continued escalation in the price of energy, key raw materials and freight, lowered earnings by $24.3 million versus the same quarter last year. Operations, FX and other items were a net $4 million favorable, mainly driven by integration cost reduction efforts, lower energy consumption and overall lower spending. Volume is expected to be 10% to 15% lower, driven by a reaction from price-sensitive customers to our recent price increases, unfavorably impacting operating profit by approximately $1 million to $2 million. For the quarter, corporate costs were higher by $1.5 million versus the same period last year, mainly due to relatively lower legal, travel and corporate spend. We expect full-year interest and other financing costs to be approximately $39 million, $4 million higher than our previous guidance. On a year-to-date basis, our 2022 adjusted free cash flow was lower by approximately $119 million versus the same period last year, primarily driven by higher working capital usage of $62 million."
}