{
    "symbol": "NREF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 13:20:16",
    "content": " At this time, I’d like to turn the conference over to Jackie Graham. Good day, everyone and welcome to NexPoint Real Estate Finance’s conference call to review the company results for the first quarter ended March 31, 2022. On the call today are Brian Mitts, Executive Vice President and Chief Financial Officer; Matt Goetz, Senior Vice President, Investment and Asset Management; and Paul Richards, Vice President, Originations and Investments. As a reminder, this call is being webcast through the company’s website at www.nref.nexpoint.com. Before we begin, I would like to remind everyone that this conference call contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are based on management’s current expectations, assumptions and beliefs. The statements made during this conference call speak only as of today’s date and as such as required by law, NREF does not undertake any obligation to publicly update or revise any forward-looking statements. For a more complete discussion of these non-GAAP financial measures, please see the company’s presentation that was filed earlier today. I will cover guidance briefly and then turn over to the rest of the team for them to give a detailed commentary on the portfolio, some recent activity, some of the things that we see ahead for the remainder of the year. For the first quarter, we reported net income of $0.81 per diluted share compared to net income of $1.26 per diluted share for the first quarter of 2021. In the first quarter, we paid a dividend of $0.50 per share and the Board has declared a dividend of $0.50 per share in the second quarter. On the guidance for the second quarter, earnings available for distribution per diluted share, we are guiding to $0.55 per share at the midpoint of the range of $0.50 to $0.60. And for cash variable for distribution per diluted share, we are guiding to $0.64 per share at the midpoint with a range of $0.59 to $0.69. The loan portfolio is 97% residential, with 44% invested in senior volumes, collateralized by single-family rental, 54% invested in multifamily, primarily via agency CMBS. The portfolio’s average remaining term is 6.4 years, with 94% stabilized. During the quarter, we originated the convertible note in the amount of $38.7 million bringing our total convertible note exposure to ground leases to approximately $60 million. Subsequent to quarter end, the sponsor repaid all the $25 million of this amount, which is converted into common equity in the company at a 12.5% discount. On January 14, we purchased $19.6 million of preferred equity collateralized by single-tenant stabilized pharmaceutical manufacturing property, with a current yield of 10%. On January 27, we purchased $41.8 million of our preferred equity investment collateralized by a stabilized multifamily property in Las Vegas, Nevada. On January 25, 3 single family rental first mortgage loans with an aggregate principal amount of $32.1 million were repaid in full within revenue achieving an IRR of 41.5%. On February 23, a $62 million single-family rental first mortgage loan was repaid in full and realized an IRR of 35.9%. In summary, we continued to find attractive investment opportunities throughout our target markets and asset classes and we will continue to evaluate these opportunities with the goal of delivering value to our shareholders. During the first quarter, the company is yet again active in the primary bond market. Though there were not anything in the bond acquisitions we made during the first quarter, the company participated in two Freddie Mac bond auctions. One of which was a small balance loan VPs and Freddie Mac’s  program and the other, which was a floating rate, both auctions demonstrated extremely strong demand and ultimately priced well inside previous market clearing levels. The VPs was purchased for approximately $39 million, which we will prudently lever via attractively priced repo financing. As discussed in the previous quarter’s commentary, the market continues this year its inflation headwinds, along with the Fed signaling multiple half point rate hikes. So as previously mentioned, there has been insatiable demand for Freddie Mac VPs bonds and we continue to see the price – we continue to see price tighten. Lastly, I want to briefly touch on the continued performance of the SFR loan pool in the Q1 2022 loan pay-downs. The portfolio has had a few SFR loan pay-downs in the first quarter, which generated a combined IRR north of 40% compared to the original underwriting of 9%. To finalize our prepared remarks before we turn it over for questions, I’d like to turn it over to Matt McGraner. Again, we continue to be pleased with the underlying credit performance of NREF’s portfolio, generating good value growth for the eighth consecutive quarter, while providing durable cash flows for our shareholders. The recent market volatility has started to bear fruit for NREF’s investing pipeline, creating effective chance in gas financing opportunities in our core property types, especially in the multifamily sector. And finally, we continue to cultivate programmatic special situation and preferred opportunities with SFR, storage, multifamily sponsors with an underwriting pipeline today north of $400 million. As we look at the portfolio of mix, the multifamily SFR mix has sort of flipped over the last year. Hey, Steve, it’s Matt McGraner. Yes, I think we continue just to have more financing opportunities within the multifamily sector. It’s just a larger market, more institutional, more transaction volume. And as I mentioned kind of briefly in the prepared remarks, as long as the agencies kind of keep spreads wider than banks and other license, we are seeing these GAAP financing opportunities in the multifamily sector kind of accelerate. So, our historical private preferred pipeline is about $100 million a year. So, I would expect us to spend a lot of time in that market and that’s just a function of the recent volatility. And then number two, probably more importantly, we think it’s a 2x over 3 years. Hey, Steve, it’s Brian. And obviously, it’s difficult when you are getting prepayments and things to really estimate that out into the future. So as we increase earnings, we want to be cautious about increasing the dividend and try to pay to that coverage to our earnings available from distribution because we think that’s also better longer term to you than just cash available for distribution. So I think once you get a couple of quarters under our belt for the current portfolio and better understand where the prepayments are going to go, particularly in that SFR pool, where I think just the run-up in values of SFR properties puts the borrowers in a position where they are at a pretty low LTV with our loans. For some color, I think the shelter index is about one-third of what the Fed looks at in terms of inflation. And given the time line to turn over assets, and I believe multifamily turnover ratios are still running low, that adjusted inflation will have a lagging effect on inflation. And so if the Fed really wants to get inflation under control, they have to slow down, not just the home purchase market, but also the rental market. So question is, what are you thinking and projecting for the outlook for rent growth in multifamily as well as single-family for rent and what impact do you think housing – sorry, rising rates will have on cap rates. I think we reported in earnings 2 days ago, our strong same-store NOI growth that we’ve had in a couple of years. In Americas, just basically the same thing this morning or yes after the close and most of the operators in sort of I guess even the gateway markets have all kind of increased guidance in terms of just seeing top line and GPR growth within their rev rolls. This year, I think is – we will see continued strength in underlying leases, especially and particularly in the agency and middle market, the agency cohort. I think the cap rates for the transaction volumes, at least for now, have kind of – to take a brief pause, but there is still a ton of equity out there chasing deals. And while there might be less sort of in the buyer pool, so to speak, those are well healed and the institutional capital is still chasing multifamily because of this underlying growth in stability in the rents and a perfect – not perfect, but close to as perfect as you can get for an inflation hedge. Capital has been – more capital, institutional capital has been allocated towards the residential sector for these reasons as an inflation hedge, and – so I don’t see that abating. If any, the cap rates would increase, but they haven’t yet. And as I’m sure you’re aware, in the last few weeks, the agencies have continued to tighten spread. So yes, I’d say that we’re still positive, obviously, on a relative basis to a multifamily, more so than probably any other property type in this current environment, especially when it’s in the middle market segment, which is largely where most of our activity is. In terms of SFR, I’ll let Brian or Paul comment. It’s a lot of the same dynamics, I think, with multi – and overall, I think we look at the portfolio itself and the underlying assets. It’s hard for us to report on that because we don’t get updated numbers specifically across the entire portfolio frequently, but being in the business and owning over 22,000 loans ourselves across the country in different vehicles, we do understand that market. But as we mentioned earlier, it is a loss institutionalized sector, it is harder to find opportunities, and there is a big disparity between a handful of really large players and then everyone else is pretty small and not necessarily the types of partners we want them into from those vehicles. So I think as far as the sector goes, like SFR, it’s got a lot of strong fundamentals and tailwinds, but it’s hard to put money to work there. And obviously, we don’t control the loss prepayments in the current environment. And if we look at our home ownership costs versus renting, it’s 40% more HPA versus renting. I think if you look at our rental to income, it’s still 20%, 25%. I think lastly, Jay, I don’t know how the Fed is going to get it under control by raising rates. So I think that the rental space, the middle market space that we operate in, where majority of our investments are, well you need to benefit from that. I don’t know how they will either – they may need to cause unemployment to rise, and that means probably a recession, but there is a labor shortage. Let’s see, on the single-family rental repayments, any partial pay-downs received from Progress Residential. So or long-dated loans, so the prepayment is still, call it, 20% or so. Yes, I don’t see that prepaying anytime given the size. I saw recently that there are some stories about them loosening underwriting, not just tightening spreads, as you mentioned, but also their look back that service coverage ratios. I mean, you’re exactly right anecdotally there. And they were, I guess, just trying to internally work through how they can be competitive and make sure that they still provide liquidity to the market because right now, they are about a month behind last year’s run rate. From the CMBS side, the VPs actually did tighten given the fact that the auctions priced 200 basis points higher than the original market playing levels or the previous market playing levels. Those did have, one, amortizing and two, interest rates rising did cause a little bit of mark-to-market loss on IO strips."
}