{
    "symbol": "RNLX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-06-30 12:21:05",
    "content": " Examples of these statements include, without limitation, the potential benefits including economic savings of KidneyIntelX, the potential for KidneyIntelX to receive regulatory approval from the FDA, the commercial prospects for KidneyIntelX if approved, including whether KidneyIntelX will be successfully adopted by a physician and distributed and marketed, our expectations regarding reimbursement decisions and the ability of KidneyIntelX to curtail cost of chronic and end stage kidney disease, optimize care delivery, and improve patient outcomes, trends in our market and potential benefits of government policy change, the impact of COVID-19 and other world events on our business, our expectations for hiring, product development, strategic partnerships and collaborations, reimbursement decisions, clinical studies and regulatory submissions, our business strategies and future growth including plans, expectations and opportunities for financing our operations, and revenue projections and guidance. These are complex integrations and itâ\u0080\u0099s now starting to pay significant dividends, so weâ\u0080\u0099re adding more and more practice sites, the message with population health is now coordinated, the electronic health system integration is now running smoothly, and weâ\u0080\u0099ve taken a lot of these learnings obviously to the next set of integrated disease networks, including weâ\u0080\u0099re now starting to see the same thing happen at Wake Forest and at Atrium Health, and then of course into the VA. Iâ\u0080\u0099m pleased with how the traction is occurring and Iâ\u0080\u0099m pleased most importantly because what really counts at the end of the day is the utility data, are you showing that youâ\u0080\u0099re making a difference, are you changing behavior at the primary care level, are we increasing guidelines-driven care, where before there was none or it was lacking. Once you get to that tipping point where you have majority coverage against your indicated use population, it does change the game because now physicians and patients have confidence that theyâ\u0080\u0099re not going to be stuck with a testing bill, and we are moving into that position, so Iâ\u0080\u0099m actually very pleased that in a very short period of time - you know, weâ\u0080\u0099ve only been operating a couple of years here, that weâ\u0080\u0099ve been able to achieve the reimbursement milestones and positive coverage determination from major players this quickly. This history of diagnostics is you have weak coverage or quasi-coverage and you move in and start building fixed overhead in a sales marketing medical science liaison customer support capacity, and you really havenâ\u0080\u0099t developed concrete majority insurance coverage against the population that youâ\u0080\u0099re rolling that fixed overhead out against, and of course itâ\u0080\u0099s the trap, right - weâ\u0080\u0099ve got to generate revenue, so we send a sales force in and we start a bottoms-up push approach. Again, Chicago and Illinois now become a focus because weâ\u0080\u0099ve secured one of the big payors in insurance in Chicago, and that was a major win for us across a substantial population base, so that now starts to justify us taking a look at the Chicago market to start developing, and weâ\u0080\u0099re having lots of discussions with different medical systems, weâ\u0080\u0099re having discussions with KOLs in the Chicago area, weâ\u0080\u0099re looking at the health equity angle, which is something that affects all major cities, but that was a significant and in fact an accelerated win for us to be able to walk into that market with that coverage. Yes, we do want that flexibility, especially with some of the strategic partnership movements that we have, which obviously we would expect the market would view as good news, there are two ways to get to revenue profile growth in fiscal â\u0080\u009923 and fiscal â\u0080\u009924, one of which is the organic growth that weâ\u0080\u0099re pursuing system by system, region by region, coverage by coverage, and obviously the other is being able to partner with much larger concerns that have large national sales forces, existing distribution, and an incentive to make sure that patients are being adequately identified and risk assessed at the primary care level. Thereâ\u0080\u0099s nobody out there that is not trying to figure out how do we control these costs, so weâ\u0080\u0099re usually able to get into a health system and have a pretty open and engaging discussion about the benefits of KidneyIntelX, and now that weâ\u0080\u0099re publishing utility data based on our experience with major health systems like Mount Sinai, these discussions are becoming a lot easier because we can now point to the evidence that if you deploy KidneyIntelX on an integrated basis, you engage your primary care physician base and you start to increase guidelines-driven care, which at the end of the day is the ultimate game."
}