{
    "symbol": "BBDC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 13:34:07",
    "content": " Net asset value per share was $11.41 compared to the prior quarter of $11.86, down 3.8% driven primarily due to unrealized write-downs tied to macro market factors and spread widening as opposed to fundamental credit-related factors. Our net investment income increased to $0.29 per share compared to $0.23 per share last quarter as a result of increasing interest and fee income as well as the elimination of our income incentive fee due to our shareholder-friendly fee structure, specifically in the incentive look-back feature, which includes realized and unrealized gains and losses. In the second quarter, continued strong investment performance drove total investment income higher quarter-over-quarter to $56 million and net investment income to $32 million, both up from $44 million and $19 million in the first quarter. In addition to our middle-market exposure, we continue to draw upon Barings wide investment frame of reference to complement our core portfolio with $441 million of investments in the legacy MVC and Sierra portfolios, and $612 million of cross-platform investments. And notably, the legacy MVC portfolio saw a total depreciation of $11 million with the majority tied to underlying credit performance while the Sierra portfolio had total depreciation of $16 million, $12 million of which was attributed to price movements, predominantly tied to CLO equity positions and the Sierra joint venture. As we've discussed, our net investment income per share increased to $0.29 for the quarter driven by a $12 million increase in total investment income as well as the elimination of the income incentive fee resulting from unrealized marks on the investment portfolio. Excluding certain equity investments, Barings BDC deployed $338 million at an all-in spread of 836 basis points, which represents an 11 basis point spread premium to comparable liquid market indices at the same risk profile."
}