{
    "symbol": "BBDC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 12:28:03",
    "content": " Net asset value per share was $11.28 compared with our prior quarter of $11.41 and down approximately 1.1%, driven primarily by unrealized write-downs tied to macro market factors and spread widening as opposed to fundamental credit-related factors. Our net investment income was $0.26 per share compared to $0.29 per share last quarter, impacted by sales and repayments that occurred early in the quarter as well as a partial income incentive fee capped by our shareholder-friendly fee structure, which includes realized and unrealized gains and losses. Additionally, our Board declared a fourth quarter dividend $0.24 per share equated to an 8.5% yield on our net asset value of $11.28, which matches our industry-leading hurdle rate, and Iâ\u0080\u0099ll have Jonathan Landsberg provide additional detail on our approach to dividend policy later in the discussion. And as I mentioned, continued strong investment performance drove total investment income slightly higher quarter-over-quarter to $56 million, though the percentage increase in total revenue was muted by one, earlier portfolio sales and repayments in the third quarter; two, later-than-anticipated fundings and three, nonrecurring $2 million revenue in the second quarter tied to a large distribution from a CLO and wind down. Our middle market portfolio decreased by $14 million on a net basis in the quarter, with gross fundings of $163 million, offset by sales and repayments of $176 million. The underlying yield at fair value on our middle market investment portfolio of 9.2%, up from 7.9% last quarter and weighted average first lien leverage of 5.2 times and remain reflective of our boring is beautiful approach to credit. In addition to our middle market exposure, we continue to draw upon Baringsâ\u0080\u0099 wide investment frame of reference to complement our core portfolio with $374 million of investments in the legacy MVC and Sierra portfolios and $652 million of cross-platform investments. Our net investment income per share was $0.26 for the quarter, driven by generally stable total investment income, as mentioned earlier by Jon, combined with a capped incentive fee resulting from unrealized marks on the investment portfolio. Compared to the end of 2020, our reliance on secured bank debt has decreased with the issuance of $725 million of unsecured debt in both the public and private markets as we have continued to diversify our liabilities to match our diverse portfolio of assets."
}