{
    "symbol": "FOXA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-10 13:13:06",
    "content": " Cable other revenues increased 23%, led by the timing of sports sub-licensing revenues which were impacted by COVID last year, as well as continued subscription momentum at FOX Nation. EBITDA at our Cable segment increased by $14 million over the prior year period as these revenue increases were partially offset by higher expenses related to the digital investments of FOX News Media and the timing of programming amortization and production costs at the Cable Sports Networks following the COVID-related disruptions of the prior year Almost matching the strong revenue growth in cable, our Television segment delivered a 7% increase in revenue. Our Television segment also delivered 6% advertising revenue growth, reflecting strong linear pricing at the FOX Network and continued growth at Tubi, partially offset by lower impressions of FOX Entertainment. Television EBITDA was lower by $100 million against the prior year period, as its healthy revenue growth was more than offset by the planned digital investment at Tubi, higher sports programming amortization and production costs at FOX Sports and an approximately $30 million write-down of certain scripted programming at FOX Entertainment. Turning now to cash flow, we generated strong free cash flow of $1.54 billion in the quarter, reflecting our normal seasonal cycle of collecting advertising revenues from our old programming and the result of our sports rights payments being concentrated in the first half of our fiscal year. Operator, we can go to the next question. So, we think the coming mid-term elections will be – will really be an advertising boon for us, as well Moving on to Pay TV pricing, well, from – frankly, from both an advertising point of view, which is incredibly strong with the strength of FOX News, and I spoke about it a little bit in my in my earlier statements, the strength of FOX News, but also the strength of FOX News and the station group from our retransmission and distribution revenue point of view really has never been stronger. Operator, we can go to the next question. Operator, we can go to the next question."
}