{
    "symbol": "LECO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 15:09:06",
    "content": " Excluding $11 million of special items, primarily from an asset impairment charge and acquisition transaction costs related to our recent  automation announcement, our adjusted operating income increased 25% to $153 million on higher volumes operational improvements and automation and favorable segment mix, which was partially offset by $8 million in unfavorable foreign exchange translation. The adjusted EBIT margin increased 220 basis points to 19.1% from solid volume growth, operational improvements and automation and effective cost management versus the prior year. Americas Welding organic sales increased approximately 27% as key end markets such as automotive, general industries and energy accelerated in the quarter reflecting strong customer production activity and capital investment. The International Welding segment's adjusted EBIT decreased approximately 13% or $4 million to $25 million, which was impacted by $6 million of unfavorable foreign exchange translation. Cash flows increased 19% to $130 million, reflecting 94% cash conversion, average operating working capital remained elevated at 19.5% of sales at the end of the quarter as we maintain higher inventory levels to support higher sales and mitigate challenging supply chain conditions. We've agreed to a cash purchase price of $427 million which represents approximately a 9.3x EBITDA multiple with synergies driven by top line growth and profit improvement through integration of our Lincoln business system, including a new ERP system and disciplined processes. Well, look, I think the uncertainty that we're highlighting and managing is just the uncertainty with the potential energy crisis that's migrating across Europe and what that may mean to the demand models as we move into Q4 and certainly probably permeating into as they work through those challenges around energy in the colder months, especially in the international markets and specifically Europe."
}