{
    "symbol": "LECO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 16:06:05",
    "content": " We achieved record sales of $970 million, led by 21% organic growth on 17% higher price and a 3% increase in volumes, including a solid 10% increase in volumes in our Americas Welding segment. Our gross profit margin increased 120 basis points to 34.4% as benefits from volumes cost management and improved operational execution and automation in Europe offset broad raw material and freight inflation across the business, including an approximate $10 million LIFO charge in our Americas Welding segment. Reported operating income increased 38% and to $168 million, and we achieved a record reported and adjusted operating margin of 17.3% of sales, a 220 basis point improvement versus the prior year's adjusted operating income margin. The adjusted EBIT margin increased 200 basis points to 18.9% from solid volume growth, effective cost management and operational improvements in automation, which maintained low double-digit percent EBIT margin performance in that product area. Second quarter adjusted EBIT decreased approximately 2% and to $18 million, and the adjusted EBIT margin decreased 250 basis points to 12.8% and as the organization continued to incur higher expenses associated with acquisition integration initiatives, unfavorable mix and declining commodity pricing in certain metals offerings. Harris organic sales increased approximately 4% on 4% higher price to recover rising raw material costs and a 50 basis point reduction in volumes as strength in industrial applications and specialty gas was offset by weakness in the retail channel, which is expected to persist through year-end on weakening consumer trends. And look, I think the other element, and it's an element I've seen, and it's a positive for us at Linc Electric is I mentioned it earlier in my comments, many of the solutions that we've developed for these segments are penetrating into the marketplace and they're penetrating into the marketplace globally."
}