{
    "symbol": "LECO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 17:48:06",
    "content": " Moving to slide five, our consolidated first quarter sales increased approximately 22% to $925 million from a 19% increase in price and approximate 5% benefit from acquisitions, 3% higher volumes, and a 4% unfavorable impact from foreign exchange. Our gross profit margin increased to 210 basis points to 35.6% as benefits from volumes, mix, price management, improved operational execution and automation, and structural savings offset higher raw material and freight costs, including an approximate $7 million LIFO charge. The adjusted EBIT margin increased 310 basis points to 19.8% from volume growth, price management and operational improvements in automation, which allowed us to achieve our 2022 target of a low double-digit percent EBIT margin in that product area. Moving to the Harris Products Group on slide eight, first quarter adjusted EBIT increased approximately 5% to $20 million and the adjusted EBIT margin decreased 250 basis points to 14.4% against a challenging prior year comparison. Moving to slide 10, we continue to pursue growth investments in the first quarter with an 88% increase in CapEx spending approximately $90 million in the quarter led by projects focused on long-term capacity needs, production upgrades, automation and investments and improve our competitive cost position. Turning to slide 11, we're entering the second quarter with strong momentum in order rates and record backlogs and while the operating environment has become incrementally more challenged in our international markets, we are increasing our full year organic growth assumptions to now be in the mid-teens percent range. And what I mean by that is just the breadth of the performance within Lincoln Electric in the quarter, execution on productivity initiatives that we've gotten within our automation business and globally with our restructuring and the work that we're doing on our business model internationally, growth in a host of the areas in our business, a step change in improvement in the operating model in automation where we bring that to the double-digit growth, or double-digit operating margins that we're looking for, and obviously significant growth factor certainly forward as it's performed in Q1."
}