{
    "symbol": "HI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-03 11:25:28",
    "content": " 11:22 Adjusted earnings per share of $0.94, came in at the high end of our expectations, but was down $0.02 or 2%, compared to the prior year as inflation unfavorable mix in an increase in the strategic investments, more than offset higher volume, favorable pricing and productivity improvements, including synergies. 13:18 Moving to segment performance, pro forma APS revenue of $315 million, increase 19% or 22%, excluding the impact of foreign currency, driven by higher-volume of large plastic projects, favorable pricing and higher aftermarket parts and service revenue. 14:14 Pro Forma adjusted EBITDA of $55 million, increased 18% while adjusted EBITDA margin of 17.4% decreased 10 basis points from the prior year, as operating leverage from higher volume, favorable pricing and productivity improvements were offset by inflation, unfavorable mix due to a higher proportion of large plastic projects and strategic investments. 16:00 Turning to Molding Technology Solutions, revenue of $249 million, increased 5% compared to the prior year, or 6%, excluding the impact of foreign currency With higher-volume in both injection molding and hot runner equipment, particularly for applications related to automotive construction and packaging. Revenue of $163 million, decreased 1%, compared to the prior year, due to lower burial volume primarily resulting from an estimated decrease in deaths associated with a COVID 19 pandemic and an estimated increased rate at which families opted for cremation, partially offset by improved average selling price. 18:46 Adjusted EBITDA of $41 million, decreased 23% and adjusted EBITDA margin of 24.9% declined 680 basis points compared to the prior year as inflation, higher transportation premiums and lower volume more than offset the impact of the price increase we took on October 1. We will continue, as we have said, to look at opportunities to increase in base business, bolt-ons that help improve the technology offerings and system offerings that we offer in our base business, but also targeted in some of these very attractive long-term growth end markets like recycling, like food, specifically, those are some areas that we will be paying particular attention to, from an M&A standpoint on kind of bolt-on areas to – to areas we operate in today, but where we want to grow at a faster rate."
}