{
    "symbol": "PENN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 13:20:23",
    "content": " For the year, our results were slightly above the midpoint of our revenue and EBITDAR guidance ranges. Slide 6 in our earnings deck illustrates our year-over-year revenue growth was driven by our Interactive segment, which despite the Mattress Mack $10 million winning bet on the Astros in the World Series was profitable in the fourth quarter with several successful state launches and impressive growth in Ontario. As a result of the continued rollout of this technology at new properties as well as increased engagement in our current 3Câ\u0080\u0099s properties, we had 136,000 mywallet customers and received $80 million in total mywallet deposits as of year end, which represents significant sequential growth. For the year, our results were slightly above the midpoint of our revenue and EBITDAR guidance ranges. $200 million is maintenance CapEx and $100 million is growth CapEx on ROI generating projects such as new hotel remodels, the continued rollout of our Barstool retail sportsbooks and technology investments at our properties. With full control of our product roadmap, we have been able to quickly add new features and betting markets to theScore Bet including our own same game parlay offering, which has led to a noticeable increase in hold, both compared to our pre-migration track record in Ontario as well as what we are seeing here in the U.S. More importantly, our advanced promotional capabilities are helping to deliver higher retention and higher revenue per player metrics in Ontario than in the U.S. If â\u0080\u0093 what I would say at a high level is that what weâ\u0080\u0099re seeing in the business today on the retail side and interactive, if that is status quo for the year, then the midpoint of guidance will end up being conservative, but itâ\u0080\u0099s way too early to say if thatâ\u0080\u0099s how itâ\u0080\u0099s going to play out. And I think our market share in sports betting, this fall and this winter here in the U.S. has softened up a little bit, and we really havenâ\u0080\u0099t been as focused on driving acquisition, knowing that our product isnâ\u0080\u0099t as competitive currently here in the U.S. as it was compared to everybody else a year ago. I think Todd and the team have done a great job in all these markets, and weâ\u0080\u0099re just â\u0080\u0093 weâ\u0080\u0099re getting smarter every time we launch in a new state in terms of the collaboration between interactive and retail and really planning for omni-channel effect as opposed to just for whatâ\u0080\u0099s our market share in to handle the first month. But if I understand your question correctly, Joe, when Felicia broke down the CapEx plans for the year, what you saw is that a total number of, call it, $400 million and roughly $87 million, $88 million, and I call it, $90 million of that is going towards the four growth projects that we talked about earlier in the year, the two in Illinois, the hotel in Columbus, Ohio and the hotel at M Resort in Las Vegas."
}