{
    "symbol": "PENN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 13:19:07",
    "content": " You'll see on slide 5, we achieved record first quarter revenues of $1.56 billion and adjusted EBITDAR of just under $495 million, which grew 23% and 11%, respectively over 2021 levels, driven primarily by strong property level performance across all segments, including the older core demographic who are reengaging through both increased visitation levels and spend per visit. Slide 12 shows the benefits of our integrated retail Barstool Sportsbook and gaming areas, which are helping to maximize cross-sell opportunities on table game play, particularly in the younger segments, comparing first quarter of this year to first quarter of 2019, we've seen a 53% increase in Table Theo for ages 21 to 44 at our properties with retail sportsbooks. As highlighted on slide 18, while still early, theScore Bet's performance thus far in Ontario has exceeded our expectations, due in large part to theScore's incredible brand recognition and media footprint as well as the support from Barstool Sports in the popular team from Spittin Chiclets, the number one Hockey Podcast in Canada. and he number one rated betting app in the iOS 4 Early results reflects strong cross sell opportunities, currently 79% of all bidders in Ontario are theScore Media app users and 50% of theScore's Sportsbook users have wagered on the iCasino products. In the US, really relying organically mostly with our partners at Barstool and when our partners at Barstool announced to their audience that we're live in a state, you just see such a huge influx on the first day or two, and that's the bulk of what you're going to get in those first few weeks. And so there's obviously a lot of value in being able to convert and being able to make this seamless on the media applications, and we're going to be doing the same thing here in the US and bringing the Barstool Sportsbook offering and fully integrating that into the Score Media app throughout the United States, second half of this year."
}