{
    "symbol": "NXRT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 14:07:19",
    "content": " Results for Q3 are as followers: Net loss for the third quarter was $26 million or a $0.02 per diluted share and total revenue of $68.1 million, as compared with a net loss of $5.4 million or $0.21 loss per diluted share in the same period in 2021, and total revenue of $56.4 million, which is a 21% increase in revenue. For the third quarter, NOI was $39.9 million on 41 properties, compared to $33.6 million for the third quarter of 2021 on 40 properties, a 19% increase in NOI. We reported Q3 core FFO of $21.8 million or $0.85 per diluted share, compared to $0.65 per diluted share in the same quarter 2021, for an increase of 31% on a per share basis. For the quarter, we completed   full and partial interior renovations and leased 592 upgraded units achieving an average monthly rent premium of $163 and a 24.3% ROI, which is   basis points higher than our long-term average ROI in renovation. Inception-to-date in the current portfolio we have completed 7,354 full and partial upgrades or 48% of the total units, 4,853 kitchen upgrades and washer dryer installs and 10,451 technology package installations achieving an average monthly rent premium of $146, $49, and $44 respectively, and an ROI of 22%, 69.3% and 37.3% respectively, each of which helped to drive our NOI year-over-year higher by 19%. We reported year to date core FFO of 62.3 million or $2.43 per diluted share, compared to $1.78 per diluted share at nine months ended September 30, 2021 or an increase of 37%. These are based on average cap rates ranging from 4.3% on the low-end to 4.7% on the high-end, which has increased approximately 44 basis points last quarter and   year-to-date to reflect a rise in interest rates and considerable increases in cap rates in our markets. For our core FFO guidance, we're estimating $3.05 per share in the low-end, $3.11 per share on the high-end with a midpoint of $3.08, which is a $0.07 per share increase of the prior midpoint, a   per share that represents a 27% increase over 2021 core FFO of $2.43 per share. Third quarter same store NOI growth was again special across the board with the portfolio averaging 13.1%, driven by continued acceleration in total revenues, which hit 15% growth for the period, up 80 basis points sequentially over Q2. Turning to 2022 guidance, the strength of rent roles, GPRs, total revenues allowed us to increase same store revenue guidance again for the third time this year to a range of   with a midpoint of 12.9% that's up 90 basis points from 12% in Q2."
}