{
    "symbol": "SUI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 18:53:05",
    "content": " In the second quarter Manufactured Housing and RV same property NOI grew 3.6% over 2021, driven by a 4.8% revenue increase offset by a 7.3% expense increase. We also achieved strong external growth during the second quarter and through the date of this call, we closed on $1.8 billion of assets, consisting of four Manufactured Housing communities, three marinas and 52 holiday parks, including the 40 property Park Holiday's portfolio in the UK. For the second quarter, Sun reported core FFO per diluted share on a constant currency basis of $2.04, which is 13% above the prior year and exceeded the high end of our quarterly guidance range by $0.03. And then Keegan to complement the second part of your question, as far as our expectations for the full year on RV transient revenue growth, we had previously stated a range of 12% at the midpoint, those expectations for the full year now are at about 6.4% with a third quarter growth on the transient side of about 4%. Please proceed with your question. So even with a 10% reduction transient set for the last 18 months, we still grew transient in RV revenue overall in the second quarter and outlook by Fernando said 4% in the third quarter having really great Memorial Day and 4th July holidays, as well as the expectation that we would grow approximately 6% -- I think Fernando said 6.4%. Please proceed with your question. Please proceed with your question. And to the beginning of your question in my long history of 40 plus years in Manufactured Housing and through recessionary periods and certainly through the GFC, we are able to pass through all inflationary expenses in the form of annual rental increases in our current portfolio, CPI or greater in 90% of our Manufactured Housing communities. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}