{
    "symbol": "SUI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 15:47:05",
    "content": " Sun same-property MH and RV NOI growth for the first quarter was 7.7%, a 150 basis point increase over the high end of guidance. Our RV same-property NOI growth of almost 23% compared to the first quarter of 2021 shows the continued demand for outdoor vacationing, which benefited from the Canadian border being open for our Snowbird Residency S. There is a lot of conversation around the potential impact of inflation and rising gas prices. For the first quarter, Sun reported core FFO per share of $1.34 and representing 6.3% growth over the first quarter of 2021 and $0.07 ahead of the top end of our first quarter guidance range. Given our outperformance for the first quarter and outlook for the remainder of the year, we are increasing our full year FFO per share guidance range to $7.20 to $7.32, which represents a 1.5% increase at the midpoint. Please proceed with your question. The outperformance in the first quarter on MH and RV same property was really driven by the RV portfolio with stronger performance from the annual side as we exceeded our expectations of conversions of transient sites to annual leases as well as on transient revenue, both from the performance of – for the quarter based on the comp against the first quarter of 2021, where we had – where we were affected by the Canadian border closure and the California state home orders. Please proceed with your question. We saw that impact in the first quarter and would expect that again in the second quarter expense growth for the second half of the year will normalize as we don’t have that step function increase that went in, in July of 2021. There has been very little change to the general market, to the cap rates as Safe Harbor has been able to increase its size by over 60% in an 18, 20-month period of time, very, very carefully thought through strategic acquisitions to improve the footprint, network, the membership and my expectation would be that with a fragmented business with the current availability of Sun Securities and the networking through the patriotic’s so influential in the industry that reside over at Safe Harbor that we should be able to continue to grow regardless of Suntex pull to continue to grow or to do an IPO or anything like that. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}