{
    "symbol": "AAON",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 22:13:05",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by and welcome to AAONâ\u0080\u0099s Third Quarter 2022 Earnings Conference Call. Joining me on the call today are Gary Fields, our President and CEO; and Rebecca Thompson, our CFO and Treasurer. Shortly, Iâ\u0080\u0099ll be handing the call off to Rebecca, for her to go through the third quarter results. Gary will then provide further insight on the quarter along with commentary on our outlook, and then weâ\u0080\u0099ll open up the call to Q&A. Prior to that though, we begin with our customary forward-looking statement policy. During the call any statement presented dealing with information that is not historical is considered forward-looking and made pursuant to the Safe Harbor provisions of the Securities Litigation Reform Act of 1995, the Securities Act of 1933 and the Securities Exchange Act of 1934, each as amended. As such, it is subject to the occurrence of many events outside of AAONâ\u0080\u0099s control and that could cause AAONâ\u0080\u0099s results to differ materially from those anticipated. Iâ\u0080\u0099d like to begin by discussing the comparative results of the three months ended September 30, 2022 versus September 30, 2021. Net sales increased 75.1%, $242.6 million from $138.6 million. The largest driving factor to the growth was organic volume, which contributed 26.9%. Improved productivity, along with an approximate 18% increase in organic headcount helped drive the increased production. In addition to volume, pricing contributed 24.4% and the acquisition of BasX contributed 23.8%. Similar to the legacy business, BasX perform extremely well in the quarter. BasX realized record sales and EBITDA of any quarter in its history, while increasing its backlog 33.8% from the end of the second quarter of 2022. As a percentage of sales gross profit was 27%, compared to 26% in the third quarter of 2021. The expansion in gross profit margin was driven by higher pricing and improved productivity, partially offset by higher costs and adverse effects of supply chain issues. Selling, general and administrative expenses increased 81.7% to $28.9 million from $15.9 million in the third quarter of 2021. As a percentage of sales, SG&A increased to 11.9% from 11.5% in the third quarter of 2021. Excluding BasX, SG&A expenses increased 41.5% and totaled 10.7% of sales, down 80 basis points from a year ago. Income from operations increased 82.3% to $36.7 million, or 15.1% of sales from $20.1 million or 14.5% of sales in the third quarter of 2021. The Companyâ\u0080\u0099s estimated annual 2022 effective tax rate excluding discrete events, is expected to be approximately 25%. Net income increased to $27.5 million or 11.3% of sales, compared to $15.6 million or 11.2% of sales in the third quarter of 2021. Turning to the balance sheet, youâ\u0080\u0099ll see that we had a working capital balance of $193.9 million versus $131.3 million at December 31, 2021. Unrestricted cash totaled $10.7 million on September 30, 2022, and total debt at the end of the quarter totaled that $76.3 million. Within the quarter, we paid down approximately $30 million on our line of credit, lowering our leverage ratio to 0.65 from 1.06 at the end of the second quarter. The Company had stock repurchases of $8.9 million during the nine months ended September 30, 2020. Shareholdersâ\u0080\u0099 equity per diluted share is $9.72 at September 30, 2022, compared to $8.68 at December 31, 2021. Iâ\u0080\u0099d now like to turn the call over to our CEO and President, Gary Fields. Overall, weâ\u0080\u0099re extremely pleased with third quarter results, record sales, production, EBITDA, earnings and record backlog. The Company is performing very well, particularly compared to where we were just a couple of quarters ago. Gross margin is still not where we want it to be, but we have made substantial progress. First, as Rebecca mentioned, headcount of the legacy company was up 18%. Second, productivity has improved significantly. When we look at our unit sales on a per day per production employee basis, the third quarter was the highest itâ\u0080\u0099s been all year. Lastly, the volume growth is also a reflection of our premier sales channel and the backlog our rep partners have been able to generate for us. Iâ\u0080\u0099d like to thank all of our channel partners, as well as all of our internal sales support. Before diving deeper into the backlog and our sales channel, I want to discuss our pricing and gross margins. As weâ\u0080\u0099ve discussed in the past, dealing with hyper-demand and hyperinflation while at the same time maintaining best practices with our channel partners has been challenging. The margin profile of the current backlog is the best itâ\u0080\u0099s been in over a year, weâ\u0080\u0099re going to continue to see productivity improvements going forward. In addition, improved productivity is also a contributing factor. You can specifically see this at our AAON Coil Products segment, but itâ\u0080\u0099s happening throughout the organization. Itâ\u0080\u0099s not only a result of pricing, productivity improvements have been a driver to gross margin as well. We expect that factor will continue, especially as supply chain issues ease. Organically, backlog was up 109.6% from a year ago and up 4.7% from the end of second quarter. The fact that backlog continues to increase sequentially is a sign that demand remains strong, particularly because our production is also increasing. Sequentially, they were up 36.7%, which is mostly volume driven. While both the legacy business and BasX continue to increase production to record levels, backlog continues to grow. Demand continues to be fairly broad based as far as end markets, lodging and office buildings remain soft. Data centers and semiconductor markets are very strong, education remains solid, healthcare and manufacturing are still good. Warehouse seems to be slowing a bit, but remains still pretty good. While we continue to monitor for the slowdown that it seems everyone is anticipating, we do not see it. And all of the leading indicators that we track such as the ABI, the Dodge Momentum Index, and construction starts are suggesting the next 12 months will continue to be strong. While everyone is happy to see backlog growing, weâ\u0080\u0099d actually like to see backlog start to come down, led by improving lead times, which I think weâ\u0080\u0099re going to start to see in 2023. The team is doing a great job with adding headcount, while improving productivity at the same time, and weâ\u0080\u0099re continuing to invest in capacity. To do this, weâ\u0080\u0099re going to continue to invest in the business. We feel strongly that we have the best product offering at the best value to accommodate the increasing demands related to decarbonization, energy efficiency and indoor air quality. As we continued to deliver at a very competitive lead time, weâ\u0080\u0099re going to set our channel partners up for maximum success enable them to continue to take share. In 2015, prior to my arrival, the company entered this market organically with the thought that it would complement our product portfolio of energy efficient equipment, and that the market had vulnerabilities we could capitalize on. Weâ\u0080\u0099ve determined to terminate a portion of this business, specifically our horizontal and vertically configured indoor units. Furthermore, the upcoming refrigerant regulations would require a capital investment we decided would not be the best use of capital. And as weâ\u0080\u0099ve always done, weâ\u0080\u0099ll continue to monitor the financial performance of our product portfolio. So, itâ\u0080\u0099s only about 1% of sales. We wouldnâ\u0080\u0099t normally address something so immaterial to revenue, but weâ\u0080\u0099ve openly discussed the water-source heat pump business since inception. As such, we felt it would be appropriate to provide some information on what weâ\u0080\u0099re doing. Also, by doing this, itâ\u0080\u0099s going to lend more capacity for high margin, high growth equipment. I also want to touch briefly on our parts business, parts still make up a small percentage of sales at 6.6%. But itâ\u0080\u0099s something weâ\u0080\u0099ve been focusing a lot on both internally and with our channel partners, weâ\u0080\u0099ve been having great success. Compared to 2020, part sales were up 51.7% this past quarter. So, growing this business will continue to be a strong focus of ours. Before finishing up and handing off the call for Q&A, I want to provide some information on our outlook for the rest of the year. Based on the size of the backlog, the improving margin profile of the backlog and the increasing production capacity and productivity, we anticipate we will finish off the year on a high note. And we will continue to realize more price, which should pave the way for continued margin improvement. Long-term, weâ\u0080\u0099re continuing to invest in capacity and growth. In closing, I want to finish by thanking all of our employees, sales channel partners and customers. Even with your recent price increases that pricing delta looks to be maybe in high single digits, in some cases close to parity. Well, weâ\u0080\u0099re watching that carefully. Weâ\u0080\u0099ve always kind of managed to margin, not so much to market. As Iâ\u0080\u0099ve said in past calls, quite a while back, at a 15% premium, thereâ\u0080\u0099s a fair amount of work goes into proving the value. And in the past, it took some pretty strong talents in the sales channel to do that. As that premium comes down to 10%, it becomes much easier to explain and people begin to take notice of it much better. So, Iâ\u0080\u0099d like to make sure that we stay in that range but weâ\u0080\u0099ve also added a lot of marketing tools that help explain that value. You guys have introduced some cold climate air source heat pumps us here, I guess maybe a few questions there. Weâ\u0080\u0099ve already proven their performance, but we keep a unit available to display to people, so they can see the performance characteristics with empirical data, not some model data. And thatâ\u0080\u0099s where e-commerce, warehouses, maybe on a new construction basis have slowed down. Another thing you may recall was, when I came to the company six years ago, we were about 50% new construction and 50% replacement. And I made the statement then that our goal was to raise the replacement percentage, while also growing the new construction application. I donâ\u0080\u0099t have latest figures on that, but itâ\u0080\u0099s somewhere upwards of 60% approaching 65% the last time I saw it on replacement. The next thing -- I got your third part of your question on the capabilities, Iâ\u0080\u0099ll ask you to repeat the second here... So, at this point in time, weâ\u0080\u0099ve opened up a lot of possibilities with zero degree capable, and weâ\u0080\u0099re seeing strong support for that. As we get the new parts and pieces that are required for minus 25, I think itâ\u0080\u0099ll be very, very significant. So the vast majority, according to the research that my team has provided me, the vast majority of air source heat pumps that are out there, which thereâ\u0080\u0099s not that big of a selection in package rooftops. There are great selections in residential unitary, split systems, but in package rooftops, thereâ\u0080\u0099s not a huge selection, but most of them seem to not be viable below, maybe 30 degrees or even 35 degrees Fahrenheit. So, being able to capture that delta, will use the smaller number from 30 degrees down to zero degrees. And like I say, with the research weâ\u0080\u0099ve got products that theyâ\u0080\u0099ve already been in the lab and tested with prototype materials. As those become commercially available, weâ\u0080\u0099re going to be able to capture just a significant more of that -- people that want to decarbonize. Yes, a very -- I donâ\u0080\u0099t have the exact percentage, maybe Rebecca might have that. I know in October, weâ\u0080\u0099re getting a good bit more of the market price increase. At one time, I was told up to 7%, we got about 5% in October. So, it was beginning to come into the quarter, but it would have been the very tail end. And then as you mentioned, starting June 1st, we had 1% per month, and thatâ\u0080\u0099s still in place. We built three prototypes, o that we could learn what was most manufacturable to meet the expectations of the client. So, weâ\u0080\u0099re not anticipating starting full blown production till around January 1st. Because remember, you design and build one of these units once -- you design it once, and then you build it hundreds, if not thousands of times. So, they are very, very custom but you get to put a fairly large number in front of the bill of materials when you go doing it. We saw about 1% of it in August, almost 3% of that in September, and a little over 6% of that in October. Gary, you mentioned potential for backlog to come in here at some point in 2023 as your lead times improve. So, some of the competitions out there has talked about continued stretched lead times in the industry. Well, I want to go back to the beginning. And when I became President, I took over all the sales, engineering, and manufacturing, the back office stuff stayed with Norm. And so, I went about working with sales channel to improve a lot of things that I knew was holding them back from being more successful. Thatâ\u0080\u0099s why â\u0080\u009818 -- â\u0080\u009817, we did pretty good, â\u0080\u009818 and â\u0080\u009819 were very challenging. Third quarter in â\u0080\u009819, we began to show that we had figured out this manufacturing deficiency, had corrected it and we actually had good capacity. And so, weâ\u0080\u0099re very confident that we know what our capacity is. So, we got well ahead of where we were, as youâ\u0080\u0099ve seen the CapEx investments have been substantial in additional capacity. So, we have put a lot of investment into manufacturing capacity. The sales channel proved that way back there in â\u0080\u009817, â\u0080\u009818. And so, weâ\u0080\u0099ve invested an awful lot in those aspects of the business and theyâ\u0080\u0099re all finally coming to fruition. And you began to see it, like I said in fourth quarter of â\u0080\u009819, but then the pandemic hit, and kind of slowed things down for us for a little while. So now, weâ\u0080\u0099re able to -- the supply chain has thawed out a lot. Itâ\u0080\u0099s not totally without strain, but itâ\u0080\u0099s substantially improved. So, all of these things are going to power us to increase production. So, like I say, if we were to reduce the backlog a little, itâ\u0080\u0099s not going to be because of reduced bookings, itâ\u0080\u0099s going to be because of increased production. He had lived through inflationary times in the 70s, and had used that strategy once before and said it was very successful. We needed to kind of get -- we had to make some big moves to get back between the proper range, I call it between the guardrails. Once we felt certain that we were there, then, with inflation running roughly just short of 10%, I felt like 1% per month was very appropriate. I mean, weâ\u0080\u0099re looking at wage rate increases, electronic component increases. So, we feel like that weâ\u0080\u0099ve got it handled really well with the 1% per month. And weâ\u0080\u0099ll probably continue that for a while yet until we see things strengthen and our margins a bit above historic, which very likely could happen in â\u0080\u009823, if weâ\u0080\u0099re able to keep these price increases. And as you can see, with the increased backlog and the bookings the way they are weâ\u0080\u0099ve not slowed down anything. So, weâ\u0080\u0099re very satisfied with what weâ\u0080\u0099re doing on that price increase strategy. On the order number, I was just looking to see if, my thought process is with the monthly price increase, itâ\u0080\u0099s very predictable, as you said, you would see less kind of spikes, ahead of a price increase. Weâ\u0080\u0099re not seeing -- when we had 3%, 5%, 7%, 8% price increases, we saw a huge pull forward. It was in the not quite 200 million, high 100s that pulled forward. And so, with the 1%, weâ\u0080\u0099re not seeing much pull forward at all. Itâ\u0080\u0099s not totally absent, but itâ\u0080\u0099s pretty insignificant. So, thatâ\u0080\u0099s several months that weâ\u0080\u0099ve done that. And each month, our prediction, our projection actually from the sales department telling us whatâ\u0080\u0099s going to happen. And I guess, with that change in pricing strategy, talk about where you are with price cost alignment. If the market is very stable and FPNA a teamâ\u0080\u0099s job is pretty boring, itâ\u0080\u0099s when, itâ\u0080\u0099s so dynamic like itâ\u0080\u0099s been for the last couple of years that their value is just absolutely proven. Whit what theyâ\u0080\u0099re telling me, our margins are going to continue to strengthen. What we see in 4Q looks like, weâ\u0080\u0099ll be well into that 28% to 32% range. And then, we might possibly see something a little stronger than that first quarter if things stay the way they are. And then just last one for me, you just mentioned on that higher margin backlog thatâ\u0080\u0099s flowing through. Well, if you look at absolute run rate and absolute backlog, youâ\u0080\u0099re looking at about six months, itâ\u0080\u0099s in the house. Historically, the company had a bit of a bell curve on bookings, the first quarter and the fourth quarter were always a little slower than second and third quarter, weâ\u0080\u0099ve not yet seen that. And I think a lot of that is the better product that weâ\u0080\u0099re putting together, like the cold climate capable air source heat pumps, the growth and opportunity as a result of acquiring BasX. And with regards to the margin, again, weâ\u0080\u0099ve got that margin where we want it, and itâ\u0080\u0099s going to going to continue to strengthen a bit. One question, youâ\u0080\u0099re moving a lot of products out the out the door. The headcount, we need to measure it, and that somewhere between 15% and 18% headcount is probably the maximum that you can measure in effectively. And as youâ\u0080\u0099ve seen, weâ\u0080\u0099ve measured in 18%, but our productivity has gone up. So, our onboarding procedures, training procedures are much advanced over what they were a few years ago. So, what weâ\u0080\u0099re monitoring now is supply chain. And as parts are available, then weâ\u0080\u0099re able to relay that to HR and say, bring us more people. And so, weâ\u0080\u0099ve kind of been ratcheting back and forth between the two as more parts are coming, that weâ\u0080\u0099re adding people. One of the things that go back four or five years ago, we bought WattMaster Corporation, now called AAON Controls. The next thing was that our fan manufacturer that we were buying 35,000, 40,000 fans a year, we were able back in late April to purchase from them the intellectual property, tooling, all the fixtures, along with instructions. So, weâ\u0080\u0099re starting to build fans in Tulsa here, in another month or so. And ironically, our purchasing department went to bat for them, and got them some of the parts to build our equipment for us, which I thought was fun, and pretty innovative. And so, theyâ\u0080\u0099re getting these big pieces of equipment to us probably three months ahead of what they had told us not so long ago. Obviously, BasX had a good quarter, looks very, very strong. So, I would say heâ\u0080\u0099s got around five decades of experience with semiconductor. It was probably -- I donâ\u0080\u0099t have the number off the top of my head, but I think theyâ\u0080\u0099ve been doing about 30% to 35% of their revenue with semiconductor and clean rooms. The alignment with AAON is allowing some of those -- to see those by huge, huge orders at a time. So now, theyâ\u0080\u0099ve got more infrastructure, the new building they built just prior to us purchasing them helped that. And now, theyâ\u0080\u0099ve got a strong foundation underneath them that will allow us to capitalize on those. What weâ\u0080\u0099re able to do for them in Longview, just in the data center itself doubles their sales."
}