{
    "symbol": "AAON",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 09:49:10",
    "content": " I’ll be handing the call off to Rebecca, for her to go through the first quarter results. Gary will then provide further insight on the quarter along with our current outlook, and then we’ll open up the call to Q&A. As such, it is subject to the occurrence of many events outside of AAON’s control that could cause AAON’s results to differ materially from those anticipated. With that, I’ll turn the call over to Rebecca. I’d like to begin by discussing the comparative results of the three months ended March 31, 2022 versus March 31, 2021. A record backlog at the beginning of the quarter, along with improved production rates drove the robust volume growth. Record production rates in the first quarter reflect an easing of supply chain issues, greater production capacity and strong performance from our operational team. As a percentage of sales, gross profit was 25.2% compared to 28.6% in the first quarter of 2021. Compared to the first quarter of 2021, gross margin was impacted by higher material costs, along with multiple wage increases and supply chain issues that continue to adversely affect operational efficiencies. We are still not where we want to be, but the first quarter was in line with our internal expectations, and we are on track to achieving target margins later this year. As a percentage of sales, SG&A decreased 12.6% from 12.7% in the first quarter of 2021. The company’s estimated annual 2022 effective tax rate, excluding discrete events, is expected to be approximately 24.9%. Looking at the balance sheet, you’ll see that we had a working capital balance of $169.5 million versus $131.3 million at December 31, 2021. Shareholders’ equity per diluted share is $8.90 at March 31, 2022, compared to $8.68 at December 31, 2021. I’d now like to turn the call over to our CEO and President, Gary Fields. First off, I’d like to state that I’m very happy with the first quarter’s performance. Supply chain issues have eased some, but it’s definitely still an issue. We’re also ramping up our headcount, which comes with challenges. We’re still not where we need to be, but we’re on track to returning to target margins later this year. Considering what we’re seeing with material costs, this is a very positive aspect. To give you a sense, our material and freight cost, excluding the effect of organic volumes being up, we’re up approximately 50%. We’re also doing a good job at managing our SG&A expenses, as Rebecca just walked you through. Now the backlog, March 31, it was $461.4 million, that’s up from $260 million at the end of December and $96.7 million at the end of first quarter 2021. Orders in the quarter were up year-over-year 150% organically, which represented an acceleration from the 67% growth we recognized in the fourth quarter and the 55% growth we saw in the year of 2021. In fact, the year-over-year comp in this past quarter was the toughest we’ve seen in two years, and we still recognize significant acceleration in growth. Growth is certainly much greater than what the market is growing out, so we’re definitely taking market share. All the work we’ve done over the last 18 months with inventory management, productivity improvements and increasing our manufacturing capacity, including both plant and equipment and labor is paying off. So, we’ve never been this well aligned with our sales channel in the history of the company, it’s the best it’s ever been. The heavy lifting is behind this, but we’ve got just a little tweaking to do here and there. It’s been very well received, moving along nicely with that. We’re now almost six months since closing on the acquisition, and we are very pleased with how things have progressed thus far. And like us, they’re being challenged a bit with supply chain issues and inflation, but overall, they’re managing well. In general, using first quarter as a benchmark, we foresee sales margins and earnings will improve throughout the year, with the bulk of the improvement occurring in the back half. Well, it’s absolutely broad-based product family wise. So having the production facility that we built in Longview, we just had an immense amount of production capability there that we’re beginning to realize now. And that’s got to be $2 million, $3 million higher than we’d ever run in previous years. So having that production capability, I’ve always said that the Longview product was more sensitive to lead time than the Tulsa product. And we’ve been able to pull that lead time down very attractive, and that’s proven true. We’re getting some very, very large orders for modular data centers. Now, we’re getting orders for a couple of hundred units at a time. So being able to deliver and be reliable with that, that’s a big deal. In Tulsa, we’ve been building out our infrastructure here for the last few years. I’ll just give you an idea on the headcount, Julio. Hi Gary, it’s Brent Thielman, Davidson. I guess I’m trying to get my head, we just haven’t seen this level book of business before. Well, I think the percentage growth we saw Q4 to Q1, that’s not sustainable at that same acceleration rate. And where we’ve been able to manage our lead times on this is in this pandemic era, people have gotten accustomed to ordering things much further out than what they normally would. So I’ll put a couple of weeks pad on it, and I’ll order it 14 weeks ahead. Well, we’ve got projects that are people are ordering they don’t want until Q4. And that’s allowed us to keep our lead times in check, and we’ve actually been able to take advantage of some quick ship kind of project needs. So that’s – hopefully, that answers it, if I need to add something else cleared up for me. And I said, well, that’s a great question. You all know I’m a horsemen, so I’m going to use a Horsemen’s term. Fact, no, I’m not going to rein in the orders, I’m going to lay the spurs to production. Well, that’s what we did and gently though. And that’s material because if you can get people to stay here 90 days to six months, then they tend to stay here for a very, very long time. And so that’s one of our efficiency measures that our production team uses, and they’ve been able to add people and keep that number relatively linear. But to the best of our ability to forecast and things have begun to stabilize, while they’re elevated, they’re stabilized. So now that they’ve begun to stabilize, at least in our viewpoint, they have, then we feel fairly confident in our forecasting and what we’re doing. We’re not going to get to that target level next quarter, but we’re going to get closer to it. I think that the second half of the year, we’re going to be right in the center of that range. And bear in mind, we’re doing everything we can to increase the production rate too. But barring anything different than what’s occurred in the last several months, we’ve learned how to navigate a lot of potholes and this team has just done a phenomenal job of doing that and getting units out the door. So yes, I’m confident we’re on growth, top line growth, bottom line, a good solid number throughout the year. Last one, I guess, just on the SG&A, especially the sales dollars pick up here, do you expect to see a little better leverage over that as we advance through the year, this 12.5-odd percent a good ballpark? But Rebecca and I had a discussion about that earlier, and she’s done some preliminary work on that. Like I said, we’re going to be adding production workers, not overhead workers. And when we add production workers, then that’s where that leverage occurs. I’ll let – I was wondering how we were going to fit this in here, Julio, you just gave me the perfect entree. And so a bit over a year ago, even before we closed on BasX, I went to Acme and said, I’d like to purchase from you all of the tooling, the design documentation, the work documentation, the rights to build these fans. I said, you don’t build them for anyone else, you build them only for us. Well, over the last few years, we’ve been purchasing nearly 40,000 fan wheels a year, 35,000 to 40,000 from them. And of course, you see we’re growing. But the main thing was is the vulnerability of someone else supplying while they’re a great company and we had no reason to doubt that, it was just something that was in our wheelhouse of abilities to add that to the vertical thought process of we manufacture units, we don’t assemble units. There was a comment in the press release, BasX and you’ve learned that revenue synergies are better than initially estimated. And now that they’re part of a larger foundation, then they’re looking at that purchase from BasX as a percentage of the whole enterprise, not as a percentage of BasX. Let’s see here, almost 300% year-over-year."
}