{
    "symbol": "CVI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 16:17:04",
    "content": " Yesterday, we reported our second quarter consolidated net income of $239 million and earnings per share of $1.64. We are pleased to announce, in addition to the second quarter regular dividend of $0.40 per share, the Board has also authorized a special dividend of $2.60 per share, both of which will be paid on August 22 to shareholders of record at the close of the market on August 12. For our Petroleum segment, the combined total throughput for the second quarter of 2022 was approximately 201,000 barrels per day with Wynnewood completing its planned turnaround on time and on budget in early April. Based on 2021 and 2022 RVO levels that were finalized in June, RIN prices averaged approximately $7.58 per barrel in the second quarter, a decrease of 7% from the second quarter of 2021. For the second quarter of 2022, our consolidated net income was $29 million, earnings per share was $1.64, and EBITDA was $401 million. Our second quarter results include a legal accrual of $79 million, a negative mark-to-market impact on our estimated outstanding RIN obligation of $51 million, unrealized derivative losses of $21 million and favorable inventory valuation impacts of $41 million. Excluding the above-mentioned items, adjusted EBITDA for the quarter was $511 million and adjusted earnings per share was $2.45. In the second quarter of 2022, our Petroleum segment's reported refining margin was $26.10 per barrel. Derivative losses in the Petroleum segment totaled $61 million for the second quarter of 2022, which includes unrealized losses of $22 million, primarily associated with crack spread derivatives. In the second quarter of 2021, we had total derivative losses of $2 million, which included unrealized losses of $37 million, primarily associated with the crack spread hedges that were closed at the end of the third quarter of 2021. For the second quarter of 2022, the Fertilizer segment reported operating income of $126 million, net income of $118 million or $11.12 per common unit and EBITDA of $147 million. This compared to second quarter 2021 operating income of $30 million, net income of $7 million or $0.66 per common unit and EBITDA of $51 million. Total consolidated capital spending for the second quarter of 2022 was $41 million, which included $19 million from the Petroleum segment, $9 million from the Fertilizer segment and $12 million on the Renewable Diesel unit. Significant cash uses in the quarter included $115 million for CapEx and turnaround spending, $59 million for income tax, $40 million of dividends, $19 million of interest and $15 million for the non-controlling interest portion of the CVR Partners' first quarter distribution. We expect direct operating expenses to be approximately $60 million to $65 million, excluding inventory and turnaround impacts and total capital spending to be between $22 million and $27 million. For renewables, we estimate third quarter 2022 total throughput to be approximately 4,500 to 6,000 barrels per day and direct operating expenses to be between $2 million and $4 million. In summary, we are proud of our strong results for the second quarter of 2022 and pleased to be returning $3 per share in dividends to our shareholders. With crude oil prices comfortably in the $100 barrel per barrel range, we're starting to see more activity in our backyard as evidenced by our increased crude oil gathering rates in the second quarter. Yes, Paul, the total obligation on our balance sheet as of the end of the quarter was $708 million, and that's for all 2020, 2021 and 2022 open positions."
}