{
    "symbol": "CVI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 19:15:04",
    "content": " Yesterday, we reported third quarter consolidated net income of $80 million and earnings per share of $0.92. For the third quarter of 2022, our consolidated net income was $80 million, earnings per share was $0.92 and EBITDA was $181 million. Our third quarter results include an unfavorable inventory valuation impact of $114 million, a negative mark-to-market on our estimated outstanding rate obligation of $38 million and unrealized derivative gains of $20 million. Excluding the above mentioned items, adjusted EBITDA for the quarter was $313 million and adjusted earnings per share of $1.90. Adjusted EBITDA in the petroleum segment was $306 million for the third quarter, driven by high utilization rates at our refineries and strong product cracks in the Mid-Con. Our third quarter realized margin, adjusted for inventory valuation unrealized derivative gains and RIN mark-to-market impacts was $23.05 per barrel, representing a 52% capture rate on the Group 3 2-1-1 benchmark. RINs expense for the quarter, excluding the mark-to-market impact was $98 million or $5.28 per barrel, which negatively impacted our capture rate for the quarter by approximately 12%. And note, this excludes the approximately $50 million worth of RINs generated by the renewable diesel unit in the third quarter. Adjusted EBITDA in the Fertilizer segment was $10 million for the third quarter with results impacted by lower production volumes and elevated operating expenses as a result of the 2 planned turnarounds completed in the quarter as well as approximately 11 days of downtime at the Coffeyville facility due to outages at the third-party air separation plant. Cash provided by operations for the third quarter of 2022 is $156 million, and free cash flow was $93 million. Looking ahead to the fourth quarter of 2022 for our Petroleum segment, we estimate total throughput to be approximately 200 to 220,000 barrels per day, direct operating expenses to range between $100 million and $110 million and total capital spending to be between $30 million and $35 million. For the Fertilizer segment, we estimate our fourth quarter 2022 ammonia utilization rate to be between 93% and 98%, direct operating expenses to be approximately $60 million to $70 million, excluding inventory impacts, and total capital spending to be between $5 million and $10 million. With the addition of the PTU, we expect to see between $0.50 and $1 per gallon increase in our renewable diesel margins./ Looking at the fourth quarter of 2022, a quarter-to-date metrics are as follows: Group 2-1-1 cracks have averaged $52.50 -- $0.54 per barrel with a Brent TI spread at $5.33 per barrel and the Midland differential at $1.90 over WTI."
}