{
    "symbol": "CVI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 19:30:27",
    "content": " Yesterday, we reported first quarter consolidated net income of $153 million and earnings per share of $0.93. For our Petroleum segment, the combined total throughput for the first quarter of 2022 was approximately 197,000 barrels per day with Wynnewood undergoing its planned turnaround during the month of March. Based on the high end of the proposed 2022 RVO levels, RIN prices averaged approximately $6.11 per barrel in the first quarter, an increase of 13% over the first quarter of 2021. For the first quarter of 2022, our consolidated net income was $153 million, earnings per share was $0.93 and EBITDA was $278 million. Our first quarter results include a negative mark-to-market impact on our estimated outstanding RIN obligation of $19 million, unrealized derivative gains of $6 million and favorable inventory valuation impacts of $136 million. I would like to highlight that within our adjusted EBITDA for the first quarter of 2022, we recognized a $12 million expense related to potential future legal obligations that shows up in the other expense line. In the first quarter of 2022, our Petroleum segment's reported refining margin was $16.75 per barrel. Excluding favorable inventory impacts of $7.51 per barrel, unrealized derivative gains of $0.28 per barrel and the mark-to-market impact of our estimated outstanding RIN obligation of $1.08 per barrel, our refining margin would have been approximately $10.04 per barrel. Our first quarter RINs expense includes a million mark-to-market impact on our estimated accrued RFS obligation, which was mark-to-market at an average RIN price of $1.37 at quarter end compared to $1.34 at the end of 2021. Derivative gains in the Petroleum segment totaled $8 million for the first quarter of '22, which includes unrealized gains of $5 million, primarily associated with crack spread derivatives. In the first quarter of 2021, we had total derivative losses of $32 million which included unrealized losses of $43 million, primarily associated with the crack spread hedges that were closed at the end of the third quarter. For the first quarter of 2022, the Fertilizer segment reported operating income of $104 million, net income of $94 million or $8.78 per common unit and EBITDA of $123 million. This is compared to first quarter 2021 operating losses of $14 million, a net loss of $25 million or $2.37 per common unit and EBITDA of $5 million. Total consolidated capital spending for the first quarter of 2022 was $50 million, which included $19 million from the Petroleum segment, $5 million from the Fertilizer segment and $26 million on the renewable diesel unit. We estimate total consolidated capital spending for 2022 to be approximately $209 million to $239 million, of which approximately $131 million to $146 million is expected to be environmental and maintenance capital. Our consolidated capital spending plan excludes planned turnaround spending, which we estimate will be approximately $80 million to $85 million for the year for the recently completed planned turnaround at Wynnewood and in preparation for the planned turnaround at Coffeyville in 2023. Significant cash uses in the quarter included $41 million for CapEx and turnaround spending, $30 million for interest, $65 million for the remaining redemption of the remaining CVR Partners' 2023 senior notes, $36 million for the noncontrolling interest portion of the CVR Partners' fourth quarter distribution and $12 million for CVR Partners unit repurchases. During the quarter, CVR Partners redeemed the remaining $65 million of 2023 9.25% senior notes outstanding, completing its targeted $95 million debt reduction plan. With the refinancing of the senior notes in June of 2021 and the $95 million debt paydown, the annual debt service costs at CVR Partners will be reduced by approximately $26 million per year, a reduction of over 40%. Direct operating expenses to be approximately $55 million to $60 million, excluding inventory and turnaround impacts and total capital spending to be between $12 million and $17 million. For renewables, we estimate second quarter 2022 total throughput to be approximately 3,500 to 4,500 barrels per day and direct operating expenses to be between $2 million and $4 million. Over the past 4 quarters, CVR Partners has paid down $95 million of high interest debt and bought back $12 million of units and announced the distribution of over $12 per unit. Looking at the second quarter of 2022, quarter-to-date metrics are as follows: Group 3 2-1-1 cracks have averaged $43.25 per barrel, with the Brent TI spread of approximately $14.19 per barrel and a Midland differential of $0.88 per barrel over WTI."
}