{
    "symbol": "IFS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 17:59:07",
    "content": " The main highlights are: on slide three, IFS had a good quarter, reaching an ROE of 17.4%, thanks to the strong recovery in core business at Interbank and despite the negative impacts on the investment portfolio, especially at Inteligo, but also at Interseguro. Earnings grew more than 50% on a quarterly basis, thanks to the strong growth in the quarterly results of the core banking business, as well as to the partial recovery of insurance and wealth management investment portfolios. Double-digit growth in net interest income and fee income, there's a shift in the loan mix and higher rates that are driving NIM up, reaching 4.5% in the first quarter, and we continue to have consistent credit quality metrics with cost of risk at 1.4%. But more importantly, we would like to highlight the yearly recovery in revenues at Interbank, which reaches 16.5% when excluding the extraordinary gains registered in the first half -- in the first quarter last year from the investment portfolio. During this first quarter, net interest income for Interbank grew 15.6%, with a strong contribution from net interest income coming from credit cards and personal loans, which grew 18%. Other income at the bank was down 40% year-over-year, mainly due to the extraordinary gains on the investment portfolio registered during the first quarter last year when we sold a portion of the government bonds we held, anticipating the increase in rates. Interbank Benefit, our 100% digital rewards program platform; Plin, the P2P and QR code payment solution; Dividelo, our buy now pay later solution linked to digital purchases; Interbank.pe for businesses, which allows commercial clients to open business account 100% digitally and fulfill their cash management needs; SOAT Digital, the first 100% insurance product; and finally, ERNI, our mutual funds investment platform. On the consolidating growth phases, we are including: First, Interbank 100% digital accounts for retail and commercial clients, which today constitute the most important part of growth of our client base for both retail and commercial clients; Second, Tunki, our digital wallet; And third, Plin, our P2P and QR code payment solution, which enables interoperability with multiple financial institutions and a bridge between the banked and the unbanked."
}