{
    "symbol": "GTIM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-06 16:59:10",
    "content": " The impact and duration of staffing constraints at our restaurants that the uncertain nature of current restaurant development plans and the ability to implement those plans and integrate new restaurants, delay in development and opening new restaurants because of wealthier local permitting or other reasons, increased competition, cost increase or shortages in raw food production and other matters discussed under the Risk Factors section of Good Times annual reports on Form 10-K. For the fiscal year in September 28, 2021, filed with the SEC and other filings with the SEC. Our hourly labor costs reflect increases in hourly wages, including the impact of the 6.1% increase in the minimum wage to $15.87 in the City in County of Denver, which not only affects the 7 restaurants in that jurisdiction, but all of the Good Times restaurants that operate in the greater metro and 12 of our Bad Daddy's restaurants that also operate in the metro. This has been a strategic decision, and we believe this decision has translated into stronger multiyear sales performance as evidenced by our comp sales or our same-store sales at the Bad Daddy's brand and the same-store As  which are at all-time highs with nearly 20% of our Bad Daddy's restaurants with a full year operating history, exceeding $3 million average unit volumes and two restaurants that are exceeding $4 million average annual unit volumes on an LTM basis. The increase in sales was due to a higher demand for dine-in restaurant occasions, as well as continued strength in delivery and online orders, along with the 508 restaurant operating weeks compared to 481 in last year's quarter due primarily to two new restaurants opening near the end of fiscal 2021. Cost of sales at Bad Daddy's were 31.3% for the quarter, up 330 basis point increase from last year's quarter, which is primarily the result of significantly higher food and packaging costs as seen through inflationary and supply chain pressures. Overall, restaurant-level operating profit, a non-GAAP measure for Bad Daddy's was approximately $3.4 million for the quarter or 13.3% of sales compared to $3.8 million or 18.3% last year. Now on to Good Times - Restaurant sales at the Good Times restaurants were $7.9 million at a decrease of $0.1 million, driven by slightly - driven slightly by the increased preference of customers for dine-in compared to this time last year, as well as increased menu pricing. G&A expenses increased versus the prior year due to increased legal and professional services, increased cost in technology, insurance and travel-related costs and was slightly offset by decreased multiunit management incentive cost and a decrease in administrative related payroll costs, which in the prior quarter included a stock compensation expense associated with a onetime option grant to the company's CEO."
}