{
    "symbol": "GTIM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-11 22:14:14",
    "content": " The impact and duration of staffing constraints at our restaurants, the uncertain nature of current restraints, development plans and the ability to implement those plans and integrate new restaurants, delays in developing and opening new restaurants because of weather, local permitting or other reasons, increased competition, cost increases or shortages in raw food products, supply chain and inflationary factors due to the unknown impacts of the war in Ukraine and other matters discussed under the Risk Factors section of Good Times annual report on Form 10-K for the fiscal year ended September 28, 2021, filed with the SEC and other filings with the SEC. As mentioned last quarter, this has been a strategic decision, and we believe that this has paid off in stronger multiyear sales performance with seasonally adjusted same-store AUVs near all-time highs, and as I mentioned last quarter, over 20% of our restaurants at Bad Daddyâ\u0080\u0099s with a full year of operating history, exceeding $3 million volumes and two restaurants continuing to exceed $4 million annual volumes on a last 12-month basis. The increase in sales was due to higher demand for dine-in restaurant occasions as well as the continued strength in delivering online orders along with an additional 36 restaurant weeks associated with two new restaurants that opened in the third and fourth quarters of 2021 and the purchase of the Greenville, South Carolina, Bad Daddyâ\u0080\u0099s restaurants. Cost of sales at Bad Daddyâ\u0080\u0099s were 32.5% for the quarter, a 280 basis point increase from last yearâ\u0080\u0099s quarter, the result of significantly higher food and packaging costs as seen through inflationary and supply chain pressure. Overall, restaurant-level operating profit, a non-GAAP measure, for Bad Daddyâ\u0080\u0099s was approximately $3.6 million for the quarter or 13.3% of sales compared to $4.3 million or 17.8% last year. Good Times Other operating costs were 11.1% for the quarter, an increase of 260 basis points due primarily to additional delivery service charges, accompanying a higher mix of delivery sales and higher repair and maintenance expenses during the quarter."
}