{
    "symbol": "TRMD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 15:44:05",
    "content": " Now looking into the second quarter of 2022, changing traveling patterns, increase in supply of products and thereby meeting an increased demand, that mean that we've secured spot bookings at $28,348 per day. Since the start of the year, we've also seen a considerable number of LR tankers shifting into dirty trades, underpinned by the strong crude Aframax earnings as a result of Europe's search for alternative crude oil after Russia's invasion of Ukraine as well as subsequent crude strategic petroleum storage releases in the U.S. So far, we have only seen a small fraction of the potential trade recalibration effect with only 200 kilo barrels per day of European oil products import from Russia being replaced by supplies from the United States and the Middle East region, whereas this is from a high base in February 2022. And here, if we look at our commercial performance, we have again outperformed the peer average in almost all quarters during the past 6 years in the largest vessel class MR. And here, in the first quarter of 2022, we achieved rates of $16,462 per day in that segment. As Jacob mentioned, we have seen a recovery in the tanker market in the first quarter of 2022 with rates reaching $16,743 per day and a further increase in the second quarter of 2022 where we fixed 65% of our days at $28,348. So the way we think about it, I say we have -- now you mentioned 81 vessels, let's do that, times $1.5 million if we just take the first Q2 quarter, is $1.8 million following that, but 8x -- sorry, 81 times $1.5 million, then you would end at with $121.5 million, right? Then the added thing is, as we mentioned, that you have this 12-month look-back period, where you can take into consideration vessels you have sold or refinancings you have made we did a refinancing, say, in the quarter that we just end up in  some vessels getting whatever, $10 million, $20 million in cash. So I think that out of the $100 million plus that we have made of total investment, we are probably -- I look at my colleagues here, we're probably half money back, around 65% of that has been recouped by the end of this year is our expectation."
}