{
    "symbol": "INDB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-21 15:54:05",
    "content": " Jumping to slide four of that deck, 2022 third quarter GAAP net income rose to $71.9 million and diluted EPS was $1.57, reflecting 16% and 19% increases, respectively, from the prior quarter results. And what should be our last noteworthy impact from PPP, you can see the PPP balances pay down to $11 million as of September 30th, generating $400,000 of net fees recognized this quarter compared to $1.8 million in the prior quarter, with immaterial amounts left to be recognized going forward. As noted on the right side of the slide, the consumer portfolios again yielded strong growth in balances, as approximately 90% of the quarterâ\u0080\u0099s mortgage activity was retained in the portfolio, while solid home equity demand and increased line utilization led to overall growth in that category. Moving to slide seven, again, echoing what Chris just stressed in his comments, deposit activity reflects the strong balance sheet position as we discussed last quarter, as overall decreases resulted from our ability to allow for the outflow of highly rate sensitive balances and time deposits, while staying focused on core relationships and operating accounts. With core deposits comprising 88% of total deposits as of September 30th, the cost of deposits increased from 5 basis points to 15 basis points in the quarter, representing only a 5% cumulative deposit beta for the current rate cycle so far or slightly over 7% when isolated to interest-bearing deposits only. The activity for the quarter included the positive resolution of a $24 million commercial real estate loan payoff, which resulted in a $1.3 million recovery of previously deferred interest, which was offset by a new to non-performing $24 million C&I loan. Turning to the next slide, total operating expenses of $92.7 million reflects a 2.4% increase from the prior quarter driven primarily by increased salaries and incentive compensation, as well as some larger non-recurring items such as elevated office equipment spend. As we think about our year-to-date results and the relative uncertainty over the general economic environment, we anticipate relatively flat loan and core deposit balances over the fourth quarter, with some modest level of continued reductions in time deposits. Regarding the net interest margin, without predicting the level of additional Fed Reserve rate hikes in Q4, we do anticipate further margin expansion in Q4, driven by the following assumptions; 100% cash balance betas; 20% to 25% loan betas net of our hedges and will also be applicable to the late September rate increase not yet reflected in the Q3 results, offset with a slight increase in the total deposit betas I referenced earlier to a 15% range."
}