{
    "symbol": "INDB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-22 13:56:05",
    "content": " Excluding merger-related charges, operating net income for the first quarter came in at $58.2 million or $1.23 per share. As such, as noted on Slide 4 of that deck, 2022 first quarter GAAP net income was $53.1 million, and diluted EPS was $1.12, reflecting the first full quarter of operations subsequent to the mid-November merger with Meridian Bancorp and its East Boston Savings Bank subsidiary. When excluding pretax onetime merger expenses of $7.1 million and the related tax effect, operating net income and diluted EPS were $58.2 million and $1.23, respectively, for the first quarter. As noted on this slide, key drivers of the quarterly results include 3.3% annualized net loan growth when excluding PPP loans, despite the expected runoff in the recently acquired East Boston Savings Bank commercial real estate portfolio. As noted on the left side, commercial loan origination activity was strong for the quarter, with total closed commitments of $392 million, and we remain optimistic for continued strong closing activity with a March 31 approved commercial pipeline of $307 million, up from the prior quarter level of $242 million. Also noted on this slide, you can see the PPP balances paid down to $100 million as of March 31, generating $3.4 million of net fees recognized this quarter compared to $7.5 million in the prior quarter, with remaining unearned net fees totaling $2.4 million. Core deposits as of March 31 now make up 85.8% of total deposits and allowed for the cost of deposits to remain at a low 5 basis points for the quarter, which also serves as a reminder that we certainly believe this strong deposit base will prove its value in the likely future rising rate environment, which I'll provide a little more color on shortly. And as you can see here, the reported net interest income and margin increased over the prior quarter reflects the full quarter benefit of the East Boston acquisition, offset by $4.1 million and $1.1 million reductions in net PPP fees and purchase accounting, respectively, versus the prior quarter. As noted on the slide, any movement in short-term interest rates, primarily Fed funds, 1-month LIBOR, term SOFR or prime, we would see immediate repricing benefit in our Federal Reserve cash balances of $1.7 billion and approximately 33% of our loan book that is tied to these indices. And lastly, total loan deferrals at March 31 of approximately $305 million or 2.2% of the total portfolio, reflecting a $78 million decrease from the prior quarter. As mentioned earlier, with only 17% of the closing activity driven to the secondary market, mortgage banking income decreased to $1.4 million, which is inclusive of a positive $257,000 mortgage servicing asset increase. So I think the best way I can frame it up for you, Mark, is any 25 basis point increase would result in about $800,000 to $1 million of net interest income benefit on a monthly basis. But if you do the math on assuming a 25 basis point hike at each of the Fed meetings, that 7 hike scenario, we peg would add about $25 million to net interest margin for the year as you get later in that hike cycle, we'd expect some level of the benefit to go back on deposit pricing."
}