{
    "symbol": "COTY",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-08 11:27:06",
    "content": " In addition, except where noted, the discussion of Coty's financial results and Coty's expectations reflect certain adjustments as specified in the non-GAAP financial measures section of the company's release. We continue to see the fiscal 2023 growth trajectory developing inline with our medium term targets, with the core business adjusting for the impact of the Russia exit, growing sales 6% to 8% like-for-like, and an overall adjusted EBITDA of approximately $955 million to $965 million based on current FOREX rates. Prestige revenues grew 7% like-for-like, well below the sell-out, as this sell-in growth was impacted by: one, 300 basis points of headwinds from the Russia exit; two, industry-wide shortages in certain fragrance components, which Laurent will discuss in more details; and three, difficult comparisons in the prior year, where our Prestige business reported 34% like-for-like growth on the back of strong launch pipefill. While revenue growth in our cosmetics and mass fragrances businesses was broadly inline to ahead of sell-out, the Consumer Beauty sales performance was boosted by a strong launch pipeline and brand initiatives in our body care business, including adidas' Skin & Mind premium and sustainable new body care range, Monange's silicone-free deodorant, and Bozzano's clinical range in Brazil. Finally, while our skincare build strategy is anchored on our prestige brands, Iâ\u0080\u0099m pleased to share that our pure-play mass skin and bodycare brands are also seeing strong momentum both Paixao and Monange gained 260 basis points of share in the very competitive Brazilian lotions and oils market, growing their household penetration by 2.2 million households. As a result, and assuming no significant macro deterioration, we continue to target fiscal 2023 adjusted EBITDA of $955 million to $965 million based on current Forex rates, relatively inline with our medium term growth target of plus 9% to 11%, adjusting for the impact of the Russia exit. In addition, except where noted, the discussion of Coty's financial results and Coty's expectations reflect certain adjustments as specified in the non-GAAP financial measures section of the company's release."
}