{
    "symbol": "COTY",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-08 14:05:05",
    "content": " At this time, I would like to welcome everyone to Coty's Second Quarter Fiscal 2023 Question-and-Answer Conference Call. On today's call are Sue Nabi, Chief Executive Officer; and Laurent Mercier, Chief Financial Officer. Please refer to Coty's earnings release and the reports filed with the SEC, where the company lists factors that could cause actual results to differ materially from these forward-looking statements. In addition, except where noted, the discussion of Coty's financial results and Coty's expectations reflect certain adjustments as specified in non-GAAP financial measures section of the company's release. When it comes to the first part of the question, which is around the fragrance shortages specifically focused on the glass components, again, this is indeed the parts of the components that has been the most affected, and this is, I would say, an industry-wide issue and not just at Coty, of course. Hence, the communication around the sequential acceleration of our sales entering in Jan. And this is clearly something that's a very, very good news, coupled, as you can imagine, with the robust beauty demand, specifically on the fragrance side. So, I would say these two elements altogether give us a lot of confidence that we'll have these shortages slowly, but surely, fixed into the industry widely and at Coty, of course. If you look at the way our innovations have been performing on the markets, the results have been, I have to say, outstanding, be it on the Burberry. I can start with this brand, because what's happened, for example, in a market like the U.S. behind Burberry is unprecedented. And then, we continued this year, I mean, in September of calendar 2022 with the Burberry Eau de Parfum. And the Eau de Parfum, for the first time, surpassed Eau de Toilette sales, which, by the way, says a lot about the premiumization of this market. Traditionally, any innovation that's a line extension moving from Eau de Toilette to Eau de Parfum is performing 20% to 30% versus Eau de Toilette. In this case, it's bigger, which is really big, big sign. Burberry Her in the U.S. is climbing the rankings incredibly, which allowed the brand to become a top 10 fragrance brand in the very competitive U.S. market, which is a jump of 9 ranks. If you think about what we've seen behind Hugo Boss in the rest of the world, because the brand is not as big as it is in the rest of the world in the U.S., so if you think about Europe, the rest of the world, Hugo Boss success behind fashion and now translating into the fragrance business allow us to have a top two fragrance launch with Boss Bottled Parfum. If you think about Gucci again with Flora Gorgeous Jasmine, that's the continuity of last year's Gorgeous Gardenia. Again, it's a top two to top five innovation. So, in a way, the shortages didn't prevent us from pursing biggest innovations during calendar '22, our key launches. Last but not the least, Chloe, specifically the line Atelier des Fleurs, Atelier des Fleurs is really booming in all the premiumized markets. Last but not least, again, going to China, we read, again, like all of you the headlines of Jan. being better than expected for the economy in general in this country. We've also seen some pictures that we posted during earnings call today where we see consumers back to stores, which is really a fantastic news for the beauty industry and for our businesses, as you can imagine, having the most important white spaces of the whole industry in terms of companies in this country. It's not, I would say, a strengthening/acceleration of two things we have seen since, I would say, the post lockdowns of last year and including some recent studies, because we continue to study the consumers' mindset in the country almost on a monthly basis. And we see the premiumization trend accelerating and becoming more radical, if I may say, and building into all categories on one side. And we see on the other side, the healthification trend stronger than ever, which is great for both our business as premiumizing and becoming more and more skincare in the country. And last but not least, something very important we are seeing in the country too is that the shift from, I would say, heritage brands towards new brands active in the Chinese market is stronger than ever. The highest end consumers are now more open than ever to try new brands, new innovation, versus the traditional, I would say, loyalty that we have seen in the past towards more classical and traditional brands. Yes, that's a very good question, Ashley. So, in a way what I can tell you is that, again, concerning what I just commented on in terms of categories, premiumization, healthification, moving towards new brands, new offering a kind of speed in terms of transformation of how the Chinese market is looking more and more in terms of brands, I can tell you that there is rebalancing probably that will allow all categories to grow. But fragrances on one side and makeup on the other side -- of course, as you mentioned, because there is more socialization, people are getting outside their homes, going back to stores, traveling to Hainan. So, we start to see this, which is really a great, I would say, information for us as Coty as a company, because it would mean that we will be able to really run on our three legs in China, of course, fragrance, makeup and skincare with the upcoming launch of Lancaster Ligne Princiere in March. So, you called out CoverGirl and Rimmel has seen a little bit of a benefit from consumers trading down from the Prestige. Sydney, it's not a trade down from Prestige at all. It's been accelerating recently, of course, as you can imagine, because we have more and more consumers, specifically the Gen Zs shopping on TikTok and all these kind of social media artists making their opinions there before shopping online. And this, I would say, consumers in a way what they are looking for is high-quality at an affordable price, which is the reason why we are really working all our brands to become cool, efficient, clean because this is what people are looking for, still at an affordable price versus what is happening in the rest of the industry. When it comes to Prestige, we don't see any sign of slowdown on the fragrance business as you can imagine. People are also shopping a brand name and this is, in a way, makes the fragrance category probably the most immune when it comes to any kind of trade down or dupe phenomenon. And of course, on makeup and on skincare, I would say the growth of these businesses is big enough to allow anyone to continue to thrive. Just curious with the momentum you saw in Prestige fragrance in fiscal Q2, we're seeing a nice acceleration in volumes in the Nielsen data since the quarter ended. Again, the momentum -- sorry, in Prestige in fragrances in Q2, again, it's, in a way, explainable first by the very healthy beauty demand for this category. What we'd love to call \"the fragrance index\" is at full effect again, whatever the region again, and this despite, again, we have shortages that all the industry had been facing. The innovation that we've been putting in the market, again, I was quoting Burberry or Hugo Boss are clearly having a role in this momentum that we are seeing in the company, the premiumization of the market. Again, I'd love to give again and again the example of Burberry Eau de Parfum that's selling higher than Burberry Eau de Toilette, which is the first in the history of line extensions, if I may say, which says a lot about the upgrading and not the down trading of this market. So, this is, I would say, for me, a kind of explanation of what's happening. And this is, again, as you can imagine, during the quarter, without having any upside coming from the Chinese market where the penetration is very low and is expected to grow in the coming quarters and years as you can imagine. When it comes to the momentum that we started to see in Jan., if I may say, this I would really link it to three elements. The first one is, of course, improving of service levels and we are improving with this element quite fast and we will continue to improve on this element in the coming quarters. And of course, the continued strong beauty demand, which is driving this sequential growth acceleration that we have seen. There is also a phenomenon of big innovations that are  (ph), at the moment we are speaking about CoverGirl in the U.S. market. And last but not least, and I guess this will be a question at a moment on another, the latest improvement that's a very strong improvement in CoverGirl sell-out in the U.S. markets with the latest four weeks that show a 17% growth of the sales, which is the best performance since a year behind this brand. So, if you put all these together with a little bit of restocking from our retailers -- remember, our sales in Q2 were in line with the sell-outs, meaning that we start the year with very lean inventories, and therefore, there is a bit of restocking. So, this, I would say, is the bundle of element that explains the start of the year that's accelerating sequentially. A little bit of, I think, a follow-up on some of the other questions and that is just -- look, to start off, clearly significant demand for fragrances, supply chain issues. Now, as we are improving service level, combined with great demand and great initiatives, in fact, we are seeing really some rebuilding of the inventory and restocking in Q3. Again, so that's not -- I will not call it material, again. Again, it was  we made sure that we protected our clean innovation and we made sure that we're protecting  (ph). So, that's really -- so that we are protecting the building blocks of the business, and to be consistent in the strategy. And number two, you mentioned a couple of times this morning just the notion that this year's launch pipeline, specifically in Prestige fragrances, was primarily composed the brand extensions. As I explained several times, we did -- we have a dedicated pricing of this, which started to work, in fact,  (ph) years ago. So, we did work in a very granular manner in this  (ph) is to really making sure we combined also with media support, also the strategic initiatives. And this was absolutely needed, as you said, because it was really the way to mitigate inflation in the gross margin and this is definitely a key driver of our gross margin expansion in Q1 and Q2. So, this quarter, again, this is what we announced  again, because same approach with granular work, and again, making sure that we are also completely consistent with the consumer needs. So, it's really because we are seeing  (ph) appetite for premiumization and this is what we are doing in both Prestige and Consumer Beauty. So, perfectly on track,  (ph), we are granular, and again always focusing that we are matching consumer needs and expectations. So, on the second part the question, which is around the launch pipeline that was mainly brand extension, thank you, first of all, for reminding everyone about this. The performance of our Prestige business is indeed in comparative with the big, big launches we have made last year. It was Burberry Hero, it was Gucci Flora, and of course Calvin Klein's CK Defy. But again, for the first time, line extensions that are towards more premium offerings, Eau de Parfum Burberry is 30% above Eau de Toilette has made, in a way, this second year, a year of continuing growth. But you're right, the question is how about fiscal '24 and, hopefully, we'll be back to blockbusters. So, China will become indeed an acceleration for growth in fiscal '24. I mean, it's been growing really well the past couple of years, and then the fragrance segment for Coty has been growing even better. So, again, when it comes to the fragrance market/the fragrance index, indeed, the fragrance market is 25% -- 20% to 30% higher than the levels of 2019. And in markets like the U.S., again, and you may know this, the Prestige fragrance market is over 60% higher than compared to pre-COVID levels. Again, it's hard to see how this would just be driven to some one-time factors, I have to say. But what we are now seeing, consumers using fragrance as part of their daily routine. I mean, this business has become really a health business, mental health business, I would say. In particular, during the last couple of years, we have seen increased usage by new categories where the penetration has increased structurally, I'm thinking about Gen Z, I'm thinking about men and I'm thinking about Hispanic consumers, if you, of course, focus on the American market. We are also seeing, at the same time, the rise of fragrance influencers in social media, specifically Tiktok, but also on YouTube, which is also helping to drive sustainable growth for this category. They are providing authentic ways for consumers to engage with the product virtually instead of purchasing, which is really new. It's a new kind of sampling, if I may say, virtual sampling. So, this give you, I would say, a zoom out of what is coming soon with this fragrance category globally. Again, just to refer to our  (ph) last week in Amsterdam, we had people from all around the world, spending a week for the first time since many, many, many, I would say, months and quarters altogether, including the Chinese general managers, the APAC general managers, everyone was in the same room, in the same place, spending five days discovering all the new innovation for fiscal '24 and above. And I can tell you that the level of confidence I have seen on the faces, specifically the Chinese general managers and teams and marketing director was a very, very strong sign of how they see Coty in this market where the opportunities are almost endless for a company like ours. And again, in a way, if I may say, I love to give this image of sometimes, destiny needs to help you, in a way. We had two years and a half to strengthen, to prepare, to strengthen our fragrance business, to strengthen our makeup business, specifically on the Prestige side, to put ideas, intelligence and marketing behind the brand like adidas or Max Factor that are two big brands in the Chinese market, and last but not least, to fully prepare for our first skincare launch in China, which is happening in next month as we are speaking. It's absolutely not the same Coty, but we're starting doing beauty business in China in March than the one that was doing business just two years ago. And even at Russia, it's probably coming in below expectations, and of course, understanding all of the supply chain issues. Again, I'll reframe the story around our Q2 saying that this performance, given the shortages, given the boom of the demand, given the pipe of innovation last year, which were unprecedented in the history of Coty's, a very, very strong performance, I have to say. And I really see skincare, specifically on the Chinese market, as an additional layer and not something that's supposed to compensate anything else. Skincare is really for us an additional, I would say, a growth driver and a new journey for the company that's very, very important, as you can imagine, if we want to become a beauty giant in Asia. So, really continuous performance on our fragrance business, strong performance on our Prestige business, specifically in the U.S. without China, as you can imagine, that was under lockdown during the full quarter. And last but not least, the extension with the high premium offer behind our radar that's happening in the coming quarters. So, just a follow-up on Andrea's question just around individual category growth. I think if I heard you correctly in the prepared remarks, you said that growth was more balanced across your categories between fragrance and body care and makeup. So, I mean, what you're highlighting, in fact, is definitely a strength for Coty's  (ph) that we have a balanced portfolio, and indeed, that we are in both divisions. Just on Prestige, I do want to emphasize, again, that, of course, we have fragrance, but now we are seeing Prestige makeup and skincare, which are accelerating and will be strong growth drivers. On Consumer Beauty, so it's definitely also the same thing. So, Consumer Beauty, now we are seeing, I mean, strong acceleration in body care definitely. So, it's really  so, it's really in high mix in terms of high value for the consumers. So, it's coming on top of color cosmetic and mass fragrance. I want to highlight also that we have also very strong performance in Brazil, okay, where body care is -- we have done a strong brand. So -- and definitely -- to conclude on skincare, so this is definitely what we'll accelerate in H2 and beyond, of course, in fiscal '24 and fiscal '25. So, very clearly, we started to focus on fixed cost, then on cost of goods, now we are really addressing all the  (ph) we are investing, and we are building methodology  of course, combined with marketing teams, digital teams and commercial teams, right now, we are getting fully equipped to measure and to optimize ROI. And basically, the way you spend money in skincare is different versus the way you spend money in fragrance. So, these are really nice capabilities that we have built, and consumers want to say that  over the last two years, and this time to build these capabilities. So, ROI is the key word, definitely making sure that each dollar we are spending on either on innovations or base business, every time we're deciding based on ROI and is reviewed by Sue and by myself, and, of course, with the team in recurring session. One, just first on the Consumer Beauty. And then, maybe sort of related to that, curious about your views on the length of the current beauty cycle, which has, obviously, been a couple of years now coming out of the kind of the peak of the pandemic, mask warning, et cetera. So, again, when it comes to Consumer Beauty, you're right to point out on the fact that Consumer Beauty is entering the new cycle, in fact. The first cycle that started somewhere around Jan '21 was really to reinvent the brand equity, sometimes coming back to historical brand equities, strengthening this, modernizing this, creating great advertising with the highest ROI, as just mentioned by Laurent. And this was really what explains the back to market share gains, which happened now for the full year. Stage 2, in a way, I love to say that Stage 1 was fixing the surface, if I may say, and then Stage 2 is really getting deeper, and we start to see real, I would say, disruptive best-in-class in terms of efficacy in the market innovation. So, you can imagine that Consumer Beauty businesses, specifically behind makeup, are going to continue to put on the market, big innovation supported by excellent advertising, having the best ROIs in the company. We started in West -- Eastern Europe, sorry, with a very, very strong results, specifically on the high-end shower gels. And as you can imagine, this has a big potential also this brand in China, where the brand is cooler than ever, and it's already the Number One shower gel brand for Chinese men in this country. So, you can imagine us building this brand into a well-being -- high-end well-being brand in Europe, in China and hopefully, in the rest of the world, as you can imagine. Now to answer the second part of your question about the beauty cycle, again, I'm a strong believer that the main thing that has changed since a few years now is what I call the healthification of the beauty industry. And there, the limit is only us in terms of ability to innovate, to tell new stories, to bring new brands and new technologies to continue to make the consumer interested in our category, because this is a need to meet and not something that is nice to have. So, basically, the model we are using for Prestige and Consumer Beauty, so this is mostly organic growth, also definitely either Prestige and Consumer Beauty. But definitely, if I take the case of Consumer Beauty, now step by step, we are seeing that we are getting shelf space. So, definitely, that success of innovation, acceleration of rotation by all these elements step-by-step, we are regaining traction first with consumers and retailers and this giving us absolutely all the ammunition now to gain shelf space. And that's -- again, we're thinking about the right productivity progress with absolute KPI. Once we optimize productivity progress, then, of course, we are working on new doors, but with very selective criteria that we're entering new doors only and if only we have guarantees that productivity is really at target level. If you allow me a few closing remarks, the first one is about the category, beauty is and will continue to be the darling category of consumers around the world for all the regions we have mentioned during this earnings call. Please see Coty in its reinvention Stage 2 phase, entering into real innovation, fantastic ROI behind advertising, new white spaces in terms of regions, categories, including skincare and, of course, targeting leverage by about 3x at the end of this calendar. Last but not least, I would say that even Coty is not in its maturity stage. And the last remark is that it's very important that the long-term vision and view is really the one that is at play at Coty, and we are building this company for the coming, I would say, decades to become a true beauty power house."
}