{
    "symbol": "CLX",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-02 19:57:05",
    "content": " Kevin, I would just be curious if you could comment on how we should be really thinking about gross margin progression for the next 18 months or so in the context of what we are seeing today, given the 40% exit rate, just assume that you could have substantial margin expansion on top of the 37% that you are guiding to for this, if we should expect sequential improvement from the 40% into the first half of next year. And so the outlook, I think, really reflects a good start to the year, but it would project acceleration in the back half of the year in terms of organic sales growth, really driven by, again, good strength in the business plus the ongoing impact of the pricing actions we're taking. What we are seeing, and I think we'll highlight it and public some discussion around what's going on with pricing on the consumer, we are seeing consumers continue to drive value-seeking behaviors given what they're facing. Can we start thinking about manufacturing and logistics normalization and maybe even it turns to a tailwind for your gross margins at some point in the back half of next year and certainly as we get into fiscal '24, it does seem like some easing in this line item could be an unlock something which you don't necessarily have to roll over, but we're looking at freight rates rolling over. I'd like to believe over time as we get to a normalized environment, as you described, we get back to more of our consistent model where we're really driving cost savings, and that's allowing us to offset inflation and build margin over time, but we're not in that environment right now. So we're really pleased with the performance of Glad through multiple rounds of pricing we're seeing strong performance in the market, and that's really behind our innovation program that we've spent a lot of time talking about, whether it be the addition of colors and sense, our focus on value there. Some consumers are choosing to buy opening price points because perhaps that day, their wallet, they have a limited amount of money they can spend in the category or they're looking for the very, very best value on a price per use basis and so they're trading up to larger sizes, or maybe they're trading within our cleaning portfolio between a dilutable and a spray cleaner, in order to get the value equation right for them. You're still seeing cost inflation, but you noted in your prepared remarks that cost inflation has moderated slightly on a sequential basis, even though it's still higher year-over- year."
}