{
    "symbol": "EDU",
    "quarter": 1,
    "year": 2023,
    "date": "2022-10-26 14:00:27",
    "content": " Breaking it down, the overseas test prep business recorded a revenue increase of 2% in dollar terms year-over-year for the first quarter 2023 fiscal year. Net income attributable to New Oriental for the quarter were US$66 million, representing a 9% increase year-over-year. Non-GAAP net income attributable to New Oriental for the quarter was US$83.7 million, representing a 24.7% decrease year-over-year. New Oriental's deferred revenue balance which is primarily cash collected from registered students for courses and recognized proportionally as revenue as the instruction are delivered at the end of the first quarter of fiscal year 2023, was US$1,012.5 million, a decrease of 30.3% as compared to US$1,453.3 million at the end of the first quarter of fiscal year 2022. For our new businesses as we observed in this quarter, the encouraging performance that these businesses have achieved proof that we are heading towards the right direction and we're confident that business will be able to contribute meaningful revenue to the company this fiscal year 2023. However, due to the seasonality of some of our business, such as test prep courses and overseas study consulting services, New Oriental generally recorded lower revenue in the second quarter of the fiscal year with the revenue typically below those of the first quarter. Hence, we expect total net revenue in the second quarter of the fiscal year 2023, September 1, 2022 to November 30, 2022 to be in the range of $601.4 million to $619.2 million, representing a year-over-year decline in the range of 9% to 6%. But actually now, this year is the beginning of these new initiatives, so we should start to see each quarter start to contribute more and more revenue, overall revenue from these new businesses. As for the revenue contribution for the whole year -- for the new year, the -- I mean there will be revenue contribution, I think the overseas-related business will contribute 30% of the total revenue. And we believe that this revenue -- this business should be -- generate recurring revenue because students, if they think the machine is helpful and they can use it to do the efficient self-study, then they can resubscribe, continue to subscribe new content from the platform. And we have a new business roughly about 16% and all the adult university students business, tutoring and new business together contributing roughly like 55%, 55%, 57% of total revenue."
}