{
    "symbol": "SDC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 12:50:24",
    "content": " When combined with CarePlus, SMP will have the potential to deliver approximately $125 million in incremental revenue and $80 million in adjusted EBITDA to our core business guidance for '23, which can be viewed in our investor deck, beginning on Slide 31. Much like we saw in Q2 and Q3 results despite a $40 million year-over-year decline in revenue from the fourth quarter of 2021 compared to the current quarter, we improved adjusted EBITDA by $14 million and improved free cash flow by $16 million. For the full year, despite a $167 million reduction in year-over-year revenue, adjusted EBITDA only decreased $1 million and free cash flow improved $38 million. Other revenue adjustments, which includes net revenue related to retainers, whitening and other ancillary products came in at $16 million or 19% of total fourth quarter revenue. Marketing and selling expenses came in at $64 million or 74% of net revenue in the quarter, compared to 79% of net revenue in the fourth quarter of 2021 and 55% in the third quarter of 2022. All of the above produced adjusted EBITDA of negative $47 million in the fourth quarter, which is a $14 million improvement over the fourth quarter of 2021 despite a $40 million decrease in revenue. For our full year 2023 guidance, which represents our core business only, we expect to deliver revenue between $400 million and $450 million with macro factors being the key differentiator between the low end and high end of guidance. Gross margin between 72% and 75%; adjusted EBITDA between negative $35 million and negative $5 million, driven largely by top line revenue results with positive adjusted EBITDA achieved by the third quarter. Collectively, our growth initiatives have the potential to deliver approximately $125 million in incremental revenue and $80 million in adjusted EBITDA to our core business guidance. Yes, I can take that. Yes, I can take that."
}