{
    "symbol": "SDC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 11:40:04",
    "content": " Revenue for the third quarter was $107 million, which is a decrease of 15% sequentially and 23% on a year-over-year basis. Much like we saw in our Q2 results, despite a $31 million year-over-year decline in revenue from the third quarter of 2021, we improved EBITDA by $24 million and improved free cash flow by $29 million. Financing revenue which is interest associated with our SmilePay program came in at approximately $8 million, which is a decrease of $1 million from Q2 and down approximately $3 million year-over-year due to the lower accounts receivable balance. Other revenue and adjustments, which includes net revenue related to retainers, whitening and other ancillary products came in at $18 million, or 17% of total third quarter revenue. While the partner network team has been focused on optimizing productivity and preparing for our CarePlus solution launch with existing practices, we're also seeing positive momentum from interested providers due to the seasoning of our existing sales team and interest from our announcement in the second quarter of our upcoming CarePlus offering. Additionally, one-time costs related to lease abandonment, impairment and other store and restructuring costs was $3.4 million, consisting primarily of costs related to our January restructuring actions including costs associated with severance and retention as well as store and facility closure costs related to our international operations. All the above produced adjusted EBITDA of negative $30 million in the third quarter, which is a $24 million improvement over the third quarter of 2021 despite a $31 million decrease in revenue. We ended the third quarter with $120 million in cash and cash equivalents, $202 million in net accounts receivable and $56 million drawn on our new $255 million debt facility with HPS. Free cash flow for the third quarter defined as cash from operations less cash from investing was negative $35 million, which is $1 million improvement over the second quarter of 2022 and a $29 million improvement over the third quarter of 2021. For full year 2022, we now expect to deliver revenue between $470 million and $500 million, gross margin between 70.5% and 71.5,; adjusted EBITDA between negative $155 million and negative $135 million, CapEx between $55 million to $60 million and our one-time costs from our reorganization action in January remains the same between $20 million and $25 million. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. And we've said before on a 25 basis conversion improvement, you're looking at $200 million and 80% plus margins on the aligner product most of that flows all the way through. Please proceed with your questions."
}