{
    "symbol": "SDC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 14:20:03",
    "content": " I'm pleased to report that our cost cutting initiatives from Q1 had paid off during the last quarter and we were able to improve both adjusted EBITDA and free cash flow by $11 million and $41 million, respectively despite consumer spending decreases resulting in our top line being down quarter-over-quarter by $26 million. This is why we're currently in the process of finalizing development of our mobile 3D scanning application or what we call our SmileMaker platform, which is our proprietary patent pending phone-based scanning app that allows customers to see their draft custom treatment plan of how their teeth will move and how long it will take and then purchase within minutes of downloading our free app. Again, with no change in web traffic or marketing spend, a 25 basis point increase in our site conversion would generate more than $200 million in additional line of revenue and up to $160 million in additional adjusted EBITDA on an annualized basis. For full-year 2022, we now expect to deliver revenue between $450 million and $500 million, gross margin between 69.5% to 71.5% based on reduced operating leverage due to lower top line, adjusted EBITDA between negative $180 million and negative $140 million driven mainly by top line results. we typically don't give the breakout between G&A and marketing from an overall expense standpoint, but rest assured that we're looking at all of those as potential levers depending on how sales come in over the back half of the year as to where we pull those triggers to reduce cost and save EBITDA which has been the trend we've seen coming into Q2. And hopefully, both work the way that we think they'll work based on the research that we've done and the conversion funnel improvements that we think we're going to get, which will really help with the macro because SDC+ is going after that higher income consumer, which is doing better than our $60,000 consumer in this environment. What they're going to learn with the same marketing spend is that you can interact with the brand today, use this cool technology, this phone scanning device, and then see what your new smile is going to look like, play with it, it's got six different views, spins around in 360 degree fashion. Versus today, it's all about convenience, price and come to SmileDirectClub and get started for free versus we will now start to showcase the scanning technology in our advertising, show them what they'll get in a full blown treatment plan and how long it'll take to get your new smile, which could have your marketing dollars stretch further and get more people, let's say, with the same spend."
}