{
    "symbol": "CBAT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 10:54:12",
    "content": " Our revenues reached $56.4 million in the second quarter and $136.5 million in the first half, which have respectively increased by 8.57 times and 7.92 times from the same period last year. Specifically, revenues from battery business were about $25.7 million, up by over 3 times, if compared to the same period in the last year. In the second quarter, our net revenue stood by 857% to $56.4 million from the same period of 2021, primarily due to growing sales in our battery products and battery materials. In the first half of 2022, net revenues still demonstrated a great growth momentum, which increased by 792% to $136.5 million from the first half of 2021. Cost of revenues was $50.8 million in the second quarter and $125.7 million in the first half, up by 961% and by 916% respectively from the same period than periods in the prior year. Gross profit was $5.5 million in the second quarter and $10.9 million in the first half, representing an increase of 404% and 270%, respectively from the prior year. Gross margin was 9.5% in the second quarter and 8% in the first half, compared with 18.6% and 19%, respectively in the same period of 2021 as raw material cost rose. Our operating expenses rose by 41% to  $4 million in the second quarter and by 105% to $12 million in the first half, primarily due to growth in headcount. Within that, our research and development expenses increased by 120% to $2.3 million in the second quarter and by 267% to $5.6 million in the first half. Even with this includes our operating expenses were held only 9.6% are relative to our revenues in the second quarter and 8.8% in the first half, compared with 64.9% and 37.2% in the same period of 2021. Our change in fair value of wallet was $2.1 million in the second quarter and $3.8 million in the first half, compared to $5.8 million and $34.2 million in the prior year. Thus, net income attributed to shareholders of CBAK Energy was $0.8 million during the second quarter and $1.3 million in the first half, compared to $2.7 million and $32.3 million in the same period of 2021."
}