{
    "symbol": "CVLG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 13:50:03",
    "content": " I'm not saying it'll go to $0.15 per mile in the third quarter, but I think you'll see it somewhere between where it landed last year, and in the $0.20 per mile cost for Q3 or Q2. Also see an ops and maintenance costs continue to be cost headwinds that have haunted us for the majority of this year, but as we get that new equipment in and we're working on to get as much as we can as possible, you'll start to see the average age of equipment decline a bit, which should help that front and back half of the year, beginning of next year perspective. On the managed freight side of the business, that's, as we've said before, that's where our exposure the spot market is, and we are seeing things soften up so and I think you'll see dedicated margins improve, expedited margins hold to maybe get a little worse. So I guess, Paul, if I wanted to go back to your prepared comments for a moment, you referenced 2023 as being a breakout year for Covenant and I'm guessing that's because you think, you going to be able to show the resiliency of the business through a more challenging freight market to the degree that fully materializes. If you could â\u0080\u0093\n Jack, I think we're confident sticking with where we were last quarter is probably similar to a lot of our peers, kind of a 25% to 30% reduction peak to trough those numbers, as we've modelled them out still hold. And if you think about it, Jack, trucks have kind of been limited, trailers have been limited in the market and TEL over the last four or five years, it's just grown dramatically. I mean, I would say for the last two quarters they have, and that's part of their business model, as Paul mentioned, is a sale of equipment, and they always have gain on sale of equipment. And that's not truth, because to Paul's point, they're growing other pieces of their other business, which may help offset some of the reductions or as equipment market softens a bit, you'll start to see pickup from other areas of their business."
}