{
    "symbol": "ICD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 15:34:02",
    "content": " Today, I have several exciting opportunities to discuss starting with how our 200 to 300 series conversions and related increase in our marketed fleet will significantly enhance ICD's strategic positioning within the U.S. land rig market. And finally, I want to emphasize how extremely tight super-spec rig supply is today, especially in ICD's target markets, and a very exciting opportunity in front of ICD to reactivate rigs into this market and into our evolving and expanding customer base. And as I've mentioned, we are looking to increase that as we move into the 2023 budgeting season, and rigs such as our 300 series rigs earned $15,000 per day margins are higher. We acquired all 14 of our current 300 series rigs in our merger with Sidewinder in late 2018, and this current up cycle is the first time we've been able to market these rigs across ICD's expanded customer base and consolidated target markets in an improving market. And when you consider what we've been able to accomplish so far with margin progression, the ability to convert 200 series rigs in our operating fleet to 300 series specifications will only accelerate margin expansion and our comparative competitive posture with respect to our larger public company peers. Regarding the 200 to 300 series conversion opportunities, it's important to note, we currently have contracts just signed to convert 2 of our operating 200 series rigs to 300 series specifications. Today's spot market dayrates for 300 series rigs are above $30,000 and with adders approach mid-$30,000 or even higher. Does the tightness in the market with -- for the 300 series pipelines or spec rigs, does that allow you to push back against somebody who would say, okay, I want a longer-term contracts, and you say, look, if you don't take it, there's plenty of people who want these rigs. And if you just look at the margin in those rigs on the high end, on the 300, those rigs are going to generate $17,000 a day margins for us, which is, I mean, that's something we'll -- that's an interesting term contract for us because it's going to reward us for the -- what we see as an improving pricing environment."
}