{
    "symbol": "ICD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 17:29:04",
    "content": " We only operated about 18 rigs this quarter, which given we believe we're still in the early innings of this upcycle really highlights how much stronger and well-positioned ICD is today than we were at any time in our history. And we are forecasting meaningful significant improvements in margin per day, driven by continued recognition of the value provided by our rig fleet, including increasing market penetration of our 300 series rigs, our 200 to 300 series conversion opportunities, and additional plan rig reactivations, which are in the pipeline. I point this out because we talk a lot about our rigs and our 300 series rig penetration, but it's our operating and field personnel who work hard every day to exceed our customers expectations at the well-site which ultimately is driving so much of ICD success. In fact, our backlog extending into 2023 is priced at approximately 35,300 per day, the equivalent of over $17,500 of margin per day based upon third quarter cost day metrics  All of our term contracts contain margin protection features that protect our contracted margins against labor and other inflationary costs increases. Instead, we are laying on some contract backlog, because as we think about the large capital investments now required to reactivate rigs and consider the significant margin generating opportunities available in our market today, we feel like it makes sense for a portion of our available days to be termed up. I bring this up because while we are doing the things necessary today to put ourselves in a position to be able to reactivate our 23rd and 24th rigs during the summer of 2023, we also may consider pushing those reactivations toward the end of 2023 if it allows us for example, the ability to stop PIK interest earlier than we previously indicated without sacrificing plan working capital improvements. Cash SG&A was negatively impacted approximately $300,000 by dispute settlement and sequential increases in cash SG&A over the second quarter also were driven by higher incentive compensation accruals based upon improvements in the company's financial performance, and increases in stock based compensation expense related to full quarter expensing of awards granted in June of this year, Interest expense during the quarter aggregated $8.1 million. I wanted to touch on slide 21 of your presentation with revenue per day and contracted backlog and just ask, I know there's differences between rigs and operators and contract from Series 2 to Series 300 rigs. But we are seeing for the 300 Series rigs at the high end, day rates, and the high 30s and we have -- we do have -- revenue per day could be -- for a particular contract could be over $40,000 a day with that or it's not quite that high for on the high end for a 200 Series rig, but again, it's going to be a couple $1,000 stable\n Okay. From a day rate perspective, we're going to get -- there's going to be a mix of rigs, leading edge, or what I just talked about, but not every rig is going to get a leading edge, because not every customer requires the same type of equipment as different customers have different drilling programs. Very proud and pleased that we're going to meet our goal of ending this year with 20 rigs operating, another couple in the pipeline that are going to come out in the first quarter, and where margins are today with 20 to 22 rigs running, we believe that it will give us the scale to achieve the longer term goals as we're thinking about where we want to take the company. So yes, I believe that the demand -- the incremental demand that's coming into the market around 2023 programs is going to create so much competition for super-spec, pad-optimal rigs that there will be opportunities to contract rig for longer than one year."
}