{
    "symbol": "WSTG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 11:38:03",
    "content": " I'd like to think and we haven't been able to verify it, I'd like to think this is because we're becoming more prevalent in the marketplace and a little disruptive to our competitors that we're getting seen by more vendors, and emerging what's coming up, instead of us going after them. So Dale's created a really good infrastructure and organization with our sales teams that enable us to further leverage around either brand sales specialists and products or territories, so we're getting more efficient and therefore able to drive more adjusted gross billings with about the same type of headcount. And then my question for Dale, just looking back I think you've been running the company for three-plus years maybe four years now, and from when you started you just had this focus on getting to your top 20 accounts, not taking every business that walked in the door and focusing and you've done a great job doing that, the results speak for themselves, and now you're doing a billion dollars in adjusted gross billings and growing double-digit to 13% increase. Howard, as Dale referenced, we did a deep dive with our board, sort of a strategic session and you must have been the fly on the wall because we absolutely we'll be starting to share some, I'd hate to say guidance, but sort of directional trends that we're looking forward to over the next two to three years, so at least you all will have a sense of some guideposts, but we won't be uber specific butt we absolutely will provide some directional thoughts and guidance to the market after our Q2 earnings call. We talk about it in the various meetings as far as the exact comment you made as far as the 40 goes, we haven't come up with exact plan that the company is going to go forward, but I can tell you it gets discussed, it's not like we're bidding and saying, hey, it is what it is. I can tell you just personally we're just -- we're so focused on driving the business and we need to look -- and that was part of our strategic meeting this week with the Board, as far as where we're going to go, what's important to our shareholders, and guidance came up and liquidity comes up in almost every meeting."
}