{
    "symbol": "UFCS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 14:51:04",
    "content": " At this time, I would like to welcome everyone to the UFG Insurance Third Quarter of 2022 Financial Results Conference Call. Good morning, everyone, and welcome to our third quarter 2022 conference call. Our core commercial business made up of small business, construction, middle market and marine was down in the third quarter, but at a smaller rate than we experienced in the first half of the year. The combined ratio was 111.7% in the third quarter, a two-point deterioration over the third quarter of 2021. The underlying combined ratio for the third quarter was 94%, a four point improvement over the third quarter of last year and the best third quarter in five years. Although the third quarter combined ratio was impacted by catastrophe loss activity and adverse development, we are pleased with the improvement in the underlying loss ratio for the quarter and through the first nine months of 2022. The ongoing improvement in the underlying loss ratio is the result of significant actions taken over the past several years to improve profitability, diversify growth, strength in underwriting governance and reduce volatility. Those actions include exiting subscale personal lines business, which reduced our catastrophe exposure and improved volatility, executing a reunderwriting exercise to improve portfolio fundamentals with a specific focus on nonrenewing underperforming accounts and rightsizing the automobile line of business to 20% of the portfolio. Centralizing underwriting strategy and governance to improve consistency and quality of underwriting decisions, introducing predictive models to improve pricing and risk selection, transforming claims to specialized line of business operating model, restructuring our reinsurance program to reduce volatility and establishing feedback leads to improve information sharing across the organization. While we have seen improvement in many aspects of the business, we recognize a 35% expense ratio is unsustainable. I will now turn the call over to our Chief Financial Officer, Eric Martin, for a detailed discussion of the third quarter. This quarter, we're pleased to introduce an enhanced format for our quarterly earnings release and presentation, which will continue to evolve in the quarters ahead for easier readability, greater transparency and improved understanding. In the third quarter, we reported a net loss of $0.91 per diluted share and non-GAAP adjusted operating loss of $0.47 per diluted share. As Kevin mentioned, net written premiums increased 9% in the third quarter compared to the third quarter of 2021. Rate increases remained stable at 5.7%, while exposure increased to 3.8% as our underwriters continue to focus on adequate property valuation, particularly considering today's inflationary environment. The combined ratio through the first nine months of 2022 was 101%, a five-point improvement over the first nine months of 2021. The underlying combined ratio through the first nine months of 2022 was 92%, which is the best underlying combined ratio over the last five comparable periods. Net investment income was $11.6 million in the third quarter, up slightly compared to the third quarter of 2021. Within that result, we see the positive impact of higher fixed income reinvestment rates improving investment income by $2.1 million in the quarter compared to the prior year. In addition, realized losses on investments of $14.3 million were driven by negative changes in the valuation of our core equity portfolio. This in conjunction with the declining value of our fixed maturity securities from increasing interest rates negatively impacted our balance sheet, resulting in a book value per common share of $27.82. Our investment portfolio balance was $1.8 billion of invested assets in the third quarter, 85% of which is allocated to a high-quality fixed income book. During the third quarter, we declared and paid a $0.16 per share cash dividend to shareholders of record as of September 2, 2022, marking our 218th consecutive quarter."
}