{
    "symbol": "IPG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 14:00:19",
    "content": " As you all know, for two years now, since the onset of the pandemic, we’ve begun these calls by sharing wishes for our collective health and safety. Of course, we’re also making significant donations to humanitarian organizations at all levels of the company and matching employee donations as well. On a related note, we’ve disengaged from our Russian operations. So, having first provided for our associates there, many of whom were individuals with whom we’ve worked for many decades to receive a minimum of six-month salary. And amid this ongoing tragedy, all of us continue to hope for a deescalation of the war and ultimately, for peace so as to bring to an end the immense and senseless human suffering that we’re witnessing. Turning now to the reason for our call, which is obviously to discuss our business results, I’m going to start with a high-level view of our performance in the quarter. Ellen will then provide additional details, and I’ll conclude with updates on the highlights at our agencies to be followed as Jerry said by Q&A. That reflects strong performance in both the U.S. with organic growth of 12.2% and in our international markets, with organic growth of 10.2% as well as increases in every world region. Yet during that time period, there, of course, been significant changes in our business, the needs of our clients and the workings of consumer and media ecosystems. Concurrently, the speed at which market and client needs are changing, requires a focused and disciplined approach to the way in which as a company we operationally manage investments in key areas of our business. You saw an important example of that last year when we created IPG Health, which continues to perform very well for us. In the first quarter, each segment grew at a double-digit organic rate, which demonstrates the strength of our offerings across the portfolio. Organic growth was 11.5% at MD&E, 11.2% at IA&C and 12.5% at SC&E. We were paced by double-digit percentage increases in our other sector of leisure, government and industrial clients as well as double-digit growth in the retail, tech and telecom, financial services, health care, and auto and transportation sectors. Net income in the quarter was $159.4 million as reported, and our adjusted EBITA was $273.6 million, which excludes a small charge related to the 2020 restructuring program, resulting in net revenue margin of 12.3% in our smallest seasonal quarter. Compared to a year ago, under very strong revenue growth headcount has grown approximately 11%, some variable expenses, such as travel and related and return-to-office costs are well above the levels of a year ago, but not fully to historic norms. A year ago, comparable first quarter margin was 13.1%. And for context, in both 2019 and 2020, our first quarter margins were approximately 5%. With our strong margin results in this year’s first quarter, we’re confident that we continue to see the benefits of the strategic restructuring actions taken in 2020. You’ll recall that in February, we announced that our Board had reauthorized our share repurchase program. And in the first quarter, we repurchased 1.8 million shares using $63 million. We’re pleased to be able to share with you the strong set of results, which builds on our long-term record of industry outperformance as well as our new disclosure, which furthers our long-standing commitment to transparency, in order to assist in analytical work and assessment of our company. A differentiator of our performance in the quarter and over a period of many years has been our ability to create marketing and media solutions that bring together creativity, technology and data. Our first quarter, as I said earlier, is seasonally our smallest quarter, and most of the year remains ahead of us. However, despite these uncertainties and having recently refreshed our bottoms-up outlook for the year with key clients and with our operating teams. You’ll recall that in February, we shared our expectation for approximately 5% organic growth in 2022. We would see that as a strong result given that it compounds IPG’s multiyear growth stack, which significantly leads our industry going back a number of years. At this point, we are nonetheless increasing that outlook for the year to approximately 6% organic growth. We are, of course, staying close to our people and our clients and carefully managing expenses, and we’ll keep you apprised of our progress as the year develops. And I’d therefore like to conclude this part of my remarks by once again recognizing and thanking our people for their work on behalf of clients, but also in support of each other. And at this point, I’m going to hand over the call to Ellen for a more in-depth view on our results. Beginning with the highlights on Slide 2 of the presentation, our first quarter net revenue increased 9.8% from a year ago, with organic growth of 11.5%. Organic growth was 12.2% in the U.S., and growth was 10.2% in our international markets. First quarter adjusted EBITA before a small restructuring adjustment was $273.6 million, and margin was 12.3%. The adjustments exclude the after-tax impacts of the amortization of acquired intangibles, the small refinement to our 2020 restructuring program and nonoperating losses on certain small nonstrategic businesses. Beginning in late February, following the $400 million reauthorization by our Board, we repurchased 1.8 million of our common shares during the quarter were $63.1 million. Turning to Slide 3, you’ll see our P&L for the quarter. Our net revenue in the quarter was $2.23 billion, an increase of $199.5  million. As you can see on this slide, the segment is comprised of IPG Mediabrands, Acxiom, Kinesso and our digital and commerce specialist agencies, which include MRM, R/GA and Huge, we had very strong growth in Q1 across the segment. At our Specialized Communication & Experiential Solutions segment, organic growth was 12.5%. The three-year organic growth of our Jack Morton, Momentum, and Octagon agencies is now positive from the pre-pandemic level of Q1 2019. In the U.S., which was 66% of net revenue in the quarter, our organic increase was 12.2%. We exhibited strong broad-based growth across segments, agencies and client sectors. It is worth noting that, that’s on top of 12.4% a year ago. We’ve increased in nearly every national market, including our largest markets of France, Germany, Spain and Italy. Asia Pac grew 9.2% organically, driven by growth across our largest markets of Australia, India and Japan, while Singapore was flat and China decreased. Our organic growth in LatAm was 21.5%, with strong results across all disciplines. Our Other Markets group, which is Canada, the Middle East and Africa grew 19.9%, with strong growth in each region. Our net operating expenses, which exclude billable expenses, the amortization of acquired intangibles and the restructuring adjustment increased 10.9% from a year ago under growth of net revenue of 9.8%. Our fully adjusted EBITA margins by segment in the quarter were 10.9% in MD&E, 14.2% in IA&C and 16.8% in SC&E. As you can see on this slide, our ratio of total salaries and related expense as a percentage of net revenue was 70.2%. Underneath the SRS results, we delivered on our expense for base payroll, benefits and tax due to aggressive hiring over the course of the past year that was necessary to support our 14.3% organic growth over the trailing 12 months. Our expense for performance-based employee incentive comp was equal to last year’s in dollar terms, and therefore, lower as a percent of net revenue, 4% this year compared to 4.3% a year ago. At quarter end, total worldwide headcount increased by 11% from a year ago to 56,800 to support our growth. Also on this slide, our office and other direct expense was 14.5% of net revenue compared to 14.4% a year ago. Underneath that, we continue to leverage our expense for occupancy, which was 5.1% of net revenue, an improvement of 50 basis points from Q1 2021. All other O&G was 9.4% of net revenue compared with 8.8% a year ago due to the return of certain variable expenses such as our investment in travel, employment and client service costs as a result of the increased level of business activity. Our SG&A expense was 0.9% of net revenue, a decrease of 50 basis points from the prior year. On Slide 7, we present details on adjustments to our reported first quarter results in order to provide better transparency and a picture of comparable performance. As the pit of the slide, you can see the after-tax impact for diluted share of each of these adjustments, which bridges our diluted EPS as reported at $0.40 to adjusted earnings of $0.47 per diluted share. During this year’s first quarter, cash used in working capital was $865 million and filed our fourth quarter of last year when we generated over $1 billion from working capital. The net of the two is $194 million of cash generated from working capital, which is squarely in the range of our recent history. Our financing activities in the quarter were $210.1 million, primarily for our common stock dividend, share repurchases and taxes withheld on shares in our performance-based incentive compensation. In summary, on Slide 11, our teams continue to execute at a high level and have us well positioned to deliver on our expectations for the year. And with that, I’ll turn it back to Philippe. So, I would also like to again thank approximately 57,000 colleagues around the world who contribute to our clients’ growth and the continued evolution of our business. Collectively, we’re implementing our strategic vision, which is to integrate brand experiences across consumer touch points by combining award-winning creativity with best-in-class technology and data infrastructure. That commitment has translated into new client engagements, expanded relationships with our existing partners, and programs that deliver significant growth outcomes for our clients as well as for our own business. At our Media Data & Engagement Solutions segment, we continue to see strong growth, the UM won Grubhub a year ago in the quarter. RG/A continued to perform well in new business with a notable win when it was named AOR for the XFL Pro Football League, and the agency also earned a top position on Ad Age 2022 A-List. New client wins were strong across Acxiom, Kinesso and Matterkind, and all three of those organizations work together with UM to provide a behavioral science-led solution for the GrubHub win, I mentioned a minute ago. So, I think it’s fair to say this move is aligned with IPG’s commitment to going above and beyond what’s required by law. And this allows us to ensure we can support our clients’ business needs with the best data, tools and advice and do so by leading the way in the ethical use of data. At the end of the quarter, Kinesso also launched its outcome Navigator, which is a suite of performance-based services that drives specific business outcomes for brands. During the quarter, MRM expanded its commerce consulting service in health forming a strategic partnership with Salesforce Health Cloud, which allows us to deliver enterprise-level solutions at scale for the insurance, pharmaceutical and medical device sectors. IPG Health continues its very strong performance with clients, new business and within the industry. At the recent Manny Awards where Med Ad News honors the best in pharmaceutical and health care advertising, IPG Health took home nearly 60% of the awards given. The agencies within the network won across many categories, including most creative agency, most admired Agency, Advertising Agency of the Year and additionally, IPG Health was named Network of the Year. Elsewhere at IA&C, following a highly competitive review, MullenLowe was named as creative agency of record by KFC and some of that new positioning and work will be in market shortly. Media Hub continued to show very well, winning new clients top golf entertainment post consumer brands and Pacaso, which is a technology-based real estate marketplace. At FCB, we promoted a dynamic new team to lead the network, and we’ve seen a very smooth transition. During the quarter, FCB was named one of the 10 most innovative advertising agencies of 2022 by Fast Company, and they also featured an Ad Ages prestigious 2022 A-List. Now during the quarter, FCB won new assignments from Hershey’s and Kellogg’s in North America. At the Andy Awards, the first major creative awards show of the season, not only was IPG named the most awarded holding company that McCann was named the most awarded global network. Also worth noting that FCB and McCann were ranked number one and two, respectively, and act responsible good report, which identifies the global networks doing the most powerful and effective cause-related work in our industry. Also during the quarter, Grubhub selected Golin to handle its consumer PR work and NAPA Auto Parts named Golin as its first-ever PR agency. At the 2022 PR Week U.S. awards, we celebrate the industry’s best public relations work current global – DeVries Global, excuse me, Weber Shandwick, the Martin Agency and Mullen Group combined to win 11 awards, which was more than any other holding company. R&CPMK continue to spearhead global campaigns across the entertainment industry, including the launch of Apple TV’s “They Call Me Magic campaign,” and Octagon secured a multiyear agreement to manage event programming for Toyota to activate the company’s Olympic partnership as a lead sponsor. As a result, Octagon will develop and produce the client’s full range of activity related to the 2024 games in Paris. As a real-world events have become to rebound, marketers are seeing that a hybrid component to events offers a path to reach larger new audiences and also to improve and deepen engagement. That’s why IPG recently announced that we are bolstering our capabilities in the hybrid and digital event space by acquiring a significant stake in the Famous Group, which is an award-winning fan experience technology company which creates connected, immersive, augmented and mixed reality experiences to enhance the reach and impact of live events. The capabilities at Famous Group demonstrate what we’re working to develop across all of our agencies, which is proprietary technology skills and IP that can help our agencies build deeper connections to our data resources and capabilities as well as the path to higher order consulting engagements with our clients. In assessing the overall IPG portfolio, we believe that we’re fully provisioned and well positioned for the future without notable gaps in our offering. That said, we will continue to look closely at strategic options to bolster our capabilities through targeted M&A, especially opportunities that further our technology capabilities and bring proprietary tools or platform skill sets into the company. On prior calls, you’ll recall that we’ve identified marketing technology and business transformation consulting as key areas of focus for us going forward. As such, we’re proud that earlier this week, Forbes released its list of the Best Employers for Diversity 2022. They spoke to over 60,000 U.S. employees from across a range of large businesses, serving them, asking them to provide direct experience and opinions about each company in the rankings. So we’re very proud of this ranking and yet we know there’s still a great deal of work to do in the space, and we’re committed to doing more to become a fairer and more representative workspace. I think it was also gratifying to see a number of our agencies stand out as employers of choice, IPG Health, Reprise, ReviveHealth and UM were recently named among Ad Age’s Best Places to Work of 2022. Stepping back now, I think that overall, we’re very pleased with the quarterly results that represent a strong start to 2022. And as stated earlier on the call, we feel comfortable increasing our outlook for the year to approximately 6% organic growth, along with our expectation for adjusted EBITA margin of 16.6%. But in the case, should it be the case and some of that were to begin to materialize, it’s important to note we have a flexible cost model, which as we’ve consistently demonstrated over the many years can be an important lever not only for improving margins and times of growth, but also against downturns in the macro business environment. So I’ll just close by thanking our partners, our people and those of you on the call for your continued support. You may go ahead. I guess over the last three years, it’s pretty clear that MD&E grew faster than IA&C, which in turn grew faster than SC&E. Jason, look, I think quarter-to-quarter, there’s a lot of sort of volatility at any given point in time. So you can have the impact in the case of MD&E in Q1, there was a very sharp ramp in headcount to keep up with growth that we saw last year. So I think looking at anything on a quarter-to-quarter basis there can obviously be a client win or not something we clearly look forward to, but the opposite. And so what I think that – and you’ve heard us talk about the fact that, for example, the Acxiom offering is increasingly helping to power through behavioral science, the way in which some of the advertising agencies go to clients with audience-led solutions and insights that actually inform the creative work. So we think it will help increase growth and it will definitely, as we incorporate more of that and more of the accountable solutions into the rest of the portfolio, there’s upside on both. So I can’t tell you that on a quarter-to-quarter basis, the ins and outs or to your point, there are comps at play on what we would sort of refer to as segment three on the SC&E segment. Clearly, that’s a segment that got meaningfully impacted by the pandemic. And we have underlying strong assets there, but there’s also a benefit to the comp in that segment. So I think it’s a fair question, but yes. You may go ahead. So as we shared with you, we’ve recently come through a process that’s pretty much one we go through every year, but we spent time with all of our operators, and we’ve spent time with clients and our sense is that the tone of the business remains positive. The moving parts component into it is I think we’ve talked about the fact that the pandemic itself, there was that initial three to six months, which clearly had an impact, but then clients began to find their footing. And then they started to really lean into digital channels, and we started to see much more active discussions around implementing e-com, going through their own business transformation journeys. And so you look at our trailing 12-month growth in the 14% to 15% range, you look at for us, a MAGNA forecast for 2022, and that’s directional. The way we trade in media, it’s not we’re clearly much more consultative in our approach to media. And then you get to what you said, which is that I think clients don’t want to step out of a complex process. I’m going to need to understand who you are as an audience, figure out where and how to intersect with you. To pull out of that, it’s not something that you can necessarily easily restart. And so if that means somebody else jumps the line and gets into that conversation or if that means that you begin to lose share at a time when, obviously, you want to in essence, use the leverage that your brand and your position in the marketplace provide to you to take price, right, to offset some of these pressures that you’re feeling that every business is feeling. So I can’t tell you – and again, we’ve got a very, very broad portfolio of clients. I think generally, in the past, you’ve noted organic growth as a driver of higher margins over time. If you look at the progress we’ve made over the last several years is pretty substantial, and we think will be a great result. As we said earlier this year, there’s just a lot of ins and outs coming out of the period of time that we just did. You may go ahead. There’s a number that I just can’t help but comparing, which is that your revenue growth was probably for the first time ever, much higher than Facebook’s which reported last night. I just wonder if you could give a bit more color on your optimism for the second half in general, for the agency business reflected in your upgraded target for the full year. I talked a bit about what we’ve done in Acxiom with extending CCPA to – I mean, we believe that in the long term, the idea that you invest behind having the benefits of data. And then you’ve got some nascent categories be it a sports betting, be it a crypto that I think are looking at the space with a much cleaner, with fewer preconceived notions. So the ways in which fragmentation is both potentially there’s a challenge there as a marketer, there’s also an opportunity there as a marketer. So I mean, we see that all of what’s going on in the space that you noted is being, at least, I don’t know if they’re being disrupted, they’re clearly going through some changes. You may go ahead. So Philippe, it feels like we’re hearing a little bit more. I guess this is a similar theme across the industry about developing solutions that reach more small and midsized businesses, maybe that goes a little bit hand-in-hand with more focus on data and technology and platforms and things that are naturally a little bit more scalable. Do you expect the holding companies and obviously IPG specifically, do you expect the number of clients to grow significantly over time as historically thousands of clients with the sort of top 200, top 300 accounting for the majority of revenue. And I think to my mind, it’s definitely a place I would like to see us go. I mean I think it is factored into the planning and the thinking around here because as you say, the client universe that has been able to work with us has been significant, but ultimately reach limits. If and as we build more services that have a technology layer or component capabilities that you can, in essence, plug in off the shelf, whether that’s dashboards, whether that’s kind of IP that you can license from us so that you can then do a certain kind of analytic work or a certain kind of segmentation work or put data to work in midsized businesses, that’s definitely a place we want to go. I don’t know that, I can tell you that we’ve sort that out to the point where it will go from our current 5,000 clients to two times that or three times that. So our financial community, yes, it’s CFOs, but it’s broader than that, too. And it’s really a team sport, if I can use that analogy. And it’s not different now, but we always do talk and communicate and stay very close to our operators to make sure that we are very close to what’s happening in the business and on the clients. So business as usual, but I’m sure there are a bit more interesting conversations. You may go ahead. Do you think during the commentary about digital advertising, which is mostly SMB and e-commerce and there’s a lot of weaknesses. And second for you, Ellen, if the dollar keeps weakening, I’ve always thought that your U.S. operations have higher margins than cash operations. So if a weaker dollar keeps strengthening, won’t there be a natural flattering of margins just simply from translation purposes. That’s a question that I’m trying to sort of pull it apart as because to your point, it pulls in so much of what we’ve been talking about earlier. So to your point, the complexity of the work they do, the fact that they’ve got the full range of capabilities at their disposal. And then the fact that if they’ve invested in and many of them are further along that curve than others, but to the extent that they are thinking about and working to sort of incorporate more of the digital channels that intersect with consumers. The digital channels or the sort of ways to do D2C, whether that’s in the e-comm space or whether that’s through ad tech. So clearly, I do think that you’re right that at this point, they do have an advantage. So when we win, we’re looking for a balanced mix. I don’t know if I can do perfection again even anytime the next week, but thanks for that. And as always, we’ll keep you posted, and we look forward to our next conversation."
}