{
    "symbol": "CIFR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 09:23:03",
    "content": "  Thank you for standing by, and welcome to Cipher Mining's Third Quarter 2022 Business Update Conference Call. Please be advised, today's conference is being recorded and a replay will be available on Cipher Mining's Investor Relations website. Good morning, ladies and gentlemen, thank you for joining us on this conference call to discuss Cipher Mining's third quarter 2022 business update. Please note that you may also review our press release and presentation, which can be found on the Investor Relations section of the website at investors @ciphermining.com. Before we start, I'd like to remind you that the following discussion as well as our press release and presentation contains forward-looking statements, including but not limited to Cipher's financial outlook, business plans and objectives. And other future events and developments, including statements about the market potential of our business operations, potential competition and our goals and strategies. The forward-looking statements and risks in this conference call including responses to your questions are based on current expectations as of today and Cipher assumes no obligation to update or revise them whether as a result of new developments or otherwise, except as required by law. Today, we are announcing quarterly earnings of $0.24 per share, which validate Cipher's resilient position as a low cost producer in Bitcoin mining. Our contractual arrangement at Odessa allows us the flexibility to mine bitcoin or resell power to the market, which potentially provides benefits when bitcoin mining margins are low. The infrastructure in rig installation is complete for the first phase of miners, which are capable of generating about 2.3 exahash per second. Before diving deeper into a market and business update, let me take a moment to remind everyone how our business model works. On Slide 4, you will see a simple overview of the Bitcoin Mining business. We operate the box in the middle of the drawing that says mining equipment, which represents our data centers and mining rigs. Unlike traditional data centers, which operate a similar model, and sell their computing power output to enterprise clients for dollars, Cipher sells its computing power called hash rate to the bitcoin network for bitcoins. To make this model operate profitably, a bitcoin mining company needs to control both its electricity costs and the capital it spends to build its data centers, including what it spends to purchase mining equipment. Specifically, our fleet of mining rigs cost us an average of $31.52 per terahash per second and that fleet has an average efficiency of $31.5 joules per terahash. And given current distressed market conditions for hardware, (ph) we continue to look for low priced opportunities to expand our total hash rate. We have some of the lowest power costs in the industry with an average power price of approximately $2.07 per kilowatt hour, arranged via long term power purchase agreements. We expect to complete the infrastructure at our fourth data center at Odessa in early 2023 and when it is done, we expect to have a total operating capacity of approximately 267 megawatts. On Slide 6, we show the last several months of bitcoin prices along with several noteworthy news events for the industry. Until last week, bitcoin prices had remained relatively flat, while power prices and overall network cash rate increased. Given this market backdrop, the current strategic focus at Cipher is to find low risk, cyclical opportunities where we can take advantage of our relative strength and continue building a company that can withstand the storm and ultimately emerge as the industry winner when brighter days return. We believe this market turmoil will ultimately cause investors, regulators and others in the ecosystem to come to the same realization and see bitcoin as something unique and different. Alborz is a joint venture that we share with our energy provider and has a total operating capacity when the wind blows of 40 megawatts, that 40 megawatts powers roughly 1.3 exahash per second of rigs. In the third quarter, as we ramped up the data center in somewhat less windy than typical conditions, the site mined roughly 196 bitcoin. Note that our all in-electricity cost for bitcoin at Alborz was approximately $4,571. Note that one of our new transformers at Bear had a problem that being fixed, which means Bear is currently only mining at 8 of its expected 10 megawatts. Combined, the two sites are capable of generating roughly two bitcoin per day in current market conditions. As I previously mentioned, we currently have installed rigs capable of generating roughly 2.3 exahash per second at Odessa. Because of our long term low cost fixed price power contract at Odessa, we have an advantage that few other bitcoin miners have. We have the flexibility to resell our power capacity at market rates and given the currently forecasted market prices for power, this flexibility provides an excellent hedge against potential future declines in bitcoin mining margins. For our very efficient fleet of roughly 57,000 rigs installed in on order, we paid an average price of approximately $31.52 per terahash per second, and our average weighted power price is about $2.07 per kilowatt hour. In this tough market for bitcoin miners, I'd like again to emphasize Cipher's strong liquidity profile. As of November 9, we had approximately $25 million of cash and 161 bitcoin on our balance sheet. As part of our prudent liquidity and balance sheet management, in the third quarter, we also put in place a $250 million at the market equity shelf. When you combine our liquidity profile with our expanding operations and strong unit economics, we believe Cipher is positioned to emerge from this challenging market as the true leader in the bitcoin mining space. In the third quarter, we spent $43 million on CapEx primarily related to that site, which we expect will contribute to our operations commencing in the current quarter. This period, we recorded a $78.9 million derivative asset on our balance sheet related to the Luminant Power agreement. This contract is recorded as a derivative asset in two line items on the balance sheet, $30.4 million as a current asset and $48.5 million (ph) as a non-current asset. For this quarter and future periods, the change in fair value of this contract will flow through our GAAP earnings and we will exclude it the impact from non GAAP reporting. As Tyler mentioned earlier, as of November 9, we had cash balance of $25.1 million and held 161 bitcoin. I'd like to mention that in accordance with the Luminant Power agreement, we will soon fund the remaining half of the required independent collateral of $6.3 million. As Tyler noted, as a matter of good corporate housekeeping, we now have a $250 million ATM shelf that we have not utilized when market conditions improve, it will add to our liquidity profile. The primary drivers are as follows: the change in fair value of our  power agreement resulted in a gain of $85.7 million and this was offset by our equity investment in Alborz, which had a loss of $8.3 million. In addition, our share of the operating loss at Alborz was $1.9 million. This includes stock-based compensation of $10.5 million and the remaining $7.3 incurred include business insurance, payroll and benefits, professional fees, technology, occupancy and other public company expenses. Our non-GAAP P&L and non-GAAP diluted earnings per share exclude the impact of certain non-cash recurring items which includes stock compensation expense, change in fair value of our derivative assets, depreciation of fixed assets, and the change in fair value of warrant liabilities. These measures are not a substitute for our GAAP results, but management will use these non-GAAP financial measures internally to help understand, manage and evaluate our business performance and help us make operating decisions. So for the three months ended December 30, our non-GAAP loss of $14.1 million resulted in a non-GAAP net loss of $0.06 per share. Finally, as you can see, we have made significant progress in becoming industrial scale bitcoin mining company and we look forward to reporting our progress in future periods. To start, I guess, how should we think about your strategy for purchasing additional mining rigs to fill out the remaining 44 megs of infrastructure at Odessa once that site is fully built out. So when I think about flexibility, our options there are go shopping in a distressed market for really cheap machines, potentially think about strategically working with someone that may be repossessing machines or looking for hosting opportunities. So what I'd say is solving for flexibility, but we're pretty confident we're going to find either historically cheap prices for the rigs that we would just go purchase or potentially interesting business opportunities. It's roughly about $20 million I think of expected remaining infrastructure CapEx there, but they come due month by month as progress is made. And last one for me, can appreciate the electricity cost for bitcoin on Alborz at under 5,000 per bitcoin, which is really strong. I think that it would likely be -- the blended electricity price is likely to be slightly higher than that, but ballpark, Alborz is -- our cheapest power in the portfolio generally, unless we get really cheap front of the meter prices at Bear and Chief."
}