{
    "symbol": "SVC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 17:56:05",
    "content": " The major drivers impacting normalized FFO over the prior year quarter was the improving performance of our hotel portfolio, which generated $90 million of hotel EBITDA for the second quarter of 2022 compared to $30 million in the prior year quarter. Net operating income from our leased properties for the second quarter of 2022 increased $2.2 million over the prior year quarter, primarily as a result of a decrease in reserves for uncollectible rents for certain tenants. Interest expense decreased $1.6 million over the prior year quarter, as a result of repaying $200 million of the outstanding balance on our revolving credit facility in April, and the early redemption of $500 million of 5% senior notes due in August in mid-June. Lastly, G&A expense decreased $815,000 or 6% to $12.7 million in the current year quarter, primarily as a result of lower business management fees due to RMR partially offset by increased legal and professional service costs during the quarter. For our 244 comparable hotels this quarter, RevPAR increased 57%, gross operating profit margin percentage increased by 29.4 percentage points to 36%, and gross operating profit increased by approximately $74.1 million from the prior year period. The increase was driven primarily by improvement in our 49 full service hotels, which generated $51.1 million of hotel EBITDA during the quarter compared with losses of $1.5 million in the first quarter and positive EBITDA of $3.7 million in the prior year quarter. Our 82 select service hotels also improved, generating hotel EBITDA of $13 million in the second quarter compared with losses of $2.2 million in the first quarter and hotel EBITDA of $2.5 million in the prior year quarter. Our 116 extended stay hotels continued to deliver solid performance, generating $26.1 million of hotel EBITDA during the quarter compared with $10.6 million in the first quarter and $19.4 million in the prior year quarter. The 24 hotels that are expected to be sold, which includes the 16 Marriott hotels currently being marketed for sale, generated hotel EBITDA of $3.6 million in the second quarter compared to $87.1 million for the non-exit hotels. Also during the second quarter, we made a $45.5 million capital contribution to Sonesta to partially fund their previously announced portfolio acquisition of four hotels in New York City."
}