{
    "symbol": "SVC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 15:34:06",
    "content": " Combined with the solid performance of our leisure and extended stay hotels, room rates have surpassed 2019 figures for the third quarter, a trend that has continued into the fourth quarter with preliminary October ADR of $143, 2% above October 2019 levels. Notably, our full service portfolio RevPAR for the quarter increased to 91% of 2019 levels, highlighted by the strong year-over-year performance of our hotels in Kauai, Boston, Toronto, San Francisco and Chicago, which benefited from elevated leisure travel, improved group demand and the continued ramp of business travel. RevPAR growth continues to be driven through ADR increases at many of our leisure and urban hotels, resulting in our hotels in Fort Lauderdale, Hilton Head, Chicago, Miami Airport and Kauai, all reporting ADR during the quarter in excess of 125% of 2019 third quarter levels. Also, during the third quarter, we entered into an agreement to sell our remaining 16 Marriott-branded hotels for $137 million, excluding closing costs, which we expect will close in Q1 2023. Starting with our consolidated financial results for the third quarter of 2022, normalized FFO was $88.5 million or $0.54 per share, a 100% increase over the prior year quarter. Rental income declined approximately $900,000 compared to the prior year quarter as a result of the positive impact of reducing reserves for uncollectible revenues in the prior year period, partially offset by an increase in percentage rent recognized of $1.7 million relating to our travel center leases in the current year quarter. Lastly, our share of normalized FFO recognized from our 34% ownership interest in Sonesta increased by $1.2 million over the prior year quarter. Turning to our hotel portfolio results for our 240 comparable hotels this quarter: RevPAR increased 29.6%, gross operating profit margin percentage increased by 3.2 percentage points to 33% and gross operating profit increased by approximately $43.2 million from the prior year period. Overall, RevPAR increased 29% over the prior year quarter to $92.15 due to strong occupancy gains in our urban full-service hotels and an ongoing recovery in our suburban select service hotels. By service level, the increase was driven primarily by an improvement in our 49 full-service hotels, which generated $39 million of hotel EBITDA during the quarter, a 186% increase over the prior year period. Our 114 extended stay hotels continued to deliver solid performance, generating $27.2 million of hotel EBITDA during the quarter, a 14.6% increase over the prior year period. Our 79 select service hotels also improved, generating hotel EBITDA of $14.4 million in the third quarter, an increase of 81% compared to the prior year period. The 21 hotels that are expected to be sold, which include the 16 Marriott hotels under agreement for sale, generated hotel EBITDA of $3 million in the third quarter compared to $78 million for the non-exit hotels. During the third quarter, we sold five hotels for an aggregate sales price of $29.7 million and six net lease properties for an aggregate sales price of $1.1 million. We sold one hotel in October for a proceed of $6 million, and we are currently under agreement to sell 16 Marriott branded hotels and four Sonesta branded hotels for a combined sales price of $162.5 million, which we expect to close by early first quarter."
}