{
    "symbol": "NEU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 00:12:05",
    "content": " Relevant factors that could cause actual results to differ materially from those forward-looking statements are contained in our earnings release and our SEC filings, including our most recent Form 10-K.  During this call, I may also discuss non GAAP financial measures included in our earnings release. The earnings release, which can be found out on our website, includes a reconciliation of the non-GAAP financial measure to the comparable GAAP financial measure. Net income of $66 million or $6.54 a share compared to net income of $52 million or $4.75 a share for the second quarter of last year. Petroleum additives net sales for the second quarter of 2022 were a record $721 million compared to $586.6 million for the same period in 2021. Petroleum additives operating profit for the quarter was $91.2 million, higher than the second quarter operating profit last year of $74.2 million. The increase was mainly due to increased selling prices and shipments, partially offset by higher raw material and operating costs. Shipments between quarterly periods were up 2.6%, with increases in lubricant additive shipments, partially offset by decreases in fuel additive shipments. During the quarter, we also funded capital expenditures of $15 million, paid dividends of $21 million and repurchased $55 million of stock. This ratio is slightly above our normal range of 1 to 2 times, but we have stated there will be periods when we are outside the norm and our target remains unchanged. For 2022, we expect to see the capital expenditures in the $55 million to $60 million range. We remain focused on the long-term success of our company, including emphasis on satisfying customer needs, generating solid operating results and promoting the greatest long term value for our shareholders, customers and employees. We believe the fundamentals of how we run our business, a long term view, safety and people first culture, customer focused solutions, technology driven product offerings and a world class supply chain capability will continue to be beneficial for all of our stakeholders."
}