{
    "symbol": "STRL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 15:30:12",
    "content": " In addition, we generated $219 million of cash from operations and finished the year with $182 million of total cash on the balance sheet, up over $120 million from prior year. For the year ended December 31, 2022, we reported net income from discontinued operations of $9.7 million, consisting of an after-tax gain of $13.2 million from the sale which was partially offset by a tax loss from operations of $3.5 million. At December 31, '22, our backlog totaled $1.414 billion, up $86 million from the beginning of the year. Unsigned low-bid Awards at the end of 2022 totaled $275 million, an increase of $23 million, an increase from $23 million at the beginning of the year. We finished the year with a combined backlog of $1.689 billion, a $339 million increase over 2021. Our full year 2022 revenues totaled $1.769 billion, up $355 million from 2021. Our current quarter e-infrastructure revenues were $247 million, an increase over the prior year quarter of $120 million. Full year e-infrastructure revenue was $905 million, an increase of $437 million over 2021. The year-over-year revenue increase included $289 million from the late 2021 acquisition of Petillo, and e-infrastructure organic growth of $148 million. Transportation revenues were $127 million in the current quarter, a decrease of $23 million or 15% from the prior year. Full year transportation revenues were $542 million, a decrease over the prior year of $85.6 million or 14%. Consistent with our strategic intent, low bid heavy highway work declined by approximately $10 million year-over-year. The current year quarter of Building Solutions revenue was $75 million, a decrease over the prior year quarter by $4 million. The full year of Building Solutions revenues were $232 million, an increase of $4 million over the prior period. Current quarter consolidated gross profit was $69 million, an increase of $16 million over the prior year quarter. Full year consolidated 2022 gross profit was $275 million, an increase of $71 million over 2021. Operating income for the fourth quarter was $37 million, an increase from $20 million for the prior year quarter. For the full year, 2022 operating income was $159.9 million, reflecting a $52.9 million increase over the prior year. Our fourth quarter EBITDA totaled $49 million -- $49.9 million, an increase of 78% over the prior year quarter. Full year 2022 guidance totaled $208.7 million, an increase of 51% over the prior year period. Finally, the diversity and strength of our portfolio of businesses, our strong liquidity position consisting of $182 million cash at the end of the year and are comfortable 1.9 times EBITDA leverage. So for instance, this year, our transportation group footprint has done about $85 million of revenues from both commercial work and e-infrastructure work in their footprint. I think our pricing and our new jobs are much more firm and the -- what I'll call the risk of diesel going back up to $7 or $6 or $5 a gallon versus $3, we built it in that way or if we built it into $5 going to $8 or $9, I think it's much lower than it was this time last year."
}