{
    "symbol": "STRL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 14:21:03",
    "content": " In the quarter, revenues were up 89% versus Q2 prior year and now represent 46% of our total revenue and 69% of our total segment operating income. Our second highest margin segment, Building Solutions, continued to see strong growth as its revenue grew 15% versus prior year second quarter and its segment operating income grew 44%. We saw significant growth in our expansion markets and combined now represent 18% of our residential revenue, up from 6% in the second quarter of 2021. Our Transportation Solutions business reduced in size in the quarter versus prior year by approximately 6%, but delivered more earnings as our segment operating income improved 6.5%. Revenue for the current quarter of 2022 totaled $511 million, up $109 million or 27% over the prior year quarter. Importantly, of this 27% second quarter revenue growth, $76 million or 19% of the revenue growth was driven by the late 2021 acquisition of Petillo with a balance of 8% organic revenue growth coming from Sterling. Including the Petillo results on a pro forma consolidated basis, Sterling's organic revenue growth in the second quarter was 12% and it was 15% in the first half of 2020. The current quarter E-Infrastructure Solutions organic growth of $34 million over the prior year quarter reflects the continued strong demand for distribution centers, datacenters and warehouses across our East Coast footprint. Building Solutions revenue grew 15% over the comparable 2021 quarter, reflecting continued residential revenue growth in our core Dallas Fort Worth market and in our expanding footprints in Phoenix and Houston. Transportation Solutions revenue was $191 million in the current quarter, a decrease of $11 million or 6% over the comparable year period. Our second quarter EBITDA totaled $54.3 million, an increase of 33% over the prior year quarter of $41 million. In light of our first half performance, our increased backlog levels and the outstanding execution of our teams -- our raise in full year guidance represents a 48% improvement in net income, a 42% improvement in EPS and a 19% increase in revenue over last year's performance. And when you cut through the delta between the two years, about half of that delta is a little over half, 60% is that impact of those new projects ramping up throughout 2021 and the other half is just the higher growth in working capital demands of the E-Infrastructure segment with the 20% to 30% growth each quarter."
}