{
    "symbol": "SPR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 18:40:05",
    "content": " For example, while the headline production rates do not change, we have seen delivery schedule changes since last quarter for some programs, including the 767, the A220 and the A320, pushing units out of 2022 and putting pressure on free cash flow. Given the ongoing schedule, supply chain and labor challenges that we have been encountering, we have launched a cost optimization effort that should enable Spirit to be profitable and cash flow positive when the 737 is at 31 aircraft per month, which is where we are now and may remain for some time. And most significantly, this is the first time we have reported positive Commercial segment margins since 2019, while operational cash flow has continued to improve due to higher 737 production rates. Free cash flow usage for the quarter was $73 million, which was higher compared to the same period of 2021, driven mainly by large cash items in the third quarter, which included a $228 million tax refund and $38 million received from the Aviation Manufacturing Jobs Protection Program. We are, therefore, taking several actions to position Spirit to be profitable and cash flow positive even if production rates on the 737 remain longer than we expect at 31 aircraft per month. First, launching a cost optimization effort to remove structural cost in infrastructure, supply chain and operations that will ensure that Spirit is profitable and cash flow positive at 31 aircraft per month, if that rate ends up being where we say for an extended period of time. And looking at next year, as I said, we are planning to stay at 31 aircraft per month and executing on that, stabilizing our factories, stabilizing the supply chain, getting working capital under control and so that will be a key driver for next year on free cash flow. Mark, anything else to add? Mark, anything else to add? Mark, I just wanted to go back and get some color as to why cash flow got so much worse and could it happen next year, because like in the Q4 call that occurred only back in February, the guide was for effectively minus $120 million, including the cash payment to Boeing, and obviously, you gave the numbers this morning. And if I could clarify one thing you guys mentioned, so for 2023, it seems like your previous outlook where you would be positive free cash flow was predicated on higher production rate. And then in the supply chain, itâ\u0080\u0099s really looking at level loading to figure out how we can get the best cost position and go to where the capacity exists in terms of people and infrastructure, because there are shortages in different pockets and we have got to level load the system so that we can optimize that better and those are the things that we would do to be more profitable and more cash flow positive at 31 aircraft per month. And as we get stable and we drive into next year, thatâ\u0080\u0099s what gives us a pretty good feeling that at stable 31 a month we can drive cash flow positiveness into our operations, take advantage of the cost optimization program and then who knows maybe late next year, a little higher production rate will be additive to that, but thatâ\u0080\u0099s kind of how we are thinking about it. Higher costs earlier in the year that had a significant negative impact to cash flow in the first quarter and a lot of that was, I would just say, costs that were consumed to break rate from 21 to 31 that wonâ\u0080\u0099t repeat. Some of the recent forward losses is going to put a little bit of pressure on that, but based on our current situation with the forward losses that we have taken through the third quarter and our projected cost versus price in 2023 that is factored into our assumptions that we can get to cash flow positive. Based on the 31 a month production rate, as well as a couple of other programs that are -- have excess costs, we expect the excess cost again to significantly improve year-over-year and we expect that to -- it should end up being slightly inside of $100 million. But things have changed, I mean, our aspiration is obviously as production rates increase to improve our profitability and our margins and our cash flow conversion, but we also have to take into account that itâ\u0080\u0099s a much different macroeconomic environment than even it was 12 months ago. Mark, anything else to add?"
}