{
    "symbol": "SPR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 15:27:12",
    "content": " As we discussed on last quarter's call, we anticipated the first quarter financial results would be the lowest of the year with meaningful improvements in the second half of 2022, driven by increased narrow-body deliveries, specifically the 737 and A320 programs. We focus on operating margin, we saw improvements to negative 4% compared to negative 14% in the first quarter of 2021 reflecting increasing production rates and lower costs associated with excess capacity and changes in estimates recorded during the current period compared to the same quarter last year. Forward losses in the first quarter of 2022 were $24 million, primarily driven by further production rate decreases and cost of rework on the 787 program as well as increased cost of quality and production rate decreases on the A350 program. In comparison, during the first quarter of 2021, we recorded $72 million of forward losses driven by lower production rates on the 787 and A350 programs and $6 million of unfavorable cumulative catch-up adjustments. First quarter 2022 earnings included $50 million of excess capacity costs, a decrease of $18 million over the same period of 2021 and as well as abnormal costs related to COVID-19 of $10 million, an increase of $7 million over the first quarter of 2021 due to the impact of the COVID-19 cases that hit us at the beginning of the year. Given the customer schedule changes, supply chain disruptions, Ukraine and Russia conflict, and inflationary pressures, we are now expecting full year 2022 free cash flow usage to be between $175 million to $225 million, inclusive of the $123 million Boeing Advance repayment. In the first quarter of 2022, commercial revenue increased 35% compared to 2021, primarily due to higher production volumes on the 737, A220, A320, partially offset by lower production on the 787. Now we're going to continue to work on that, but we just wanted to give everybody the outlook that right now, we're looking at negative $175 million to negative $225 million for the quarter -- or for the year, which includes the $123 million payment to Boeing. And so you really didn't see a big drop first quarter compared to fourth quarter because we weren't delivering at 31 a month, you'll see that a nice tick down in excess costs in the second quarter as we start to deliver at the higher rate."
}