{
    "symbol": "INTU",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-29 20:28:06",
    "content": " So when you come to us, you're very clear about the benefits that we offer, the choices that you have and why it can help fuel the success of your business to then revamping the first-time use experience, along with what we have just implemented for, I would say, higher-value, larger Mailchimp customers and new customers that we want to pursue, which is a one-hour assisted onboarding to help you get on to the platform to help you understand the benefits of the platform. When we look across tax, which is 35% of the Company; and then when you look at across small business, which is over 50% of the Company, so that's like 86% of the Company, we have sort of -- which includes Mailchimp, we have proven and tried KPIs that allows us to see things well into sort of the future not only to ensure that we're investing in all the right things, but also be able to be very intentional and thoughtful about how we guide because we take our guidance very seriously. But I think what I would say is we -- when you look at our innovation and when you look at our customer uptick and the expansion revenue that we're starting to see, it's actually very much in line with what we would have expected because a lot of our innovation that is in place is actually now accelerating the growth of the business. Despite a lot of innovation that is still coming to market because we're just -- we're making assumptions around unemployment going up, delinquency rates getting worse, which means that financial institutions, although we're one of the last platforms they pull off of that they will be conservative in terms of their investment levels. I mean if you go back to when we closed the deal almost a year ago, one of the things that we were very clear about, in addition to our excitement around the asset and the fact that now combined with QuickBooks, we can have one growth platform that can be the source of truth for -- and the source of growth for a small business, one of the things that we reiterated was that this was really a business that was run for profitability and it was run for cash flow. And that's why the comment that I made earlier and Michelle made earlier around, we expect that the growth in Mailchimp to accelerate in the coming quarters because we're seeing the KPIs around customer growth, expansion retention, these things are starting to improve. And we're starting to see the key performance indicators that I mentioned earlier uptick in the right direction, which means that almost a year in, it's not been quite a year, but almost a year in, I feel very good about sort of year two because we've put a lot of foundational things in place in year one."
}