{
    "symbol": "PLYM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 17:13:08",
    "content": " On the call today will be Jeff Witherell, Chairman and Chief Executive Officer; Pen White, President and Chief Investment Officer; Anthony Saladino, Executive Vice President and Chief Financial Officer; Jim Connolly, Executive Vice President of Asset Management; and Anne Hayward, General Counsel. Our results were released this morning in our earnings press release, which can be found on the investor relations section of our website, along with our Form 10-Q and supplemental filed with the SEC. A replay of this call will be available shortly after the conclusion of the call through November 10th, 2022. For those who listen to the replay of this call, we remind you that the remarks made herein are as of today, November 3, 2022, and will not be updated subsequent to this call. During this call, certain comments and statements we make may be deemed forward-looking statements within the meaning described by the securities laws, including statements related to the future performance of our portfolio, our pipeline of potential acquisitions and other investments, future dividends and financing activities. We will also discuss certain non-GAAP measures, including, but not limited to, core FFO, AFFO and adjusted EBITDA. We're exceeding the mark-to-market with our leasing efforts, and the first phase of our development program is nearing completion. As of today, we remain extremely positive as we continue to engage with our tenants regarding their need for additional space and the relative health of their businesses. As Jim will highlight here in a few minutes, our property management and asset management teams are also busy responding to the large number of RFPs for our space. As Pen will note later, the conversations with brokers and sellers are starting to change for the smaller deals. Expectations have started to be more reasonable, but without any larger transactions occurring, there really isn't a real read-through on cap rates yet. I mentioned this earlier in passing, but it's an important point. This is our fourth regional office joining Columbus, Jacksonville, and Memphis. With the two new developments nearing completion in this market, we will be over 2 million square feet in Atlanta. In addition to delivering better service to our customers, we are saving millions of dollars a year in third-party fees. Now, let's turn to the key operating stats for the quarter, which continue to highlight our strong internal growth. In addition to the internal growth from same-store NOI, we have added some growth for next year with the first phase of our development program. Pages five and 12 of our supplemental have more detail on the program and the pipeline, but I'll briefly bring you up to speed on the first phase. In Portland, Maine, we have completed construction at our $9.3 million, 70,000 square foot building. In Atlanta, we're under construction with a new 237,000 square foot industrial building that is delivering in the fourth quarter and a 180,000 square foot building adjacent to it that is delivering this quarter as well. We have fully leased 180,000 square foot building for five years with occupancy in early January 2023, and we have several proposals out for consideration for the second building. In Cincinnati, at our Fisher Industrial Park, our new 156,000 square foot building is delivering this quarter for a total investment of $13 million. While they have exceeded our expectations and we have demand in place for our other projects in the pipeline in Jacksonville and Cincinnati, we're going to pause for now on that second phase to prioritize our capital elsewhere in 2023. Anthony will provide the details on our capital position, but I did want to reaffirm that we know where we need to be in terms of leverage, and we'll get there gradually and prudently. With the Series B preferred stock conversion occurring well ahead of when we expected, 2023 can be an opportunity for us to continue to simplify the balance sheet. As noted previously, we have paused our acquisition efforts for the time being. Our pipeline remains robust, but we're still working through a period of price discovery among both buyers and sellers. We've seen a significant number of deals come back to us due to retreading or buyers walking on refundable contracts or sellers just deciding to pull properties from the market for the time being, which further reinforces our decision to stay on the sidelines until we see some additional clarity among various sized transactions. Deals are still closing, though not at the same velocity as the first half of this year. So, there is still a pricing premium for portfolios of scale, though the ingoing cap rate premium is not as wide as it was a year ago. With any future transactions, that pricing discipline will continue to be in place. But we continue to prioritize at the right price or opportunities that are accretive on a cash flow basis, allowing us to secure above-market rental increases, leverage our local and regional property management and asset management teams and focus on markets with low vacancy rates, strong rental growth, and high tenant demand for our preferred product type and size. Last quarter, we introduced some new data and research on our markets that we have talked about quite a bit with the investment community during our meetings in the past several months. We expect that within the next several months, the concept of a Golden Triangle, which many of you know is the area in the middle of the country that roughly triangulates the great lakes to Texas, then East to Florida and back up to the Chicago area, which has become the epicenter for the nation's logistics infrastructure. This triangle now contains over 70% of the U.S. population, half of the U.S. GDP, more ports than any other region in the country and five of the seven Class 1 railroads. In addition to the Ford Motor Company's decision to locate their BlueOval City near Memphis with nearly 10,000 jobs and Intel's decision to locate semiconductor plants near Columbus, Ohio, with 3000 jobs, we've seen announcements by Honda and LG to invest $3.5 billion in Southern Ohio to build battery plants. In fact, according to the Reshoring Initiative, Ohio, Georgia, North Carolina and Kentucky are the top four markets in the U.S. for adding new jobs in 2022 due to reshoring and foreign direct investment. Even in markets where there is new products coming online, it's not competing with our product and tenant base. It's not addressing the most liquid size of space, and it's not easing the space crunch for smaller tenants. Now, I'd like to turn it over to Jim Connolly to walk through the leasing activity and portfolio operations. For the year to Q3, the weighted average lease term on commencing leases was 4.3 years with an 18.8% cash rental rate increase. Through the end of October, we have leased a total of 6.9 million square feet related to leases scheduled to expire during 2022, which represents 97.2% of the 7.1 million square feet of total 2022 expirations. Furthermore, we leased 664,000 square feet of space that had been vacant at the start of 2022 and 215,000 square feet of new development space. Also, through the end of October, we have leased 1.5 million square feet for space expiring during 2023 at rates 11.5% above expiring cash rents. As Jeff noted earlier, there are several leasing prospects for our remaining Atlanta, Cincinnati and Maine development projects that we are actively working and nearing lease execution. The first phase of the solar program, which is comprised of 2.2 million square feet that have leases across 10 rooftops, is expected to be operational by 2024. Portfolio-wide occupancy at the end of Q3 2022 was 98.8%, up 150 basis points from the end of Q2 due to the commencement of the vacant space leasing previously mentioned. Of the 417,000 square feet of vacancy within our portfolio at the end of Q3, 61,000 square feet has been leased with tenancy starting later in 2022, with another 52,000 square feet categorized as being repositioned at four locations. In total, there are 10 buildings with 1.266 million square feet classified as being repositioned during 2022 due to rollover and planned renovations. Most of this space, approximately 75% of it, is currently leased long-term, and we're achieving returns of approximately 9.5% on a stabilized NOI for these re-positionings. Finally, through November 1st, we had collected 99.7% of our rents billed during Q3 2022, and there are currently no active rent deferrals. Our buildings remained leased at a high occupancy level, rental rates continue to increase, tenant relations are high and our buildings are well looked after. At this point, I'll turn it over to Anthony to discuss our financial results. Same-store performance exceeded our expectations this quarter due to sequential growth in revenue from our new and renewal leasing in the portfolio, supported by improved expense reimbursement as we convert expiring rollover to triple net lease structures. Triple net leases now account for nearly 77% of same-store ABR as of quarter end, up from approximately 74% this time last year. Interest expense was a headwind once again as it relates to the borrowings on our credit facility, which remains the only debt that is not hedged or fixed. With respect to capital markets activity, our only deployment of the ATM was a block traded at $21.35 per share that generated proceeds to settle a portion of the remaining Series B preferred stock with cash. The conversion of Madison's remaining shares of the Series B was one of the biggest moving parts in our Q3 results and, for that matter, in our guidance. As disclosed in August, Madison notified us that they had elected to convert the remaining 2.2 million shares of the Series B. Based on the liquidation preference, they actually would have been entitled to receive 2.7 million in common shares. Under the terms of the agreement, we had the right to settle the conversion in stock or cash or in combination of both stock and cash. In the end, that saved us approximately 85,000 common shares and allowed us to add one large institutional holder. We continue to show sequential improvement in our debt metrics, with net debt to EBITDA improving slightly to 7.3 times, and net debt plus preferred to EBITDA improving 60 basis points to 7.7 times. As of September 30th, 93% of our total debt carried a fixed rate or was fixed through interest rate swaps, with a total weighted average cost of debt of 3.74%, with 57% of the total debt on an unsecured basis. Our only floating rate debt continues to be the unsecured credit facility, which has been primarily used to fund our development program. With our first phase nearing completion at year-end, these projects will contribute to earnings, as well as NAV creation, as lease-up occurs over the next two quarters. Our liquidity position remains strong, as presently, we have $13.7 million of cash on hand, plus an additional $9.5 million in operating expense escrows and $272.5 million of capacity on the revolving line of credit. We tightened the range of both the low and high ends, leaving us at $1.83 at the midpoint. The contribution from previous acquisitions, the raise in our annual same-store NOI range by 200 basis points and further refinement in G&A offset the higher interest expense on the credit facility and the higher share count from the earlier-than-expected conversion of the remaining Series B preferred shares into common shares. With respect to same-store performance, the low end of the new same-store NOI growth range still assumes the potential for some minor and transitory vacancy and additional real estate taxes, insurance and utility impacts, some of which may not be fully recoverable from tenants for the terms of their respective leases. Based on these inputs, that would imply same-store NOI growth in Q4 of 8.5% to 10.5%. We are also assuming G&A expense controls will continue with an incremental $200,000 benefit from what we projected last quarter. As of September 30, we only have approximately $12 million yet to fund by year-end to bring the first phase online. With the continued rise in SOFR, we've raised our full year guidance on interest expense by $375,000 at the midpoint. And as Jeff said earlier, we have an opportunity to build on this improvement to gradually delever through internal growth as we bring our new development projects online, realize higher annual embedded rent steps throughout our entire portfolio and continue to capture mark-to-market on expiring leases. On your FFO guidance, it basically implies fourth quarter at $0.44 at the midpoint, which is down from this quarter. I realize that interest rates and higher share count are headwinds, but I just wanted to ask what are the other puts and takes to get us to that $0.44? The timing of real estate tax impacts, which we've discussed previously, specifically in Chicago and Ohio. And then, to a lesser extent, there's other OpEx such as insurance and other usage-related impacts. You mentioned the increase in interest expense, certainly was a drag, specifically as it relates to the uplift in rates. And then, the other and last principal factor is the impact related to the second half conversion of the Series B. Jeff, you mentioned price discovery in your markets, developments are picking up, yields seem attractive. Yes, I mean I think we've mentioned that in the past. I mean debt markets, capital markets and then just price discovery on deals, they're few and far between. So all those factors are -- like a lot of people, we're just going to be on pause for the time being. Jeff, I wanted to go back to your pause on development, which is obviously maybe a newer change for you guys given the success that you've had with these recent projects. Yes, David, it's primarily probably driven by balance sheet. So, I think it's primarily driven by balance sheet, but if we can get -- if we get a deal that's preleased, that will probably make a difference. So really a combination maybe of derisking and then the balance sheet, I think that probably makes some sense. I wanted to go back to some of your comments, maybe Jim, on 1 million square feet or so that I think you called repositioned. They were selected at the beginning of the year of 2022, properties that we're going to have expected turnover and/or needed some major refurbishments. I think it was Jeff that you mentioned and dovetailed into maybe some of Pen's comments, but you said smaller deals, the expectations are a little more reasonable. Yes, David, I think I mentioned that. Yes, I mean smaller transactions are actually able to get financed by local banks. So, I think some of those are hard to get done. So when that settles down, we don't know, but most people selling today are selling you because they have to or they believe this is where the best pricing is going to be. I think there was one recent transaction, 1 million square feet in Cleveland, that just sold, it was a sub-six cap. I think the environment has gotten even a little bit more murky as a result of yesterday's Fed actions or more importantly, their comments after their actions. So, I think we're still going to obviously remain on the sidelines for the reasons that Jeff touched on. But we're seeing -- we have seen deals come back to the market, but not necessarily priced out in their finality, if you understand. I just don't -- we just don't have a clear demonstrable piece of evidence, if you will, or a series of trends to say for certain what our -- where our valuation is going. And hopefully, I'll have a better answer for you next quarter. I think last quarter, you talked about sort of 25 to maybe 60 basis points. Yes, I mean, it's probably -- it's hard to say. There's still a pricing premium, again, for what -- there's not a lot of portfolio transactions, but the few that we've seen, they haven't moved a whole lot, if you will. Jeff just mentioned the one in one of our markets in Cleveland, $110 million deal that's still sub-six cap, but again, that's just one deal. We need to monitor it, and we obviously are continuing to monitor the marketplace as deals occur. And typically, more deals closed in the fourth quarter every year, and maybe we'll see more deals closed, but who knows. Just hoping you could elaborate on that a little bit, talk about occupancy heading into the fourth quarter and into 2023 from 98.9% at September 30, whether you see any potential move-outs or known move-outs in the near term or if you're just being cautious? Todd, I'll speak to the potential impacts on same-store and then defer to Jim to talk more about portfolio occupancy and the outlook for 2023. The likelihood is that they're going to stay put, but the guidance does reflect some transitory movements at the end of the year. Again, the bigger impacts in same-store potentially relate to the non-recoverable real estate taxes that I referenced earlier. As far as the portfolio in general, I mean, we've actually picked up over 99% in the fourth quarter. Next year, if it is similar to this year, there might be a couple of months roll here and there, but in general, around where we are right now. Todd, I think sequentially, we're going to see improvements in 2023. I don't have the information at hand to actually quantify the impacts, but I can get that to you. No, not presently, there remains a positive arbitrage should we use the line to redeem the Series A. And then, when the share price becomes more constructive again, we could evaluate the use of the ATM. So we haven't increased our joint venture discussions, but they're ongoing. It's one of my things in my job description, talk to people all the time. And again, I think the deal in Memphis that we completed and then bought out from the JV partner this year, I think it worked out really well. And I think, probably not on this call, but we can get into it at a later time where our operating platform really -- our property managers on the ground in Memphis made a big difference in that portfolio. So, I think JVs are -- this is exactly the time we should be talking about them and maybe executing on them. And then, obviously, you talked about the four offices, the opening of a new one. We're close to 70% internal property management, and we can talk all day about the benefits of that. Obviously, we continue to see industrial development rise despite some of the backdrop. I mean you're just seeing -- we've been approached by developers with deals, if you will. So, it's these interesting times as they say, where the demand on the ground for space is still there, at least on our new product, and construction costs have moderated and then just the financing to get these deals done. So, I think there's a lot of volatility right now on the development side. As far as REIT rates, would have been probably 10% higher than the rates that were in the underwriting. We didn't articulate a specific target, Anthony, but we're looking to obviously turn that down. We have the benefit of incremental EBITDA, including the contribution from the stabilization of development and repositioned properties that will result in a half turn down on net debt plus preferred. And then, if we are in a position to use a leverage-neutral source to address the redemption of the Series A, that metric will more meaningfully improve. And then, I think on the last call, you guys mentioned that the solar initiative will add approximately $1 million to the FFO in 2023. There's phase one which is about half of the solar is submitted and going through regulatory approvals and working out connections to the grid, that will be online at the end of 2023, and that's about $0.5 million. As always, we're available for follow-up questions and we'll talk to you again in about three months."
}