{
    "symbol": "PLYM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 12:18:06",
    "content": " In Cincinnati, at our Fisher Industrial Park, we have a new 155,000 square foot building under construction for a total investment of $12.2 million, that should also deliver in the fourth quarter. During the second quarter and through the first week of July, we closed on $65 million of acquisitions, totaling 662,000 square feet across six industrial buildings. Since 2010, in Tier 2 markets there has been only 7% growth in the 20,250,000 square feet range and over 75% growth for 500,000 square feet and over. Through the end of July, we have executed leases totaling 6.4 million square feet related to space scheduled to expire during 2022, which represents 92% of the 7 million square feet of total 2022 expirations. Our leasing prospects for our Atlanta, Florida, Cincinnati and Maine development projects that we are actively working, additional solar leasing is also in the works with roof space totaling 4.2 million square feet being awarded to two sole vendors to lease out. As a general comment, I think you're seeing some cap rate expansion across the board and in our markets anywhere from 25 bps to 60 bps to 65 bps kind of depending on the tenants and the length of lease terms, but we definitely have seen a lot of, I guess, reexamination from sellers, whether they want to put deals in the market right now. But I think in my prepared remarks that those haircuts were applied against initial guidance per se, not exactly applied against those under contract, but we get a lot of -- my team got a lot of calls from various brokers across the country that -- from -- on deals that we may have looked at in the fourth quarter for instance or early first quarter, and passed on and we get calls and say, hey, I know you looked at this five, six, seven months ago but we've realigned our expectations that the seller has, would you consider X price instead of Y price. So a lot of activity in Cincinnati, again, this is a -- Fisher Industrial Park is our 1.25 million square feet existing park and we have land in there to build another 300,000 square feet or 400,000 square feet and where we've got walls it going up 155,000 square feet now in Cincinnati, lot of interest in that."
}