{
    "symbol": "REZI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 20:32:14",
    "content": " I would point you to the products that we just talked about today as being a key driver to their revenue performance this year, but I think as we look further out and we look to have more and more of our products on that platform, I think a lot of the focus is really going to be on driving revenue across that platform and with more products on it, we think that in and of itself will help to accelerate the revenue. And now with us coming out of that of course now it gives us the opportunity to really exercise our playbook in terms of a variety of different things, factory cost optimization, the automation piece that Tony just talked about for First Alert, but automation opportunities and other parts of the company and I'm excited about that too, because it gives us levers that we had to put on the sideline for a while until we're in the position we are now and that the folks that we brought in over the last few years that are very good at that and have a lot of experience in doing that work. There are types smoke, carbon monoxide et cetera, they're in the house or in small business offices and there are in many, many different places and so it's additional sensors that are in the building, it comes back to the ecosystem comment that we were talking about before and that gives us opportunity to connect all this in certain products and incorporate new types of things with off the base platforms of those as we move forward. And we did not have the another call-out to first where we didn't have to the due to the factory automation, factory automation opportunity in those plans in â\u0080\u009821 and we think we're going to learn from First Alert over the next year, year and a half, but we think that's pretty real as well. So I think those two things are really the critical investments but I'd also call out, I mean, we -- the operating expenses in that business relative to sales have not gone down and we could have driven them down and we didn't and we are in the position that we're in today, because we made those investments, and this year there was going to be another chunk, because we're building out the new ERP system that I think is going to drive sort of the next wave of initiatives that enablement around the business."
}