{
    "symbol": "SYBX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 13:41:15",
    "content": " For SYNB 1353 is synthetic biotics designed to consume timing as a potential treatment for homocystinuria or HCU, findings from the recently initiated Phase 1 healthy volunteer study and finally for SYNB8802 a potential treatment for entire hyperoxaluria, we also expect to share proof of concept data. This builds on Phase II interim analysis and proof of concept data shared last fall, demonstrating in PKU patients SYNB1618 strong activity and reduction in plasma Phe, the amino acid PKU patients arenâ\u0080\u0099t able to metabolize and becomes neurotoxic at high levels. And that's some of the feedback that we've received as we've been enrolling Phase II is that these patients are interested in maybe Phase III, where they have the opportunity to participate in an open label extension study and have that opportunity if they benefit from treatment to be able to continue until the product is approved. But as we move to Phase III, I think the burden for sites and for patients will be a lot lower because we'll really be focusing in on the plasma fee lowering as the primary endpoint with less frequent visits with much more, less intensive visits in terms of blood draws and other assessments. And our plan would be to continue to work with the FDA to be able to broaden and enrol those younger patients in a step manner and based on the data that we're gathering in the Phase II study, because we do recognize that the pediatric patients are key segment for us with big unmet need and obviously lifelong consequences. For the first one, in terms of the Phase III design, we plan to have an end of Phase II meeting with the FDA where we'll get final alignment on the specific design before we disclose that externally, I think that's the prudent thing to do. So I think both efficacy components, as well as tolerability components and I think overall, we see tremendous promise based on the learnings from Phase II that we can really optimize that Phase III design to be as informative as possible, and also have a good enrolment rate, by having it low burden for patients and foresight."
}