{
    "symbol": "VWE",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-15 22:52:07",
    "content": "  Operator: Greetings, welcome to the Vintage Wine Estates, Inc. First Quarter 2022 Financial Results Conference Call. At this time, all participants are in a listen-only mode. I will now turn the conference over to your host, Deborah Pawlowski, Investor Relations for Vintage Wine Estates. Joining on the call today are Pat Roney, our Founder and CEO; Terry Wheatley, our President; and Kathy DeVillers, our CFO. After which, we will open the call for questions. As you are aware, we will probably make some forward-looking statements during this formal discussion, as well as during the Q&A session which are outline here on Slide 2. During today's call, we will discuss some non-GAAP financial measures, we believe this will be useful in evaluating our performance. With that, you will turn to Slide 3, I will turn it over to Pat -- I'm sorry Terry to begin. These are very exciting times here at Vintage Wine Estates and we're making excellent progress gaining market share, advancing our multi-brand omni-channel strategy, while building a stronger operations and finance infrastructure. We grew over 3% in the quarter over last year, and importantly, had a 37% revenue growth in our direct-to-consumer business. Russell Joy, our COO, has joined us at an opportune time to help us deal with juggling of current and new suppliers to get the glass and other supplies we need and working to meet our customer requirements. Looking to our growth efforts, VWE launched the first ever celebrity branded e-commerce retail store that is vertically integrated to VWE direct-to-consumer production, management in fulfillment. The e-commerce store is rich with content information and appeal to an established customer base, supported with best practice and proven digital to delivery success. Looking to Slide 4, we're making solid progress on our efforts to strengthen our finance infrastructure to address the incremental demands of being a public company, but also the variances in the accounting processes. They are providing the suggested adjustments to our inventory and costing oversight to ensure we have the needed processes and the right people throughout the organization to support a strong, reliable and sustainable finance and accounting structure. Pat will review the acquisition in greater detail, but it's an excellent addition to our RTB offerings, providing us a greater diversity with a leading Cider brand, and adding a new channel to our market. Turning to Slide 5, you will see we remain fairly evenly balanced among our three business channels. In our direct-to-consumer segment, as I mentioned, we have significant growth of 37% as we consistently amplify efforts through our many direct-to-consumer channels, including our tasting rooms, wine clubs, ecommerce, QVC, telemarketing, digitally native brands and the addition of the Sommelier Company. Our marketing tactics, leverage customer advocates to drive brand recognition and celebrate loudly our superior customer experience. We had increased tasting room traffic, significant growth in wine club membership and retention, and are continuing to gain traction in our ecommerce in digital channels. Of note, our average order value across all key transaction sites was up 3%. Volume for direct-to-consumer was up 13% and operating income improved 127%, reflecting an excellent improvement in product next. Moving on to wholesale, our revenue was up about 8% and benefited from increased international volume and more favorable product mix. Cohn, Kunde, Cherry Pie are also brands that continue to grow above the industry average. And next, our B2B business, demand remained very solid and B2B, which is our private label and production services. As a result, we had shipments to a major retailer rescheduled in to the last nine months of fiscal 2022. These programs are shipping now, and we'll continue through the third and fourth quarters as well. With that, let me turn it over to Pat to talk more about our results, the recent acquisitions and our outlook. Thank you, Terry, and good afternoon, everyone. If you'll turn to Slide 6, I'll first touch on our most recent acquisition ACE Cider. This is a great addition to our ready to drink portfolio, and also complements our channels to market and extends our market research by adding beer distributors to our wholesale network. We also see this as providing another platform for growth and diversification, such as wine on tap and new ready to drink brands. ACE was founded in 1993 and is located in the hardest Sonoma County, a region well-known for not just as winemaking, but also as premium apple orchards. At the beginning of the quarter, we acquired Vinesse, which is off to a great start. It has measurably enhanced our DTC platform, and our marketing team is moving faster leverage our digital capabilities to increase member average order value and grow membership. As I've noted before, we have a strong organic growth strategy that is complemented with our acquisition efforts. Our acquisition pipeline remains robust, and we expect that we are not finished with acquisitions for fiscal 2022. Turning to Slide 7, we can dive further into the results for the quarter. While revenue was up over 3% in the quarter were not for the $7 million in delayed shipments resulting from class shortages, revenue would have been up 16%. We will still ship that volume, and it will be spread over the last nine months of the year. As Terry mentioned, we had very strong growth in our DTC segment with revenues up 37%. This included 18% organic growth and the rest from acquisitions, volume was up 13%. This focus is also reflected in margins for the segment with expanded 670 basis points, 17% operating margin. We were encouraged with our depletion volume growth as well, which is up 1% year-over-year, but importantly was up over 14% on our priority and focus brands. While we are nimbly addressing the challenges of the supply chain, we are expecting that will not be resolved easily or quickly given the pervasive impact is having throughout the world. If you'll turn to Slide 8, adjusted EBITDA was $11.8 million and EBITDA margin was 21.1%. In fact, these expenses should decline by about $300,000 per quarter in the second half of the year. While adjusted EBITDA calculations, the changes will benefit net income in the future. Slide 9 demonstrates our financial strength, which provides us the flexibility to execute our growth plans. On Slide 10, you will see that we are upgrading our guidance by providing our expectations based on the current business, which includes finance and it does not include any pro forma expectations of prospective acquisitions. Given that we are in effect raising our guidance, we expect revenue will be in the range of 265 million to 275 million. At the midpoint of the range, this represents about 22% growth over fiscal '21. And also because of the seasonality that we see by quarter, we thought it would be helpful to provide the next quarter's revenue expectations. This includes Vinesse, and we've also considered supply chain constraints but that does remain a risk factor. We expect continue to navigate the unprecedented supply chain constraints impacting everyone, as we work to identify alternative supply sources and carefully manage shipments to meet customer's demands and pull all available lovers to capture price throughout the fiscal year. If you turn to Slide 11, continue that these are really exciting times at Vintage Wine Estates. Over the last 20 years, we have executed a plan that delivers excellent growth, having a unique value proposition for our customers. As we advance our strategy, we believe we can accelerate our delivery on value with even stronger talent, a larger strategic vision, and greater financial flexibility. With that, Kyle and Deb, we can open the call for questions. At this time, we will be conducting a question-and-answer session. Please proceed with your question. So Pat, my first question is for you. You noticed that the end of your prepared remarks that you're going to pricing lever as much in as many places as you could, sorry, that was a terrible paraphrase. I'm seeing that throughout my coverage universe, beer distilled spirits, CSC, salty snacks. Vivien, so we think, we're not alone in the industry and the industry starting to signal that because of the cost increases or anything in glass and other items, this time probably to be looking at price increases. And we'll do that strategically across each of the channels, direct-to-consumer. And then the wholesale segment, we're also going to take a hard look at some of our brands and in the after the Christmas holiday season. And we fully expect that while there are no price increases, baked into our revenue, guidance or baked into our plans, we do expect that there will be some opportunities and some reasons to take price in the third and fourth quarter. And then, maybe my second questions on the Cider acquisition and congrats on announcing that. So I think with Vivien excited cider, which is seen 10% growth every year and a new flavor introductions that it hasn't been impacted by some of the other categories. And as you know, we specifically chosen to stay out of the seltzer market, but we see strong potential for organic growth there. And because of our abilities to expand these production capabilities into a dual location with one on the East Coast, we see significant opportunities for expansion of the brand in those segments. There's been a lot of industry ink spilled around how tough the question has been in Europe, particularly wondering if you can just comment on that any direct implications for your business, I would think would be minimal, given your sourcing by geography. So, they did have a certainly a very, very challenging harvest and Europe this year, and we believe that that will create significant opportunities for the California and Washington Oregon wine markets to move into certain price points by potentially take some additional price and expand distribution and expand overall growth is in the category so we think that's a strong, strong opportunity for us. Also on the sparkling front, with the shortage of sparkling coming over for this holiday, we're really we have our Laetitia sparkling brand that is in California launching nationally. We have the Paula Kornell sparkling brand, we are getting every bottle we can out into the marketplace to fill the shortages that are coming from that. Well, we still have some -- we do have some supply constraints. We do have some on Paula Kornell, but that is something we're really focused on is building out our supply path on that. Please proceed with your question. And now as 265 to 275 including the acquisitions, I presume, since the time that you own them, the prior guidance was 265 to 275 on a pro forma basis. The way I calculate is that these acquisitions will maybe add 25 million to 30 million for the year if they said about 20 million annually, and based on when you own them. So the underlying growth would be more like would be about 8% to 12%, 10% of midpoint. And when we did the original numbers, we gave pro forma guidance which actually included a full 12 months of pro forma and our feedback from our friends, our analyst was that we should be perhaps we shouldn't be looking at providing just actual guidance, which is what we're now doing. So, we're not taking the benefit of on a pro forma basis, we're having those acquisitions in for 12 months, we're now showing them based upon when they come in. And so, it actually makes the acquisition numbers, real numbers a little bit stronger than what it would be on a pro forma basis. Sorry, I just wanted to make sure that, so it's only for the time that we've actually got the acquisitions in our portfolio. And it doesn't include any future acquisitions yet, either, which previously, the pro forma even had that built in. So I guess, just cut through all that, but the bottom line is. No, it's still at 10% maybe a little bit of upside, but we don't want to get through our specific. We want to get to our biggest quarter, which is our second quarter before we look at changing any of that. Right now, I just want to make sure it's clear. That's what I thought as well make sure it's clear, because, in some respects, you say, you made an acquisition here that could add $20 million on an annual basis yet, the number didn't really go up. By the way, I think the way you're doing it now is the right way to present is the better way to present it. So maybe they could do a little bit of confusion, so just wanted to clear that up. Secondly, that the glass shortage, I guess, when did that start to, so I know, we just means after your last call, and you talked about some things, some shortages there. But once it really starts to impact the business, when did the shortage go from a little bit of an issue to actually not being able to ship on time. So our major glass supplier was hacked to be basically very, very early in July, late June, early July. And that's when we chose not only to couldn't bottle enough, but we also chose to move in a couple of our retail partners programs out to make sure that they can have full inventory when they were ready to launch their programs. One more, if I could. Well, most of our big retailers are announcing in the next two weeks. Actually, this calls a little bit early for that. So, we're -- every week we're getting new and those would set in March. Please proceed with your question. I want to start on the, I guess, the organic growth trends that you would have seen during the quarter, and specifically with the, your tasting rooms, and maybe some of the traffic trends that you're seeing there throughout the quarter. Pat, maybe I'll take this one. And we're back to the 2019 level, so excited about how the traffic is coming back into the pay syndrome, I think there was a lot of pent up demand for people to get back out and get into the tasting rooms. So still really good, we feel that's a very healthy number but we know we can do better in that. So with that during COVID really putting a focus on the, what we want to say as our white glove service, putting personal notes in the wine club packages, putting actually put like small gifts, tiny things, seed packets, or just notes or a corkscrew or something like that. And it really -- it sounds silly that those simple things, slow down the attrition, but we're pretty, pretty thankful for how we curved the attrition rate during COVID and keeping those wine club members happy. Another one, if I can just inflation specifically as passing through price increases, what we've seen thus far from companies in our coverage universe is, it seems like there's a very, I guess, healthy propensity for the consumer to be able to beer these price increases, I imagine. That's what you're seeing as well and probably aided by the fact that these customers are already sort of used to paying for a premium, experience premium products. So they're more willing, I guess, feel to possibly those price increases. Well, I would just say, we've done a few price increases in our direct-to-consumer. You're able to add $0.50 or $1 a bottle, which is impactful on a case. And we don't intend to until we get as Pat said, through the holidays, we see what competitions doing we can see where we could go with that. So but we haven't the tiny the small price increases we've taken in some of our direct-to-consumer or ecommerce on our websites, we really haven't seen any kind of pushback or loss in sales from them. So in turn in terms of the multiple in the margin opportunities for this, we do see some synergies, I don't expect it fully to go all the way down to justify that we expect rapid growth, and then that'll probably bring it closer down to that side of the multiple. But we currently on an acquisition basis, we are around 10 to 11 times multiple and we are able to synergize that down fairly quickly. Please proceed with your question. The pineapple is in a strong 30% to 35% ACB, some of their new flavors such as guava and mango around 13% of the growing rapidly. So, we've seen that is a good area. So, we don't see a significant shift more towards on premise with the exception, potentially some opportunities and major national accounts that we call on, they're currently not going on. So on the wine side, you have a broader view you're looking at our TDs. I think it's still largely on the wine side, that's really the vast majority of it. These are a couple of plug-ins plays that we indicated early on, that we've been looking at. And I don't see in their ready to drink very many more acquisitions, I see more, more innovation on that side of it. And then just last thing, the comment you made about the consultant you've hired to sort of look at sort of your internal processes and oversight of inventories and things like that. No, we're moving forward our acquisition strategy. So, we're not intended to slow anything down. Please proceed with your question. So the California harvest was a quality standpoint, and actually pretty good harvest. From a quantity standpoint, it was lightened certain varietals light and suddenly unblocked and lightened cabernet in the premium Northern California segments. Yes, beside the shipment that we delayed there were things that then put more of the margin in the group focused on our bottling operations, which is a little bit lower margin. So, we would have had more overall dollar margin and margin. It was a certain type of bottles, and what was the timing associated with the cycle that we were in. In your outlook, your EBITDA is showing a very strong improvement year-over-year in '22. I know last year, it has been, a little bit up and down. Yes, as the gross margin trajectory will continue to improve, I mean, it's not just issues impacted with the glass or any price increases associated with that. But our efficiencies from our new bottling lines and the efficiencies from our new warehousing operations are items that are really going to help those who have been in the work for two, almost two years. So, it's a combination of all of these things, but we fully expect to hit our EBITDA margin targets for the year as well as our gross margin numbers. I mean, in the past year, you completed Kunde, you completed CSC, Vinesse. So,  has been doing very, very well against our expectations. Now, of course, we've managed that winery for 10 or 11 years. So, we know it fairly well. On the wholesale side, you highlighted like higher case volumes internationally. Yes, I would just say those markets are opening back up. So, we're seeing those businesses just bounce back up. We have reached the end of the question and answer session, and I will now turn the call over to Mr. Pat Roney for closing remarks."
}