{
    "symbol": "STNE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-19 14:12:03",
    "content": " We achieved total revenue of BRL 2.3 billion, which was 5% above our guidance and up 83% year-over-year, excluding the negative revenue impact from the credit product in the second quarter '21 in pro forma for Linx. On the profitability front, our adjusted EBITDA margins increased sequentially from 4% in the first quarter to 4.6% in the second quarter, driven by improved operating efficiency in our financial services and in our software businesses. Second, the strong MSMB TPV growth of 78% year-over-year, driven by both our active client base growth and a continued improvement in go-to-market strategy for TON and Stone products. This, combined with our client base growth, resulted in an MSMB TPV of BRL 69.9 billion, 3% above our guidance for the quarter and 78% higher year-over-year. On top of the growth in number of clients actively using our digital banking account, I want to highlight the sequential improvement in ARPAC, which reached BRL 39 per month this quarter compared to BRL 33 last quarter and 3x higher year-over-year, mostly driven by higher interest rates on average deposits from clients bank accounts. Software revenue in the second quarter of '22 reached BRL 351 million, representing 23% year-over-year growth pro forma for Linx. At the same time, adjusted EBITDA also improved, reaching BRL 53 million with 15.2% adjusted EBITDA margin compared to 12.3% in the first quarter and 9.2% in the second quarter of '21 pro forma for Linx. Financial expenses, with the bond included in the previous quarters for comparison purposes, presented a sequential growth of around 710 basis points as a percentage of revenue, mainly due to 3 factors: first, the further increases in CDI rates that increased, on average, 20% quarter-over-quarter; second, a larger mix of prepayment revenue; and finally, our decision to increase the duration of our funding lines. Thank you for the question. Thank you for the question. Thank you for the question. So the penetration of financial services into our software client base has evolved sequentially, and this had a positive impact on the growth of platform services TPV, the 95% growth year-on-year on platform services TPV, because that's where we account for the TPV within our software client base. Thank you for the question. But overall, when we look at the growth that this guidance implies, it's still a very strong growth year-over-year, over 60% growth in revenue that we think is a healthy pace versus the improvement in profitability that we want to have. I think that in the third quarter, these dynamics will be a little different because we have -- we expect a better dynamics of revenue net of the financial expenses and there is always some lagging effect between how the CDI evolves and brings the financial expenses versus our pricing."
}