{
    "symbol": "VEDL",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-28 14:35:02",
    "content": " And finally, we paid the second interim dividend of INR19.5 per share, amounting to INR7,249 crores in second quarter, which takes total business payout for the first half at INR51 per share that amounts to almost INR19,000 crores, INR18,933 crores, one of the best dividend paying company in India. So as clear from the EBITDA bridge, quarter-on-quarter, the impact of market driven factors have been partially set off through better volumes across businesses and lowering of cost impact to several measures on cost with also the input prices also tampering in second quarter. Again, on net bridge, as I mentioned at the beginning through various initiatives, we have improved working capital, which resulted in strong free cash flows before group CapEx amounting to INR8,369 crores, which enabled us to declare interim dividends in the second quarter. But we actually work out the power cost at INR 0.5, it comes to somewhere between $325  or so per tonne against maybe more than $1,000 of the power cost which we had in the last quarter. So because the quarter two, we -- we got the option of moving the coal by a road and the -- although the linkage improved from 22% to 55%, the reduction of power cost to that extent has not happened, which I think will have a much higher impact this quarter. If you look at the current fiscal F23 H1, the total liabilities are about 3 billion and out of which we may have seen the repaid here two dividends and the balance about $1.3 billion at VRL and go refinanced mostly through Indian PSU bankers with the longer-term maturities and the lower cost. So, my question is on account of coal cost, when we are talking about that it has reduced from 1.9% per GDV to 1.3% this quarter, we have seen cost reduction of just $170 per tonne. The first quarter, the average coal cost was 1.9%; quarter two, it was around 1.7%; and in quarter three, we are hoping to stay around 1.4% or so. Number two, even when the linkage core realization improved from 22% to 55%, we had to move a lot of coal through road and which actually hit the cost at -- in real sense, this coal would have come by rail, which was the original allotted means of movement of the coal, this will have reduced the coal cost to a larger extent."
}