{
    "symbol": "SMRT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 20:30:09",
    "content": " Before I turn the call over to Lucas, I'd like to remind everyone that the discussion today may contain statements related to our business that may be considered forward-looking, including statements concerning our plans to execute on our growth strategy, our ability to maintain existing and acquire new customers, the benefits of strategic acquisitions including our acquisition of SightPlan, expected financial results, product portfolio, enhancements, expansion plans and opportunities, expectations regarding key operational metrics, and other statements regarding our plans and prospects. This focus translated to record revenue of $37.4 million, above our guidance and record units booked indicating continued momentum into the second quarter. The dollar value of the first year of SaaS revenue for these bookings, totaled $4.6 million as compared to $2.2 million in the first quarter of last year. Total revenue for the first quarter increased 95% to $37.4 million, as compared to $19.2 million in the first quarter of 2021. Notably, we experienced a 205% increase year-over-year in the SaaS revenue to $4.1 million, of which $3.5 million was attributable to SmartRent, with contributions of $500,000 from iQuue and $200,000 from SightPlan. We expect SaaS revenue to grow significantly in Q2 both from organic growth, driven primarily by the deployment of new units and from a full quarter of contribution from SightPlan's operations. SaaS ARR, which we define as the annualized value of our recurring SaaS revenue for the current quarter was $16.3 million as compared to $5.3 million in the first quarter of 2021. As we shared on our Q4 call, we anticipate seeing incremental margin improvement in the second half of the year as bookings from the first and second quarter reflecting new pricing or converted to deployed units. As of March 31, 2022 SmartRent's total deferred revenue, which provides us with near and medium-term revenue visibility increased to $116.8 million as of March 31 2022 from $64 million at the end of the first quarter of 2021. For the second quarter, we are providing total revenue guidance of $47 million to $55 million and units deployed guidance between $64,000 and $75,000, which reflects our seasonal deployment increase and our current assessment of potential supply chain headwinds."
}