{
    "symbol": "SMRT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 18:39:10",
    "content": " Gross margins in Q4 were 9.7% more than three times higher than Q3, driven by increases in all three revenue streams: hardware, professional services and SaaS software. SaaS revenue was $28 million, an increase of 251% year-over-year. These efforts yielded strong results as year-over-year ARPU increased for each of our revenue streams in 2022: Hardware by 21%, professional services by 15% and hosted services by 45%. Total revenue for the year was $168 million, up 52% from $111 million in 2021 as we grew the topline despite supply chain constraints and other challenges faced during 2022. Specifically for hosted services, SaaS revenue increased from $8 million in 2021 to $28 million in 2020, a 251% increase. Adjusted EBITDA was negative $75 million for the full year and negative $14 million for Q4, a $4 million improvement from Q3.We believe that we are on track toward profitability and adjusted EBITDA will trend positively as we grow revenue, while improving gross margins and managing operating expenses. We will continue to disclose deployed units after each quarter, Q1 guidance for revenue is $55 million to $58 million and adjusted EBITDA is negative $12 million to negative $8 million. Yeah, I think itâ\u0080\u0099s important that I really want to sort of reiterate that, with the robustness of the platform weâ\u0080\u0099re not worried about supply this year at least right now where we sit, there is a lot of different ways that we can get to the revenue and targeted EBITDA. At the midpoint of both guidance ranges, both for first quarter, as well as for the full year 2023, it seems youâ\u0080\u0099re implying quite a market improvement in margins over the course of the year from something like negative 17%, 18% to almost negative 8% or 9%. I think youâ\u0080\u0099re going to -- at the low end of our guidance, itâ\u0080\u0099s north of 50% revenue growth year-over-year, which I think is incredibly strong."
}