{
    "symbol": "DAIO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-29 23:29:03",
    "content": " Before we begin, I'd like to remind you that statements made in this conference call concerning COVID-19, future revenues, results from operations, financial position, markets, economic conditions, silicon chip shortages, supply chain expectations, estimated impact of tax reform, product releases, new industry partnership and any other statements that may be construed as a prediction of future performance or events, are forward-looking statements which involve known and unknown risks, uncertainties and other factors which may cause actual results to differ materially from those expressed or implied by such statements. These factors include uncertainties as to the impact from COVID-19, including the 2022 outbreaks in China, the Russian war with Ukraine, including any related international trade restrictions, along with continued reopening and recovery efforts within the relevant global supply chain and among our customer base, level of orders for the company and the activity level of the automotive and semiconductor industry overall, ability to record revenues based on the timing of product deliveries and installations, market acceptance of new products, changes in economic conditions and market demand, part shortages, pricing and other activities by competitors, and other risks including those described from time to time in the company's filings on Forms 10-K and 10-Q with the Securities and Exchange Commission, press releases and other communications. In addition to a strong operating quarter, we had an excellent sales quarter with third quarter bookings of $7.1 million, reaching the highest level in the past year. In fact, from the second quarter, it got much stronger with cash increasing to $11 million on September 30 from $10.3 million on June 30. With the increase in business activity level, deferred revenue grew to $2 million, up by $500,000, including a delivered system waiting for final acceptance from the end of the second quarter. For the third quarter, revenue of $7.2 million was up from $4.8 million in the second quarter of 2022 and $6.7 million in the third quarter of 2021. The third quarter bookings for 2022 were $7.1 million, up from $6.4 million in the second quarter of 2022 and $5 million in the third quarter of 2021. As a result, our backlog of $4.9 million at the end of the third quarter was brought down from $5.8 million at the end of the second quarter. Selling, general and administrative expenses were just under $2 million in the third quarter of this year compared to just over $1.9 million in the second quarter and $2.2 million in the third quarter of 2021. Adjusted EBITDA earnings of just over $1.4 million in the third quarter of 2022 compares with the adjusted EBITDA earnings of $564,000 in the prior year period."
}