{
    "symbol": "DAIO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-25 21:38:05",
    "content": " Before we begin, Iâ\u0080\u0099d like to remind you that statements made in this conference call concerning COVID-19, future revenues, results from operations, financial position, markets, economic conditions, silicon chip shortages, supply chain expectations, estimated impact of tax and other regulatory reform, product releases, new industry partnerships, and any other statements that may be construed as a prediction of future performance or events are forward-looking statements, which involve known and unknown risks, uncertainties and other factors, which may cause actual results to differ materially from those expressed or implied by such statements. These factors include uncertainties as to the impact from COVID-19, including the 2022 outbreaks in China, the Russian war with Ukraine, including any related international trade restrictions, along with continued reopening and recovery efforts within the relevant global supply chain and among our customer base, levels of orders for the company and the activity level of the automotive and semiconductor industry overall, ability to record revenues based on the timing of product deliveries and installations, market acceptance of new products, changes in economic conditions and market demand, part shortages, pricing and other activities by competitors, and other risks, including those described from time to time in the companyâ\u0080\u0099s filings on Forms 10-K and 10-Q with the Securities and Exchange Commission, press releases and other communications. Due to the challenges associated with lockdowns in China earlier in 2022, our revenue for the year was lower than in 2021, but our revenue in the second half of 2022 was 11% higher than the prior year period. Stepping back a bit, we believe demand is strong and being driven by multiple factors: number one, the continuing recovery in the automotive electronics market, including improved silicon availability; number two, the accelerating adoption of electric vehicles, which consume 2x to 3x the silicon content of cars built around the internal combustion engine; number three, the strength in the industrial sector, including factory automation advancements; number four is onshoring to North America as part of a global China Plus One Strategy for the electronics industry; number five is the recovery in Europe thatâ\u0080\u0099s digested the impact of the war in Ukraine and higher interest rates and inflation and has stabilized and is growing again in the second half; and number six is the impact of government policies here in the U.S. to support onshoring and security requirements. Net working capital on December 31 was $17.6 million, up $1.1 million or 7% sequentially from $16.5 million at the end of the third quarter and up from $15.9 million at midyear, although down from $18.5 million on December 31, 2021. For the year 2022, revenues were $24.2 million versus $25.8 million in 2021. We had $14.5 million revenues in the second half of 2022, up from $9.8 million in the first half of the year and compares to $13.1 million in the second half of the prior year. As a result, our backlog at the end of the year of $4.8 million decreased slightly from the $4.9 million at the end of the third quarter and was up substantially from the $2.9 million at the end of the fourth quarter of 2021. Operating expenses were $34 million in the fourth quarter of 2022, down as compared to $30.7 million in the fourth quarter of the previous year. For the full year, total operating expenses were $14 million in 2022 as compared with $15 million in the prior year. Selling, general and expenses â\u0080\u0093 selling, general and administrative expenses were just under $2 million in the fourth quarter, which is consistent with the third quarter of 2022 but lower than the fourth quarter of 2021 when we had just over $2 million in selling, general and administrative expense. For the full year ended December 31, 2022, the net loss of $1.1 million or $0.13 per share compares with a net loss of $555,000 or $0.06 per share in 2021. For the second half of 2022, the company had net income of $1.4 million compared with a net loss of $1.1 million in the first half of 2022 and a net loss of $193,000 in the second half of 2021. For the second half of 2022, adjusted EBITDA earnings were $2.3 million, up nearly 3x the $700,000 of adjusted EBITDA earnings in the second half of 2021."
}