{
    "symbol": "OII",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 14:29:06",
    "content": " Given our first half 2022 performance and our expectations for the second half of 2022, we're updating our adjusted EBITDA guidance range to $210 million to $240 million for the full year. Our second quarter 2022 results increased significantly as compared to the first quarter of 2022, as we produced adjusted EBITDA of $53.5 million, which was within the guidance range provided at the beginning of the quarter. As expected compared to the first quarter of 2022, our energy segments in aggregate led by SSR and OPG posted a 20% revenue increase and significantly improved operating results in the second quarter. Consolidated operating results increased by $23.9 million in the second quarter of 2022 as compared to the first quarter of 2022, with all our operating segments generating positive EBITDA. For OPG, second quarter 2022 revenue and operating income increased significantly compared to the first quarter of 2022, primarily as a result of increased inspection, maintenance and repair or IMR and installation work in the Gulf of Mexico. The sequential operating income margin increased from 1% in the first quarter to 15% in the second quarter of 2022, reflected increased demand and significantly improved pricing for vessel-based services in the Gulf of Mexico. Operating income margin of 10% declined more than expected from the 15% margin achieved in the first quarter of 2022, due to changes in revenue mix and delays in certain projects where we incurred pre contract costs. For our third quarter 2022 operations by segment compared to the second quarter of 2022, for SSR, we are projecting higher revenue and operating profitability in our ROV, survey and tooling businesses, with ROV utilization increasing to the high 60% to low 70% range. For ROVs, we expect 2022 service mix to remain about the same as 2021 mix, up 60% drill support and 40% vessel-based services with higher vessel-based percentages during the seasonally higher second and third quarters."
}