{
    "symbol": "RKLB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 22:52:03",
    "content": " In 2022, we saw backlog more than doubled from $241 million at the end of 2021 to more than $500 million at the end of Q4 2022, with growth driven by healthy mix of launch and Space Systems bookings. In the final quarter of 2022, we had some great milestones with space systems including Rocket Lab hardware on 30% of all globally addressable launches. The first vote of confidence in Neutron came back in September 2021, when we won a $24 million contract for the development contract the Neutron transfer stage through the Space Force's Systems Command of Launch Enterprise, which falls under the NSSL program. This closes out a very successful year with full year 2022 revenue of $211 million, up 239% from 2021 with launch in Space Systems finishing the year with revenue growth of 56 and 546% respectively. We expect revenue in the first quarter to range between $51 million and $54 million, which reflects $32 million to $35 million of contribution from Space Systems and $19 million of contribution from Launch Services, which assumes three launches or two remaining launches in the quarter. So when we look into our backlog, we don't see a lot of kind of financing risk in there, again, because the mix of customers that we have -- and again, I think that we've been able to be a little bit more creative and flexible in some cases, working with customers to kind of help support their business and also going to make sure that we're in a good position from maintaining and growing market share in many cases. I mean we typically have seen, I mean, it's a relatively young business, so we don't have a great amount of track record as far as seasonality is concerned but it does seem like Q1 gets off to a slower start, probably a function of a little bit of a hangover from indications launch ranges being kind of closed at the end of the year. Demand actually is higher than -- would indicate a higher number of launches than 15 this year, but we've also learned through the school of hard knocks that we can get burned when we rely really upon what just our customers are telling us what their demands are because customer spacecraft oftentimes seem to slip and push out to the right at the last moment just because of the nature of how these programs develop and when things come through their final qualification and testing. And maybe just adding to that, you've mentioned we're seeing it with the Q1 outlook for launch at $19 million for three launches, but you mentioned that you probably would get back to more of a normalized ASP throughout the year. So again, I think the uptick in spending the current -- or the forecasted Q1 adjusted EBITDA, while we don't give guidance beyond kind of the next quarter, I think that's a number that's going to be -- I don't think we're looking at the low watermark as far as adjusted EBITDA loss in the quarter because again spending has continued to ramp up."
}