{
    "symbol": "LIZI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 12:51:06",
    "content": " We aim to provide users with innovative online social companionship experiences by building on our AI chatbot platform and creating more engaging fun and interactive AI chatbot usage scenarios that foster emotional connection, ultimately promoting our global business development. In the fourth quarter, our total net revenues were RMB587.6 million, representing an increase of 5% year-over-year, primarily due to the growth in the average user spending on our audio entertainment products. Cost of revenues was RMB404.1 million in the fourth quarter of 2022, representing an increase of 7% year-over-year, primarily due to an increase in revenue sharing fees to our content creators as the companyâ\u0080\u0099s revenues grew, and partially offset by decreases in salary and welfare benefits related to decreases in our operationâ\u0080\u0099s headcount, as well as a decline in other miscellaneous costs and share-based compensation expenses. In terms of our overall strategic plan, we will further propel our global expansion strategy for 2023, promote the applications of AI chatbot in our global business, and target more user groups through our diverse product matrix to ultimately achieve a steady growth of our global business. And we are also leveraging the technology to empower our business development and using AIGC and voice AI technology, we plan to launch and customize the social chatbot products that convey emotions and connect with users, as well as innovate more product features to enrich our product matrix while continuing to expand our commercialization model. So we will further leverage our years of experience and technology core strategy to promote the application of chatbot in our business and build AI chatbot platform providing users with the new online and more personal companionship experience, and ultimately enhancing our differentiating and competitive strength. With an increasing online audio user penetration rate, the market scale is also expanding further and we will continue to expand the core user groups in the audio entertainment sector and increase users' willingness to pay through a diverse range of operational activities and the innovative functions, promoting the growth of the user payment conversion rate and revenue."
}