{
    "symbol": "GEOS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-18 12:47:04",
    "content": " Our fourth quarter revenue grew more than 33% over last year's same period, excluding the first three quarters of fiscal year 2022. However, despite the improved Q4 performance, revenue for the full fiscal year missed last year's total by 6% leading to a net loss for the year of $22.9 million. In yesterday's press release for our fourth quarter ended September 30, 2022, we reported revenue of $25.9 million compared to last year's revenue of $19.4 million. For the 12 months ended September 30, 2022, we reported revenue of $89.3 million compared to revenue of $94.9 million last year. The 12-month period ended September 30, 2022, the segment contributed revenue of $49.1 million versus $52.3 million dollars for the same prior year period. The 12 month revenue for the segment for fiscal year 2022 was $711,000 compared to $10.2 million for the same prior year period. The increased operating expenses for the three months ended April 30, 2022 was due to a one time non-cash charge for the goodwill impairment in the company's emerging market segments, a decrease in favorable non-cash adjustment for contingent consideration related to Quantum and OptoSeis acquisitions and higher engineering project expenses. I think fundamentally in many cases it seems like in some of these conversations we're having with the oil companies, they're recognizing as we've moved further down the path towards what needs to be done that there's some loose ends on their side. It's not actual physical cash going out, I assume but it looks like we have physical cash coming in, last quarter $9.1 million cash on hand plus short term investments this quarter, $17 million again, good job, pat on the back. So if we find ourselves at the end of fiscal year '23, and we've spent all $7 million, that's likely because we've seen an increase in orders and you have to spend money to make money. The other aspect of the water meter cable and connector business, we believe that's just going to be a growth area in general as more and more smart city movements take place in the utility companies almost all of them are migrating over the course of time towards these automatically measured meters and billing processes."
}