{
    "symbol": "SWK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 09:29:05",
    "content": " Our 2022 full year revenue reached $16.9 billion, up 11% versus a record of 2021, led by the outdoor power equipment acquisitions as well as 9% organic growth in the Industrial segment, and a 7% improvement in price realization. While changes in demand are difficult to predict, our base case or midpoint of guidance assumes a decline in volume versus 2022 as we believe markets will continue to be challenged during 2023 as new housing starts are projected to decline 15% to 25% and repair and remodel activity will decline modestly year-over-year, we are also prepared to respond if revenue impacts are worse or better than our base case to ensure we appropriately manage the risks and opportunities that could arise. Our free cash flow guidance is much stronger at $500 million up to $1 billion in 2023, well ahead of net income as we drive another $750 million up to $1 billion of inventory reduction during the year. Our priorities in 2023 will continue to be aligned with our messaging over the last six months; one, strong focus on cash flow through inventory reduction to assist with ongoing debt deleveraging; two, sequential improvement in our gross margins as we drive further supply chain transformation initiatives; and three, get back to gaining market share in all major categories of our Tools & Outdoor business. Our teams around the world remain focused on executing our primary areas of long-term strategic focus, continuing to advance innovation, electrification, and global market penetration to achieve organic growth of two to three times the market growth, streamlining and simplifying the organization as well as shifting resources to prioritize investments that we believe have a positive and more direct impact for our customers and end users; accelerating the operations and supply chain transformation to return gross margins to historical 35% plus levels, while improving fill rates to better match inventory with customer demand; and then prioritizing cash flow generation and inventory optimization. Beginning with Tools & Outdoor, fourth quarter revenues were in line with last year at $3.4 billion, benefiting from a 7% improvement from price actions and an eight-point contribution from the MTD and Excel outdoor acquisitions. From a full year perspective, Tools & Outdoor achieved record revenue of $14.4 billion, driven by a 7% improvement from price actions, and 21% growth contributed by our outdoor acquisitions, which was offset by softer consumer demand and currency. Our full year 2023 inventory reduction target is $750 million to $1 billion, which will drive significant cash flow generation that will be used to pay down debt and further strengthen our balance sheet. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. On the high end of the case, I think the $1 billion becomes very achievable because you're dealing with much higher levels of demand where organic for Tools & Outdoor would probably be flat year-over-year. Your line is now open. Your line is now open."
}