{
    "symbol": "KTB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 15:07:06",
    "content": " Beginning with some highlights from the fourth quarter and full year 2022, in Q4, global Kontoor revenue grew 9%, well-above our internal forecast as shipments in the US accelerated, augmented by continued share gains in AUR growth, and profitability in the quarter was outstanding with adjusted operating income increasing 19%. And stepping back a bit, we think it's important to note, relative to pre-pandemic 2019 levels during 2022, we were able to grow revenue mid-single digits or double-digit growth, excluding proactive actions to exit our DFO fleet and lower quality points of distribution, expand reported gross margin 230 basis points compared to adjusted 2019 gross margin, even with the impacts of inflation, supply chain challenges, retailer inventory rebalancing and COVID lockdowns in China. But the combination of strong quarter-to-date POS, coupled with robust gains in our own D2C, with US comps up 20% year-to-date, gives us confidence that the Wrangler and Lee brands are healthy and well positioned in the marketplace, as we begin 2023. Please proceed with your question. Naturally, you know from a business standpoint that there's a little bit of a lag between the POS and the shipments and people are a little cautious out there right now and how we're thinking about the first year excuse me, the full year in the first half is that it will be strong in the first half domestically because we can see that right now might taper off a little bit how we set up the plan going forward. Please proceed with your question. Please proceed with your question. As we kind of indicated, Scott talked about it a little bit in his opening remarks, as you think about that the halves, really the front half is driven by US growth and tempered by international and then kind of almost flipping as you get to the back half, certainly as China reopens, more fully expect international to drive more of that back half growth and then partially offset by macro conditions, which we're taking a prudently conservative approach as we're thinking about increasing pressure on consumer demand in the US. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}