{
    "symbol": "KTB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 14:54:07",
    "content": " This is allowing us to return cash to shareholders through our superior dividend and increasingly opportunistic buybacks, which combined have returned over $270 million since the start of 2020; and to fortify our balance sheet with over $200 million of net debt reduction over the same period, ending the first quarter in a considerably stronger financial position; and to invest in our business to support future growth such as the talent and demand creation investments Scott touched on earlier; and to pursue potential accretive M&A. Please proceed with your question. But now the channel work that our team has done across the globe, the categories that we've expanded into, if you think about what's happening now globally as people go back to work and people go back to leisure, think about how we structured the company and how we're set up with people going back to leisure with our outdoor and T-shirt line, people going back to work with our denim line, which has been fantastic because consumers have now gone to a casual workwear attire which has been really important for us. And what we've controlled is our new business development, the great product that we're putting out there, the demand creation, the work that we talked about that Wrangler has done with Fender, the big campaign that we have right now with both of the brands around the globe, the work that we just did with Smiley from the collaboration. Please proceed with your question. Please proceed with your question. In terms of the full year, in our prepared remarks, we said up to 100 basis points previously of structural margin gains, given the first quarter given what we're seeing now the fact that we've got raw material input costs really projected to impact the 2022 P&L that are largely finalized. So, certainly that's -- we're fortunate to be able to offset with the strength in the US, that topline impact from China in Q2 and hold our prior guidance of $640 million to $650 million in the second quarter. Please proceed with your question. Please proceed with your question."
}