{
    "symbol": "KTB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 13:00:47",
    "content": " As we've stated consistently, Kontoor is not immune to these factors and we attempt to accurately reflect these impacts into our outlook, which I will cover in a bit, but I also know our company is better positioned than we have ever been to continue to drive competitive separation and I am extremely proud of the organization's overall ability to once again deliver profitability and earnings above our internal expectations while also positioning the company for more sustained, profitable long-term growth. These new categories also provide permission to play in new channels of distribution when combined with elevated product design and enhanced demand creation, the Lee and Wrangler brands are increasingly showing up in premium specialty, western, sporting goods and outdoor specialty, further diversifying from the core distribution and as we drive closer connections with our consumers, there's no more important channel than the continued evolution of our own D2C in digital platforms. It was fantastic to see folks in our new environment and I was able to commend them on their really storm quarter as Europe revenue increased 27% year-over-year, but we also spent a great deal of time on the go-forward strategy, understanding that the near term will be confronted by the inflationary pressures I discussed earlier. Please proceed with your questions. You saw that we tweaked down the top line a little bit here from a currency standpoint and some of the things that are happening in China, the lockdowns have happened, they aren't opening as fast as we thought we wanted them, but we are seeing some acceleration in Q4 and really what we're seeing, it's a multitude of different things that we've been working on for a long time, but it's the continued strength in our POS so we get, visibility to that and see that. Please proceed with your questions. The final sort of impact I think Mauricio, that we're seeing in the, in the fourth quarter is the FX impact that's going to continue to be a headwind for us on our margins, but again, those are the three primary drivers that are incremental to what we've seen to date with downtime being the most pronounced. Please proceed with your questions. But I think the key point to really take away again, as I indicated in the prepared remarks, we have a strong bias for cost control but you've also seen from us at contour, we will continue to invest in our brands and capabilities. We've talked in the past will, as you know about the lag that takes place from when you see spikes in the commodity markets and it takes a couple of quarters to work through the P&L and certainly cotton as an input cost spike in Q2, further, we expect that manufacturing downtime to continue into the front half of '23 as we work to address, these elevated inventory levels thoughtfully, I would say from a downtime perspective, it's fair to think about the impacts of downtime being most pronounced in Q4, as I already indicated. Please proceed with your questions. But I think the single most important thing, and I said it a little bit in my commentary about the addressable commentary about the addressable market and how big it's just that we've just got a, a small foothold, relative to the t-shirt business, relative to the outdoor business, relative to the work we're business, we have got really big opportunity and expansion in front of us and ahead of us, and the teams are pretty excited about it and create some great product to go ahead and do that. Please proceed with your questions."
}