{
    "symbol": "APRN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 10:59:05",
    "content": " So we're looking at ways that we can take some of those additional channels that we're using, including the Amazon announcement and our new Costco gift card sales channel to increase our customer numbers going forward by converting them into subscribers and/or continuing to expand the nonsubscription business. I do think that you're going to see a bit of a difference in seasonal impact, partially because we are seeing shifts in travel trends, but also partially because we have introduced more of these seasonal and special occasion boxes, which have driven a lot of our seasonal growth in the past, and we now have new offerings that we didn't have in previous years. So in the way that we're approaching our marketing spend, by reducing them into the performance channels, we're able to -- sorry, by reducing some of the upper funnel brand spend because we've been able to build such a strong audience and we've been able to elevate the brand equity during the last three quarters. But an important aspect of this, too, is what we talked about of really addressing our variable margin and really addressing the efficiency of the marketing spend because that's where you're going to see the biggest opportunity from an ability to make cash go longer. A majority of what you're seeing in the ability to create revenue strength in the quarter compared to year-over-year, meaning, in other words, compared to the customer number and also year-over-year comes from the additional product offerings and continued pricing initiatives. So I think that part has been an advantage to us, and that's part of what you're seeing the evidence in the continued record AOV and revenue per customer that we were able to achieve this quarter of people are understanding about the price increases, and we were very careful to make sure that we were remaining in line with competitors, but also a good value for the quality of ingredients in the box."
}