{
    "symbol": "NNBR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 14:56:05",
    "content": " Our presentation today will contain forward-looking statements regarding sales, margins, input cost inflation, supply chain constraints, the impact of the automotive semiconductor chip shortage, foreign exchange rates, cash flow, tax rates, acquisitions, synergies, cash and cost savings, future operating results, performance of our worldwide markets and the impacts of the coronavirus or COVID-19 pandemic and the Russian-Ukrainian conflict on the company's financial conditions and other topics. Compared to the prior year period, sales increased 1.8% and to $125.4 million despite ongoing supply chain interruptions and the resurgence of COVID in China. For the quarter, unrecovered inflation impacted our second quarter results when compared to the prior year period by approximately $3 million to $4 million. Price negotiations with many of our customers continue, and in fact, approximately $1 million of pricing recoveries were concluded subsequent to the end of the second quarter and will be realized over the remainder of the year. Lower operating results, along with increased investments in working capital to support operations and mitigate current supply chain challenges, resulted in free cash flow use of $2.8 million. Year-to-date, through the second quarter, we have secured new business wins with peak annualized sales of approximately $23 million as our efforts of our revitalized team have begun to generate results. This growth was partially offset by a 0.7% decrease in revenues in the Mobile Solutions business versus the prior year, driven by the factors Warren noted and a delay in material inflation recovery as well as unrecovered inflationary, labor and other costs. Non-GAAP adjusted EBITDA for the second quarter was $10.9 million or 8.7% of sales, down from $13.4 million or 10.9% of sales a year ago. Although we were able to successfully pass through the majority of inflation on material to customers through price increases, the total impact of inflation on manufacturing supplies, MRO, utilities, unrecovered material and labor amounted to approximately $3 million to $4 million during the second quarter when compared to the prior year. Profitability decreased compared to the prior year period driven by inflationary costs not fully recovered through pricing actions, variable cost inefficiencies associated with supply chain interruptions, uneven customer ordering patterns and labor constraints caused by COVID-19 pandemic-related interruptions. Our full year 2022 outlook now reflects the following: net sales in the range of $510 million to $525 million compared to the previous range of $515 million to $540 million, adjusted EBITDA in the range of $51 million to $57 million compared to the previous range of $57 million to $63 million and free cash flow in the range of breakeven to $5 million compared to the previous range of $14 million to $20 million. As we have disclosed when providing our original 2020 outlook, we assume no significant impact from the semiconductor chip shortage in the second half of 2022 and no significant production disruptions due to the pandemic or the Russian-Ukraine conflict, all of which have impacted us in the second quarter and are expected to continue to disrupt supply chains and OEM automotive volumes through the balance of 2022."
}