{
    "symbol": "NNBR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 05:01:08",
    "content": " Our presentation today will contain forward-looking statements regarding sales, margins, input cost inflation, supply chain constraints, the impact of the automotive semiconductor chip shortage, statements regarding the planned management transition, foreign exchange rates, cash flow, tax rates, acquisitions, synergies, cash and cost savings, future operating results, performance of our worldwide markets and the impacts of the coronavirus pandemic and the Russian-Ukrainian conflict on the company's financial condition and other topics. These pro forma adjustments would increase Power Solutions' 9-month operating income and adjusted EBITDA to $23.2 million and $25.3 million, respectively, on sales of $148.5 million. After considering these pro forma adjustments for cost reduction initiatives underway, Mobile Solutions' 9-month pro forma sales and adjusted EBITDA would be $228.2 million and $36.2 million, respectively. Year-to-date through the third quarter, we have secured new business wins with peak annualized sales of approximately $31 million. Moving to Slide 14, free cash flow was a use of $4.4 million in the third quarter of 2022, compared to a free cash flow use of $3.7 million in 2021. We expect working capital to reduce by approximately $9 million in Q4, driven by inventory reduction initiatives and lower accounts receivable due to the collection of a $2 million receivable related to a customer settlement agreed to in 2021 and normal Q4 sales seasonality. We expect that these expenditures will be approximately $3 million in the fourth quarter as we make the final payment on CARES Act, FICA deferrals and incur costs related to the previously discussed facility closures. While we will incur some additional facility closure costs early in 2023 and will pay $0.8 million in 2023 per the terms of the agreement to settle breach-of-contract claims regarding the sale of products by us in 2016 that was agreed to earlier this year, the majority of cash outflows for these items are behind us and 2023 cash outflows for these items are expected to be significantly lower than 2022. Net debt at the end of the third quarter was $151.5 million, versus $146.3 million in the second quarter of 2022, an increase of $5.2 million. These impacts were partially offset by higher profits due to improved volumes at our China joint venture which reported 9-month sales of $76.4 million, up 11.7% from 1 year ago. Additionally, operating performance of our aerospace and defense business did not meet expectations due to labor availability, higher labor costs and lower customer volumes, especially at our Irvine, California, site, where adjusted EBITDA declined $800,000 from our previous outlook. Our free cash flow outlook is driven by the factors previously discussed and includes nonoperating cash flows for the tax on the sale of Life Sciences, repayment of the FICA deferral and litigation, severance and facility closure costs which in total represent approximately $8 million. I would tell you our expectation is that we don't think that it's going to be significantly down from where we are today, at least what we're seeing, simply because we've been operating at lower levels so far in 2022 as a result of the semiconductor chip shortages and supply chain interruptions which impacted us for the majority of the first half of this year."
}