{
    "symbol": "NNBR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 12:11:03",
    "content": " Before we begin, I'd like to ask you to take note of the cautionary language regarding forward-looking statements contained in today's press release, supplemental presentation and in the Risk Factors section of the company's annual report on Form 10-K for the fiscal year ended December 31, 2021, the company's quarterly report on Form 10-Q for the 3 months ended September 30, 2022, and when filed, the company's annual report on Form 10-K for the fiscal year ended December 31, 2022. Our presentation today will contain forward-looking statements regarding sales, margins, inflation, supply chain constraints, including semiconductor chips, foreign exchange rates, cash flow, tax rate, acquisitions, synergies, cash and cost savings, future operating results, performance of our worldwide markets, the impact of the coronavirus pandemic and the Russia-Ukraine -- Ukranian conflict on the company's financial condition and other topics. We continue to maintain strong liquidity at $48.1 million, an increase of $3.4 million from Q3 of 2022 as we generated $6.4 million of free cash flow in the fourth quarter, which was in line with our outlook despite profitability being lower than expected. However, during 2023, we have increased our prices within Mobile Solutions to recover nonmaterial inflation from 2022, and we enacted a 5% plus price increase in Power Solutions to recover expected 2023 inflation on incoming purchase orders not tied to a long-term supply agreement. Year-to-date through the fourth quarter, we have secured new business wins with total estimated sales of $131 million through 2026 as the efforts of our revitalized team have continued to generate results. Compared to the prior year period, sales increased 6.9% to $118 million, driven primarily by price and volume increases, partially offset by foreign exchange headwinds given the stronger U.S. dollar. From a profitability standpoint, net price inflation was approximately $3 million unfavorable year-over-year comprised of unrecovered inflation of approximately $1 million in the current year and the impact of a customer pricing settlement in the fourth quarter of 2021 of $2 million. Profitability decreased in Mobile Solutions compared to the fourth quarter of 2021 due to operational inefficiencies associated with new business launches in our Mexico facility, price increases not fully recovering inflation, and pricing settlement recorded in the prior year and reduced overhead absorption with lower volumes. We are introducing our outlook for 2023, which reflects the following: net sales in the range of $525 million to $555 million, an increase of 5% to 11% compared to 2022 sales of $498.7 million. Our sales growth will be driven by both increased volume and improved pricing, partially offset by foreign exchange and includes an expected $9 million decrease in aerospace and defense sales with the closure of our Taunton and Irvine facilities. And so far, through the first quarter of this year on an annualized rate, I think we've closed out $8.6 -- $8.5 million, $8.6 million of annualized price increases on the Mobile side. So as you think about your pricing actions and the challenges on those launch programs and the costs incurred with that and how you expect volume in Mobile to roll out this year, is it fair to think that you can get back to the 2021 level in terms of segment margin versus the 2.5% that you put up in 2022?"
}