{
    "symbol": "SCPL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 11:48:18",
    "content": " We feel very good about the spend that we did in our core games, especially performance and Quick Hit, Jackpot Party; but in the Alictus products, our Alictus new launches, it became much tougher to scale these games, which is the strategy switch that we talked about during the prepared remarks, where the Android market did continue to perform well and we did continue to see great ROIs. Going into Q3, we had made some good investments in our three larger games around our SciPlay engine that weâ\u0080\u0099ve really started seeing the fruits of, starting early in Q3, especially Jackpot Party, Quick Hit where we saw big jumps in the engagement numbers, where the days per week not only came back but they actually rose a little bit. In Q3, we actually have the bulk of it running because itâ\u0080\u0099s when the mass of Americaâ\u0080\u0099s Got Talent is, itâ\u0080\u0099s when the real showing of the Wendy Williams happens, and also the cup races that weâ\u0080\u0099re sponsoring inside of NASCAR, so a majority of the spend does happen in Q3 of this year and is going to be worth around 400 to 500 basis points to the AEBITDA margin. As they start coming down and weâ\u0080\u0099re able to maintain our LTVs through the engagement that weâ\u0080\u0099re driving with the SciPlay engine and the investments weâ\u0080\u0099re making in ad tech, which allows us to bring in better users, this could be an opportunity for us to even further spend into it as long as weâ\u0080\u0099re able to get the metrics that we have always talked about, that we internally say this is the right ROI for a spend. We have a little bit of inflationary CPI growth that happens, but because weâ\u0080\u0099re not over-spending into it, I believe our growth in CPI is less than what the overall market is seeing because as you would know in particular, if you spend a million dollars you get one CPI, but if you spend $3 million on that same game, your CPI rises significantly because youâ\u0080\u0099re over-bidding on more people. In Q2, we set an all-time record with 9.4%, and beginning of Q3 weâ\u0080\u0099ve actually seen an increase in that as weâ\u0080\u0099ve released some new features inside of Jackpot Party and Quick Hit that are really causing not only more people to reactivate and start paying again, but itâ\u0080\u0099s also converting first time payers. Well, weâ\u0080\u0099re not breaking it out today, but we are holding very firm, if you heard the question earlier, that the breakdown in revenue gain is the same that we guided to earlier in the year, which is we would outperform the social casino market, which means our core business would grow approximately 5% and then the rest of it would come from Alictus. Weâ\u0080\u0099re also starting to look at streaming TV thatâ\u0080\u0099s got--you know, theyâ\u0080\u0099re now starting to put commercials in and the commercials are starting to get very high viewership, so I think what I could say about our growth team is theyâ\u0080\u0099re hungry to go find the right customers and bring them into our world, so our games can entertain them and they can be long term customers of SciPlay."
}