{
    "symbol": "SCPL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 14:33:04",
    "content": " In the third quarter, we executed and outperformed, delivering strong revenue growth of 17% year-over-year and an all-time revenue record, maintained strong AEBITDA margins, performance aligned with our goal, and we continue to invest in our core capabilities, which delivered our highest returns and helped us fuel this performance. During Q3, we continued to enhance monetization and achieved quarterly records across several of our key metrics: record ARPDAU of $0.80, record payer conversion of 9.7%, record average monthly paying user of $600,000, record 10 consecutive quarters of average monthly revenue per paying user above $90. And we've seen really good progress with the release of the newest game, Barbershop 3D, which has -- Fade Master, which has really hit the ground running, even spent a little bit of time #1, which leaves us very, very positive into what we could see going into next year as we continue to launch a couple of games each quarter. As we start to move forward and we start to feel like the platform is a stable platform that we're able to start growing, then we're definitely going to look at how do we improve the experience and make our DTC platform the greatest experience that we possibly can, whether or not has unique features to that, whether or not it's unique content that is only on the DTC or whether or not that's just a better experience over time. Two years ago, as you would know, being in -- is involved in this space as I am, it would not be unusual that someone would launch a game and spend $3 million to $5 million a month and really try to ramp that game very quickly in the first 1 to 4 months, even if it was unprofitable, they would still ramp it. And so I think what you're going to see out of new games going forward is less of a straight up, but more of a metered ramp over time because of the cap to buying new users on that platform. So instead of seeing like $2 million 1 quarter and 8, 7 or 9 the next, you're going to see more of like 2.5, 2.5, 2.5, 2.5 because we do believe that these are channels that have untapped players that we're going to be able to bring into our ecosystem and have them as a game of choice for their entertainment needs. We spent the last couple of quarters doing some investments inside of Goldfish to make sure that it is ready for our SciPlay engine and being able to really optimize live ops and then make the tweaks needed to the meta features, in order to push the boundaries, and we feel very excited about the growth of DFC going into '23."
}