{
    "symbol": "RGCO",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-10 12:23:04",
    "content": "  Paul Nester: Good morning, and welcome to RGC Resources 2023 First Quarter Earnings Call. This presentation does contain forecasts and projections, and Slide 1 has our forward-looking statements. As usual, we will review operational and financial highlights from the first quarter, talk about our fiscal 2023 outlook, and again, we'll be happy to take questions at the end of the call. You may remember, as we've discussed extensively going back to 2020 about the moratorium that was imposed on utility disconnects and the effect that, that had on our customer counts in March of 2022, we were able to resume our collection processes for nonpay turnoffs. We had a good first quarter, adding new services and main extension, another 1.1 miles of main. Jason, walk us through our delivered volumes, and financial statements and capital spending for the first quarter. Our first quarter delivered volumes were up approximately 620,000 decatherms compared to the first quarter of 2022. Additionally, we continued to benefit from an increase in transportation and interruptible volumes due to our single multi-fuel customer that has continued its higher natural gas utilization during the quarter. For the quarter, our operating income of $5.544 million was up from the previous year, approximately $166,000. Operating revenues adjusted for normal weather were up, while nongas operating expenses for the quarter exceeded the prior year due to higher expenditures for contracted services, bad debt expense and personnel costs. Interest expense for the quarter was higher compared to last year due to increases in rates on our variable rate debt, primarily in our midstream affiliate. Overall, we saw a reduction in net income of approximately $329,000 compared to the first quarter of last year. On an earnings per share basis, we recorded $0.33 per share, which was down about $0.10 per share, and that was a result of the dilutive effect of the equity offering, which occurred in March of 2022 and the small reduction in net income. The comparison of our 12-month operating results ending December 31, 2022, is difficult due to the impact of the impairments that we recorded again in our midstream affiliate relative to the Mountain Valley Pipeline. If you move to Slide 6, you'll see our underlying net income, which removes the after-tax impact of those impairments and reflects the underlying net income of $8.851 million. This result is down $112,000 compared to the 12 months here in 2022. We'll discuss a little later the nongas rate case filing, which we filed in early December, which we expect to alleviate some of those cost pressures through the remainder of the year. If we transition on to Slide 7, you'll see that we experienced strong investments made by the Roanoke Gas utility for utility property in these first 3 months of the fiscal year. Overall, we invested approximately $7.5 million in utility property, and that was up compared to the first quarter of last year by about $1.8 million. I'm really happy with our Roanoke Gas operation and the overall quarter we had, but just incredibly thrilled and proud of the efforts in mid-December leading up to Christmas with the extreme cold weather event that we had in our part of Virginia here. So as we look at our 2023 forecast, we will look at the capital investment projection for the full year. We'll talk about our earnings per share projection, and then Tommy will conclude with a nice update on our RNG facility project. You can see, we are still leading our capital investment with $6.8 million of SAVE spending. Tommy is going to talk about this in a minute, but we -- that's renewal spending essentially. In other words, we're still renewing pre-1973 adelaide plastic pipe. It's been a very good system, but it's time for us to modernize and get a new tool there, and our teams in our finance area and IT areas and operations areas are working through that project right now. We're going to invest about $1.7 million in the Carilion and Virginia Tech, Carilion Medical School area to support the growth. And what those are is, our general assembly over the last 5 years, in particular, has resumed funding, if you will, for important and necessary road infrastructure projects. So again, those are good projects, good for the community in terms of transportation, but also good in terms of making our system safer and more reliable. As we mentioned in our earnings call from last quarter, the company did file for a rate increase with the Virginia Commission in December of 2022. We put those rates into effect on an interim basis on January 1, 2023. We requested an increase in nongas base rates of approximately $8.55 million, of which approximately $4.500 million is being recovered through the SAVE. Since we are now collecting costs associated with our SAVE plan through interim rates, we did terminate our SAVE Rider effective January 1. As Paul mentioned, we continue to spend on renewals, but those costs will be recovered through our base rates. Since early winter, natural gas commodity prices have been declining and are currently below $2.50 per decatherm for the prompt month. We started incorporating these lower gas costs in our gas rates on January 1, and again, February 1. As a result of these changes or these adjustments, customers are now experiencing an overall decrease in their bill of approximately 19%. With the roll-in of our SAVE year capital spend of approximately $22 million, our total net rate base coming out of the rate case will be approximately $190 million. And just as a reminder, we last filed a nongas base rate -- or for a nongas base rate increase in October of 2018, which the commission final ordered in January of 2020. We're on Slide 11, and we haven't changed our EPS guidance from the last quarter for fiscal 2023. And again, as a reminder, fiscal 2022, as Jason mentioned earlier, is adjusted for the noncash impairment loss recorded in the midstream subsidiary. For 2023, we are projecting a $0.20 per share loss in the midstream subsidiary, primarily due to interest costs, which have increased greatly due to the higher interest rate environment that we all presently exist in and the lack of offsetting operating income from the Mountain Valley Pipeline. Roanoke Gas, as you can probably tell from our update, is on track to have another solid year, certainly pending the outcome of the rate case and other general economic factors. We'd like to conclude with what's really one of the great stories probably in the history of this company, and it will probably get greater as we continue to move toward ultimate project completion and end service, but Tommy, give us an update on what's happening with our renewable natural gas facility project. We're on Slide 12, and we've been talking about the RNG project for some time now, and it has finally come to fruition. We're working on the administrative approval of the rates and tariff for the project, and we expect to have everything in place to start billing March 1. Construction has been progressing largely on time and on budget, and we expect that the project will go into service in March as well. As a company, we've been working on this project for about 2 years, and we are very pleased with the outcome, and I believe the quote from the commission's order summarizes the project well. And the commission in their order stated, Roanoke Gas project has the potential to achieve a rare combination of increasing local fuel supply, reducing greenhouse gas emissions and increasing utilities profit while also lowering customers' rates. It is, in fact, the first such approval of a project in the state of Virginia by gas utility, and we haven't done the finite research, but possibly, on the East Coast of the United States. Our partner on the project, the Western Virginia Water Authority, has done a fantastic job, and we're so pleased to have them as a partner on the project and look forward to turning the switch on Tommy here in about 45 to 60 days. And in fact, January -- we're closing the books for January now, but January was approximately, what, Jason, 240 heating degree days warmer than normal, one of the warmest January on record. So they're not -- these are not good gas days, Mike, but just construction days. Mike, we've been contacted by a couple of organizations that are looking at RNG projects in the area. Others want us to run pipes to interconnect them, and we're evaluating all that and make a decision based on the economics once we have to make that decision. So there's been some move, Mike, in the last, I would say 2 years, of course, primarily by the big electrics to site, some solar facilities in this region. But you're right, those pieces of ground are fairly precious in our area due to the mountainous terrain. But Tommy's good comment a moment ago that now that we're coming out of this RNG project, it's going to give us some time and opportunity to explore some of those other options. But like we've seen with the Mountain Valley and other infrastructure projects, the solar projects in this area that are being proposed by our electric provider are facing stiff opposition to get permitted and cited. So back to the permitting reform that was percolating in the United States Congress in the fall of 2022, there's still a need for that. It's not just for Mountain Valley Pipeline and other natural gas infrastructure, but even renewable infrastructure. And there's no question to be able to complete the project in a timely fashion is, I think, of utmost importance of this region and to our country at large. And to get the right of way restored and also the most environmental responsible thing, so we're doing everything we can to advocate and help push that along."
}