{
    "symbol": "EVRG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 12:39:04",
    "content": " We know the importance of consistent execution and we recognize that 2023 falls short of the midpoint relative to our long term targets, reflecting regulatory lag in our Kansas jurisdiction and our commitment to a five-year rate case stay out as part of the merger, but we remain confident in our ability to deliver annual 6% to 8% adjusted EPS growth through 2025 off of the 2021 baseline, and we are reaffirming that target today. As shown on this slide, the year-over-year increase in fourth quarter EPS was driven by the following: first, an increase in heating degree days partially offset by lower demand drove a net $0.08 increase in EPS compared to the fourth quarter of 2021; higher transmission margins resulting from both our ongoing investments to enhance our transmission infrastructure and higher volumes drove a $0.04 increase; and a decrease in O&M versus the fourth quarter of 2021 drove an $0.08 in adjusted EPS for the quarter. These positive drivers are expected to be partially offset by the following: increased D&A of $0.16 as we continue to invest in infrastructure and execute our capital plan, increased interest expense of $0.21 due to higher debt balances at higher rates, and $0.02 of other items, primarily driven by lower year-over-year earnings from a combination of the expiry of a wholesale contract in Kansas and the one-time true-up of Uri carrying costs in 2022 which were partially offset by higher expected COLI proceeds. As you know, there are some elements of lag in our Kansas jurisdiction and itâ\u0080\u0099s been five years since our last rate case, so as we advance the rate case this year and rates go into effect at year end, that will help address the under-earning that weâ\u0080\u0099re having on many investments that weâ\u0080\u0099ve made over the past five years, and thatâ\u0080\u0099s the biggest factor that helps get us back on track. Itâ\u0080\u0099s a great question, Shahriar, and weâ\u0080\u0099re not introducing 2026 or beyond guidance today, as you know, but the drivers are, as you know, over time weâ\u0080\u0099re going to be really related to rate based growth, how we fund that, and weâ\u0080\u0099ve got a strong balance sheet to support our investments, and of course our ongoing cost savings. I think the better way to think about that is weâ\u0080\u0099ve just rolled from a partial year to a current year, so now weâ\u0080\u0099re kind of at current rates in that regard, so I would not--we donâ\u0080\u0099t see a step function going forward into yet another increase in rates over time, and itâ\u0080\u0099s really just the increasing debt rather than increasing rate exposure at the end of the day, thinking about moving from â\u0080\u009923 and forward. I think all my questions have been answered, but if I can just--I was just trying to sum up, if I may, so you said youâ\u0080\u0099re going to have another $100 million of lower savings between now and 2025, if I see the chart, and if Iâ\u0080\u0099m right, thatâ\u0080\u0099s nearly about $0.40 or $0.45, so half of them came this year, if Iâ\u0080\u0099m right, in 2023, because you are showing an O&M decrease or benefit of $0.20. On the O&M front, just to clarify that youâ\u0080\u0099re right - you know, if I incorporate the $60 million, and thatâ\u0080\u0099s roughly what that â\u0080\u009922 to â\u0080\u009923 reduction in O&M equates to, I think I even mentioned that when I was going through the slides, that puts us--I think we came out of â\u0080\u009922, and you can infer--you can go through our disclosures, about $1.74 billion of non-fuel O&M in â\u0080\u009922, so that means with that $60 million of savings, youâ\u0080\u0099re at $1.14 billion."
}