{
    "symbol": "EQC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 14:44:04",
    "content": "  Operator: Good morning, and thanks for joining this call to discuss Equity Commonwealth's results for the fourth quarter and full year ending December 31, 2022, and an update on the company. For the quarter, funds from operations were $0.21 per share compared to $0.01 per share in the fourth quarter 2021. Growth in FFO and normalized FFO was largely the result of a $0.20 per share increase in interest and other income as well as a $0.01 per share increase in same-property cash NOI. Same-property NOI was up 14.5%, and same-property cash NOI was 14.9% higher compared to the fourth quarter 2021. For the full year 2022, funds from operations were $0.41 per share compared to a $0.06 per share loss for the full year 2021. The growth in FFO was largely the result of a $0.35 per share increase in interest and other income, a $0.06 per share decrease in G&A expense and a $0.05 per share increase in same-property NOI. The growth in normalized FFO was largely driven by a $0.36 per share increase in interest and other income and a $0.06 per share increase in same-property cash NOI. Same-property NOI was up 17%, and same-property cash NOI was 19.1% higher compared to the full year 2021. Change in our cash balance during 2022 was driven by the Fed's rapid pace of interest rate increases, our common distribution in October and our share buyback activity. Currently, we're earning roughly 4.75% on our cash balances. In October, we paid a distribution to common shareholders totaling $111 million or $1 a share. With respect to share buybacks, during 2022, we repurchased 6.1 million shares at a cost of $155 million at an average dividend adjusted price of $24.64. Since we began buying back stock in 2015, we have repurchased a total of 22.4 million shares or roughly 17% of our float as of 2014 for an aggregate of $595 million or an average dividend adjusted price of $21.73. In terms of how it's changed since our last call, I'd say not much. Three months or so isn't enough to see much of a difference, especially at this time of year, if you're thinking about things slowing down end of 2022 and taking some time to ramp up in 2023, which is the normal rhythm in the investment market. In terms of kind of the opportunity set overall, hurdles, et cetera, as we've discussed many times, it's really about the risk we're taking. As we focus harder on 2 sectors, which we have discussed previously, industrial and single-family residential, even more so build-to-rent communities, and we just like those, given our history with manufacturer housing parts and the ability to work the real estate. With the long-term strong fundamentals in those sectors, we view those, absent a specific story, perhaps to be less risky and warrant a lower return as we invest, compared to, while we don't redline anything, it'd be a higher hurdle for us to invest in something like office, just given the challenges in that space and the uncertainty going forward. People are struggling with pricing, and we also are looking to whether there's a specific catalyst in any given opportunity that might give rise to a transaction. I know there's been some news in the market about 1 big NTR in particular who got a cash infusion, I mean, and we've seen them sell some assets here as they've bought some recent portfolios. And I get that pricing is still fluid here, but the property types that you guys are really interested in, I mean, I don't know that cap rates are going to gap out, given the capital chasing them and the long-term fundamentals. I mean, I'm just trying to figure out if this is a waiting for the best pitch down the middle that you guys can slam out a stadium or if it makes sense to start getting some singles and doubles. And then hopefully, as you have some momentum on capital deployment, some of those down-the-middle pitches come where you can put it out there but at least get the ball rolling, get the market knowing that you are serious about putting the capital out the door. What we've been looking for is the foundation for a long-term business with attractive fundamentals that can grow consistently, where we can grow the business to provide liquidity, to provide opportunity for our team. We just need a catalyst, most likely the debt capital markets, to provide a catalyst to a seller who can't refinance, doesn't have the equity to refinance, needs someone to come in and help them solve a problem. I'm just saying, you guys are kind of cutting to almost a skeleton crew, so there's not a ton...\n No, there's still plenty of muscle here. We're constantly evaluating the use of shareholder capital for a number of things, one of which is a buyback."
}