{
    "symbol": "QRVO",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-02 19:24:04",
    "content": "  Operator: Greetings, and welcome to the Qorvo Second Quarter 2023 Conference Call. Hello, everybody, and welcome to Qorvo's fiscal 2023 second quarter earnings conference call. In today's release and on today's call, we provide both GAAP and non-GAAP financial results. During our call, our comments and comparisons to income statement items will be based primarily on non-GAAP results. For a complete reconciliation of GAAP to non-GAAP financial measures, please refer to our earnings release issued earlier today available on our website at qorvo.com under Investors. Joining us today are Bob Bruggeworth, President and CEO; Grant Brown, CFO; and Dave Fullwood, Senior Vice President, Sales and Marketing; as well as other members of Qorvo's management team. As we indicated on our call, Qorvo's business is now organized into three segments: high-performance analog, connectivity and sensors and advanced cellular. In high-performance analog, revenue during the September quarter was broad-based with strength primarily in defense and higher power applications. In connectivity and sensors, headwinds in consumer markets and related inventory drawdowns impacted revenue as expected, even as favorable design activity was diversified across a growing list of customers and product categories. As a reminder, connectivity in sensors combines the connectivity and sensors businesses previously split between mobile and IDP. Lastly, in Advanced Cellular, we enjoyed a large customer ramp during the quarter. While unit volumes were weak in the Android ecosystem, we were encouraged by content and integration trends across our Android customer base in their 5G designs. With our new operating structure and global sales organization, Qorvo will capitalize more quickly on opportunities across markets and customers to support growth. We will leverage our core strengths in system solution design, semiconductor manufacturing, advanced packaging technologies and deep relationships with customers and suppliers to help enable a world that is more efficient, more secure, and more connected. In our Performance Analog, Qorvo signed an agreement with SK Siltron for a long-term supply of silicon carbide wafers. Our expanded relationship with SK Siltron, will further diversify and strengthen our supply base and help support continued growth in our power device business. For power management markets, we introduced the highly compact power management IC designed to enable reconfigurability and reduce our customers' time to market and space-constrained applications, including home automation and networking systems. In Connectivity and Sensing, we achieved Matter 1.0 certification and commenced shipments of matter development kits featuring concurrent connect technology to simplify the design of IoT gateway and connected devices. We broadened our smart home product portfolio, leveraging our ultra-wideband and matter system solutions and we expanded our ultra-wideband design engagements, serving enterprise applications, including indoor navigation. We expanded connectivity and sensing design wins supporting top-tier automakers across a range of applications, including infotainment, connectivity, secure car access and EV smart interiors. In WiFi, we secured a broad range of WiFi 6 and WiFi 6E design wins in support of 2023 platforms and launched 5 gigahertz and 6 gigahertz filters for European band WiFi 6E and WiFi 7 applications. In biosensors, we launched commercial trials of our COVID-19 diagnostic test platform with multiple retail healthcare outlets, and we began production of flu A/B cartridges for clinical trials in support of National Institutes of Health Initiatives. In Advanced Cellular we increased shipments of Phase 7 LE solutions while securing additional design wins, including low-band, mid-high band and ultra-high band integrated placements across multiple smartphone OEMs. We commenced our first production shipments of our high-performance MEMS-based antenna solutions, and we expanded our MEMS customer engagement to include top-tier smartphone OEMs. At a Korea-based smartphone OEM, we expanded our content opportunity by securing our first Low-Band PAD win in their flagship smartphone. Lastly, we introduced a highly integrated Mid-High-Band PAD combining main path and diversity receive content. We will be sampling this product to customers in the first half of calendar '23, and we expect design wins to follow in support of future cellular architectures. Across Qorvo's business in high-performance analog, connectivity and sensors and advanced cellular, Qorvo's markets are leveraged to multiyear secular trends like electrification, sustainability and connectivity. We are at the forefront of advances and defense radar and comms, electric vehicles, battery power tools and appliances, wireless and wired infrastructure, smart home, automotive connectivity, precision location and advanced cellular architectures. We are a technology leader, and we provide best-in-class products to a growing base of customers. In the near term, the Qorvo team is performing exceptionally well as we navigate ongoing weakness in our end markets. At the same time, we are continuing to drive process and product development and have accelerated our efforts in support of future growth. Recent process development efforts include the introduction of Qorvo's next-generation SAW technology, which extends the range of our SAW filter portfolio to cover higher frequencies. Recent product developments also include our recently introduced mid-high band pad, combining main path and diversity receive content. As we have said previously, next-generation protocols continue to require higher performance content and customer architectures continue to favor higher levels of integration and functional density. As a reminder, our references today will be to our 3 new operating segments. High Performance Analog or HPA, Connectivity and Sensors Group, or CSG, and Advanced Cellular Group or ACG. In our upcoming 10-Q, we will provide historical financial information, which has been retrospectively adjusted to reflect these new operating segments. Revenue for the second quarter of fiscal 2023 was $1.158 billion, $8 million above the high end of our guidance. HPA revenue of $228 million was up 8% sequentially and 47% year-over-year, driven by strength in defense and non-consumer related power products, including silicon carbide. Connectivity and Sensors revenue of $143 million was down 6% sequentially and down 19% year-over-year due to weaker consumer electronics spend, primarily for WiFi-enabled products. Finally, advanced cellular revenue of $787 million was up 17% sequentially, representing a strong seasonal ramp and year-over-year growth at our largest customer, but down 15% year-over-year reflecting lower smartphone unit volumes within the Android ecosystem. On a non-GAAP basis, gross margin in the quarter was 49.2%. Non-GAAP operating expenses in the quarter were $233 million, $7 million lower than our guidance due to OpEx discipline, the timing of product development spend and lower employee-related expenses. Versus last year, operating expenses were up $10 million primarily related to additional headcount and higher design and development costs associated with our power management and ultra-wideband businesses. In total, non-GAAP operating income in the quarter was $338 million or 29.2% of sales. Non-GAAP net income was $276 million, representing diluted earnings per share of $2.66. Capital expenditures were $47 million, and we repurchased $160 million worth of shares during the quarter. Today, we announced that our Board of Directors has authorized a $2 billion share repurchase. This authorization will replace the prior authorization, which had a remaining balance of approximately $350 million as of October 1. The rate and pace in which we repurchased shares is based on our long-term outlook, low leverage, alternative uses of cash and other factors. As of quarter end, we had approximately $2 billion of debt outstanding with no near-term maturities and $914 million of cash and equivalents. Our current view of the second half of the fiscal year reflects ongoing weakness across end markets, primarily in consumer-related areas as well as a more acute inventory correction at our Android smartphone customers than was previously predicted. We expect this will mark the low point in our Android-based customer revenue and in the March quarter, we continue to project Android base revenue will grow sequentially. At the volume levels assumed in our guidance, we expect our inventory position to remain elevated, but improved by the end of the fiscal year as we undership normalized demand and reduced factory utilization. Simultaneously, we are cutting costs in our factories to offset the impact from lower volumes. Unabsorbed fixed costs will impact gross margin in the second half, and we currently expect non-GAAP gross margin for the full fiscal year to be approximately 47%. We project non-GAAP operating expenses in the December quarter will be down approximately $5 million to $7 million sequentially, reflecting continued cost discipline across the organization and lower variable compensation, offset by continued investment in growth areas. Below the operating income line, other expense will be approximately $15 million, reflecting the interest paid on our fixed rate debt offset by increasing levels of interest income earned on our cash balances, along with other items. Our non-GAAP tax rate for the balance of the fiscal year is expected to be between 14.5% and 15% due to the absolute level and geographic mix of pretax profit, including FX-related gains within high tax jurisdictions as well as the impact of a U.S. tax law change related to R&D capitalization, among other factors. As an example, in our Richardson facility, we have significantly increased the effective capacity of our BAW filters within the same factory footprint. This has been achieved across a number of initiatives spanning product development, filter design, process engineering and manufacturing efficiencies. Looking forward, we have the ability to approximately double our BAW output within our existing footprint in Richardson. Despite the macroeconomic challenges impacting customers, our long-term outlook remains positive. We have grown our opportunity set across markets, customers and product categories while maintaining our commitment to technology leadership, portfolio management, productivity gains and reduced capital intensity. I think based on what you guys reported last quarter, China was about 1/4 of your business overall. Thanks for the question. The China-based revenue in the quarter was down approximately 20% quarter-on-quarter and about 45% year-on-year, just to put it into perspective. Looking forward, as we commented in the prepared remarks, we're looking at that Android-based China revenue down to approximately 10% of the overall revenue for Qorvo. And then as my follow-up on gross margins, probably for you, Grant. I guess based on your full year commentary on that, will the implied gross margin trajectory into March is probably down a little bit off of that 43.5% guide you how should we think about the path to for you to get back to the 50% or 50% plus? I know you're going through a very sharp production, you're cutting utilization rates. Related to gross margin, as you pointed out, it's heavily influenced by both mix and the utilization impact. Currently, the dominant headwind is the underutilization, which is generating over 700 basis points of headwind. We don't typically report utilization by factory, but I think it would be a meaningful metric just to cover very quickly by location. As an example, for instance, if we look at utilization in Germany, it supports our broadband business, which has actually seen some strength. Alternatively, if you look at our North Carolina Gas fab, for instance, it's running very low levels of utilization, which impacts our margin in the WiFi business for CSG. Larger sites like Oregon and Texas are also underutilized given the unit volumes we're seeing from customers as they work through the inventories and the soft demand environment and similarly, our assembly and test operations in China remain underloaded as well. In terms of margin, there's obviously a lot of moving parts there and other factors, but the underutilization is the primary one. We can alternatively look at the utilization that we can bring down, which we've commented on previously, the underutilization, as we see it today, is something that will resolve as we're under shipping and under building to what would be a more normalized demand environment. So as that returns to normalcy, I would expect the underutilization to leave itself. For instance, inflation is one where it might be running approximately 50 basis points to 100 basis points as a headwind today. There is pricing, which factors into it, but there's nothing that we're seeing there outside of what we expect in historical norms. So again, going back to utilization, it ultimately relates to the volumes we see and the volumes we're seeing right now from customers and the demand levels are intimately related to the macroeconomic effects we've talked about. We're seeing it across both access points, routers, we're seeing it in power management products for power tools. We're seeing it in SSDs, which is another area that's seen some weakness in looking out forward in time, I expect, again, those would be similar stories and that they will recover and the volumes will return. For the first one, I was -- you gave a 47% gross margin number for the full year. Because when I go back to before the 5G cycle started, your quarterly sales were in the $750 million, $800 million level. Last few quarters, they jumped up to 1.1, 1.2, but that was in hindsight above demand. Thanks for the question, Vivek. Let me take the first part, and then I'll let Bob address your second question. I mean, first and foremost, we won't guide into March formally, but we did comment on the Android-based revenue, which we do expect to be up in the March quarter. And then in terms of our largest customer, seasonally, you would expect that to be down. The rest of the business, we expect to be approximately flat to slightly up in certain different areas. Yes, you're correct that there has been some inventory build, but I want to also point out that we're not anywhere near the number of 5G phones that we expected to be at our number now is pushing closer to 600. And if you recall, when we started the year, we thought it was going to be closer to 700 plus. So that's a pretty big drop, and that's what built up the inventory. And so it's still our expectations to get past where we were at that $1.1 billion, $1.2 billion over time. We've got a lot of growth drivers in our portfolio today, each of the business segments, and we've talked about this. As far as the event cellular, we still believe we can grow in that mid- to upper single digits, we still believe we have room to grow at our largest customer and a lot of BAW content as we look out over the years. Then if I move into what we're seeing in the high-performance analog business, we've got several growth drivers there. And if I look at the power market that Grant talked about today is a little bit off because of what's going on in the data center market, along with the electrical power tools and things like that, but we're taking that product into multiple markets right now and expect that to grow very nicely. So we've got multi-suppliers and we've seen tremendous growth out of that, and we continue to add to our sales funnel on that. And then if I go to the connectivity and sensing, we believe that's going to be our highest growth. I think on the last call, you had highlighted $110 million charge, if I recall correctly. Thanks for the question, Vivek. If you remember, there was a $110 million charge last quarter. In the K that we filed, there was $2.2 billion of total purchase commitment liabilities that we had of which $1.4 billion was related to this particular silicon agreement. It currently stands at approximately $800 million, which remains on that particular agreement. Given the demand that we are including in our guidance, looking forward, we were able to work with the supplier in that case, in order to better match the supply coming in with the ultimate demand in our silicon. And related to that, clearly, volumes are impacting your utilization and margins. But Dave, representing our sales and marketing, will address your question, if that's all right. It's a combination of weak demand in the market, especially in the Android ecosystem on top of the inventory that's built up in the channel that's being run off. Again, we've got three different suppliers that supply us the raw wafers, and we've got even more that do the epitaxial, so this is a portion of that. We haven't disclosed even the baseline business, how large it is this year. All I can tell you is it's growing significantly, and we're very pleased with that acquisition. I ran through a number of the different applications we're in, and we just continue to add to the sales funnel on that business, and we just want to formalize with one of our suppliers in the longer-term agreement. We did cover the China revenue, the percent of sales and the percentage that it will be down both quarter-on-quarter and year-on-year, which are substantial. In terms of the inventory and the time it will take the process through the inventory, we haven't made a formal statement about that, but we have commented that Android-based revenue in China is expected to be up in the March quarter. We haven't provided formal guidance, but we do expect to see some increase in March. So we talked about that earlier this year, and we've ramped that with Honor. We've got lot of new customers, POs in hand, we'll start shipping more that in the beginning of next year. The product you referred to that combines the mid-high-band, main and diversity path, that's a new product that will ramp probably in 2024. So that's more targeting high-performance, small form factor applications, really leverages Qorvo's strength, optimized size and performance. I mean, your inventory problems appeared last year at this time pretty much. But we've now gone for 12 months and it's not getting better, it's getting worse. In terms of inventory and what we're writing off or reserving against, it is up significantly. We're ordering less raw materials, for example, and being selective where we choose to add value to inventory looking forward, I tend to look at finished goods, and it's about 20% of our total now. And if I could follow up on one more, is on your largest customer, it might be a bright spot. Certainly, it looked like it from the report for the first quarter et cetera. Sorry, that's not anything we've ever disclosed in the past. And yes, we enjoyed a nice ramp with them in the last quarter. And quite honestly, we're going to be down probably at all our major customers, obviously, including our China-based customers in December have factored all that into our outlook. My first one, I was just kind of -- apologies if this has been asked, we were listening to you guys on Qualcomm at the same time. But one of the comment that their team made was not only a weakening in smartphone demand overall, but also a move that from customers in all geographies and tiers to carry a lower level of inventory. And I wonder if you've seen across the board that kind of trend, even an acceleration and lowering inventory levels at most of the customers. Anytime you get into this type of environment, people are going to start to reduce their inventories because the demand is not growing. So we're working with each of them to kind of work through the inventory, whether it's sitting in our factory or sitting in our distribution channel or obviously sitting in our customers' shelves. We work through that with them on a case-by-case basis to make sure that, that inventory gets consumed. So in those cases, they're often willing to take more inventory on their shelf to heal those problems. I would only add to that, Dave, that it's broader than just quote our China-based customers, just to be clear. We talked about WiFi, whether it's access points or in the phones. But I just want to make sure for audience, I understand it's broader than what we're just seeing in handsets. As my follow-up, Grant, I know this new segmentation and you guys talked about the historicals being disclosed when the Q comes out. But in the guidance that you've provided for December, if you could talk maybe a little bit more specifically about the new segment directionally, that would be helpful. You get now a good look at the profitability by each of those different segments in terms of HPA, it just recorded a 35% operating margin. ACG recorded a 34% operating margin, which wasn't far behind and then a slight loss on our CSG business, which is our highest growth biggest investment area. I should say, base investment area -- sorry, biggest investment area relative to revenue. But putting all the pieces together, I would expect it to be profitable. We're going to drive that business, both in terms of the top line to increase the scale, so it can absorb the cost structure that it's got as well as looking at the utilization in the factories. So it's building a lot of WiFi parts that come out of our Greensboro fab, which is highly underutilized at the moment. It's just the Android customer base, which is causing banks or the biggest downshift in the trajectory of the business. I can't speak to Android specifically off the cuff, but I can tell you that our China-based business as a percent of total revenue was approaching 50% at the peak. There's been a lot of concerns, but I haven't seen anything concrete in this guide that is down sharply, have you changed the way you're looking at that customer baked in any conservatism. Obviously, there's manufacturing issues that's in the news as well as concerns about their annual cuts. I made a comment earlier that we were up year-over-year with our largest customer, but I also commented that in the December quarter, we're expecting to be down at all of our large customers, including our customers in China. The end consumer almost no matter what market segment we're facing, and we've got multiple products for more than just handsets, we're seeing it decline. Obviously, Samsung always has their ramp then and a good quarter for that customer. I think, number one, I'm glad you brought up our Korean customer and what's going on there. I mean, we also commented that we picked up a Low-Band PAD in their marquee phone, and we're pretty happy about that. We did get the Low-Band PAD and some of their high-volume phones, but we hadn't been in the marquee phone and we've got a lot of extra content there. So yes, as they launch their next level phone, we're going to do extremely well. Now again, we have to remember, are there rolling lockdowns, what's going to happen. But based on everything we see today, we do expect to be up there. But when you integrate all that with our largest customers, typically down, we're seeing some other weakness in other consumer businesses as we adjust the inventories, that's why we're not predicting March yet. But Blayne, I think we are at the point where we feel just like we said last quarter, this was going to be the low point December for our Android-based customers. As Bob mentioned, in some of their master 5G phones last -- this past year, we did get some of the low-band sockets, but this is new for us in the flagship. As far as additional content, it's hard to say. There's been a lot of cases in WiFi 6, where the PA that's integrated in the SoC is sometimes good enough performance and they don't need an external fab. And then as we all kind of piece together what's inventory digestion versus true lower demand, maybe this could be a helpful way to address that. We commented that we think it will be approximately 600 million units now for calendar '22, so down approximately 25 million units coming out of December. When we're looking at calendar '23 in terms of the overall market, I'm just curious to see how -- what the Chinese handset customers are thinking about a recovery year looks like in calendar 2023. I think what's important, and it's a good question and if I could answer that, I know a lot of you would be super impressed if I was actually accurate. I think what we focused on is the design activity, to your point, that we've been working on. And we're quite encouraged by the number of new phones and obviously, our design wins that are there and the amount of content that they're putting into their phones. Everybody had hoped after President, she was elected to his next term, they'll back away from the Zero COVID policy. And then you put in place, they're strong in Europe as well, you look at inflation and what they're seeing over there. What we feel good about is our design wins, our market share is consistent or higher as we go forward. The number of units, we'll just have to wait and see. And for my follow-up, last quarter, you were cutting utilization to kind of stoke the inventory burn. But I'm just curious, how are you thinking about ramping down the utilization rate at your internal fab and kind of what the impact would be on the margin front. Thanks for the question. So in aggregate, it's difficult, if not misleading, to quote a particular number. So adding that back, as I talked about earlier, gets us on path to our 50%-plus gross margin looking forward. Just wondering, I know you talked about by March quarter, we start to see some growth. But on a customer basis, seasonally, we would expect our largest customer to be down. We do expect Android based business to be up, and there will be some offset between those two that were not forecasting at this point publicly. In general, what is channel inventories, what are you seeing in terms of RF component levels and same on your customer. Where do you think inventories are as you exit the December quarter, let's say. In some cases, we have customers that are reasonably healthy in terms of the inventory they're carrying. And others, they've got a lot of inventory that they've got to work through and then in some cases, we have distributors in between that is kind of a mixed bag as well. What I'd add to that is, unfortunately, every quarter, the -- our customers are chasing demand down for the various global effects that we talked about, 3 major things: inflation the war and lockdowns in China. So unfortunately, every time they've been wrong and they thought they were reducing it enough when they weren't. And as Dave pointed out, we've got a great relationship with our customers, and we're working with them to work through this."
}