{
    "symbol": "AX",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-26 19:12:02",
    "content": " We reported net income of $82 million and earnings per share of $1.35 for the three months ended December 31, 2022, representing year-over-year growth of 34% and 35$, respectively. Excluding single family warehouse ending net loans increased by approximately $300 million in the three months ended December 31, 2022. Net interest margin was 4.49% for the second quarter, up 23 basis points from 4.26% in the quarter ended September 30, 2022 and up 39 basis points from 4.1% in the quarter ended December 31, 2021. Net interest margin for the banking business unit was 4.65% compared to 4.5% in the quarter ended September 30, 2022, and 4.3% in the quarter ended December 31, 2021. Total allowance for credit losses was $157 million on December 31, 2022, representing 22 times our annualized net charge offs and 1% of ending total loans. Loan originations for investment for the quarter ended December 31, 2022 were $2 billion, down approximately 22% from the $2.6 billion in the comparable quarter a year ago. Q2, 2023 fiscal year originations were as follows: $175 million of single family jumbo portfolio production, $110 million of multifamily production, $64 million of commercial real estate production, $59 million of auto and unsecured consumer loan production and $1.6 billion of C&I loan production resulting in a net increase in ending C&I loan balances of $204 million. Payments in our jumbo single family mortgage business was $164 million in the three months ended December 31, 2022, down from $184 million of prepayments in the prior quarter. The $203 million of net loan growth in our C&I lending moderated from record highs achieved in the prior two quarters, strong originations in our commercial specialty real estate business and our lender finance business were partially offset by higher payoffs in the back half of the quarter. Our loan pipeline remains solid with approximately $1.4 billion of consolidated loans in our pipeline at January 23, 2023, consisting approximately of $22 million of single family agency gain on sale mortgages, $292 million of single family jumbo mortgages, $185 million of multifamily and small balance commercial real estate term loans, $833 million of C&I and commercial specialty real estate loans and $65 million of auto and consumer unsecured loans. We had approximately $2.3 billion of clearing and custody deposits as of December 31, 2022, including $1.5 billion that was on our balance sheet and $800 million that was placed at partner banks. The average custody deposits were $1.5 billion in the quarter ended December 31, 2022 compared to $1.9 billion in the prior quarter. With new C&I loans coming in with a spread between 4.25% and 4.75% above the index rate, the continuation of cash sorting by custody clients and increasing deposit competition for many of our deposit businesses, we expect our consolidated net interest margin to normalize to between 4.25% and 4.35% in the next few quarters. Axos Advisory Services is seeing good momentum adding approximately $31 million of net new assets in the quarter ended December 31, 2022, and our pipeline of eight new advisors or $625 million of new assets under custody that have committed to Axos over the next 12 months. Our noninterest expense for the quarter ended December 31, 2022 was $107.5 million down from $116 million in the prior quarter. Professional services for the quarter ended December 31, 2022 was $8.5 million, an increase of $0.4 million from the $8.1 million for the three months ended September 30, 2022."
}