{
    "symbol": "AX",
    "quarter": 1,
    "year": 2023,
    "date": "2022-10-28 01:41:02",
    "content": " Excluding a onetime weekly reserve, which I'll discuss later, we reported adjusted net income of $69.6 million for the 3 months ended September 30, 2022, representing year-over-year growth of 15.6%. Net interest margin for the banking business unit was 4.5% compared to 4.45% in the quarter ended June 30, 2022, and 4.48% in the quarter ended September 30, 2021. Total allowance for credit losses was $155.5 million at September 30, 2022, representing 21x our annualized net charge-offs and 1% of our ending loan total loans. Loan originations for investments for the quarter ended September 30, 2022, were $2.5 billion, up approximately 19% from $2.1 billion in the comparable quarter 1 year ago. The first quarter 2023 fiscal year originations were as follows: $312 million of single-family jumbo production, $129 million of multifamily production, $59 million of commercial real estate production, $125 million of auto and unsecured consumer loan production and $1.9 billion of C&I loan production, resulting in a net increase in ending C&I loan balances of $960 million. Ending loan balances in our jumbo single-family business increased by $124 million to $3.8 billion, marking the second consecutive quarter of over $100 million of net growth in our jumbo single-family mortgage portfolio. Prepayments in our jumbo single-family mortgage business were $184.3 million in the 3 months ended September 30, 2022, down from $390 million of prepayments in the prior quarter. Our loan pipeline remains solid with approximately $1.4 billion of consolidated loans in our pipeline at October 24, 2022, consisting approximately of $20 million of single-family agency gain on sale mortgages, $11 million of jumbo single-family mortgages, $155 million of multifamily and small balance commercial real estate term loans million of C&I and commercial real estate specialty loans and $170 million of auto and unsecured loans. Access Advisory Services is seeing good momentum, adding approximately $200 million of net new assets in the quarter ended September 30, 2022, and a pipeline of 10 new advisers with those of $500 million of new client assets that is committed to transfer to Axos over the next 12 months. Our securities book with approximately $258 million in ending balances is less than 2% of the total assets as of 9/30, 2022. Our single-family jumbo mortgages and multifamily loan portfolios with $4 billion and $3 billion of loan principal outstanding as of September 30, 2022, represent approximately 26% and 19% of our total loans outstanding, much lower than they were in prior upgrade cycles. Professional services for the quarter ended September 30, 2022, were $8.1 million, an increase of $0.5 million from the $7.6 million for the 3 months ended June 30 and $3.5 million increase from the $4.5 million for the quarter ended September 30, 2021. But obviously, that's -- when you break that apart amongst the things like single-family warehouse, single-family mortgage, multifamily and commercial mortgage where we have LTVs that are at 57% and 52% on a weighted average across those portfolios, respectively, that you're going to see a lower percentage of ACL of 45 bps and 49 bps, respectively."
}