{
    "symbol": "PCOR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 02:53:02",
    "content": " And one of the reasons why when we highlighted our excitement around the international opportunity and the investments we would be making over the years in the past, is why we think we're in such a unique position to be successful internationally and why it's something that we remain really excited about from an opportunity perspective. Thank you for your question. Maybe the only thing I'd add is, when we think about the product mix, the subcontractors are adopting, I think that's one of the most exciting aspects about the platform that we are able to monetize our existing offerings across project management, quality and safety, financials, while also offering very differentiated value in place like workforce management. Thank you for your question. Brent, your line is now open. And the good news is that as all the collaborators on our platform, remember, 60% of the folks using Procore are not paying customers, most of those are specialty contractors as they see the value of Procore because they're in the general contractors or an owner's account, they start asking themselves, how can I get the value. Thank you for your question. Thank you for your question. So when we look at the U.S. side and you talk about the mix of customer size of stakeholder, I would tell you that there isn't a lot to say or new things to add here versus what we had commented on last quarter from an absolute customer count adds, it's always important to remember that the largest driver of our customer count in any quarter is going to be the SMB audience. Yes, I would just remind everyone that as we look back over the last two plus years, that this industry has been going through nothing but constant change in turbulence from supply chain dynamics inflation that's been around for some time, particularly when we talk about materials and these different components that go in. Thank you for your question. Brent, your line is now open. Thank you for your question. Thank you for your question."
}