{
    "symbol": "WMG",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-09 13:59:05",
    "content": "  Operator: Welcome to Warner Music Group's First Quarter Earnings Call for the Period Ended December 31, 2022. At the request of Warner Music Group, today's call is being recorded for replay purposes and if you object, you may disconnect at any time. Now I would like to turn today's call over to your host, Mr. Kareem Chin, Head of Investor Relations, you may begin. On today's call, we have our CEO, Robert Kyncl; and our CFO, Eric Levin, who will take you through our results and then we will answer your questions. Before our prepared remarks, I'd like to refer you to the second slide of the earning snapshot to remind you that this communication includes forward-looking statements that reflect the current views of Warner Music Group about future events and financial performance. Investors should not rely on forward-looking statements, because they are subject to a variety of risks, uncertainties and other factors that can cause actual results that differ materially from our expectations. It's important to note that last year's Q1 included an extra week of reporting, as a result, this quarter's comparisons need to be adjusted to provide an accurate picture and I'll be discussing our results in that context. Total revenue in Q1 grew 2% and adjusted OIBDA increased 13%, with 210 basis points of margin improvement. Recorded Music revenue was flat as the strength of our global performance was offset by a softer quarter in the U.S. We had a tough comparison with the prior year quarter, which included releases from some of our superstar artists. We're expecting a stronger release schedule in the back-half of the fiscal year, which will feature new music from Ed Sheeran, Cardi B, David Guetta, Aya Nakamura and BeBe Rexha. Our operating cash-flow growth was healthy, despite some of our revenue lines coming under pressure. I'd like to spend some time on this call, proactively addressing two questions that often been asked. Specifically, why I chose to go into the Music business and why I joined the Warner Music Group after 12 years at YouTube and seven years at Netflix. I chose Music first and foremost, because everyone loves music including me. In an increasingly digital world, music makes people feel and it brings them joy, hope and comfort, plus in an increasingly divided world, music brings people together. On top of that, music's global appeal is matched by its ubiquity. As successful as music has become, there is still meaningful upside ahead for three reasons. One, as technology opens up emerging economies, the industry's addressable market will continue to expand even further. Two, innovation is constantly creating new use cases for music, giving us the opportunity to diversify our revenue sources. Three, music is still undervalued, especially when compared to other forms of entertainment like video. Since 2011, the subscription price of Netflix's standard service has roughly doubled. In contrast, the price of the music subscription has stayed the same since streaming was introduced over a decade ago. First and foremost, it's the artists and songwriters and powerful catalogs that are the lifeblood of this company and it's such a pleasure to bring this creative work depends around the world. Ariel's career includes 16 years at Google, where he built, launched and let some of the company's most successful products, including YouTube's creator tools, memberships and content ID. At the same time, we plan to thoughtfully reallocate some resources to accelerate how we use technology and data to empower artists and songwriters, as well as drive greater efficiency in our business. As subscription revenue continues to grow, as supported recovers and we explore the possibilities of new technologies and business models, it's essential we structure our deals smartly and strategically. I am proud that over the last five years at YouTube, we developed a very collaborative mutually beneficial relationship with the music industry, after years of rocky ones. I plan on bringing in the same approach to the WMG and the industry, so that our interests are aligned with our partners and that our artists and songwriters gain maximum participation and monetization. As Robert mentioned, our year-over-year comparisons should take into account the impact of the extra week in fiscal Q1, 2022. Adjusting for the extra week, we delivered growth across key metrics, including revenue, adjusted OIBDA and adjusted OIBDA margin. Additionally, we saw strong operating cash-flow growth and strong cash conversion as a percentage of adjusted OIBDA, despite a challenging macro-environment. Total revenue declined 2.7%, but increased 2% when adjusted for the impact of the extra week. Adjusting for the extra week, margin increased 210 basis-points. Recorded Music revenue declined 5.6%, that was roughly flat when adjusting for the impact of the extra week. Streaming revenue decreased by 2.6%, after adjusting for the extra week Streaming revenue grew by 5%, as subscription streaming revenue grew by high-single-digits and was partially offset by ad-supported revenue declining in the mid-teens. Physical revenue declined 27%, adjusting for the extra week, Physical declined 22%. Our Streaming and Physical results reflect a lighter release schedule we had this quarter compared with the prior year period, which included releases from Ed Sheeran and Coldplay. Artist services and expanded rights revenue decreased by 4%, due to macro-economic pressures affecting our E&P business and lower advertising revenue. Recorded music adjusted OIBDA decreased by 6% with margin of 24.1%, which was roughly flat compared to the prior year quarter. Excluding the impact of the extra week, adjusted OIBDA grew 7% and the margin improvement was approximately 150 basis-points. Music Publishing continues to deliver strong results, posting 14% growth, driven by strength across digital, performance and mechanical. Digital revenue grew 16%, reflecting growth in streaming, which increased 17% driven by continued growth in streaming services and timing of new digital deals. Performance revenue increased by 29%, due to continued growth from bars, restaurants, concerts and live events. Mechanical revenue increased by 17%, due to growth in France and Sync revenue decreased by 5%, due to lower commercial licensing activity in the U.S. and the timing of legal settlements. Music Publishing adjusted OIBDA increased 36% to $72 million with margin increasing 460 basis points, driven by strong operating performance and the favorable impact of currency exchange rates. Q1 CapEx decreased to $21 million as compared to $34 million in the prior year quarter, mainly due to lower facilities investments. Operating cash-flow conversion was 62% in Q1, the strong performance was driven by the timing of working capital items. While working capital will fluctuate from quarter-to-quarter, our goal remains to deliver a conversion rate of 50% to 60% over a multi-year period. As we look ahead to the rest of the year, our goal is to release amazing new music from our talented roster of artists and songwriters. While some of the macro and release schedule driven pressures we saw in Q1 will impact Q2, our slate in the back-half of fiscal 2023 is strong. Your line is open. But here's what I know, which is will very thoughtfully relocate resources to accelerate our technology investments and then to empower not only artists and songwriters, but also to drive efficiencies in the company. So one, the company has actually then much more measured and it's headcount growth for instance over the last few years than others in the industry, who are now undergoing significant layoffs. So there's been a lot of momentum on this, that is probably putting us in a slightly different position than others. And but again, I'd like to reiterate that I'll be focusing on driving, reallocating resources, our internal resources in order to invest in technology and drive not only more tools for each monetization for creators, but also greater efficiencies for us. Your line is open. And then for Eric, you touched on margin expansion was driven just by a strong operating results. So one, I'd like to say that AI is probably one of the most transformative things that humanity as ever seen, it has so many different implications. Two, there are many different ways to sort for the music industry, as well as for other industries, who own copyrighted material. But it's not just that question, it's all of these together that we as an industry and I don't mean just the music industry. But you can also look into today's world, would can benefit our position in the future, where there is a lot of AI generating content and what I mean by that is, tracking of content, identifying and tracking of content on consumption platforms that can appropriately identify copyright and remunerate copyright holders, underpins all of this. Obviously, YouTube is most advanced with Content ID, something that all the others over seen. So, obviously this quarter, when you look at adjusted for the extra week, 210 basis-points increase in margin is substantive and we're proud of that. We can look at this quarter and see for example, Warner Chappell had a 36% OIBDA increase. It's about what we look towards, again not every year is the same. Your line is open. I wanted to ask you a bit more about your comments around music being undervalued, obviously that have been a long going debate in the industry between the labels and distributors and you give your seat on the other side of the negotiating table, I'd love to hear your thoughts on, how do you affect that change in the industry from the CEO position at Warner Music Groups. Obviously, you don't get to dictate per se the pricing of the DSPs and sort of what you can extract from players like TikTok, but what do you think you can do given your experience at YouTube to accelerate the value capture at music. Can that accelerate this year, is that a new normal in your mind that's obviously quite a bit lower than what we saw from Spotify, for example on an organic basis in premium revenue and I think the market is a bit concerned that the major labels may be losing share. So one, I made my comments, so if I think everyone has been sort of stuck in the conversation, sort of one-on-one relationship between content providers and the DSPs. The -- I can't really get into the tactics of how we would achieve that, but what I can tell you is that, at YouTube we've had the history of executing and delivering on our plans. So as we said, our fiscal Q1 release schedule in the U.S. was a little bit of a softer schedule that could have roll in and have some impact on Q2 as well this year. If we just look back one quarter ago, our subscription streaming growth was in the teens, in the low-teens area. Your line is open. Robert, it's great to have you on this call, I love sort of your perspective on how important you think music is, as TikTok's core product. When you are at YouTube, I remember had the label, including Warner, pushed very aggressively for you to launch a subscription product in addition to sort of the marketing aspect of what YouTube did for music. We made the decision to launch subscription at YouTube, because we were looking at the industry holistically and we had a fast-growing advertising business with free content to users, while at the same time subscription was somewhat nascent for the industry. Obviously, you don't do it with all 2 billion users, you do at some fraction of it and great audience segmentation strategy and that's exactly what we did. And obviously, that's also followed a further expansion into shortage later on. So the platform has done an incredible job, delivering multiple formats, super short format, with  music videos, user uploaded content, track and upload, copyrighted track, properly remunerated and subscription as well as life. So when you look at that from the point of view of content owner and content provider, it's a phenomenal partnership and phenomenal platform, that's exactly what we decided to do. Well, let me also say, we've looked at this question very closely and we decided that it was important to us and that's why we did it. And you can see from YouTube's execution, what the results of the findings was for us, but again speak to what TikTok obviously finds. Your line is open. And then relatedly, as you think about fiscal '23, is there any way to think about or handicap, whether we could get movements on the emerging streaming side, i.e., a new deal that would actually material to kind of pushing that business up higher. So in this quarter, there were no, but say significant renewals to note, sequentially emerging streaming was roughly flat, it's up about 20%, 20 some odd percent year-on year. What we have said is that, we had a series of deals we did in the 2021 timeframe and most of our deals in emerging streaming tend to be two to three years in length. Meaning that within fiscal 2023, there certainly will be discussions about new deals, when exactly those close and what form, whether there continues to be fixed fee or portions of them are variable as to be seeing. So we will keep you guys apprised as deals are renewed and the impact the category, but that is something where there'll be discussions ongoing throughout the year with some of our partners. Again we don't talk about individual deals, but generally we say with our largest subscription partners are deals tend to be variable and those will have -- those will obviously price increases will have a positive impact on growth. So in future quarters, those will be rolling through the subscription revenue numbers and we expect that to be a positive to the subscription growth kind of story this year. Your line is open. My first is your comments about technology and innovation, new use cases and these appointments that you've made. It's little too early for me to describe exactly what we'll do in that regard, but I think it gives you the option, investing into, it gives you the optionality to do that when we had the investment capital and can deployed against it. I think the only dilution question, I think it's something that you've been seeing all along, it's obviously something I keep an eye on that sort of considers a fair game. These are platforms where content providers are uploading content and we have to do a great job and having a robust catalog; b, more great artists that are gaining meaningful share and we have to do a great job with them, so the owners is on us. I would tack on to that Michael that, we obviously released music that we A&R and market ourselves. And it's part of our strategy to make sure, we're playing into the significant growth areas of the global music partner. If I could just follow up, because I think that's an important point. But do you think that, that data is sort of from Spotify and I don't mean to just pick them, but that as an example is sort of underestimating your actual participation because of your share of the Indie side as well. Some want to kind of respond to an individual platform, because we literally have hundreds of digital platforms that were licensed to it's portfolio, some of whom are global, some of whom are local, some of who are subscription, some of whom are ad-supportive, some are socially oriented. It is our job to -- one, the first thing is that the consumption of music across platforms globally, digital consumption continues to grow. That's our job, not just to look at one platform, but to look at different platforms and develop and different territories and develop a strategy to drive growth. So for us, it's kind of a multi-layered, multi-tiered strategy and we believe that positions us well for continued strong growth. Your line is open. I wanted to follow-up on the recorded music subscription revenue discussion from earlier, just because it has been a major area of debate. Eric, I know you talked about the impact of the release slate and content cyclicality and how that could cause a couple of 100 basis-points of volatility here and there. But the magnitude of the deceleration from Q4 to Q1 was perhaps at the upper-end of that, maybe even greater thinking through some benefits from the Apple Music price increase. So there's just a broader concern, there's something else going on beyond this market-share shifts. On the subscription side, we have looked at this and we did have a softer largely U.S. base release schedule this quarter and we do think that is what is driving the slowdown in this quarter, could roll into our fiscal Q2. But given our release schedule as second-half oriented this year, we do feel-good about our performance and -- of releases and strength in the second-half of the year. Your line is open. I think that -- so it is in the 10s kind of streaming revenue, call it, low-teens or maybe even kind of 12, 13 -- kind of -- low-teens kind of area. Well, it is -- if what you're getting to Stephen is, is the slowdown in the ad markets affecting Sync growth trends. That growth has slowed in that category, although our teams are still seeing a lot of opportunities and potential for growth in film, TV and other categories as well as global Sync, non- U.S. based Sync. But it is more challenging market, and our team certainly is targeting the areas that are more active and vital for critical Syncs and the commercial ad market is one they are seeing a degree of softness. So thank you everyone for dialing in, asking questions and continuing to be interested in our business."
}