{
    "symbol": "KLR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 20:29:01",
    "content": " Our first quarter revenue was $80.5 million, up 103% from the same comparable year ago period. For example, our first quarter gross profit and adjusted gross profit were $17.7 million and $19.3 million, 180% and 198% increase from the last year's Q1, respectively, while our adjusted EBITDA increased over 600% in the first quarter totaling $6.2 million. On a pro forma basis, giving effect to the mGage acquisition as it had occurred on January 1, 2021, our key metrics significantly improved as well, with our adjusted gross margin outpacing that of last year at 24% compared to 21.4% in the prior year period, and adjusted EBITDA almost doubling from the prior year period from $3.2 million to $6.2 million. As Dario mentioned, our total revenue in the first quarter increased 103% to $80.5 million from $39.7 million in the comparable year ago period. On a pro forma basis, given the effect of an mGage acquisition if it had occurred on January 1, 2021, our revenue growth was 12.4%, while all other KPIs outpaced those of the prior year period which pro forma adjusted gross profit increased by 25.6% and adjusted EBITDA exceeding 90% period-over-period. Adjusted gross profit, a non-GAAP measurement of operating performance increased 198% to $19.3 million from $6.5 million in the comparable year ago period. Adjusted net income, a non-GAAP measurement of operating performance increased 219% to $2.3 million or $0.06 per basic share based on 42.2 million weighted average shares outstanding and $0.05 per diluted share based on 52.1 million weighted average shares outstanding from negative $2 million or negative $0.07 for both basic and diluted share based on 30.4 million weighted average shares outstanding in the comparable year ago period. Quarterly net cash provided by operating activity was $3.2 million in the 3 months ended March 31, 2022, compared to net cash used in the operating activity of negative $8.2 million in the -- year ago period. We currently expect revenue for the second quarter to range between $81 million and $83 million, representing 52% growth at the midpoint compared to the same year ago period. For the full year 2022, we expect revenue in the range between $360 million and $365 million, representing 35% growth at the midpoint compared to 2021."
}