{
    "symbol": "KLR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 20:06:04",
    "content": " I'll start with a financial overview, our second quarter revenue was $81.1 million up 50% from the same comparable year ago period and in line with our revenue estimate. For example, our second quarter gross profit and adjusted gross profit were $18.7 million and $20.2 million, a 78% and then the 82% increase from last year's Q2 respectively, while our adjusted EBITDA increased over 177% from the prior year period from $2.2 million to $6 million. In addition, our cash and cash equivalent position remains strong at over $74 million and our key metrics significantly improved as well with our adjusted gross margin at 25%, compared to 20.6% in the prior year period. Also, the Campaign registry continued to outperform posting its first million dollar month and finishing with over $4 million in revenue in our second quarter with high profitability. So as Colin will discuss at the end of the financial section, with those challenges in mind, we have made an approximately 4% downward adjustment to our revenue outlook for the 2022 fiscal year and align our outlook for the third quarter to measure this reduction overall. As Dario mentioned, our total revenue in the second quarter increased 50% to $81.1 million from $54 million in the comparable year ago period. The increase in revenue was mainly driven by the fact of the business combination with mGage, which contribute $30.2 million and the organic growth of Kaleyra legacy business, representing 16% of the aggregated growth period-over-period. Net loss totaled $15.8 million, or $0.36 per share based on 43.4 million weighted-average shares outstanding, compared to a net loss of $4.5 million, or $0.13 per share based on 34.3 million weighted-average shares outstanding, in the comparable year-ago period. Adjusted gross profit, a non-GAAP measurement of operating performance increased 82% to $20.2 million from $11.1 million in the comparable year-ago period. Adjusted gross margin in the second quarter of 2022 was 25%, compared to 20.6% in the comparable year-ago period. Adjusted net income, a non-GAAP measurement of operating performance decreased by 89% to $55,000, or $0.00 per both basic and diluted share based on 43.4 million weighted-average shares outstanding and 53.7 million weighted-average shares outstanding, respectively, from $504,000, or $0.01 per both basic and diluted share based on 34.3 million weighted-average shares outstanding and 44.9 million weighted-average shares outstanding, respectively, in the comparable year-ago period. Adjusted EBITDA, a non-GAAP measurement of operating performance increased 177% to $6 million or 7.4% of total revenue, compared to $2.2 million or 4% of total revenue in the comparable year-ago period."
}