{
    "symbol": "SKT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 11:45:10",
    "content": " Over the trailing 12-month period ended March 31, we executed 1.8 million square feet of leases across 375 transactions, representing a 39% increase in space and a 42% increase in transactions from the comparable prior period, driven in large part by the strong renewal activity, approximately 45% of this GLA was executed in the first quarter of this year. But I understand, when we take a permanent tenant, and they occupy a temp space, there's still occupancy or space available in that shopping center, we're going to take that Tanger tenant, and we're going to move that Tanger tenant into another available space in our portfolio. That said, we're going to focus on in some particular centers where we've got 100% occupancy, where we've got underperforming retailers, we're going to be just as aggressive going after more productive retailers and higher rent payers in some of that space and creating some of that frictional vacancy when we pull out an underperforming and replace them with a much better performer or a larger expanding retailer. I think the -- the most material change to leasing right now over the last 2 years is that where we were very focused 2 years ago on maintaining occupancy, reducing base rents, replacing base rents with higher percentage rents in order to get some downside protection to some retailers during the height of the pandemic. There's a number of initiatives that we've stood up over the last, I'd say, 2 quarters that have really enhanced our ability to drive traffic into our centers, but also give us great data and information about the tenants about the shoppers that are coming into our parking lots. Well, first of all, I guess, what we're hearing from our retailers and what we're seeing as far as sales performance is concerned, is that there's been a big shift from casual product to fashion product and a lot of our fashion brands in our portfolio have really been the overachievers in the last quarter. And I think that's really critical because in an environment where there's still occupancy opportunities in some of our shopping centers to have a short-term tenant where we're able to control whether we can terminate those leases on a 30-day notice, 99% of these leases had that clause, it's a landlord favorable clause. And we think that, that's the most important part of our TangerClub on a going-forward basis is the personalization of how we communicate to these new customers and the value proposition that they get for being part of this TangerClub -- this TangerClub group, better value, exclusive offerings such as early shopping hours and in some instances, upfront parking."
}