{
    "symbol": "SKT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 12:30:04",
    "content": " Over the past 90 days, we've rebranded the asset Tanger Outlets Palm Beach, completed transactions with new national brands, and stood up our marketing partnership, customer service and Tanger Club programs, which all contribute to elevating the shopping experience for the existing customer base, driving new shoppers to the center and generating additional revenue. So as you -- as we continue to have six straight quarters of spread growth, we're taking advantage with a relatively low OCR of about 8.5% versus historical high OCRs pre-COVID in the low double digits, we think we've got a lot of bandwidth to push our rents going forward and our leasing team is absolutely taking advantage of that opportunity. But it really is the -- you want to have as opposed to need to have in the event that there's like safety or any maintenance, we're always going to spend capital to make sure that our centers are in great condition to receive our shoppers and customers. Well, look, the leading indicators that we look at relative to retailersâ\u0080\u0099 performance and how we think they're going to perform in the fourth quarter and what they're -- what our expectations are for their roommates, their tendency to remain our shopping centers has to do with the renewal rates. And what we've found in years past, about 80% of our leases will renew this year, we'll probably have over 90%, very few retailers are closing stores right now, particularly in stores that are amortized because it's tough for them to replace a store that cash flows, they'll have to make sizable investments in order to do so. We're also focused on reinvesting in our own portfolio and enhancing the assets, investing in sustainability initiatives, investing in the outparcels strategies that we've talked about, obviously, Nashville's a piece of our growth, and we locked in a lot of our capital for that last year through the equity offerings and our bond transaction. So when you have one of the largest national retailers announced that in order to keep their full price channels clean with brand new inventory, and that they're going to close all -- they are going to close out all of this excess inventory to the outlet channel, essentially, what's happening is, they're being more promotional in our channel, so that they can be more clean and push prices in the full price retail channel. We've got a sizable Tanger club, where our Tanger members pay into that club, but get returned additional discounts, shopping days and through our digital marketing strategies we communicate with these customers in a very personal way, and drive them not only to the shopping center in their particular geography, but make sure that when they're traveling, that they know that there's a Tanger shopping center close by."
}