{
    "symbol": "SKT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 12:50:26",
    "content": " Your line is now live. Your line is now live. Just wanted to circle back to the same-store guidance, Michael, you kind of pointed out the 150 basis point drag from the reserve reversals, but can you kind of give us what the assumption is a bad debt this year and maybe how that compares to â\u0080\u009822 if you were to normalize for kind of prior period collections and just trying to get an apples-to-apples, the 3% versus the 5.5% you guys had in 2019? So, our guidance when we â\u0080\u0093 if we adjust for the reserves in that $3.5 million to $5.5 million, there is a lot of different assumptions that go into that, one of which is obviously the bad debt and we are trying to be prudent in how we are looking at that against all the other variables thatâ\u0080\u0099s embedded in coming up with the same-store in terms of our occupancy, where our spreads are, the percentage of rents, our recoveries, the timing of our leasing, the roll, the burden that we have from 2022. Your line is now live. So my second question, Iâ\u0080\u0099ll try to stick to two is that â\u0080\u0093 in terms of your sales numbers, obviously they were tenant sales were down, marginally flat sequentially, but down year-over-year in obviously in inflationary environment, how should people think about that and maybe also touch on because I would have thought that including more food and beverage in your leasing and then your tendency should potentially increase your average sales numbers but clearly, Iâ\u0080\u0099m not sure what the impact of that if and then also talk maybe about what the average dwell time is that the shopper has at your center, and how thatâ\u0080\u0099s tracked over the last year. And so as we see a lot of that activity, what will ultimately happen is that an item which last year in 2021, where we saw a very non-promotional environment, particularly in the fourth quarter, where you might have sold two items for $100, weâ\u0080\u0099re finding across our platform that you can now get that same, you can now get three items for that same $100 or buy two and get the third free is a common promotion spend to get it gives the retailer an opportunity to clear through a lot of excess inventory, but weâ\u0080\u0099re not going to see a tremendous amount of sales growth, although theyâ\u0080\u0099re able to execute to what their objective is. Your line is now live. Your line is now live. Sure, Vince, this is Doug, another component that impacts those numbers that youâ\u0080\u0099re looking at there was an agreement that we did last year involving our trash pickup, that took some costs out of the property operating expense, but also took a commensurate amount out of the recoveries, itâ\u0080\u0099s still an opportunity where we have thereâ\u0080\u0099s some growth in that business line for us, but this was a strategic transaction to help provide a little bit of incremental income. Your line is now live. Your line is now live."
}