{
    "symbol": "AEVA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-22 22:03:06",
    "content": " Please proceed with your question. So this now -- this new line is really going to be setting us up for the next set of opportunities, engagements and getting to secure those wins, but the activity really is around continuing with process optimizations, which I mentioned on the call, we're going to be doing the next few months and further increasing our automation level to really continue scaling our product deliveries throughout the rest of this year to our -- to those key customers. Please proceed with your question. But from those L3 plus and ADAS applications from automation, that's actually where a lot of the focus is and this has been critical for our case in terms of our advancement throughout the opportunities evidenced by the fact that we've been able to actually provide units to our customers and start delivering samples so they can actually validate, but also importantly, that now these OEMs starting to actually make progress towards RFQ stages. We expect to happen this year and one of course, case in point of this clear evidence is that this top-10 OEM that we talked about, which is an established leader in automotive, as I mentioned on the call with significant scale and we've been working with this OEM for some time now, and this OEM was tested with other three  LiDARs in the prior development stages since our close collaboration is now in the next stage is actually decided to our LiDAR technology, the four LiDAR as the long range LiDAR on the fleet vehicle. So that I think is some of the traction and actually evidence that we're seeing from the customer before we expect to continue working through these program opportunities, RFQs with these customers as well as supporting this top-10 OEM as they work towards production as I mentioned with the targeted SOP of 2025. Please proceed with your question. So that is all critical and the reason, I think one of the key reasons for them deciding to implement us on their vehicle fleet, that's setting the path and the key specs for the production program is that they were not really able to achieve the standards of the safety and performance that they're looking for again, to our understanding for deployment and with our technology, they're starting to see what they can do with the addition of the velocity. Please proceed with your question. Please proceed with your question. So short answer is actually, as we implement this for initial customers, the fact that, so one thing also I mentioned earlier is even for this opt OEM, they're starting to actually not just use the velocity, but also our perception software, right, and that I think actually is an important value proposition because it actually helps them accelerate their integration. Please proceed with your question. And this is what I was mentioning on the call where, with our completion of our LiDAR-on-Chip module or perception platform for industrial sensing, we can now achieve the micron-level precision and this one of our first customers in this space is Nikon, which we have talked about and they're using that for automotive manufacturing, high volume automotive manufacturing applications."
}