{
    "symbol": "HSII",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-25 21:53:07",
    "content": " Today we announced consolidated net revenue of $284 million, 47% higher year-over-year, a record for the first quarter and the second-highest quarter in our company's history exceeding expectations. Heidrick Consulting had $18 million in net revenue, a record for the first quarter, this was an impressive 28% higher than last year. With first quarter 2022 revenue of more than $23 million dollars, 66% higher than last year, Heidrick is the clear market leader in securing high-end projects and interim on-demand talent. While still on the topic of our on-demand talent business overall just one year in from our acquisition of BTG in April of last year, I'd like to share the impressive fact that a remarkable 20% of the segment's Q1 revenue was referred to by our Executive Search and Heidrick Consulting colleagues. Our diversification strategy is underway at Heidrick & Struggles and we are seeing the results, we do expect our Executive Search business still more than 80% of our total net revenue today to continue on a path of notable growth at the same time our non-search businesses Heidrick Consulting, On-Demand Talent and other adjacencies still to come are likely to grow even faster. With all the regional and industrial sector success we put a remarkable $2.5 million trailing 12-month productivity per search consultant on the board in the first quarter, a 56% increase compared to last year's trailing 12 months of $1.6 million. With record-setting quarter net revenue and higher volumes of work naturally this comes with higher compensation and other variable costs, which was expected in a positive and overlaid with our revenue performance, for example, we saw consolidated salary and benefit expense up $201.4 million in the quarter, 42% higher than the prior year, but somewhat lower as a percentage of net revenue at 71% in the first quarter of 2022 versus 73% for the same period last year. Given the continued strong Executive Search project volumes and effective productivity, we are seeing so far coupled with the growth expectations from both our On-Demand Talent business and Heidrick Consulting we believe our second quarter net revenue will be in the range of $290 million to $300 million. For example, using Heidrick's market EBITDA multiple of around 6.5 times today and given our On-Demand EBITDA of $0.3 million in the first quarter of 2022, we'd see a value of approximately $8 million for a business generating annual - annualized $94 million of revenue. I think the first aspect was, as you rightly pointed out, we've been speaking to this for quite some time in terms of investing ourselves into the future digitization of a lot of our different verticals that includes On-Demand, Executive Search, and Heidrick Consulting, we have really done an internalization of an initiative that really creates a core group of team members that are really helping us out, we made the comment believe it was last quarter with full day in the partnership and that was a good indication in terms of how we were really trying to rethink our transformational process on this. I think the first answer is on the organization that attains that revenue, obviously you a need a little bit of scale to kind of go and engage into our client and I think the other one is the delivery element of it, which you'll see sometimes some fluctuation in the cost of services pertaining to Heidrick Consulting, which again if we have a lot of work and we have a lack of capacity we're going to have to use external parties to help us deliver on those services, which will again bite a little bit on the margin side of it, but nonetheless, the right thing to do as we hire as hopefully we drive that number down, which really shows what I would call the self-sustainability of the revenue that is - revenue that is being serviced by our core team that kind of work with Heidrick. I would say that from an executive search point of view, we would expect that to be kind of where we're seeing it right now, there is not going to be a tremendous differential in that, at least that's our expectation and within Heidrick Consulting, we would expect it to be up a little bit in terms of their productivity sign and as you know On-Demand Talent, we really don't look at it in that regard."
}