{
    "symbol": "OPEN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 19:55:26",
    "content": " Additional information that could cause actual results to differ from forward-looking statements can be found in the Risk Factors section of Opendoor's most recent Annual Report on Form 10-K for the year ended December 31, 2021, as updated by the periodic reports filed after that 10-K. Any forward-looking statements made in this conference call, including responses to your questions, are based on management's reasonable current expectations and assumptions as of today, and Opendoor assumes no obligation to update or revise them, whether as a result of new developments or otherwise, except as required by law. Before I discuss our Q3 financial results and Q4 guidance, it's important to level set that based on our outlook for Q4, we expect to generate over $530 million in contribution profit for the full year, or 3.5% contribution margins, which is just shy of our annual target margin range of 4% to 6%, notwithstanding, the sharp housing market reset. Your line is now open. For the homes that we have been offering on acquiring, say, from July going forward, those homes are that it was high spreads relative to the environment we're operating for all the reasons you just said, we're operating at peak uncertainty right now with an expectation of continued home price depreciation. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. What I'd say is that we're observing conversion rates somewhere between 10% to 15% of true sellers, which is obviously lower than the north of 30 we've seen historically, but that is at fee -- spread levels, we've never actually had in market. Your line is now open. Your line is now open. Your line is now open. In 10 years, I think if we are able to build our brand in a way that people trust the platform, and we have services that enable a seamless transaction in a market where we're not actually operating a 1P business, that's within the realm of possibility, but not on the short-term road map."
}