{
    "symbol": "OPEN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 20:13:02",
    "content": " I'd now like to hand the conference over to your speaker today, Elise Wang, Head of Investor Relations. Full details of our results and additional management commentary are available in our earnings release and shareholder letter, which can be found on the Investor Relations section of our website at investor.opendoor.com. Before we start, I would like to remind you that the following discussion contains forward-looking statements within the meaning of the federal securities laws, including, but not limited to, statements regarding Opendoor's financial condition, anticipated financial performance, business strategy and plans, market opportunity and expansion and management objectives for future operations. Additional information that could cause actual results to differ from forward-looking statements can be found in the Risk Factors section of Opendoor's most recent annual report and on Form 10-K for the year ended December 31st, 2021. For a reconciliation of each of these non-GAAP financial measures to the most directly comparable GAAP metric, please see our website @investor.opendoor.com. Iâ\u0080\u0099ll now turn the call over to Eric Wu, Co-Founder, Chairman and Chief Executive Officer of Opendoor. To that end, I like to start our call with a story of Julie Damavandi, a recent customer of ours. I'm Julie Damavandi, I live in Henderson, Nevada, and I sold my home to Opendoor. I was in my home for 41 years, and really was looking forward to a new fresh start. When I was looking to move, I found a new build that I was excited to be able to pick out all my new stuff in and the only hang up was I had to sell my house to do that. Within three days we have a price agreement and we're in contract right away, which made it possible for me to then sign a contract with the new builder, it was like, okay, I don't have to pay to refinance my house. I don't have to put a lockbox on my front door and have people traipsing through my house when I'm home or not home, there was just so many good things about Opendoor. This whole new method of doing this, so it's kind of new to me. But then once the sale was through, and once I had moved out of that how I really felt freedom, like I could literally fly because I didn't have that weight. Against the backdrop of the macro and housing market uncertainty, our product that delivers simplicity, certainty and speed is needed for our customers like Julie now more than ever. As such in the second quarter, we've helped over 14,000 homeowners move with peace of mind and delivered a revenue of $4.2 billion growing over 250% year-on-year with record contribution profits of $422 million, adjusted EBITDA of $218 million and adjusted net income of $122 million. In addition to our financial performance, we took important steps towards our goal of servicing home sellers nationwide, and building a better home buying experience. We entered 60 markets, bringing our total footprint to 51 markets, expanding our underwriting capabilities to cover nearly 30% of US home transactions. For homebuyers, we went live with our new Opendoor financing app in California, enabling our customers to get pre-qualified in less than 60 seconds. And finally, we've officially launched Opendoor Exclusives, a first of its kind marketplace that lets homebuyers purchase and Opendoor home pre-market via an Ecommerce like experience. While we were pleased with these results, the current market volatility is requiring us to be highly dynamic and rigorous and managing risk and overall inventory health. We saw a steep slowdown in home transaction velocity and home price appreciation from all-time highs, caused by a spike in interest rates and subsequently a change in mortgage rates at a speed we have not experienced in 40 years. As a result, these macro shifts had led to a faster slowdown in housing than we had forecasted. To navigate this market movement, we have substantially increased our spreads since May, which position our acquisition cohorts to meet or exceed our margin expectations. Second, we are prioritizing inventory health and selling data our existing inventory with price reductions that are in line with the speed at which the market is moving. While this will lead to sequentially lower contribution margins in the second half of the year, these are discipline actions that will enable strong financial performance beyond this transition period. We will balance short-term risk management with long-term transformational investments, such as Opendoor Exclusives and our Zillow partnership, and continue to build experience that addresses the consumer needs better than anyone else out there. Importantly, we know this is our opportunity to improve our systems, strengthen our position and emerge as the best marketplace to buy and sell a home. We delivered $4.2 billion in revenue, double digit contribution margin, and $120 million of adjusted net income, our best proxy for operating free cash flow. Another $700 million in equity invested in homes, and over $11 billion of financing capacity. Moving from the second quarter and looking ahead, as Eric mentioned, we've seen the macro environment evolve rapidly over the course of Q2, with the Fed aggressive response to curb inflation resulting in the largest quarter-on-quarter increase in mortgage rates in 40 years. This led to a marked change in housing market momentum, and a faster the typical seasonal shift as waning affordability sidelined many homebuyers. While the absolute level of transactions has moved lower, it remains in line with 2018 and 2019 and above the 2014 and 2017 levels. In other words, homes are still selling, but at a slower pace than the record high sell-through rates seen in Q1 and early Q2. In terms of HPA, there's usually a consistent seasonal month-over-month pattern to home price changes throughout the course of the year. HPA sharply accelerates in mid-February, peaks at the end of the first quarter and then gradually moves to around zero during the third quarter, resulting in low to no HPA in the second half of the year. In contrast, the speed with which HPA moves from peak levels early in Q2 was faster than our expectation and sharper than typical seasonal home price declines. Our performance for the second half of the year will reflect this transition in the housing market to lower transaction velocity, lower HPA and longer holding times beyond normal seasonal trends. As discussed in our shareholder letter, we've taken and are continuing to take swift and decisive actions to one, adjust pricing to sell homes expeditiously and two, adjust new acquisition home pricing to reflect market conditions and enable those cohorts to perform in line with our target expectations. Our focus on inventory health, and risk management informed three key pricing decisions we made in a quarter. First, we substantially increased spreads embedded in our acquisition offers beginning in May. However, given how quickly our spreads increased, and the time lag we have between making an offer and when an acquisition closes. Second, we have adjusted down listed prices on our inventory to stay in line with the market to drive sell-through. Finally, we are continuing to operate with sustained higher spread levels for the new acquisitions we're making. Our Q3 guidance contemplates the impact of this actions, as well as a broader range of outcomes that could arise given uncertain market conditions. Our revenue outlook is for $2.2 billion to $2.6 billion, which reflects expectations for fewer homes sold in the quarter, given a slower resale pace, as well as the impact of a lower acquisition pace that subsequently impacts resale volumes. The impact of our decision not to cancel offers in Q2, price reductions we're taking on inventory to clear and anticipated resale mix. In summary, we recognize that market conditions will continue to be fluid in the second half of the year, we will continue to be nimble and responsive. We have a very strong balance sheet by design, with cash and marketable securities totaling $2.5 billion and $11 billion of financing capacity. Clearly, we have the resources and are well positioned to successfully navigate this transition in the housing markets. So I guess like few thought, so one, it seems that this is out hard business to forecast on a quarterly basis, just given the near-term volatility, but as you play this out over bigger numbers, it's more predictable. So I guess one, would you think about potentially maybe shifting to annual guidance. And then two, obviously, there's a fixed cost base you need to cover and when you don't, when you slow down as you're got into the second quarter, you don't cover that. That being said, this partnership with Zillow is obviously pretty significant what it could save you on marketing. Hey, Jason, it's Carrie, I'll take the first part of that. I mean, that's ultimately what we've been navigating here. I mean, what we're navigating is a very different macro forecast and what we had been embedding in our expectations, we had been building spreads and increases in those for a long time as you know, .in anticipation of a housing slowdown that would be in line with other past slowdowns. But what we saw was this, very large and very fast moving rates in a single quarter. Outside of that, I think our systems are doing exactly what they're designed to do, which is responding very, very quickly, adjusting prices to market and we've been raising spreads and new acquisitions. With respect to the Zillow partnership, we're excited about what's ahead there. We do think it has the potential to help us serve meaningfully more customers over the midterm, the team's, given that we just announced the deal today are hard at work putting that together and we expect it to be live in the coming months. For us, it's a major milestone on, our journeys have every homeowner in the country start their move with an Opendoor offer. We're combining and Zillowâ\u0080\u0099s category leading audience of over 200 million monthly uniques with our leading platform and solution, and we're excited about the potential of that offers. Hi, thanks for taking the question. So if we're just comparing the environment and volatility today versus 3Q of 2021, I think when you guys first started widening your spreads, I think you mentioned in the letter you're starting to see flattening out of the month-over-month changes in HPA. And then sticking with mortgage rates, I mean, we've seen them starting to come down recently. I mean, with respect to the spread increases, again, as you mentioned, we have been increasing spreads going all the way back to last fall. But we moved them up to what was been record levels really starting in May, on the heels of all the changes we saw and mortgage rates, moving up quickly. And we continue to operate today if those sustained higher levels of spreads, in part because of the housing market continues to be quite fluid. Again, I unload the forecast that I think what we want to do right now is focused on clearance, risk management and build into fresher inventory. And as we acquire new homes, we're doing that with substantially higher spreads. And I would say the spreads we're operating with now would embed, frankly, a more negative macro outlook than what we're seeing in this very moment. But again, that's a risk management decision. Great, thanks for taking my questions I have two, so the first one kind of following up on the prior question of demand. So this pullback in demand, are you seeing this across all of your markets and do you think his is a temporary pullback. In terms of what we're seeing across markets, we are absolutely seeing different performance and trajectory across our market footprint. On the east coast, our markets are tending to perform well, particularly in the southeast and Florida. And our western markets, notably Phoenix, Vegas, Sacramento, and Tucson are a bit more challenging. Broadly, I think it highlights the importance of having a 50 plus market footprint and the geographic diversification that offers. Yes, with regards to the long-term vision around exclusives, what I can say is that we know how broken the processes to buy home, and it feels more like Craigslist and Amazon. A few features that we launched are one, there's a buy now price and this really removes multiple counterparties and the need for negotiations and you probably bought a home and there's a lot of back and forth, a lot of uncertainty. We provide appraisal price match guarantee, which removes the issue around price and gives our customers peace of mind that they are paying a fair price. And then lastly, we built an Ecommerce like experience and it's really magical. Opendoor, we actually found that by providing these homes exclusively on Opendoor it drives us audience so it's another way we're using our unique supply to aggregate direct buyer demand. And this can have significant positive impact on economics, obviously, because with a direct demand funnel, we can lower the transaction costs through fees close times, and increased services attach. I do view this as an important start of a fundamental shift in why and how direct buyers work with Opendoor, and it does unlock a tremendous amount of opportunity in the medium term for us. And equally, as we -- as we're looking at the third quarter and lower volumes, we're able to take some of that flexible capacity out of the system. In terms of the pace of market launch, we're in 50 markets, 50 plus markets across the country covering 30% of all transactions. So we feel very good about that footprint, we are still opening markets. But our focus, given the dynamic market environment right now is really on managing the existing footprint that we has. Hi, thanks for taking the question. Just looking ahead, and given the volatility I understand that this might be difficult to answer. And we're also becoming very good at servicing buyers and understanding how to resale homes efficiently improving that experience for agents and buyers, and watching exclusives on top of that. And we have buyers coming to the platform and delighting them, and really centered around Opendoor homes. The answer is yes, we're managing that growth with proper spreads to ensure that we hit our contribution margin targets while also managing risk. And so it's early days, and our playbook for market launch is very focused early on making sure we feel really good about the quality of our underwriting and as we're proactively managing against the dynamic macro that we've been talking about, we're looking at each and every market. But as you'd expect, in our more complex markets, we're slowing our pace as we manage that book of inventory. Hi, everyone, thanks for taking the questions. So on the impairment, we don't break out it by geography or by month of cohort, but I would say it is meant to reflect as of June 30th, our expectations for HPA and resale policies at the time. With respect to your second question around conversion and fee, and I think one of the things we've been talking about for a little while and it's become, frankly, more significant as of late is that notwithstanding higher spreads, we have seen conversion, outperform our expectations on a spread adjusted basis. So just unpack your comment, we have a service fee, that's static in all our markets, it's 5%, we manage spread via value we provide to the customer. So now we're seeing the fact that spreads have increased, I'd say we still see conversion performing quite nicely on a spread adjusted basis. And importantly, as we see the housing market start to stabilize, our expectation is that we can start to adjust spreads over time, and it's a two way door for us will be able to grow back into acquisition volumes. And if I can squeeze one more in on the expense levers you're pulling in relation to that I think the $190 million you're guiding to for 3Q, and how much more room is there for efficiencies to the extent the market does continue to deteriorate. So for example, in the first half, nearly 40% of our home operations tasks were carried out by third party labor, where we're in process of dialing that capacity back. Second, we're focusing our marketing spend on our most efficient highest return channels, given the high spread environment. In Q2, I think we talked about seeing record offers which was obviously good to see. And what we know is that as we grow awareness of our solution, we grow the business ultimately over time and so certainly we're seeing those investments, move the needle. Okay, and if I can follow up with just one more bridging off one of the prior questions, the $82 million mark I'm curious about that against the language that you've stated that you may look to reduce prices to be able to clear out some of this inventory going forward. My comment was just we impair homes, and we value them based on what we know at the time, based on a floor expectation of where home prices are going, and the resale policies we have in place. But given how dynamic the market is, right now, we're going to continue to adjust pricing and resale policy as we work to drive clearance across the entire portfolio. To close this out, I want to say that we're focused on a long term. We spent the past eight years improving, and making efficient how we buy homes."
}