{
    "symbol": "OPEN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 21:01:02",
    "content": " Additional information that could cause actual results to differ from forward-looking statements can be found in the Risk Factors section of Opendoorâ\u0080\u0099s most recent annual report on Form 10-K for the year ended December 31, 2022, as updated by our periodic report filed after that 10-K. Any forward-looking statements made in this conference call, including responses to your questions, are based on managementâ\u0080\u0099s reasonable current expectations and assumptions as of today and Opendoor assumes no obligation to update or revise them, whether as a result of new information, future events or otherwise, except as required by law. In the meantime, we are going to manage our cost structure in light of how expected volumes are pacing this year and next, with the goal of returning the business to adjusted net income profitability in 2024, assuming some normalization in the housing market. We delivered $2.9 billion of revenue, down 25% versus prior year due to slower resale clearance rates and our decision to reduce our acquisition pace beginning midyear during a time of significant market uncertainty. As we enter 2023, we are highly focused on preserving capital and operating with strong cost discipline, our goal is to return the business to positive adjusted net income upon delivering approximately $10 billion of annualized retail revenue, which we expect to achieve by mid-2024. Your line is now open. Your line is now open. I can tell you, for us suitable tends to be a jumping off point for a lot of home sellers to get back in the market and as we have been decreasing spreads since last year, thereâ\u0080\u0099s a lag in our business between offer to contract and we do expect to see a pickup in volume as we move through the second quarter. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}