{
    "symbol": "CGBD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 09:53:03",
    "content": " Good morning, and welcome to Carlyle Secured Lending's first quarter 2022 earnings call. Thank you, Dan, and good morning, everyone, and thank you all for joining us to discuss Carlyle Secured Lending's first quarter 2022 results. First, I'll provide an overview of this quarter's financial results. Our total net investment income was $0.47 per common share, which included $0.07 of non-recurring income derived from the successful exit of our investment in SolAero. We declared a total dividend of $0.40 per share, representing an annualized yield on our stock of over 11%. The dividend payments are comprised of our $0.32 base dividend, plus $0.08 of our regular supplemental dividend of recurring earnings above the base dividend. As Tom will detail later, we expect dividends which have landed between $0.38 and $0.40 in recent quarters to remain in that range, with the potential for upside as we progress through the rest of the year. Net asset value per share of $17.11 saw positive progression for the eighth consecutive quarter, up 1.2% from Q4 2021. As Tom will discuss further, strengthening credit performance, especially in our watchlist names drove our first quarter's results, and outpaced any negative valuation impact from widening market yields, or inflation driven earnings impacts. We repurchased an additional $7 million of our common stock in the quarter, resulting in $0.03 of accretion to our net asset value. We funded $114 million of new investments in the first quarter, almost all of which were in a first-lien position. As a result, we ended the quarter with just under $1.9 billion of investments, essentially flat versus last quarter. As you've heard from us before, and will continue to say, our strategy is to leverage Carlyle's integrated investment platform to derive edge at each step of our investment process, from origination, to underwriting, to portfolio management. The last time we reported earnings, we spoke about the ongoing transition, we perceived from 2021s one-way market to what was shaping up to be an increasingly complex investment environment in 2022. Based on this largely domestic lower cyclicality exposure profile, our primary investment focus in recent months has been the knock on inflationary impact, principally in food and fuel, which are currently layering in on top of their already inflationary environment. Through the first quarter, and as far as our data indicates continuing in the second quarter, U.S. consumer spending remains resilient on the back of strong balance sheets and supportive labor market conditions. So, while we do see a favorable base case for credit performance developing, we must all also acknowledge it will be several quarters before the net annualized impacts of increased costs and price recovery are fully settled and known for any given borrower. Not surprisingly, coming out of COVID, we redoubled our focus both in new underwriting and portfolio management on understanding the detailed puts and takes affecting the current and near-term performance of each borrower, something that has only become more critical as inflationary pressures built in recent months. Ultimately, the continued recovery from our watchlist and COVID impacted names outweighed both inflation-driven earnings or market yield driven valuation impacts, resulting in another quarter of positive NAV progression. Importantly, our three remaining non-accrual investments all continue on a positive trajectory, a trajectory which, if it holds, will likely result in the return to accrual status for portions of those exposures this year. After exiting a record year in 2021, M&A leverage loan and high yield volumes market wide were down in Q1 2022 by 17%, 9%, and 38% respectively quarter-over-quarter. It's important to say even in this environment, we continue to see ample attractive investment opportunities as private credits have meaningful share from liquid markets in the first quarter, and more importantly, our already strong platform continues to grow its capabilities. But at Carlyle Secured Lending, we're happy to report that portfolio construction, credit performance, and income generation all remain well-positioned. Well, first, you'll recall our dividend policy complements our base dividends with consistent quarterly supplemental dividends with excess recurring income. Second, given the complexity of today's environment, we assess that this is not the time to reach for risks in order to push earnings. Today, I'll begin with a review of our first quarter earnings. Total investment income for the first quarter was $48 million, up from $44 million in the prior quarter. Total expenses increased modestly in the quarter from $22 million to $23 million, as higher incentive fees were partially offset by lower interest expense and lower management fees. The result was net investment income for the first quarter of $25 million, or $0.47 per common share that matches the highest level in the history of the company. And even after adjusting for non-recurring SolAero income, we still achieve $0.40 for the quarter. On May 2, our Board of Directors declared the dividends for the second quarter of 2022 at a total level of $0.40 per share. That's comprised of a $0.32 base dividend, plus an $0.08 supplemental, which is payable to shareholders of record as of the close of business on June 30. This simply means instead of the $0.40 plus per share we've achieved in the last two quarters, we maybe a touch lower in 2Q as LIBOR at 3/31 was close to the level of our typical 1% floor. In the back half of 2022, we begin to see a net positive impact and again for every 33 basis points of additional increase in LIBOR we'll experience a $0.01 increase in NII each quarter. In each of the last four quarters, we've earned or distributed at least $0.38 per share. All things considered, our shareholders should have confidence that future quarterly payments for the balance of 2022 will continue to meet or exceed this level. On valuations, our total aggregate realized and unrealized net gain was $5 million for the quarter, the eighth consecutive quarter of positive performance. The total fair value of transactions risk rate is 3% to 5%, indicating some level of downgrades since we made the investments, improved again this quarter by $6 million in the aggregate. Before I turn the call over to the operator, I'd like to reiterate that as always, we are focused on using our platform to directly originate the widest possible range of private credit transactions in the market."
}