{
    "symbol": "FRPH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 12:08:06",
    "content": " Finally, completion of these three aforementioned land development projects, plus the final warehouse at Hollander will add just shy of 2 million square feet of additional warehouse product to our industrial platform that, when added to the other assets in operation at Hollander business park and Cranberry, will total nearly 2.4 million square feet. Bryant Street's phase one, our transit oriented mixed use project just north of Union Station in DC, saw its total residential occupancy increased to 89.5% and retail occupancy remained at 71.4% as of year-end. So, to summarize, as year's end, the six apartment retail projects, including Dock 79, Maren, Bryant Street, Verge, Riverside and .408 Jackson totaled 1,827 apartments in operation, which represents a 67% increase over the fourth quarter last year. Strong renewals and rental rate increases along with lease up of the placed in service projects helped to increase FRP's share of the NOI for these six projects to 2.6 million in the fourth quarter 2022, a 29% increase over the same period last year. Strategically, with our new partnership with Steuart and MRP, we have the ability to build something really, really special in one of the great cities of the world, 3 million square feet, 3,000 units, 150,000 square feet of retail, and all of that encompassing the south entrance of the nation's capital, that's a really amazing opportunity. And then to the extent that we do buy back shares, to own more of this incredible aggregate business, which is nothing that I've seen anywhere in any of my other investments, I'm just saying from someone who owns a good chunk of â\u0080\u0093 this is a meaningful position in my portfolio, I'm comfortable owning more of the aggregate business and the waterfront in DC and your Greenville projects, just letting you guys know that from one long term shareholders perspective, I have no problem if we wind up â\u0080\u0093 if every shareholder winds up owning more and more of the aggregate business."
}