{
    "symbol": "CPLP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-03 12:31:09",
    "content": " Turning to the Partnership's financial performance, net income for the fourth quarter of 2022 was $21.1 million compared with net income of $40 million for the fourth quarter of 2021. Turning to Slide 3, total revenue for the fourth quarter of 2022 was $79.9 million compared to $63.6 million during the fourth quarter of 2021. Voyage expenses for the fourth quarter increased to $3.8 million compared to $3.2 million in the fourth quarter of 2021 due to the increase in the average size of our fleet and the increase in voyage expenses incurred by the Cape Agamemnon employed under voyage charters, compared to the respective period of 2021. Total vessel operating expenses during the fourth quarter of 2022 amounted to $17.3 million, compared to $14.9 million during the fourth quarter of 2021.the increase in vessel operating expenses was mainly due to the net increase in the average number of vessels in our fleet. General and administrative expenses for the fourth quarter of 2022 amounted to $4 million, compared to $2.7 million for the year before. Net income for the fourth quarter of 2022 also includes a foreign exchange gain of $3.4 million from the physical conversion of the euro cash balances to U.S. dollars during the quarter, and interest earned on our cash deposits presented under other income/expense net. As of the end of the fourth quarter, the Partner's capital amounted to $638.4 million, an increase of $112.9 million compared to $525.5 million as of yearend 2021. The increase reflects net income of $125.4 million for the year end 2022, $6.6 million of CPLP common units transferred to the seller upon delivery of the Manzanillo Express, and the authorization associated with the equity incentive plan, partly offset by distributions declared and paid during the period in a total amount of $12.2 million, the repurchase of common units for an aggregate amount of $5.9 million and other comprehensive loss of $4.8 million. The decrease is attributable to the scheduled principle payments for the period of $85.2 million debt repayments in connection with the sale of certain of our container vessels, the repayment in full of two of our credit facilities, the repayment of $10 million seller's credit and the $5.5 million decrease in the U.S. dollar equivalent of our Euro denominated bonds as of year and 2022."
}