{
    "symbol": "SAMG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 02:29:52",
    "content": " Expenses for the third quarter were $21.9 million, representing approximately a 13% decrease from expenses of $25.3 million for the same period last year. Compensation benefits expense decreased by $2.5 million, or approximately 13% to $16.3 million for the three months ended September 30th of this year from $18.8 million for the three months ended the same period a year ago. Adjusted EBITDA which we define as EBITDA without giving effect to equity based compensation expense and non-core non-recurring items, was approximately $8.2 million or 20.1% of revenue for the quarter, compared to $10.3 million or 30.9% of revenue for the same period last year. Adjusted net income, which we defined as net income without giving effect to non-core and non-recurring items, and income tax expense, assuming a corporate rate of 26% was approximately $5 million for the quarter, or $0.35 cents and $0.34 cents for adjusted basic and diluted earnings per share respectively. Looking at the nine months, revenue was approximately $94.7 million, which represented a 3% decrease over revenue of approximately $97.8 million for the same period last year. Expenses for the nine months ended September 30th of this year, were $60.3 million, representing approximately a 21% decrease from expenses of $76.6 million for the same period last year. Compensation expense decreased by $2 million or approximately 4% to $52.9 million for the nine months ended September 30th of this year, from $54.9 million for the same period last year. General and administrative expenses decreased by $14.3 million, or approximately 66% to $7.4 million for the nine months ended September 30th of this year, from $21.7 million for the same period last year. Adjusted EBITDA was approximately $27.6 million, or 29.1% of revenue for the nine months ended September 30th of this year, compared to $30.4 million or 31.1% of revenue for the same period last year. Quickly looking at the balance sheet, total assets as of September 30th were $205.1 million, compared to $229.3 million as of the end of last year. As of September 30th of this year, total borrowings were $6.3 million and total Class A stockholderâ\u0080\u0099s equity was approximately $87.1 million as of September 30th of this year."
}