{
    "symbol": "SAMG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 10:15:17",
    "content": " The firm's second quarter 2022 revenue decreased year-over-year to $32.2 million and our total AUM now stands at $28.7 billion The firm's quarterly adjusted EBITDA was approximately $9.2 million and annualized adjusted EBITDA run rate of $36.7 million. On July 27, 2022, Board of Directors declared a quarterly dividend of $0.18 per share of Class A common stock that dividend will be paid on or about September 23, 2022 to shareholders of record as of the close of business on September 16, 2022, that was an increase of $0.01 over our previous dividend. As disclosed in our earnings release for the second quarter, discretionary AUM as of June 30 of this year was $20.4 billion and total AUM as of June 30 of this year was $28.7 billion. Looking further at the quarter, again, revenue was $32.2 million, representing approximately a 3% decrease over revenue of approximately $33.1 million for the same period last year. Expenses for the second quarter were $20.2 million, representing approximately a 21% decrease from expenses of $25.8 million for the same period last year. The compensation and benefits decreased by $0.5 million or approximately 3% to $18 million for the three months ended June 30 of this year from $18.5 million for the three months ended June 30, 2021. General and administrative expenses decreased by $5 million to $2.3 million for the three months ended June 30 of this year from $7.3 million for the three months ended June 30, 2021. Adjusted EBITDA which we define as EBITDA without giving effect to equity based compensation expense and non-core and non-recurring items was approximately $9.2 million or 28.5% of revenue for the quarter compared to $10.4 million or 31.5% of revenue through the same period last year. Adjusted net income, which we define as net income without giving effect to non-core and non-recurring items and income tax expense assuming a corporate rate of 26% was approximately $5.8 million for the quarter or $0.40 and $0.39 per adjusted basic and diluted EPS respectively. Looking at the first half, revenue was $65.7 million and that represented approximately a 2% increase over revenue of $64.3 million for the same period last year. Expenses for the first half were $30.3 million, representing approximately a 25% decrease from expenses of $51.3 million for the same period last year. This decrease was primarily attributable to a decrease in general and administrative expenses of $13.5 million, partially offset by an increase in compensation expense of $0.5 million. Looking at the balance sheet, total assets at June 30 were approximately $207.3 million compared to $229.3 million as of the end of last year. Good morning, Rick and Scott. Good morning, Rick and Scott."
}