{
    "symbol": "BLRX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-22 15:22:03",
    "content": " I want to begin this morning with an update on our lead program for Motixafortide, now known by its trade name APHEXDA, in stem cell mobilization for autologous transplantation in multiple myeloma patients. Recall that in November, we announced that the FDA had accepted our new drug application for APHEXDA in stem cell mobilization and assigned a PDUFA target action date of September 9, 2023. There are many drivers of this growth but older patients undergoing stem cell transplantation, together with more effective induction regimens are making subsequent mobilization of an adequate number of stem cells required for transplantation quite challenging. More recently, we were also very pleased to hire hematology and transmit commercial veteran, Kevin Campbell as Head of U.S. Kevin has the ideal background and skill set for this role, having previously served as Head of Transplant at Sanofi where he led a 23-person commercial team, whose portfolio included plerixafor for stem cell mobilization. We also previously announced a collaboration with GenFleet Therapeutics, pursuant to which GenFleet will execute a rigorously designed, randomized Phase IIb clinical study assessing Motixafortide in combination with a PD-1 inhibitor and standard-of-care chemotherapy and approximately 200 first-line metastatic PDAC patients in China. Recognizing the clear unmet need for a more effective mobilization regimen and leveraging our work in stem cell mobilization, we entered into a clinical trial collaboration with the Washington University School of Medicine to evaluate Motixafortide for stem cell mobilization in sickle cell disease. Initiation of Phase IIb randomized clinical trial with 200 patients, assessing Motixafortide in combination with the PD-1 inhibitor and standard-of-care chemotherapy as a first-line metastatic PDAC therapy with collaboration partner GenFleet in 2023."
}