{
    "symbol": "BLRX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 13:51:07",
    "content": " Recall that in mid-December of last year, we held a pre-NDA meeting with the FDA to obtain agreement from the agency that our single Phase 3 Genesis study would be sufficient to submit an NDA from a tech support site as a stem cell mobilization agent for autologous bone marrow transplantation in multiple myeloma patients. Based on the above need for better mobilization agents, growth in this market over the last few years has been driven by the increased upfront use of plerixafor plus G-CSF combination therapy to drive stem cell mobilization, especially in multiple myeloma patients. We believe that based on its differentiated clinical data, coupled with its favorable pharmacoeconomic data, which we will recap in a moment, Motixafortide plus G-CSF has the potential to gain a significant share of the market and become a new standard-of-care for stem cell mobilization in patients undergoing autologous stem cell transplantation. Both studies identified significant cost savings by using Motixafortide driven by its ability to optimize the mobilization and collection of stem cells, and therefore reduce the number of aphoresis sessions, in turn driving benefits to the patients, centers and payers. Together with the data previously mentioned from the Genesis trial, showing that nearly 90% of patients collected an optimal number of cells for transplantation following a single administration of Motixafortide and in only aphoresis session versus less than 10% for G-CSF alone. I mean that was sort of, that I think, in any event, the idea would be, I think even you know, when we're speaking with partners, obviously, this is a, this is a market that's, you know, custom-made to really focus on the top 80 institutions, because they represented the -- top 79 institutions represent over 80% of all the Stem Cell Transplantations in the U.S. Yes, well, the short elevator pitch would be a bit depending on how many stories there are in the building, but I have to say that one aphoresis session, we can mobilize the target number of cells, and 90% of the cases, we can give much more certainty to the aphoresis units regarding the amount of aphoresis sessions that the patients have to undergo because right now, the scheduling and logistic issues are, you know, a nightmare at these institutions."
}