{
    "symbol": "HYRE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 19:48:09",
    "content": " Before we get started, I'd like to take this opportunity to remind you that during this call, we will be making forward-looking statements within the meaning of federal securities laws regarding HyreCar Inc. We saw strong car-share demand to support gig based services and despite persistently elevated prices in the used car market, we also maintained available supply on the platform with a substantial increase in new owner accounts. Reflecting the higher year-over-year growth in mobility versus delivery bookings observed by Uber, HyreCar also saw a shift in driver by service type with a 5% decrease in percentage of rental days attributed to delivery and a 5% increase in rental days attributed to rideshare. In addition, through our strategic initiatives to increase vehicle supply, we have also observed an unexpected trend in owners shifting a greater share of their inventory from other platforms to HyreCar’s, a competitive advantage unique to HyreCar as the car sharing for rideshare and delivery services have longer rental periods resulting in the lower operational cost and more consistent revenue for owners. The year-over-year favorable revenue growth delta of 23 points over 5% increase in rental days continues to stem from; pricing and risk control enhancements including dynamic pricing, and a favorable market trend in daily rental rates reflecting constrained car supply. Revenue growth organically accelerated in Q2 boosted by increasing rental volume and is currently trending between $10.2 million and $10.7 million, which will deliver HyreCar’s highest revenue quarter so far. Looking ahead, we have entered Q2 of 2022 with renewed organic growth and increased revenue forecast between $10.2 million and $10.7 million for the quarter, as well as improved margin from seasonal patterns and continued cost and pricing improvements. On the gross margin line, obviously, the biggest expense is insurance cost, you have insurance premium and then also claims expenditures and what we’ve seen in Q1 was actually an increase in accidents per rental day due to the winter season, very typical in the insurance industry and that set us back a bit in the quarter, but it does not take away that our improvement in the margin and over two quarters of last year, we managed to improve the gross margin by ten points."
}