{
    "symbol": "YETI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 10:55:25",
    "content": " Our innovation during the year was a bit heavier on the cooler side of the business, and we were particularly successful with hard coolers last quarter as the new wheeled Roadie 48 and 60 coolers were introduced to the wholesale channel as overall category inventory was well positioned for holiday demand. Drinkware sales increased 8% to $308 million, with results once again highlighted by bottles and customization and as well as the fourth quarter launches of Yonder and the new Rambler straw mugs into the D2C channel. While we acknowledge that this range falls below our long-term target of 10% to 15% growth, it does reflect the estimated impact of the stop sale of products affected by the proposed recalls and our expectations of wholesale sell-in to start the year. Looking at the drivers of full year sales, we expect growth in the D2C channel will offset the decline in the wholesale channel driving our D2C mix to approximately 60%. Investing in our business will remain a priority as we expect capital expenditures to be higher year-over-year at approximately $60 million, reflecting incremental investments across a number of key initiatives, including a global IT rollout, expanded customization capabilities, accelerated retail openings and product expansion. Good morning and what I would say, as we think about the return to growth, and you heard me say it and you heard Mike say, as we look across the product portfolio we have, the innovation pipeline, the opportunity to continue to engage with consumers in the U.S. market through our direct channels and our incredible wholesale partners. We feel like weâ\u0080\u0099ve made appropriate the appropriate assessments and judgments working in collaboration with CPSC and make sure that weâ\u0080\u0099re following the right approach and that weâ\u0080\u0099re thinking about this thoughtfully for the business and for the brand and for our products and primarily and most importantly, for our customers, I think when you think about the â\u0080\u0093 so itâ\u0080\u0099s tough to put a collar on a range of outcomes because we put forward what we think is the appropriate assumptions and thatâ\u0080\u0099s whatâ\u0080\u0099s baked into our 2022 and 2023."
}