{
    "symbol": "YETI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 15:35:03",
    "content": " As we look towards the second quarter and back half of 2022, we are focused on delivering brand and product innovation to our customers, building deep brand engagement with new and existing customers as we expand our powerful depth and breadth marketing efforts, accelerating our unique omni channel strategy including a comprehensive data-driven approach to build strong engagement from acquisition through retention, and finally exploiting untapped international growth by capitalizing on the momentum we have created outside the United States. Looking at our first quarter financial highlights, our net revenues increased 19% continuing a consistent trend of strong top line growth since 2019, delivering a three-year compounded annual growth rate of 24%. Included in this quarter's performance, we drove double-digit growth in both our product categories and across both our channels, while our international business reached a record high of nearly 13% of overall sales. This incorporates approximately flat second quarter earnings compared to $0.68 in the year ago period, followed by strong growth in both the third and fourth quarters primarily as gross margin comparisons, continue to ease. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. So that is a significant opportunity for driving awareness, driving growth with a portfolio that over the last five years being active in Canada, Australia, we've shown is relevant, and can be a growth driver beyond the strong growth we continue to deliver in the U.S. As we think about penetration, one of the things that we look at is, are we penetrating deeper with our consumers and deeper into their lifestyle? You may proceed with your question."
}