{
    "symbol": "IRIX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 22:11:03",
    "content": " Third quarter was highly productive for IRIDEX, highlighted by a 29% increase in placements of Cyclo G6 systems globally, the launch of Cyclo G6 in China and the US soft launch of our next generation retina laser systems at the American Academy of Ophthalmology. In the third quarter, revenue totaled $14.6 million, growth of 10% compared to the third quarter of 2021 and importantly 6% sequential quarterly growth despite elevated foreign exchange headwinds and typical summer seasonality. In the glaucoma market, G6 system placements grew 29% compared to the prior year period with 54 systems shipped, representing a strong appetite for adoption of our non-incisional approach to treat glaucoma both in the US and internationally. In Q3, G6 probe unit sales in the US grew 6% while probe revenue grew 10% as ASP increased compared to the third quarter of 2021. To drive increased G6 adoption, we're focused on educating clinicians on the updated dosing recommendations and the benefits of MPTLT used earlier in the treatment continuum as a pre-incisional intervention, as published by our clinical consensus panel, plus expanding adoption among comprehensive ophthalmologists and adding users at surgery centers that already have Cyclo G6 systems. While we expect growth to return internationally and increase domestically, the third quarter lags caused us to expect G6 probe sales for the year of about 60,000 versus guidance of 61,000 to 63,000. Starting with revenue, total revenue for the third quarter was $14.6 million, up $1.4 million or 10% from $13.3 million in the third quarter of last year and nearly $900,000 sequentially despite Q3 being seasonally weakest quarter of our fiscal year. We sold 13,700 Cyclo G6 probes in the third quarter, an increase of 2% from the prior year period and a decrease of 9% quarter-over-quarter. Total product revenue from our Cyclo G6 product family was $3.5 million, up 10% compared to the third quarter of 2021. Other revenue, which includes royalties, services and other legacy products, increased 4% to $2.4 million in the third quarter of 2022 compared to the same period in 2021."
}