{
    "symbol": "UGP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 16:30:23",
    "content": " As you can see in the chart in the upper left side, our recurring EBITDA from continued operations totaled R$873 million in the first quarter of 2022, 16% higher than that in the first quarter of 2021 positively impacted by improved results from the three businesses. Ultrapar's net income in the first quarter was for R$161 million, 236% above that in the first quarter of 2021, mainly on the back of a stronger EBITDA, as well as the net effect of the cessation of depreciation from discontinued operations in the amount of R$65 million in compliance with IFRS 5. Moving on, on the bottom left chart CapEx from continuing operations, totaled R$304 million in the quarter, 28% above that of the first quarter of 2021, mainly due to greater investments in Ipiranga. In the last quarter, we also register an operating cash consumption of R$1.183 billion, compared to R$128 million in cash generation in the first quarter of 2021. The increase is mainly explained by three factors, the consumption of cash with working capital during the first quarter, I just mentioned, the payment of dividend made in March 2022 and the lower financial result impacted by the higher interest rates. I remind you that this cost of debt does not include the negative effect of the cash flow hedge in the financial result, which amounted to R$48 million in the first quarter of 2022, an effect that we will no longer have with the conclusion of the sale of Oxiteno. SG&A in the first quarter was 21% higher year-over-year due to greater personal expenses, mainly collective bargaining agreements and increased variable compensation, which is aligned with the progression of results of Ultragaz, in addition to higher expenses with legal proceedings and freights. Ultragaz EBITDA therefore reached a record level for first quarters of R$213 million, an increase of 42% over the first quarter of 2021, resulting from the pass- through of LPG cost increases despite higher expenses. Average installed capacity of the company reached 955,000 cubic meters in the first quarter of 2022, a 13% growth year-over-year on the back of the startup of operations of the Vila do Conde term now in December 21 and the expansions in tank capacity implemented in Itaqui terminal over the last 12 months. Ultracargo’s net revenues were R$197 million in the first quarter, 15% higher than that of the first quarter of 2021, led by contractual readjustments and higher amount of cubic meters sold due to the capacity expansions. Ultracargo’s EBITDA reached a new record level of R$114 million in the first quarter, 23% higher than that of the first quarter of 2021, resulting from the expansions with profitability gains, contractual readjustments, and lower expenses due to operational improvements highlighted by Décio also in the Ultra Day. Ipiranga’s SG&A increased 14% in the quarter due to higher freight expenses in line with the increase in diesel prices, higher provision for doubtful accounts and higher expenses with AMPM company operated stores, which increased from 79 units in the first quarter of 2021 to 229 units this quarter. The other operating results line totaled negative R$110 million in the first quarter of 2022, down R$91 million compared to the first quarter of 2021, mainly due to higher expenses with carbon tax credits. Ipiranga’s EBITDA totaled R$620 million in the quarter, 10% higher than that in first quarter of 2021, also recurring EBITDA was R$594 million, 7% above the first quarter of 2021 as a result of recovery margins despite higher expenses. Ipiranga’s recurring EBITDA margin was R$110 per cubic meter, compared to R$104 per cubic meter in the first quarter of 2021 and R$94 per cubic meter in the fourth quarter of the 2021. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much."
}