{
    "symbol": "UGP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 08:22:05",
    "content": " As you can see in the chart, in the upper left side, our recurring EBITDA from continuing operations totaled R$890 million in the third quarter of 2022, 50% higher than that of the third quarter of 2021, driven by improved results from the three businesses. Ultraparâ\u0080\u0099s net income in the third quarter was R$83 million, R$292 million lower than the net income of the third quarter of 2021, mainly due to one-off effects which affected the results from both quarters. In the third quarter of 2021, we had the positive effect of income tax reversion over monetary adjustment for tax credits in the amount of R$196 million, which I remind you that occurred due to a favorable decision from the Brazilian Supreme Court in that quarter. Investments from continuing operations totaled R$524 million in the third quarter of 2022, 23% higher than that of the third quarter of 2021, mainly due to higher investments in Ipiranga. The higher cash generation resulted from working capital cash release on the back of fuel price reductions during the third quarter of 2022, as well as inventory management, despite the lower EBITDA as in the third quarter of 2021 included the results from Oxiteno and Extrafarma. Ultragaz SG&A in the third quarter of 2022 was 20% higher than that of the third quarter of 2021, due to higher expenses with personnel, mainly collective bargaining agreements in variable compensation aligned with the progressions of the result, along with higher expenses with sale commissions. The companyâ\u0080\u0099s average installed capacity was 955,000 cubic meters in the third quarter of 2022, a 9% growth year-over-year on the back of the start-up of operations of the Vila do Conde terminal in December 2021 and the tankage capacity expansions implemented in the Itaqui terminal over the last 12 months. Ultracargoâ\u0080\u0099s net revenues totaled R$225 million in the third quarter of 2022, 26% higher than that of the third quarter of 2021, led by contractual readjustments and by higher cubic meters sold due to capacity expansions. Combined cost and expenses were 18% higher than those in the third quarter of 2021, mainly impacted by costs and expenses of the Vila do Conde terminal, which started operations in December 2021, accounting for about 60% of this increase and a higher depreciation costs arising from capacity expansions and investments made in the last 12 months and the effect of inflation over personnel and inputs. Ultracargoâ\u0080\u0099s EBITDA reached a record level of R$136 million in the quarter, a growth of 34% year-over-year due to capacity expansions with profitability gains, contractual readjustment, as well as productivity and efficiency gains. As we had anticipated in the last conference call, Ipirangaâ\u0080\u0099s margins were more pressured in the third quarter of 2022 compared to the ones we reported in the first half 2022.This occurred especially due to the inventory losses with the reduction of prices announced by Petrobras and the reduction of the ICMS tax rate. Ipirangaâ\u0080\u0099s SG&A increased by 8% in the quarter, due to higher expenses with freight influenced by the increases in diesel prices and higher sales volume, higher expenses with personnel, especially due to collective bargaining agreements and higher variable compensation aligned with the progression of results and higher expenses with AmPm company operated stores, which increased from 149 units to 255 units or year-over-year. The other operating results line totaled negative R$176 million in the third quarter of 2022, down R$181 million compared to the third quarter of 2021, mainly due to higher costs with carbon tax credit and extemporaneous tax credits recorded in the third quarter last year. Ipirangaâ\u0080\u0099s EBITDA totaled R$533 million in the quarter, 34% higher than that of the third quarter of 2021. Recurring EBITDA was R$483 million, a growth of 41% year-over-year on the back of improved margins and higher sales volume, despite increased expenses the higher costs with carbon tax credit."
}