{
    "symbol": "UGP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 15:07:03",
    "content": " As you can see in the chart in the upper left side, our recurring EBITDA from continuing operations totaled R$750 million in the first quarter of 2020, 4%, lower than that of the fourth quarter of â\u0080\u009921 due to lower EBITDA at Ipiranga despite Ultragaz and Ultracargoâ\u0080\u0099s higher EBITDA. Looking at the yearly result, our recurring EBITDA from continuing operations total R$3.6 billion, a 39% growth compared to 2021 with record results registered at Ultragaz and Ultracargo and results recovery at Ipiranga. Ultraparâ\u0080\u0099s net income in 2022 was R$1.8 billion, 108% higher than that of 2021 due to the growth of the business's recurring EBITDA, in addition to the extraordinary tax credits, despite the higher financial expenses. Investments from continuing operations totaled R$1.8 billion rise in 2022, 12%, higher than that in 2021, mainly due to higher investments in Ipiranga as a result of greater opportunities for operating services stations. We registered in 2022 cash generation from operations of R$ 2 billion lower than in 2021 resulting from higher investments in working capital mainly due to fuel price increases throughout the year, despite the higher EBITDA from continuing operations. I like to point out that the numbers of net debt of the first quarter of â\u0080\u009822 do not include pending receivables of R$ 1.1 billion related to the sales of Oxiteno and Extrafarma, should they be considered our leverages would be worth 1.4x in the fourth quarter of â\u0080\u009822. The Ultragaz SG&A in the first quarter â\u0080\u009822 was 33% higher than that of the fourth quarter of â\u0080\u009821 due to hire expenses with personnel, mainly collective bargaining agreements and variable compensation, aligned with the progression of results, along with higher expenses with sales commissions, expansion and productivity projects and freight. Ultragaz recurring EBITDA reached a record level of R$365 million, 65% higher than that in the fourth quarter of â\u0080\u009821. Ultracargoâ\u0080\u0099s net revenues totaled R$ 228 million in the fourth quarter of â\u0080\u009922, 22% higher than that of the fourth quarter of â\u0080\u009821, led by contractual readjustments and by high cubic meters sold mostly at Vila do Conde. In 2022, Ultracargoâ\u0080\u0099s net revenues was R$ 867 million, 22% higher year-over-year, also resulting from contractual readjustments and higher cubic meters sold, mainly due to the capacity expansions. Combined cost and expenses were 15% higher than those in the first quarter of â\u0080\u009921, mainly impacted by costs and expenses of the Vila do Conde terminal, which started operations in December â\u0080\u009821, accounting for about 42% of this increase. Ultracargoâ\u0080\u0099s EBITDA totaled R$ 130 million in the quarter, our growth of 28% year-over-year, due to capacity expansions with profitability gains, contractual readjustments as well as efficiency and productivity gains. For this current quarter, we expect Ultracargoâ\u0080\u0099s good operating performance to continue with results at similar levels to those seen in the second semester of 2022 and gradual growth, Vila do Condeâ\u0080\u0099s contribution due to greater handling of products . Ipirangaâ\u0080\u0099s SG&A decreased by 16% in the quarter, due to the positive net effect of credits and provisions of R$69 million realized in the first quarter of â\u0080\u009822. The other operating results line total negative R$110 million in the fourth quarter of â\u0080\u009822, compared to a positive R$15 million in the fourth quarter of â\u0080\u009821, mainly due to higher costs with carbon tax credits and lower constitutional extemporaneous tax credits. Ipirangaâ\u0080\u0099s EBITDA totaled R$ 1.1 billion in the quarter, 53% higher than that of the fourth quarter of â\u0080\u009821. Recurring EBITDA R$316 million, a reduction of 41% year-over-year, due to more pressure on margins in the quarter as I mentioned before, despite the higher sales volume. In 2022, Ipirangaâ\u0080\u0099s recurring EBITDA totaled R$ 2.1 billion, 24% growth year-over-year, due to better margins and higher sales volume throughout the year, partially offset by higher expenses. Thank you very much. Thank you very much. Thank you very much. Thank you very much."
}