{
    "symbol": "ETON",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 04:27:14",
    "content": " This transaction, we sold these products to Dr. Reddy's Laboratories for payments that could total up to $50 million. Under the terms of this agreement, Azurity will be responsible for commercializing Zonisade and Eton will be entitled to receive a $5 million payment upon product launch or 90 days after approval whichever occurs first. These milestones -- these payments together are more than 17 million -- with our $17 million of cash on hand as of the end of the quarter and our growing product sales will enable us to finance our growth and continue investing in new, high-value rare disease products. Following the divestiture of our hospital business, we expect 2022 revenue between $20 million and $25 million, including licensing revenue of at least $10 million and product sales of $10 million to $15 million. Eton reported revenue of $7.4 million in the second quarter of 2022, representing growth of 139% over the prior year period. Product sales and royalty revenue for the quarter was $2.4 million, representing our sixth straight quarter of sequential growth. Second quarter revenue was negatively impacted by a $200,000 inventory allowance related to the hospital products divestiture and our requirement to cease commercializing Rezipres ampules at the end of this year. This reduction is due to lower R&D activities as a number of our products that incurred expenses in 2021 have now been approved and a $500,000 onetime licensing payment for the ZENEO autoinjector in the prior year period. In addition, we expect to receive a $5 million milestone payment upon the launch of the recently approved Zonisade product before the end of this year. So with continued growth of ALKINDI and carglumic acid and a $5 million milestone expected to be received before the end of the year related to the Zonisade launch, we expect to have slightly more cash on hand by the end of the year."
}