{
    "symbol": "LQDA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 14:47:09",
    "content": "  Operator: Good morning, and welcome, everyone, to the Liquidia Corporation Third Quarter 2022 Financial Results and Corporate Update Conference Call. Following the presentation, we will conduct a question-and-answer session, instructions will be provided at that time for you to queue up for questions. Joining the call today are Chief Executive Officer, Roger Jeffs; Chief Financial Officer, Mike Kaseta; General Counsel, Rusty Schundler; and other members of the Liquidia management team. Before we begin, please note that today's conference call will contain forward-looking statements, including those statements regarding future results, unaudited and forward-looking financial information, as well as the company's future performance and/or achievements. These statements are subject to known and unknown risks and uncertainties, which may cause actual results or performance to be materially different from any future results or performance expressed or implied on the call. I'd now like to turn the call over to Roger for our prepared remarks, after which we will open the call up for your questions. Notably, and as Rusty will expand upon shortly, we achieved outcomes in our legal proceedings that have simply affirmed on appeal will allow us to launch YUTREPIA as all of the asserted patent claims have been found in at least one proceeding to be invalid or not infringed. Our primary goal is to obtain the affirmations of these favorable decisions as quickly as possible so that YUTREPIA can become an important treatment choice for patients, physicians and payers. The two primary unique product pillars that resonate firmly with patients and physicians are, one, the high degree of tolerability and associated dose flexibility enabled by our PRINT formulation; and two, the ease of use of the low-resistance device. We have observed in our open-label extension exposures â\u0080\u0093 sorry, we have observed in our open-label extension study exposures up to 238.5 micrograms of YUTREPIA, which equates to greater than or equal to 27 breaths of TYVASO, which, as you may know, has a label therapeutic target of only 9 to 12 breaths per session due to tolerability limitations. Specifically, the ability to modulate YUTREPIA dose over a wide range makes it customizable for a broader spectrum of PAH patients from patients naive to therapy, in place of oral prostacyclin therapy or for patients intolerant to oral prostacyclin therapies, from transitions from other less flexible inhaled therapies and even patients improved from parenteral therapies, given patients will now be able to achieve parenteral-like dose exposures. With this broad and customizable dose profile, it is easy to envision that YUTREPIA can quickly assert itself as the highest utility treprostinil, obviating the need to endure the rough specific side effects of oral and parenteral therapy. These dosing benefits are further augmented by the second product pillar of YUTREPIA: the ease of use of the low-resistance dry powder inhaler, a device that is robust to patient misuse scenarios and without specific orientation requirements, either of which could result in poor drug delivery or even spillage from the competitor's high-resistance device. With these product attributes and benefits, it is easy to envision that YUTREPIA can quickly become the best-in-class and first-in-choice prostacyclin, both in PAH and PH-ILD populations. Although, the District Court ruled against Liquidia on the '793 patent, that ruling will be overridden by the PTAB decision on the '793 patent if it is affirmed on appeal. Thus, if the decisions we have received from the District Court and the PTAB are all affirmed on appeal, Liquidia will be able to see final approval of YUTREPIA. If the rehearing request is similarly denied, we would anticipate that the appeal of the PTABâ\u0080\u0099s decision on the â\u0080\u0098793 patent will likely take approximately 12 to 14 months from the date of the denial. If this was to occur, that could accelerate our projected time line of the appeal by several months. In summary, we remain confident that the conclusion â\u0080\u0093 at the conclusion of the appeals process we will be found not to have infringed any valid patent claims, allowing us to seek final approval of YUTREPIA from the FDA. In those documents, you will see that revenue was $3.2 million for the three months ended June 30, 2022, compared to $3.2 million for the same quarter in 2021. Cost of revenue was $0.7 million for the quarter, which was the same compared to the third quarter of 2021. Research and development expenses were $4.5 million for the quarter, which was the same compared to the third quarter of 2021. The increase of $1.8 million was primarily due to a $2.2 million increase in commercial, marketing and personnel expenses in preparation for the potential commercialization of YUTREPIA offset by a $0.9 million decrease in legal fees related to our ongoing YUTREPIA-related litigation. Other expenses in the quarter totaled $0.3 million, an increase of $0.1 million over the same quarter last year related to interest expense due to a higher debt balance and interest rate on our debt with Silicon Valley Bank. All totaled, we incurred a net loss in the third quarter of 2022 of $9.1 million or $0.14 per basic and diluted share compared to a net loss of $7.3 million or $0.14 per basic and diluted share for the third quarter 2021. We ended the third quarter with cash and cash equivalents totaling $98.3 million as compared to $57.5 million as of December 31, 2021. At this time, I would now like to open the call for questions. Your line is open. So as you know, the market exclusivity for Tyvaso PH-ILD expires at the â\u0080\u0093 in March of 2024 and weâ\u0080\u0099ve confirmed with the FDA that no additional studies are required for the expansion of our label to include PH-ILD indication. So for us, what we need to do is submit a request for that approval at an appropriate time in advance of the March 2024 deadline. Your line is open. I guess, first, I was curious if we could get any visibility on the generic Remodulin business for next year, just if there would be any growth expected or if we should again just kind of expect a flat kind of business there. Iâ\u0080\u0099m sorry, it took me a minute to dial into the call, but with respect to United Therapeutics request for a hearing and if that is, in fact, denied, could you help us understand what the time line might be for an appeal process for them, I think, on the â\u0080\u0098793 patent. And then if youâ\u0080\u0099ll entertain a third question, just curious how you guys are thinking about financing right now going through next year and getting through 2024 and beyond. So Mike, if you could answer the question about generic Remodulin trajectory and then also how weâ\u0080\u0099re looking at financing and then pass it to Rusty to talk about the request for hearing time line. So as it relates to generic Remodulin, as we said earlier today, weâ\u0080\u0099ve seen unit increase on a quarterly basis each quarter since the launch of subcu in Q2 of 2021. So although weâ\u0080\u0099re continuing to see that growth, we would not see â\u0080\u0093 we would not expect to see a significant increase in revenue as we get into 2023 and 2024, although it remains a very important strategic product for us as we prepare to launch for YUTREPIA. Looking at financing, as we said, we ended the quarter with about $98 million in cash. So with that, let me turn it over to Rusty on the rehearing request question. So as I noted earlier, United Therapeutics requested two things in response to the PTAB decision. The Precedential Opinion Panel review has been denied, which clears the way for the original PTAB panel to now make a ruling on the rehearing request. I think your question primarily relates to the end of the time line after â\u0080\u0093 if rehearing request is denied, what does the time line look like after that. So as I mentioned earlier, sometimes the Federal Circuit will do something called the summary affirmance where within days after the oral argument theyâ\u0080\u0099ll issue their decisions rather than taking months to write opinion. So again, that 12 to 14-month time period there are opportunities for fairly significant number of months to be taken off that time line. And maybe just a slight clarification there, too, is with respect to the POP process, I think you had mentioned to me previously, Rusty, that, that, in fact, could offer some of those synergies. The â\u0080\u0093 I guess my question is the POP denial that we just went through, I think you previously had told me that provides synergies in the process and time efficiencies. So I think our view of the Precedential Opinion Panel requests, as we had indicated in our press release several weeks ago, we think that they have directed the original panel to clarify their opinion. But I think it should make for a better appeals process because, again, the issues will just be much clearer before the appeals court as to what the record of the PTAB was. Operator, next question please. Your line is open. So if, for instance, the â\u0080\u0098793 appeal was resolved first and it was affirmed, thatâ\u0080\u0099s all we would need to then seek final approval from the FDA. But from a time line perspective, getting to an appeal decision in the Hatch-Waxman is not a part of the time line. Operator, next question please. Your line is open. And the importance of that data, in essence, was that weâ\u0080\u0099re showing higher dose exposures as we said in the opening up to 238.5 micrograms, which would be 27 breath equivalents per session of Tyvaso. And I think the other thing it does, which we tried to talk to in the opening, is that itâ\u0080\u0099s going to avail itself to a broader reach of patients across a greater continuum and we think can help displace oral therapy. So as an example, I think just last week, United Therapeutics' press release, what they called the EXPEDITE study, and that study used parenteral induction to get patients to clinically impactful oral doses. So to me, what that study acknowledged was that dose is important because what they were trying to do is drive dose for oral by using a three to eight-week induction period, both in the hospital and out of hospital. The fact that it took eight weeks to ramp and was done, as I said, sometimes as an in-patient shows you how sort of cumbersome just doing that would be. And then the transition from that induction on parenteral back to oral, again, took one to three weeks, again, including in-patient studies so â\u0080\u0093 in-patient transition. And then interestingly, during the induction, which was supposed to solve to get patients to dose, patients experienced headache, nausea and vomiting. So to me, that is a perfect example and a relevant publication to show the value of YUTREPIA and how it can be used both early in the treatment course as the first choice and best choice prostacyclin. But I think I'll take this time to maybe talk about a little bit how we can springboard off these exciting learnings from not only our published INSPIRE data, but also our ongoing INSPIRE open-label extension study in addition to the device robustness that Roger just talked about. And really understand that over the next year and prior to launch, we'll be definitely moving forward with several sort of Phase 4-esque like clinical studies, really focusing our positioning YUTREPIA as the highest utility and best-in-class and first-of-choice prostacyclin therapy across PAH that will maximize our experience for this launch. And in particular, we would like to focus on studies utilizing concepts from these learnings, including sort of rapid and high dose titration strategies to improve clinical risk profiles, improve exercise capacity that is customizable to treat various severities as well as low, as well as intermediate and high risk strata inclusive of incident and prevalent patients with pulmonary hypertension. And finally, we'll also focus on gaining real-world experience using YUTREPIA on patients with pulmonary hypertension associated with interstitial lung disease, all to prepare us for our pending launch. I think what you're saying, and we appreciate the question, Matt, is the importance of dose and the flexibility that YUTREPIA ports to all different kinds of patients we think really will establish it again as the best choice and the first choice. Your line is open. And then lastly, on the appeals for the District Court ruling, just give us some time lines on that. So as to when we expect the rehearing request decision, as I think we may have said on prior calls, the PTAB's internal goal for processing rehearing requests is one month from the date the rehearing request was submitted. With the Precedential Opinion Panel decision having now come down, the path is cleared for the PTAB â\u0080\u0093 the original PTAB panel to make a final decision on the rehearing request. And as evidenced by our experience with the '901 patent, in that instance, it took the PTAB panel seven months before they issued a rehearing decision. Second, as far as the â\u0080\u0093 when we would know whether the 12 to 14-month time period I described could be shortened, that is unclear. So for instance, if it's a summary affirmance, if that's one of the things that would shorten time periods, we won't know that until the decision is made. So we would go into the oral argument and then three days later, an opinion would come down, and that's when we would know. So again, we won't know necessarily in advance when that â\u0080\u0093 when and if that time period will be shortened. Finally, on the appeals from the District Court, there as well we think it's a 12 to 14-month process from the date the notice of appeal is filed. So again, we think 12 to 14 months is a reasonable time period from then. And in fact, because there we'd be hoping to overturn a decision, you can't get a summary affirmance if something is to be overturned. So with no further questions, again, we thank you for joining us today and look forward to reporting our continued progress in the coming quarters."
}