{
    "symbol": "LQDA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 10:55:03",
    "content": " Joining the call today are Chief Executive Officer, Roger Jeffs; Chief Medical Officer, Dr. Rajeev Saggar; General Counsel, Rusty Schundler; Chief Financial Officer, Mike Kaseta; and other members of Liquidia management. Before we begin, please note that todayâ\u0080\u0099s conference call will contain forward-looking statements, including those statements regarding future results and forward-looking financial information, as well as the companyâ\u0080\u0099s future performance and/or achievements. These statements are subject to known and unknown risks and uncertainties, which may cause our actual results or performance to be materially different from any future results or performance expressed or implied on this call. I would now like to turn the call over to Roger for our prepared remarks, after which he will open up the call for your questions. Over the last three months, weâ\u0080\u0099ve continued to gain momentum across all areas of the company as we build towards our primary objective of preparing for the potential launch of YUTREPIA, an inhaled dry powder formulations to treprostinil. In the marketplace we continue to build the awareness and reputation of Liquidia amongst key stakeholders involved in delivering treatments for PAH, while also increasing utilization of treprostinil injection. In the clinical arena, we published data from the completed INSPIRE trial in the Journal of Public Pulmonary Circulation, which validates the enduring value and therapeutic potential for YUTREPIA to be a game changer for PAH patients. In illegal forums, we advanced down the path towards YUTREPIAâ\u0080\u0099s final approval for the PTAB and validating all claims of the 793 patents. On the balance sheet, we continue to build for launch, while being efficient with our use of capital and inside the company, we continue to build our high performing culture, hiring key people to enable both near- and long-term success of our products and pipeline. With immediate focus on the potential launch of YUTREPIA, we are committed to the continued scientific research and education efforts in pulmonary hypertension for patient, clinician and the broad community. Now as the Chief Medical Officer, I am poring over the robust clinical data that includes longitudinal patient exposures to YUTREPIA, exceeding three years between the INSPIRE study and ongoing extension trial. In fact, we recently announced a publication of the completed INSPIRE trial, which included patients treated between eight months and 18 months before enrolling into the extension trial. In reviewing the data, I was pleased to confirm that YUTREPIA can be safely titrated across doses comparable to three to 24 breaths of Tyvaso, indicating that a wide range of therapeutic doses can be easily administered just a few breaths from one or two capsules of YUTREPIA as compared to nebulizers. In fact, of the 121 patients enrolled, more than 90% completed treatment at the primary month to endpoint and when combined with exposure data from the extension study, we saw that more than 75% of patients completed treatment of at least 12 months. Only one patient reported no preference after two weeks, but at four months 100% of transition patients preferred YUTREPIA. All of this data has been enabled by our proprietary PRINT formulation of unified dry powder particles, ideally sized in the respirable range to enhance drug exposure, while using an inhaler very familiar to clinicians who have treated tens of thousands of COPD and asthma patients with a similar device. Though we are not required to generate new clinical data to seek pulmonary hypertension associated interstitial lung disease in the YUTREPIA label, we will look for opportunities to fully explore YUTREPIA with a held -- with the help of the wider community. Iâ\u0080\u0099d now like to ask Rusty Schundler, our General Counsel, that youâ\u0080\u0099ve never seen our legal case to summarize our key legal advances in just this past quarter. First, we have submitted all post-trial briefings in our Hatch-Waxman litigation in the United States District Court for the District of Delaware. Thus with the submission of all post-trial briefings, the court now has all of the material required to reach a decision on the alleged infringement of the API manufacturing patent, which we refer to as the 066 patent and the method of use pen, which we refer to as the 793 patent. Second, we have successfully concluded the inter partes review of the 793 patent with the Patent Trial and Appeal Board or PTAB, ruling in July that all claims are unpatentable. However, coupled with United Therapeutics prior stipulation of partial judgment in favor of Liquidia with respect to the 901 patent, another patent that was initially asserted against Liquidia, the PTABâ\u0080\u0099s ruling means that even before the decision in the Hatch-Waxman litigation, Liquidia has now received favorable rulings with respect to two of the three patents initially asserted by United Therapeutics against Liquidia. In those documents, you will see that revenue of $3.9 million for the three months ended June 30, 2022, compare to $3.4 million for the same quarter in 2021. It is important context that despite the decrease in our profit split percentage from 80-20 to 50-50 in Q3 2021, quarterly revenues have increased each quarter since the launch of treprostinil . Cost of revenue was $0.7 million for the quarter, which was the same compared to second quarter 2021. Research and development expenses were $5.2 million, compared with $4.6 million, a $0.6 million increase from the same quarter last year split between timing of manufacturing related to the YUTREPIA program and a one-time charge for personnel related costs. General and administrative expenses were $6.9 million, compared with $4.4 million, a $2.5 million increase of which just over half was due to increases in commercial, marketing and personnel expenses in preparation for the potential commercialization of YUTREPIA. Other expenses in the quarter totaled $0.5 million, an increase of $0.3 million over the same quarter last year related to higher interest expense on our debt with Silicon Valley Bank. All told -- all totaled, we incurred a net loss in the second quarter of 2022 of $9.4 million or $0.15 per basic and diluted share, compared to a net loss of $6.5 million or $0.13 per basic and diluted share for the second quarter of 2021. As of June 30th, cash and cash equivalents totaled $103.8 million, as compared to $57.5 million as of December 31, 2021. Thanks for the question. So the launch timing from once we have a successful resolution of the Hatch-Waxman trial, we believe will be between weeks to a maximum of, say, two months and really thatâ\u0080\u0099s just us resubmitting for final approval will be a small bit of final safety data that will submit along with that. So those are going to be contingent on final resolution of the Hatch-Waxman trial, because as we have been and will continue to be, weâ\u0080\u0099re trying to be efficient with our use of capital. Operator, next question please. So, on your first question, regarding the timing of District Court decisions, itâ\u0080\u0099s hard to predict when the courts can rule. Again, we think itâ\u0080\u0099ll be before the end of the 30 months day at the end of October, but beyond that, could theoretically be any day. On the second question, on the differences between 066 patent and the 901 and 793. Operator, next question please. So I think for us, the things that resonate with the physicians and the patient community is, is the therapeutic, what Iâ\u0080\u0099ll call, the therapeutic flexibility of YUTREPIA, its ability to titrate its AE profile and its durability of use, which Rajeev mentioned in his opening comments. I think what is exciting to the community is another opportunity to provide this form of inhaled treprostinil through a low resistance device, specifically, YUTREPIA. I think the ability to provide for strength to different capsules, at least up to the 106 microgram dose and then to be able to continue to titrate to doses beyond what is typically known as nine to 12 breaths that weâ\u0080\u0099ve seen with Tyvaso, so I think itâ\u0080\u0099s going to be well received. This is the first time weâ\u0080\u0099re going to be able to offer patients opportunity to continue to match their clinical symptoms, a need by uptitrating Tyvaso deemed, sorry, uptitrate YUTREPIA deem fit by the provider. Thanks for the question. Operator, next question please. So Iâ\u0080\u0099ll just say what weâ\u0080\u0099ve said publicly, which is that the label will include doses -- I have describe the exposure during the INSPIRE trial up to 212 micrograms four times a day. So that would be an equivalent of 24 breaths or more Tyvaso, given four times a day and weâ\u0080\u0099re obviously doing it in two to four breaths per session. So bit what I like to call a game changer, really change, completely changes the delivery profile of inhaled treprostinil both to be flexible therapeutic in terms of dose and also in terms of ease of administration. So, again, really working hard to focus all our attention on the launch of YUTREPIA and blessed with a product profile that the product supports. Thanks for the question. Operator, next question please."
}