{
    "symbol": "BAP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 10:57:05",
    "content": " In terms of asset quality, the structural NPL ratio dropped to 4.9%, driven by strong origination levels, while the structural cost of risk rose to 1.1%, reflecting a less favorable macroeconomic outlook. Regarding key quarter-over-quarter dynamics, net interest income growth was driven by an uptick on structural loans, mainly due to the SME PMIC corporate and consumer segments. Regarding asset quality, NPL volumes increased within expectations and provision expenses grew 48.2%, driven by credit cards and consumer loans, reflecting an unusually low base last quarter. On a year-over-year basis, growth in net income was driven by a 20.2% increase in net interest income, which was bolstered by rising interest rates and 15.3% increase in structural loans measured in average daily balances. Retail banking structural loans expanded 14% year-over-year, driven by SME PMIC, where we were penetrating new lower ticket sub-segments by leveraging data analytics and digital channels. Operating expenses grew 16% driven by higher expenses for IT to bolster transaction capacities, an uptick in transactional cost for loyalty program benefits accumulated to credit card use, growth, environmental compensation driven by surpassing business targets and more investment in disruptive initiatives. From a year-over-year perspective, net interest income registered solid growth, driven by 20.3% growth in the structural loans and by a yield increase through effective pricing strategies. At Mibanco Colombia, year-over-year results were driven by 14% growth in net interest income, which was attributable to a strong loan growth, accompanied by an uptick in productivity. On a quarter-over-quarter basis, total assets under management fell 10% and income generation dropped 8%, which was primarily fueled by capital markets, where our fixed income trading strategy is performing unfavorable and by - and due to Asset Management, which was affected by a decrease in total management fees related to lower market value of funds. On a year-over-year basis, Credicorpâ\u0080\u0099s structural loans portfolio grew 14% year-over-year, driven by BCP and Mibanco, while Reactiva loans, investment and cash and due from banks materially contracted."
}