{
    "symbol": "BATRA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 14:04:10",
    "content": " Before we begin, we'd like to remind everyone that this call includes certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Actual events or results could differ materially due to a number of risks and uncertainties, including those mentioned in Liberty Media's most recent Forms 10K and 10Q, or Liberty Media Acquisition's most recent Forms 10-K and 10Q, filed with the SEC. These forward-looking statements speak only as of the date of this call and Liberty Media and Liberty Media Acquisition expressly disclaim any obligation or undertaking to disseminate any updates or revisions to any forward-looking statements contained herein to reflect any change in Liberty Media or Liberty Media Acquisition's expectations with regard there to or any change in events, conditions, or circumstances on which any such statement is based. On today's call, we will discuss certain non-GAAP financial measures for Liberty Media and SiriusXM, including adjusted OIBDA and adjusted EBITDA. The required definitions and reconciliations for Liberty Media and SiriusXM schedules 1 and 2 can be found at the end of the earnings press release issued today, which is available on Liberty Media's website. Today, speaking on the call, we will also have Formula One's President and CEO, Stefano Domenicali, and Liberty's Chief Accounting and Principal Financial Officer, Brian Wendling. We received $872 million of gross dividends from SIRI tax-free in the first quarter, including the special and regular dividend. We -- because of the nature of our convertible bonds, we had to pass through $30 million of that special dividend. We continued our share repurchases, repurchasing $182 million across LSXMA  from February to April. Now looking at Sirius XM itself, a solid start to the year, continued to perform well financially despite a challenging auto market. New car penetration for SiriusXM is now at 83% and has enabled a fleet of 146 million cars here in the U.S. As expected, self-pay net adds were down slightly due to challenges in the auto market. I'd also note we launched our first-ever streaming channel, Freakonomics, dedicated to podcasting and available across all the SXM platforms. SXM media was named the number one podcast ad network, according to Edison Research, and we represent four of the top 15 podcasts in the country with the addition of Crooked Media in this month. Also beginning with this year's masters, SiriusXM is the exclusive audio provider for the tournament and providing excellent programming across all four rounds. Five Live's first best quarter ever, including -- given another record quarter at Ticketmaster. And compared to 2019 AOI is up two times, transacted GTV is up 39% and sponsorship AOI is up 75%. Concert ticket pricing is up, double-digits over 2019 due to fan demand for the best seats and over 90% of our plan sponsorship net revenue is already committed. Turning to Formula One Group, on the corporate side, we repurchased 348,000 F1 shares for $20 million or 5614 a share. And looking at F1 itself, thrilling start to the 2022 season. And notably and differently than most places, Formula One and Liberty Media are self-promoting the race in partnership with local stakeholders and Live Nation. I would note that Liberty Media did enter an agreement to acquire 39 acres east of the strip to lock in circuit design and create capacity for the pit and paddock, among other hospitality and race support venues. I expect that transaction will close in the second quarter, and the purchase price was $240 million, it will be funded by cash on hand at the Formula One Group level. We announced numerous commercial announcements, including on the media right side and extension with the FOXTEL Group in Australia, and Canal + in France. Sponsorship is off to an exciting start this year with several new deals, including two new Global Partners, MSC and Salesforce. We started the season with a week-long World Series Champion celebration, including delivering World Championships rings to the players. We've completed less than 20% of the seasons, a long way to go and the last season showed how far things can change over this 162 games. We strengthened the bullpen with Janssen's addition, and we're thrilled to welcome Ron Lacoon Jr. back in the lineup this week. While it's still early in a season, financial performance has already been incredible. Going to the season we had the highest season ticket sales in more than two decades, we sold out all of our multiyear premium seats for the first time ever, and open our renovated delta club and retail and concession sales have been strong for the first few homes stands including selling out most of our gold program jerseys. Obviously, we'll announce when we have something, but I would note the environment which is very difficult as many of you know, I think it does favor us and we continue to look at some interesting opportunities. In January, we settled exchanges of the 2.25% Live Nation exchangeable bonds for a total consideration of $664 million. At quarter-end Liberty SiriusXM Group has attributed cash, liquid investments -- and liquid investments of approximately $634 million, which excludes $76 million of cash held at SiriusXM. As of May 5th, the value of the SiriusXM stock held at Liberty SiriusXM Group was $19.7 billion and the value of the Live Nation stock held was $6.6 billion. Total Liberty SiriusXM Group attributed principal amount of debt is $13.9 billion, which includes $9.9 billion of debt at Sirius XM. Formula One Group had attributed cash liquid investments in monetizable public holdings at $1.6 billion at quarter-end, which excludes $834 million of cash held directly at Formula One. Total Formula One Group attributed principal amount of debt was $3.4 billion, which includes $2.9 billion of debt at Formula One, leaving $454 million at the corporate level. And Formula One's leverage at the end of the quarter was 3.7 times, meaningfully within our target leverage range less than five times. Formula 1 estimates its cash tax rate in 2022 to be a single-digit percentage of adjusted OIBDA, increasing modestly to low double-digits in 2023 and thereafter, as a result of the UK tax rate increase that's effective next year. Additionally, Formula 1 is currently undergoing a project to refurbish and upgrade its UK based media and technology center out at Beacon Hill in the UK, which broadcast production and other technical activities and related staff are based. Formula 1 expects to incur about $40 million in incremental CapEx associated with this project, approximately half of which will be recognized in 2022 and the remainder next year. And as Gregory mentioned, we'll provide updates on that later in the year. As a reminder, under the current Concorde Agreement, team payments now take the form of an entirely variable price fund, which is now calculated based on F1's adjusted EBIT rather than adjusted EBITDA, the adjusted EBITDA measure that was used in previous agreements. Finally, at the Braves Group the quarter end, they have attributed cash and liquid investments of $311 million, which excludes $26 million of restricted cash. Braves Group had attributed principal amount of debt of $678 million as Gregory mentioned, the Braves completed their sales three minor league teams in January. Proceeds are included in our financial results as they disposition in the first quarter, and you can see additional details on that in our 10-Q, which will get filed later today. And with that, I'll turn it over Stefano to discuss Formula One. The cars now follow more closely, enabling greater opportunities for wheel-to-wheel racing, with drivers trading position multiple times, making them think most strategically above the moves. The first sprint of the season recorded a total audience of 8.4 million, a 28% versus qualifying of the same Grand Prix in 2021. The Emilia weekend on the Sky's for Italy website, recorded a 74% increase in unique user, compared to the Emilia GP in 2021. On F1 social platforms, we saw 149 million video view, up 36% versus Emilia in 2021 and 45 million engagements, a 43% increase versus 2021. As the constructions continue to refine the new cars, we expect more surprises during the season and opportunities for great racing across the grid. Through Emilia, the average oldest Grand Prix across the main Saturday and Sunday sections, is $23.8 million and is up 10% versus 2021 season average. In the U.S. the Saudi Arabian Grand Prix growth in over 1.4 million average of viewers, the ninth highest of all times and second highest on cable. Melbourne was the largest weekend ever in Australian sport in history with 420,000 fans, strong advanced ticket sales almost everywhere, suggest we may continue to see sellouts other races for the remainder of the season, including here in Miami. On the opening weekend, fans consumed 28 million hours of Drive to Survive, and the show was ranked number 1 in 33 countries. Looking towards the 2023 season, we announced the debut of the Las Vegas Grand Prix in November 2023. In fact, in the 24 hours following the official announcement, we in Las Vegas, and anchor resort saw more requests for hotel room reservation than any other one day period in their history. As Gregory mentioned, this will require investments on both the CapEx and OPEX side, and we plan to shed more on this later this year. Additionally on the race side, we announced that we extended the immediate reminder Grand Prix at the historic  track through 2025. We're pleased with the progress made in the other commercial areas, especially with our new sponsors, including several in the technology space. They would facilitate the transfer or more than 100 video fees and 250 audio channel between the venues and the F1 Medias and technology center in the UK in under 200 milliseconds, enabling us to reach over $500 million funds in 180 territories. We were also pleased to announce the renewal and expansion of our partnership with Workday, a leader in enterprise cloud application for finance and human resources. Outside of the global space, we announced a multiyear deal with MSC Cruises as a global partner, and they plan to bring their cruise ships sport side during selected Grand Prix weekends and AlphaTauri, Red Bull premium fashion brand has become the official premium fashion apparel supplier of Formula One. From 2023, the F1TV app will be available free to fox our subscribers and will provide multiple live in race feed, comprehensive life timing data, and exclusive programming on the end of the track. Of the first race of the season in Bahrain, the platform gain 427K new users and concurrent viewers where up to 144% compared to 2021. As you can see from our recent commercial announcement, our ESG goals are major focus, not only for us, but also for our partners. Our experienced promoter, the Bahrain international circuit demonstrate vision and speed by completing a major solid project that more than covered the energy requirements of the entire Grand Prix weekend. With the Las Vegas Grand Prix, I was hoping you could discuss a little bit more the decision to promote this yourselves as opposed to a third-party. And then Gregory, I think at the start of the call, you mentioned $240 million purchase for land adjacent to the site in Vegas. I think I indicated we're buying 39 acres for $240 million, and that'll be the site of the pit and paddock and some other hospitality. I think our decision to promote Vegas in conjunction with Live Nation, and local partners is driven by a couple of things. One proximity, it's fairly easy relative to being in Denver to get to Vegas for us to do the work. But I think, and more importantly, we see the opportunity to be a promoter as a way to expand our understanding the business, understand how to be the best Formula One product on the track for other promoters as well, to look at an opportunity to grow our knowledge and our understanding, and potentially promote other races down the road. And lastly, I think Vegas is going to be a large and unique -- perhaps unique opportunity. So from a financial perspective, we think this one sets up pretty well to be worthy the time extra focus to become the promoter. Stefano, I don't know what you would add. I would say that as we remember, David, Vegas has been always a place where we do believe that the association between the values of Formula One and the glamour and attractiveness, the possibility to be in that community is crucial. But I would say on top of the financial things that we can see around that business, we can be seen the enabler to maximize what potentially Vegas could be for Formula One in term of awareness, in term of business creation, in term of activating an area of the world where we can bring internationally. But for sure, our knowledge of the business and our opportunity to explore with our Live Nation partner, that I think is the best in order to make sure that in next year in November when we're going to have the race, that event will be spectacular, it will be unique, as I would say we can feel here in Miami already. I think the terms there for Miami are bit more variable than some of your other raise promotion deal, so any color there would be great. And then one more on, just on the investment in Vegas and developing that. On the last one, I don't think we're ready to talk anymore about the outlays at Vegas. And I don't think we'll need debt, we have quite a lot of cash in F1. Bryan, I mean, as you know, different form of relationship with the promoter is related to maximize the opportunities that each place can bring to Formula 1. And I think that's it's clear that what we can see, as I just arrived two days in Miami, I mean, the vibes that the we have created as Formula 1 is immense, is great. One, how we can maximize the value that Formula 1 will bring to community, but also how we can maximize the value of our partners that are coming here. At investing in Formula 1, can see us as once again, that enabling factor of creating business opportunity for them. And of course, the fact that here we invested together with our promoters, the Miami Dolphins, is because they knew the community, they have the right expertise to maximize in the shorter term as possible, what we want to bring here for Formula 1. And of course this is the first time we are here, we can see a different business model having a lot of corporate business that wants to develop the  to a different mode that is different from place to place. So this is something, that also from our side could be very important to learn in order to be even more effective when we come to Las Vegas, and we're going to be directing for the promotion of it. So on the larger question about the market environment, it's scary to try and imagine investing or catching a falling knife in this interest rate environment and stocks. It's not like we can turn around and just say bye 5% of the company in the market where we think the bottom is, we'd see -- no it's a longer cycle in finding deals, but I definitely think the environment will create opportunities for us and we'll be on the lookout. And then, on some of the new races coming back since COVID-19, really Japan and Singapore, they used to be regional sponsors for them, the pretty material ones, I think. It's on our side as a commercial right holder to make sure that we find right balance, between the number of events, the historical events, new opportunities that can become because we are a world championship. And I think if you think back a couple of years ago, as always, the right value for having a good calendar is related to the demand and to the offer that we can provide. And I think that today we are always talking about 23, 24 races, and that's what we believe today is the right number considering the success that we're living today. Of course, that's the only thing that we have announced for next year. And I would say on the other hand, you would see soon what will be our strategy and we have to respect the process as we discussed. With regards to the local promoters and sponsorship with Japan and Singapore, yesterday, we have already announced that Singapore alliance will be part of the promotional package on Singapore because for them is a very important partner and we respect that. Japan, you will discover soon that of course, for Honda, for example, because of their decision to quit officially Formula One, they could be something special that we want to recognize for them during that events. And I think that the economical benefit, of course, will go into the system, and of course also with us. One on Formula 1, revenue in the first quarter came in a little bit stronger,  most of us expected. I was wondering if you could help us maybe on packaging the drivers that , maybe across media or sponsorship rates conversion, and other revenue even  that high level. Well, I mean, for Formula 1, obviously we had two races versus one last year; and we're really back to more normal activities than we've been over the past couple of years. Also, freight costs have been up a bit and some of those costs are obviously passed on to the team, so there's incremental benefit there. If I could just add, I think we've seen growth in almost every revenue category. The fact that it was two versus one in the first quarter, recognizing that many of our revenue streams are recognized ratably than could tie to the particular race. And when I say that, I think there will be strains on the Braves potentially over the long term as the RSNs become less included in the bundle. The Braves in particular have a very strong RSN revenue stream and a lot of demand, so we may be less impacted than many. On the other hand, Formula 1 has seen increases in demand and increases in viewership and we have the U.S. media rights as commonly known up for bid right now, beginning for next year season. So that opportunity is, I think in the net were probably better off with more players bidding than their changing landscape, maybe plus or minus. And then a charter which is not the focus of today's call, we have a whole another set of dynamics where in some cases we're helped and in some cases, we may be hurt. I wanted to put one question out, which comes from an investor, but I thought it was a good question. Which is, looking at the Braves, they're trading right now at market value of maybe 3.5 times or so sales. One of the things that would seem to be opened to you, is that you now have a second ATB with Formula One and now Braves. So it would be possible to split maybe the Braves off as an actual stock which might help the value process to get people thinking about private market transactions, maybe down the road. I think we're looking at all options and considering what we might do, some of these things are more recent about when our ATB flexibility is occurred. There's some issues also, we're still looking at around SIRI and what we might do there, as you know, we just crossed over the 80 there. We've just had Formula One become an ATB, so there's some moving targets and we evaluate all opportunities, and I think your investors probably right. I'm not sure, seven times we'll see, but certainly the multiple we're trading is lower than that multiple which has been in private transactions. Whether it would still trade to that level of what it's a private sale transaction versus the public market transaction, open question. The Braves are not yet sign up for that, but we did see that a friend of the Braves family at Charter has done a recent deal with Sinclair than involved the RSNs. I'm just wondering in the past, you guys have seen very skeptical about signing up for -- to have the Braves carried on that. Well, I think that's evolving, Barton, as well. I don't know if Valley is going to be the lead player, they've got their challenges, but we're certainly open to watching how the market evolves. Another question on Formula One, please. I would say we will consolidate as Gregory said, so the revenue and CapEx will be on our books as well as the costs. And also as Gregory said, we would expect that -- we need to ultimately find  once we have the race, but our expectation right now is that you would see the revenues go into their traditional buckets. And then to the extent we're selling tickets, we would expect that that probably goes into our promoter revenues. So it'll look very similar except for the fact that we're consolidating the costs which normally -- and all the revenue, whereas under normal promoter relationship, we just have that fee. And I guess if you look at the 24 - ish races or whatever, some of those obviously you are in iconic places, where you probably won't self-promote. We're going to start to see where -- how we do this, hopefully make the success of it that we believe we can make it. I think that the beauty, if I may say that, of this moment is it's -- because the new promoters are really putting new energy and new vibes into the system. But with this in mind, I would say we're very happy with the promoters that are working with us. They're very, very loyal -- reliable partners on which we're going to build up even a stronger future together. Clearly, you have a take-off in the U.S. for Formula 1, which is really going to help with ESPN at the same time. You've got a lot of geopolitical changes, Sochi going away, but whac-a-mole zero COVID-19. Particularly with the desirability of getting more better times in the U.S. if it becomes even more appealing for ESPN, would you be more inclined to look at bringing back something like Nurburgring and maybe even promoting yet yourself in some of the classic venues, and kind of going more U.S. and Europe, versus a lot of the expansion that's taken place in Asia and in the Middle East. What I can say Matt is that the Formula One and we’ve proven to be the say, flexible as possible also in the COVID-19 situation to maximize the fact that we want to have a great championship. And our duties to make sure that we, first of all, our world championship and we are investing either with partners or either with us involved directly in that to make sure that the strategic markets are becoming crucial for Formula one will be part of it. And you correctly say that U.S. has an incredible boom in the last, I would say two years. We were talking about  the general landscape is for sure a very interesting landscape in which no matter will be the promoter, we need to see what could be the action if needed, that we can recover that in the calendar. I'm sure if you want to be specific on that, something that could happen soon could be very important to be back on the calendar, but we don't have to forget that we have -- we want to vest in the Far East world because we so far been affected by COVID-19 but there is a great potential to grow there. So it's a great moment for us to maximize the opportunities, to see what would be the right schedule in the future of Formula One. So as I said, it's really our strategic thinking with regards to our future calendar. But the good news is that we can see what we rate, and we know we're doing, working with all the manufacturer. And if I may on that specific point without the same anything related to something that we can say, the good news that today Formula One is really showing the leadership in the technological landscape of the automotive business, in the multi-spot of course. And our charges related to sustainable through in the future and our strong path, that we want to prove to the world that we are really serious in the Netscope Caguan(ph) at zero within 2013. Is something that really gives us credibility, and this is the reason why everyone, not only the ones that you read, are interested to have stocks with us. Operator, I think that were done."
}