{
    "symbol": "SGRP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 13:08:06",
    "content": " Our Americas segment reported record revenue of $53.7 million, an increase of 7.8% and the Americas grew organically or on a constant currency basis by 8.1% during the third quarter. Our EMEA segment representing our joint venture in South Africa, reported revenue of $8.9 million down 7.3% and on a constant currency basis expanded by 8.3% over the prior year quarter. The countries that make up APAC for us China, Japan, India and Australia combined, delivered a gross margin of 21.2% down 590 basis points from the prior year same period, while a small dollar part of our gross profit to 29 percentage drop year-over-year in gross margin dollars from APAC lowered the consolidated gross margin percent. Third quarter 2022 net revenues totaled $69.8 million, an increase of 3.6%, which includes $53.7 million of revenues from the Americas, $8.9 million from EMEA and $7.1 million from APAC, as the U.S. dollar strengthened against other currencies this quarter and year, a number of our international businesses, particularly in Japan, in South Africa, suffered from significant foreign exchange adjustments. By segment for Q3, the Americas revenues increased over the year ago quarter by 7.8% or 8.1% on a constant currency basis, and EMEA Q3 revenue decreased by 7.3% but increased 8.3% on a constant currency basis, and APAC Q3 revenue decreased by 9.8% and it was up 0.4% on a constant currency basis. Third quarter gross profit was 12.8 million, or 18.4% of revenues compared to $12.6 million, or 18.7% of revenues in the prior year quarter. Selling, general and administrative expenses for the third quarter totaled $10.6 million, or 15.2% of revenues, compared to $9.4 million, or 14% of revenues in the prior year quarter. Net loss attributable to SPAR Group Inc., for Q3 was $32,000 compared to a net income of $1.2 million or $0.06 per share in the year ago quarter. Adjusted net income attributable to SPAR Group Inc., in the quarter was $212,000 or $0.01 per share, compared to $1.4 million or$0.07 per share in the year ago quarter. Consolidated adjusted EBITDA in the 2022 third quarter was $2.5 million, compared to $3.5 million in the prior year quarter. Q3 adjusted EBITDA attributable to SPAR Group Inc., was $1.2 million, compared to $2.4 million in the prior year quarter. For the first nine months of 2022, net revenues were $196.6 million a 0.5% from the year ago period. For the segment's year-to-date revenues were $150 million for the Americas, representing 76% of total revenues, EMEA was $27.3 million, or 14% of total revenue and APAC was $19.4 million or 10% of revenues. SG&A expenses were $30 million or 15.2% of revenues compared to $28 million, or 14.3% of revenues in the prior year nine months primarily due to a rebound of business from the pandemic. Year-to-date Q3 operating income was $6.1 million, or 3.1% versus $7.3 million or 3.7% in the year ago period. For the first nine months, net income attributable to SPAR Group, Inc., was $1.8 million or $0.08 per share, compared to $2.6 million, or $0.12 per share in the year ago period. Excluding the non-controlling interest, adjusted net income attributable to SPAR Group Inc., was $2 million or $0.09 per share, compared to $3.2 million or $0.50 per share in the year ago period. Now, turning to the company's financial position as of September 30, 2022, the company balance sheet remains strong and total worldwide liquidity at the end of third quarter was $15.3 million with $12.1 million in cash, cash equivalents and restricted cash and $3.2 million of unused availability as of September 30, 2022."
}