{
    "symbol": "SGRP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 13:22:11",
    "content": " Second quarter 2022, net revenues totaled $67.8 million, which included $53.3 million from the Americas, $9.1 million from EMEA and $5.4 million from APAC. Selling, general and administrative expenses were $10.1 million or 14.9% of revenues compared to $9.6 million or 14.3% of revenues in the prior year quarter. Operating income was $2.4 million versus $1.9 million from the prior year quarter, which resulted in operating leverage of 70 basis points, primarily driven by strong gross profit. Net income attributable to SPAR Group Inc., was $1.1 million or $0.05 per share, compared to $514,000 or $0.02 per share in the year ago quarter. Adjusted net income attributable to SPAR Group Inc., in the quarter was $1.3 million or $0.06 per share, compared to $714,000 or $0.03 per share in the year ago quarter. Consolidated adjusted EPS in the 2022 second quarter was $3 million, compared to $2.7 million in the prior year. After adjusting for the non-controlling interest, adjusted EBITDA attributable to SPAR Group Inc., in the 2022 second quarter was $2.1 million, compared to $1.8 million in the prior year. First half revenues for the Americas were $96.3 million flat versus last year and APAC reported revenues of $12.2 million down 22% compared to the year ago period,   from quarterly results apply to first half results. Gross profit for the first half of 2022 was $24.8 million, or 19.1%, of revenues compared favorably to 24.3 million or 18.9% of revenues in the prior year period. SG&A expenses were $19.3 million, or 15.3% of revenues compared to $18.6 million, or 14.5% of revenues in the prior year first half of 2022, primarily due to rebound of business from the pandemic. Operating income was $4.4 million, or 3.5% versus $4.6 million or 3.6% in the year ago period, resulting in operating leverage for the first half of 2022. For the first six months, net income attributable to SPAR Group Inc., was $1.8 million or $0.08 per share, compared to $1.4 million or $0.07 per share in the year ago period. Excluding the non-controlling interest, adjusted net income attributable to SPAR Group Inc., was $1.7 million or $0.08 per share, compared to $1.8 million or $0.08 per share in the year ago period. Consolidated adjusted EBITDA for the first half of 2022 was $5.4 million, compared to $6.2 million in the prior year, excluding the non-controlling interest, adjusted EBITDA attributable to SPAR Group Inc., was $3.6 million compared to $4.2 million in the prior year. The company's total worldwide liquidity at the end of second quarter was $16 million with $12.4 million in cash, cash equivalents and restricted cash and $3.3 million  availability as of June 30, 2022. For the six months ended June 30, 2022, net cash using operating activities were $3.5 million impacted by changes in working capital, primarily due to lower accounts payable and accrued liability balances, and capital expenditures, including capitalized software was $794,000. In the second quarter, we closed more than $10 million of net new business across the company and our pipeline is valued well over $100 million U.S."
}