{
    "symbol": "MGPI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 19:18:02",
    "content": " Turning to white goods, sales decreased 4% versus the prior year quarter. Turning to branded spirits, sales totaled $58.6 million for the quarter, a decline of 3% versus the prior year quarter. Even with a slight decline in sales versus the prior year quarter gross profit increased to $21 million or 35.8% of segment sales. Turning to ingredient solutions, sales for the quarter increased 21% to a record $29.3 million. For the second quarter 2022, consolidated sales increased 11% to $195 million as a result of sales growth in the distilling solutions and ingredient solutions segments. As such, our advertising and promotion expenses for the second quarter of 2022 increased $2.7 million to $6.1 million as compared to the second quarter 2021 primarily driven by incremental investment in the ultra premium, super premium and premium price here in our branded spirits segment. Corporate selling, general and administrative expenses for the second quarter of 2022 decreased $7.9 million to $17.9 million as compared to the second quarter of 2021 primarily due to the onetime acquisition costs in 2021 related to the Luxco acquisition that did not recur in 2022. Operating income for the second quarter increased 28% to $35.3 million primarily due to the increase in sales and gross profits and as previously discussed, the reduction in SG&A. Adjusted EBITDA for the quarter was $40.1 million a 5% decrease from the year ago period, driven primarily by increased advertising and promotion expenses for our premium plus tier spirits brands as well as increased combined costs specific to industrial and white goods alcohol and the price elasticity resulting from the additional supply that has entered these markets. We will be deliberate in all actions we take in navigating the balance of the year including continuing to further realign our production and sales mix with focus on increasing our highest-margin products, supported with increased investment in advertising and promotion to support continued growth in our premium plus tier spirits brands."
}