{
    "symbol": "MGPI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 14:40:01",
    "content": " Consolidated sales for the year increased 25% to $782.4 million, while gross profit increased 27% to $253.3 million, representing 32.4% of sales. Our Ingredient Solutions segment delivered record results both on a fourth quarter and full year basis, with sales growth of 28% and gross profit growth of 42% for the year. Looking at each segment in greater detail, sales in our Distilling Solutions segment increased 22% for the year to $428.5 million. Full year sales of premium beverage alcohol increased 28% versus the prior year, driven primarily by strong demand for both new distillate and aged whiskey Brown goods sales growth continues to outpace longer term market trends and has been primarily driven by craft as well as multi-national customers. As we have previously discussed on prior calls, these unfavorable dynamics resulted in negative gross margins for industrial alcohol and white goods and reduced gross profit by $21.2 million and gross margin by approximately 1600 basis points on a combined basis, when compared to the prior year. Moving to Branded Spirits, segment sales for the year increased 30% versus the prior year to $237.9 million. For the last three quarters of the year, total branded spirits revenue was consistent with the prior year as we continue to focus on investing behind our premium plus brands, while allowing our mid and value priced brands to perform in line with the overall category declines in these price tiers. Gross profit for this segment increased to $95.5 million for the year, or 40.1% of segment sales, which is a 600 basis point improvement in gross margin percentage versus the prior year. Turning to Ingredient Solutions, sales for the year increased 28% to a record $115.9 million, while gross profit increased to $31.5 million or 27.2% of segment sales. For the fourth quarter 2022, consolidated sales increased 15% to $191 million as a result of increased sales in our Distilling Solutions and Ingredient Solutions business segments. Gross profit increased 20% to $63.2 million, representing 33.1% of sales due to improved segment gross profit performance by all three business segments. For the full year Branded Spirits A&P spend increased to $27.3 million, which represented 11% of Branded Spirits sales with the vast majority being spent on our premium plus brands. To your point into Bill's point, top line for our Branded Spirits segment was basically consistent or flat for the prior year, but the premium plus price tiers of our portfolio were up 23%, which resulted in an 18% increase in gross profit dollars and a gross margin expansion of 630 basis points."
}