{
    "symbol": "MGPI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 16:00:10",
    "content": " The demand for aged whiskey and new distillate continues to be a growth driver with a 44.4% increase in brown goods sales for the quarter within our Distilling Solutions segment, which was previously known as our Distillery Products segment. Our premium, super premium and ultra-premium offerings contributed to the encouraging results for the Branded Spirits segment, continued growth in our higher priced American whiskey brands were key contributors to our strong gross profit results for the quarter, which represented 44.5% of segment sales. Sales of premium beverage alcohol increased 37.7%, while brown goods sales grew 44.4% from last year due to higher aged whiskey and new distillate sales. We are encouraged by the growth we're experiencing as we continue to successfully execute our premiumization strategy, increased distribution and improved pricing on select brands, as well as product mix contributed to the record results this quarter. Sales for the quarter increased 46.2%, while gross profit increased to $8.1 million or 29% of segment sales, each of which represents record results for the segment. For the first quarter of 2022, consolidated sales increased 80.2% to $195.2 million as a result of strong growth in each of the reporting segments. Operating income for the first quarter increased 144% to $50.1 million, primarily due to the increase in sales and gross profits previously discussed. Adjusted EBITDA for the quarter was $55.4 million, a 115% increase from the year ago period, driven by the solid performance of all 3 business segments. Consistent with those efforts, white goods sales for the first quarter increased by 20.6% to $20.1 million, while industrial alcohol decreased by 33.7% to $11.5 million. With the increased demand we have been experiencing for our new distillate, aged whiskey and ultra-premium spirits brands as well as texturized protein products, these investments position us well for continued sustainable growth across the organization. We're seeing the growth, and you saw the gross margin performance in Branded Spirits for the quarter, that as well was primarily driven by excellent sales of our premium plus American whiskey brands."
}