{
    "symbol": "CHWY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-01 20:12:05",
    "content": " We saw strong spending behavior from both new and existing customers, as Q1 net sales per active customer or NSPAC increased 15% and reached an all-time high of $446. Overlaying this tenure data with a consistent lifetime spending curves our customers demonstrate over time, spending less than $200 their first year, over $400 by their second year, approximately $700 by their fifth year, with our oldest cohorts spending nearly $1,000 per year, you can truly appreciate how much future revenue growth is already embedded in our active customer base, revenue potential, which we can and will unlock over time. Our Q1 gross margin performance also reflects the ongoing benefits of supply chain and logistics initiatives that we have undertaken to improve customer experience and to mitigate the higher freight costs associated with our new rate card and escalating fuel prices, which we said could be 100 to 150 basis points headwind this year. In Q1, long zone shipments to customers improved 15% and on-time delivery improved sequentially by approximately 800 basis points, resulting in lower costs and a better customer experience. Q1 advertising and marketing expenses scaled 80 basis points year-over-year to 6% of net sales; as I've articulated previously, we spend up to the level of optimal returns, closely monitoring marginal CPA and LTV levels, and our approach in Q1 was no different. Q1 adjusted EBITDA was $60.5 million, and adjusted EBITDA margin was 2.5%, a year-over-year decline of 110 basis points. First quarter Autoship customer sales increased 18.5% to $1.75 billion, outpacing total net sales growth in the quarter by 480 basis points. SG&A, which includes all fulfillment and customer service costs, credit card processing fees, corporate overhead and share-based compensation, totaled $504.3 million in the first quarter or 20.8% of net sales compared to 19% in the first quarter of 2021. Excluding share-based compensation, SG&A totaled $477.1 million or 19.6% of net sales, an increase of 170 basis points versus the first quarter of 2021. So first, as we mentioned in the prepared remarks, we ended the first quarter with 20.6 million active customers, and that is an increase of 800,000 customers, over 4% year-over-year."
}