{
    "symbol": "CHWY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-22 20:28:05",
    "content": " Q4 net sales increased 13% to $2.71 billion, which brought our full year 2022 net sales to $10.1 billion, reflecting annual growth of approximately 14%. Autoship customer sales increased 18% and generated 73% of our Q4 net sales, representing a 260 basis point increase over the prior year period. We further deepened our customer engagement with net sales per active customer, or NSPAC, growing 15% year-over-year to reach nearly $500 in Q4. Full year 2022 gross margin improved by 130 basis points to 28% in line with the high end of our long-term guidance, continued pricing strength combined with the progress we have made in our supply chain initiatives enabled us to deliver these results. Q4 adjusted EBITDA was $92 million, and adjusted EBITDA margin was 3.4%, an increase of $120 million and 460 basis points, respectively. We saw these same key drivers manifest themselves in our full year 2022 results as adjusted EBITDA nearly quadrupled from 2021 levels to over $300 million, and adjusted EBITDA margin expanded 210 basis points to 3%. Over the past four years, we have increased revenues from $3.5 billion to over $10 billion while concurrently expanding gross margins from 20% to 28% and adjusted EBITDA margins from negative 6.5% to positive 3%. Fourth quarter net sales were $2.71 billion, a $319 million or 13.4% increase year-over-year. Q4 Autoship customer sales increased 17.5% to $1.98 billion, exceeding the pace of our overall sales growth by 410 basis points. For the full year, Autoship customer sales increased 18% to $7.4 billion, with ownership customer sales representing 73% of total net sales, a new record high on an annual basis. Full year 2022 gross margin increased 130 basis points to 28%, a new full year record high. SG&A, which includes all fulfillment and customer service costs, credit card processing fees, corporate overhead and share-based compensation, totaled $561 million in the fourth quarter or 20.7% of net sales, scaling 90 basis points compared to the fourth quarter of 2021. Fourth quarter advertising and marketing was $183.4 million or 6.8% of net sales, a 40 basis point increase from Q4 2021. Wrapping up the income statement, fourth quarter net income was $6.1 million and net margin was 0.2%, a year-over-year improvement of 290 basis points. Fourth quarter adjusted EBITDA was $92 million, and adjusted EBITDA margin expanded 460 basis points to 3.4%, reflecting gross margin momentum and SG&A leverage. Full year adjusted EBITDA was positive for the third year in a row, reaching $305.9 million and adjusted EBITDA margin expanded 210 basis points year-over-year to 3%, both of which are new records for Chewy. With that, we expect first quarter net sales of between $2.72 billion and $2.74 billion, representing year-over-year growth of 12% to 13%. Full year 2023 net sales of between $11.1 billion and $11.3 billion, representing year-over-year growth of 10% to 12%, and full year 2023 adjusted EBITDA margin to be flat to 50 basis points below our full year 2022 adjusted EBITDA margin of 3%. We expect CapEx in full year 2023 to return to our historical target range of 1.5% to 2% of net sales and full year 2023 share-based compensation, including related taxes, to be approximately $250 million."
}