{
    "symbol": "CHWY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-30 18:47:03",
    "content": " Q2 adjusted EBITDA was $83.1 million and adjusted EBITDA margin was 3.4%, a year-over-year increase of 230 basis points and a sequential improvement of 90 basis points reflecting our gross margin expansion, greater marketing efficiency and improved execution in several SG&A functions that we will detail shortly. Second quarter Autoship customer sales increased 17.3% to $1.78 billion, outpacing net sales growth by 450 basis points. As a percentage of total net sales, second quarter Autoship customer sales reached an all-time high of 73.1%, increasing 280 basis points year-over-year and 90 basis points sequentially. As we move into Q3, we expect the positive price cost delta that we saw in Q2 to narrow as some costs catch up to the price increases that we saw in the second quarter, providing less of a gross margin tailwind in the back half of the year. SG&A, which includes all fulfillment and customer service costs, credit card processing fees, corporate overhead and share-based compensation, totaled $517 million in the second quarter or 21.3% of net sales compared to 20.3% in the second quarter of 2021. Excluding share-based compensation, SG&A totaled $477.2 million or 19.6% of net sales, an increase of 50 basis points versus the second quarter of 2021 and flat on a sequential basis. Second quarter adjusted EBITDA increased $59.8 million versus Q2 2021 to $83.1 million, and our adjusted EBITDA margin expanded 230 basis points to 3.4%. In terms of the mix of customers when they first joined the platform in the first purchase, the effect of the more favorable mix we're seeing in the last couple of quarters as more customers purchase consumables or healthcare products in their first order with us, you would start to see that one year out. Given the elevated inflation that has passed through Q2 and the ongoing macro trends, including lower interest towards new pet household formation, we believe that we're taking an appropriately more conservative view on consumer spending across discretionary categories such as hard goods moving forward for the balance of the year. And based on what we saw in the first half of the year and how we expect inflation, we're going to continue biasing customer spending towards food and healthcare, where we excel and away from hard goods, again, these are data points that we use to think about our second half or just our revenue projections going forward."
}