{
    "symbol": "CYBR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 10:28:14",
    "content": " In terms of the headline P&L, total revenue exceeded guidance coming in at $142.3 million in the second quarter with growth accelerating sequentially to 21% year-on-year from the 13% growth rate in the first quarter of 2022. Annual recurring revenue continues to be the best metric to evaluate the business and remain incredibly strong in the second quarter, growing 48% year-on-year and reaching $465 million. Subscription revenue generated from SaaS and self-hosted subscription contracts reached $66 million and represented 46% of total revenue in the second quarter, with growth accelerating to 144% year-on-year. For the third quarter of 2022, we expect total revenue of $147 million to $153 million, which represents another sequential acceleration of our growth to 23% year-on-year at the midpoint. We are also meaningfully increasing our full year guidance for ARR, which we now expect to be between $543 million and $549 million at December 31, 2022, or that's 38% to 40% year-on-year growth, respectively. Your line is open. We look at our historical trends, but we're also looking at the current pipeline, our current close rates and of course, quantitatively, I already discussed in my remarks kind of the impact of taking into consideration the change in FX how that's affected, how that's impacted our -- both our revenue, net income and our guidance, but we still were able to raise even with that FX impact. I think like I mentioned now, so it's -- we're pleased to be in this position where our market I would say, from a demand environment, we are in high priority and built such a big pipeline and then we can execute on it with the SaaS motion where we can land provide quick time to value so quickly to the customers and then get them into the add-on motion much faster. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. We already have a lot of secular trends pushing offering what we would add it as an additional driver where customers are trying to obtain cyber insurance the requirement is for them to have privileged access management controls, MFA, single sign-on, really the important proactive security hygiene layers, and they know that CyberArk is market-leading and can be -- they can also achieve success with us. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}