{
    "symbol": "CYBR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 12:16:04",
    "content": " Total revenue came in at $169 million for the fourth quarter, with a subscription booking mix of 90% in Q4, well ahead of our guidance framework. As we look into the coming year, our top priorities for 2023 include accelerate our Identity Security platform sales motion across PAM, EPM, Access and Secrets Management, further leverage the channel and marketing alignment to extend our reach, enhance our customer success organization at scale to ensure we protect and expand our base of ARR and deliver cutting edge innovation and extend our leadership position in Identity Security. Customers are embracing our Identity Security platform and our subscription model is delivered, resulting in annual recurring revenue growing 45% and reaching $570 million. Total revenue of $169 million, grew 12% year-on-year and was impacted by our subscription bookings mix, which hit a record 90% for the fourth quarter. That's when we compare like-for-like to the fourth quarter 2021 when the mix was just 71%, taking the calculated revenue headwind into consideration, total revenue would have grown by 27% year-on-year. Subscription revenue reached $88.5 million, growing 86% year-on-year, representing 52% of total revenue in the fourth quarter. Recurring revenue reached $142.6 million or 84% of total revenue, growing 39% year-on-year from $102.9 million in the fourth quarter last year. While we continue to make disciplined investments to drive innovation and growth, our results demonstrate our operational rigor as evidenced by our operating expenses increasing 20% to $136.1 million, resulting in income of $4.1 million, and that compared to our headwinds adjusted revenue growth of 27% in the fourth quarter. For the full year, revenue was $591.7 million, accelerated to 18% year-on-year growth versus the 8% last year. For the first quarter of 2023, we expect total revenue of $160 million to $164 million, which represents 27% year-on-year growth at the midpoint. For the full year, we expect annual recurring revenue to be between $730 million and $740 million at December 31, 2023, or between 28% and 30% year-over-year growth. The increase in our expenses fall into 3 main categories: increasing investments in our cloud infrastructure to support our record SaaS bookings in 2022, which we expect to -- which we expect will lower our gross margin for the full year to between 80% and 81%; second, making critical investments in R&D, including our SaaS and self-hosted solutions; and lastly, the investments in sales and marketing, we have deep conviction in the opportunity and our incredibly strong competitive position. And then I think if I would add to that, because you also talked about kind of post transition as we kind of continue on through the transition, we certainly would expect to see that as expansion of free cash flow in the out years as our -- as we get to already back into '24 and '25, and we're post now roundtripping our full ARR base. I would also add that in our 2023 guide, it actually even includes a $20 million headwind when we think about the kind of the last a bit of the transition as we go from kind of the high 80% mix in 2022 to well over 90% mix into 2023."
}