{
    "symbol": "CYBR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 12:20:26",
    "content": " While ARR remains the best metric to measure our success, the benefits of our subscription transition are kicking in on the top line with total revenue growth accelerating again to 26% and reaching $153 million in Q3. For the quarter, the mix was about 87%, significantly higher than the 72% in the third quarter last year which created a revenue headwind of about $11 million. With our strong execution year-to-date, the prioritization of our identity security platform, the demand for our SaaS solutions and ongoing secular tailwinds, we are significantly raising our full year ARR guidance to over 40% growth at the midpoint which Josh will talk about later in the call. The subscription portion of annual recurring revenue reached $301 million, that's increasing 117% and now represents 59% of our total ARR. Subscription revenue reached $74.2 million, growing 110% year-on-year, representing 49% of total revenue in the third quarter. Recurring revenue reached $128.5 million, that's 84% of total revenue, growing 44% year-on-year from the $89 million in the third quarter last year. Economically, the revenue headwind created by the mix was approximately $11 million in the third quarter when we compare it like-for-like to the third quarter of 2021 when the mix was just 72%. For the fourth quarter of 2022, we expect total revenue of $169.9 million to $176.9 million which represents about 15% year-on-year at the midpoint. We are also increasing our full year guidance for the annual recurring revenue which we now expect to be between $552 million and $558 million at December 31 or between 40% and 42% year-on-year growth, respectively. It's in every I would say, sales process today and gives us -- these offerings gives us also a way to get a healthy premium over standard identity solutions and really push that strategy that this is the identity security vendor. And yes, our field and channels are definitely seeing that it's part of the decision-making in the land or in the pickup of the new logos that it's -- they're looking for impactful solutions, again, to prevent breaches, prevent in an assumed breach prevent any lateral movement and massive impact of the breach and as a way for them to show that they really reduced the massive amount of risk and executing on Zero Trust strategy."
}