{
    "symbol": "CYBR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 11:41:03",
    "content": " Our strong bookings in the first quarter exceeded our guidance framework, so even with our significantly higher subscription mix, total revenue came in at $128 million creating a revenue headwind of about $21 million in the first quarter. In terms of the headline P&L, we generated total revenue of $127.6 million in the first quarter with an 86% mix of subscription bookings. Recurring revenue, defined as our total subscription plus our maintenance related to the perpetual license revenue reached $106.9 million or 84% of total revenue, that's growing 40% year-on-year. Your line is now open. Your line is now open. Your line is now open. And I would say from a leadership position, it's just a great -- we're in a great place, but we've been addressing so far, Windows endpoints, Windows servers and endpoints and Mac endpoints, and this really takes us to the Linux platform, both servers and there are, of course, Linux endpoints as well and really taking us into our customers' cloud environments and for those who are hybrid to the data centers and giving them a UVA, that same easy to manage policies for lease privilege for the Linux environment, which is so important to -- in preventing ransomware and privilege escalation and all the, I would say, non-repeatable points of attack. Your line is now open. Your line is now open. Obviously, the economy will do what the economy was doing, but I think Udi addressed it earlier on today that we have a very strong, resilient type of a business model that is basically especially now with us hitting our subscription mix at over 85%, we're really now driving towards going through to the other side of the transition towards growth and profitability. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. So, it was a great win for us. So, it was a great win for us. Your line is now open."
}