{
    "symbol": "LITE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-03 13:04:04",
    "content": " Today’s call will include forward-looking statements, including statements regarding our expectations regarding the pending acquisition of NeoPhotonics, including market opportunity, expected synergies, financial and operating results and expectations regarding accretion, time to close, strategies of the combined company and benefits to customers in the markets in which we operate as well as the impact of COVID-19 on our business and continuing uncertainty in this regard. Looking beyond these near-term supply challenges, I’m highly optimistic about our outlook and believe market inflections beneficial to us in our addressable markets will drive double-digit revenue growth in fiscal 2023 and beyond, not including the pending acquisition of NeoPhotonics. I think long term for 2023 and beyond, our confidence is really based upon the demand of – the inflection point of demand where new networks, we’ve been talking about this for over a year, new networks are starting to be deployed at higher speeds, 400 gig and new architectures for ROADMs, and that’s just at the very early stages. And we believe that through fiscal 2023, we’ll see a better supply of componentry and semiconductors that will allow us to get that double-digit annualized growth even with 3D sensing seasonality throughout the year. And so I’d say still the majority of the shortages are on Telecom Transport, but we are seeing componentry semiconductors that are impacting our ability to continue to ramp those coherent components and 10G tunables because demand is so strong as expected in those higher speeds and coherent as well as higher speeds at the edge of the network, why – which is why our 10-gig tunables are so strong. I’d say the DML business is still a headwind for us as 5G in China is now starting to consume that inventory we talked about over the last several quarters, but there’s still a little bit more work there to do before we start having really more meaningful revenue in DML. I would say that as we look forward, we’re starting to see some of that get better from the standpoint of products that we expect to get delivered late in this quarter to help us with the Q4 supply. And I think that’s what gives us confidence in our ability to start really tackling some of this very, very strong demand as we look into fiscal year 2023 and beyond. I think with the demand that Alan talked about, especially what we’re seeing on some of our higher-margin product lines, whether it’s EMLs or our laser business growing both sequentially into Q3 and expect it actually into Q4 as well, we’ll be able to offset some of those inflationary OpEx gains from better margin product shipping. As I said in the script, our expectations are that our industrial lasers business hits new record revenue levels in the coming quarters, and it’s really due to both market but also new product introductions that we’re introducing new higher-power fiber lasers. And so those seeds that we’re planting today and through this calendar year are going to pay off in a meaningful way and contribute to diversifying our customer base in 3D sensing, but also we’re working on other types of applications within existing customers that will allow us to grow 3D sensing in fiscal 2023 and beyond."
}