{
    "symbol": "AUPH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 11:53:04",
    "content": " Based on the third -- the third quarter revenue results and the PSF trend moments, as you saw in our press release, we're updating our 2022 LUPKYNIS net revenue guidance to $100 million to $105 million for 2022. Total net revenue was $55.8 million and $14.7 million for the quarters ended September 30th, 2022 and September 30th, 2021, respectively, an increase of 280% period-over-period. Total net revenue for the nine months ended September 30th, 2022, was $105.6 million and $22.2 million for the nine months ended September 30th, 2021. Revenue growth for both periods is primarily due to the recognition of a $30 million regulatory milestone from Otsuka following the EC approval of LUPKYNIS in September of 2022, coupled with an increase in product sales for LUPKYNIS, which was driven predominantly by further penetration in the lupus nephritis market. Total cost of sales and operating expenses for the quarters ended September 30th, 2022 and September 30th, 2021 were $65.3 million and $65 million, respectively. Total cost of sales and operating expense for the nine months ended September 30th, 2022 were $189 million in comparison to $170.2 million for the nine months ended September 30th, 2021. Cost of sales were $2.4 million and $254,000 for the quarters ended September 30th, 2022 and September 30th, 2021, respectively. Cost of sales were $4.3 million and $610,000 for the nine months ended September 30, 2022 and 2021. Selling, general and administration, or SG&A expenses, inclusive of our share-based compensations was $52.2 million or $44.6 million for the quarters ended September 30, 2022, September 30, 2021, respectively. SG&A expenses, inclusive of our share-based compensation expense were $148.9 million and $128.8 million for the nine months ended September 30, 2022, September 30, 2021. Non-cash SG&A share-based compensation expense for the quarters ended September 30, 2022 and September 30, 2021, was $6.6 million and $6 million. Non-cash SG&A share-based comp expense for the nine months ended September 30, 2022, September 30, 2021, was $21.5 million and $19.2 million, respectively. R&D expenses, inclusive of share-based comp expense were $11 million and $20 million for the three months ended September 30, 2022 and 2021. For the nine months ended September 30, 2022 and September 30, 2021, R&D expenses, inclusive of share-based comp expense were $35.1 million and $40 million. The primary driver for the decrease for both periods was that in prior year, the company expensed a $10 million upfront license and accrued milestone obligation related to its AUR 300 program, which was partially offset by additional development expenses related to the AUR 200 and AUR 300 programs for the current year period ending September 30, 2022. Non-cash R&D share-based compensation expense for the quarters ended September 30, 2022, September 30, 2021, was $1.5 million and $1 million, respectively. Non-cash R&D share-based comp expense for the nine months ended September 30, 2022 and 2021 was $3.5 million and $3.2 million, respectively. Interest income was $1.5 million and $106,000 for the three months ended September 30, 2022 and September 30, 2021. Interest income was $2.2 million and $420,000 for the nine months ended September 30, 2022, September 30, 2021, respectively. For the quarters ended September 30, 2022, Aurinia recorded a net loss of $9 million or $0.06 net loss per common share as compared to a net loss of $50.3 million or $0.39 net loss per common share for the quarter ended September 30, 2021. For the nine months ended September 30, 2022, Aurinia recorded a net loss of $82.1 million or $0.58 net loss per common share as compared to a net loss of $147.6 million or $1.15 net loss per common share for the nine months ended September 30, 2021. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}