{
    "symbol": "NBHC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 14:59:05",
    "content": " I would like to remind you that this conference call will contain forward-looking statements, including, but not limited to statements regarding company's strategy, loans, deposits, capital net interest income, non-interest income, margins, allowance, taxes, and non-interest expense. During the first quarter, we grew our average transaction deposit balances by 4.9% annualized and continue to maintain diligent expense control with portal non-interest expense decreasing by $0.4 on a linked-quarter basis. And while the impact of March is 25 basis points increase in the federal funds rate at a nominal impact in our first-quarter results, as Timothy mentioned, NBHC's net interest income will benefit nicely from this and any further short-term interest rate increases in the coming quarters. In terms of the SBA loan production, they originate near $200 million and in SBA production a year, which would be nice supplement to what we already do to call it $1.7 billion loan production over the last four quarters for us. I would put it closer to 17% to 18% at this point on full year, that will impact our net income and taxable income will be these transaction costs, which is probably also reason why first-quarter is a bit lower as we are starting to project that transaction costs hitting this year's  taxable income. Next quarter, that if -- when we report 3%, let's say, which we we're projecting, that cash projection impacts still is around 26, 27 basis points. As we look at a number of banks reporting 10% to 15% hits to their tangible book as a result of AOCI, we feel pretty good about the use of capital here, particularly when you think about the accretion of earnings that we're picking up and feel reasonably confident that this 2.5 year earn-back, we're targeting as something that will be but it's interesting times to be thinking about deploying capital in this manner versus seeing it run down on something like an AOCI hit. And I'll add on to be fair on the other side of the income statement on expense as we haven't had a whole lot of unify expense hitting the just yet either, so if you look at the projection it does imply a bit of a ramp up on the quarterly run rate basis and a portion of that is based on our two unify build-out expense that I guided at the beginning of the year. I think last quarter when we discussed the expense guidance, it was exclusive of $4 million to $5 million of build-out costs related to two unify, but it sounds like just a minute ago, the expense guidance, the updated guidance for 183 to 187 for this year included those costs."
}