{
    "symbol": "NBHC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 15:04:13",
    "content": " During the quarter we realized approximately $7 million of transaction related expenses, as well as increased our loan loss provision expense by $5.4 million as part of the day one CECL reserve for the Rock Canyon loan portfolio. Excluding these transaction related items, our adjusted coordinate income was $25.3 million or $0.80 per diluted share, which is a 16% increase over the prior quarters adjusted results. The total loan portfolio grew $905 million during the third quarter, and after adjusting out the Rock Canyon bank loan book, addition of $538 million. And while average earning assets grew $180 million, or 10.5% annualized during the quarter, the main driver for the net interest income growth was the loan portfolio pricing. And as I already mentioned earlier, $5.4 million was driven by the establishment of day one allowance for credit losses for the Rock Canyon bank loan portfolio. Total third quarters non-interest income was $17.4 million, or a $600,000 increase from the second quarter. Excluding these acquisition related expenses the third quarters core banking expense was $47 million compared to $44.5 million, of core expense in the second quarter. Included in this projection is an estimated $5 million to $6 million of transaction related expenses yet to be realized, as well as a full quarter of expense run rate from both acquisitions. The Rock Canyon bank out and in the net interest income line, approximately $3 million to $3.5 million. As we know, NBH we have been running on a standalone basis about 45 million quarterly run rate higher than the quarters when we had high mortgage commissions lower and now that itâ\u0080\u0099s gone, gone, that components gone down somewhat upset by the unify components, so call it $45 million, which implies about call it 15-ish or so million dollars of between the two banks. Because I mean, again, just for clarity perspective, for example, for the deposit side, and if we were to combine both Rock Canyon and Bank of Jackson Hole cost of deposits, which came on between 40 to 50 basis points to our 18, certainly, that will have an impact in itself too just in terms of forecasting and projecting for fourth quarter deposit beta still look like they went up."
}