{
    "symbol": "NBHC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 16:28:04",
    "content": " Adjusting for one-time acquisition expenses, we delivered pre-provision net revenue of $50 million with adjusted net income totaling 34.5 million or $0.91 per share for the fourth quarter. During the quarter, we realized $6.8 million of transaction-related expenses, as well as recorded a Day 1 CECL loan loss provision expense of $16.3 million for the Bank of Jackson Holeâ\u0080\u0099s loan portfolio. As Tim shared, excluding these transaction-related items, our adjusted core net income was $34.5 million or $0.91 per diluted share, which is a 14% increase over the prior quarterâ\u0080\u0099s adjusted results. Our pre-tax pre-provision net revenue, excluding the transaction expenses, grew $8.9 million or 22% on a linked quarter basis. Approximately $5.6 million of the provision expense was to support quarter's strong organic loan growth and to increase the allowance to total loan coverage, which reflects the increased economic uncertainty as indicated by the Moody's forecast scenarios. Looking at the core banking service charge and bank card combined revenues, they increased $312,000 on a linked quarter basis and grew $2.1 million or 6.3% on a full year basis over 2021. Excluding the acquisition-related expenses, the fourth quarter's core operating expense was $60.9 million compared to $46.9 million of core expense in the third quarter. But at the same time, we did step up to unify investment in fourth quarter and just it's in our press release yesterday or earnings release yesterday, but for full year that added up to be about $4.3 million investment. Now looking ahead for 2023, if you were to take the $60.9 million and analyze it, it come out right in the middle of the range what I gave for this year, which means that not only we will have to figure out how to cover the unify investment of $10 million to $12 million, the FDIC insurance increase which all of our industry is increasing by 2 basis points of FDIC, as well as any inflationary pressures that are still coming through. And why we say 4% return is really that's how, and I think I mentioned that in prior calls is, when we look at our balance sheet composition, the type of lending that we do, the type of core deposit balance sheet that we have, the liquidity that we have through the investment portfolio, in the long run I think we can maintain in a normalized yield curve or normalized rate environment 4% or thereabouts margin. It really starts, if it does, in 2024 on the expense side, on the  side, again, for us right now on the run rate basis, call it, it would be about $10 million-ish hit to the interchange, which would for 2024 is only half a year."
}