{
    "symbol": "MSGM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-18 19:13:04",
    "content": " In September 2022, we announced the 2022 restructuring program to reduce our operating cost, which is expected to generate annualized cost reduction of approximately $4 million by the end of 2023. The $0.9 million or 43% decrease in revenues primarily due $0.6 million of lower digital game sales, driven by lower sales volume and lower pricing and an out of the period adjustment of $0.3 million, correcting an immaterial overstatement of revenues in the three months ended June 30, 2022. The $1.8 million increase in net loss was primarily due to $0.1 million increase in sales and marketing spend, $0.8 million increase in foreign currency losses, a $0.6 million decrease in gross profit, $0.1 million increase in interest expense and $1 million increase in loss contingency reserves. The increases in Q3 2022 expenses were partially offset by $0.4 million decrease in development expenses, $0.2 million decrease in other expenses and $0.1 million decrease in general and administrative expenses. Revenues were $6.6 million and $6.9 million for the nine months ended September 30, 2022 and 2021, respectively, a decrease $0.3 million or 4% when compared to the prior period. Gaming segment revenues decreased by $0.8 million or 12% to $5.9 million for the nine months ended September 2022, compared to $6.7 million for the nine months ended September 30, 2021. The decrease in our Gaming segment revenue is primarily due to the lower retail revenues of $0.6 million, driven by higher retail pricing concessions, as well as a decrease in digital and mobile game sales of $0.8 million that was caused by lower volumes and pricing. Our Esports segment revenues increased by $0.5 million for the nine months ended September 30, 2022 as compared to the nine months ended September 30, 2021. The increase in our Esports segment revenue is due to $0.5 million of higher sponsorship revenues from our Le Mans virtual racing series events, which concluded its 2021 into 2022 season in January 2022 and commenced its 2022 into 2023 season in September 2022. Net loss for the nine months ended September 30, 2022 was $32 million compared to $26.7 million for the nine months ended September 30, 2021. The increase in net loss was driven by a $9.4 million increase in goodwill and intangible asset impairment, a $1.6 million increase in development expenditures, a $1.6 million increase in sales and marketing spend, a $1.4 million decrease in gains from equity method investment, a $1.7 million increase in foreign currency losses, a $1.1 million decrease in gross profit, and a $0.3 million increase in interest expense, and $1 million increase in loss contingency reserves. For Q3 year-to-date 2022, adjusted EBITDA loss was $18 million, a $6 million increase when compared to the $12 million adjusted EBITDA loss for Q3 year-to-date 2021. But I think itâ\u0080\u0099s fair to assume, as we go into this, as we are in this Q4 and we just published our Rivals game, which does have cost attached to it when it comes to physical game cards that we had to manufacture, produce and distribute et cetera, so our normal monthly burn rate is still around that $1.5 million or so range, like we previously stated. So, I think itâ\u0080\u0099s fair to assume that, plus what we would potentially lay out or actually have for creation of those game cards could move that needle somewhere between $1.5 million to $2 million on the monthly burn rate."
}