{
    "symbol": "TTGT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 12:48:02",
    "content": " Yes, Justin, in terms of the macro cycles, what we've seen is -- I think it's been highlighted and documented over the last 45 days, how quick and material companies are laying off and it's very widespread. It's really important that even during a downturn that we stay opportunistic around the key priorities that will help, which we've seen historically covered us for a while, where we take an opportunity to take market share by making the right investments. We believe we could, but I don't think it would have been the right decision in terms of addressing the short-term opportunity to take advantage and gain market share for the long-term growth opportunity because the overall trends that we've seen and we've talked about over the last 3 years haven't changed. And that's where our first-party intent data at -- not only at account level but at the prospect level is really what we believe is the quickest path and the truest path to our company's next deal, our customers' opportunity to land the next deal. Today's buyer, we've seen in multiple studies and what we're seeing in our own research, a majority of those buyers today want a rep-less experience when they're dealing with their next purchase or their next opportunity. They want to engage relevant information, relevant content, project-based content really to help guide them without having to take a call for the sales rep. We made the acquisition of ESG a couple of years ago, and we really focused on our efforts around making sure that our customers have a good content experience to help them position their product, position their overall company's value prop against the competitive set. So that's all part of this end-to-end Content to Close concept: helping our customers build, create and execute on the right content and messaging strategy, putting that content into the right executable programs to engage the right buyers, and then helping prioritize those buyers in accounts back into their sales force through our Priority Engine and other platforms that we can then help them close more deals quickly. And that's because what we talked about earlier, the end of December and out of the gates in Jan, we're just seeing a lot of customers really trying to navigate their budgets and their cost cutting. And we've added those customers throughout 2022, but they're also going to be going through -- we're baking into everything of our guidance today of what we know and what we're seeing in the behavior in the market. Like we're taking a look at what we know right now, what we've seen in the last 30 days or 45 days, and that's what we've baked into our guidance."
}