{
    "symbol": "TTGT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 04:56:06",
    "content": " Fairly healthy IT environment, but the other three trends around modernizing sales and marketing departments of data and automation, sensitivity to privacy regulations which really bodes well for us with our permission-based members and still a long-term transition of budgets from face to face to online for better measurement scale and efficiencies, those are not as economically sensitive. And we've seen really good traction in terms of, once we show them how to use the data, which accounts in their territories should be focused on and, which of the individual prospects within those accounts they should call, because they have all the information at their hands, what they are researching, which competitors are influencing those accounts within a rep's territory and their key entry points of research. We've seen a continued momentum on the brand side, you will see and I expect to see some of these accounts may pull back a little bit on some of the brand expense and really focus more on the data and the demand generation in the project confirmation type of data, but the brand revenues fared well and it's growing, and we've all seen the announcements in the vision of Google eliminating third-party cookies later on. We do think that there has been a pickup in some face-to-face events, but every study that we've seen and what we've looked at and when we talk to our end user group, as well as our customers, it's really being driven by the end users, the actual technology buyer does not have the enthusiasm as much as the vendor to go to a trade show, to spend three days out of the office, to go out there and travel and to be there. And when I look at the business today, I think there are so many entry points for us to get into an account, whether it's on web-based, video-based, text-based, data-base, demand generation, Priority Engine, branding, content enablement, strategies, our reps are really well equipped to make sure that they are aligning with their resources across the entire organization to say, okay, this customer has this pain point."
}