{
    "symbol": "TTGT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 17:46:09",
    "content": " Buying teams want to make sure they have a very self-service, get information and access to relevant information when they need it, they leverage content, whether it’s editorial content that we produce, vendor content from our vendors, custom content, market data-backed content and unique content that’s relevant throughout the entire buying cycle. With the ESG offering, we are now able to get into our customers at a very early cycle, whether it’s with their product group, their chief content strategists; their C-level folks who are shaping their positioning, messaging and overall content formulation; they are looking to make sure that they are creating relevant content that’s going to help engage by leveraging our technical validation, our market validation, our economic validation type of content. And why we’re seeing some good success on that is because last year, we put a lot of efforts in development in the Priority Engine solution around the sales use case because -- these smaller companies might not have the sophistication of all the marketing resources and technologies and automation and tools, but the one constant throughout all those companies is that they have a sales force. On the Priority Engine and the BrightTALK offering, yes, we did launch that we’re integrating -- that we have integrated and offered customers that have Priority Engine have access to the BrightTALK capabilities and purchase intent insights, which is really valuable. If you take a look at our organization, historically, we’ve been very text-based, white papers, case studies, editorial content, that really valuable purchase intent insights from customers or from buying teams, viewing webinars has been very valuable for us and for our customers, and it really helps close out that, I’ll say, 360 purchase intent insights and data information. And people have to make sure they’re getting the right information to make sure they are justifying their expense or their investments that they’re going to put in, and that bodes really well for a company that invests in content, permission-based audience and can throw off the first-party purchase intent signals. So having both of these investments working simultaneously should bode well because when you can bring marketing and sales together with the commonality of really quality data and you can get them on the same page, we’re doing a lot for our customers. So Priority Engine, if you really break this down, will identify the accounts and the individual prospects in market right now that we’re ranking based on their first-party purchase intent behavior, their insights, the type of content they’re reading. I’m looking at the long-term revenue where customers are taking their content marketing, their QSO, their branding and part of the -- and their Priority Engine to stay in front of buyers, especially during times of market volatility. So we don’t only break out the numbers, but we do see a really good opportunity with this whole content to close, helping our customers from the beginning, be very strategic on this, generate the right content, put it to the right campaigns, help prioritize and mobilize against the right accounts and provide a higher propensity for our customers to close business, and that’s the end game."
}