{
    "symbol": "TTGT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 21:33:04",
    "content": " And with the global macro once when we got out of Labor Day post Labor Day, we did see a lot of deals get pushed budgets within our customers at our customers were caught or on hold, and they're really doing the reset, but they're going to evaluate what their budgets are going to be. So we've talked about our business with our editorial content strategy, opt-in permission-based audience, first-party purchase intent data and really the resiliency of the IT market today versus 10 years ago, I went to look at the last real big downturn, I think that's really guided and it's not surprising how customers react. As I mentioned in the previous question, we are seeing some shifts in product or budget allocation from the branding of the ad spend, which again is roughly 10% of our overall business, but customers that spend in that, they will quickly pull back on that because that's probably the hardest product to measure and show our line. What we are also seeing is the customers will meet really good content to make sure that they're getting their message out there, but we're navigating this right now based on what we see those are some of the shifts and we're seeing the impact on the slowdown in EMEA as well as North America. You're seeing -- and I think you're seeing this as well across the market where customers, whether they are small or minor large, it just really managing scrutinized and every expense that they are going to look to put -- invest in, and it's going to take a little bit of time to assess that. Customers are also telling us that their budgets are frozen, so if we had something in the forecast that we committed at 70%, we have a really good track record of knowing when that's going to come in, when that's going to land and when that's going to run and recognize. And so some of those deals have been delayed, and we've seen customers just pull back on budget where they want to reset and make sure they're assessing the right quality investments. We've also, as I mentioned, have seen some customers shift their product strategy in terms of what they are investing with TechTarget from, yes, some of that brand or demand gen campaign focus to more bottom of the funnel, lower end of the funnel, qualified sales opportunities and HQLs to help their sales teams and the lowest hanging fruit that they can get right now to support their current numbers because they go through the same thing. But I think it's not just in one area right now because of the sudden pullback in the global macro environment that you're seeing across different customer segments to say, let's stop, let's assess, let's make sure that we have the right investments. But we're also very involved in looking for the -- we've talked about this in the past, and we think there's going to be some really good opportunities based on the recent valuation resets with companies around content, intent, audience, peripheral capabilities as well as adjacent markets. And like I said, when people and customers navigate through this, they reset, they need a flight back to quality, and that means having the most accurate, precision, quickest and transparent path to get to their prospects, to get to the right accounts as well as to engage with their existing customers because it's a big customer retention focus and having access to our data and our capability set through content, campaign activation, insight, intent, I'd call content to close capabilities enables our customers to have that. I mean there's I think you're seeing some of the markets turn right now, and you see a lot of companies out there really trying to manage expenses all across the board, including headcount, employees and , so I wouldn't take much of a change."
}