{
    "symbol": "BLI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 22:35:14",
    "content": " In 2022, we successfully completed the important AAV contract with Thermo Fisher, upgraded the software suite for Beacon and Lightning platforms, launched the Rabbit Memory B cell workflow to accelerate antibody discovery and extended our reach with multiple new customers, onboarding the Berkeley technology. Going forward, we are making significant progress on our innovation teams to come together to offer as many of our competencies from technology perspectives in a lower-cost device, that is a much more stronger software suite, which we were able to fortunate to be formed in IsoPlexis, the software capabilities of IsoPlexis team is fantastic, and it really has created a push button, answer in a box kind of a device approach to be used in life sciences tools industry, which we are very keen to combine for our combined portfolio. The revenue base that combined company has does not need that level of expenditure and we are committed to going after approximately $70 million of cost reductions, majority of it will come from obvious functions like public company expense reductions, but also some of that will come from synergizing our research and development initiatives for company to be effectively managing our execution plans. Let me just make sure that we explain sort of what we originally intended to launch Beacon Select later in the year, but we were able to accelerate launch of the Beacon Select in Q1 and specifically for cell line development workflow, which is where we initially thought there is going to be a significant demand for accessing our portfolio of products at a lower cost upfront in exchange for a higher consumable cost in the longer term. The only thing Iâ\u0080\u0099d add to what Siddhartha said, which I think was pretty comprehensive is as we combine our commercial teams and the footprint that weâ\u0080\u0099ll have and the cross-training that will occur, we believe having that coverage across multiple industry segments will enable us to drive revenue with our enhanced product portfolio, as weâ\u0080\u0099ve talked about with the Beacon Select, Beacon Quest as well as the IsoPlexis products."
}