{
    "symbol": "ZENV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-04-05 13:39:17",
    "content": " Even though our total revenue dropped 8% year-over-year as a result of our focus in a profitable CPaaS business, the SaaS business continues to be our growth engine with the top-line perform expansion of 44% when comparing Q4 '22 to Q4 '21. We grew revenues by 24%, gross profit by 68% and gross margin by 12 percentage points, leading us to a normalized EBITDA, which excludes non-cash impacts from earn outs and impairment of BRL23.5 million. It is worth noting that ex-M&A our revenues grew 5% year-over-year, while our gross margin jumped a solid 33%, once again demonstrating the result of our strategy to focus on increasing the profitability of the more mature CPaaS business. We expect our revenues to be between BRL830 million and BRL870 million implying a 12% top line growth at the middle of the range boosted by a 30% to 42% expansion of our SaaS business, CPaaS should stay flat, reflecting its more mature stage. We're seeing the SaaS business that's going onto a healthy growth over the couple -- this couple of quarters and we expect 2023 to keep the same pace of healthy growth, which means sustainable, not focusing on growth that would be very costly to achieve, but growth that can be sustained over time with a healthy rates that flows to gross profit and then flows to EBITDA. So we are looking more on the CPaaS business on a gross profit and EBITDA basis than revenue growth, but you should expect it to be flat, if any, if it goes well and as we've seen improved, you can assume that low single-digits could be done. Yes, Shay, of course, it's important to add here that we expect growth, although we see a flat in CPaaS revenue from '22 to a full year view, we expect growth at the second half of the year because of the first half of the 2022 was a strong half for CPaaS in terms of revenue and in the second half of '22 we start to feel the stronger competition."
}