{
    "symbol": "CEMI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 09:21:32",
    "content": " In the first quarter, we generated total revenue of $18.8 million, representing growth of 116%, compared to the prior year period. Total revenue included new record quarterly product revenue of $18.5 million, representing growth of 360%, compared to the prior year period. Revenue was led by product sales in the Latin America region of $12.5 million, primarily consisting of the DPP SARS-CoV-2 Antigen test shift of Bio-Manguinhos and strong growth of product sales by Chembio Diagnostics Brazil. Traction with the distribution of the third-party manufacturer COVID-19 detect antigen test, drove US sales of $4.5 million in the first quarter, representing 530% growth compared to the same quarter last year. For the three months ended March 31 2022, total revenue was $18.8 million representing growth of 116% compared to the prior year period. Product revenue for the first quarter of 2022 was $18.5 million, an increase of 360% compared to the prior year period. Government grant income license and royalty revenues and R&D revenues combined for the three months ended March 31 2022, were $0.3 million, a decrease of 94% compared to the prior year period due to the expiration of previous partner development agreements. Gross product margins during the three months ended March 31 2022, increased by approximately $2.8 million compared to the prior year period to $3.3 million. R&D costs decreased by $1.2 million compared to the prior year period to $1.7 million in the first quarter of 2022, primarily associated with the completion of development work for prior partnership development agreements. Selling, general and administrative expenses increased by $0.9 million compared to the prior year period to $6.9 million in the first quarter of 2022. Net loss in the three months ended March 31, 2022, was $8.8 million or $0.29 per diluted share, compared to a net loss of $4.5 million or $0.22 per diluted share in the prior year period. The net loss includes impairment, restructuring, severance and related costs of $3 million, or $0.10 per share, for the first quarter of 2022, compared to a de minimis amount in the prior year period."
}