{
    "symbol": "HCC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 22:35:21",
    "content": " Using the strong cash flow generated during the second quarter, we deployed the highest quarterly amount of capital spending and mine development ever in the business of $79 million, as Walt noted earlier. For the second quarter of 2022, the company recorded its third consecutive quarter of record quarterly results with net income on a GAAP basis of $297 million or $5.74 per diluted share compared to a net loss of $5 million or $0.09 per diluted share in the same quarter last year. Total revenues, another record high, were $625 million in the second quarter compared to $227 million in the same quarter last year. In addition, other revenues were positively impacted in the second quarter this year by a 130% increase in natural gas prices, offset by a noncash mark-to-market loss on our gas hedges of approximately $14 million. Demurrage and other charges were approximately $14 million higher in the second quarter of this year versus last year, primarily due to higher pricing and the shipment delays that Walt discussed earlier. Despite the higher variable costs and inflation, cash margins were $281 per short ton in the second quarter compared to only $40 per short ton in the same period last year, demonstrating the leverage to higher met coal prices, driving both profitability and free cash flow. Cash cost of sales per short ton, FOB port, was approximately $123 in the second quarter compared to $83 in the same quarter last year. Cash cost on price-sensitive items such as wages, transportation royalties that vary with met coal pricing were significantly higher in the second quarter this year compared to the same quarter last year. As you may remember, transportation costs lagged on a 1-quarter basis, and index prices averaged $280 higher in the second quarter versus the same quarter last year. Comparable transportation and royalty costs were 54% of the cost per ton of $123 in the second quarter this year compared to only 33% in the same quarter last year, driven primarily by higher met coal pricing. SG&A expenses were about $13 million or 2% of total revenues in the second quarter this year and were higher than the same quarter last year, primarily due to higher employee-related expenses. During the second quarter of this year, we generated an all-time record high $250 million of free cash flow, which resulted from record high cash flows provided by operating activities of $329 million, less cash used for capital expenditures and mine development cost of $79 million. Total available liquidity at the end of the second quarter was a record $768 million, representing an increase of $211 million or 38% over the first quarter of 2022 and consisted of cash and cash equivalents of 645 and $123 million under our ABL facility. As Dale noted earlier in his remarks, our cash cost per short ton in the second quarter of 2022 was significantly higher due to the variable components of our cost structure, such as wages, transportation and royalties and the impact of inflation."
}