{
    "symbol": "HCC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 21:19:06",
    "content": " For the first quarter of 2022, the company recorded its second consecutive quarter of record quarterly results of net income on a GAAP basis of $146 million or $2.83 per diluted share, compared to a net loss of $21 million or $0.42 per diluted share in the same quarter last year. Non-GAAP adjusted net income for the first quarter, excluding the non-recurring business interruption expenses, idle mine expenses and other income was $2.97 per diluted share compared to an adjusted net income of $0.08 per diluted share in the same quarter last year. Adjusted EBITDA was $244 million in the first quarter of this year, another all-time record high for a quarter as compared to $47 million in the same quarter last year. We believe the financial impact of the shipping delays that Walt previously noted, reduced the first quarter sales volume by 100,000 short tons, adjusted EBITDA by approximately $40 million, net income by $32 million and EPS by $0.63 per share. This 77% increase was primarily due to the 220% increase in average net selling prices, partially offset by 42% lower sales volumes in the first quarter versus the same period last year. In addition, other revenues were positively impacted in the first quarter this year by an 87% increase in our natural gas prices, offset by non-cash mark-to-market loss on our gas hedges of approximately $13 million. Demurrage charges were approximately $3 million higher in the first quarter this year versus last year, primarily due to the port delay issues that Walt discussed earlier in his comments. Despite the higher variable cost and inflation, cash margins were $220 per short ton in the first quarter compared to only $27 per short ton in the same period last year, demonstrating the leverage to higher met coal prices, driving both profitability and free cash flow. Cash cost of sales per short ton, FOB port, was approximately $119 in the first quarter compared to $79 in the same quarter last year. Cash costs on price-sensitive items such as wages, transportation and royalties that vary with met coal pricing were significantly higher in the first quarter of this year compared to the same quarter last year. As you may remember, transportation costs lag on a 1-quarter basis, and index prices averaged $361 higher in the first quarter versus the same quarter last year. Variable transportation and royalty costs were 46% of the cost per ton of $119 in the first quarter this year, compared to only 29% in the same quarter last year, driven primarily by higher met coal pricing. SG&A expenses were about $14 million or 3.7% of total revenues in the first quarter this year and were higher than the same quarter last year, primarily due to higher stock compensation expense, due to retirement eligible employee equity grants and a 60% higher stock price. During the first quarter of this year, we generated $50 million of free cash flow, which resulted from cash flows provided by operating activities of $70 million, less cash used for capital expenditures and mine development costs of $20 million. Our total available liquidity at the end of the first quarter was $557 million, representing an increase of $78 million or 16% over the fourth quarter of 2021 and consisted of cash and cash equivalents of 434 and $123 million available under our ABL facility. As Dale noted earlier in his remarks, our cash cost per short ton in the first quarter of 2022 was significantly higher due to the variable components of our cost structure, such as wages, transportation and royalties, plus the impact of inflation. As Dale noted earlier, we incurred approximately $3 per short ton of higher inflation during the first quarter this year. On -- first of all, on a near-term basis, just on the timing of the inventory unwind, obviously, the guide unchanged for the year on sales, if you take the midpoint, it implies 1.6 million tons on average of sales volumes per quarter I think, in the next few quarters, a pretty significant increase."
}