{
    "symbol": "RCKY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 12:22:24",
    "content": " With respect to Rocky Commercial Military and Booty division, the category was mixed with notable strength in the public service and -- our public service business had a terrific quarter due to well-planned forecasting, new fire product and proper inventory planning, many of our public service retail partners had exceptional retail sales and our inventory position put us in a position to take advantage of the increased demand. Excluding this transaction, adjusted net sales for the third quarter of 2022 were $143.9 million. For the third quarter, gross profit increased 10.6% to $51.9 million or 35.2% of sales compared to $47 million, or 37.4% of sales in the same period last year. Excluding the cost of the goods sold related to the NEOS brand divestiture during the quarter, adjusted gross profit for the third quarter of 2022 was $50.8 million, or 35.3% of adjusted net sales. Adjusted gross profit for the third quarter 2021, which excluded a $900,000 inventory purchase accounting adjustment was $47.8 million, or 38.1% of net sales. Operating expenses were $40.3 million, or 27.3% of net sales in the third quarter of 2022 compared to $44.2 million, or 35.2% of net sales last year. As a percentage of net sales, adjusted operating expenses improved 550 basis points to 27.4% in the third quarter of 2022 compared to 32.9% in the third quarter of 2021. Income from operations was $11.6 million, or 7.9% of net sales compared to $2.8 million, or 2.2% of net sales in the year ago period. Adjusted operating income, which excludes the expenses related to the acquisition and restructuring charges in both periods was $11.3 million, or 7.9% of net sales compared to adjusted operating income of $6.5 million, or 5.2% of net sales a year ago. For the third quarter, interest expense was $4.2 million compared to $3.1 million in the year ago period. Adjusted net income in the third quarter of 2022 was $5.5 million or $0.74 per diluted share compared to adjusted net income of $2.5 million, or $0.34 per diluted share in the year-ago period. Inventory at the end of the third quarter was $265.1 million compared to $200.2 million in the year ago period and $287.8 million at June 30, 2022."
}