{
    "symbol": "RCKY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 23:03:06",
    "content": " The Rocky Western business was relatively flat compared to the fourth quarter of 2021, driven by solid results with key partners that allowed us to approximate last year's overperformance that resulted from inventory shortages from key competitors. Net sales for the fourth quarter of 2022 were $138.9 million, a decrease of $30.5 million or 18% compared to a year ago period. Selling, general and administrative expenses were $43.1 million or 31% of net sales in the fourth quarter of 2022 compared to $45.1 million or 26.6% of net sales last year. Excluding the $1.7 million of acquisition-related amortization and restructuring costs in the fourth quarter of 2022 and $1.6 million in acquisition-related amortization and integration expenses for the fourth quarter of 2021, adjusted operating expenses were $41.4 million in the current year period and $43.5 million in the year ago period. As a percentage of net sales, adjusted operating expenses increased to 29.8% in the fourth quarter of 2022 compared with 25.7% in the year ago period, driven by a higher mix of retail sales in the current quarter. On a GAAP basis, net income for the quarter decreased to $6.5 million or $0.89 per diluted share compared to net income of $12.5 million or $1.69 per diluted share in the year ago period. Adjusted net income for the fourth quarter of this year which excludes acquisition-related amortization and restructuring costs, was $7.9 million or $1.08 per diluted share compared to adjusted net income of $13.8 million or $1.86 per diluted share in the fourth quarter of 2021. For the full year, net sales increased 19.7% to a record $615.5 million or $611.9 million on an adjusted basis, reflecting strong double-digit growth in both our wholesale and retail channel fueled by strong demand. During the fourth quarter, we paid down approximately $27.9 million or 9.8% of total debt from September 30, 2022. Compared with June 30, 2022 and September 30, 2022, inventories at December 31 were down 18.2% and 11.2%, respectively and this was ahead of our stated goal to bring inventories down $40 million from their high at the end of the second quarter."
}