{
    "symbol": "KFY",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-08 13:51:02",
    "content": " Please go ahead, sir. So, as Gary mentioned, fee revenue in the second quarter grew $204 million, or 47% year-over-year and $54 million, or 9% sequentially, reaching an all time high of $639 million. Fee revenue growth in the quarter from our consolidated executive search business was up 59% year-over-year, and up 9% sequentially, while our RPO and professional search business was up 76% year-over-year, and 8% sequentially. Our adjusted EBITDA grew $69 million year-over-year and $13.5 million or 11% sequentially to $135 million, with an adjusted EBITDA margin of 21.1% both are new quarterly highs. Now when you exclude amounts reserved for deferred compensation arrangements and accrued bonuses, our global investable cash balance at the end of the second quarter was approximately $591 million and that's up about $133 million or 29% year-over-year. The subscription licensing component of KF Digital fee revenue grew to $26 million in the second quarter, which was up 16% year-over-year and up 7% sequentially. Additionally, global new business for KF Digital in the second quarter grew 29% year-over-year to a new high of $114 million with 44 million or 39% related to subscription and licensed services. Now, turning to Consulting; in the second quarter, consulting generated $164.9 million of fee revenue, which was up approximately $38 million, or 30% year-over-year, and $16 million or 11% sequentially. Professional search new business was up 13% sequentially, and RPO was awarded a record $136 million of new contracts consisting of $28 million of renewals and extensions and $108 million of new logo work. Finally, in the second quarter global fee revenue for executive search risks another new all-time high of $235 million, which was up 59% year-over-year and up 9% sequentially. Annualized fee revenue production per consultant in the second quarter improved to a record $1.66 million and the number of new search assignments open worldwide in the second quarter was up 37% year-over-year and 5% sequentially to a new all-time high of 1,830. In the second quarter, global executive search adjusted EBITDA grew to approximately $66 million, which was up $38 million year-over-year, and up $4.5 million or 7% sequentially. Please go ahead, sir. Please go ahead, sir. But part of their business is around interim placement, which we were also attracted to -- and in terms of the success so far, we're only one month into this and we've already seen some very, very nice wins and including a couple wins actually for our executive search colleagues that came from the Lucas Group and I can think of one that was very, very sizable for Korn Ferry say two-and-a-half to three times the size of our average fee."
}