{
    "symbol": "KFY",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-22 17:39:08",
    "content": " During the fourth quarter, we generated 721 million in fee revenue, a new high, up 33% at constant currency and our profitability was also very strong. A major account strategy that now represents 36% of our portfolio, consulting and digital capabilities that represent 38% of our firm, and integrated go-to-market strategy One Korn Ferry that has resulted in almost 30% of our revenue coming from cross line of business referrals, a new Korn Ferry that trains and develops over 1 million professionals a year, a compensation and rewards advisory, a digital offerings, with comp data on more than 25 million executives, a new interim transition management and staffing capability with over 110 million of annual revenue on a run rate basis, and the continued execution of our balanced, disciplined approach to capital allocation. Fee revenue reached a new high of $721 million, net was up $166 million or 33% year-over-year at constant currency and up $40 million or 6% sequentially. Nearly every line of business achieved a new fee revenue high, led by RPO and professional search and executive search which grew 77% and 22%, respectively. Our RPO new business remained exceptionally strong in the fourth quarter with $213 million of new contract awards, easily the best performance to date. Our earnings and profitability continue to benefit from both higher consultant and execution staff productivity as well as our disciplined G&A spending, and these efficiency drivers throughout fiscal '22 helped grow our adjusted EBITDA to $539 million with a 20.5% adjusted EBITDA margin. Fourth quarter adjusted fully diluted earnings per share grew to $1.75, improving $0.54 or 45% year-over-year and 10% sequentially. Starting with KF digital, global fee revenue for digital was $89.5 million in the fourth quarter, which was up 11% year-over-year. The subscription and licensed component of KF digital's fee revenue continued to grow in the fourth quarter reaching $29 million, which was up nearly 21% year-over-year and was approximately 32% of revenue for the quarter. Global new business for KF digital was approximately $107 million, with 36% or 38 million of the total coming from subscription and licensed sales. In the fourth quarter, digital generated adjusted EBITDA of $27.7 million with a 31% adjusted EBITDA margin. For all of fiscal '22, digital fee revenue grew 22% to $349 million and generated $110 million of adjusted EBITDA with a 31.5% adjusted EBITDA margin. In the fourth quarter, consulting fee revenue grew to a new high of approximately $174 million, which was up approximately $20 million or 13% year-over-year. In the fourth quarter, adjusted EBITDA for consulting grew to $30.7 million with an adjusted EBITDA margin of 17.6%. For all of fiscal '22, consulting fee revenue grew 26% to a new high of $650 million with an adjusted EBITDA growing over 42% to approximately $116 million with a 17.9% adjusted EBITDA margin. Globally, fee revenue grew to $213.5 million, which was up 77% year-over-year and up approximately $25 million, or 13% sequentially. For all of fiscal '22, RPO and professional search also achieved new highs for revenue, earnings and profitability with $692 million of fee revenue, up 87% year-over-year and $165 million of adjusted EBITDA with a 23.9% adjusted EBITDA margin. Finally, fourth quarter global fee revenue for executive search grew to $244 million, which was up 22% year-over-year to a new quarterly high. Global new business for executive search was also strong in the fourth quarter, up 19% year-over-year to a new high. Annualized fee revenue production per consultant in the fourth quarter remained strong at $1.67 million and a number of new search assignments open worldwide in the fourth quarter was up 8% to 1,851. Fourth quarter global executive search adjusted EBITDA grew to approximately $64 million, which was up $14 million or 29% year-over-year with an adjusted EBITDA margin of 26.3%. In fiscal '22, global executive search fee revenue was $936 million, up 47% year-over-year with an adjusted EBITDA of nearly $258 million with an adjusted EBITDA margin of 27.5%. With all this in mind, however, assuming no new major pandemic-related lockdowns or further changes in worldwide geopolitical or economic conditions, financial markets, foreign exchange rates, we expect our consolidated fee revenue in the first quarter of fiscal '23 to range from $680 million to $710 million and our consolidated adjusted diluted earnings per share to range from $1.42 to $1.58 and our GAAP diluted earnings per share to range from $1.35 to $1.51."
}