{
    "symbol": "FITB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 13:17:10",
    "content": " As Tim mentioned, the underlying NII growth was around 15% compared to last quarter of which approximately half of the growth was attributable to higher market rates, and half from the combination of investment portfolio growth and loan growth, primarily in C&I. Compared to the prior quarter, we generated improved financial risk management card and processing, gross treasury management fees and private equity income, which was partially offset by weaker performance from our market sensitive businesses, including commercial capital markets and mortgage, and the impact of higher treasury management earnings credit rates. Non-interest expense decreased 9% compared to the prior quarter, driven by a decline in compensation and benefits expense from the seasonal peak in the first quarter, lower incentive-based comp in the current quarter due to market dynamics that impacted fees and overall continued expense discipline throughout the company. Average total commercial portfolio loans and leases increased 4% compared to the prior quarter, primarily reflecting growth in C&I loans. Average core deposits were stable compared to the year ago quarter, and decreased 4% compared to the prior quarter, including the impact of the intentional runoff of excess and higher cost commercial deposits. Compared to the year ago quarter, average commercial transaction deposits decreased 8% and average consumer transaction deposits increased 1% reflecting our continued success growing consumer households. Our ACL build this quarter was $117 million of which approximately 75% was from strong loan growth, including the $53 million ACL impact from the dividend acquisition and the remaining 25% was attributable to worsening economic projections relative to March, net of reductions in certain pandemic related qualitative adjustments. Moving to our current outlook, for the full year 2022 we continue to expect average total loan growth between 5% and 6% compared to 2021 or around 10% excluding PPP and Ginnie Mae impacts, reflecting strong pipelines and stable commercial revolver utilization rates over the remainder of the year. Our current outlook assumes average deposit balances decline a $2 billion in the third quarter, reflecting the full quarter impact of the second quarter runoff of excess and higher cost commercial deposits and seasonality, and then return to growth in the fourth quarter. We expect full year adjusted noninterest income to be down 7% to 8% in 2022, reflecting softer second quarter performance combined with the high probability of continued market volatility, reflecting a more aggressive rate outlook, including lower wealth and asset management mortgage and capital markets revenue, as well as higher earnings credit rates offsetting strong gross treasury management fee growth. For the third quarter of 2022, we expect average total loan balances to increase 1% sequentially reflecting 1% to 2% growth in commercial and stable consumer balances. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}