{
    "symbol": "FITB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 14:53:02",
    "content": " We generated consumer transaction balance growth of 5% compared to last year, and opened a 1 million momentum banking account in the quarter. Our capital markets revenue associated with helping clients had share exposure to rates, commodities and foreign exchange increased 30% compared to the year ago quarter. Net interest income was approximately $1.5 billion, a record quarter and increased 12% sequentially and 26% year-over-year primarily attributable to the benefit of higher market rates, growth and commercial loan balances, and the full quarter benefit of securities purchased in the second quarter. Non-interest expense increased 5% compared to the prior quarter, driven by an increase in compensation and benefits expense, including the impact of the July minimum wage increase to $20 per hour, higher technology and communications expense reflecting our focus on technology modernization initiatives, and the full quarter impact of the dividend finance acquisition. Average total commercial portfolio loans and leases increased 2% compared to the prior quarter, with muted pay-off and a stable revolver utilization rate of 37% period and commercial loans increased 1% sequentially and 14% compared to the year ago quarter. Average total consumer portfolio loans and leases increased 1% compared to the prior quarter driven by dividend finance, which as a reminder is recorded in other consumer loans as well as growth in residential mortgage. Average core deposits decreased 3% compared to both the year ago quarter and the prior quarter impacted by the intentional runoff of excess and higher cross commercial deposits in the second quarter, and lower consumer interest checking balances in the third quarter. Compared to the year ago quarter, average commercial transaction deposits decreased 10% while average consumer transaction deposits increased 5% reflecting our continued success growing consumer households. Given our expected period and loan growth, including stronger production from dividend finance, we currently expect a fourth quarter bill to the ACL of approximately $100 million assuming no changes in the underlying economic scenarios. Moving to our current outlook, for the fourth quarter of 2022 we expect average total loan balances to be stable to up 1% sequentially. We expect fourth quarter adjusted revenue growth of 6% compared to the third quarter, excluding the third quarter security losses associated with legacy venture equity investments. Our fourth quarter guide implies stable expenses for 2022 on a full year basis compared to 2021 and 8% adjusted revenue growth, excluding securities losses, resulting in PPNR growth in the high teens. Obviously, the challenge during this quarter and as we look ahead, given their strong loan growth is the ACL build, the ACL build and the credit performance is in line with how we modeled the portfolio with the annual loss rates peaking at a 125 charge-off rate, give or take. And so we're going to be providing at a pretty healthy rate in dollars given their strong loan production, and that could be $80 million to $90 million next quarter and perhaps every quarter in 2023 given that we expect $1 billion or more per quarter from them. I think in the first six months of the year were $80 million, and we're going to grow that 60% over the back half of the year simply driven by the strength of that mortgage servicing business that we operate. That's a run rate servicing fees, net of MSR decay should be around $40 million to $45 million a quarter going forward, and that's going to be a 10% yielding asset for us. If I'm just going to throw one editorial comment in here, Ken, because you hit on two of the topics that we're spending a lot of time talking about internally is I think, perhaps, because we operated for 15 years in a near zero interest rate environment, people forgot about what long-term drives performance in the banking business."
}