{
    "symbol": "FITB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 17:09:17",
    "content": " Shareholders (ph) who follow Fifth Third for a while, know that when I became CEO, I made a commitment that we would generate strong financial results and performed well through the various business cycles, we improvised our plans on a project North Star, we articulated several key strategic priorities generate strong and sustainable long-term financial results, including optimizing our balance sheet, differentiating our customer experience, growing and diversifying our fee revenues, building on our legacy of digital innovation and maintaining expense discipline. Average total consumer portfolio loans increased 2% compared to the prior quarter as strength in auto originations combined with growth in residential mortgage was partially offset by declines in home equity and other consumer loan balances, primarily from GreenSky balance runoff. Excluding these items, we expect total average loan growth of around 10% reflecting strong pipelines, sales force additions, the Dividend and Provide acquisitions and stable commercial revolver utilization rates over the remainder of the year. 25:46 For the second quarter, we expect NII to be up 11% to 13% sequentially, reflecting strong loan growth, the impact of securities purchases and the benefits of our asset sensitive balance sheet. 28:35 We expect total adjusted expenses in the second quarter to be down around 3% to 4% compared to the first quarter, which is up 2% compared to the year ago quarter, due to the acquisitions of Provide and Dividend Finance or stable on a stand-alone basis. Your line is now open. Your line is now open. Your line is now open. Your line is now open. I think from a deposit activity standpoint, we expect continued strong consumer deposit growth and then we're forecasting and perhaps it's conservative, a run-off in the non-operational deposits within the commercial book is, we're just not going to chase rate sensitive non-relationship deposit balances. 49:06 But with that said, I really like the balance sheet that we've put together over the last seven years where we've really improved the primacy within the consumer book as well as the granularity through the household growth along with the improvements in the operational deposits through our strong treasury management business. Your line is now open. Your line is now open. Your line is now open. Your line is now open. So as the Fed tightens, I think there is going to be more differentiation and maybe the market fully appreciates as it relates to the stability and the quality your funding base and the banks who have done the things that we've tried to do in terms of growing primary relationships and what the focus on core operational deposits should be much better positioned to whether an environment where liquidity maybe is, there is a premium attached to it unlike the environment that we really have come out of over the course of the past handful years. So from an industry perspective, we think that should win out but then if we're wrong then let's talk about it on an idiosyncratic basis for Fifth Third, what we've been able to accomplish with the primacy and operational deposits and the treasury management business has translated for us what we believe should be a lower beta on the first 200 -- at the 35 last time, 25 this time. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And if you look at the available industry research the folks that do benchmarking on this front that Fifth Third is always in the very top of the top quartile in terms of TM penetration in the middle market into our middle-market lending relationships, which I think you can kind of evaluate just by looking at the growth of commercial deposit fees over time and commercial deposits as a percentage of Commercial total loan commitments, both of which Fifth Third is best-in-class in relative to its investor peer group."
}