{
    "symbol": "AOSL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-10 21:22:07",
    "content": " Good afternoon, everyone, and welcome to Alpha and Omega Semiconductor's conference call to discuss fiscal 2022 fourth quarter financial results. Then, Stephen will provide business updates in a detailed segment report. After that, Yifan will review the financial results and provide guidance for the September quarter. The earnings release was distributed over wire services today, August 10, 2022, after the close of the market. We remind you that during this conference call weâ\u0080\u0099ll make certain forward-looking statements, including discussions of the business outlook and financial projections. Look into the rest of 2022, we are seeing inventory corrections happened in certain consumer in the market. While we are not immune to current global market conditions, as of today, our demand and backlog are still higher than our overall capacity. Whether we are in up cycle or down cycle, we always focus on the basics and strengthening the foundation to speed up future growth. In terms of our leading technology, more diversified product portfolio, Tier 1 customer base in all our business segments, extending manufacturing capability and a supply chain, strong balance sheet and dedicated and experienced management team. As a reminder, in the June quarter demand for our products was higher than our total capacity. However, we still delivered solid results, which highlights our strong execution and the benefits of our diversified manufacturing capacity. In September quarter, as Mike mentioned, we are seeing some softness in consumer end markets due to inventory corrections. However, as of now, our backlog remains higher than our capacity, so our customers remain on allocation. First, since we own the majority of our own manufacturing, we are able to quickly shift wafers capacity to other parts of the business where demand remains strong and therefore are at lower risk of costly inventory buildups that leader may result in write offs or selling at discounted prices. Second, another trend that is worth mentioning is that most of our Tier 1 customers have remained resilient thus far. Third, AOS has been upgrading our products to address higher performance sockets with differentiated solutions. For the coming September quarter with our Shanghai facility back in full operation, we expect high single digit sequential growth. Unless otherwise noted, the following figures refer to the June quarter of 2022. Starting with computing, revenue was up 15.6% year-over-year, down 0.5% sequentially and represented 46% in total revenue. The year-over-year growth was driven by the continued strong demand in notebooks, particularly from OEM customers that have a higher concentration of their businesses serving commercial laptop applications. In addition, high-end PCs and gaming desktops were also strong. Looking ahead in the September quarter, we expect computing to be flat to slightly down sequentially as our customers rebalance their inventories for a weaker end market. Our total revenue won't be effective, however, as we are able to quickly shift wafer capacity to other parts of the business. Revenue declined 1.7% year-over-year and 15.9% sequentially, and represented 90% of total revenue. Nearly all of the revenue decline was attributable to the Shanghai lockdown as the largest end market applications in this segment, such as home appliances and gaming are sourced fully from our Shanghai factory. Looking ahead, we expect the consumer segment to recover double digits sequentially, strong demand in gaming and catch-up shipments. We are expecting record gaming volumes, particularly from the number one gaming console manufacturer, where we have leading share. Home appliances are also expected to recover sequentially on catch-up shipments, but in general is softer as overall demand has weakened, driven by inflation and do slowdowns in real estate and consumer spending. Next, let's discuss the communication segment, which was up 32% year-over-year and 2.9% sequentially and represented 15% of total revenue. This segment delivered strong year-over-year growth due to share gains at major Chinese smartphone OEMs particularly in their premium tier models, which are still in shortage. In the September quarter, we expect mid-single-digit revenue growth as we prepare for our launch from one of our major smartphone OEMs. A with maintains high share and high end models in all 3 of our markets in U.S., Korea and China. Now let's talk about our last segment, power supply and industrial which accounted for 18% of total revenue. With a slowing smartphone market, we want to manage channel inventory levels, shipments for solar applications and power tools remained steady. For the September quarter, we anticipate this segment to grow low double digit sequentially, mostly from share gains in quick chargers at a major phone maker and growth in power tools. However, we still expect to grow as we focus on our long-term plan. We continue to execute our product and technology roadmaps, enhancing our diversified manufacturing stability, and deepening strategic customer relationships, which should result in share gains and expansion. With that, I will now turn the call over to Yifan for a discussion of our fiscal fourth quarter financial results and our outlook for the next quarter. Revenue for the quarter was $194 million, up 9.4% year-over-year and down 4.6% sequentially. Given the COVID restrictions in Shanghai, we're pleased that we achieved a better than our guidance midpoint. In terms of product mix, DMOS revenue was $138.9 million, up 9.2% year-over-year and down 1.2% sequentially. Non-GAAP gross margin was 33.8%, compared to 34.9% a year ago, and 36.7% in the prior quarter. Again, the decrease in non-GAAP gross margin was primarily impacted by the production shutdown at our Shanghai assembly and test facilities in April. Non-GAAP operating expenses were $36.7 million, compared to $34 million for the prior quarter and $32.8 million last year. The quarter-over-quarter increase in non-GAAP operating expenses was largely due to higher R&D engineering expenses, and the addition of headcount. In some non-GAAP quarterly EPS was $0.95 per share, compared to $1.34 for the last quarter and $0.95 a year ago. On a fiscal year basis, revenue for the year 2022 was $777.6 million, up 18.4% a year-over-year. Non-GAAP operating expenses were $139.3 million, up 12.5% from last year. Non-GAAP EPS for the year was $4.56 as compared to last year is $2.93, an increase of 56%. GAAP operating cash flow was $25.7 million, which included $3.4 million of net customer deposits. By comparison, operating cash flow in the prior quarter was $61.8 million, which included $6.4 million of net customer deposits. For the fiscal year, cash flow from operations was $203.4 million as compared to $114.3 million for the prior year. We completed the June quarter with a cash balance of $314.4 million, compared to $323.1 million at the end of the March quarter. The cash balance a year ago was $164.9 million, excluding $37.5 million at the JV Company. The bank borrowing balance at the end of June was $63 million, compared to $65.2 million a quarter ago. Day sales outstanding for the June quarter were 26 days, compared to 28 days in the prior quarter. Finally, property, plant and equipment was $318.7 million up from $245.8 million last quarter. The fixed assets balance a year ago was $174.5 million, excluding $262.5 million at the JV Company. Therefore, we expect the product to be delayed by a quarter. Now, I would like to discuss the September quarter guidance. Obviously, some great success here, and it's great to see. On the -- maybe the backdrop, it seems to have deteriorated more than I think we had expected since the prior quarter and particularly in areas that you have a lot of exposure. For us, yes, we're starting to see some softness in some of the end markets that we address. And many of our end markets at the very end, are consumer-facing and we're seeing some pressure just due to the current and macroeconomic backdrop. However, when you look into each of the businesses that we're in, the story is not necessarily the case across the board in that we address multiple sockets within many of our applications. And depending on the socket, the higher performance applications and higher performance on sockets are generally faring better than the lower end. And in general, the drop has been more in the lower to mid-end models, especially in the consumer side, whereas the higher-end models and the commercial PCs have generally been doing better. Additionally, when you look into the BOM content of some of these applications, higher power performance sockets in general, are still under allocation. It is still a hand-to-mouth whereas the lower end, we're starting to see some more pressure from local competition. So, for us, internally, we are basically shifting our supply to support the areas that are more profitable, that have a stronger demand. So, we do have the ability because we have a lot of the supply chain under our own control to be able to shift those resources around to address the stronger portions of the market. And then maybe even on the gross margin side, I know you had expected most -- to recover most of the margin loss, I guess, from the shutdown in Shanghai. Our September quarter's midpoint of the non-GAAP gross margin guidance, yes, is about 120 basis points, as you said, and higher than the June quarters actually. This guidance reflected the current view of demand dynamics, the expected product mix and also our factory productions, including the input cost increases. So of course, I mean it's a range. I mean, 35% plus or minus 1%. And I mean in terms of future quarters, and I mean at this point, it's hard to say. I mean, we only guide one quarter at that time. So, I would expect that probably we can maintain around the September quarter guidance range at least. And then maybe just one last one for me, if I can. Yes, for the September guidance, I mean, I would say that most of the risk is on the production side and our backlog is pretty much there in place and the production side, yes, the China COVID risk is still there. And then I mean, even though Shanghai city has already released restrictions, but you'll never know. And the other thing that stood out was that industrial and power supply, there?s some quick charger share gain with the large smartphone OEM. And I'm wondering if you can help us understand how material that is because it seems you might have a couple of tailwinds that at least on our end, we might have been under appreciating as we head into the back half of the year. And historically, this customer, their consoles have been more immune to changes in the economy. And we know that from the past 1.5 years that they've been under producing and they've had -- ever since launched, they couldn't produce fast enough. So, our growth in the September quarter partly is coming from their own growth in the second half as well as share gain. BOM content increase, I don't think is playing a big factor right now, but it's definitely -- and we are internally as a company, AOS is shifting more support to this particular customer. So, I would say both the end shipment growth as well as share gain is what's contributing to the big step in the gaming console business for AOS. And in the quick charger market, we actually addressed two sets of customers; one is in China for the lower to mid-end. And that area, we actually -- because of the decline in softness in the China smartphone market, we chose to back off support for that area in -- for the China region. But for the big OEM, and that's making more higher-end quick chargers for their higher-end phones, this is an area that we've been choosing to support more is also -- it's a higher performance socket. So, it's -- in general, you kind of see the theme as we see the market dynamics that the higher-end applications are generally faring better and AOS is shifting our resources to support those applications. I mean, this one, we have to thank to the booming fab construction in the U.S. And then I mean, right now, there's a lot of fabs constructions going on. And I mean, those are fab equipment and they're all large and complicated and then you need a certain certified people to handle it and then to install. So previously, we estimate that in the December quarter, we can get it online, but now it's more likely in the March quarter range. So -- and then March quarter, and then it will gradually ramp up. So, we would say it probably take a quarter or two to probably fully ramp up to the anticipated expansion capacity. And then a follow-up question, and it goes back to one of the themes from the prior question and it's related to just the environment that we're seeing out there where there's more and more visible signs of consumer weakness, but obviously, the company has a number of levers that they can pull. But the question is this, given what you're seeing with growing signs of inventory correction across the end markets that you serve, and given the seasonal dynamics of the business with consumer and enterprise builds typically stronger in Calendar 2Q and 3Q and weaker in 1Q. For us, when we look outward to the December quarter, and seasonally, typically, the strength of it depends on the strength of the peak season of the previous quarter, of the September quarter. That's one of the major customers that we have been supporting not only for their smartphone, but also the other applications like the tablet and quick chargers. Of course, we're still gravitating towards the higher end in that area, AOS is focusing on supporting more of during this time as they're going through inventory correction of the other low to mid-end products. So, for us, I think that's what we're carefully watching now. We're not giving specific guidance for December quarter, but at the same time, we are making careful use of our allocation right now. And lastly, on the December quarter. There was, I think, a significant gaming card launch that I think a lot of us thought would occur in Calendar 3Q, fiscal 1Q, and it looks like due to the inventory correction that's going to happen under 4Q, fiscal 2Q. But at the same time, we're also taking some of that product supply support to support other stronger applications such as the gaming consoles. Stephen, you mentioned that your backlog is still higher than overall capacity. I think for us, it reflects what the change in the backlog, yes, we see some inventory correction going on. But as I mentioned before, it is different depending on which products are involved. The higher-end products, the higher performance products are still hand-to-mouth and backlog is tight on those. But the lower to mid end, this is where we're seeing more competition coming from other suppliers, including local suppliers that are starting to get more access to foundries in this market landscape. So overall, we are seeing some backlog adjustments. Actually, we welcome that because it's a good time to clean up the backlog, so that it?s a better clear picture of where the true demand is. And so, part of this is initiated by the customer, but part of this is also initiated by us in order to have a clean look at what to build. And generally, we have the next quarter cover plus some more. And so, our backlog still goes through the December quarter and some of it trickles into the following quarter after that. I know last quarter, there was probably a lot of catch-up in the month of June, which probably helped drive DSOs up. So, once we were able to get back to full production, June was a much heavier month for us. Usually, we see the shipments spread more evenly through the quarter. It's -- well, as we mentioned before, the backlog itself is going through inventory correction. So, we're seeing some areas where they are going to inventory correction. That means, yes, canceling some old delinquent and backlog, but also pausing on some of the new orders for the lower to mid-end products that are starting to build up some inventory. But the areas with high performance where our supply is still hand to mouth to the customer, those orders are still coming in steady. And then, I mean, yes, I mean we selectively pass on to some input cost increases to certain customers. But overall, I mean, it's kind of steady at this point. But last quarter, you mentioned CapEx was $43.4 million and that you were expecting something similar for this quarter. June quarter's CapEx spending was $34 million, $35 million-ish in that range. So compared to the quarter before, it was $40 million. For the September quarter, we still expect a similar level, $30 million, $40 million range. I saw receivables were up at least $25 million, $26 million. I'm assuming since this next quarter is going to be linear, that you're going to kind of have a very strong cash flow from operations quarter as you unwind the receivables and perhaps the inventory. For the June quarter, yes, our operating cash flow got impacted by this receivable balance. Yes, June quarter, first half of the quarter, then our production got suspended in our Shanghai facilities. Yes, for the September quarter, I would expect receivable balance to come down a little bit. So, both factors together, I would say that yes, and we'll see -- we should be able to see some accounts receivable balance drop. In terms of inventory, the inventory increase in the June quarter was primarily due to the wafer inventory increase because our Shanghai factory shutdown, so the Shanghai assembly and test facilities consume less wafer inventory. So, I want -- it will depends on the back-end capacity in certain wafers and the back-end capacities. So, it's kind of a dynamic for the inventory balance. And then you mentioned you have this delay in the -- bringing on this new capacity in the Oregon fab by a quarter, but you also mentioned a lot of the equipment is already installed. And so, I'm assuming the depreciation clock then starts like roughly at the end of the March quarter. And then I noticed the Power IC business was down sequentially, I think, more than the overall revenue. And then would this business be expected -- can you just talk about the growth prospects in the back half of the calendar year here, given that it's a higher margin and higher value-added slot. I can comment on the June quarters, Power IC revenue decrease. Yes, that one was largely because of the Shanghai factory shutdown. I mean our Power IC products and we use more advanced packaging technologies, proprietaries of the technologies. So, I mean, because of the factory shutdown in April and partially in May, so that was a limited Power IC revenue growth. Final question from me is, I think, in the prepared remarks, someone mentioned that your Tier 1 market share is the highest it's ever been. I would say, overall, in terms of the majority of our business is tied to Tier 1 accounts these days. That's been a major change from, I think, over the last probably three or four years that we've really been going after the market leaders in every application that we're in; whether it's in the PC market, whether it's in the home appliance or the gaming market or the graphic cards, we've been focusing our attention in designing end products as well as our -- as allocating our supply to these Tier 1 customers. So, it's a reflection of that effort and we see it in the revenue and also in our market share. So, the increase in the quarter was moderate at $3 million for $10 million in the last two quarters. I mean, yes, in the June quarter, we had about $3 million or $4 million in net customer deposits. And I mean, going forward, I would not expect a whole lot of deposits that we can take concern those deposits are earmarked with our delivery support to our customers. So right now, I mean a lot of the Oregon fab expansion capacity already pretty much allocated to whoever put down the deposits. So, I would not expect going forward, we take a whole lot of deposits. But certain customers and strategic customers, they still want to secure their supply. And yes, and then we want to foster those and deepening our partnership with those Tier 1 customers, yes, we still selectively take some deposits. Listen, deposits came in from pretty much all the segments, the customers in the different industries. And I mean, in PC, in smartphone, in the power supply and the home appliances and from a variety of customer base. Just a quick follow-up or two on first, the delay in the capacity expansion from December to March. So just keep in mind, in terms of the total project, this is like the last leg that we're getting through. So, we have confidence that with our team and our partnerships with the local vendors they can help us to get this done. For us, yes, it will impact our expansion, and we were hoping to get some of that benefit at the end of this calendar year. We still plan to grow next year, even when the market changes even. We do expect the supply, even if it's one quarter or late, it's still going to start to help us in the first half of next year. And at the same time, we talked about our -- what we know we talked about our demand growth, but we're also talked about our supply strategy that it's a three-pronged strategy. And we believe that with next -- over the course of the next year, we will start to see more benefit coming from external foundries also too. So, I think that will help us to grow in addition to when our 8-inch fad expansion comes online. But in some cases, where space may not be an issue than some of our competitors can come in with the inferior process use a bigger die and compete with lower margin in â\u0080\u0093 with us. So, this happens much more in the low end of the market in the more, I would say, standardized type of products. And for us, AOS has been focused on differentiating ourselves more and more with our products, both for the high-end discretes and MOSFETs, but also especially for our Power IC. So the trend generally is towards more integration, both of our customers as well, and thatâ\u0080\u0099s reflected in our product portfolio. Thank you for your interest in AOS, and we look forward to talking to you again next quarter."
}