{
    "symbol": "PSTL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 12:05:06",
    "content": "  Operator: Good morning, and Welcome to the Postal Realty Trust Inc., First Quarter 2022 Earnings Call. I will now like to turn the conference over to Jordan Cooperstein, VP of FP&A and Capital Markets. Good afternoon, everyone, and welcome to the Postal Realty Trust first quarter 2022 earnings conference call. On the call today, we have Andrew Spodek, Chief Executive Officer; Jeremy Garber, President; Robert Klein, Chief Financial Officer, and Matt Brandwein, Chief Accounting Officer. Actual results may differ materially from those described in the forward-looking statements and will be affected by a variety of risks and factors that are beyond the Company's control, including without limitation. The Company does not assume and specifically disclaims any obligations to update any forward-looking statements, whether as a result of new information, future events or otherwise. Additionally, on this conference call, the Company may refer to certain non-GAAP financial measures, such as funds from operations, adjusted funds from operations, adjusted EBITDA and net debt. With that, I will now turn the call over to Andrew Spodek, Chief Executive Officer of Postal Realty Trust. These properties are within our anticipated weighted average cap rate range of 6% to 8%, and for the third consecutive year, we are on track to comfortably exceed a $100 million in acquisitions. In only a few short years as a public company, we have increased our market share to capture approximately 6% of this highly fragmented market, leaving a significant opportunity to gain considerable additional share in the coming years. Furthermore, our network of opportunities continues to expand as we are pleased that the majority of our deals are sourced off market from sellers who understand the value proposition we offer. As we have stated our financial capacity, past performance, and ability to offer multiple sources of consideration such as operating partnership units make us the natural buyer of assets lease to the postal service. The postal service commitment to their buildings is even more amplified in this inflationary environment, as we believe renewing a lease is a much more attractive economic alternative than moving to a postal built to suit option. Furthermore, we are well positioned to navigate today's inflationary environment with a conservative low levered balance sheet, favorable lease structure, and given the typical five year lease term our ability to set rents to market. On April 6, the Postal Service Reform Act of 2022 was signed into law, which will overhaul the postal service finances and delivery services further ensuring its continued viability. During the first quarter, we continue to invest in our company and scale the business through accretive acquisitions. With our experienced team, financial acumen, and proven track record we'll continue executing on our business strategy. By utilizing our expertise and strong relationships, we'll continue to expand our robust pipeline of postal service last mile flex and industrial facilities, remain a valuable partner to the postal service and create value for our stakeholders. For the first quarter of 2022, we produced a 35% increase in revenues from the first quarter of 2021. From our existing portfolio, along with contributions from the accretive acquisitions made over the last 12 months, our internal growth remains robust and our exposure to expense increases is limited given the nature of our leases. Through 2024, we have leases representing 6% to 11% of our total rent on an annual basis up for renewal. As of today, we have not received any notices of termination by the postal service. We have maintained a 98.8% historical weighted average lease or retention rate over the past 10 plus years, which displays how important these buildings are to both the postal service, and the communities they serve. In the first quarter of 2022, we acquired 50 properties for approximately $27 million excluding closing costs. These acquisitions added 179,000 net lease-able interior square feet to our portfolio inclusive of 38,000 square feet from 28 last mile properties and 142,000 square feet from 22 flex properties. Subsequent to quarter end and through May 6, we have acquired 24 properties for $7 million and placed an additional 123 last mile in flex properties for approximately $40 million under definitive contracts excluding closing costs. Postal Realty Trust continues to be well positioned to execute on our growth plan, and from the proactive steps we've taken to further strengthen our capital structure, we have the financial flexibility to continue our consolidation strategy. In the first quarter of 2022, we delivered funds from operations or FFO of $0.21 per diluted share and adjusted funds from operations or AFFO of $0.24 per diluted share. We have maintained a conservative balance sheet and as of March 31, 2022, we had nearly $6 million of cash and $110 million of capacity available on our revolver with an additional $200 million in accordions on our facility. Subsequent to quarter end, we closed on a $75 million delayed draw term loan maturing in February 2028 priced at 145 basis points over SOFR plus 10 basis points. With the proceeds, we paid down our floating rate revolver and concurrent with the closing of the term loan, we executed a $50 million swap further reducing our exposure to floating rate debt. For the first quarter 2022, net debt to enterprise value was 23% and net debt to annualize adjusted EBITDA was 3.9 times. We continue to invest in our company to scale our business, and as I outlined on our last call, these important investments will mirror the growth in our portfolio as we continue to focus on progression of the ratio of cash G&A as a percentage of revenues. As we continue to feel the impact from supply chain and increased costs, we anticipate recurring CapEx to exceed $0.05 per square foot. For the 11th consecutive quarter, our Board of Directors has approved an increase in our quarterly dividend to $0.23, which annualizes to $0.92 per share, a 4.5% increase from the first quarter 2021 dividend. As we look ahead, our strong property cash flows, credit tenant, and conservative balance sheet allow us to continue consolidating this highly fragmented industry, pushing our market share higher, even within an inflationary environment. You may now go ahead. So, you achieved higher cap rates on the deals this year around 7.5%, which is within your target range, but on the higher end. So first and foremost, we've tried to explain to everybody that this is really not a quarterly business. So, the greater universe of leased properties to the postal service comprises of the last mile flex properties. Thankfully, we're seeing a very strong pipeline and we look forward to executing on that pipeline and on the deals that we're seeing as prudently and thoughtfully as we possibly can. And just going off that, of course, as you've said this business is not a quarterly business. With that in mind, as you've highlighted previously lease payments represent less than 2% of the postal services' expenses. We have favorable lease terms, and we have leases that roll every five years. And so with that ability to mark-to-market, we believe we're well positioned to go into this inflation environment. You may now go ahead. But I would be very hard pressed to tell you that, that's not a factor. I think that people in general seeing the markets be the way they are and also seeing cap rates constrain and being concerned about inflationary environment and all the things that are going on right now, it it'll be very difficult to think that that's not a motivating factor. And so, I would tend to agree with you, I just don't know that we're hearing that specifically from sellers. I think that any tenant regardless of whether it's a government agency or not has to recognize that inflation exists, right. Today is different than it was a year ago or two years ago, right. And the inflation, the way it is today has to factor into a landlord's rental rate. And I think most tenants, even though they may not want to pay a higher rent recognize that it will be factoring into rent. You may now go ahead. I guess so Rob, my first question is just to you, more debt activity, certainly good, good pricing. We have not disclosed an updated balance sheet post that transaction, but what we did disclose was that we did increase our accordion feature to $75 million, and we did add a $75 million delayed draw term loan of which we funded 50 million up front. So, there is additional capacity on the extra accordion, and the extra term loan is incremental additional availability of capital under our facility. I guess I would just throw in, there would seem that some sellers might be more interested in cash than in equity given the volatility. And so when I look at that, it looks like Postal can do their transactions via its debt facilities for the balance of this year. So, Ed, we manage a very conservative balance sheet and that's on purpose so that we can handle all sorts of market conditions whether debt or equity favorable or unfavorable. And so, I think we're in a very strong position to fund our pipeline via the methods we have and in particular, because we're so low leverage, we can definitely ramp up our leverage. We have the capacity to not only from the availability of capital from our lenders, but also underneath our ratios that we've talked to the market about of staying below 40% net debt to enterprise value and below 7x net debt to annualized adjusted EBITDA. At the end of the quarter, those two numbers were about 23% and 3.9x, so way inside our target numbers. Yes, I was just wondering, because you do -- you have a lot of capacity, and I don't anticipate market volatility will last forever and things will stabilize at some point, but I was just it does seem like the capacity is there to continue to go forward in that funding deals for a near to intermediate term timeframe seems doable in the current environment. To some extent cap rates are a reflection of interest rates, and we've seen interest rates move up fairly significantly in the past few months. In past calls you talked about more players coming in, there's more competition in this space and that's put some downward pressure on the cap rates. Not that alleviated, but have you seen any modest relief in that given the change in interest rates. In general, postal real estate lags the general real estate market. I think today we're seeing more, the cap rights stabilized than actually move as a result of the interest rate moves. I think it's a difficult question to answer, because no one really knows what inflation is going to be in years three through five, right. The good news is that because our leases are five years and duration that you always have the ability to mark them to market when they roll, right. And with the retention rates that we have and the postal services, let's call it commitment to these buildings in these towns, it's not something that we've had to worry about in the past then it's not something I'm really that concerned about going forward. What I can say is this, if we've been getting 2% to 3% NOI increases, year-over-year, our goal is to be able to continue to keep those 2% to 3% annual NOI increases. You may now go ahead. Andrew, I was curious about the government's push or just the general societal push towards ESG and sustainability and what impacts that might be having on your business. It's a very relevant question, and the conversations within the Postal Service are definitely happening now. We're here to assist them in any way we can, but the implementation of anything like this is really more something that's born by them and driven by them than it is by us. But I think at the moment, I think they're trying to figure out how to roll out these initiatives throughout their network. Once they figure that out, if they like our assistance or if there's a way for us to partner with them, we are in constant communication with them about this, and we have to wait for them to kind of decide how this will play out throughout their logistics net network. So we still think our facility is, is quite attractive with our cost of capital on the debt side. It's a very good use of capital to be drawn on our revolver, terming out over time. But we do continually survey the secured debt market, looking at mortgages surveying that land. On behalf of myself and the entire team, we want to thank everybody for taking the time to join us for this call today."
}