{
    "symbol": "GBDC",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-09 22:46:02",
    "content": " Now, you'll recall from last quarter's earnings call that we believe higher base rates and higher spreads have materially increased GBDC's earnings power. We think GBDC's record adjusted NII per share for the quarter ended 12/31/2022, and its dividend coverage ratio of 112%, we think those validate the decision to raise the dividend. In fact, GBDC had a net realized gain of $0.02 per share for the quarter as capital gains on equity co-investments more than offset realized losses. I can tell you right now that Golub Capital's direct lending portfolio as a whole had a weighted average interest coverage ratio of 2.4 times at December 31, 2022 and GBDC's weighted average approximate Golub Capital's direct lending portfolio as a whole. Turning to slide four, we see GBDC's adjusted NII per share increased by $0.04 quarter-over-quarter to $0.37 per share, which represents an adjusted NII return on equity of 10%. As David described earlier, the increase in adjusted NII per share was primarily driven by the impact of increasing interest base rates on GBDC's portfolio and GBDC's low cost of funding structure. GBDC had an adjusted net realized and unrealized loss per share of $0.22, primarily from unrealized depreciation due to a combination of spread widening and isolated credit factors on certain portfolio companies. Looking at the bottom of the slide, the weighted average rate on investments increased by 210 basis points this quarter from a combination of higher base rates and wider assets spreads on new originations. The first tailwind is that there's a lag between when base rates change in the market and when loans in our portfolio reset the higher base rates, which happens once per quarter in those cases. The right bar looks at what GBDC's adjusted NII per share would have been in the 12/31 quarter if all of its floating-rate assets and liabilities had been based on a LIBOR rate of 477 basis points, the rate at quarter end. So we do, just to set context for everyone on the line, each quarter Golub Capital has an internal group that does valuation work with respect to every position in the portfolio and approximately 30% of those valuations are also reviewed each quarter by third-party valuation experts like Duff & Phelps, Houlihan Lokey, or Kroll, Houlihan Lokey, et cetera."
}