{
    "symbol": "GLAD",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-15 09:47:06",
    "content": " Administrative costs were largely unchanged, however, net management fees rose by $900,000 to $3.4 million with the increase in assets, higher incentive fees associated with the increase in investment yields and the absence of incentive fee credits compared to the prior quarter. Depreciation for the quarter totaled $2.3 million as the rise in the number of our equity position -- positions was more than offset by yield driven discounts on several recently closed debt investments, a reduction in the cumulative appreciation of our legacy common stock position in Targus in anticipation of an exit. With our floating rate investments exceeding our floating rate liabilities by approximately $400 million and the current floating rates on pace to be up about 125 basis points for the quarter, we would expect our net interest margin to be up in the range of $1.25 million this quarter. During the September quarter, total interest income rose $3 million or 23.6% to $15.6 million based on an increase in both earning assets as well as prevailing rate. Total expenses rose by $1.6 million quarter-over-quarter as interest expenses increased $600,000 and we had a $900,000 increase in net management fees driven by higher average assets, increased yields and reduced incentive fee credits. Net investment income for the quarter ended September 30 was $7.5 million, which was an increase of $500,000 compared to the prior quarter or $0.22 per share and covered more than 100% of our shareholder distributions. The net increase in net assets resulting from operations was $5.1 million or $0.15 per share for the quarter ended December 30, as impacted by the realized and unrealized valuation depreciation covered by Bob earlier. Liabilities increased to $345 million and consisted primarily of $150 million of  (ph) senior notes due January 2026, $50 million of 3 3/4% senior notes due May of 2027, and as of the end of the quarter advances under our line of credit were $142 million. As of September 30, net assets rose by $2.6 million from the prior quarter end with the realized and unrealized valuation depreciation, which was offset by common share issuance under our ATM program of $4.5 million."
}