{
    "symbol": "GLAD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-07-28 13:41:05",
    "content": " Originations for the quarter recovered after a slow Q1 and totaled $67 million for the period, which included 3 new platform investments and several add-on investments to existing portfolio companies. However, net management fees declined by $1.8 million to $2.5 million as the new deal closing fees credited against the base management fee rose to $1.1 million and incentive fee credits were $400,000 for the quarter. The net realized and unrealized losses on the portfolio for the period rose to $12.5 million on a combination of loan depreciation associated with elevated market spreads, reduced equity valuation multiples and the decline of 2 equity investments. Credit performance aside, the third-party market valuation of our debt investments, combined with a 4.3% decline in the enterprise value multiples on our equity portfolio, combined to total approximately $5.2 million of depreciation or roughly 45% of the depreciation in the quarter. Now that LIBOR has increased above the average LIBOR floor in the portfolio of 1.16%, we expect that for each 75 basis point increase above -- in LIBOR above the level as of 6/30, which was 1.8%, we will increase our quarterly net interest margin by $0.5 million and NII per share by $0.01. During the June quarter, total interest income declined $400,000 or 2.8% to $12.6 million. Total expenses increased by $1.7 million quarter-over-quarter as net management fees declined $1.8 million with the $1.1 million of new deal closing fees credited against the base management fee and incentive fee credits of $400,000. The net decrease in net assets resulting from operations was $5.6 million or negative $0.16 per share for the quarter ended June 30, 2022, compared to a net increase in net assets resulting from operations of $8.3 million or $0.24 per share for the prior quarter. Liabilities increased to $284 million as of June 30, 2022, and consisted primarily of $150 million of 5 1/8% senior notes due 2026 and $50 million of 3 3/4% senior notes due May of 2027. As of June 30, net assets declined by $12.5 million from the prior quarter end with the realized and unrealized valuation depreciation. To be specific, $531 million of loans on the books at the end of the quarter, of which 93% is floating rate and 83% is senior secured, all current and performing."
}