{
    "symbol": "GLAD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-03 11:38:10",
    "content": " So beginning with the last quarter's results, originations for the quarter came in at a record $111 million, which included six new proprietary investments, which represented approximately $140 million of total commitments. Interest income for the quarter declined 3% or $400,000 as the average interest-bearing investment portfolio increase of 1.4% did not offset the $600,000 of past due interest we received in the prior period. Other income surged with the $1.6 million exit fee generated by the Lignetics sale, and other prepayment fees to $3.3 million, which is an increase of $2.2 million over the prior quarter, and contributed to the 12.6% increase in total investment income to $16.2 million for the quarter. However, net management fees declined by 20% to $2.7 million as the increase in new deal closing fees remitted to the management company and credited against the base management fees results in a $700,000 decline in the net management fees compared to last quarter. Net assets from operations came in at $12.1 million or $0.35 a share, which included the realized gain from Lignetics sale, as well as $5 million of net unrealized portfolio appreciation on the quarter, largely related to the improved performance of several credits negatively impacted at the early stages of the COVID pandemic. This quarter's portfolio performance in equity investment appreciation brings the net NAB appreciation to $39.8 million since December 31st of 2019 prior to the pandemic, which represents $1.36 per share or 16.8% increase in NAB over the last two years. During the December quarter total interest income declined $400,000 or 3% to $12.9 million, which was driven by the receipt of $600,000 in past to interest during the prior quarter whereas we received no such amount during the current quarter. Net investment income for the quarter ended December 31st was $9.2 million, which was an increase of $2.3 million compared to the prior quarter, or $0.27 per share, and covered 137% of our shareholder distribution. The net increase in net assets resulting from operations was $12.1 million or $0.35 per share for the quarter ended December 31st, compared to $32.7 million or $0.95 per share for the prior quarter. As of December 31st, net assets rose by $5.4 million from the prior quarter end with a net realized and unrealized portfolio appreciation, as well as earnings in excess of distribution. The company realized net gains of $13.4 million and $1.6 million of fee income associated with the sale of Lignetics, which represented a blended return of about 18.5% over the seven year investment period."
}