{
    "symbol": "STNG",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-16 13:30:05",
    "content": " So what you have here is a market that's strengthening beyond what we've got here on the table, and we have a market and we have fixtures that are closing fourth quarter higher than the averages you're seeing here, and opening the first quarter at simply extraordinary outstanding numbers that we are already at all-time highs. Please go ahead with your question. I mean, obviously when the market is hot, you're not necessarily, even if it's a great rate like $37,500 for three years, you're still not anxious to -- we're not very anxious to fix our tonnage out. Please go ahead with your question. Please go ahead with your question. But the rate, what I could say is we could infer that they would be at the -- up until Friday we closed down on Friday that you would infer that basically a lot of the fixtures that were done between December 1 and last Friday at those averages, you can see of $90,000, $75,000, $55,000 would be the, let's say, the starting rates of Q1. So basically, by the end of December, end of this year, you would have definitely had, let's say, the first three weeks of Q1 booked which on the present rates, just think what those first three weeks could be at present rates, those three weeks, you could virtually earn what you earned in the third and the fourth quarter in the first three weeks. Please go ahead with your question. When it comes to the rates right now, when I look at it, it's very hard to -- you can think of things that are going to push the rates even higher, such as the February 5 situation because in products, it's kind of maybe even more wacky than crude because there isn't so much of a dark fleet in products. So because of the season itself, nothing to do with Russia, because of the season itself and the actual capacity of the supply side capacity at the moment, it is hard to think that this market is going to be anything but strong for this sort of -- during its normal seasonal period, which would normally last all the way through to -- with a little bit of a hiccup with refinery maintenance through tell, let's say, early mid-June. Please go ahead with your question."
}