{
    "symbol": "RYAAY",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-07 14:33:06",
    "content": " But I think if we get through the winter with strong growth, 10% pre-COVID with a reasonably strong pricing performance and we have no disruptions from COVID or Ukraine, then I would hope we'll be at the lower end of that â\u0082¬100 million to â\u0082¬200 million loss in the second half of the year. I think there's a reasonable prospect if there's no negative news flow on COVID and Ukraine this winter, that actually -- fares will be modestly up into the summer of next year because we will still be short. And we have -- what tension we have is that we get into discussions from April last of April discounts , whereby we pushed out the pay deals for the next 2 to 3 years over to '26 and some cases also '27 and we were able to restore pay earlier that was going to come in, in April where there was normally going to be a review cost. And I think that's likely to lead to what we -- if we go through a winter where there is -- we are meaningfully short of capacity in short-haul Europe, is operating at 80%, 85% of pre-COVID, Ryanair is offering at 110% of pre-COVID with load factors in the low 90%. And if we have Easter in Q1, a reasonably strong or robust Q2, I think -- itâ\u0080\u0099s, I think, very reasonable to predict that certainly for the first half of next year, especially if oil prices, spot jet stays up at around $110 a barrel. I mean, look, I think it's enough there that we say we set a target that by the end of FY '24, we'll be back at 0 net debt and we will be -- we will have paid down to â\u0082¬1.6 billion worth of bonds. But we're not going to break down guidance of what's in on our -- I think -- but as long as we're back in normal, we haven't had a negative COVID or Ukraine, you would expect there to be a normal build of unearned back to where it was similar to pre-COVID levels. Some increase -- I don't think a high or low -- I mean, we're talking about a low time  to maybe going up by 1% in the peak of next summer. I think -- and fares next year would be driven much more, I think, by rational capacity discipline this winter and that's -- every sign of that continuing through the winter period. And I would want to emphasize again, Q4 would be challenging because there's no issue here but Q1 next year will be all the better for having a full Easter in the middle of Q1, leading into what I think would be a strong Q2 because of Transatlantic visitors coming to Europe with a strong dollar, Asian visitors returning and the Europeans continuing the holiday. Flights into accommodation next summer in Europe, I think, will be materially higher than they were this year, despite where this year was -- I mean, certainly in our case, 14%, 15% ahead of where it was pre-COVID. Even extending the disclosures or not denying an interested with our easyJet, both of which we think would be candidates for M&A over the next couple of years because theyâ\u0080\u0099re not -- theyâ\u0080\u0099re both well run airlines but they are stuck in a space where they are mid airfare, mid cost. And I think thereâ\u0080\u0099s -- itâ\u0080\u0099s a much more likely a rational outcome that Wizz and easyJet will participate in some way in that M&A process and that Europe is inevitably moving towards a similar outturn as North America, where you will have 3 very large, somewhat higher cost, high fare connecting carriers and one very large low-cost carrier, except in Europe, that low-cost carriers is going to mean materially lower cost and lower fare than Southwest in the United States. I think it's inevident by the time we get to sometime in 2024, '25, we would like to be back at disclosures with Boeing on a new aircraft deal but Boeing have to sort out their own kind of manufacturing challenges at the moment and they're going to deliver what they've committed to first before we can actually start negotiating new aircraft orders with any bit of -- any sense of confidence that Boeing -- in the meantime, Airbus are marking up huge amounts of Boeing's market share. It's also giving us the ability to have a rock solid BBB rating which enables us to put hedging in place for both the dollar and for the fuel, particularly on the CapEx, where we're extremely well hedged out at â\u0082¬1.24 at the end of the Boeing order book which means we're locking in aircraft in euro terms at very attractive levels which enables us to grow over the next number of years."
}