{
    "symbol": "LDOS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 12:37:08",
    "content": " Adjusted EBITDA margin of 10.7% in the quarter was up 40 basis points year-over-year, which helped drive adjusted non-GAAP diluted EPS to a record $1.83, which represents growth of 17%. For the year, revenues were $14.4 billion, which was up 5% compared to 2021, despite a $107 million headwind from foreign currency movements, primarily from work in the UK and Australia in our Defense Solutions segment. Adjusted EBITDA was $397 million for the fourth quarter for an adjusted EBITDA margin of 10.7%, our highest margin of the year and above expectations based on higher growth on more profitable programs, better performance on some large programs and disciplined cost management. Civil revenues were $938 million in the quarter, up 17% compared to the prior year quarter and 2022 revenues were $3.46 billion, up 10% compared to 2021. Health revenues were $691 million for the quarter, an increase of 10% compared to the prior year quarter, driven primarily by performance on DHMSM and our new work on SSA IT. Health revenues were $2.69 billion for the year, up 5% over 2021, with the same drivers that I cited for the quarter plus strong performance on the Military and Family Life Counseling program. Civil non-GAAP operating margin for the year was 9.2%, down from 10.2% in the prior year, driven by legal matters that we've addressed in prior calls, a $26 million gain in 2021 and a $19 million expense in 2022. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Part of that is so that we can grow nonlinear with people -- and so if we have -- we get to the ramp in Dynetics where we're building more products, we can leverage our terrific workforce, but it's not one to one, and that allows us to grow faster than our indirect rates, and you can think about HR and benefits and all the things, the training programs that we have with our people. Please proceed with your questions."
}