{
    "symbol": "LDOS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 14:22:16",
    "content": " Please note, that today's conference is being recorded. At this time, I'll now turn the conference over to Stuart Davis, Senior Vice President, Investor Relations. Joining me today are Roger Krone, our Chairman and CEO; and Chris Cage, our Chief Financial Officer. Today's call is being webcast on the Investor Relations portion of our website, where you'll also find the earnings release and supplemental financial presentation slides that we'll use during today's call. Today's discussion contains forward-looking statements based on the environment as we currently see it and as such, does include risks and uncertainties. Finally, as shown on slide three, during the call we'll discuss GAAP and non-GAAP financial measures. With that, I'll turn the call over to Roger Krone, who will begin on slide four. The affirmation of our Defense Enclave Services contract award by the Government Accountability Office demonstrates our leadership in digital modernization across the federal government, with strong demand for our technology solutions and services across our diversified business portfolio. Number one, our financial performance for the quarter was strong, ahead of consensus at both the top and bottom lines. Non-GAAP diluted EPS for the quarter was also up 5% to $1.59, with an adjusted EBITDA margin of 10.2%. Number two, our business development results demonstrate our strong positioning in the government technology marketplace. We achieved net bookings of $2.2 billion in the quarter, representing a book-to-bill ratio of 0.6. Over the past 12 months, net bookings are $15.4 billion and book-to-bill is 1.1. Total backlog at the end of the quarter stood at $34.7 billion, which was up 4% year-over-year with funded backlog of $7.5 billion, up 5%. On a constant currency basis, backlog was $268 million higher. You can read about some of our awards in the press release, but let me highlight a few developments in the quarter. This program should have a several year runway of growing revenue and expanding profitability, but will not add materially to the 2022 revenue or earnings. On the first, we'll modernize and manage the SSA's IT infrastructure, including data center, data operations, networks telecommunications, cloud, and user services. On the second, we'll now perform all of the software development and mission application work that we previously split with other providers. But should we prevail, we could double our revenue at SSA and make ITSSC2 a top 10 program. Finally, we've seen some initial indications of an improving airport screening landscape. We were selected by the Dominican Republic's, Punta Cana International Airport to upgrade both people and baggage screening at all security lanes within the Terminal B checkpoint. In addition, bid volume and bid scale has increased meaningfully when compared to the first half of 2021. Although, we're not expecting a full recovery in the airport screening business until 2024, it's good to see some positive trends here. That said, the overall bookings environment has been challenging, as procurement time lines continue to extend. DoD outlays for example are down 2% this government fiscal year-to-date compared to fiscal year 2021, despite a higher budget. Still, our book-to-bill ratio, understates the true strength of the business development performance in the quarter, as it includes nothing for DES, and the protested SSA awards. We've talked about being appropriately levered and maintaining our investment-grade rating, returning a quarterly dividend, reinvesting for growth, both organically and inorganically and returning excess cash to shareholders in a tax-efficient manner. In Q1, we executed a $500 million accelerated share repurchase. And we've just entered into a definitive agreement to acquire Cobham Aviation Services, Australia's Aviation Special Mission business for about US$215 million. The business owns and operates 14 modified aircraft, providing border force airborne surveillance and maritime safety search and rescue to the Australian Federal Government and a critical element of Australia's national security. This acquisition diversifies our Australian portfolio into capability and mission services work, with both the Defense Maritime and Homeland Affairs programs. Finally, integration risk is manageable, because airborne surveillance is what we know how to do well and we already have strong local leadership and infrastructure to support success. Number four, Leidos is an attractive destination for talented people. In the second quarter, we hired nearly 3,600 people, a number we've only surpassed once in five years. Year-to-date, we've hired more than 6,200 people. Quarter-after-quarter, we demonstrated that talent acquisition is a core Leido's strength. Competition for talent remains high as critical skills for us, such as software engineers and developers are in demand by both tech and non-tech companies. Even though voluntary attrition seems to have peaked, we remain focused on keeping engaged with our people. In fact, our June leadership offsite was focused on retention and we're now implementing many of the ideas that came out of that session. Before turning it over to Chris, let me touch on the federal budget landscape. The fiscal year '23 appropriations process is also underway which should result in significant nominal increases to 2022 levels, but we expect that the government will begin the fiscal year with a continuing resolution that should be resolved before the end of the 116th Congress. And finally, I'm pleased to announce that we'll be hosting an investor site visit at Dynetics in Huntsville Alabama this fall. Expect to come away with a much better understanding of the culture and key growth drivers for Dynetics including the Hypersonic's, Indirect Fire Protection Capability and space-based missile defense programs. And there are a number of moving pieces I want to cover this morning, starting with the income statement on Slide 5. Revenues for the quarter were $3.6 billion, up 4.3% compared to the prior year quarter. Revenues grew organically across all three reportable segments, given robust hiring and our recent program wins. The current share count benefits from the retirement of 300,000 shares as part of the final settlement of the ASR program. In addition, the strengthening dollar represented about a $24 million year-over-year headwind for our UK and Australia businesses which lowered the segment growth rate by about a 1 point. Civil revenues increased 7.3% compared to the prior year quarter, primarily driven by the start-up of the NASA AEGIS program and increased demand on existing programs, including the support to Hanford and our engineering support to commercial energy providers. Civil non-GAAP operating income margin was 6.5% compared to 9.1% in the prior year quarter as a result of an adverse arbitration ruling which led to $17 million of additional expense, related to a dispute arising out of the acquisition of the IS&GS business from Lockheed Martin in 2016. Excluding this arbitration write-down, Civil margins would have been up sequentially to 8.5%. In addition, we had a $28 million equitable adjustment to cover costs incurred as a result of the COVID-19 pandemic which caused non-GAAP operating margin to improve to 19.8% from 17.8% in the prior year quarter. We had originally anticipated to receive this payment in the second half of the year, so we're pleased to resolve this matter earlier than expected. Turning now to cash flow and the balance sheet on slide 7, operating cash flow for the quarter was $40 million and free cash flow which is net of capital expenditures was $19 million. While DSOs in the quarter came down two days sequentially to 61, $110 million of collections that we anticipated in Q2 came in during the first week of July. During the second quarter we returned $51 million to shareholders, primarily through our ongoing dividend program. At the end of the quarter we had $339 million in cash and cash equivalents and $5.2 billion in debt, including $150 million of commercial paper notes outstanding. The purchase price for the Cobham Aviation Special Mission acquisition was AUD310 million, which we hedge to lock us in at the $215 million purchase price that Roger quoted. With that acquisition we expect 2022 will follow our standard capital allocation approach with the balance of organic and inorganic growth investments, dividends, share repurchases against the backdrop of a leverage ratio trending towards three times. On to the forward outlook, as shown on slide 8 we're maintaining our guidance ranges for fiscal year 2022. Taking a big picture view, when we put together our plan for 2022, we had expected to build momentum through the year. Our guidance calls for the second half to be more in line with the first half from a revenue, EPS and EBITDA perspective. On revenues, we're ahead of where we expected coming into the year, stemming from the build-out of our recent wins and on-contract growth through trusted customer relationships. In addition, we've had more margin dilution than anticipated from the start-up of some newer programs. Finally, we're maintaining our operating cash flow guidance of at least $1 billion. If the 2022 effective date of the Tax Cuts and Jobs Act research cost capitalization provision remains in place, we expect our income taxes payable and net deferred tax assets will each increase by approximately $150 million in fiscal 2022 and the related negative impact to cash will be realized in fiscal 2023. With that, I'll turn the call over to Rob, so we can take some questions. Please proceed with your questions. Hey, Roger I guess you gave us some high-level color on the budget in the backdrop. We made the comment I think both Chris and I that long-term, we don't see anything that changes the conversation that we've had in the past. And frankly since we were all together in New York last fall, the budget environment actually has gotten better and better in the areas where we're focused and differentiated. Well, it's really exciting across the board. We have actually three Enduring Fires program, one with the laser, one with a missile and one with a high-powered microwave. The space business, there's things that hopefully we'll be able to talk about next quarter that are really great developments there. And we are -- I don't want to overemphasize this, but we're really, really pleased with how that has worked out. Please proceed with your question. And so seeing headcount grow faster than revenue, we actually view that as a positive. And then the second with Cerner and their EHR Modernization program, it's currently paused again. Obviously, we're very pleased with the Health team and their ongoing performance. And we had told you in Q1 that we had won a recompete successfully that was critically important, although that there was an increased amount of competition introduced on that program. Obviously, we had hoped and expected that legislation would have passed by now. We're monitoring that daily, hourly and we hope to have some good news soon. And Roger might comment on the VA. Obviously, we watch the VA program very closely. The movement of Cerner to Oracle, I think is going to be a positive for the program. We stand ready to support Oracle, Cerner, the VA, any one of those organizations with the best of Leidos and frankly, members of our DHMSM team, and we'll just have to sit back and see how it develops. Again, I know they're paused. But the VA needs a single electronic healthcare record system and they need the interoperability with the active military, and we're strongly supportive of both of those. Thank you very much. Please proceed with your questions. Roger, one thing that we're noticing with -- in your numbers today and also happened for Booz, but flat sequential sales in defense. Of course, some of the programs that we won got protested, so they got pushed further into the year. And I really can't -- I can't tell you why -- what's going on in the acquisition in the Pentagon, although we do talk to the Pentagon officials, head of Acquisition head of Research. And then, something that's really important to us is, what we call special project work on a lot of our contracts. That's really beneficial to us, both from a top line and a bottom line. But we're cautious to forecast it, as you noticed in Chris' remarks. I think short-term, it's just kind of getting the machine, running again and getting them to spend the money. I think that's typically what we would see, the larger, more complicated to evaluate, multiple competitors, longer EM, evaluation process. And again, there's hope that we'll see more of that come through in this -- in the fall quarter leading up the government fiscal year-end. I mean different agencies are different, but we've seen more consolidation into larger vehicles is often the case. And this is an absolute, but if a program is over $1 billion, I think the customer runs the acquisition process with the knowledge that there'll be a protest. So I think in both peer review and in writing the acquisition opinion and the sourcing letter, I think they're taking more time to get it right to either avoid the protest, which obviously hasn't been happening or to ensure that the award will be upheld. And I think in the government that they are now kind of like a protest is almost the normal and the bigger the program, the more likely the protest. So although, we have started to see some moderation in attrition which I view as favorable but I do worry a little bit about the economy. And I think once they get here and they start doing some of the fantastic stuff that we do, they go gosh, I want to do that. Roger, I think you said you didn't book anything for DES. And DES, we've been turned on for the first task quarter which is very small. We are â\u0080\u0093 let me spend at least 15, 20 seconds to describe the program. Next year right, we started to do migrations. But again, we love the team's performance. We knew it was going to be certainly at the front end of this program, multiyear program on the lower margin range. And then Defense, quite honestly is probably -- over time, it will be higher. Whether that occurs in the back half of this year's TBD, I mean the special project work that Roger talked about is something that we'd love to see that come on at a higher volume. But right now, I'd say probably along these -- this current trajectory on the defense margin side for the near term. Please proceed with your question. And obviously, I understand it takes time to get all the head count added and commercial aero are going to returns in 2024. But again, I think Roger talked about the budget backdrop is a foundational starting point and that's favorable. Therefore, the volume of things that we're seeing and bidding on continues to be strong and favorable. And so, defense activity is one that we've seen a lot of throughput in opportunities more Dig MOD opportunities more C4ISR opportunities. Dynetics in the defense hardware side, absolutely ,there are some programs that will be ramping up. There's also some programs that will be moderating, as we transition towards proof of concept, completing demos and getting into hopefully a production cycle award which will probably be more likely 2024. Civil again, would probably be the aviation hardware accelerating growth, but not back to pre-COVID levels, but the trends are positive there. But again, we'll talk in more detail about 2023 as we get to that time of the year. But if you look at the population statistics, labor force participation isn't coming back and the US population growth is almost close to shrinking. Hey, Colin, I'll touch on it a little bit. I mean, it's just a fundamental structural problem. So, again, they're not a huge part of the portfolio but they'll becoming increasingly larger part of the portfolio over time. Please proceed with your question. So, you and Booz had some trends that were very similar; strong sales a very anemic bookings although very strong fundings which I don't understand how you get those two together; and very weak cash which slips into the next quarter. So, Cai I think the next quarter will be better, but I don't see the super blowout. Again, as you pointed out some of our cash payments that we thought were going to happen in the quarter got paid in the first week or two of July. We don't get a protest, but more likely than not we get a protest. So, that's not really going to give us much lift in third quarter. And I think Cai is increasingly we're talking about the mega awards the larger awards those just don't often line up with the government fiscal year-end third quarter cycle. So, you could see the bigger quarters any time like we had a great first quarter. On the funding side, I mean again I think that's conversion of previous prior awards unfunded to funded. So, to me, it's great. I think a good example is this program we call FENS, which is sort of a network infrastructure program for the FAA. A year ago, we thought it would have happened in first quarter and first quarter it got delayed to the second half of the year. Now it's a little bit uncertain, even when they're going to make the award, I think we can almost count on a protest. So if they make the award in the third quarter or fourth quarter, that could be extended well into 2023. And we've seen more of that trend, and more of that behavior perhaps than we have over the past couple of years. They're not quite -- well they're not announceable, yet. Well, I always think every month, we have great wins. There's -- sometimes the wins, I'm most excited about probably don't make the print, because they're strategic and there is technology involved. Probably, our next biggest win on the horizon, there's a couple of programs there's a big IDIQ that might get award. But then we have to fight for tens score, it's probably that FAA FENS program. Thank you very much. Obviously, a lot of our allies are talking about spending more on defense. Just curious, if that could be a bigger part of the business in the future. Listen, we're really pleased with our international work. They have fought, I think in every war alongside the US, since the turn of the century. So growing more in Australia, is definitely a priority for us. We want to be in a country, grow large enough where we're going to have infrastructure in critical mass, and then use that country to maybe move regionally. We are not going to be like some of our competitors, where we're big enough that we can have offices in every country. But we think -- the international, is a nice mix in the portfolio. It could be countercyclical, with some of the priorities within the US. And then I put into a whole different category, our SES business, our security business, which by its nature is global, I mean, it's just -- the way that business works both at airports and ports and borders. If you can put a provision at Dulles, you can put a provision in Hong Kong usually with small mods. And around the world, looks to US, as the standard setter. So in the SES business, we're probably anomaly 125 countries. But it doesn't mean, that we have necessarily a large organization in those countries. And that business, I would tell you today, is already global and isn't going to become more global. We're about in every country, that we feel is appropriate for us to sell in  I really understood your question to be more of okay, well you bought another business in Australia, which we think is a real positive. And growing larger in Australia, is absolutely part of our strategy. And then, I guess, just one more on kind of DES and the long-term targets that you guys gave at the Investor Day, last fall. Well, Matt, I would tell you that certainly in the near term that won't -- we don't expect the margins on that program to get at or above the corporate average. In fact that's part of what we're seeing this year quite honestly is while we are in the protest process, the team was building out the PMO staff. So we're spending money on DES, and we'll continue to do so, because we're taking a big picture a long-term view on that. But certainly by 2024, it should be a more significant part of the growth story for us. Please proceed with your question. You had previously guided that business, I guess, if we go back to early 2020 to low teens, annual sales growth with expanding margins back when you did that deal with L3. The way we look at it is, we had a path when we bought the business and we signed the deal before COVID. In our forecast it will continue where in 2024, we'll hit the pre-COVID level and then it will continue to grow beyond that as airports both in the US and in the rest of the world end up modernizing their equipment, one, because of age, but secondly, because of evolving threat, which is new chemicals, fentanyl, other chemicals, meth that the old machines couldn't detect. Well, I think look at improved throughput right which is a huge deal. And our other business is literally where you drive a car through, you drive a truck through. So they're very, very different. The customer when you go way to the top is the same in Australia, but it's probably a different organization of that customer. And we were not interested in the carbon business, because of a crossover to our SES business. First of all, let me tell you what I think is going to happen and then if you want an editorial of what do I think -- I use -- that too. And I think that will be good for Leidos across the board both our Defense business, our Intel business our Health and Civil. Now if you ask me if that's good, by the way, I think it's good for the company. But from a Leidos standpoint, from an investor standpoint I expect the budget environment to be very, very healthy for us for years. Please proceed with your questions. So Seth it â\u0080\u0093 obviously, supply chain is a factor that we're seeing here and there. But the particular issue in hypersonics was kind of plan, the cycle production schedule for that program. Please proceed with your question. Certainly, SES is a big part of the longer-term margin strategy. We do well in our transportation, aviation business with the FAA quite honestly. And the anchor is some of our MNO support contracts, mission ops whether that's with DOE or other customers are tend to be on the lower margin side. So I would say in the near-term to get back to those levels is probably a multiyear undertaking as we look to win and execute more Dig Mod portfolio and see SES rebound, but some small improvements in other parts of the portfolio or what we after with the team. Thank you, Rob and thank you for your assistance on today's call."
}