{
    "symbol": "PLTR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 11:46:02",
    "content": " In the last 3 years, we have grown Palantir from a 743 revenue business with hundreds of millions of dollars in actual loss to, in the last 12 months, a $1.74 billion business with $300 million in free cash flow, which represents a 41% CAGR. I personally remain very optimistic that the next 3 years will look a lot like the last 3 years, again, where we took a money-losing business and made a business that throws off free cash flow, where we ended up as of today with $2.4 billion in the bank and no debt, and that the large and chunky nature of our contracts will continue to be in large part an advantage because these contracts do not disappear. Our U.S. commercial business grew 120%, rising from $39 million in Q2 2021 to $86 million this quarter. Our core U.S. commercial business, which excludes strategic investments, grew 10% quarter-over-quarter or greater for the past 4 quarters, most recently reaching $67.4 million, 14% sequential growth. Our government business grew to $263 million in revenue in Q2, rising 9% quarter-over-quarter. More broadly, across the commercial and government sectors, health care has become a substantial and rapidly growing business, generating approximately $153 million in revenue in the first half of 2022, up from $42 million in the first half of 2020 at the onset of the pandemic. U.S. government revenue increased 27% versus the year ago period to $205 million, up from a 16% year-over-year increase in the first quarter. So I wouldn't even like -- and by the way, I would say we're less competitive with our competition than -- we have a lot of people compete with us, most of the companies that kind of are built for Wall Street, which have perfect financials and have perfect proclamations of what they're going to hit and very, very thin products, sales forces that are 50% of their total people. Our product, we're looking at the U.S. business that's going to cross the $1 billion mark next year as well."
}