{
    "symbol": "PLTR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-13 20:21:04",
    "content": " We ended the quarter with 143 U.S. commercial customers, an increase of 79% year-over-year, and converted 13 pilots the most quarter to date set up our U.S. commercial business to reaccelerate in 2023. Our international commercial business grew 11% year-over-year in the fourth quarter, including a multimillion dollar long-term strategic partnership with Crisis24, a GardaWorld Company, to deliver data-driven security and risk management, and a $50 million five-year expansion of our work with SOMPO Holdings, where Foundry is helping to improve security, health and well-being through digital transformation. Our government business overall saw growth across the board as well as we generated $293 million in revenue this past quarter, an increase of 23% year-over-year. Likewise, our international government business was up 26% year-over-year, including the expansion of our work supporting pressing global events as well as the signing of Palantir's enterprise agreement with Defence Digital, a consolidated effort on the part of the British military to modernize its software systems. In the fourth quarter of 2022, we generated $509 million in revenue, up 18% year-over-year and 6% sequentially. We generated $1.16 billion in total U.S. revenue in 2022, representing a growth rate of 32% over the year ago period. In the fourth quarter of 2022, U.S. revenue grew 19% year-over-year to $302 million. In 2022, our overall commercial revenue grew 29% year-over-year to $834 million. In the fourth quarter of 2022, U.S. commercial revenue grew 12% year-over-year to $77 million but was down sequentially as we saw headwinds from catch-up revenue in the prior quarter as well as a decline of revenue from customers in our strategic investment program given the outsized impact of the macro environment on these customers. In the fourth quarter of 2022, our international commercial business grew 11% year-over-year and 19% sequentially driven by new deals in APAC, Canada and Europe. And in the fourth quarter of 2022, our government business grew 23% year-over-year to $293 million. We generated $826 million in U.S. government revenue in 2022, representing a growth rate of 22% year-over-year. In the fourth quarter of 2022, we generated $225 million in U.S. government revenue, representing a growth rate of 22% year-over-year and 8% sequentially. Fourth quarter adjusted income from operations was $114 million, representing an adjusted operating margin of 22%, 600 basis points ahead of our prior guidance. Our combined revenue growth and adjusted operating margin was 40% in the fourth quarter and 46% in full year 2022, our third consecutive full year in excess of the Rule of 40 and a score that we will continue to strive to achieve throughout 2023. In the fourth quarter of 2022, we generated $79 million in cash from operations, representing a margin of 15% and our eighth consecutive quarter of positive cash from operations."
}