{
    "symbol": "PLTR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 11:25:06",
    "content": " Despite significant geopolitical and macroeconomic uncertainty, our government business surpassed the $1 billion revenue mark on a trailing 12-month basis, and our U.S. commercial business grew for the ninth quarter in a row, rising 53% year-over-year. The total value of contracts that we have closed in the third quarter reached 1.3 billion, a new milestone for us, which includes nearly $1 billion of contract awards from the U.S. government alone such as our most recent contract worth up to 229 million with the U.S. Army Research Lab to deliver AI ML capabilities across the DoD. U.S. revenue grew 31% year-over-year to 297 million, and on a trailing 12-month basis, U. S. revenue grew to $1.11 billion. Our commercial revenue in the United States grew 53% year-over-year to $88 million, and our core U.S. commercial revenue, which excludes our strategic investment program, grew 47% year-over-year and 7% sequentially. On customer count, our net new U.S. commercial customers grew 124% year-over-year and 11% quarter-over-quarter, marking 7 consecutive quarters of sequential growth greater than 10%. Third quarter total revenue grew 22% year-over-year to $478 million, ahead of our prior guidance even when factoring in an additional $1. Third quarter adjusted income from operations, excluding stock-based compensation and related employer payroll taxes was $81 million, representing adjusted operating margin of 17%, 600 basis points ahead of our prior guidance. Our adjusted operating margin significantly exceeded our guidance as a result of several factors, but primarily driven by cloud and deployment efficiencies representing around $9 million of outperformance, and the elimination of certain discretionary spend across the business, particularly in G&A, representing approximately $14 million of outperformance. Now turning to our outlook, for the full year 2022, despite a negative $6 million currency impact since our prior quarter's guidance, we are reaffirming our revenue guidance of between $1.9 billion and $1.902 billion. For the fourth quarter, after factoring in a negative $5 million currency impact since our prior quarter's guidance, we expect revenue of between $503 million and $505 million. In Palo Alto, we heard from Tyson's Food where they were able to use the ontology to quickly go from an initial use case around COVID response to a set of use cases that got to $10 million of value and then quickly to $40 million and then finally to $200 million worth of value."
}