{
    "symbol": "PRTH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-23 16:32:06",
    "content": " For the year, revenue increased 29% to $664 million, growing organically by 23% in the fourth quarter and 19.1% in 2022. Full year adjusted gross profit and EBITDA both grew 46%, with adjusted gross profit reaching $226.9 million and adjusted EBITDA coming in within our target at $140.3 million for the full year 2022. As such, we are expecting to deliver consistent double-digit top line and bottom line growth projecting revenue of $740 million to $755 million and adjusted EBITDA of $160 million to $165 million for the full year 2023. For the full year, we had almost 15% growth in bankcard dollar volume across all segments to roughly $62 billion. For the fourth quarter, that segment had revenue of approximately $150 million which was an increase of 23% over the prior year's fourth quarter. Lastly, for SMB, quarterly operating income increased by 42% to almost $15 million as a result of operating leverage within the business segment. With respect to B2B's profitability on Slide 13, adjusted gross profit declined by 35% as a result of the Managed Services wind down but you can also see how the adjusted gross profit margin increased by over 12 percentage points during the quarter as the lower margin Managed Services business rolled off. For the quarter, the B2B segment had an operating loss of $1.1 million as certain costs related to the Managed Services program weren't able to be fully removed from the P&L in Q4 but has since been reduced. As shown on the next page, adjusted gross profit for the Enterprise segment increased by 50% to $23.3 million and adjusted gross profit margins expanded by 300 basis points to 93.6%. Operating expenses are shown on Page 16 and totaled $42.8 million for the quarter, an increase of 20% from the prior year. For the full year, adjusted EBITDA of $140.3 million includes an add back of $53.5 million for interest expense, $6.2 million of noncash stock compensation expense and $6.7 million of other noncash or nonrecurring expenses. Based on continued strong growth and trends in the business, we are forecasting 12% to 14% growth in revenue to a range of $740 million to $755 million for the year. As a result, we are forecasting adjusted EBITDA growth of 14% to 18% which will result in a range of $160 million to $165 million for the full year. During it, we called out our decision to accelerate investment in our banking product initiatives in the back half of 2022, that would lead to slightly lower bottom line guidance, stating that, we believe accelerating feature development of our native Priority Passport offering to deliver a full suite of proprietary payment and banking solutions into the SMB and B2B markets as well as enterprise partners will result in outside benefit to our shareholders in the coming years."
}