{
    "symbol": "PRTH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 17:03:02",
    "content": " Our third quarter revenue increased almost 26% from the prior year to a record $166.4 million, which led to a nearly 50% increase in gross profit to $58.5 million and a 48.7% improvement in adjusted EBITDA to $35.1 million. On a year-to-date basis, total revenue was up 31.1% to just over $486 million and grew organically by 12.7% in the third quarter and 17% on a year-to-date basis, excluding the impact of the Finxera acquisition. For the third quarter our B2B segment delivered year-over-year revenue growth of 16.5%, a gross profit increase of $600,000, and gross margin expansion of 410 basis points compared to the prior year quarter. Lastly, our Enterprise payments segment, which provides embedded payments and banking solutions to our partners, reported quarterly revenue of $21.7 million and gross profit of $20 million. Looking at slide 10, SMB payments revenue of $139.9 million increased 12.1% over the prior year driven by bank card dollar volume growth of 9.2% to roughly $15.1 billion, 8.3% growth in bankcard transaction count and just under 1% growth in average ticket size. Looking at slide 11, B2B payments revenue of $4.9 million in the third quarter of 2022 increased 16.4% from the third quarter of 2021. While the year-over-year comparison for enterprise is difficult given the CFTPay acquisition late in the third quarter of 2021, I did want to note that on a sequential quarter basis we also saw strong growth in enterprise, with increased enrollments, increased number of billed clients and rising interest rates all contributing to over 16% growth in revenue compared to the second quarter of 2022. Consistent with the comments that I made on the comparability of revenue for the enterprise segment, we also saw a strong sequential quarterly growth in Q3 with gross profit increasing 17.4% over the second quarter of 2022. On slide 15, operating income for the quarter of $14.1 million, increased about 70% from $8.3 million in 2021. B2B operating income of $200,000 increased from breakeven levels in 2021, driven by increased revenues combined with operating leverage that allowed for margin expansion despite the previously discussed and expected decline in the revenue from a large managed services customer. Enterprise operating income of $9.3 million increased by $8.1 million, from $1.2 million in 2021 consistent with the discussion on revenue and gross profit for this segment sequential quarterly growth in Enterprise's operating income was also strong with an over 60% increase from Q2 to Q3. As you look at the EBITDA walk on this slide, the largest items added back to consolidated income are obviously interest expense and depreciation and amortization Interest expense of $13.4 million is an increase of $5.3 million from Q3 2021 levels, given the combination of the full quarter effect of the higher comparative debt balances for Q3 2022 compared to Q3 2021 along with the impact of the rising interest rate environment given the floating rate nature of our debt agreement."
}