{
    "symbol": "PRTH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 15:05:09",
    "content": " For the third quarter in a row, we saw a total quarterly revenue increase more than 33% from the prior year to a record $166 million in Q2. On a year-to-date basis, total revenue is up 34% to nearly $320 million and grew organically by 19.6%, excluding the Finxera acquisition. As we have noted in the past, our unified commerce platform efficiently serves the SMB, B2B, and enterprise payment markets at scale supporting over 248,000 active merchant accounts, more than 390,000 active bank deposit accounts, and processing total annual payments volume of over $106 billion, with over 80% derived from integrated software products. With our strong foundation and robust pipeline of business, we remain confident in our ability to generate revenue between $650 million and $665 million and EBITDA of $145 million to $150 million that we projected for 2022, demonstrating Priorityâ\u0080\u0099s ability to perform in challenging economic environment. Our largest segment, SMB payments continues to outperform the industry reporting year-over-year bank card volume growth of 10.9% and revenue growth of 18.5% in Q2. For the second quarter, our B2B segment delivered year-over-year revenue growth of 32.5% and operating income increased $700,000. Lastly, our enterprise payment segment, which provides embedded payments and banking solutions to modernize legacy platforms and accelerate software partner strategies to monetize payments, reported year-over-year revenue growth of $18 million in Q2 and $5.5 million increase in operating income. SMB payments revenue of $142.5 million increased 18.5% driven by bank card, dollar volume growth of 10.9%, 9% growth in transactions and 1.7% growth in average ticket. Salaries and benefits of $15.8 million increased 51.9% from $10.4 million as a result of a nearly 70% increase in headcount, mainly driven by the third quarter 2021 acquisition of Finxera. SMB operating income of $14 million declined 2.8% from $14.4 million due largely to a $1.7 million increase in salary and employee benefits due to higher headcount and stock-based compensation, a $1.2 million increase in SG&A expenses and a $0.6 million increase in depreciation and amortization. So referring to just enterprise payment volumes, for example, $387 million versus $216 last quarter, I think in terms of payment volumes. I think Mike, if you look at processing dollar volume of integrated partners in the first quarter was $216 million and in the second quarter was $387 million."
}