{
    "symbol": "NE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 14:22:08",
    "content": " At this time, I would like to welcome everyone to the Noble Corporation First Quarter 2022 Results Conference Call. Thank you, Chantal, and welcome everyone to Noble Corporation's first quarter 2022 earnings conference call. Also joining are Blake Denton, Vice President, Marketing and Contracts; and Joey Kawaja, Vice President of Operations. For today's call, we will begin with prepared remarks, followed by a question-and-answer session. Please refer to our SEC filings for more information regarding our forward-looking statements, including the risks and uncertainties that could impact our future results, including risks and uncertainties associated with our previously announced business combination with Maersk Drilling. Investors should carefully read our previous and ongoing disclosure with respect to such business combination, included in our press release issued yesterday and in our other filings with the SEC. And with that, I'll now turn the call over to Robert Eifler, President and Chief Executive Officer of Noble. I'll start with the commentary on underlying improvements to our business outlook and follow with highlights on our global operations in the rig market, before turning the call over to Richard to review our financial results for the quarter. Following dramatic improvement in our business through 2021, we conclude the first quarter of 2022 with continued momentum supported by a strong oil price environment and an increasing focus on energy security globally. At Noble, our contracted utilization stands at 100% in our marketed fleet with contract visibility on our four seventh generation drill ships in Guyana to late 2025. In the jack-up segment, activity has accelerated to accompany the continuing improvement in the ultra-deepwater space and forecasted demand remains strong across market segments for the foreseeable future. In the Gulf of Mexico, EDW dayrate appreciation continued with some rates closing in on $400,000 per day and steadily increasing average fixture duration year-over-year. In the first quarter, our customer QuarterNorth Energy exercised priced options for the Noble Faye Kozack at $290,000 per day. Additionally, Noble was awarded two contracts for the Noble Globetrotter I for work in Mexico at $275,000 and $325,000 per day following the demobilization from the long-term Shell contract. These two contracts alongside other sixth generation fixtures over $300,000 per day elsewhere in the industry are a particularly strong market signal. Moving to South America, the Petrobras long-term strategy of growing production and increasing CapEx, deployment continued through Q1 as they awarded four new contracts for a total of approximately seven rig years. And just this past Thursday, Petrobras launched additional tenders for up to eight rigs, starting as early as Q4 this year. Lastly, the Noble Regina Allen secured additional work in Trinidad and Tobago this quarter at a rate of $102,000 per day. Our other ready stacked jack-up in the region, the Noble Houston Colbert, also secured long-term work during the quarter. In Norway, based on the latest schedule, the Noble Lloyd Noble will continue to support Equinor into the second quarter of 2023 with priced or indexed options carrying the work into 2024. In my remarks today, I plan to provide some brief highlights of our first quarter results and then discuss our outlook for the remainder of the year, including our revised guidance for 2022. This quarter's revenue was positively impacted by a full quarter of operating days for the Noble Faye Kozack and Noble Lloyd Noble, the commencement of the Noble Gerry de Souza operations in Suriname towards the end of the quarter and dayrate increases for the rigs operating in Guyana. Contract drilling services costs for the first quarter were $166 million, down from $183 million in the fourth quarter of 2021. The lower costs were primarily driven by the divestiture of the four jack-ups in Saudi Arabia, the retirement of the Noble Clyde Boudreaux and the completion of leg repairs on the Noble Hans Deul during the fourth quarter. Capital expenditures totaled $45 million in the first quarter, which includes $11 million of client reimbursable investments. The largest driver of capital spending during the quarter was the completion of our upgrades on Noble Gerry de Souza, which was outfitted with the second BOP and an MPD system. As a reminder, this rig came into our fleet as part of the Pacific Drilling acquisition with limited contract backlog. During the first quarter, we recognized $17 million in Hurricane Ida related expenses. As we have disclosed before, we have insurance coverage for property damage with a $10 million deductible and coverage for P&I with a $5 million deductible. As I mentioned in the last call, we anticipate significant sequential quarterly improvements throughout this year, especially from the first of the second quarter. Firstly, our four drill ships in Guyana received their biannual dayrate adjustment on March 1st, which positively impacted the last month of the first quarter. The current rate, which was set during the fourth quarter of 2021 compares favorably to the previous rate that was set in early 2021. Secondly, we expect a full quarter contribution from the Noble Gerry de Souza in Suriname. Thirdly, we expect the Noble Regina Allen to commence its contract in mid May. This increase is primarily driven by improved drill ship activity and dayrates with adjusted EBITDA partially offset by expected inflationary pressures, which I will address more shortly. As evidenced by our fleet status report that was released yesterday, excluding our two cold stacked rigs, we have visibility to all our rigs operating in the fourth quarter. Including the LOA with Qatargas, we currently have approximately 94% of the projected operating days required to realize our guidance for the rest of the year under contract or approximately 98% if you include the current options on the drill ships in the Gulf of Mexico and South America. Full year 2022 capital expenditure guidance range, net of client reimbursables, increased by $15 million to $145 million to 160 million. We currently do not project any major reactivations or capital projects, which we believe could have the potential to be challenged by supply chain and inflation issues from both the cost and timing perspective. Supporting this run rate is our recent contracting success and ongoing customer discussions, which results in an expectation for all of our rigs, excluding our cold stacked rigs that contribute to the top-line during the fourth quarter. Firstly, as you might have read, we are currently working with the UK Competition and Markets Authority, the CMA, to address the agency's concerns over lessened competition in its jurisdiction. In closing, I'm extremely excited about Noble's positioning in the current market. We have industry leading utilization and excellent exposure to improving market dayrates, where in many cases this exposure comes without any downtime between contracts. Robert, I did was hoping you could provide a little bit more color around the revenue guidance, which was super helpful by the way. So thank you for that, realizing that – I guess I'll ask it this way, realizing that clearly we're sensitive around the disclosure of rates. But I did notice that that one of those rigs, the  actually has I guess an LOI for work in Qatar, which congratulations by the way. We don't want to get deep at all into our process, but we would anticipate the rig package is being one of the two that we announced previously. And then I'll just squeeze one more in, I don't think it matters, but I noticed in the – along with the Remedy Rigs, there's a Maersk rig. And then there's two CJ-70s, one owned by Maersk, one owned by Noble. I wanted to maybe delve in a little bit, Robert, about your commentary on improved Middle East dayrates. The crisis and the war in Ukraine, I think, changed that market more dramatically than any other and so – and in particular, in the Middle East where ramp up is a bit more short cycle. And I would say it's hard to predict exactly where that market goes, but we do think with the number of open tenders and a great deal of visibility on demand in that region that – particularly the players that are highly focused there are likely to probably push, but I think there has been a contract – a change in supply demand. So no, we don't have any news on the two cold stacked rigs. And we've said previously what it would take and kind of how we think about the thresholds for reactivating those rigs, which has not changed. But speaking more specifically to inflation we're seeing in the reference to reactivations, I think we kind of take the opposite approach that included in our guidance for this year. But on the supply chain side, we are seeing – kind of across the board, we're seeing higher prices, as Richard mentioned, oftentimes in the kind of 20% to 25% range. So everything that I've just mentioned is baked into our guidance and is foreseeing going forward, but I do think it gets more complicated the bigger the project you have. And I'm sorry to be later for this point, but the $15 million in incremental CapEx for the Globetrotter I and Houston Colbert. So that's not for any sort of equipment upgrade like MPD or, I mean, obviously not second BOP, but just I'm kind of wondering if you can kind of identify specific upgrades for those two projects. On the GT1, I mean, candidly if you go back six, nine months ago, the visibility around that rig working beyond its contract was low, right. So I think with the improved outlook, obviously the contracts that we've received, I think we're obviously now putting in the capital required for the upcoming contracts. Chantal, we appreciate your time coordinating today's call."
}