{
    "symbol": "AVD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 23:34:04",
    "content": " Note here on slide 8 that sales ended at $149 million, which is up 29% as compared to the first quarter of 2021 powered by a 61% increase in our US Crop business. In summary, when looking at slide 11 for the first quarter of 2022, our net sales improved by about $33 million, or 29% as compared to the same period of 2021. As you can see on slide 12, in the first quarter of 2022 before working capital, we generated $19 million from our operating activities as compared to $10.5 million in the same period of the prior year, an increase of 81%. Moving on slide 14, debt at the end of the first quarter of 2022, has reduced by about 31% since this time last year, we have a business with a strong annual cycle, which tends to increase debt in the first two quarters and brings that down at the end of the year. As a result of reporting debt down 31% and a 36% improvement in our rolling four quarter adjusted EBITDA, availability under the company's credit facility has significantly improved from $51 million, this time last year to $166 million at March 31, 2022. Sales and gross margin are up, operating expenses, which include outbound freight have increased at a lower rate than sales, and as a result improved to 31% of sales as compared to 36% this time last year, average debt has reduced and as a result, interest expense has dropped by 58%. So we're up 143% in the first quarter versus last year, our full year budget is $52 million, which is a 30% increase over ‘21. And looking at the green initiatives, we have that 52, which is about 30% increase, we're forecasting about a 35% increase for next year, and then 40% in ‘24 and ‘25 to meet the target that we've got. The follow up I had on it was on the SIMPAS was probably because over the years, I've heard this talked about sort of a lot of meetings and I know, it's an exciting opportunity, but in terms of the commercialization that you referenced, now, the up to 80 systems, my impression was that we're still in sort of proof of concept and that what you're seeding the farmers with today, we're still trying to validate that it's going to deliver the yield benefit, and that once that's proven with a bigger data set, then a broader commercialization strategy then ensues. So I don't know if that answers your question, but I don't know if you have a follow up from there but –\n Yes, sure, I'll follow up just, I appreciate some of the historic context but again getting at the crux of the acquisition that added to the sales level there, I mean, look, you can pick a spot and time and you can kind of use the data to make your argument, I guess I'm on both sides of this, but one could say that you can look at a company's EBITDA at one point in time and then subsequently after those five or six acquisitions that might have added, like $25 million to $30 million in EBITDA that the company's EBITDA finishing 2021 is comparable to where it was before this acquisition."
}