{
    "symbol": "AVD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-06 10:40:02",
    "content": " It's now my pleasure to turn the call over to your host, Chairman and CEO, Eric Wintemute. Furthermore, we expect to achieve significant growth and profitability in 2023 over 2022, and we will be giving you specific performance targets for the '23 year in about six weeks on our March earnings call. In the fourth quarter, we were forced to delay roughly $15 million of high margin sales due to a supply chain disruption. Now that we have fixed this supply disruption, we expect to largely recoup the sales that we lost in Q4, such that they will shift forward and benefit 2023 performance. With a strong balance sheet and favorable market conditions, we believe we are poised to enjoy strong growth in all metrics for this coming year. So on Slide 3, the global supply chain has been an unsettled state for the past three years due to the pandemic and shifting buying practices. At one time or another, we have witnessed shortages in containers, ships, warehouses and trucks used to transport many goods across multiple sectors. In spite of these conditions, our supply chain team had succeeded in sourcing virtually all raws, intermediates and packaging without interruption over the past three years of the pandemic. However, in the fall of '22, our domestic supplier of a key intermediate that is used to produce Aztec our leading corn soil insecticide was unable to start production due to capacity constraints. While technically capable of filling our requirements, the Chinese supplier was caught in continual lockdowns from China's Zero-COVID policy, which once lifted resulted in nearly everyone in the facility contracting COVID. In short, we have prepared the supply chain and are looking forward to returning to business as usual. As it became clear that our inventory of Aztec was going to be impacted by supply disruption, we began working with our customers to meet the grower needs through increased supply of these other CSIs, especially Counter, Force and SmartChoice. While unable to make up for the sales of Aztec that we anticipated in Q4, consolidated net sales for the period were equal to those of Q4 '21. Further, we have now orders in hand at Aztec in the amount that is 3x to 4x higher than what we typically have during the first quarter. In short, subject to achieving full production, we expect the net sales and gross profits that we anticipated from Aztec in Q4 to shift forward into Q1s and Q2 of '23 as we supply growers in time for the upcoming planting season. Before looking forward, let's take a quick step back to recap last year. The overarching point here is that despite the temporaries unavailability of our leading high margin corn and soil insecticide during the fourth period, we generated sound financial results on a full year basis. Going from top of the P&L to the bottom, our revenue is forecast to grow at about 10% which is within our targeted range. Interest expense will be about 5% above the target for 2021, which given all of the rate hikes that occurred over the course of this last year is excellent. When we look at how '22 stacks up against '21, we expect that our financial performance will exceed the prior year in all material respects. Before turning to the '23 outlook, let me note that over the past several quarters, we have placed an emphasis on maintaining a strong balance sheet. As you can see on Slide 6, we ended 2022 cash with cash available in the amount of $198 million. In other words, we started the year virtually debt free with ample cash and cash equivalents to meet working capital needs while funding R&D further commercializing technologies like SIMPAS and Ultimus and completing accretive acquisitions. In addition, we achieved this very low debt position after having spent $34 million on repurchasing of 1,668,892 of our shares through two share repurchase programs, a $20 million accelerated share repurchase, which we have completed and a $20 million 10b5-1 plan, which still has $6 million of capital available for future purchases. First, our Q4 miss was due to a supply chain issue that is now resolved. As mentioned, our current Aztec orders are 3x to 4x times higher than they would be normally at this time of year. As you'll note on Slide 8, the outlook for '23 presents ideal conditions for the company's strong financial performance. As mentioned, we anticipate higher sales of our corn soil insecticides during the first half. Second, we expect to benefit from lower cost of goods and an improved supply chain for raws and intermediates. In addition, our new formulations, expanded portfolio of green product solutions and improved market access, for example, into Australia and Brazil, should enable us to participate more fully in a strong global Ag economy. In summary, we expect to achieve significant growth and profitability in 2023 and we'll be giving you more specific performance targets in our March earnings call. It's going to entirely -- I'm not sure if that's your words, but those are my words, it's going to push into the first half of '23. As far as increased cost, the only increased costs, we have are air freighting, this -- we're going to be air freighting all of the material that's being made in China and the material, obviously, domestic is -- it's up in Wisconsin, so that won't be air freight. And then you did touch upon this, I think, in your comments, but it sounds maybe just a little bit more commentary on supply chain overall. Well, one of the key areas since we do a lot of phosphate business is that the phosphorus supply chain was really, really bad in '21 and not only increases but  shutdown, China was not supplying for P4 anymore. But yes, that's probably for us specifically, that was maybe our biggest challenge, which phosphorus has come back down, everybody is back online and so availability of our raws is much easier than what we had dealt with last year. So -- and we're seeing, again, with some being -- some raws having a strong tie like methanol. So overall, yes, we're going into this year, we're feeling a lot more comfortable with our raw material chain. Obviously, raw material price, it -- looking at Slide 8, raw material pricing down, low inventory in the channel, transportation costs coming down. And obviously, you also had the Aztec pushing into this year, which will be a benefit, but sort of one time. But any headwinds, I mean you're -- in spite of the Aztec miss, you're sort of painting a pretty good picture for '23, even though you haven't put official guidance out there, but I'm just curious if anything that concerns you for '23. Right now, I think -- I mean, there's always the possibility of having shortages of different pieces. We're -- with our SIMPAS equipment, we're installing equipment now. Different parts are -- when you have something that has a lot of different components, there's always concern that you don't get everything on time. But we -- I mean, the farm economy is really strong. The -- given that raw material costs are easing supply chain generally, notwithstanding this Aztec issue, easing lower transportation. We're seeing some downward pricing on some of the commodities such as glyphosate, glufosinate, some of the more generic insecticides, fungicides. With regard to our products, we're not seeing a position where we're going to need to re-adjust our pricing downward. We're -- in most of our products, certainly, we're in a better position because we're kind of the only supplier of that particular chemistry. And some of our distribution business, let's say, in Central America and maybe in Australia, there may be maybe pressure on some of the products that they sell that are commodity. But again, we're seeing lower costs coming through. But overall, yes, I think growers are a shift that has occurred for the '23 season versus the '22 season. As growers are going into the '22 season, we're just concerned about getting supply at any cost. And so the push was get everything in Q4, make sure it's in the barn. For this year, I think people are seeing that prices softening are looking at -- we're looking at Q4 as, okay, we don't have to have it right now, we can do more just in time and hope that prices come down before we actually purchase and plant. And twice, you mentioned that Aztec orders are at this juncture in the first quarter, 3x to 4x \"normal seasonal level.\" Have you -- and a follow-up on that, maybe looking at the USDA forecast for higher corn, how much of that is in kind of the addressable market for these soil corn insecticides, which is really just the heart of the corn belt. I mean, going into the year, we did see growers stepping up for what they anticipated. One, be a strong commodity price, two, corn rootworm pressure seems to be increasing year-over-year. And we -- our team went out to everybody as we had this Aztec issue and said, okay, here's the amount of Aztec. But for now, let's place kind of supply chain. This is what H1 kind of allocated out would get for Aztec and then some additional orders for Counter, Force and SmartChoice that would make sure that they're going to be able to meet customer demand. So we'll -- as we go through the next 1.5 months, we'll get a much better picture of what percent of the original Aztec will be met with Aztec and if we do all of it, great, but we produce more of the other corn soil insecticides to make sure that every grower out there gets corn soil insecticide in order to treat this field. Eric, what are the chances or the risk that because of this issue, you will have lost some opportunity or acres with an alternative to soil corn insecticides. I mean Syngenta has force and bag, but going through the SmartBox system and SIMPAS, obviously, that is our business. So fourth quarter, there was the other half of the Aztec molecule that we were not able to make. But there's another section that does get made, and we've -- we continue to make that at the Axis facility in Q4. So though the second half of the molecule that then gets combined with the first piece, we didn't make which is true. So overall, we're not seeing any major impact. We're looking forward to this '23 year and we'll be giving kind of the normal guidance that we do for the year at the next call, which I think we're currently scheduled for March 13."
}