{
    "symbol": "INO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 19:58:02",
    "content": " In our press release today, we announced the top line results from our REVEAL 2 trial of VGX-3100 Later in the call, our Chief Medical Officer, Dr. Mike Sumner, will provide a detailed summary of our clinical programs, but I'd like to take this opportunity to highlight some key points about the REVEAL 2 trial as well as our work on INO-3107 as a potential treatment for recurrent respiratory papillomatosis, or RRP, both of which are HPV-related diseases. Furthermore, the REVEAL 2 or participants data and the combined data across REVEAL 1 and REVEAL 2 trials, build upon the considerable data package that we've now obtained over multiple clinical trials that indicate DNA medicines are potentially able to clear the HPV virus and regress HPV-related lesions. While disappointed that we did not meet the primary endpoint for REVEAL 2 in the biomarker population, I am encouraged by the data as it further indicates that DNA medicines may be particularly well suited to treat HPV-related diseases. Our net loss for the quarter and year ended December 31, 2022, was $54.5 million or $0.22 per share basic and dilutive, and $279.8 million or $1.17 per share basic and dilutive, respectively, compared to a net loss of $106.9 million or $0.50 per share basic and dilutive, and $303.7 million or $1.45 per share basic and dilutive for the quarter and year ended December 31, 2021. Research and development expenses for the quarter and year-end December 31, 2022, were $42.1 million and $187.7 million compared to $92.3 million and $249.2 million, respectively, for the same period in 2021. General and administrative expenses were $14 million and $90.2 million for the quarter and year ended December 31, 2022 versus $14 million and $53.8 million, respectively, for the same periods in 2021. So I think the really encouraging thing that we've seen from REVEAL 1 and REVEAL 2 and from the earlier Phase II trial for VGX-3100 and that we've also seen across the anal indication for VGX-3100 and now with RRP, is our ability really to be able to see viral clearance and lesion regression."
}