{
    "symbol": "INO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 20:30:02",
    "content": " Joining me today on today's call are Dr. Jacqui Shea, President and CEO; Mr. Peter Kies, Chief Financial Officer; Dr. Michael Sumner, Chief Medical Officer; Dr. Laurent Humeau, Chief Scientific Officer; Dr. David Liebowitz, Senior Vice President of Clinical Development for Infectious Diseases; and Dr. Jeffrey Skolnik, Senior Vice President of Clinical Development for Immuno-Oncology and HPV Therapeutics. Today's call will review our corporate and financial information for the quarter ended June 30, 2022, and as well as provide an update on our efforts to develop our DNA medicines platform. Funded by a $37.6 million grant from DARPA and JPE, the Phase I open-label single-center 24-patient dose escalation study is evaluating the safety, tolerability and pharmacokinetic profile of anti-SARS CoV-2 specific dMAbs based on AstraZeneca's COVID-19-specific monoclonal antibodies. During the quarter, Inovio announced additional results from our novel Phase I/II trial of INO-5401 and INO-9012 in combination with Regeneron's PD-1 inhibitor, Libtayo, in 52 patients with newly diagnosed glioblastoma or GBM. Our net loss for the 3 months ended June 30, 2022, was $108.5 million or $0.46 per share basic and dilutive compared to a net loss of $82.1 million or $0.39 per share basic and dilutive for the quarter ended June 30, 2021. Inovio's research and development expenses for the 3 months ended June 30, 2022, were $56.5 million compared to $70.8 million for the same period in 2021. The increase in G&A expenses was primarily related to a $26 million increase in legal expenses, which includes a $14 million noncash expense related to anticipated issuance of our common stock as part of the proposed settlement of our previously disclosed security class action litigation and other related litigation costs as well as a $6.9 million onetime severance expense related to the separation of our former Chief Executive Officer in the quarter."
}