{
    "symbol": "ABEV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 18:53:03",
    "content": " And the good news is that we managed to deliver, once again, led by net revenue per hectoliter growth, continuing to pick up as the year progresses, and volumes growing despite a very difficult comp in Brazil beer showing strong execution and resilient elasticities. And the second question I need to give just really quick context about the second question regarding the performance of your brands in the beer portfolio in Brazil, you are seeing high single digit in premium and also mid-single digit in core. So we unlocked a lot of growth during this time and we get to all time high volumes last year in beer that we are so proud that we were able to really get that flat this year, because it really like confirmed all this volumes and transformation during the pandemic, and then more occasions that we created for beer that they maintained the residual when the bars came back. So when we started the year and we mentioned that we wanted to accelerate EBITDA organic growth that we were more prepared with the momentum that we have in net revenue per hectoliter, through this year, because you were structurally better, the portfolio was trading up, the high end is working and the channels adjustment that we needed to do, it was behind us. So I mentioned at that, the big question of the year would really be like the volumes, because I was confident on the last revenue per hectoliter with based on all the adjustments that we have done on the channels and my portfolio was much better. So my question is really what do you think it is the long-term potential of the category considering everything that you are doing to foster growth and innovation and where you see per capita consumption in Brazil now, and where you think it can get, or as high as it can get looking a few years down the road. And we remain on-track in terms of our main ambition for the year is really to get Brazil back to bottom-line growth, to have the consolidated organic EBITDA growth ahead of the organic growth that we had in 2021 and having an H2 better than H1, and to improve our ROIC."
}