{
    "symbol": "MINM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 11:23:16",
    "content": " Welcome to Minim's Q2, 2022 Earnings Call. With me on the call are Jeremy Hitchcock, Chairperson of the Board; Mehul Patel, Incoming Chief Executive Officer; and Dustin Tacker, Incoming Chief Financial Officer. As a reminder, all materials for today's live presentation are available on the company's Investor Relations website at ir.minim.com. Before we begin, I want to remind everyone that today's conference call may contain forward-looking statements. Forward-looking statements include statements regarding the future, including expected revenue, operating margins, expenses, and future business outlook. For a discussion of such risks and uncertainties which could cause actual results to differ from those expressed or implied in the forward-looking statements, please see Risk Factors detailed in the company's Annual Report on Form 10-K contained in subsequent filed reports on Form 10-Q, as well as in other reports that the company files from time-to-time with the Securities and Exchange Commission. Please note too, that today's call may include the use of non-GAAP numbers that management utilizes to analyze the company's performance. Now I would like to turn the call over to Jeremy Hitchcock, Chairperson of the Board of Minim. Before Mehul and Dustin cover the results for the quarter, I would like to address the announcement we shared earlier this week about changes to our senior leadership team. Mehul has extensive experience in the technology and finance sectors that includes supply chain management, contract manufacturing, financial operations demonstrating operating leverage, and top line growth. We also announced that Dustin Tacker, who has served as our Vice President of Accounting and Corporate Controller will step into the role of Chief Financial Officer. Looking ahead, top tier execution, careful management of the cost, greater supply chain reliability, prudent allocation of the capital, and robust digital capabilities will all be important to our success. Our second quarter financial results reflect the near term challenges that consumer brands are facing in the current environment, as well as challenging year-over-year comparisons specific to Minim as Amazon Prime Day shifted from Q2 event last year to Q3 event this year. Minim's GAAP revenue was $12.9 million in Q2, 2022, which is 3% decrease compared to Q1 2022. We do see cool down of consumer spending on home networking equipment since the peak of pandemic, but we're well ahead of our pre-pandemic sales. Importantly though, consumers continue to shift on to online purchasing and our e-commerce platform aligned directly with this trend and continued to perform well. Our Prime Day gross sales were 53% above last year, and we are encouraged by the announcement from Amazon of the second Prime Day in October this year. Our Prime Day performance compares favorable to the increase in overall Prime Day sales, which rose only around 7% on a year-over-year basis according to statista.com . While we have seen signs of tightening at retail stores, including reductions in inventory levels, we nonetheless continued to expand our retail footprint. In Q2 we won additional sales space at Target, and we're expecting to start sales at additional retailers during Q3. Additionally, in Q2 deferred revenue grew to $1.1 million. With both products on the market we're excited to turn our R&D efforts to efforts to evolve our other parts of the portfolio as we work to ensure we remain competitive from specifications, perspective and resilience from supply chain perspective. Regarding our cash and inventory positions, we executed our plan to reduce inventory levels by only purchasing a small selection of product in Q3 and focusing on our program to recover returned items rather than purchasing new ones. Also worth the note on the issue is that $2.5 million of new inventory carried out from Q2 to Q3 was held in preparation for Prime Day, and was instrumental in allowing for our outstanding Prime Day performance. With higher sales expected in the second half of the year due to Prime Day and Black Friday, AR collection and maintaining our current debt levels, we expect our cash and inventory position to improve in the second half of the year. I would like to first share an update on the restatement pertaining to the year-end December 31, 2021 and the period ended March 31, 2022, that we had notified the SEC through our Form 8-K filing on August 4. The restatement was caused mostly by a favorable $1.9 million inventory costing errors related to returns, which was offset by an inventory reserve error of $0.5 million or net $1.4 million adjustment. The restatement has reduced the net loss reported in the annual report on the Form 10-K for the year ended December 31, 2021 from the originally reported $3.6 million net loss to the amended net loss of $2.2 million. The company determined that the same source of errors did not impact the statement of operations for the period ended March 31, 2022. Our net revenue for the quarter totaled $12.9 million, which is down 3% over the prior quarter and deferred revenue increased to $1.1 million. For the quarter our gross margins were 19.7%, down from 31.5% in the prior quarter. For the quarter, our adjusted EBITDA was negative $3.4 million or negative $2.2 million before restatement as compared to adjusted EBITDA of negative $1.7 million in the prior quarter. Now for a look at the balance sheet, at the end of the quarter, we had cash and cash equivalents of $4.7 million, a decrease of $5.8 million compared to the prior quarter. Inventories also increased to $34.3 million at the close of the quarter, compared to an adjusted $31.3 million at the end of March 31, 2022. We ended the quarter with outstanding debt of $5.6 million, which was a draw down on the company's $25 million line of credit. This compares with $7.1 million in outstanding debt as of March 31, 2022. Finally, I would like to close with a brief discussion on our stock value. As indicated in our April 27, 2022 Form 8-K filing, on April 25, 2022 Minim received a notification from NASDAQ that the company no longer meets the minimum bid price requirement of $1. If the company does not regain compliance by October 24, 2022, the company may be eligible for an additional 180-day compliance period. On this front, the company intends to continue to monitor our side price, build sustainable growth and incorporate value through execution of its operating plans and engage advisors to consider available options. So right now, based on all the -- we just filed the 8-K as you saw last week. We're expecting to release our filings tomorrow given time by tomorrow afternoon is the current timeline, so we should have our 10-K/A, 10-K/U, and also Q2 all released tomorrow sequentially in the afternoon. So back to 30% margins, I guess, like anything you could tell us about how 3Q is looking from like a revenue perspective, given it right. So from a Q3 standpoint, we're expecting Josh, based on the modeling that we've seen from you and others to be something close to that, but at the same time, we are still -- we're getting the news around our retailers and also from the softness of the demand based on what we're seeing. So we're cautious based on what we are trying to or what comes out over the last -- yesterday, just yesterday, I think Target announced inventory levels and trying to maintain their inventory. So right now, we were already well and because of the time it takes to get on the water and time until we get it, that was the result of us however, we did have a clampdown, as I mentioned in my statement earlier, and we did clamp down to inventory purchases at this point, very minimal coming in. In terms of cash flow forecast and improvements, my expectation for inventory is going to be to improve the turns by end of the year to three turns. With revenue being down quarter-over-quarter in 2Q particularly on the sales and marketing expense, as well as the G&A line. So we're looking into streamlining some of the costs, but not expecting any reduction in force anytime soon, but we are looking at every aspect of vendor consolidations and things like that that we can control quickly and we're going to try to put that in place as soon as possible in the third quarter. But my expectation is to see that run rate even with inflation adjustments and things that we had done for employees, to continue to be flat to prior quarter because of those cost control and adjustment for inflation that we had to do. I guess I will add one more just since if OpEx is going to be flat right, and gross margin levels would kind of imply a breakeven, right, if you have $7 million of OpEx, 30% margin, you'd probably need to do probably like $21 million or so on the top line and the company is pretty far from doing that. So, right now we are way too heavy on inventory, as I've said many times. And if I can get even a little bit better than that, and we're working on terms with our partners, our ODM partners, and we're pretty much going to execute a lot of those terms in terms of helping us improve those terms right now. We're close to, I don't know, 70 to 80 days at this point versus early, before COVID was in the low thirties or mid-thirties, low forties. So I've been an investor for three or four years now and so I see like, I see a couple things. I look at the net revenues, even though I've seen a number of announcements. I know there's expenses, and you're going to be trying to manage those. But I think on the revenue side, it's like a number of announcements have been made about new places you're doing business; India, other countries and things. So right now, based on some of the trials we're in, in the ISP space in India, Indonesia, and Africa we continue to be in those trials. As soon as we get to the next level, that's when we start to see the traction that you're looking for and same thing with us, and it doesn't necessarily have to be a hardware solution only or software-hardware solution mix. It is going to be software solution as well, which has always been the strategy to allow us to do any one of those combinations, but it takes time with some of those tractions to come to fruition, but we are in the mid-state of a lot of those. So question, as it relates to COVID a little bit, I've worked for a company that's asking us to come back to the office and spend time together and stuff. It's like, I know COVID was a little bit of a problem. For most part we're behind it, but at the same time, there is things in terms of, for example, we are in terms of our finished goods shipments, we have plenty of inventory as the prior call, prior discussion we just had to be able to make us successful in any place that we want to ship. In terms of NPI and the new product launches, that's where a lot of the delays come because of the supply availability on the new technology and how do we get that. We've done that for, you know, we we've been around 52 weeks lead time on a lot of those components. So I think we're well positioned in that way, maybe compared to some of the other competitors, but the future of the next gen product is where we continue to execute, we'll see some of those delays, but we'll continue to work with our partners and pull those forward as much as possible. And then I have two more questions, but the first one is, if you go to page 17 in the slide presentation, the cash position quickly dwindles down. And the question, it sounds like though, you have plenty of inventory, so you don't need to spend money on that. And my basis isn't incredibly high, but it's not, it's also not $0.38 cents. And I expect the stock today to go to 30 or something like that based on the results here, because they're not that great. But -- so the question is, I worry that you'll run out of cash and someone will do, so there's two questions here. You'll take the six-month extension of the -- we're below a dollar, so don't kick us off the NASDAQ. That's -- that's kind of one question, but the same question is, is I would be terrified if the company did a reverse split on the stock and crush the shareholders' investments. Since I've gotten here, we've put in pressures, we've put in place in terms of fixing our internal controls to allow us to do that. So we're looking to turn that into, like I said, three turns to help us at least turn that back into what I expected to be cash flow neutral or positive. In terms of cash -- or stock price, yes we're going to extend our NASDAQ to 180 days because that allows us to give some more time to look at some of the options that are in front of us. I won't get into the detail of all the options, but the Board and myself are reviewing those options and we'll continue to do so. And, our goal is to make sure we put the shareholders like yourself and others and make sure we look at it from every angle before we make any adjustments."
}