{
    "symbol": "FUTU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-30 10:57:04",
    "content": " Thanks, operator and thank you for joining us today to discuss our second quarter 2022 earnings results. As of quarter end, we had approximately 1.4 million paying clients, up 39% year-over-year. Net addition was over 60,000, bringing our first half paying clients growth to 143,000. In the second quarter, client acquisition was resilient in Hong Kong, where we launched targeted marketing campaigns around the green bond issuance in May and attracted allocation-driven clients to subscribe to the green bond on our platform. In Hong Kong, we will continue to focus on clients over 30 years old as our current penetration rate among 30 plus Hong Kong residents is at a near 7.5%. To achieve that, we have rolled out new marketing initiatives and launched new features, including the light trading mode, which offers a more simplified and sleek trading interface and the regular savings plan for Hong Kong stocks, which caters to clients less interested in market timing. In Singapore, we have realized that the local users are more conservative during market downturn and thus launched a series of investor education activity to help users understand how to better navigate market turmoil and continue to diversify our product offerings and wealth management. Total trading volume was HKD1.3 trillion, up 2% quarter-over-quarter. U.S. stock trading volume was HKD897 billion, constituting 67% of the total volume and up 6% quarter-over-quarter. Hong Kong stock trading volume was HKD424 billion, down 5% sequentially due to muted market sentiment around China tech names in Hong Kong. In the meantime, our market share in Hong Kong futures and options trading climbed to 6.7% and 13.5% respectively. We launched multi-leg options function for Hong Kong stocks by the end of June, which enables our clients to formulate advanced options trading strategies to better manage risk and achieve investment targets. Total client assets in Wealth Management were HKD22 billion, up 59% year-over-year and 5% quarter-over-quarter. As of quarter end, over 200,000 clients, 15% of our total paying client base held wealth management products. And to help our clients navigate a right inflation environment, we also launched a model portfolio of global real return strategy in collaboration with Aberdeen. In Singapore, Wealth Management asset balance increased 377% quarter-over-quarter as we further expanded mutual fund offerings and launched new product features. As of quarter end, we have 276 IPO and IR clients as well as 519 ESOP clients, up 48% and 97% year-over-year. In the first two quarters, we acted as the underwriter for 12 Hong Kong IPOs, tie for first place in terms of the number of Hong Kong IPOs underwritten. In the first half of this year, we continued our relentless pursuit of product experience by releasing 99 versions of our mobile app and desktop clients and adding 3,989 new features, up 21% and 52% year-over-year. Our total revenue was HKD1.7 billion, up 11% from HKD1.6 billion in the second quarter of 2022. Brokerage commission and handling charge income was HKD1 billion, an increase of 30% year-over-year and 7% Q-over-Q. The year-over-year increase was mostly driven by a higher blended commission rate of 7.7 basis points, up from 6.1 basis points in the year ago quarter, underpinned by greater contribution from derivative trading. Interest income was HKD620 million, an increase of 2% year-over-year and 8% Q-over-Q. The slight increase year-over-year was due to higher income from cash deposits and security lending, which was largely offset by lower margin financing income and IPO financing interest income. Other income were HKD93 million, down 45% year-over-year and 6% Q-over-Q. Our total costs were HKD208 million, a decrease of 25% from HKD279 million in the second quarter of 2022. Brokerage commission and handling charge expenses were HKD88 million, down 14% year-over-year and 10% Q-over-Q. Despite the year-over-year increase in brokerage commission and handling charge income, the expenses declined due to the cost savings from our U.S. sales â\u0080\u0093 U.S. securities sales clearing migration and upgrade the service package with our U.S. clearinghouse and the lower IPO subsequent fees. Interest expenses were HKD27 million, down 67% year-over-year and 32% Q-over-Q. Processing and service costs were HKD94 million, up 74% year-over-year and 1% Q-over-Q. As a result, total gross profit was HKD1.5 billion, an increase of 19% from HKD1.3 billion in the second quarter of 2021. Operating expenses were HKD747 million, up 12% year-over-year and down 4% Q-over-Q. To break down, R&D expenses were HKD292 million, up 69% year-over-year and 3% Q-over-Q. The increase was mainly due to an increase in R&D headcount as we continue to support a new product offering, invested in the U.S. sales clearing capabilities and customized product experience in different markets. Selling and marketing expenses was HKD219 million, a decrease of 42% year-over-year and 24% Q-o-Q. The year-over-year decrease was due to lower overall marketing and branding spending, especially in international markets. G&A expenses were HKD211 million, up 118% year-over-year and 19% Q-o-Q. As a result, our net income increased by 20% year-over-year and 12% Q-over-Q to HKD639 million. Net interest margin expanded to 37% in the second quarter as compared to 34% in the same quarter last year, partially attributed to lower tax rate of 10%. Please ask your question. I will leave the first question in terms of the new paying clients breakdown to my colleague, Robin. And so far, we have already migrated over 80% dollar value of our U.S. security positions from our business partners to our own clearing costs. Afterwards, we do think â\u0080\u0093 youâ\u0080\u0099re right, the self-clearing capability in the Singapore market definitely is on our schedules, but we will be following subsequent to the completion of our U.S. self-clearing migrations. Please ask your question. And you can see our blended cap number is around HKD3,500 in the second quarter, which is slightly higher than our previous guidance of HKD2,500 to HKD3,000. But given the current â\u0080\u0093 the balance sheet situation, actually, we try to â\u0080\u0093 we have exchanged certain of the positions from our Hong Kong dollar position to the RMB position of sales. We will take our next question. Please ask your question. So, my question is regarding the financial impact of U.S. sales clearing, as well as the U.S. rate hike impact to your financials. For the sales clearing, as I mentioned before, we have already migrated over 80% of our U.S. stock positions to our own clearinghouse. According to the current run rate, we do expect in the second half of this year, the self-clearing capability can enhance HKD200 to HKD250 incremental revenues to our own P&L. Secondly, regarding the interest rate plan, definitely, we do think we are a beneficiary from the rate cycle, given that we will get more interest income from clientâ\u0080\u0099s idle cash. Just do some very simple calculations as the rate hike do for the consensus expectation nowadays, say, toward the end of this year, the rate will be increased to, say, 3 basis points or 3.25 basis points. In the second half of this year, we can generate additional HKD200 million to HKD250 million interest income because of that. We will take our next question. Please ask your question. I appreciate your very strong new customer acquisition in the second quarter, which reached 61,000. And given you had also a very strong customer acquisition in the first quarter, now your first half new customer acquisition has reached well over 50% of your full year guidance of 200,000. I will let my â\u0080\u0093 our CEO, Leaf, to answer your first question, and I will take your second question afterwards. And we believe the current market is not that attractive to new clients and we think we will continue to focus more on the quality of our new clients, the net asset inflow of our existing clients and the unit economics of the various regions, especially in such a sluggish market. So, we now plan to keep our previous guidance of adding 200,000 net new paying clients, and we may revisit the guidance later on this year. For the second question, I think we are still in the early stage of Futuâ\u0080\u0099s long-term growth strategy. Instead, to give a fixed number, I think what we focus will be our long-term growth potential, especially in the new markets and also further deployment of our resources on the key technology operations going forward. We will take our next question. Please ask your question. As I mentioned in the opening remarks, you are right, you do see, on a blended basis, our commission rate continued to hike year-on-year basis and also Q-on-Q basis. Largely, I think itâ\u0080\u0099s more contributions from the derivative trading, which now roughly accounts for 30% of our total trading commission revenues. You can understand that in the second quarter, U.S. markets ramped up significantly. So, a decrease in the average share of the stock of client trade can actually result on higher blended commission rate. For the second question, the contribution from the IPO business, actually in history just accounts for high-single digit or low-teen numbers of our total revenues."
}