{
    "symbol": "GOL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 17:42:08",
    "content": " We served more than 200 markets and ported approximately 8 million passengers, 90% of GOLâ\u0080\u0099s fourth quarter last year. By acting assertively and managing capacity, controlling costs and improving productivity, we maintained growth of our revenues in our operating results during this period recording the highest quarterly revenue figures in the GOLâ\u0080\u0099s history, 62% and 24% above fourth quarter 2021 and fourth quarter 2019 figures respectively. We will continue to be impacted by high oil prices the range increase of around 7% compared to the fourth quarter of â\u0080\u009821, which along with higher costs associated with the oil supply chain and logistics, and refining have represented an increase of approximately 44% in the average jet fuel price denominated in Reais paid by GOL here in Brazil in the same period i.e., 44% increase in GOLâ\u0080\u0099s average jet fuel price. In the fourth quarter of â\u0080\u009922, we concluded the issuance of senior secured amortizing notes in the amount of $200 million, which allowed the extension of financial obligations with lessors mainly due to leasing deferrals and improved GOLâ\u0080\u0099s expected cash flow for 2023. These secured amortizing notes have a collateral of unencumbered receivables and represented an average cost capital to GOL of 4.3% per year, and also added a new innovative initiative to the company's liability management toolbox and this was done even in the midst of a capital market environment, which was not conducive to new issuances. In the first quarter of â\u0080\u009823 GOL completed one of the largest liability management and refinancing operations in the history of the company and the airline industry through the issuance of $1.4 billion of senior secure notes due 2028 in a private placement to Abra Group Limited, GOLâ\u0080\u0099s controlling shareholder. So, we this is the best picture we have from now and what we expect for the corporate, it's not related to the - this capacity itself because the capacity for corporate, the main routes in the corporate market, we have just returned in the fourth quarter, especially from, Congonhas and Santos Dumont we rebuilt the strong network we have with the main frequencies between the - all the most important shuttles. Yes, I know a lot of people will potentially use IIG As an example, we have a lot of differences in how we're doing it, here in the South America market and what we've created effectively is a platform company that has its own reason for being - there's going to be doing a lot of work to, generate a variety of different types of synergies from the members of the platform in terms of its focus on even being an even lower cost, higher efficiency group, which is obviously the main tenant. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question."
}