{
    "symbol": "SNV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 12:19:02",
    "content": " The combination of disciplined deposit pricing, continued strong loan growth and interest rate increases in the third quarter served to support significant growth in net interest income, which came in at $478 million, an increase of 24% year-over-year or 12% quarter-over-quarter. Thank you, good morning. And Steven, Iâ\u0080\u0099ll just add, interesting enough, when you look at non-interest bearing deposits relative to core deposits, they actually increased this quarter from 35% to 36%, and so as weâ\u0080\u0099ve seen money market attrition, weâ\u0080\u0099ve actually had DDA hold on better than some of the rate-seeking clients that have moved to other instruments. To Jamieâ\u0080\u0099s point, I think the great opportunity that we have in front of us is what weâ\u0080\u0099ve been doing for the last three years in terms of investing in treasury and payment solutions, so when you ask yourself why would someone keep their money in a non-interest bearing account, theyâ\u0080\u0099re doing that because theyâ\u0080\u0099re receiving services from our treasury and payment solutions team and theyâ\u0080\u0099re offsetting that with their earnings credit rate, but as we continue to grow our commercial business, our ability to win business, as Jamie suggested, in that commercial space is very high and will actually continue to accelerate, and so as we continue to improve our products and solutions, we have the opportunity to have outsized growth in new production of DDA, which could help to mitigate any diminishment that we would see going forward. So when I think about NII, we think that the fourth quarter should be relatively stable to the third quarter, but looking out beyond that when we look at 2023, and weâ\u0080\u0099ll give full year guidance in January, but when we look at the longer term, we do believe that the benefit of fixed rate asset re-pricing will fairly offset the negative impact of deposit lags, and we may see NII in 2023 approximate loan growth year-over-year. Thank you, good morning. As we look out into the fourth quarter, we are seeing some slowing in activity from our clients, pipelines are down 15%, 20% from where they were in the third quarter, so when you think about just a 20%, 15% reduction in production, that would produce somewhere around a $700 million to $1 billion loan growth for the quarter. Just to dovetail a little on Bradâ\u0080\u0099s question there, just curious, Jamie, how we should--I know there was a question earlier about non-interest bearing deposits, but just your outlook for overall deposit levels going forward, do we continue to see a modest decline, and Iâ\u0080\u0099m assuming a more modest decline going forward versus third quarter, and then do you continue to offset that with the borrowings you were just referring to, and more broadly, how you feel about that loan or deposit ratio, which I think now has gone up to 89%, where that stands relative to where you want to be longer term. When you look at--you know, quarter-on-quarter, you have a total deposit beta of 18% and then weâ\u0080\u0099re forecasting that just to continue increasing and, as I just mentioned, getting up to as high as potentially the 50% incremental beta, which leads to a through-the-cycle in the mid-30s, and thatâ\u0080\u0099s generally what we expect to see happen."
}