{
    "symbol": "SNV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 14:17:05",
    "content": " When adjusted for PPP fees, total revenue increased 11% year-over-year, the increase was driven by NII growth, a result of continued strong loan growth as well as margin expansion resulting from higher interest rates. Loans increased $1.2 billion, excluding PPP or 12% on an annualized basis with diversified growth across the wholesale community and consumer business lines, evidencing the strong momentum we have across all of our businesses and client segments. Commercial loans, again, served as the primary driver of growth as second quarter funded production was up 41% year-over-year, with a 1% increase in line utilization supplementing overall growth. Our strong second quarter financial performance with adjusted earnings per share of $1.17, return-on-average assets of 1.27%, return on tangible common equity of 19% and an efficiency ratio of 53.4% serves as validation that the team's continued strong execution and our success in meeting the needs of our clients is leading to profitable growth. The combination of strong loan growth I alluded to previously, coupled with the recent move higher in interest rates served to support significant growth in net interest income in the second quarter, which came in at $425 million, an increase of $44 million or 11% year-over-year. Core banking fees continue to benefit from card fees, which increased 21% year-over-year, a result of account growth as well as higher levels of both consumer and commercial spend activity. As a result of our strong loan growth of 6% through the second quarter, excluding PPP loans, we expect to be at or above the upper end of our previous guidance of 6% to 8% for the full year despite the uncertainty in the economic outlook. As a result of strong loan growth and the current forward rate environment in which Fed funds reaches a target rate of approximately 3% by the end of the year, total revenue growth, excluding PPP revenue, is forecasted to be considerably above the upper end of our communicated range of 9% to 11%. Given the strong positive operating leverage and considering all of the updates to our full year guidance, our expectations for the year-over-year PPNR growth has now increased to the mid-20% range, excluding PPP income. And so that timing lag is highly accretive to NII to the point that when we look at the third quarter NII, we would expect to see NII growth somewhere between 9% to 10% in the third quarter based on the timing lag continuing and the market outlook for rate increases from the Fed here in the third quarter."
}