{
    "symbol": "HLNE",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-02 16:01:04",
    "content": " Your line is now open. Your line is now open. One, as you’ve heard us say and we just noted on the call, there continues to be a surprising, I think, to many people, not surprising to us, but a surprising number of entities that have still not yet entered the asset class, whether that’s because they’re simply newer or whether that’s been for regulatory reasons or whatever the driver of that has been, I think we continue to be – we continue to benefit from, frankly, finding entities that are yet to come into the asset class, and we’re now helping them do that. Your line is now open. I think to us, I would sort of point to this being emblematic of two very positive parts of the business, one, it’s an asset class that is needed and desired by institutions and NTCs of all different shapes and sizes across geographies. But there’s nothing new happening to that, I think what you’re simply seeing is as that specialized fund business continues to grow at a very significant rate, that is helping to sort of pull some of the margin benefit across the firm. Just curious, as you look at the landscape today, what sort of impact do you think this could happen on competition and the marketplace, particularly as other firms are perhaps looking to bring secondaries into the retail channel, and these are more funds focused firms, I don’t think they have SMAs. Your line is now open. And I think when you think – if you think as a fund manager of what you’re looking for in a good partner, you’re looking for someone as a co-investor who can bring resources an approach that is sort of going to mirror your own team, so as to not sort of bog them down or to get in the way. And I think that position of sort of wielding that capital base and having that capital base as it is continuing to grow, just makes us more and more important to the market and more important to those fund managers and they’re looking to sort of further the relationship and to deepen their relationship with us. Your line is now open. I think what you’re sort of seeing is increasingly a model where, it is a what do you own and where a lot of the businesses are fragmented and you sort of see partial ownership across their employee bases. Your line is now open. Similarly, on the equity side or the geographic side, if this is for us of why you spend the time and the resources making your investment team as big as we have it and why you have investment resources across all of the different underlying areas as we do and why you continue to open up offices and make sure you’ve got resources across those geographic regions because you just do not know what is going to become kind of the sector du jour tomorrow versus five years from now."
}