{
    "symbol": "HLNE",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-26 13:36:03",
    "content": " At this time, I would like to welcome everyone to the Hamilton Lane Fiscal Year 2022 Earnings Conference Call. Good morning, and welcome to the Hamilton Lane Q4 fiscal 2022 earnings call. Before we discuss the quarter's results, we want to remind you that we will be making forward-looking statements, based on our current expectations for the business. For a discussion of these risks, please review the risk factors included in Hamilton Lane fiscal 2021 10-K and subsequent reports we filed with the SEC. Beginning with the financial highlights, for fiscal 2022 management and advisory fee revenue grew by 9%, while our fee-related earnings grew by 11% versus the prior year. Lastly, our board has approved a 14% increase to our annual fiscal dividend to $1.60 per share or $0.40 per share per quarter. This now marks the fifth consecutive annual dividend increase since going public in 2017, each over 10% and with an average increase of over 18%. On April 5th, Hamilton Lane joined Ownership Works, a nonprofit organization that works with companies and investors to provide all employees with the opportunity to bill well through equity. Echoing our own belief and the importance of equity culture, the organization was created to support public and private companies transitioning to shared ownership models. By 2030, Ownership Works anticipates the shared ownership movement will create hundreds of thousands of new employee owners across the U.S. Hamilton Lane joins a consortium of prominent organizations, including Goldman Sachs, KKR, JPMorgan, the Ford Foundation, and the Rockefeller Foundation supporting Ownership Works and its mission. We've been serving clients in that region for over two decades and the new office now provides a direct base from which to continue supporting and servicing our clients and build on our momentum in the region, particularly within the private wealth space. Lastly, before I move on to some results for the quarter, I want to take this opportunity to highlight the release of our 2022 market overview. Some of you may be familiar with our market overview, but for those who are not, it's an annual data driven review and analysis of the private markets powered by our own private markets database and in-house research capabilities. In it, we conduct an in-depth review of the key drivers of the asset class over the last year and provide our perspective on what may unfold in the markets going forward. This year, in addition to a narrative version of the market overview, we presented the report in a highly produced virtual format, which allowed us to reach our largest audience yet. For those who are interested in this year's market overview, please visit our website for more information. Let me now turn to the results for the fiscal year, which were strong across the entirety of the business. Our total asset footprint at fiscal year-end, which we define as the sum of our AUM, assets under management and AUA, assets under advisement stood at approximately $901 billion and represents a 25% increase to our footprint year-over-year continuing our long-term growth trend. AUM growth year-over-year, which was 19 billion or 21% came from both our specialized funds and customized separate accounts. As for our AUA, similar to that of AUM, growth was from across client type and geographic region and came in at 164 billion or 26%. As we have mentioned on prior earnings calls, AUA can fluctuate quarter-to-quarter from a variety of reasons, but the revenue associated with AUA does not necessarily move in lockstep with those changes. At fiscal year-end, total fee earning AUM stood at $49.1 billion and grew $7.1 billion or 17%, relative to the prior year. Taken separately, $5.3 billion of net fee earning AUM came from our customized separate accounts and over the same time period $1.9 billion came from our specialized funds. And just to clarify, last fiscal year, we've   large amount of retro fees coming primarily from our fifth secondary fund and it resulted in an elevated blended fee rate for fiscal 2021 relative to prior years and fiscal 2022. Given the limited amount of retro fees in fiscal 2022, our fee rates have trended back to more normalized levels of 55 basis points to 56 basis points. As it relates to our existing client base over the last 12 months, more than 80% of the gross inflows into customized separate accounts came from this group. Moving to our specialized funds, growth here continues to be strong. Over the past 12 months, we achieved positive inflows of $1.9 billion, representing growth of 11% relative to the prior year. This growth stemmed from additional closes for funds currently in market, robust investment activity, and continued monthly net inflows into our evergreen platform. As a quick reminder, our evergreen platform provides private wealth channels and individual investors with direct and immediate exposure to the private markets by way of monthly subscriptions with semi-liquidity. For us, it represents perpetual fee earning AUM where we earn management fees on net asset value and the potential for carried interest on a deal by deal basis on every invested dollar. Last quarter, we reported that the platform had surpassed the $2 billion AUM mark and that we were one of only a small number of managers to have a platform of this size. Against an uncertain macro backdrop and a volatile public equity market, net inflows for our evergreen platform remain resilient and average nearly $135 million per month from January to April of 2022. During the quarter, we held the sixth close for the fund, which totaled $306 million of LP commitments. More recently, on May 6, we held a seventh close for the fund that totaled approximately $72 million and will result in retro fees that be recognized in Q1 of fiscal 2023. Stepping back, the combination of these two closes brings the total amount raised for the fund to nearly $1.6 billion and at that level, we have essentially matched the size of the prior fourth fund and we will still be in market through October 2022. Next up is our annual direct credit series, we are currently raising our seventh installment of this series and the last quarter we announced that we held the largest first close in this product's history. The momentum for the current series has continued and during the fiscal quarter, we held a second close that totaled over $107 million of LP commitments. Subsequent to that in the month of April, we held additional closes that totaled over $214 million and now brings the total raise for this current series to $531 million. As a reminder, our credit strategy has a relatively unique structure whereby we are continually raising and deploying dollars simultaneously and earning management fees on invested capital. Therefore, it is less about targeting a set amount of dollars as you would traditionally see across funds with a multi-year deployment period and more about ensuring that we size the product in-line with the current opportunity set, which can lead to some size variability from installment to installment. In February of 2021, we held the final close for our fifth secondaries fund and we raised $3.9 billion. Investment pacing has been and remain strong and as such, we are back in market with our sixth fund. On  , we held the first close for the 6th secondary fund at over $611 million. Lastly, let me introduce our newest strategic technology investment of our balance sheet and provide an update on an existing investment. As a reminder, Tifin operates several fintech platforms focused on meeting the evolving and technological needs of wealth managers, RIAs, and individual investors. Tifin’s platforms utilize the power of artificial intelligence and smart learning technology to provide tools, data and analytics to support the advisor or individual on their unique financial journey. On May 12, Tifin successfully raised a $109 million Series D round that included two new lead investors, Franklin Templeton and Motive Partners. Hamilton Lane participated in the round and based on the valuation, our investment, inclusive of our investment in the Series D has already generated a 1.4x multiple in only six months since our initial investment. Next, I'll move to our newest balance sheet investment into a company called ADDX. ADDX implements blockchain and smart contract technology to automate the issuance, custody and distribution of digital tokens that allows for investment minimums as low as $10,000. And with that, on March 29, we successfully partnered with ADDX to offer tokenized access to our global private assets fund on the ADDX platform. With this offering, Hamilton Lane joins managers such as Partners Group, Temasek and  , who have all partnered with ADDX in providing digital tokenized access to selected funds that they manage. Subsequent to the tokenized offering on May 24, ADDX announced its latest fundraise led by the stock exchange of Thailand. Hamilton Lane participated in this round and we now joined an investing group of leading institutions in the region such as the Singapore Exchange, Temasek and the Development Bank of Japan as investors. For fiscal year 2022, we achieved solid growth in our business with management and advisory fees up nearly 9% versus the prior year. For fiscal 2022, retro fees have been limited given that our latest direct to equity fund was turned on during this fiscal year relative to the prior year where we recognized $18.2 million in retro fees for our fifth secondary fund. As a reminder, investments that come into later closings during the fund raise, a retroactive fees dating back to the fund's first close. Moving on to customer and separate accounts, revenue increased $9.3 million or 10%, compared to the prior year, due to re-ups from our existing clients, the addition of several new accounts and continued investment activity. Revenue from our advisory, reporting, and other offerings increased approximately $10.7 million, compared to the prior year, driven primarily by the near full-year impact of revenue associated with pre-existing funds managed by the 361 Capital team that we acquired in April of 2021. In addition, we saw a $3.8 million increase from our distribution management business stemming from robust activity in the IPO market along with strong public equity market performance throughout much of fiscal 2022. In regard to our expenses, total expenses increased $12.4 million, compared to the prior year. G&A increased $19.6 million, which included a full-year impact of rent expense associated with our new headquarters, along with expenses from 361 Capital and sales commissions. Our largest assets continues to be our investment, alongside our clients and our customized separate accounts and specialized funds. Over the long-term, we view these investments as an important component of our continued growth and we'll continue to invest in our balance sheet capital alongside our clients. Your line is open. I was hoping you might be able to help   for us, how much of the fee paying AUM or asset base is from the U. S. pension fund community? On the pension fund side, it's a relatively small amount. So, it's not a part of our business to which we're heavily levered or that represents a considerable amount there. The question on the denominator effect, it's an interesting one. I mean, clearly whenever the markets go down and the way they have now, you're in a tougher fundraising environment. I mean, it's just natural. I mean, they can't convert everything into cash and say, I'm just going to wait until the markets bottom and then move into it. And at least historically and if you look at the data that tends to be moving into private markets whether it's equity, whether it's debt, infrastructure, take your pick, that has been what we've seen. I'll just relate an anecdote, we're talking to a very large fund, not a client of ours, and they said an interesting thing. They said, we know the mistake we made in 2008, 2009, we step back and we're not going to make that mistake this time. And that's just one example, but I think people have seen these cycles play out in 2000. And so what we're hearing is, people are pretty sanguine about what happens when markets go down and aren't really – we're not hearing much panic around, oh my gosh, I have to get out. So, right now, it just feels like people are looking at what they've seen in prior cycles and taking a pretty careful view about it. I mean, again, I think one of the things that is important and we say it a lot and I know it's easy to say, but it's the reality. So, we're not seeing people go oh, I made this decision a year ago to invest in private markets where I want to look at investing, but I'm going to change that because of what's happening in the public markets today. So, we've not seen any dramatic shift in terms of people either pulling back their SMAs or people pulling back SMAs that they have in process. I think as you've seen, we have been putting up incredibly steady fund flows and I think that's what we're trying to build for. As you know, for our product, we want to make sure that we're really nicely aligning the fund flows coming in with the investment opportunities we can immediately deploy and not have cash drag. So, our strategy has been one of a big ground game across the globe, and I think we're executing on that incredibly well. And to date, as I said, we're sitting here at $2.5 billion without a warehouse relationship. We believe those are coming in the future, but we're not built to simply depend on that or the promise of that coming in the future. We think that this continued growth is exactly what channels, all kinds of channels are looking for. People want the confidence that you can handle an increasing size, scale, and deployment in order for them to eventually put you into their platform, whatever platform may be. Your line is open. Maybe first, commitments to separate accounts were particularly strong this quarter. And I would say in the first quarter of 2000 when COVID was really taking hold, we saw a pretty big slowdown in deployment in commitments in the industry,   sort of stopped and it seemed to have an impact on deployment, and we're again seeing M&A slow, but particularly in the case of your results, there was no apparent flow through from any slowdown in deployment flowing through the numbers. So, help me sort of understand how you would expect the challenging market conditions to impact fee paying AUM if these conditions were to persist. I think on the separate account, it's a little bit of what we've said in the past, which is, it can be a little bit seasonal, it can be a little bit episodic. I think generally we've seen more boards, more decision makers making those capital deployment decisions coming into end of year and thus sort of signing contracts at the beginning of the calendar year. So, I think that accounts for some of it, but I think the diversity of that installed base and the diversity of the new flows and we keep saying, well, 80% from the existing customers yes, but that means 20% even given a massive install base is still coming from brand new places. I think that speaks of the strength of the brand, the distribution relationships. So, I think not a lot to read into a particular quarter. I think the year-over-year trend lines remain very, very strong. And I think it stopped because you had a situation, no one had ever seen before. You had a pandemic, you had economies closing, you had something no one really knew how to assess or how to deal with, and no one knew how to price anything at any level. There's no question because pricing discovery anytime markets move 15%, 20% the way they have. You're going to have a period of pricing discovery, but it doesn't feel to people like 2020. And so, while things will slow down, I think there is a view that we have been through interest rate increases that lead to economic slowdown maybe the inflation rate is higher than it was this period to that period, but this doesn't feel like a new place where no one knows how to price anything. So, it will slow down and we would expect some areas more than others perhaps venture and some of the high flying growth areas will slow down more than others, but activity, we just don't see anything like what we saw in 2020. I think it will be more like, going back much further   in that period where it was slow, but there was continuing activity. And again, the other thing to remember also is, there's a broader range, private equity, private credit, all of these markets cover a much broader range than they have in prior cycles. And so, if there's a slowdown, as I said, venture, for example, is going to be stronger in credit. So, there's just a better balance in terms of how portfolios are designed and in terms of our own reach into the market. And I think for the wealth managers, you can probably the intermediaries can answer the question probably better than we can. And they're all going to be looking at it a little bit differently depending on the size of their platforms and what their client base is looking for, but generally, what we are seeing is that groups are looking for some diversified access into private markets. And by diversify that means they will want some credit, they will want some equity, they will want some real estate, they will want those kinds of things. It's hard to come from, I've never done a product like this to now, I'm doing it. So, there is your second question, a little bit of a first mover advantage in the sense that you have established yourself as having a track record, the brand matters, and again, the brand in terms of both that channel and in the markets generally and the familiarity with those kinds of products. And so to that second question, does the first mover advantage, I think in the shorter-term, it probably mean something to have the size and scale. We feel pretty good with where we are on that because as Erik said in his comments, we have a good sized platform in that channel. I think over time, like you've seen everywhere else, there will be more players on the platforms, but as with everything else, if you're there first and you have the size, the scale and the track record, you have an enormous advantage in terms of people being comfortable with your ability to execute on behalf of clients. Your line is open. I think what you're seeing is one, as this asset class has matured, secondaries, sort of don't simply mean one thing. And so, I think there's been a greater appreciation of how secondaries can be successfully leveraged inside of your portfolio depending on what you're trying to do with them. So, I think the market is maturing, the market is growing, the number of problems that that asset class can solve is increasing. There's also a real correlation between the rise in the secondary market and the rise in the overall market for private markets as it gets bigger, you would expect that you would have more channels for liquidity. So, I think all those are kind of coming into effect here and it's driving good fundraising and it's driving strong dollar deployment, and I don't really expect to see any of those change. In today's environment, if we're sort of getting at, are we going to see a bunch of panic selling, I think the answer is. Off the back of Mario's earlier comments, you're not seeing people panicking period. I think the LPs have grown very sophisticated and are being very tactical in how they're thinking about their portfolio construction, their asset weighting. And so, we're not seeing them stop committing, nor are we seeing them turn around and trying to fire sale a bunch of assets tomorrow either. I think there's nothing to tease out other than what Atul highlighted in his comments, which is in the other, which is you're seeing the full effect of the 361 fund revenue coming through. I think what I would say at a macro level is that, as we've kind of finalized the Cobalt LP acquisition now for some time and have really fully integrated that into our sales model, I think you're seeing us doing a better job of co-mingling both software service in cobalt with traditional back office service, bringing those two together and selling that as a more complete package. I think that has certainly helped us drive, kind of that reporting revenue a little bit higher. Your line is open. So, if you recall, FRE margin, pre-pandemic was, I think in about low-40s, and as the pandemic, we – what we follow is a bit of a COVID bump to our margin. So, where we are with that as the travel starts to come back and from   come back, I know you're mentioning wage over increasing what we would say is, over time, the way we talk about margin increasing over time that still holds, but the COVID blip we saw in the last couple of years, maybe that doesn't – that  a little bit. So, maybe the margin   a little bit from here, but we don't think that's going to be a substantial change. Yes, the comp growth is, I mean, I think you guys know where the market is. So, comp growth is going to be in-line with what the industry is seeing and what we're seeing. And then just turning to the specialized funds, kind of bigger picture, thinking about revenue growth, you mentioned fee rates are coming in pretty stable. The year-over-year just finished was a little noisy just because there were so many catch up fees in fiscal 2021, but looking ahead, as we look at kind of the end of period point-to-point growth and then a lot of the transparency that you've given around expected fundraising this year, should we think about fees in that segment, kind of going up according with the AUM growth? I think what you've seen in the specialized fund world, fee rates have just been very steady. You either have a good product with a good track record, good brand, good deal flow, etcetera and you can execute in which case you're allowed to kind of play the game or you don't have that. So, for us, specialized fund revenue is going to be really a factor of what the specialized fund AUM do. And I think for us, you're seeing that we've got a really good track record here of not only introducing new products into that world, which we continue to do and are looking to continue to do, but we're expanding the products that we already have. So, I think our outlook there continues to be strong and we are very positive. Your line is open. I think the credit space is an area where we have sometimes done some co-leading of transactions, but I think we're mindful that one of the real benefits that we have is that we go back to an earlier question around deal flow and pacing. We're able to be, kind of that one stop solution provider where we're able to give you access to credit and equity across size and shape and geography, etcetera. And so, we think that model actually is incredibly powerful and it's even more powerful in a market like this. And so for us, we've always said that we were trying to not be a one-off SPAC manager, but we were trying to make the SPAC a real business line. I think that's still our focus, but I think that also means that we need to be incredibly thoughtful and selective to make sure that whatever we do, if we're able to do anything in this market environment is something that, sort of sets us up to be ongoing. And so, I think at a macro level, our focus and our philosophy hasn't changed. Whether something happens or whether the market allows something to happen I think remains to be determined, but as you know, we have until next year to, kind of cross that bridge, and so right now, we're just focused on what's there for us to potentially do. Your line is open. The question, at least as I understood was in relation to specialized funds on the exposure there. And in that area, the exposure is not a material part of the overall fund exposure we have there in terms of clients. But certainly, if you're then talking about the AUA assets, that's very different, but I think the question, if I heard it right, was related to the specialized funds."
}