{
    "symbol": "PNR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 12:59:04",
    "content": " A few of our key wins during the year include: strategic progress on our transformation initiatives, which we expect to drive significant margin expansion over the next several years; the acquisition of Manitowoc Ice, a complementary and accretive acquisition which further enhances our commercial water solutions business; and recognition for our leadership in social responsibility and sustainability. In 2022, we generated $4.1 billion in sales with approximately a 50% mix from residential channels and 50% from commercial, industrial and infrastructure channels. Consumer Solutions core sales were down 11%, as expected and previously communicated, due to residential channel inventory levels rebalancing and as a result of our lead times beginning to return to more normal levels. Fourth quarter segment income increased 10%, and return on sales expanded 130 basis points year-over-year to 18.2%, driven primarily by price, significantly offsetting inflation. For the full year, segment income grew 12% and return on sales expanded 40 basis points to 18.6%. In the fourth quarter, Consumer Solutions sales declined 1% with core sales declining 11%, comprised of 15 points of price, offset by 26 points of volume decline. Segment income grew 7%, and return on sales expanded 150 basis points to 23.1%, as strong pricing measures continued to play out along with the contribution from Manitowoc Ice. Segment income grew 21%, and return on sales expanded an impressive 240 basis points to 17.4%, marking the second consecutive quarter of greater than 200 basis points of improvement. Segment income grew 14%, and return on sales increased 110 basis points to 16.1%, as strong price more than offset inflation and FX headwinds. IFT saw sales growth across the segment with residential flow up 3%, commercial flow up 6% and industrial solutions up 10%. We expect segment income to increase 5% to 10%, with corporate expense of approximately $80 million, net interest expense of roughly $125 million, an adjusted tax rate of approximately 15% and a share count of 165 million to 166 million. We expect segment income to increase 5% to 8%, with corporate expense coming in around $21 million, net interest expense of roughly $33 million, an adjusted tax rate of approximately 15% and a share count of 165 million to 166 million. We expect price benefit of approximately 5% and a benefit from acquisitions/divestitures of roughly 5%, primarily due to a full year of Manitowoc Ice, partially offset by exits in the residential businesses and water solutions. We expect Pool sales to be down low double digits at the midpoint in 2023 after growing 14% in 2020, 40% in 2021 and 4% in 2022. We expect our Water Solutions segment sales to be up mid-teens at the midpoint, including up approximately 40% in our commercial business with a full year of Manitowoc Ice and down approximately 10% in our residential business. Hey, good morning, guys. Hey, good morning, guys."
}