{
    "symbol": "ADP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-26 13:24:07",
    "content": " Your line is open. But if GDP growth--I think the GDP growth for the full calendar year, most people have kind of kept it in the same range, so I’m guessing that people have lowered their first quarter - talking about calendar quarters now - GDP growth forecasts slightly and probably increased, because I think it’s just a matter of pushing activity forward, because it does look like in a few weeks, things will start to, quote-unquote, normalize in at least a portion of the country, and then I think shortly thereafter economic activity should be robust again, as was, I think, predicted by a bunch of economists. Your line is open. Your line is open. Your line is open. Your line is open. I think that’s a fair point - there’s a lot of things that we do that are intended to really, quote-unquote, standardize and to be able to get leverage, and this is clearly one of those where--you know, ADP historically was a little bit more fragmented in terms of our R&D, and we’ve been, starting with my predecessor, I think trying to become more unified, etc., and the user experience is one of those places where there was an obvious opportunity that I think will make us better competitively and allow us to invest our money more efficiently, and there clearly is some back end benefit to that from a margin standpoint. Your line is open. Your line is open. Your line is open. I would say we had a really good, I think, first--I would call it year end, because when you get to the midmarket, which is next gen pay, as you know right now is really being sold in a portion of what we call the core part of the midmarket, so call it 50 to 150, and I think we’re at--we’re selling somewhere between 20%, 25% of our clients, of our new businesses coming in on the new platform, and we expect to be GA, I think it’s end of calendar--\n This calendar year, that’s right. I’m trying not to give you a non-answer answer, but I think--I’m trying my hardest to give you something concrete, but it’s exciting because these are all--I mean, the growth rate, Dany won’t allow me to say it because as we were preparing for the call, if we were a start-up, we would be quoting growth rates for Roll that would make your eyes roll, but Dany won’t let me say it because it’s really, frankly, insignificant to a $15 billion company today, but it won’t be insignificant in five or 10 years. Your line is open. Your line is open. Your line is open."
}