{
    "symbol": "ADP",
    "quarter": 1,
    "year": 2022,
    "date": "2021-10-27 13:57:08",
    "content": " And with these changes, we now expect growth in adjusted diluted earnings per share of 11% to 13%, as I think you've heard us say a couple of times now we are very pleased with our Q1 results and we're happy to be raising our guidance this early in the year. Your line is open. So that's kind of a sign to your question about products that I think the market is really searching for solutions coming out of this pandemic, that helped them with obviously people issues and sort of, but there's also a talent for -- so people are looking to obviously attract and retain people in this environment where every Company, including ADP, is going through some of these challenged in terms of retracting our own internal talent. We obviously have the capital, we have the I think the desire and we have, I think the experience to be able to execute once we hire those people to get the sales, get the clients implemented, and then hopefully derive the benefits of that revenue for, in many cases 15-20 years, depending on which business unit you're in. Your line is open. Your line is open. I think there is definitely more leverage in the sales force than we've ever had because -- I mean, I think maybe what you're alluding to our sales force like a lot of other of our competitors had to go to a 100% virtual for a number of months, and I'm sure every competitor handled differently in terms of how long they were virtual, versus when they went back in the field. So I think it's a combination of a lot of different things, but the overall, I think comment would be there's no question that there is increased leverage in the Salesforce and you're seeing it in terms of the productivity numbers. Your line is open. Your line is open. Your line is open. Your line is open. But it's fair to say, and I think we said in the last couple of quarters that our focused turn ed more to, making sure that we have a strong foundation and that we had the right implementation tools to be able to get the business started that we intend to have in the next year or 2, which is hopefully quite -- quite a lot of business. Your line is open. Your line is open. So I would say that on those measurements we're still happy and excited by the progress we're seeing with both next-gen HCM, as well as next-gen payroll, we have not gone to general availability, so we're selling a lot of next-gen payroll, but we're only selling in what we call the core of major accounts right now of the mid-market, which is kind of 50 to 150 and this is no different in terms of the playbook that we use with our transition from our old platform to run in a down-market. I think the second part of question, so hopefully you'll forget about first part because we don't have -- we try to prepare for everything and that one, we'll have to follow-up with you on in terms of what regions or what states, we're strongest in terms of our sales."
}