{
    "symbol": "ADP",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-27 14:37:15",
    "content": "  We also delivered 170 basis points of adjusted EBIT margin expansion which helped drive 25% adjusted EPS growth, and for the full fiscal year 2022 we ended up with 10% revenue growth, 90 basis points of margin expansion, 16% adjusted EPS growth, and importantly we achieved record bookings and near record level retention, reflecting our strong position in the HCM market. Our adjusted EBIT margin was up 170 basis points, about in line with our expectations as leverage from strong revenue growth overcame higher selling expenses, PEO pass throughs, and growth investments like the sales headcount growth Maria just mentioned, and our robust revenue and margin performance drove 25% adjusted EPS growth for the quarter, supported by our ongoing return of cash to our investors via share repurchases. Your line is open. Your line is open. I wouldnâ\u0080\u0099t say that itâ\u0080\u0099s really next-gen payroll because youâ\u0080\u0099re really going to see that, the impact of that on sales and market share and so forth in the next couple of years because the majority of our clients are still not enjoying, I think, the benefits, even though over time they will of next-gen payroll, so thatâ\u0080\u0099s really not--I just want to make I was clear on that, that that is not whatâ\u0080\u0099s causing the retention improvements. As you know, we still have work to do in the up market, so thereâ\u0080\u0099s still opportunity there, thereâ\u0080\u0099s still some opportunity in employer services international as well, but we think these structural tailwinds that first helped us in the down market despite the macro, right, because the macro is really a cyclical issue, but overall excluding cycles, our retention in a down market is up--I said this before, itâ\u0080\u0099s hundreds of basis points higher than it was 10 to 15 years ago, and now the mid market is at record levels and the NPS scores continue to be at record levels, and I donâ\u0080\u0099t think we anticipate that going back down. Your line is open. But we just talked about the structural retention level, so even if we have a little bit of a drag in the down market, and by the way, the down market is a larger percent of our overall business than it was 10, 20 years ago, but still itâ\u0080\u0099s structurally higher by several hundred basis points in and of itself, so even if it goes down a little bit and is a little bit bigger part of our mix, I think our retention is just going to hold up better, I would predict, in terms of--you know, depending obviously on the severity of the recession, so thatâ\u0080\u0099s a huge help because the bigger--obviously the portion of the revenues that you retain each year, the less dependency you have on bookings in a recession, which tends to be the most sensitive. Your line is open. The only thing I would add to that is Maria and I have been talking for the last 18 months about how--you know, one of the most important things for our sales organization was really to get productivity at the quota carrier level back to and then exceed from a trend line standpoint where it was, right, so when you think about whether itâ\u0080\u0099s GDP trend or price trends or anything like that, youâ\u0080\u0099ve got to get back to where you were and then youâ\u0080\u0099ve got to get back on that same trend line, otherwise you leave a lot of money on the table, whether itâ\u0080\u0099s the economy or ADPâ\u0080\u0099s revenue and bookings growth. Your line is open. Your line is open. I would tell you that the fourth quarter, you saw what our pays per control growth was, and I can tell you that we have visibility into July and itâ\u0080\u0099s hard to believe that for the whole year, it would be less than 2% to 3%, but then you can assume that if, for example, the first couple of months at least, since we have some visibility of that already, are in the 6% to 7% range, because thatâ\u0080\u0099s where weâ\u0080\u0099re kind of exiting, and you can do the math, right, so youâ\u0080\u0099re probably--this is just to give you color in terms of what some of our assumptions are in our operating plan, because I think Don mentioned maybe a bit of conservatism on the back half. Your line is open. Your line is open. Iâ\u0080\u0099d say that right now, our expectations are for a pretty balanced incremental margin from both of those factors, so we are of course, as we mentioned--you know, we are spending some more money, weâ\u0080\u0099re investing in sales headcount, we have higher costs as a result of inflation, some of it is offset by price, but we are letting a substantial amount fall to the bottom line but we are obviously in this for the long term, so weâ\u0080\u0099ll take the opportunity to invest in the business and make sure that we have the right balance between margin growth and preparing ourselves for continued success in the future years. Your line is open."
}