{
    "symbol": "CCEP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 20:50:02",
    "content": " We've already seen promising results from some of our portfolio initiatives, evidenced by a 7% increase in revenue per unit case versus 2019 and so we're looking forward to the longer-term value creation opportunities that this market offers as we continue to reshape our route to market to be fit for purpose. We will take our next question. We will take our next question. We will take our next question. We will take our next question. So I mean, to your question around why we covered more, I think we saw leaving things open for as long as it was and the fact that it was rising and there continues to be uncertainty where we saw opportunities, and we've always talked about the fact that we've put in triggers in place and don't just try and take our number up from, let's say, 40% to 80% in one go. And I think just to build on Nik's comment, I mean we're also looking at in most of our markets, circa 40% of our revenues coming from outside of retail. So we do enjoy diversification not just on the package side, which we've been really focused on over a number of years to make sure if you go into a supermarket or convenience store, most of our markets, you're going to see a lot of different pack sizes from minis all the way up to value packs that allows us to play a lot better with pricing on that affordability mindset, but also on premiumization, which we haven't walked away from. But clearly, having 40% of your revenues coming from outside retail gives us a lot more levers and tools to deal with some of those commodity headwinds and other inflationary points, including labor, which we can't forget that clearly, we're seeing labor inflation also increase in Europe, and that's something that we're mindful of keeping our employees engaged and committed to our business. We will take our next question. We will take our next question. We've taken on board some of the learnings from our Australian business back into Europe around looking at some post code analytics to understand really where we're doing really well and potentially where we see share opportunities and then tailor making our proposition to those particular assets, whether that's display, as you called out, coolers, merchandising frequency, promo frequency are indeed advertising in and around the store. We will take our next question. We will take our next question."
}