{
    "symbol": "YJ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-20 11:30:02",
    "content": " Thank you for standing by, and welcome to Yunji's Fourth Quarter 2022 Earnings Conference Call. With us today are Mr. Shanglue Xiao, Chairman and Chief Executive Officer; Mr. Chengqi Zhang, Vice President of Finance; and Ms. Kaye Liu, Investor Relations Director of the company. Before we start, please note that this call will contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are based on our current expectations and current market operating conditions, and relate to events that involve known or unknown risks, uncertainties and other factors of Yunji and its industry. Any forward-looking statements that we make on this call are based on assumptions as of today and are expressly qualified entirely by cautionary statements, risk factors and details of the company's filings with the SEC. The driving force behind our R&D and production processes with a focus on creating high-quality, healthy and natural products. By refreshing and refocusing our content marketing and private label brand promotion initiatives, we further developed and strengthened the brand for public traffic. Leveraging social media and our own user community, we boosted user interaction by generating attention grabbing helpful content thereby further enhancing user experience and our brand's reach. For our  product selection, we successfully launched our upgraded Yunji selected quality certification system, an integral component of our gourmet Yunji strategy with its main focus on gourmet food category. One year of this recent launch, our platform has accumulated a wide range of well-loved products that are regularly repurchased by our users. Powered by indeed the flagship Yunji selected certified products, our repurchase rate reached an impressive 81.8% in 2022. By integrating these tools with our innovative features that make sharing more convenient, we create a heightened brand exposure and allow our service managers to promote products more efficiently and accurately. We are increasing numbers of e-commerce companies, are competing in  cultivating consumers' mindset of purchasing low-priced products. On the other hand, consumers are generally becoming more price sensitive and spending more cautiously even if they demand higher-quality products and obtain value for money experiences. Following the easing of COVID-related restrictions in the fourth quarter, consumers became more health conscious and increased their spending in the health category accordingly. In line with these trends, this year, we are focusing on exploring the health care and the nutritional therapy categories to further enhance the statements of our private label products. Importantly, both our legacy and newly launched product proved popular with users having us maintain a healthy growth margin. At the same time, we will attract public traffic and boost awareness of our prep label brands by rolling out more offline stores where consumers can explore and enjoy our products. Before I go through our financial results, please note that all numbers stated in the following remarks are in RMB terms and all comparisons and percentage changes are on year-over-year basis, unless otherwise noted. Navigating through the pandemic, we gained valuable experience as we continue to refine our product selections, develop our private labels, optimize our product mix and explore new business opportunities. Thanks to these efforts, we delivered significant efficiency improvements with our operating expenses decreased by -- decreasing by 22% year-over-year. Revenues from sales of merchandise was RMB 241 million, and revenues from our marketplace business were RMB 43 million. This decrease was primarily due to our continued strategy of refining our product selections across all categories and optimizing our selection of suppliers and merchants causing near-term decrease in sales, changes in consumers' consumption confidence that have during the COVID-19 pandemic also contributed to the decrease. Despite these challenges, we maintained a stable gross margin at 40.9% compared to 39.6% a year ago. This was mainly due to the reduction in personnel costs as a result of staffing structure requirements, a decrease in member management fees and a decrease in marketplace business platform promotion expenses. Net loss was RMB 38 million compared with net income of RMB 58 million a year ago, while our adjusted net loss was RMB 31 million compared with adjusted net income of RMB 71 million a year ago. As of December 31, 2022, we had a total of RMB 669 million in cash and cash equivalents, restricted cash and short-term investments on our balance sheet compared to RMB 571 million as of September 30, 2022. Looking ahead, we will continue to cultivate our range of private label products and introduce more novel offerings with strong repurchase potential and customer peer. We acknowledge the value of the subsidies to consumer market, especially in some standard product categories such as mobile phones and electronics and some imposed consumptions in -- And the price is, of course, very important element in consumption decisions. But the demand for product quality, customer service and production features still is quite important and strong. Our goal is to establish a mindset among our consumers that our products are not only affordable, but also unique with high quality. Rather than offering client subsidies, we focus on providing value-added services and maintaining the quality of our products, so that our customers feel that their purchases are worth it. We have a variety of private labels in healthy food, beauty and gourmet food categories complemented by professional vertical committees for one-stop shopping and marketing. This gives us a strong cost control and our operational capabilities over product quality, pricing and services."
}