{
    "symbol": "YJ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-29 14:29:03",
    "content": " Before we start, please note that this call will contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that are based on our current expectations and current market operating conditions, and relate to events that involve known or unknown risks, uncertainties and other factors of Yunji and its industry. Any forward-looking statements that we make on this call are based on assumptions as of today, and are expressly qualified in the entirety by cautionary statements, risk factors and details of the company's filing with the SEC. We launched a variety of initiatives, including enhancing our service provision, augmenting our private label product development process and optimizing our inventory structure. In addition, we took advantage of the e-commerce sector's usual third quarter off season to further evolve our innovative technology and upgrade our services. As in time, we deepen our exploration of e-commerce potential by focusing on our  products and driving the use of short videos as our main consumer marketing tool. Through continued analysis of our core userâ\u0080\u0099s consumption habits and pricing preferences, we have maintained a relatively high repurchase rate despite the current macro headwinds. Furthermore, by refining the details and accuracy of our product descriptions, we fostered the mindset of a carefully considered purchase decisions, allowing us to successfully maintain a low product return rate. On the marketing side, entrepreneur oriented has always been one of our core values, especially when it comes to empowering women to launch businesses and enhance their lives through self improvement. In the current environment where employment prospects are uncertain, we are further investing in our service managers by developing innovative features that make sharing increasingly convenient efficient and easy. Turning to our marketing promotion, following the in-depth preparation during the third quarter, we officially launched our Yunji Dynamic Showcase for service managers. The showcase blend traditional graphical marketing content and live streaming, creating short promotional videos for featured products. By integrating this innovative marketing tool with our platform service guarantee, we deliver affordably priced high-quality products to customers, while providing brands with a low-cost solution to promote their products more efficiently and accurately. The showcase features a wide product selection that would reflect our private labels, our range of Gourmet food and trending market products from the top 100 live streaming channels. Our service managers can ask for the showcase products, choose those they are interested in and synchronize them with My Showcase function. On the other hand, it makes it easier for them to generate sales, allowing service managers and the young marketers to boost their incomes through our platform. Our health care brand introduced a slew of new offerings including liver and kidney care products, augmenting our product matrix to rather satisfy the healthcare needs of our users. To better satisfy users' diverse food preferences, we have expanded our Gourmet food private label product matrix. Since 2018, SUYE has partnered with a Dutch company to research peptide  and then develop a wide variety of anti-aging products that better meet people's skincare needs. We were delighted to see SUYE generated over RMB 21 million in sales during its anniversary month, showing high user demand for quality products and deliver innovative and effective anti-aging solutions. During the third quarter, we faced a volatile macro environment and ongoing pandemic controls, both of which presented challenges to our business. In response, we further refined our product selection and optimized our relationships with suppliers, sacrificing near-term sales, while building a solid foundation for our company's long-term success. Beyond this, operating expenses and total cost of revenues, both declined, as we continue to optimize the cost structure of our business. Total revenue were RMB 239 million, compared to RMB 438 million a year ago. Revenues from sales of merchandise were RMB 197 million, as revenues from our marketplace business were RMB 38 million. This decrease was primarily due to the company's continued strategy to refine product selection across all categories and optimize this selection of suppliers and merchants, causing near-term decrease in sales. Consumers' willingness to spend on discretionary products in 2022 has also declined, compared with that in the same period of 2021. Despite these challenges, we improved our gross margin to 49.4% compared to 43.2% a year ago as a result of sustained customer loyalty to our private labels and the effective product curation strategy. Fulfillment expenses were RMB 37 million, compared to RMB 41 million a year ago. Sales and marketing expenses were RMB 47 million, compared to RMB 60 million a year ago. Technology and content expenses were RMB17 million, compared to RMB29 million a year ago. General and administrative expenses were RMB38 million, compared to RMB65 million a year ago. This was primarily due to reduced personnel costs as a result of refinement to our staffing structure, lower professional service fees and a decrease in share-based compensation expenses. Net loss was RMB38 million compared with net income of RMB61 million a year ago, while adjusted net loss was RMB30 million compared with adjusted net income of RMB76 million a year ago. Basic and diluted net loss per share attributable to ordinary shareholders were both RMB0.02, compared with basic and diluted net earnings per share attributable to ordinary shareholders of RMB0.03 in the same period of 2021. As of September 30, 2022, we had total RMB571 million in cash and cash equivalents, restricted cash and short-term investments on our balance sheet compared to RMB645 million as of June 30, 2022. Despite the persistent challenges of today's macro environment, we are confident that our efforts to optimize costs refine our business model, improve product curation and ensure high quality service for our users will serve us well now and into the future. In terms of the uncertainty, as a comprehensive e-commerce platform Yunji has a wide customer base from the first tier cities, such as Beijing, Shanghai and Guangzhou to remote areas such as Xinjiang and Inner Mongolia. From the perspective of the market habits, I think that, after three years of the epidemic consumers plans will not fade away so quickly and restocking demand for the necessities may still exceed demand for the discretionary products in the short term. In the long run, we still believe in users yearning for a better life, we will enhance our business and management capabilities, and maintain a healthy financial position to cope with the challenges and opportunities ruled by the microenvironment."
}