{
    "symbol": "GLDD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 15:50:01",
    "content": " First quarter revenue came in about 10% above the guidance given on the last earnings call, primarily due to pulling a job forward into the first quarter that was previously expected to occur in the second half of the year and the positive settlement of claims from recently completed projects. Gross profit margin this quarter was 17% compared to $18.6 million in the prior quarter, and was a few points lower than the guidance given on the last call due to the previously mentioned weather impacts and a couple of production issues related to differing site-soil conditions. G&A expense came in at $14.6 million during the first quarter of 2022, which is down $1.7 million from the prior year quarter, primarily due to lower stock incentive expense and Houston relocation costs. G&A was approximately $2 million lower than prior quarter guidance, primarily due to lower than expected stock incentive expense and the timing of adding additional headcount related to building up our offshore wind team. Net interest expense of $4 million for the first quarter of 2022 came in at guidance and was down from $6.6 million in the first quarter of 2021, primarily due to the lower interest rate on the senior notes, which were refinanced in the second quarter of 2021. First quarter 2022 capital expenditures were $25.6 million, which included $12.7 million in maintenance CapEx, $8.7 million for the construction of our new hopper dredge, and approximately $4 million for the construction of the new scows and multi-cats. The dredge New York is scheduled to enter the shipyard in the latter part of the second quarter for her regulatory drydocking and the dredge 54, which completed her regulatory drydocking towards the end of the first quarter, is currently working at the Houston Ship Channel. So, last year, we solidified our plans to enter the offshore wind market by signing $197 million contract with a Philly Shipyard to build the first U.S.-flagged Jones Act compliant inclined fall- vessel for subsea rock installation for wind turbine foundations, which now has its first project set to start in 2022. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}