{
    "symbol": "GLDD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 23:13:02",
    "content": " Bidding for projects for the core was unusually slow in Q1 and for the two first months of Q2, resulting in delayed bidding for beach and maintenance projects that we have historically seen in the second quarter for execution in the current year. So since these bids for new dredge projects did not materialize as early as in previous years, two dredges were idle for part of the second quarter. Operating loss for the current quarter of $0.3 million decreased $9.1 million from the prior year quarter, primarily due to lower gross profit margin, partially offset by lower general and administrative expenses compared to the prior year second quarter. Second quarter 2022 G&A of $10.8 million decreased $3.4 million from the prior year second quarter, primarily due to lower incentive expense and lower Houston relocation costs. Second quarter 2022 capital expenditures were $39.2 million, which includes $11.7 million for our new scouts and multicast, $9 million for the Galveston Island new build, $6.1 million for emission upgrades to the Carolina and the Booster Buster, $4.4 million for upgrades to the Liberty Island, $2.8 million for the Subsea rock installation vessel and $5.2 million in maintenance CapEx. After announcing the build of our second new hopper dredge earlier in the second quarter, revised full year CapEx is expected to be $180 million but can fluctuate greatly up or down based on timing of progress payments. In addition, one of the dredges that was idle most of the second quarter is expected to work the majority of the third quarter, partially offsetting the projected increase, the New York is expected to be idle for most of the third quarter after entering dry dock in June. Third quarter G&A expense is expected to increase a few million dollars from the second quarter, mostly due to the nonrecurrence of the onetime second quarter adjustment previously mentioned and the gradual ramp-up of the offshore wind team. We ended the quarter with a backlog of $373.8 million and with a backlog of $373.8 million and $54.9 million in low bids and options pending award, which compares to last year's second quarter of $454 million in backlog and $508 million in low bids and options pending award. In addition, we have seen bid activities increased substantially in the third quarter, and we expect to see bids for multiple new faces on port deepening projects in Norfolk, Freeport, Mobile, Sabine and additional projects of the Houston Ship Channel project 11. And this increased budget and the funding from the administration's infrastructure build support our expectation for a strong market entering into 2023.In March 2021, the White House announced new initiatives that would advance the administration goal to expand the nation's offshore wind energy capacity in the coming decade by opening new areas of development and increased public financing for projects. Your line is now open. Your line is now open. Your line is now open. Yes, so on the inflation front, again, as we start rolling into the more recent projects that we have bid, we're hopeful that we have captured all of that and the impact should not be as much, but as I mentioned, we are still working on projects, and we'll continue to into the second half of the year that were bid prior to. Your line is now open. Your line is now open."
}