{
    "symbol": "GLDD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 14:55:23",
    "content": " As being picked up in the second half of the year, we won 47% of the big volumes, and ended the year with $375.5 million of dredging backlog, and $594.7 million in open auctions and projects pending award. Revenue of $146.7 million in the fourth quarter decreased $63.3 million from the prior year fourth quarter, mostly as a result of lower capital revenue, which was driven by a substantial decrease in the Army Corps capital projects bid in 2022 and lower coastal protection dredging revenue, partially offset by higher maintenance project revenue. The mix of projects also negatively impacted gross margin, as we had less than half the capital revenue in the fourth quarter 2022 compared to the same quarter of 2021, driven by the slow and unusual 2022 bid market. The decrease is a result of the lower gross margin and the one-time non-cash $8 million charge due to the retirement of the Terrapin, partially offset by lower General Administration is straight of expenses compared to the prior year fourth quarter. Fourth quarter 2022 G&A of $12.4 million is $4 million lower than the same quarter last year, due to our continued efforts on cost reduction. And as you saw in December of 2022, the omnibus appropriation bill for fiscal year 2023 was passed, which included another record budget of $8.7 billion for the U.S. Army Corps of Engineers Civil Works program, for which 2.3 billion is provided for the Harbor maintenance Trust Fund to maintain and modernize our nation's waterways. So, Adam, I'm not going to give that kind of granularity, we'll kind of this quarter like I did, will continue, give updates, how we see the fleet in terms of which vessels will be working, has utilization shaping up dry docking, if there's any challenges we're facing, like we are, the weather this year, and on the on the bid market, utilization is strong this this quarter. But I'll tell you that the beginning part, the half, first half of the year will be hired drawn the first quarter particular, because of the way that the CapEx is weighted, and that it will, it will trickle down, so I mentioned the draw that we have, don't extrapolate or straight line that for the rest of the year, that's not how we're seeing it was going to be very heavy in Q1, and then definitely the diminishing down."
}