{
    "symbol": "GLDD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 15:26:01",
    "content": " In the latter part of Q3, the bid market gained momentum and Great Lakes won 50.1% of the volumes bid as we were awarded $338.9 million in dredging projects in open auctions, ending the quarter with $452.6 million of dredging backlog and $625.7 million in open auctions and projects pending award. Revenue of $158.3 million in the third quarter decreased $10.3 million from the prior year third quarter, mostly driven by lower domestic capital and maintenance revenue, partially offset by higher coastal protection revenue. Third quarter 2022 revenue came in about $10 million below the guidance given on the last earnings call, primarily due to the lack of book-and-burn beach and maintenance work that we typically see in the third quarter. Current quarter gross profit and gross profit margin was $3.8 million and 2.4% respectively, compared to $36.3 million and 21.5% respectively in the third quarter of 2021, and was lower than the guidance given on the last call, partially due to the lower than expected utilization and revenue previously mentioned. Third quarter 2022 G&A of $13.3 million decreased $1.9 million from the prior year third quarter, primarily due to lower incentive expense and lower Houston relocation costs and was slightly below guidance due to the continued focus on cost savings. Third quarter 2022 capital expenditures were $33.7 million, which includes $11.1 million for our new scows and multicats, $8.5 million for the Galveston Island new build, $8.2 million in maintenance and other CapEx, $5.1 million for our second new hopper dredge, and $800,000 for the Subsea rock installation vessel. We expect fourth quarter gross profit margin to be in the high single digits, with some remaining drag from the issues around production and inflation encounter during the second and third quarters, the continued impact of high diesel prices on the unhedged portion of our fuel, the mix of projects in backlog and the Ellis and Padre dry dockings. The bid market has picked up in the third quarter, which points to improved utilization in 2023, although some of the new phases on larger port deepening projects previously planned to bid in Q4 will likely slip into Q1 and Q2 next year. Your line is open. One moment for our next question, please. Your line is open. Your line is open. Your line is open. Your line is open. One moment for our next question, please. Your line is open. Your line is open. One moment for our next question, please. Your line is open."
}