{
    "symbol": "SGC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 20:53:02",
    "content": " Consolidated revenues were $149 million, up 5% over the prior-year quarter, driven by growth in both our branded products and contact center segments. Our consolidated fourth quarter adjusted EBITDA was $3 million, down from $8 million in the fourth quarter last year, primarily due to an incremental inventory write down of $6 million in our healthcare apparel segment. Revenues came in at $26 million relative to $31 million, the prior year quarter reflecting of the ongoing stock conditions of the broader healthcare market, healthcare apparel EBITDA declined by $8 million compared to prior year quarter, primarily due to the aforementioned inventory write-down. Branded products, our largest segment generated revenues of $102 million during the fourth quarter, which was up 7% year-over-year benefiting from a full quarterâ\u0080\u0099s contribution from the Sutter's Mill acquisition made during the fourth quarter of 2021. Fourth quarter EBITDA was $11 million, up from $6 million last year, driven by higher sales, improved gross margin rates and laughing a PPE inventory right down last year partially offset by an increase in SG&A from investments in talent and technology to support future growth. Fourth quarter EBITDA of $4 million was flat to last year as investments in SG&A related to talent, technology and infrastructure to support future growth offset, increase in sales and gross margin. During the fourth quarter, SGC generated consolidated revenues of $149 million, up 5% from $142 million the prior year quarter. Our gross margin was 30.2% for the quarter, down 80 basis points year-over-year due to the $6 million incremental inventory write down for Healthcare Apparel. The year-over-year increase as a percent of sales was due to continued deleverage from the decline in Healthcare Apparel sales as well as our continued investments in talent and infrastructure, especially within Branded Products and Contact Centers capitalize on compelling future growth opportunities. Our fourth quarter interest expense was $2.2 million, as compared to $295,000 in the fourth quarter of last year, driven by a combination of higher interest rates and a higher average debt balance outstanding during the quarter. Excluding the gain in the prior year fourth quarter's pension termination charge, the fourth quarter 2022 net loss was $1 million or a $0.06 loss per share, compared to net income of $5 million or $0.31 per diluted share the prior year period. For branded products, we estimate segment sales to be flat to download single digits, as we expect the continuation of the challenging market conditions from the fourth quarter of 2022 into the first half of the year, with meaningful growth in the back half of 2023. If I look at the sales guidance range, it seems to be a 1% to 3% increase, despite having about $7 million possibly of sales from the first four months of this year from the Guardian acquisition before that lapse, it's anniversary on May 1st. Well, our guidance, obviously, is on a consolidated basis, from an earnings perspective, what I would say just as, as additional context is, given, again, the down trending that we've experienced in healthcare in 2022, combined with the significant write offs that we've taken within that segment, the guidance certainly assumes an improvement, and the healthcare apparel results pretty significant improvement, if you just in 2022 alone, we took about over $10 million of charges and health care apparel segment, which again, we would not anticipate to repeat in 2023."
}