{
    "symbol": "MDGL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 12:56:06",
    "content": " Here's the summary of the data that we presented at the January 31 webcast when we announced the top line data from MAESTRO-NAFLD-1, resmetirom was safe and well-tolerated at the top dose of 100, as well as 80 milligrams in MAESTRO-NAFLD, key secondary endpoints were key in MAESTRO-NAFLD at both 80 and 100-milligram dose groups, including PDFF, LDL cholesterol, APOB and triglyceride reductions, which are consistent with the parallel randomized 100-milligram open-label arm that had been from the same study that had been presented at AASLD in earlier on November 2021. Now there will be multiple presentations of Madrigal's program data at EASL's International Liver Congress, including a late-breaking presentation, primary data analysis of MAESTRO-NAFLD, a 52-week double-blind placebo-controlled Phase 3 clinical trial of resmetirom and patients with NAFLD. We will present an abstract utility of FIB-4 thresholds to identify patients with at-risk F2-F3 NASH based on screening data from a 2,000-patient liver biopsy cohort of our Phase 3 clinical trial, MAESTRO-NASH and a fourth presentation biomarkers, imaging and safety in a well compensated NASH cirrhotic cohort treated with resmetirom, a thyroid hormone receptor beta agonist for 52 weeks. I will note also at this point that the threshold for an eligible FibroScan was 7.2 KPA which is consistent with approximately F1 to F2 fibrosis stage compared to liver biopsy historically in the literature, and this was a fraction of the patients in the MAESTRO-NAFL study, which was in general, an earlier population than MAESTRO-NASH. However, a few of the highlights are shown here, the screening FibroScan of greater than 8.5 kPa in MAESTRO-NASH predicted significant fibrosis on biopsy and approximately 50% and a high percentage of positive FibroScan's did not have significant liver fibrosis. The MRI - E of 2.9, which was not used as a prescreening test, but we have data from the study predicts significant fibrosis on screening biopsy and about 80% of the nice MAESTRO-NASH population. It's a randomized, double-blind, placebo-controlled study in approximately 70 patients with early NASH cirrhosis, to allow for non-invasive monitoring a progressive to liver decompensation events. MAESTRO-NASH outcomes is designed to assess the rate of disease progression in early NASH cirrhosis patients and enhance the statistical power of MAESTRO trials to assess clinical benefit, the decompensation events that will be assessed, include development of ascites, bleeding varices, hepatic encephalopathy and increased  than or equal to 15 and are expected to occur at a rate that is higher than in MAESTRO-NASH. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. So what I would add to that is we have a significant number of patients who are on stable doses of SGLT2s and GLP-1s in the MAESTRO-NASH study, which means that on biopsy after being on the drug for six months or more that they still had NASH."
}