{
    "symbol": "HAIN",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-07 13:04:02",
    "content": " In the second quarter, consolidated net sales decreased 4.8% versus the prior year period to $454.2 million. Adjusted gross margin was 22.9% in the second quarter, a decrease of approximately 170 basis points versus the prior year period. In the quarter, we saw select customers aggressively reducing inventory levels, particularly in tea, this reduced our adjusted net sales growth by 3% versus the prior year period. Q2 adjusted gross margin in North America was 25.2%, a 250 basis point improvement versus Q1 and a 50 basis point improvement versus the prior year period. Adjusted EBITDA at constant currency in North America was $38.8 million, a $5.5 million or 16.4% increase versus the prior year period. North America's adjusted EBITDA margin was 13.6% on a constant currency basis, a 150 basis point increase from the prior year period. When adjusted for the impact of foreign exchange of $24 million, net sales declined 3.2% compared to the prior year period, representing a 350 basis point sequential improvement from last quarter. As further evidence of the ongoing recovery in Continental Europe, note that adjusted net sales growth versus prior year improved sequentially in five of six months in the first half. As a percentage of net sales on a constant currency basis, adjusted EBITDA was 11.2%, down 580 basis points versus the prior year period, yet up 130 basis points compared to the first quarter. Regarding our outlook, we are reaffirming our full year ranges of minus 1% to plus 4% growth for adjusted net sales and adjusted EBITDA growth on a constant currency basis. And second, the strength of the dollar has moderated quite a bit in recent months as such assuming a dollar exchange rate of $1.19 against the pound and $1.03 against the euro for the remainder of the year, we now expect our full year currency exchange headwind to be approximately $85 million and $10 million for adjusted net sales and adjusted EBITDA, respectively. For the second half of fiscal 2023, we now expect on a consolidated basis, low-single digit adjusted net sales growth versus the prior year period. And consistent with our original guidance, we expect adjusted EBITDA growth at constant currency to be second half weighted due to easing comparisons abating supply chain disruptions, plateauing inflationary pressures and greater benefits realized from both existing and planned pricing actions as well as increased productivity. For North America in the second half, we expect adjusted net sales growth of low-single digits versus the prior year period as we realized consistently strong growth in areas such as snacks and yogurt that will be partially offset by softer trends in other areas of the business during Q3 that I will discuss momentarily. Adjusted net sales to return to positive growth up mid-single digits compared to the prior year period, driven by accelerated growth in the UK relative to the first half of the year. International adjusted gross margins will improve materially versus the first half and versus the prior year period as we benefit from aforementioned pricing actions, energy cost caps and subsidies, productivity savings, which ramp meaningfully and early signs of inflation stabilizing. And last, adjusted EBITDA on a constant currency basis is expected to realize strong growth versus the prior year period with margins several hundred basis points higher than both the first half of this year and second half of fiscal 2022. On a consolidated basis, we expect adjusted net sales growth to be down low-single digits due in part tapping the North American demand surge for baby formula in the prior year period, coupled with persistent packaging and formula shortages in the baby food category, and previously mentioned lost customer promotional programs in North America within Personal Care and ParmCrisps. Please proceed with your question. There were lots of challenges that Mark and Chris talked about last year that really prohibited the investment behind those brands relative to supply chain with those largely behind us, it opens the opportunity for us to be able to, in some of our higher growth brands, ensure that we are driving both physical and mental availability, physical availability and driving channel reach, right price pack architecture to put the right products in the right place so that theyâ\u0080\u0099re available for the consumer and then making sure that we have an always-on message. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Good morning and welcome, Wendy. Please proceed with your question. Please proceed with your question. Please proceed with your question. Good morning and welcome, Wendy. Please proceed with your question."
}