{
    "symbol": "HAIN",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-08 10:08:05",
    "content": " In the middle of the P&L, North America adjusted gross margin grew modestly versus year ago after being down considerably last quarter, and was also up 270 basis points sequentially versus what we delivered in Q4. As Mark discussed, our first quarter results were better than the guidance we provided in August, with sequential improvements in gross margin and bottom line growth versus the fourth quarter of fiscal 2022; improved performance in North America, driven by continued strength of our growth brands, solid performance in our supply chain and productivity initiatives; and the volatility in results from our international business, including a large swing due to strengthening of the US dollar versus the pound and the euro. Adjusted gross margin in North America during the first quarter was 22.7%, which is a 270 basis point improvement versus Q4 and a 40 basis point improvement versus the prior year. Notably, as our pricing is now catching up with inflation and with ongoing improvement in supply chain performance, this is the first year-over-year increase in gross margin, since the third quarter of fiscal 2021 and speaks to the sequential momentum we are seeing in North America. Q1 adjusted EBITDA at constant currency in North America was $30.9 million, a $6.8 million or 28% increase versus the prior year. In our International business, Q1 adjusted net sales declined 7% on a constant currency basis from the first quarter of fiscal year 2022, and foreign exchange reduced net sales by an additional 14 percentage points to reported 21% decline versus 2022. In the UK, constant currency adjusted net sales increased 3.5% versus prior year, which continued the sequential improvement that we saw in the back half of fiscal '22. In Continental Europe, constant currency adjusted net sales declined 27% in Q1 compared to the prior year period, driven by the softness in the plant-based nondairy beverage category and the lost co-manufacturing contract that we have discussed previously. As Mark said earlier, we are reaffirming our full year guidance of minus 1% to plus 4% adjusted net sales and adjusted EBITDA growth at constant currency, with growth skewed towards the second half of the year. In the second quarter and in the second half, we expect that, as we have discussed for the first quarter, sequential improvement across the income statement and balance sheet will continue, due to top line and margin momentum in North America, 2023 price increases offsetting mid-teens inflation, continued improvement in our supply chain, fewer disruptions and robust productivity and an uncertain, but improving retail environment in the UK and new nondairy beverage contracts in Europe. The full impact of pricing in North America and the UK, improving international top line momentum, robust productivity and seasonality will contribute to continued sequential improvement in adjusted EBITDA at constant currency in the second quarter and the back half. While still below fiscal 2022 levels, Q2 constant currency adjusted EBITDA is expected to increase versus the first quarter, and adjusted EBITDA margin in the second quarter should improve modestly compared to Q1. In H2, as we overlap the onset of the war in the Ukraine, the loss of the non-dairy co-manufacturing contract in Europe, numerous ongoing supply disruption, the 40-year high inflation and the onetime write-off in Q4 last year, we anticipate a return to constant currency adjusted EBITDA year-over-year growth in Q3 and in Q4. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}