{
    "symbol": "OPCH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 15:14:06",
    "content": " Look, I think overall, we feel like we're really well-positioned to be that partner of choice for those health systems and especially in some of those markets where there was disruption and a little bit of shift in the competitive dynamics. So, all-in-all pleased about it, we think there is some share shift, that was -- that we recognize in the third quarter and the focus of the team is always from a commercial standpoint, is around reach and frequency and make certain that we have those relationships to help support our health system and our prescriber partners, as they're looking for transitioning patients on the service. As you know, there's one or two notable health systems in that area, where they really focused on -- in that area, as well as they're casting a pretty broad shadow across the Upper Midwest, Wisconsin, Minnesota, Iowa, combining their health system centric relationship management with our infrastructure, technology and procurement. And we're always looking for ways to expand the product portfolio, whether it's through some of the limited distribution drugs that we have access to, and certainly in the conversations that we have as being a channel partner, for biopharma as they're looking to introduce new products or -- to focus around additional work and marketing on existing products. We also -- look, there are some interesting new products that are on the horizon, whether it's for Alzheimer's or other disease states, and the infrastructure that we're building, and the facilities that we're operating, will really position us well, to be able to take on some of that patient cohort, if it gets approved, if there is a path to payment, if, there's a lot of ifs on that on that journey. Look, I would characterize it as and I think we've said this before, no one's knocking on our door, saying, hey, we want to give you more money, on a reimbursement standpoint, but our market access team has, very strong relationships with our payer community across, the 800 payer relationships, we have the 1,400 contracts that we manage."
}