{
    "symbol": "WRBY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 12:42:01",
    "content": "  We ended the quarter with 2.26 million active customers, an increase of 5.1% versus last year as we continue to gain share of the $44 billion vision care market and the nearly 200 million adults in the U.S. using some form of vision correction. Average revenue per customer increased nearly 7% year-over-year, reaching a new high of $258 in the third quarter. Evidence of this is best reflected in our average revenue per customer, which as Neil mentioned increased to a record high $258 in Q3 up 7% year-over-year. Despite continuing to operate in an environment with lower retail traffic, our stores are generating $2.1 million in revenue on average, on an annualized basis, with four wall margins in line with our historical target of 35%. We've finished the quarter with 2.26 million active customers, an increase of 5% versus the same period a year ago, and our average revenue per customer increased 7% year-over-year to $258. We maintained a consistent e-commerce growth profile, despite dropping marketing spend by 26% year-over-year, from $20 million to $15 million and from 14% of revenue in Q3 last year to 10% of revenue in Q3 this year. We added 36 net new stores over the course of the last 12 months, going from 154 stores as of September 30, 2021 to 190 stores as of September 30, 2022, or an increase in our store base of 23% year-over-year, which naturally leads to an increase in store rents, and depreciation from store build outs. This compares to Q3 2021, adjusted SG&A of $75 million or 54.6% of revenue, an increase of approximately 60 basis points of revenue year-over-year. For the third quarter of 2022, we generated adjusted EBITDA of $11.9 million representing an adjusted EBITDA margin of 8% which compares to adjusted EBITDA of $11.2 million or 8.1% of revenue in the year ago period. For Q4 2022, this full year guidance implies revenue of $138.2 million to $144.5 million, an increase of 49% year-over-year and adjusted EBITDA of $6.2 million to $8.4 million and adjusted EBITDA margin of 4.5% to 5.8%. At the high end of our updated range for adjusted EBITDA in Q4, we're projecting adjusted EBITDA of $8.4 million or 5.8% of revenue, which translates to H2 adjusted EBITDA of $20.3 million or 6.9% of revenue."
}