{
    "symbol": "WRBY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 11:24:06",
    "content": " In addition to serving our customers better through our expanding retail footprint and driving adoption of our industry-leading digital tools like our Virtual Try-On and Virtual Vision Test, we'll continue to drive growth by launching new products, and scaling our existing product offerings, in particular: Progressive, Contacts and Eye Exams; all areas in which our business still represents just a fraction of the broader market. Let's jump right in and talk through top-line performance for the quarter revenue for the first quarter of 2022 came in at a $153.2 million, up 10.3% versus the first quarter of 2021 and up 18% on a three-year CAGR basis versus the first quarter of 2019. Our growth in top line and average revenue per customer for the quarter was driven by a number of factors, including a consistent replenishment cycle of our core prescription glasses offering, as well as continued progress in growing our contact lens business, which while up 400 basis points compared with Q1, still only represented 7% of our business overall in Q1 '22. As we mentioned on our fourth quarter earnings call in March, our Q1 2022 revenue and year-over-year growth rate reflects the impact of approximately $15 million in estimated lost sales due to the effect of Omicron on store traffic and the recovery time needed for consumers to re-book eye exams and return to stores to purchase glasses. Lastly, we saw a benefit to gross margin from the expansion of our higher-margin progressives’ business, which has increased from 18% of our prescription business in Q1 last year to 21% in Q1 2022. This compares to Q1 2021 adjusted SG&A a of $79.2 million or 57% of revenue, an increase of 580 basis points year-over-year. The primary driver of the increase year-over-year and adjusted SG&A as a percentage of revenue was related to an increase in corporate overhead expenses, mostly related to costs we incurred to operate as a public company, which we did not incur in Q1 2021 and investments in our technology infrastructure, as well as an increase in salary expense for our retail employees due to the growth in our store base. Would also just add that from a product mix standpoint, we tend to see a higher percentage of contacts mix from our online orders and a higher progressive mix from our store transactions; and so given the impact of Omicron and its particularly detrimental impact on store productivity, that balance between contacts and progressives, which had opposite impact on gross margin, is not the mix of transactions that we would expect in a typical quarter."
}