{
    "symbol": "AMPS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 12:09:04",
    "content": " What makes project management particularly attractive to Altus Power is that each of these 200 local offices have extensive experience managing projects for occupiers and tenants, real estate owners and investors across diverse vertical markets, including a strong resume of completed solar energy storage and EV charging projects. And then I would also highlight of course, that we have a significant chunk of opportunities that are in the negotiation bucket, which is essentially assets we're looking to turn into closing opportunities, but there's a robust pipeline of operating acquisitions that we think are going to be able to be closed in the relatively near-term for the closing, and then moved into closing in the relatively near-term negotiation assets, but let me turn it to Lars for the development pipeline. So some portion of this is likely to be coming on in 2022, in fact, some of it in the near-term, and some is likely to spill in to 2023 on the 36% that's in contract/negotiation on the development side, some of that is more near-term construction projects where much of the work has already been done by a third-party, and we could see some of that come on in 2022 as well with the remainder coming in 2023. And then finally, I'd add just importantly that there is a very large storage opportunity that we haven't yet talked about on the call, but the inflation reduction act for the first time includes a standalone investment tax credit for battery storage and that's significant not only as it relates to new projects, but also the opportunity that Altus Power has to look at its existing portfolio. The fact that we are now as we've announced previously active in Europe, calling on utilities, seeking interconnection for buildings that CBRE investment management owns, whether it's in France outside of Paris or Germany or elsewhere, we want to see systems move into construction and then be able to communicate back to the market that not only is there a big forward here in game-changing, it's exactly how we feel about it, but we've begun the process of actually permitting and then building those systems wherever they might be."
}