{
    "symbol": "JCI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-04 11:54:17",
    "content": " Our results in the second quarter reflect solid top line execution as we delivered strong sales orders and backlog growth in line with our expectations and at the high end of the guidance we provided demand for digitally enabled equipment and services that solve for sustainability and energy efficiency, remains robust and our sales teams are doing an outstanding job capitalizing on that demand. We're also seeing the benefit of the discipline we've instilled in our pricing capabilities over the last two plus years, price realization continues to accelerate, contributing nearly six points to overall organic revenue in the quarter. We expect the headwinds related to supply chain to skew slightly more towards the third quarter, with EPS expected to be in the range of $0.82 to $0.87, which assumes organic revenue growth of high single digits and a segment margin decline of 80 to 100 basis points. We're up 18% with a two year stack, strong demand for the vectors of growth from services and sustainability, indoor, environmental quality, and that's in North America. And I think as I think about not only completing 2022, but the setup we have for 2023, with the margin that we put into backlog, and we're seeing that in our Global Products with the book and bill business, we've seen tremendous agility relative to pricing, and we've done the same in our field-based businesses, although there's a little bit of a lag, that we're going to be set up for not only strong high-digit – a high single-digit pricing. But if you look at the underlying trends, order growth, 13%, 18% on a two-year stack, backdrop growth, 40% services growth 7%, sustainability infrastructure two-year stack, 60%, SE Building orders growth 85%. And if you look at today at demand signals, and we have – we put together a slide on this in our slide deck all indicators are actually resonating well with our customers; service, sustainability, healthy building due to the complexity of the North America supply chain we are having more headwinds that we have elsewhere in the portfolio. Our sourcing team and looking at all components that come out of that supply chain supporting the rest of the world, and so as we look at the lockdowns impacting other parts of our business it's minimal at this stage, although we're watching this closely, the Shanghai port is, I think operating like a 40% capacity and making sure that with what is left that we're – we've got contingency with other supply, but I feel really good about that."
}