{
    "symbol": "JCI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-03 13:24:06",
    "content": " Segment margins in the quarter were 14.7%, a sequential improvement of 400 basis points driven by increased volume leverage and the execution of projects with an improved book-to-margin profile, a direct result of the pricing discipline implemented earlier in the year. Segment EBITDA margin declined 160 basis points to 9.4% as a result of unfavorable region and project mix, along with continued FX headwinds which offset favorable volume leverage and the benefit of cost savings during the quarter. Orders increased 3% driven by low-double-digit growth in services, install orders remained flat year-over-year, backlog of $1.6 billion declined 2% year-over-year. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. We've been â\u0080\u0093 I would say now, as we look at our run rates of being able to reduce our backlog, we're now getting suppliers aligned and getting firm commitments that we can meet these run rates to ultimately bring this backlog down and achieve the growth that we're positioned to achieve in 2023. But we do â\u0080\u0093 this is â\u0080\u0093 we've got everyone lined out to a recovery rate here for second quarter, so that as we position for third and fourth, which is our seasonal high quarters, we're going to be well positioned not only to have recovered our backlog, but now to be positioned with lead times that are very competitive in our ability to be able to take on additional volume in the second half of the year. Your line is now open. So when we look at backlog and we look at our run rate, we're pretty well positioned here through the first quarter because of our backlog and the run rates that we're achieving across each one of these product businesses, we're actually trying to â\u0080\u0093 on these markets that are unconstrained, meaning that there's even more growth that we can go after if we can commit cycle times that are lower. Your line is now open. Your line is now open. But we're completely confident that we have the right product technologies, combined with now OpenBlue in the way that, that now is accelerating, our ability to be able to build services and recurring revenue and really attack what we see to be very attractive growth vectors, which is decarbonization, sustainability, healthy buildings and more around this whole â\u0080\u0093 how do we create autonomous buildings that is an incredible value proposition that we can bring to our customers."
}