{
    "symbol": "RDY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-01-28 13:25:21",
    "content": "  Operator: Ladies and gentlemen, good day and welcome to Dr. Reddy's Q3 FY2022 Earnings Conference Call. As a reminder, all participant lines will be in listen-only mode. And thank you for joining us today for the Dr. Reddy's earnings conference call for the quarter ended December 31st, 2021. Earlier during the day, we have released our results, and the same are also posted on our website. To discuss the business performance and outlook, we have the leadership team of Dr. Reddy comprising Mr. Erez Israeli, our CEO, Mr. Parag Agarwal our CFO, and the Investor Relations team. Please note that today's call is a copyrighted material of Dr. Reddy's and cannot be rebroadcasted or attributed in press or media outlet, without the Company's express written consent. Before I proceed with the call, I would like to remind everyone that the safe harbor contained in today's press release also pertains to this conference call. We had yet another quarter of good performance in terms of year-on-year growth in revenues and profits, vitamin gaining healthy EBITDA margin, and generating good cash flows. For this section, all the amounts are translated to U.S. dollar at a convenient stock  rate of 74.39, which is the rate as of December 31, 2021. That is $715 million, and grew by 8% on year-on-year basis and declined by 8% on a sequential quarter basis. Sequentially, our revenues were impacted on a higher base of Q2, which had a higher contribution from over limited products. Consolidated gross profit margin for this quarter has been at 53.8%, which was flat over previous year, hard over the margin increased by 40 basis points on quarter-on-quarter basis. The end unit spend for the quarter is  growth that is $207 million, an increase of 7% year-on-year, and a decrease of 3%, quarter-on-quarter. But year-on-year increase is in line with our business growth, and on account of continued investments in sales and marketing activities for banks in India and emerging markets. As a percentage of sale, our SG&A has been at 29%, which is lower by 20 basis points year-on-year. The R&D expense for the quarter is Rs 415 crores, that is U.S. $56 million, and is at 7.8% of sales. The present development activities continued normally during the quarter, and we continue to build a healthy pipeline of new products across our markets. The EBITDA for the quarter is Rs 3,266 crores, that is USD $170 million, and the EBITDA margin is 23.8%. The EBITDA margin for the 9 months in this fiscal, is at 24% and is closely tracking our exploration target of 25%. Consequently, our profit before tech stood and increased 971 growth, that is $131 million, which is a growth of 242% year-on-year and a decrease of 23% quarter-on-quarter. Adjusted for the impairment charges, our profits grew by 10.7% over previous year. Profit on net for the quarter stood at 770 growth, that is $95 million. Operating working capital decreased by Rs 512 gross, which is USD $69 million, against that on September 13, 2021. Our capital investments during the quarter 293,414 crores, which is $56 million. The free cash flow generated during this quarter with a net inflow of Rs 1,234 crores, which is $171 million. Consequently, we now have a net capital of between 998 that is $134 million as of December 31st, 2021. Foreign currency cash flow hedges in the form of derivatives for the U.S. dollar are approximately USD 360 million, largely hedged around the range of Rs 75.4 to Rs 78.9 to the dollar. Australian dollar of $2.5 million at the date of 815.74 to the Australian dollar and South African grand 36.9 million at the rate of Rs 4.97 to South African rand, maturing in the next 12 months. With this, I now request Erez to take us through the key business highlights. And both EBITDA and our fee margins are closer to our exposition and target of 25% each, while we continue to invest in our future growth business. We have been able to achieve this inspite certain industry level headwinds like the higher level of price erosion across the Generics segment in the U.S. market, increasing commodity prices, and higher freight costs. We also generated significant cash flow during the quarter, and are now having a cash Netscape surplus, which will enable us to invest for future growth. Our North America generic business recorded sales of $248 million for the quarter, with a EBITDA growth of 6%, while the sequential quarter decline of 2%. During the quarter, we continued to gain market share for some of our key products, including a recent launch of  subjects. However, the sales were impacted due to price owing to some of our products and has been the case for entire sector. Our Europe business recorded sales of $ 47 million Euros, and was largely flat both year-over-year and sequentially. During the quarter, we launched four new products in Germany and one product each in France and Ireland. We are expecting fuel good launching during Q4, which will enable us to return to growth in this market. Our emerging market business recorded sales of 1,154 crores rupees with a strong year-on-year growth of 20%. However, reduced on a sequential decline of 11% within the emerging markets, the Russia business grew by 2% on a year-to-year basis and declined by 80% on the quarter-to-quarter basis in constant currency. As informed earlier, the Q2 performance in Russia was very strong, which supported the seasonal demand and launch of biosimilar  And the rest of the world market sales were supported by one-offs sales of the COVID-related products. During the quarter, we launched 60 new products across various emerging markets. Our India business recorded sales of 1027 crores rupees, with a year-over-year growth of 7%, and sequential decline of 10%. Adjusted for COVID-related portfolio sales in previous year, and the last quarter, the  performance has been fairly strong and in line with expectations. During the quarter, we launched 4 new products in India market. As per our  report of December 2021, we have grown higher than the market at 23.1% on net basis against market growth of 18.1%. Our PCI business recorded sales of $97 million with a year-over-year growth of 2%, but sequential quarter decline of 40%. During the quarter, we filed 32 drug master files globally, including 2 filing -- a filing made in the United States. Our -- as of December 31st, 2021, we had 1,991 minute filings pending for approval within the use of DA, which include 88 under and 3505 between . During the quarter, we have signed a deal with  for commercialization of our biosimilar  in the United States. Earlier, during the months we have launched molnupiravir in India, expanding our portfolio to fight against the on-going COVID pandemic. Actually, back to Sputnik, we are now ready with capacities in India. Consistent with our aspiration and healthy balance sheet, M&A remains an integral part of our growth strategy, and therefore, we are actively pursuing few deals across our focus yield. Going forward, we are looking to double down our efforts in very critical important areas of innovation, as well as ESG. There is a deep focus to deliver on the short-term and long-term gross results across our businesses, and we remain committed and optimistic about this. In November 2021, we were position number 9 among pharma company in the world in the Dow Jones Sustainability Index 2021. During the quarters, we also recognized by the UNWAP for gender inclusivity in the workplace. Our HPA  P1 manufacturing plant in  was honored with the prestigious National Energy Conversation Award by the Bureau of Energy Efficiency, a minister of power government of India. We have been recognized as the most innovative Company for the year of 2021, at the CE2 industrial motivation -- Innovation Awards 2021. Earlier this month, we won a prestigious APEX Awards, sustainable corporate of the year at the 2021  sustainability Company . As you can see here, this should continue to remain our focus area and we are going to increase results in that action. With this, I would like to open the floor for questions and answer. Ladies and gentlemen, we will now begin the question-and-answer session. So the first question is, on the U.S. you have maintained that the calculation has been  but if you do a back calculation, is the prices on a sequential basis, it's somewhere in the  U.S. on this quarter? But in the Q4, a relatively larger number of products with competition and the investors ' work on the overall basis, it's more likely double-digit. But despite that, we're still growing. So we managed to offset this origin with new products, with market share, as well as with productivity activities. So this is still  and the growth of about, I think now nine out of ten quarters we are growing in the year. And this will continue to be account of the nominals in the future, in which I do see growth, maybe slower than other markets but we are still going to grow in . It was primarily in the second quarter, not so much in the third quarter. In this respect to the main contribution of this portfolio will be in the second, as well as in the fourth, not so much on the fourth. And in  there was contribution influx \n In the third quarter, not so much. That's why on the sequential basis, when you compare India, that's why there is a decline, because it was relatively large contribution during the second quarter, but not so much in itself. The second day I remember looks very much like affected by the Delta, where this one is the Omnicon with in-between, and actually there was no another way before, not so much demand. So all the activities around the intervention, whether it's vaccines or  as well as community treatments, whether it's the full vaccine, we have , and additional products that we are working on. Naturally, we don't know how the -- this pandemic really work. It's how to predict how it's going to be, but we are prepared for this. We will continue to grow in the spirit that we have discussed in the past, double digit growth, 25. It is -- you just mentioned about double-digit price erosion in the U.S. Could you give us some color on how this is trending in the quarter, given that this product  should we see this a bit into more normalized price erosion? So the business model will not change, but in terms of the products that were affected by that, I believe that most of the effect is behind us. But if you look at our genetics cross margins, these  improved close to about a 100 basis points in quarter-on-quarter. Any color on -- I am still -- despite the fact that we had headwinds in terms of raw materials cost, etc. First, launch of the products which will change the mix, so to improve mix. Second, is productivity activity that we're doing on cost improvement programs and others, and third, is market share with the relevant products in which we have the productivity. So we were preparing for us and for these phenomena, and like I mentioned in my script we are growing despite of those  So I'm not so concerned about this going forward. Yes, in the quarter 2, there was a relatively higher demand because it was very much affected in the time by the Delta wave. And this quarter, luckily, there was no such a demand in India. And so what we are going to see is the contribution in India in Q2, as well as we are going to see some in Q4 because of the  But Q3 was very less. We can export the products, the vaccine as well as the other products. In Q3, we did not export the COVID products. Thank you so much. And we saw it in three areas with some commodity intermediate, especially on the  folding us in the API. The second is in the energy cost, especially  few months ago, especially in India. I believe that the trend is behind us in a way that will not confuse with the additional hike invest money to  Some of the prices did not go down yet to the original level, but I don't anticipate additional inflation in depth magnitude . That's not as one can predict, it looks better now. How to predict the pandemic and the geopolitical situation in the world, assuming no other big event, which would be \n Thank you. We have Rituximab, which is -- we have now intercommercially with most of the noble market. The  and the additional for biosimilars, they're primarily for emerging markets. As I shared in my script, we signed a deal with United States and we did -- and we will see if we will do it by ourselves. So Rituximab is going to be our first global products, and we have, right now additional three products in clinical trials, as well as additional products that are in the pre -clinical stage. So overall, it's a healthy portfolio to cover us very nicely from above 2024 until 2031-2032 in which we will launch all of these products. We did not receive any feedback from the USFDA as of today, and we normally takes 90 days and 90 days of view in sometimes next week. So we need to -- around that date, we'll probably get a feedback. My first question it would be on this three  seatings, which we helped off debt, that would be -- mostly be commercialization in Q3, FY2022. Which -- really, Ashini, we couldn't get your question. So the question is on the  resting, which we have the pre -filled syringe, which we have been -- we'll be launching in Q3 of FY2022. and basically, they have  for calendar 2022 launch. So as of now, that's the status. And my second question would be a bit odd, but, actually, I wanted to understand on that part. Thank you so much. The next question is from the line of Surya Putra from Phillip Capital, please go ahead. So, just on the pricing rising situation in the U.S. wanting in turn, is it largely due to Dr. Reddy's specific that double-digit price risen situation? Is that the situation or it is broad-based, double-digit, kind-of price arisen and that you have in U.S.? It's the business model in the United States, so naturally every company is facing collapse erosion. And, I think, the propulsion of the price erosion is very much based of how many of your products are  efficient, and what is the timing in which the customers are issuing the other piece. So the -- in our case, we had, as we launched, let's say in the last few years above 84, that's United States, so naturally, those boards by design would face competition. So let's say that's why percentage per se, is less -- for me, at least, indicator of the health of the business. And so far, it's pretty healthy and we are maintaining the margins and even growing little bit connected despite of it. But in the recent times we have obviously thought about diversifying our focus towards the  market, new market in China and all. And also, accordingly reducing of R&D spend focus targeted for the U.S. market. And so we have been investing in other markets for growth, in India  markets, and this is providing us by using the same fixed assets based on portfolio assets, our knowledge, etc. And yes, I think it's fair to say that these markets will grow faster than years. The other emerging markets, India will grow faster than United States. So therefore, then the average way to United States will decrease -- is decreasing already, and will decrease over time. So whether we have been -- and we have already launched the product in Canada, and that is also  in signs market for this product. Whether we had been the appropriate number of , the kind of revenue that the product could have generated out of Canada market, and then we have achieved the right signs for revenue out of it, effect will take longer time to achieve that peak bookings and open the market from the SME. And you calibrate will take a bit longer because in the way that the Canadian process is working,  is directing each one of the relevant provinces in Canada. And then, for each one of them to participate in the relevant sales processes with the tenders or other mechanism in which each one of the states is providing. Of this, suspecting a bit longer. It's not the Day 1 launch that we have -- you see in the United States, in that respect. In any case, the launch in the U.S. and the launch in Canada are unrelated, as the launch the U.S. is part of a certain  while in Canada, it's naturally a free market situation. Last but not least, we are going to launch these product not just in United States, we are going to launch it also in Europe, as well as in some emerging markets. The next question is from the line of Sameer Baisiwala from Morgan Stanley, please go ahead. The first question is for bank which in the U.S. Good job done on the market share gain, I think it's not stabilizing around 11% - 12% for last few weeks. And the -- and in terms of supply, it is not constraining us at this stage. But so that's little counter intuitive because generic is lower cost -- lower priced, so most of the time customers are too happy to take generic product. Will continue to be an important market for us, and there -- unless there will be any -- hopefully not, I wish not, but if there will be any adversity, we'll have to accordingly be prepared for it, and we are. One final question, if I may, which is on your Health Tech platform. We are now present in five cities, went to 10 cities in the next few weeks. And accordingly, will be the roll-out of the companies that will join this platform, so our main way to grow this business is by convincing the companies to work with us and the engage  and basically insured by our insurance in these product. And of course, holding out the roots and we say, by contributions as well as  groups to provide excellent service. This is very neat projects and I'm very proud of the beginning and the delivery, delivering it very much. Thank you so much. The next question is from the line of Shyam Srinivasan from Goldman Sachs, please go ahead. In your opening remarks, Erez, you mentioned we expect performance to improve quarter-on-quarter. So if we are taking out the, I like to call it COVID-related behavior by companies  in the business  consumption, the main driver of growth will be the launches that will be in the marketplace of FY2023, FY2024, and FY2025 by the customers, both by internal use as well as external use. And if we use the , meaning the top products that used to drive this are going to be changed by products that will be launched in that area, which will be one, more profitable and second, the biggest in their size. And we are very much believing it, so most of the savings that is done now are small projects which are in Phase 1 and early Phase 2 and naturally some of this products will come to Phase 3 and beyond that. And of course, sales as a growth driver for the CDMO, CMO type of the business, which is as I discussed in the first part of our  to activities and it's seeding and picking up. And the PCI, and it's picking up, and with launches of pharmaceutical products that we are serving in Japan, as well as in some Middle Eastern and African countries. At this stage of the two sections are not big, we're not going to give yet a specific proportion. And right now, still most of the PCL comprised of API, of the API in consistence. And in the case of Q2, it was a comparison, some COVID  as well. Second question is on the Sputnik V. Some of the early comments, you said that actively looking for register  of booster, right? Yes, we will -- we'll have to get approval from the authorities here in India for the protocol of the trial. And the base on this -- pending this approval of the protocol, we will advertise with other vaccines  as another option, both private as well as the government for the booster in the future. India, naturally, as well as the emerging market in United States and Europe, in all of those geographies, there are now active projects. Some of them can be faster and within the next few weeks, if of course will be concluded. At the same time because we're very comfortable financial situation, we are planning to use that, so now let's see which of the projects will be -- actual events when it come to conclusion. From the Sputnik you said, obviously we have got permission from the government to export. I cannot specify now a specific number, but we -- but no restrictions that will prevent us to export. It depends on the type of approval that we left  for that, for example, if the Sputnik  will be approved eventually, as the vaccine will be  into that as a booster supplement to get the booster for other products, then we look at  WHO. If all of this will happen, it can create a nice opportunity for us. We can export, but naturally, our customers will not buy at all that is not approved for use in development markets, and for the relevant patients that want to use it. They should be approved in that specific country for the use, either as a vaccine or as a booster. But actually, I do understand, this productive approved from most of the Scandinavian countries. This is not part of our agreement with the Russians, so this will come directly from Russia not from us, with this type of markets. The next question was on this  year participant after this, but I missed data. I did not get the question, sir. Yes  basically, the near  as mentioned, are indicated with the calendar 2022, is when they expect to launch the product in both Europe and Europe market. But obviously, we don't have the specific dates. As I mentioned before, if the price erosion and the magnitude for price erosion is not top down, it's bottom up, meaning these depends on the products that is facing this specific competition. And in our case, most of our portfolio , so likely that we'll not going to see a number around for these specific products and hence it will probably come down. So it's not a top down, it's a bottom up. Mr. , do you have any further questions? , asking, one thing happening that's one of the , but have we supplied any initial inventory to Brazilian , or it will happen once the  come down. So just to serve as part of the deal, all the , all the activities of these more level than . And therefore, are just had certain financial arrangement which was in  Once they will go, we will enjoy extreme value of this will come from the launch. So we're not supplying and not involving the launch, and we are not aware of the date. Just one final question, how are you thinking about your indictable portfolio for the U.S. market? And the answer is yes, we do have a -- this complex generic assets as part of the efforts. Overall, the injectable and the  generic will drive the growth in the United States on the generic and to grow faster than the retail product. The PI was not related to specific products like that, but naturally, when hear the PI, they're not checking on you just specific products we are checking the entire sire. Thank you so much. Ladies and gentlemen, we take the last question from the line of Alok Dalal from CLSA. Good evening,  question forward on Bovada. And the second, we are -- and so this stage, we are not looking for some others that we don't have the sites. But these sites are very First, important for the growth in the united, but not just next year, but also in years to come. We did not finish all the evaluation, but unlikely that you'll see launch in the next few months. I believe that at least, I don't think likely to see a launch in the next few months. Ladies and gentlemen, that was the last question. In case of any  please reach out to \n Thank you very much, sir. Ladies and gentlemen, on behalf of Dr. Reddy's, that concludes this conference."
}