{
    "symbol": "OBNK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-29 13:45:27",
    "content": " With the addition of BTH, we showed impressive loan growth again this quarter with 14% annualized growth while applying strict underwriting standards to our process and continue to show improvement in our net interest margin, which was up approximately 40 basis points for the second quarter in a row. Adjusting for BTH and excluding mortgage warehouse, loans grew $215.3 million or 3.5% compared to the linked quarter. In the third quarter and adjusting for BTH, we showed an increase of non-interest-bearing deposits of $91.2 million or 3.5%, which is 14% annualized. For Q3, we increased our allowance for credit losses from $63.1 million to $83.4 million, resulting in our reserve to loans held for investment increasing from 1.25% to 1.29% net of mortgage warehouse. During the third quarter, our total yield on loans held for investment increased 68 basis points, which includes the impact of $1.4 million or approximately 7 basis points from BTH purchase accounting adjustments recorded during the third quarter. Of the total $19 million increase in net interest income during the quarter, $11 million was attributable to BTH, with the majority of the remaining change from increased yields and volume on loans. The increases this quarter are primarily due to $2.8 million of merger-related expense, $2.3 million in salaries and employee benefits from the additional BTH employees, $1.3 million amortization of intangible assets from the merger, $2 million from BTH operational expenses other than those I just mentioned above, and $1 million increase in our incentive accruals due to exceeding performance matrix. It looks like in the third quarter, the legacy end-of-period deposit balances contracted, but I think Lance mentioned in the prepared remarks that the NIB deposit growth was really strong ex the BTH. So, as long â\u0080\u0093 as far as loan growth ex mortgage warehouse, I think we are going to see, letâ\u0080\u0099s say, a low-double digit growth through the fourth quarter, which is still surprising."
}