{
    "symbol": "OBNK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 14:39:02",
    "content": " Total loans held for investment, excluding PPP and warehouse were $5 billion which is a $336.3 million or a 29% annualized increase compared to the linked quarter. As Drake mentioned, backing out PPP and warehouse, we saw over $336 million of loan growth in the second quarter compared to last and $834 million compared to the same time last year. We've increased over $450 million compared to the second quarter of last year, and NIBs now represent almost 35% of our total average deposits. During the quarter, classified loans held for investments decreased $18.3 million, a 26% reduction from Q1 2022 levels and represented 0.94% of total loans held for investment, net of PPP, compared to a level of 1.36% as of Q1 2022. We are also pleased to report a $7.1 million or 33.5% reduction in nonperforming loans held for investment to total loans held for investment, net of PPP, coming in at 0.25% for the quarter down from a level of 0.41% for the prior quarter. Excluding PPP and mortgage warehouse loans, our net interest income increased from $46.2 million to $54.2 million or 17.4% quarter-over-quarter. So when we kind of talked at the beginning of the year, I think we really thought we would be 10%, 11% loan growth â\u0080\u0093 feels like some of that in the back half of the year maybe gotten pushed into the quarter as you look at a lot of the banks, it seemed like there was extraordinary growth for all the banks. We still have a strong pipeline as we kind of sit here and work on our forecast, we're thinking $100 million loan growth in Q3 and another $100 million in Q4, not counting PPP or warehouse. But for us, I'm looking at a net interest income, I think, it's going to be in, let's say, the $64 million, $65 million range when we look at what we expect pipeline and the impact of interest rates on our NIM, I think it's going to be in that mid-3% range through the end of the third quarter. I think BTH impacts it, but we we're going to try to drive this organization to annually see 8% to 12% growth in loans, and we took advantage of some significant opportunities in the third quarter."
}