{
    "symbol": "TESS",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-28 12:22:03",
    "content": " Since then our focus has been to drive revenue growth by delivering excellent service and value; direct our investments on higher growth markets, mainly 5G and wireless; improve gross margins by adding differentiated value through Ventev, Tessco Observer, pricing discipline and by growing our business via tessco.com; grow EBITDA utilizing TESSCO's operating leverage and to implement the new ERP driving new revenues and improving our operating efficiencies. Additionally, we remained focused on driving profitable growth resulting in a $2.4 million year-over-year improvement in net income and a $2.5 million improvement in adjusted EBITDA. Additionally, Ventev has introduced several new products this past quarter, a new solar system for 60 and 90 watts, which supports PoE devices, a stainless steel version of a Cisco design enclosure that is popular with customers and can be used both indoors and outdoors, antenna and cable and site hardware with factor  jumpers typically used in the automotive industry, a Wi-Fi 6E Omni, and directional antenna to support Cisco AE applications and a 300 to 6,000 hertz omni ceiling antenna, as well as low BIM  tappers. Gross margin was 20.1% of revenues for the second quarter of fiscal 2023 compared with 18.2% in the second quarter of the prior year, largely as a result of favorable customer and product mix, including a 25% increase in sales of Ventev products. Second quarter fiscal 2023 selling, general and administrative expenses increased 8.1% from the prior year quarter to $22.7 million, primarily as a result of increased variable expenses associated with 11% increase in revenues. Accordingly, we are reaffirming our guidance for fiscal year 2023, which is as follows; revenue of $450 million to $475 million, which would represent growth of 8% to 14% and net loss of $5 million to $2.1 million, which compares to a net loss of $3.3 million in fiscal year 2022, and adjusted EBITDA of between $4 million and $7 million, which compares to $0.3 million in fiscal year 2022."
}