{
    "symbol": "SLVM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 16:24:02",
    "content": " On a quarter-over-quarter basis, we increased adjusted EBITDA by 14% to $216 million and we grew our margin by 160 basis points. Our adjusted EBITDA of $216 million, represents a margin of 22.3%, the highest margins level we have achieved. We generated $114 million in free flow, which was an increase due to higher earnings, less capital spending and a reduction in working capital. As Jean-Michel said earlier, we earned $216 million in adjusted EBITDA in the third quarter. This is a 160 basis point improvement and was driven by $60 million in price and mix improvements, as realization of price increases exceeded our outlook and we continue to drive mix optimization. Input and transportation costs increased by $46 million as costs for energy, fiber and chemicals continue to increase. The divestiture of our Russian business allowed us to avoid a $220 million recovery point of projects, reduced our exposure to the most cyclical market pulp segment by 30%, and significantly decreased our geopolitical risk and uncertainty. This purchase price represents an attractive price, and we expect more than $20 million in synergies and an internal rate of return greater than 25% and it will be immediately accretive to our earnings per share and free cash flow. Using the last 12 months of adjusted EBITDA as of the end of June, the transaction multiple is 2.5x and is expected to be below 2x after $20 million in synergies including the pulp mill project previously mentioned. We estimate $15 million onetime cost and capital to achieve the synergies and $14 million in information technology, transition services and other integration costs. In the fourth quarter, we project price and mix to improve by $30 million to $35 million as we continue to realize prior price increases in all three regions. All in, we expect to deliver fourth quarter adjusted EBITDA of $180 million to $190 million which would put us slightly below at the low-end of our full year guidance of $740 million to $780 million. Under the revised agreement, our annual restricted payment limit was increased to $90 million from $75 million as long as our gross debt is less than two times our adjusted EBITDA. Well, we said that the $1 billion target because we felt that that would allow us to continue to invest through the cycle in high-return projects into the business and it continue to improve our business and also, return cash back to our shareowners. Last year on your fourth quarter -- going into the fourth quarter you expected operations to hit $15 million, because of normal seasonality. I realize you have $150 million going out the door, but you're getting so much free cash."
}