{
    "symbol": "SLVM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 12:28:04",
    "content": " We expect to generate $725 million to $775 million in adjusted EBITDA and $160 million to $180 million in free cash flow this year, if we exclude our Russian business for the full year. Implementing the strategy generated free cash flow of $73 million, enabling us to pay down $33 million in debt and to increase our cash balance by $49 million, all-in-all, another strong performance by our team, in dynamic industry conditions. First quarter net sales were $977 million, reflecting seasonally slow volume in Eastern Europe and Latin America. As Jean-Michel mentioned, we successfully conducted planned maintenance outages at our Eastover and Três Lagoas mills and spent $26 million less on outages, than in the fourth quarter. Input and transportation costs increased by $24 million, with rising costs for chemicals due to energy impact along with higher fiber and distribution costs. We expect input and transportation costs to increase by $10 million to $15 million, largely due to the higher cost of natural gas in North America and increasing diesel costs affecting the delivery of fiber in Latin America. As Jean-Michel mentioned, we generated strong free cash flow in the fourth quarter $73 million. As I mentioned, we are generating sufficient cash this year to fund more than $300 million in capital spending, inventory payments and onetime spinoff costs. Our 2022 capital spending plan, includes $20 million for high-return cost reduction and strategic projects, with internal weighted returns of greater than 25%. Since we will not proceed with the $220 million Svetogorsk's recovery boiler project, we're advancing high-return projects outside of Russia to be included in our strategic plan going forward. Even excluding Russia for the full year, we are on a path to generate $725 million to $775 million in adjusted EBITDA for the full year and we project $160 million to $180 million in free cash flow. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}