{
    "symbol": "BSAC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-03 20:58:05",
    "content": " The margin increased 9% year-over-year due to a better mix of funding and loan growth, based (ph) in this segment's strong increased by 15.1% year-over-year, led by card fees due to higher usage and increased customer base, as well as fees generated by Getnet. Under this base scenario, the Bank's NIM in 2023 should reach 2.8%, starting below this level in the first quarter of 2023 and rising back to levels of 3.6% by the end of this year. So in the quarter basically the main source of risk weighted assets contraction, let's say, that main -- the overall risk weighted assets stay flat for the year was the market risk with assets. And at the end, managing this is a matter of what trajectory of fitters' rate the market has implied in the prices because basically we can changed this by adapting the sensitivity by paying fixed rate or reducing fixed rate and basically today, we see that what the market is implying, it's close to our base case scenario in terms of inflation and trajectory for interest rates. Second quarter inflation, UF inflation is always seasonal a little bit higher, but basically NIMs of like 2.6, 2.7 in the second quarter, third quarter 2.9, fourth quarter 3.6, more or less that depends on your interest asset earning growth as well, okay. So basically in 2024, once again, it's quite  we're looking back at NIM, the 3.3%, 3.5%, okay, or at least where we left off in the fourth quarter. So therefore, that's why we finished the year with a cost of credit of 1% but in the last quarter, 1.2% and we think for this year, the average will be 1.1% 1.2%, okay? So as we're seeing the weaker economy now and then picking up at the end of the year, sometimes there's lags and asset quality, but I would say that it's going to be probably higher in the beginning of the year coming down towards the end and obviously that the goal of the bank is to reach a cost of credit of 1% in 2024."
}