{
    "symbol": "SMBC",
    "quarter": 1,
    "year": 2023,
    "date": "2022-10-25 13:01:15",
    "content": " Net interest income for the quarter was $28.5 million, an increase of $2.9 million or 11.2% as compared to the same period of the prior fiscal year. On the balance sheet, gross loan balances were up more than $257 million in the September quarter compared to one year ago at September 30, 2021 gross loan balances were up $695 million or almost 30%. Watch and special mansion credits totaled a combined $31.2 million at September 30, and we're up about $6.8 million during the quarter due primarily to one ag relationship being more closely watched. Nonperforming loans were just under $4 million or 0.13% of gross loans at September 30, down just a little bit as compared to June 30 and as compared to just over $6 million or 0.27% of gross loans one year ago. Nonperforming assets were $5.7 million, were 0.17% of total assets at September 30, down about $600,000 as compared to June 30 and as compared to slightly above $8 million or 0.31% of total assets one year ago. First item is our net interest margin in the September quarter was 3.65%, which included about seven basis points of contribution from fair value discount accretion on acquired loan portfolios and premium amortization on assumed deposits, or $520,000 in dollar terms. As PPP loan balances and forgiveness repayment diminished - accelerated accretion of deferred origination fees on those loans dropped significantly in the September quarter adding just $37,000 to interest income, which had no material impact to margin. In the year ago period, our margin was 4.01%, of which six basis points resulted from fair value discount accretion of $376,000 and PPP forgiveness caused us to accelerate accretion of $2.2 million in deferred origination fees contributing 34 basis points to the margin. Noninterest income was up just under $1 million compared to the year ago period, attributable to increases in servicing and other loan fees as well as deposit account service charges, and these were partially offset by decreases in gains realized on the sale of residential real estate loans originated for that purpose. Compared to the linked quarter, noninterest income was down $1 million on lower bank card interchange, loan servicing fees and net gains realized on loan sales decreased mostly in the sale of the SBA guaranteed portion, and also on non-deposit insurance product income. Our loan growth did accelerate in the September quarter and the growth of more than $250 million resulted mostly from multifamily residential, non-owner occupied commercial real estate, ag lines, construction and C&I. We expect growth to continue in the next quarter with our pipeline for loans to fund in 90 days at $230 million at September 30, down just a bit from a quarter earlier and up from $181 million reported at this time last year."
}