{
    "symbol": "SMBC",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-31 12:58:03",
    "content": " Net interest income resulting from accelerated accretion of deferred origination fees on PPP loans was significantly reduced as compared to the year ago period, adding less than 1 basis point during the current quarter as compared to 13 basis points in the year ago period. Net interest income for the quarter was $28.3 million, an increase of $3.2 million or 12.7% as compared to the same period of the prior fiscal year. Non-performing loans were just under $5 million or 0.16% of gross loans at 12/31, up 3 basis points as compared to September 30 the linked quarter and up 9 basis points from the period 1 year ago. Turning to our ag portfolio, ag production and other loans to farmers were down $27 million in the quarter as we saw expected seasonal pay-downs, but up almost $9 million compared to the same period of last year. In the linked September quarter, when we reported a margin of 3.65%, it included a similar benefit from fair value discount accretion of 7 basis points and a year ago when the margin was 3.77%, and we had 13 basis points of PPP origination fee recognition the benefit from discount accretion on acquired loans was 6 basis points. Non-interest income was up $171,000 or 3.2% as compared to the year ago period, attributable to increases in other loan fees, bank card interchange income, deposit account service charges, loan servicing fees and other income, which were partially offset by a decrease in gains realized on the sale of residential loans originated for that purpose. Our allowance or ACL at December 31 was $37.5 million or 1.25% of gross loans and 783% of non-performing loans as compared to an ACL of $37.4 million or 1.26% of gross loans and 960% of non-performing loans at the September 30, 2022, or linked quarter. The required PCL this quarter was driven in large part by an increase in available lines on construction and ag operating loans, requiring a larger allowance for off-balance sheet credit exposures, but it decreased from the $5.1 million PCL in the linked September quarter when a significant increase in outstanding loan balances required us to increase the dollar amount of our ACL. Just want to highlight that our loan growth of more than $18 million for the quarter resulted mostly from multi and single-family residential real estate, commercial real estate and a modest contribution from consumer loans partially offset by seasonal pay downs of the ag portion of our commercial loan book. We expect organic growth to remain modest in the coming quarter with our pipeline for loans to fund in 90 days at $122 million at December 31, down from $230 million a quarter earlier and down from $158 million reported at this time last year."
}