{
    "symbol": "LUMO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 20:36:12",
    "content": " So after the market closed today, we issued a press release announcing our financial results for the 2022 second quarter and detailing our progress advancing our clinical program evaluating LUM-201 for the treatment of idiopathic or moderate pediatric growth hormone deficiency or PGHD. Our interim analysis from the OraGrowtH210 trial will provide an early look at the safety and annualized height velocity, or AVH or AHV data at three dose levels of LUM-201 compared to a standard dose of recombinant human growth hormone in 40 patients at six months on therapy. So the data signal we will be looking for will be the annualized height velocity in these PEM positive subjects versus the recombinant growth hormone control arm, not historic comparisons to the height velocity and other trials that typically enroll more severely growth hormone deficient subjects. Therefore, the annualized height velocity values we would expect in the more modern idiopathic patient population enrolled in our trial will be lower in all treatment groups compared to for example, prior long-acting growth hormone studies. That is 0.8, 1.6, and 3.2 mg/kg/day to be used in a Phase III registration trial; and two, for the annualized height velocity to be numerically comparable to the recombinant growth hormone control arm in this trial; three, to validate our PEM enrichment strategy; and finally, four, to confirm safety and tolerability of LUM-201. As I mentioned earlier, our upcoming interim data readout will also include data from our OraGrowtH212 trial, our single site, open-label trial evaluating the pharmacokinetic and pharmacodynamic effects of LUM-201 in up to 24 PGHD subjects at the two higher dose levels of 1.6 and 3.2 mg/kg/day. This is an open-label, multi-center, Phase II study evaluating the growth effects and safety of LUM-201 following 12 months of daily recombinant growth hormone and up to 20 PGHD subjects who have completed the OraGrowtH210 trial. The response to the standard dose of growth hormone really are aligned in both of those analyses, and it's right around 8.3 centimeters per year, which is somewhat less than what you see in the more severe GHD kids who can grow 10, 10.5 et cetera centimeters per year. And so because we're really identifying the bulk of the population with idiopathic, we don't think that they have exactly the same growth potential as the more severe subjects who are studied, for example, in the height study that I ran when I was at Ascendis for example, and all the other long-acting growth hormone studies, which tend to favor enrollment of the more severe organic subjects over the less severe subjects. So if any of the three doses of LUM-201 produces height velocity curves that basically overlap growth hormone, I would say that if the mid and the top dose look very, very similar in overlap growth hormone that would push us to choosing the lower of the two doses as the optimal dose, whereas if there is a dose response, then given the good safety we go with the highest dose. So we will have a much better sense of what the non-inferiority margin we would propose would be once we see the final data in all 80 subjects â\u0080\u0093 well, the 20 subjects on growth hormone actually in our trial."
}