{
    "symbol": "LUMO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 22:03:04",
    "content": " Now after the market closed today, we issued a press release announcing our financial results for the 2022 first quarter and detailing our progress advancing our clinical programs for the treatment of patients with idiopathic or moderate pediatric growth hormone deficiency or PGHD using our daily oral therapeutic LUM-201. Secondary outcome measures include comparison of annualized height velocity of LUM-201 at 3 dose levels that's at 0.8, 1.6 and 3.2 mg per kg versus the control arm of patients treated with a recombinant growth hormone at a daily dose of 0.24 mg per kg a week. This is an open-label, multicenter Phase II study, evaluating the growth effects and the safety of LUM-201 following 12 months of daily injectable growth hormone and up to 20 PGHD patients who have completed the OraGrowtH210 trial. Now the OraGrowtH212 trial is our single-site open-label trial evaluating the pharmacokinetic and pharmacodynamic effects of LUM-201 and up to 24 PGHD subjects at 2 dose levels, 1.6 and 3.2 mg per kg a day. The objective of our 212 trial is to confirm prior clinical data, demonstrating the amplified pulsatile release of endogenous growth hormone, unique to LUM-201 and the potential for this mechanism of action to increase growth on the secretion across the entire dose response curve in the majority of PGHD patients. And based on the agency's review of preliminary safety and efficacy data from both OraGrowtH trials we have in progress, the FDA has lifted its partial hold and will now permit treatment with LUM-201 beyond 12 months. This peer-reviewed manuscript titled LUM-201, elicits greater growth hormone response than standard growth hormone secretagogues in pediatric growth hormone deficiency presents an analysis of data from a prior clinical study comparing the peak growth hormone response of LUM-201 to that of standard diagnostic growth hormone secretagogues in children previously diagnosed with growth hormone deficiency who are naive to treatment. The analysis demonstrates that in children with growth hormone deficiency, the growth hormone response to a single oral dose of 0.8 mg per kg of LUM-201 and that is the lowest dose administered in our OraGrowtH trials greatly exceeds that observed with standard growth hormone stimulation agents. In addition to advancing our clinical trials for LUM-201 in PGHD, we continue to explore expansion opportunities for LUM-201 into other rare endocrine disorders where injectable recombinant growth hormone is the standard of care. So tesamorelin, which is a peptide analogue of growth hormone releasing hormone is approved for patients in -- with HIV lipodystrophy, they published data on HIV patients with fatty liver and the impact that a daily growth hormone releasing hormone injection has on those patients and they've recently started a larger Phase III trial more broadly in the NAFLD space. So that's really the target that we are expecting to see with the standard dose of growth hormone the population we're studying in the 210 study, and we are hopeful that with the dose range that we are studying at LUM-201 that we will find at least one dose that looks to be comparable to that."
}