{
    "symbol": "O",
    "quarter": 1,
    "year": 2021,
    "date": "2021-05-04 22:23:07",
    "content": " But look, we're also blessed with a balance sheet, to lend grace to some of these operators, as long as we believe that their operating model is going to come through and it's going to be a viable business model going forward. But by and large, I would say we were pleasantly surprised when we underwrote all of their assets, all of their operators at the quality of the portfolio they had, and there was an art to be making, for whatever reason, and we're grateful, because it allowed us to create a lot of value for our business, that they were trading at a massive discount to what we believe is the inherent value, especially of their retail and industrial portfolio. That is the reason why we have always said that 98% is the right occupancy level for us because we are going to be repositioning assets where we can create, and these numbers get buried, but 140% 170% recapture rates on rent just because of these repositioning that we are able to do but yes, it takes time and yes, that means more, you're sitting on more non-occupied assets. And what we would like to be able to do is when we absorb VEREIT, is to be able to implement the same business model, which is a reason why we think we want to hold on to a lot of their folks and potentially share our business model with them, and tried to generate the same types of results that we've been able to generate on a standalone basis. You could, but that would be more of a function of the size of the platform has just increased rather than it getting disproportionately larger, because there's a lot more assets on their side that we would want to recycle that. But if you really dive in behind the numbers, and you try to figure out what is the product that they're being able to get through this development funding, takeout funding, whatever you want to call it versus what could they buy the same particular asset, if it were available today, there is still 100 basis points, maybe 50 basis points, if you want to be conservative optimist, that we are getting by partnering with some of these very well-established global developers. But yes, we can certainly have more of a mix coming from the UK given the lower cost there than the U.S. And then if you look at it on a fully consolidated basis, it's going to have the same profile that you would expect of an A 3 A minus rated company."
}