{
    "symbol": "CRL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 14:23:03",
    "content": " Revenue growth rate is expected to increase from the first quarter level, positioning us well to achieve our robust outlook for the year. Coupled with our growing backlog, we are poised to meet the escalating demand, which will result in a DSA organic revenue growth rate approaching 20% in the second half of this year. Based on the first quarter performance and an expectation that the robust business trends will continue throughout the year, we are maintaining our organic revenue growth guidance of 12.5% to 14.5% and our non-GAAP earnings per share guidance of $11.50 to $11.75 for 2022. As expected, the DSA organic growth rate improved by nearly 300 basis points from the fourth quarter level driven by the Safety Assessment business. Coupled with benefits from higher pricing continuing to work through the backlog, we are very confident in the anticipated DSA growth acceleration and our ability to achieve our mid-teens DSA organic revenue growth outlook for the year, including approaching 20% growth in the second half. For the year, we continue to expect the DSA segment will be the primary driver of modest operating margin improvement for the company as leverage from the accelerated DSA growth rate offsets higher compensation costs. RMS revenue was $176.5 million, an increase of 8.7% on an organic basis over the first quarter of 2021 and in line with our high single-digit outlook for the year. Research Model Services was also a significant contributor to the segment's growth led by the Insourcing Solutions business, or IS; our CRADL, or Charles River Accelerator and Development Labs initiatives, which is part of our IS business, has further accelerated the growth potential for the RMS segment as both small and large biopharmaceutical clients are increasingly seeking to rent turnkey research capacity in key biohubs. Revenue for the Manufacturing segment was $193.1 million, a 10.1% increase on an organic basis over the first quarter of last year. Microbial Solutions growth rate was below the 10% level, resulting in the Manufacturing segment's growth rate being below its mid-teens full year target in the first quarter. The Manufacturing segment's operating margin declined 240 basis points to 33.1% in the first quarter of 2022, as a result of the inclusion of the Cognate and Vigene businesses, which have margins below the overall segment, but expected to improve as we drive efficiency and leverage the significant growth potential for this business. The primary drivers of the increase are nearly evenly split between higher interest rate assumptions associated with the Federal Reserve's outlook provided in March and higher debt balances due to the Explora acquisition in April, which will not have a meaningful impact on non-GAAP earnings per share since the transaction is expected to be earnings-neutral this year. The DSA and RMS organic growth rates are expected to improve sequentially from the first quarter level, while the Manufacturing segment will be slightly lower due to the strong comparison to the nearly 27% growth last year. Given the strong DSA business development activity that Jim highlighted, our order book firmly supports our full year financial guidance, including DSA organic revenue growth approaching 20% in the second half of the year."
}