{
    "symbol": "CRL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 14:15:02",
    "content": " These trends were offset by headwinds from our CDMO business and foreign exchange, which were the factors that led to the revised second quarter outlook in early June and coupled with interest rates have intensified since then leading to today's reduction in our revenue growth and earnings per share guidance for the full year. Furthermore, like the Early Discovery acquisition in 2014, the business development process for cell and gene therapy, CDMO services is highly technical and scientifically complex, requiring longer lead times for clients to place new projects and partner with us across our expanded offering. Explora has healthy margins for a service business and had an excellent second quarter, but is it â\u0080\u0093 it is expected to be a small margin headwind to the RMS segment for the remainder of the year, as it continues to open new sites. Revenue for the manufacturing segment was $194.8 million, an increase of 1% on an organic basis reflecting lower revenue in the CDMO business as discussed, as well as a challenging prior year comparison for the Biologics Testing and Microbial Solutions businesses with a 26.6% segment organic growth in the second quarter of last year. Third quarter earnings per share is expected to decline to a high-single-digit rate from last year's $2.70 due to margin pressure on the manufacturing and RMS segments, as well as meaningfully higher interest expense and tax rate, which is creating a combined $0.30 headwind compared to prior year. Because it seems like from what you're saying in DSA as we exit the year, you're sort of like â\u0080\u0093 from what you're saying about the backlog and the pricing and everything that seems like a set to continue kind of like double-digit growth, research models obviously had to hit from China, but otherwise the demand seems very strong there. Well, specifically, no, just like I was just trying to frame the question in general, but like specifically on manufacturing support, it seems like from what you were saying and answer to Sandy's question is that with the sort of the retooling and the certification and things like that, that could be sort of a multi quarter effort, but it sort of â\u0080\u0093 it seems like you might be at sort of like mid-single-digits organic growth like exiting the year there."
}