{
    "symbol": "NBRV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 23:23:02",
    "content": "  Operator: Good morning, and welcome to the Nabriva Therapeutics Second Quarter 2022 Financial Results Conference Call. Welcome to Nabrivaâ\u0080\u0099s conference call and webcast, where weâ\u0080\u0099ll be discussing the second quarter 2022 earnings and providing a business update. The slides for todayâ\u0080\u0099s presentation are posted on the companyâ\u0080\u0099s website, www.nabriva.com, and can be found under the Investors tab in the Events and Presentations section. Before we begin, on Slide 2, I would like to remind everyone that this conference call and webcast will contain forward-looking statements about the company. Ted Schroeder, Nabrivaâ\u0080\u0099s CEO, will start with a business update and present an overview of the commercial highlights from the quarter. I would now like to turn the call over to Nabrivaâ\u0080\u0099s Chief Executive Officer, Ted Schroeder. We continue to move the business forward across all three key areas: commercial, clinical development and business development. We saw significant double-digit top line growth versus the prior year, driven by SIVEXTROâ\u0080\u0099s 28% prescription demand growth. This resulted in further improvements in operating burn, which Dan will highlight later in the presentation. As you recall, we extended our agreement with Merck to distribute and promote SIVEXTRO in the U.S. through at least 2026. With this in mind, we realigned our efforts on SIVEXTRO, adding over 3,000 additional targets beginning April 1, bringing our total target universe to nearly 8,000. We have experienced immediate benefits from this realignment here in the second quarter, and I will expand upon that later. We also brought our district sales managers in-house, which we believe provides enhanced line of sight and a streamlined communication so we can be more nimble in responding to evolving dynamics in the field. A year ago, we piloted an inside sales representative program. And based upon its success, we have extended the program and expanded the role of the inside sales representatives to help further accelerate SIVEXTROâ\u0080\u0099s uptake with expanded targets. Our strategy is simple: expand our SIVEXTRO targets with a more focused approach, keep frequency high with the use of the inside sales representatives and generate increased prescribing from both current and new targets. SIVEXTRO posted 28% year-over-year prescription demand growth, surpassing the year-on-year growth in the prior 3 quarters. This is even more encouraging as we continue to work through what has historically been peak season for acute bacterial skin and skin structure infections or ABSSSI, and we are poised to continue to take advantage of the momentum with our refocused efforts on the brand. This reaffirms our confidence in our strategy, commercial execution and promotional sensitivity of the brand demonstrated by the consistent growth of SIVEXTRO demand since we reengaged with promotion. The over 1,100 real -- retail prescriptions in Q2 â\u0080\u009822 were another high for the brand since Nabriva took over promotional efforts. First, let me briefly discuss the new alignment we implemented for SIVEXTRO. Specifically, we already are seeing early returns on our SIVEXTRO refocus with our key target, demonstrated by the impressive demand growth in Q2, driven by our increased reach to target prescribers, including podiatrists, dermatologists, nurse practitioners, PAs and primary care physicians. In the second quarter, we sold over 100 new SIVEXTRO writers, with 30% of those prescribers writing for two or more prescriptions in the quarter. On Slide 9, our SIVEXTRO promotion has been further supported by the work of inside sales representatives, a pilot program we initiated a year ago, which initially focused on potential white space geographies targeting approximately 2,000 additional potential prescribers. When you consider the nearly 8,000 potential prescribers of field-based representatives are now calling on, combined with the white space reach of inside sales reps, we were effectively covering close to 10,000 potential SIVEXTRO prescribers. In addition to driving demand in white space geographies, the insight sales reps will now provide support in assigned districts for vacancy coverage. As the field-based reps continue to increase their reach in the expanded universe, the ISRs will provide additional calls to keep frequency high so SIVEXTRO remains top of mind for prescribers. 2 weeks ago, we announced we had entered into an exclusive distribution agreement with Er-Kim, a leading partner for biotech companies in international markets for the oral and intravenous formulations of XENLETA. Under the terms of the agreement, Er-Kim gained exclusive rights to distribute XENLETA in 9 countries. Turning to Slide 12, you will see a summary of some of our key financial metrics for the 3 months ended June 30, 2022 versus the same period of 2021. Total revenue in the quarter grew double digits versus the second quarter of 2021 to $9.2 million, consisting primarily of SIVEXTRO net sales. Within this reduction, most notably, is a 14% reduction in our SG&A expenses versus the second quarter of 2021. R&D expenses did increase in the current quarter, driven by the enrollment in our Phase I cystic fibrosis trial for XENLETA. The growth in net sales and decrease in SG&A continue to improve our operating leverage and have a positive impact on our operating cash burn, which Iâ\u0080\u0099ll touch on more in a moment. We also began to pay down our debt with Hercules on April 1 of this year, paying down approximately $900,000 of debt in the quarter. We exited the second quarter with cash and cash equivalents of over $20 million, enabling us to maintain our prior cash runway guidance. Our operating cash burn was $13 million in the current quarter, continuing a positive trend year-over-year and sequentially quarter-on-quarter. For the 3 months ending June 30, 2022, our operating cash burn came down by 30% compared to the 3 months ended June 30, 2021. For the 6 months ended June 30, 2022, our operating burn came down by 28% compared to the same period in 2021. Sequentially versus the first quarter of 2022, our second quarter operating burn came down by 18%. Nabriva had another solid quarter, continuing to execute operationally in a tough macro environment. As we turn to Slide 15, our 2022 priorities for commercial growth remain unchanged. Regarding our Phase I safety and PK cystic fibrosis trial for XENLETA, we are pleased with how enrollment has progressed to date, tracking in line with our previously communicated time lines with data expected in the first half of 2023. We know the FDA has initiated some overseas inspections, and we are keeping a close eye on development to inform us how and when we move forward with our CONTEPO package. As a reminder, we were granted an extension on the resubmission of the NDA, which provides Nabriva flexibility to submit at any time through June 2023. As we look ahead to Slide 16, we have an excellent foundational asset with SIVEXTRO with growth potential that can serve as the core asset for our value story. We have the CAP indication in the U.S., which presents an opportunity for a 2 million-plus patient population, and we continue to focus on pulmonologists to create a value proposition for the brand. We are close to finalizing enrollment in the cystic fibrosis Phase I trial, which provides another opportunity to address the medical need with that patient population and create more value for XENLETA. And finally, with CONTEPO, we have a potential near-term catalyst to add a third commercial asset to our portfolio with an opportunity in approximately 3 million patients being treated for multidrug-resistant complicated urinary tract infections. We are very excited with the progress we have made during the first half of 2022, and we look forward to continuing that momentum moving forward and sharing our progress with you in the upcoming quarters. So as weâ\u0080\u0099ve discussed previously, Carl, we expect to get there this year. And weâ\u0080\u0099ll also be supplying product to do those territories over time, could become a pretty significant revenue stream for us in the short term. With respect to the XENLETA Phase I clinical trial -- and again, you expect data first half of next year. And I think based on the strength of the data and what the situation would be like at the FDA, we would certainly have the opportunity to engage with them as we look at the potential for further research in this area. But for now, weâ\u0080\u0099re just focused on the Phase I study and then a grouping of nonclinical studies looking at DDIs, looking at some mouse models and looking at microbiologic effects in CF sputa, et cetera. So when we bring the data forward next year, we expect to have a relatively complete package of how XENLETA performs in a CF population. Perhaps first question, regarding XENLETA U.S. sales, what are your expectations for the remainder of 2022 and perhaps what are your preparations for the rest of the year? And given the kind of the uptake of SIVEXTRO, weâ\u0080\u0099ve heavily switched our efforts to support SIVEXTRO. However, for XENLETA, where you are focusing on pulmonology, specifically, they tend to have patients that are more appropriate for XENLETA, patients that have been exposed to prior antibiotic therapy often, in patients that have a bit more compromised and this patient group really allows us to get there. But as weâ\u0080\u0099ve touched on, we can expect a significant double-digit royalty on the net sales. But we donâ\u0080\u0099t have all the data, and we wouldnâ\u0080\u0099t really give specific guidance on the level of sales to expect at this time. So you have some immediate countries, some that might be lagged by a few quarters and others like Turkey that will take a bit longer than that to work through their regulatory process. It looks like you had about $37,000 adjustment with respect to XENLETA inventory obsolescence. Thanks for your attendance, and we look forward to updating you not only in future quarters, but in some of the upcoming conferences throughout the fall."
}