{
    "symbol": "NBRV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 19:40:40",
    "content": " The slides for today's presentation are posted on the company's website, www.nabriva.com, and can be found under the Investors tab in the Events and Presentations section. Before we begin on Slide 2, I would like to remind everyone that this conference call and webcast will contain forward-looking statements about the company. Ted Schroeder, Nabriva's CEO, will start with a business update and present an overview of the commercial highlights from the quarter. As we turn to Slide 5, I'd like to take some time to update you on our outlook regarding the current position of the business against the backdrop of the broader macro environment. As a result, we believe our portfolio of assets are significantly undervalued by the market, given that we are currently trading at approximately 40% of cash with revenue-generating assets, it's clear to see that the sum of the parts valuation is worth more than we're currently getting credit for in the market. Given these challenges, we have shifted efforts to focus primarily on SIVEXTRO by building upon our commercial success as we believe this is the most efficient and effective way to extend our cash runway and preserve optionality and value for our shareholders. Additionally, and following a broader assessment of potential options, we have engaged Torreya Capital to help advise us on a range of strategic options to maximize the value of the underlying business. We have a revenue-generating asset, which fully funds our commercial infrastructure and has generated net sales of approximately $24 million year-to-date through September 2022. Second, we have an approved product in the U.S. for CAP with XENLETA that offers both IV and oral monotherapy with a novel mechanism of action, and a well-tolerated option for patients with CAP. This is an asset with 11 years of patent life remaining, and has the potential to deliver more value in the future with an increase in investments to drive awareness of the attributes and benefits of XENLETA. With the appropriate resourcing behind the brand, we believe there is significant untapped potential for XENLETA in the U.S. XENLETA also has 3 separate and distinct royalty opportunities outside the U.S. with income-generating potential in Canada with our partner, Sunovion, in Eastern Europe with our partner, Er-Kim, and with the potential approval in China with our partner, Sumitomo. Additionally, we have another potential life cycle management opportunity with XENLETA in the treatment of patients with cystic fibrosis that could generate up to $100 million in incremental peak sales. Given the small concentrated patient population, we remain optimistic about the potential of XENLETA in cystic fibrosis and look forward to having top line data before the end of this year. Lastly, with CONTEPO, for the U.S., we have a product with a novel mechanism of action, patent exclusivity now extended through 2038, and a proven track record outside the U.S. for over 40 years, treating multidrug-resistant organisms across various indications. With over 3 million patients in the U.S. with MDRs, CONTEPO provides an attractive alternative for treatment of this growing issue in the United States. With this backdrop, we believe the most efficient path forward is to attempt to maximize value from these assets in the near term, while extending our cash runway and maintaining optionality as we look to realize the full value of our assets for both the patients they treat and our shareholders. As a result, we have reduced operating expenses, created efficiencies within the business, and extended our cash runway into the first quarter of 2023. Our near-term focus is to optimize our cash position, maximize value from individual assets within our portfolio and efficiently enhance shareholder value, while building upon our commercial execution. We had a 16% quarter-on-quarter TRx demand growth and continue to focus on the sales force execution with SIVEXTRO, capitalizing on the significant acceleration in demand. As I mentioned, we have implemented a strategic restructuring plan to reduce cash burn and refocus our efforts on near-term value drivers, and we continue to see improvements in our operating cash burn compared to the prior year. On the clinical side, we now expect top line data from the Phase I cystic fibrosis study in Q4 2022. As you will recall, this has the potential to generate low double-digit royalties and up to $86 million in incremental sales and regulatory milestones. As you can see on Slide 8, SIVEXTRO posted its third consecutive quarter of double-digit prescription demand growth with 16% prescription demand growth in Q3 '22 versus Q3 '21 and 18% year-to-date prescription demand growth compared to the same 9-month period of 2021. During the recent quarter, we saw yet another high in retail prescription demand since we restarted promotion of the brand, generating 1,148 retail prescriptions. On the back of this retail prescription demand, we have achieved our guidance of getting back to peak historical sales run rate of SIVEXTRO by the middle of 2022. As we move on to Slide 9, we are encouraged to see that our target call reach for SIVEXTRO has more than doubled in the third quarter of 2022 compared to the first quarter of 2022 following our realignment in April of this year. Additionally, since the realignment, we have converted 225 new SIVEXTRO writers with podiatrists accounting for 40% of those new prescriptions written. We expect to reach -- we expect to continue to expand combining the increased reach and frequency with the established promotionally sensitive nature of SIVEXTRO, we believe it sets up for continued momentum as we move forward with this commercial strategy and focus around the brand. Shifting our focus to an update of our Phase I trial of XENLETA in patients with cystic fibrosis, Slide 10 lays out our rationale for exploring XENLETA as a treatment option for CF patients with chronic Staph aureus MRSA infections. Because XENLETA is available on both an oral and IV formulation, has demonstrated potent anti-MRSA activity, excellent lung penetration, potent anti-inflammatory activity, and is well tolerated. We have completed enrollment in the Phase I cystic fibrosis study in partnership with the CF Foundation and now expect top line data in Q4 2022, accelerating our prior guidance of Q1 2023. Turning to Slide 12, you will see a summary of our key financial metrics for the 3 months ended September 30, 2022, versus the same period of 2021. Total revenue in the quarter grew 3% versus the third quarter of 2021 to $9.2 million, consisting primarily of SIVEXTRO net sales. The growth in net sales and the decrease in SG&A continued to improve our operating leverage, and have a positive impact on our operating cash burn. We also continued to pay down our debt facility with Hercules, paying down approximately $1 million of debt in the current quarter. We exited the third quarter with cash and cash equivalents of $14.8 million, and as a result of our restructuring efforts, we have extended our runway into the first quarter of 2023. Given the pressures in the macro environment impacting our ability to efficiently raise capital and significantly undervaluing our portfolio, we believe our current initiatives to extend our cash runway and focus on maximizing the value of the products in our portfolio is the most efficient way to preserve optionality and value for our shareholders. We have continued to drive growth in SIVEXTRO, advance our life cycle management opportunities with XENLETA in cystic fibrosis and expanded the global presence of XENLETA with our partners to unlock royalty revenue streams in the near future. We have executed operationally throughout 2022, and we'll continue to pursue options to maintain that progress over time to continue to bring these important antibiotic options to the patients who desperately need them. With that, I would now like to turn the call back over to the operator, so that we can open the line for the Q&A session. Yes, we weren't expecting too much of the savings in Q3 and Q4 given some of the separation agreements, we'll start to realize some of those savings as we turn the calendar year into 2023. So penetration in mutant CF patients, there's a mouse CF model, which is a standard model that prescribers are familiar with and some of the other drug-drug interaction work that's important for folks. Can you comment on the funds raised via the ATM, obviously, it looks like there's some activity with respect to the ATM may be around a couple of hundred thousand shares raising, maybe $4 million or $5 million. First, I wanted to start by asking you, as you -- as you focus primarily on SIVEXTRO and look at strategic options, essentially for the rest of your pipeline, I'm wondering if you could be specific on both XENLETA in both CAP and CF, as well as CONTEPO. So I think we're open-minded about how that -- how we would evolve forward into a variety of different options, which could include one or all the brands or some combination. And then the current sales of SIVEXTRO in the quarter of 8.6 fell just shy of the 8.7 last quarter, given that you're essentially at a flat growth, wondering if you could share with us some more thoughts about how you think about the growth prospects for the brand and what you're doing to reenergize the growth? So I think last year, there was some buy-in as we kind of reestablished the brand and there was a benefit of some stocking in the third quarter of last year versus kind of more normal level buy-ins in the third quarter of this year. We did see some shift last year from wholesale ordering that would sort of lined up into the second quarter, but spilled into the third quarter. But the important point as Dan highlighted, is that total prescriptions are growing and growing at a nice clip and eventually wholesaler demand over the years period of time will catch up, and we're well ahead of last year and continuing to grow. And the fourth quarter, I think, will show that, that growth in the -- driven by demand is sustained. That would mean that the current marketed dose would be the appropriate dose and -- but given the chronic nature of the infection, you would probably see -- potentially see more doses per patient. So it's not quite an efficacy study, but I think I check some of the boxes for penetration and getting to the organisms and getting to the site of infection that are important in assessing, which antibiotics might be appropriate in this patient population. I appreciate your interest, and we look forward to updating you in the weeks ahead, and we especially look forward to reporting the results of the Phase I cystic fibrosis patients before the end of the year."
}