{
    "symbol": "ECOM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 11:33:03",
    "content": " Despite the backdrop of slower e-commerce growth, high consumer inflation and macro uncertainty, we delivered another good quarter in Q2 with solid revenue growth and adjusted EBITDA that again exceeded the high end of our guidance range. This represents roughly half of our subscription revenue an all-time high and we're getting closer to the point where the majority of our total revenues will come from brands, because brands offer greater potential for expansion, we believe the strong new economics we've enjoyed with brands will continue to benefit our results as they grow to represent a higher percentage of our business. The momentum continued to build in Q2, with progress made in releasing new product capabilities, access to more channels, gaining further industry recognition and earning accolades as an employer whether it be our exciting new retail media partnership with Criteo, achieving the distinction of being named an Amazon Ads Advanced Partner or winning recognition as one of the best places to work in the research Triangle area, for the eighth time, there's a lot to feel good about. I'm pleased to report that our results for the second quarter of 2022 were better than expected, with revenue above the midpoint of our guidance range, subscription revenue growth of 16% on a constant currency basis and adjusted EBITDA that exceeded the high end of the guidance range while continuing to achieve strong cash from operations and healthy margins. Growth was driven by subscription revenue performance, which increased 13% year-over-year and as mentioned earlier, 16% excluding the currency impact to another record at $36.1 million. Earlier, David provided some details on the continued strength of our brands cohort with total revenue up 20% year-over-year or 25% excluding the currency impact to $19.1 million. But I would say, sales capacity which was a challenge for us at the beginning of the year and a gap that we had largely closed by the middle of -- or by the end of Q2 that's an important input into our overall ability to generate bookings and ultimately revenue growth. So, I think as long as we execute on product innovation, as long as we execute on capacity and continuing to focus on the right kinds of customers, I think we should be able to continue to drive good revenue growth and as you point out hopefully faster revenue growth as we get closer to 2025."
}