{
    "symbol": "CORR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 14:28:19",
    "content": "  Operator: Hello, and welcome to CorEnergy's conference call to discuss the Second Quarter 2022 Results. Thank you, Holly, and thank you, everyone, for joining today's core Energy Infrastructure Trust Conference Call. Earlier this morning, we published a press release announcing the second quarter results for 2022. During this call, we will also make reference to certain forward-looking non-GAAP metrics, which will be reconciled in subsequent filings as part of our results reported. I'll spend a couple of minutes updating our operations, then John Grier will discuss Crimson's recent results, and then we'll turn the call over to Robert for financial comments and outlook. The second quarter saw continued steady performance from our predictable Missouri natural gas operations, but also a reduction in volume in our California crude oil operations as a result of disruptions in the global oil supply chain. However, in July, a third-party operational issue reversed our drop in volumes, a benefit which is expected to persist throughout Q3. We own and operate regulated oil and gas, transportation and storage assets under revenue structures that help to mitigate risk. With our natural gas business, MoGas and Omega pipelines, we support residential, commercial and industrial demand under long-term take-or-pay capacity contracts. We are also engaged with the U.S. Department of Defense at Fort Leonard Wood, Missouri, to provide scoping for the Utility Energy Services contract, or USEC, which we were awarded several years ago and which could add revenue for us. And if we are successful, our pipelines and rights of way will also be important to its future carbon reduction efforts since they connect large point sources of CO2 emissions with world-class reservoirs for sequestration. The second quarter volume decline, Dave mentioned was not representative of natural production decline, but rather disruptions in the global oil supply chain. In particular, disruptions to overseas production from Russia and Ecuador that caused a ripple effect stretching into California. These events exacerbated the continued permitting impasse in the state, making it more difficult to lift the rich California oil reserves produced under some of the most environmentally stringent conditions anywhere in the world. There are 2 specific issues, our volumes -- affecting our volumes in the second quarter. Second, for temporary logistical reasons, a Bay Area refinery took some incremental San Joaquin Valley barrels, which largely came from production being transported in our pipeline. We have hosted meetings with our customers, and they continue to assure us that our pipelines are critical to their assets and they support our continued operations. We do not believe the current situation is the new normal, but rather that short-term crude oil supply disruptions, which can -- which should largely be resolved over the next several quarters. The reduction in volumes in the second quarter was reversed in July by volumes gained as a result of third-party operational issues, which we expect to last at least through most of the third quarter. As a result, we're maintaining our outlook for the year, and it's just coming in a slightly different way than we originally expected. Looking to the future, our Crimson assets have a significant untapped value in the energy transition, and we continue to advance those efforts. And local California production is the most carbon efficient source of that same crude oil for the state, maybe the world. This incurs a far greater carbon footprint versus our more efficient pipelines, but that is just 1 piece of the puzzle. And its refineries produce the cleanest burning formulation of gasoline in the world by virtue of being a highly efficient transportation system, connecting in-state production to in-state refining, we already helped provide the greenest barrel of oil and transportation fuels in the world. The commercial case for CO2 capture is better in California than any other state, which provides us with longer-term growth potential as part of the network connecting emissions capture with storage. The recent federal legislation addressed energy and climate by further increasing carbon capture credit from $50 a ton to $85 a ton, subject to some employment criteria. Also, California Air Resources Board report recently confirmed their new aggressive climate goals of 40% reduction in carbon emissions by 2030 and achieving carbon neutrality by 2045. We also believe there are other low-carbon energy transition-related storage and transportation opportunities in California in addition to CCS, which we will continue to pursue. With our expertise in operating California pipelines and existing physical assets, including our easements and rights of way, we believe we are in the best position to help accelerate development time lines and minimize overall costs of these projects. In the second quarter, we announced that we signed our first nonbinding MOU with a carbon sequestration project developer to provide a transportation solution from origin to destination with several opportunities to expand both in reach and volume. Second quarter revenue was $31.5 million, down slightly from the $32.9 million last quarter, with steady performance from MoGas and Omega, but lower overall volumes in California from the disruptions John and Dave referenced. We do see near-term opportunities benefit in Q3 and the back half of the year transportation volumes, as previously described. As a reminder, prior to the pipeline shutdown, the Amplify pipeline accounted for 1.2 million barrels of annual volume and a sizable boost to our cash flows of approximately $1.1 million per year. The 10% tariff increase announced earlier this month across the majority of our California system was justified by the lower volumes, but still results in an under-earning situation. The benefit of this volume shift will be taken into account in future tariff scenarios, hopefully mitigating our needs for significant increases in rates. For the 3 months ended June 30, 2022, we had adjusted EBITDA of $10 million, adjusted net income of $2.4 million. And after providing for maintenance capital and debt amortization, adjusted cash available for distribution or adjusted CAD of approximately $270,000. Despite the volume decrease in Q2, we partially covered our common dividend due to lower-than-expected costs and higher realized crude oil prices on our net pipeline loss allowance. As mentioned, we have filed a 10% increase on virtually all of our CPC regulated pipelines, and are actively engaged in a number of cost efficiency programs across our business. No dividend was declared on the Class B common stock, which is owned by management and feature subordinated dividend rights that are specifically designed to prioritize the dividend to our external stockholders. As a reminder, we expect to characterize at least some percentage of our 2022 dividend as a return of capital due to our losses from 2020 rather than as ordinary dividends for tax purposes, which may provide favorable tax circumstances to many of you. Net of the volatility, rate increase and cost efficiency programs, we are maintaining our 2022 adjusted EBITDA outlook of $42 million to $44 million. On Page 53 of our 10-Q to be filed later today, we have provided a table of quarterly expected maintenance capital expenditures and also maintenance expense, which is included in our operating expense for the remainder of 2022 to help in understanding some of the variability. First one, I just wanted to talk about the third-party issue that kind of reversed the decline in California volumes. And then also, just curious on some of the cost efficiency measures you guys are taking with Crimson and potentially any goalposts you could provide there. We're -- beyond what we've said in the release and on the call, we're not going to comment on the operational issues with third parties. And the magnitude of that could be in excess of $1 million a year just in the rent reductions across our footprint and other similar cost related -- I mean, fixed cost-related reductions. The update on that -- this is John Grier, is that we continue the conversations and there are companies that are in California that have submitted for the EPA permits to sequester. There's a willingness -- and I'll say, significant willingness to move forward with us and our company and our assets to make progress on that, but we're not in a place where we can make announcements about exactly what we're doing. Well, we've got the same program of incremental step outs in our existing footprint as our first priority that leverages our operating costs and our regulatory relationships and has the most upside and risk mitigation for our current stockholders. Secondly, would be platform-related acquisitions that help diversify the business and include an enhanced scale. So we expect that process to come to conclusion later this year, which would also enhance our ability to complete other acquisitions. I think as you've heard, we're delivering on it, which is to safely deliver energy that empowers homes, businesses, schools, transportations, even hospitals to function, raising the standard of living in our communities. And with our lower carbon activities, we're also managing our environmental stewardship for future generations."
}