{
    "symbol": "CORR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 16:33:05",
    "content": "  Operator: Hello and welcome to CorEnergy's conference call to discuss Third Quarter 2022 Results. Thank you, Kelly, and thank you everyone for joining today's CorEnergy Infrastructure Trust conference call. Earlier this morning we published a press release, announcing the third quarter results for 2022. During this call, we will also make reference to certain non-GAAP metrics, which are reconciled in our filings as part of our results reporting. These include supporting potential customer demand on the MoGas system that could increase volume as well as previously discussed UESC projects at Fort Leonard Wood, where our Omega system is the last mile of distribution to US Army facilities. In California, our Crimson pipelines provide a critical link in the state's energy infrastructure, operating under fixed tariffs for volumes transported with long-term investment-grade customers. While this has been a more challenging year on Crimson than we planned, we believe these assets will fill critical energy needs in California for decades to come. On our last call, we indicated that second quarter volumes had declined due to disruptions in global supply of crude oil, following the war in Ukraine, uncertainty remains with the price cap on Russian crude taking effect in December. However, Crimson volumes increased sequentially in the third quarter due to operational issues elsewhere in California, which is continuing in the fourth quarter. Looking to the future, our Crimson assets have a significant untapped value in the energy transition process in California. As John discussed last quarter, our California footprint is well positioned to help reduce greenhouse gas emissions through carbon capture and sequestration, or CCS. The California Air Resources Board, or CARB, has set aggressive climate goals of a 40% reduction in carbon emissions by 2030 and carbon neutrality by 2045 and identified CCS as a central pillar to their targets. We believe there are other low-carbon energy transition-related storage and transportation opportunities in California in addition to CCS, which we will continue to consider as we work to deploy our assets and expertise as part of the next generation of energy economy. During the third quarter, we filed for a tariff increase of 34.9% on our Southern California pipeline system and 10% on our KLM pipeline. In August 2023, we plan on filing for and collecting on an additional 10% increase for a total effective increase of 21% in Southern California, which represents the anniversary date of the original filing for that system, assuming the rate case hasn't been resolved by that time. We also filed a 10% increase on our SPB system, but withdrew it due to increased volumes and general volume variability on that line. Since the majority of our assets are regulated we always have the option to increase tariffs to offset declining volumes and/or increasing costs, but we only do so after we have exhausted other avenues such as improved cost efficiencies. As previously discussed, P66 is still on track to convert its Rodeo Refinery to renewable diesel production in early 2024, which results in a significant amount of crude oil needing to be transferred to other refineries and should result in additional volumes on our SPB pipeline with no additional CapEx required. Third quarter revenue was $33 million an increase from $31.5 million last quarter as a result of steady performance from MoGas and Omega and improved volumes in California. For the three months ended September 30, 2022 we had adjusted EBITDA of $8.9 million and adjusted net income of $1.1 million. The third quarter was impacted by unusual items, which when normalized result in what I believe is a CAD number that is more indicative of the business's ability to pay its common dividend. In Q3, we spent $950,000 to clean up a minor crude oil pipeline leak that occurred during the quarter. The quarterly average expense incurred between 2018 and today is $135,000. In Q3, we spent $462,000 on professional services related to our rate filing. Our quarterly average expense incurred between 2019 and today is $116,000. After normalizing these two expenses to historical average, we had normalized adjusted CAD per share of $0.04 or 0.74 coverage for the quarter and year-to-date normalized CAD per share of $0.20 or 1.36 coverage. Our Board evaluates dividends each quarter using a longer-term view of coverage, given the quarterly variability that can occur with our asset. While we expect fourth quarter volumes and revenue to be similar to Q3, we expect the expenditure on our rate case proceedings to be above the historical quarterly average, which is accounted for as a period expense but what would benefit future periods. Based on historical experience permitting and fourth quarter holiday schedule, some of our anticipated fourth quarter maintenance projects may move into 2023. And that's -- that could be the emitting company or it could be somewhere that they've contracted, but you're correct."
}