{
    "symbol": "EB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 23:24:08",
    "content": " It's not a coincidence that our own strong growth in the first quarter of 2022 comes at the same time that creators on our platform are attaining new heights in their businesses, specifically paid tickets per creator and gross ticket sales per creator, both grew at double-digit rates year to year in the first quarter, a clear sign of the success creators are having on our platform. Over 135,000 event creators, ticketed and marketed nearly 440,000 paid events on our platform during the quarter, increases of 60% and 32% respectively over last year's first quarter. Paid tickets per event improved by 34% over last year's first quarter, reflecting strong consumer demand, as well as our ability to connect creators with audiences. Comparing that year-to-year change in adjusted EBITDA to the year-to-year increase in revenue in the first quarter, we delivered a revenue flow through rate in the high 30% in the first quarter, which aligns with our objectives for driving adjusted EBITDA profitability and sustainable margin improvement as ticket volume and revenue grow through time. Longer term, the product and customer momentum we've built up over the last 24 months and are higher than anticipated first quarter results, provide real encouragement that are product-led strategy can lead to strong and sustainable revenue growth, accompanied by steady margin improvement. So it's really the first time in Eventbrite's history, where we've been able to offer something of great value to professional creators who are hosting free events, and they are paying for that value, which includes particularly the ability to market their events efficiently out in social media, as well as most notably what's driven this uptick in free creator adoption of Boost has been our premium email campaign. So typically speaking, we see higher ticket prices in music, in business, professional events, as well as bigger episodic events and so, I think as the mix shift continues to play out, as events start coming back, as businesses start thinking about hosting more conferences as music venues are opening up more shows and then as bigger gatherings where you see sort of more of the, 1,000 to 10,000 people gathering around a festival start to come back, I think we'll start to see a stronger average ticket price and we will see our revenue scale with that. As we look forward on the take rate, there's a little bit of the room probably to continue to move it up on the core product but I think the biggest opportunity for us is really some of the stuff that we've been talking about, Julia's talking about today around Boost and around demand generation and bringing entirely new pockets of support and service and growth to the table for creators and we know they have a interest in those things."
}