{
    "symbol": "PHM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 12:34:03",
    "content": " At this time, Iâ\u0080\u0099d like to welcome everyone to the PulteGroup, Inc. Q4 2022 Earnings Conference Call. Look forward to discussing PulteGroup's outstanding fourth quarter earnings for the period ended December 31, 2022. Iâ\u0080\u0099m Joined on today's call by Ryan Marshall, President and CEO; Bob Oâ\u0080\u0099Shaughnessy, Executive Vice President and CFO; and Jim Ossowski, Senior VP, Finance. Please note, that consistent with this morning's earnings release, we will be discussing our reported fourth quarter numbers as well as our financial results adjusted to exclude the benefit of certain insurance reserve adjustments and JV income as well as the write-off of deposits and pre-acquisition spend and a tax charge recorded in the period. And finally, I want to alert everyone that today's presentation includes forward-looking statements about the company's expected future performance. We ended 2022 on a high note as we closed almost 8,900 homes and delivered all-time fourth quarter records with homebuilding revenues of $5.1 billion and earnings of $3.85 per share. These results, in turn, helped PulteGroup finish the year with over $1 billion in cash and a net debt-to-capital ratio below10%. Driven by the company's exceptional fourth quarter performance, PulteGroup delivered another year of great financial results. For 2022, our home sale revenues increased 18% over the prior year to $15.8 billion, our reported pre-tax earnings increased by 37% to $3.4 billion and our reported earnings increased 48% to $11.01 per share. These results provided us the flexibility to invest $4.5 billion into the business, while returning over$1.2 billion to shareholders, dividends and share repurchases. In assessing our 2022 financial results, we fully appreciate that gains in volume, pricing, gross margin and earnings reflect the stronger demand environment that existed earlier in 2022. For the full year, national new and existing home sales across the country fell 16% and 18%, respectively from 2021. Consistent with the trend of these national numbers, our 2022 net new orders were down roughly 27% from 2021. The softer demand we've experienced as a result of consumers priced out of the market by higher prices and higher mortgage rates, along with those individuals who have moved to the sidelines given market uncertainties and risks. Despite the higher rate environment dominating the national conversation, we saw buyer demand improve as the fourth quarter progressed and can confirm this strength continued through the month of January. We will have to see how things progress from here, but I think this improvement attests to the ongoing desire for homeownership that exists in this country. While seasonal trends have been distorted over the past few years, monthly sales moving higher as the fourth quarter progressed is atypical. Based on feedback from our sales offices, buyers have been responding to the decline in mortgage rates. Along with the decline in mortgage rates, actions we've taken to help improve overall affordability appear to be gaining traction. In alignment with our strategy to find price and turn our assets, we continue to implement programs that enable consumers to buy homes in today's higher rate environment. The cost of these programs which might include rate buydowns, lower lot premiums, or even price reductions can be seen in our higher Q4 incentives. In the fourth quarter, incentives increased to 4.3% of sales price. On a sequential basis, this is up from 2.2% on closings in the third quarter of 2022. Beyond just adjusting incentives in many of our active communities, we have already introduced smaller floor plans to help lower future prices and associated costs. Like all of us on this call, I've heard strong arguments on both sides. We're currently seeing buyers respond to lower rates, and better pricing. With today's volatile market dynamics, one of our frequent conversations with investors is around how Pulte plans to operate its business over the near-term. Given the long timelines associated with land development and home construction, we need to set a plan, but be prepared to adjust as market dynamics require. At a high-level, I'd like to share how we plan to operate the business for the foreseeable future. We've shared on prior calls that in the current environment, buyers are showing a preference for homes that have near-term delivery dates. As an example, in the fourth quarter, spec sales represented over 60% of our new orders. Within today's sales environment, we will be intelligent about the process as we optimize our production machine and turn through our land assets. Combining our planned starts, with our 18,000 homes currently in production, we expect to have a production universe that will allow us to close approximately 25,000 homes in 2023. We have goals in place to reduce cycle time, and our procurement and construction teams are already realizing success in cutting production days, but a lot of work remains to be done. Buyer demand will ultimately determine what the coming year looks like, but this is our operating plan. We see this as a prudent, balanced approach that checks key strategic boxes, namely; we maintain a level of production in our communities, which is critical when negotiating with local trades and suppliers. We keep an appropriate level of specs in production while seeking to control finished inventory, and we continue to turn our assets, generate cash and position the business for the next leg of the housing cycle. Given today's market dynamics, at this time, we will be providing guidance for our first quarter, but not the full year. PulteGroup completed the year by delivering a strong fourth quarter results, the benefits of which can be seen throughout our financial statements. In my analysis of the company's operating and financial performance, I will review our reported numbers as well as our financials adjusted for the specific items Jim noted at the start of this call. Higher revenues for the period were driven by a 3% increase in closings to 8,848 homes in combination with a 17% increase in average sales price to $571,000. The mix of closings in the fourth quarter was 36% first-time buyers, 39% move-up buyers and 25% active adult. This compares with last year's closings, which were comprised of 33% first time, 42% move-up and 25% active adult. In the quarter, we recorded net new orders of 3,964 homes, which is a decrease of 41% from the same period last year. As a percentage of sign-ups, the cancellation rate in the fourth quarter was 32% compared with 11% last year. I would note that in the 4 years prior to the pandemic, quarterly cancellations as a percentage of beginning period backlog averaged 10%, so Q4 cancellations in relation to backlog were in line with historic norms. In the fourth quarter, our average community count was 850, which is up 8% from an average of 785 last year. Based on planned community openings and closings, we expect our average community count in the first quarter of '23 to be flat sequentially or approximately 850 communities. For the remainder of '23, we expect quarterly community count to be up 5% to 10% over the comparable prior year quarter. By buyer group, fourth quarter orders to first-time buyers decreased 28% to 1,574, while move-up demand was lower by 56% to 1,241 homes and active adult declined 36% to 1,149 homes. As has been widely discussed, housing demand remains under pressure as higher interest rates and years of price appreciation have stretched affordability for buyers. We ended the quarter with a backlog of 12,169 homes with a value of $7.7 billion. This compares to the prior year backlog of 18,003 homes with a value of $9.9 billion. As Ryan discussed, our objective is to keep turning -- keep inventory turning, which requires that we start an appropriate number of homes. In the fourth quarter, we started approximately 4,000 homes, which is down 50% from the fourth quarter of last year, and, on a sequential basis, down about 40% from the third quarter. We ended the fourth quarter with a total of 18,103 homes in production, of which 10% were finished. Of our total homes under construction, 43% were spec. This is slightly above our target of having specs comprised approximately 35% of our work in process, but given buyer preference for a quicker close, we are comfortable having a few more homes in production. Based on our production pipeline, we currently expect to deliver between 5,400 and 5,700 homes in the first quarter of the year. As Ryan indicated, for the full year, we will have the production potential to close approximately 25,000 homes. Given the price of homes in backlog, the mix of homes we expect to close and the anticipated level of spec closings in Q1, we expect the average sales price for Q1 closings to be between $565,000 to $575,000. At the midpoint, this would be an increase of 12% over the first quarter of '22. In the period, we reported gross margins of 28.8%, which remain near historic highs for the company. This represents an increase of 200 basis points over the comparable prior year period, although down sequentially from the 30.1% gross margin we delivered in the third quarter. Looking ahead, we expect to deliver another strong quarter with Q1 gross margins of 27%, which includes the benefit of lower lumber costs due to the fall in lumber prices in the back half of '22. Any savings from ongoing renegotiation of labor and material contracts will be realized in future quarters, and we will have to see how much of this work benefits our '23 versus our '24 closings. Our reported fourth quarter SG&A expense of $351 million, or 6.9% of home sale revenues, includes a net pre-tax benefit of $65 million from adjustments to insurance-related reserves recorded in the period. Exclusive of this benefit, our adjusted SG&A expense was $415 million or 8.2% of home sale revenues. In Q4 of last year, our reported SG&A expense of $344 million or 8.2% of home sale revenues included a net pre-tax benefit of $23million from insurance-related reserve adjustments . Exclusive of that benefit, our adjusted SG&A expense was $367 million or 8.7% of home sale revenues. With the pullback in overall housing demand, weâ\u0080\u0099ve worked hard to ensure our overheads are properly aligned with today's tougher operating conditions. As such, we expect SG&A expense in Q1 to be in the range of 10.5%to 11% compared with 10.7% last year. Reported fourth quarter pre-tax income from our financial services operations was $24 million, down from $55million last year. In the fourth quarter, we walked away from 21,000 option lots and an associated $900 million in future land acquisition spend. As a result of these actions, we incurred a pre-tax charge of $31 million for the write-off of related pre-acquisition costs and deposits. Our reported tax expense for the fourth quarter was $282 million, which represents an effective tax rate of24.2%. On the bottom line, our reported net income for the fourth quarter was $882 million or $3.85 per share. On an adjusted basis, the company's net income was $832 million or $3.63 per share. These results compared with prior year reported net income of $663 million or $2.61 per share, and adjusted net income of $637 million or$2.51 per share. Moving past the income statement, we invested $1.1 billion in land acquisition and development in the fourth quarter, with almost 65% of this spend for development of existing land assets. For the full year, we invested a total of $4.5 billion in land, including $1.9 billion of acquisition and $2.6 billion of development spend. Given recent decisions to exit certain option land positions, we ended the year with 211,000 lots under control, which is down 8% from last year and down 13% from the recent Q2 peak of 243,000 lots. With the decision to drop option lot deals over the past two quarters, owned lots currently represent 52% of lots under control. As weâ\u0080\u0099ve discussed on prior earnings calls, given the slowdown in overall housing activity, we plan to dramatically lower our land spend in 2023. At this time, we expect our total land investment to be approximately$3.3 billion, with an estimated 65% of these dollars going toward development of owned land positions. In the fourth quarter, we repurchased 2.4 million common shares at a cost of $100 million for an average price of $41.81 per share. PulteGroup continues to maintain one of the most active share repurchase programs in the industry, having repurchased 24.2 million shares of common stock in 2022, or almost 10% of our shares outstanding, for $1.1billion at an average cost of $44.48 per share. After allocating capital to the business and our shareholders, we ended the quarter with $1.1 billion of cash and a net debt to capital ratio of 9.6%. On a gross basis, our debt to capital ratio was 18.7%, which is down from 21.3% last year. When the year started out, we had almost unlimited demand, but supply chain disruptions resulted in countless bottlenecks and extended build cycles. As the year progressed and rising interest rates push more and more consumers to the sidelines, we initiated a series of operational changes as we quickly adapted to the more competitive market conditions. If there is a silver lining in today's challenging demand environment, I think we have what can be viewed as favorable supply -- as a favorable supply dynamic. Existing homes are our industry's biggest source of competition, so such limited supply is certainly advantageous. I think what weâ\u0080\u0099ve done -- well, I think that weâ\u0080\u0099ve done that in terms of how we've setup our business. At the same time, we don't have an excess of spec homes in the system that will cause incremental self-inflicted pressures. We are typically among the biggest builders in our markets, and our ability to serve all price points provides opportunities with land sellers and municipalities. And finally, we are in exceptional financial position with plenty of liquidity, no debt maturities for 3 years and expectations for another year of strong cash flow. Obviously, we are going to see stronger performance in markets where we are seeing stronger sales activity, I think the Southeast of Florida, specs out West are a little bit more challenged. On balance, we've seen -- interestingly, if you think about our Q4 guide for margins, we outperformed it. We've talked about getting more volume out of Florida which is one of our better margin performances, but also because of the relative strength of spec sales, we did a little bit better on those than we anticipated when we gave the guide. As Bob just highlighted in the last answer, we continue to see great performance out of the Texas markets. And probably one of the more encouraging signs that we've seen as we started to see our Western markets, Phoenix, Las Vegas, Southern California, Northern California, we started to see those markets come back to life. First question, you have lower lumber costs beginning to flow through the P&L and perhaps some other stick and brick cost savings. Truman, I think you've highlighted the variables that are out there. And at this point in time, we've given a guide for Q1. And as I mentioned in my comments, that's the extent of kind of what we are going to provide at this point. I'm thinking that the prior remote worker or work-from-home tailwinds might be leveling off here, which might negatively impact the tertiary markets, but at the same time, affordability is a bit squeezed and the tertiary markets provide a better value proposition. Well, Truman, I think, as we've talked about with our land acquisition strategy over the years, we've attempted to stay closer into the core, closer to the job market in some of the retail sectors. So we do have communities that are more in the growth rings and on the -- in the tertiary areas, but I don't believe that our land footprint goes out quite as far as maybe some of our competitors. So what I'd tell you is it kind of depends on -- it's a community-by-community situation that is, as much as anything, from a margin standpoint, dependent on the structure of the land deal. And like, I think, you've heard from us in a lot of situations, we don't underwrite the gross margin, we really focus on underwriting to return. But going back to the question that John asked, we've seen relative strength and improvement in kind of sales across the board, that's not just geographically speaking, but that's community by community as well. Ryan, just on the margin, I know you're not guiding beyond 1Q, but I'm just curious if you could talk through a little bit. And while I understand there might be a little bit of a lag there given they're maybe more spec focused than you are, it's still a little bit surprising to see the outperformance. I appreciate it, and I think, for those that have followed us for years, yourself in that category, I think everybody is aware that we've implemented a number of really important kind of changes in the way that we operate our business that has driven higher returns over the housing cycle, and certainly, higher margins have been part of that. We have highlighted on this call, in my prepared remarks, the way that we are going to run the business in this environment, which is a tougher operating environment. So while we believe that the operating model that we have is a great one, and we are really reaping the rewards from it, we won't be immune to some of the market pressures that are certainly out there. But we think that we are an efficient homebuilder, and we are going to continue to be very disciplined and prudent in the way that we are making pricing decisions. I think, over the last few months, we've heard a lot of optimism from homebuilders about their ability to renegotiate costs lower, especially as starts have pulled back as much as they have and what was shaping up to be a pretty volume outlook in '23. Well, Alan, it's going to be tricky, and I will break down a couple of components that we are looking at on the cost side. And I think affordability is going to continue to be the theme as we move through kind of 2023, not just in housing, but I think in all consumer spending, consumers are feeling the affordability pinch, and it's part of the reason that we've worked so hard to find prices that we believe help to address some of that affordability pinch. Those wage increases have been real, and I think once those wage increases have been provided or given, they're hard to get back. Not impossible, but the material side -- not saying the material side will be easy, but I think we will likely have more success or easier success on the material side than we will labor. As I highlighted in some of my remarks, we've got some really aggressive goals that our procurement teams are working on to reduce overall costs. And it's interesting that, obviously, one or two quarters doesn't make a trend, but when you look back in prior years, the historical gap of gross margins was in the 200 to 250 bps range, and now we are talking double that, if not more. Because we all kind of remember the comments you made last quarter of not being margin proud, and you didn't have a significantly lower order growth number than we were looking for, but just wanted to understand kind of some of the puts and takes there, and if you're doing anything significantly different in the industry in the marketplace that might allow this larger gap to continue. Hopefully, you appreciate, when we provide commentary on our results, if there are unusual things happening, we tell you about them, whether it's in the form of an adjustment or when we present adjusted data. And to answer your question as directly as I can, there's nothing unusual happening in our margin in the fourth quarter. I think if you reflect on the answer that Ryan gave, and I can't comment on the relativity to other people's margins, what they're doing pricing lines, what we're doing pricing wise. So I don't know if that gets where you need to be, but there's nothing unusual happening in our margins. Yes, Mike, and let me maybe just pick up on the comment you made about the comment I made last quarter about not being margin proud, that's still 100% accurate. And we've tried to reflect that in the way I laid out, we are going to be operating our business, which is to find a market price that will allow us to maintain a predictable and consistent turn of our inventory. I think relative to our peer set, you can see that we are selling homes. I mean, I guess, I was trying to get to something you don't want to give, which is second quarter guidance, and we understand that. But I think people would kind of think, okay, you have a significant positive gap here as there were  drop maybe in the backlog that might allow that gap to revert to normal, but it doesn't sound like that's the case. I guess secondly, the SG&A guidance was pretty encouraging as well given the decline in closings yet the midpoint being similar to a year ago. And if we were to expect a similar type of percentage decline in the coming quarters, given what you've been able to do in the first quarter, is that something where we could see a similar SG&A in spite of a 5%, 10% or, let's say, 10%-ish decline in closings? Yes, Mike, hopefully, you can appreciate we -- on our most recent call, had highlighted we would be looking at our overheads to make sure that they are efficient given the scale of the business that we are operating today. As it relates to beyond the first quarter, like everything else, there's -- it's a volatile -- not a volatile, but it's a market in flux. But I can tell you, we will be looking at our overheads as part of -- as we see the business develop, we will develop our plans around overhead spend as well. When you talk about the lumber costs being up year-to-date and that impacting maybe the back half of the year, just wanted to get a sense from you. I mean, on a dollar basis, it's significantly lower than it -- the percentage is kind of obfuscates the dollar amount, which is somewhat lower on an absolute basis when you think about where lumber was. And secondly, I would presume there's also some amount of potential labor savings that might come through in the back half just given where the market has gone over the last 6 months and a 40% increase in lumber, all else equal sounds one way, but, to me, there's potential offsets to that. So -- and Ryan, I think, said it well. We typically have the pricing of the lumber impact our closings two quarters in the future, right, because when we order then build the house so the pricing we feel in the market, we feel in our income statement two or three quarters later. And I would tell you, other than lumber, it's been an inflationary market, so we've seen pressure on pricing. Obviously, we are working with our trades, and it's how we build, where we build, can we help them be more efficient in order to offer us a better price, and that's what our procurement teams are working on right now. And as we highlighted in the prepared commentary, that process, whatever it yields, will impact our margin profile likely late in '23 or even into early '24 by the time those price changes get negotiated and then start flowing into houses that would close with a 6-month build time, again, two, three quarters from now. you mentioned, Ryan or Bob, the mix of deliveries 36% first time, 39% move up, 25 active adult. I don't know that meaningful, but certainly, you heard a couple of things hopefully from us. Our community count, which was up 8% year-over-year, the preponderance of that is in first-time communities. But yes, I would tell you that first-time has been -- even if you think about the sales paces in the quarter, the decline was the lowest in that first-time space. Yes, Carl, it's a great question. And as I think you're aware, we are really proud of our Delaware business and what it adds to kind of the overall mix of our portfolio. On the positive side, you highlighted it's a thin resale inventory market. They've been able to sell their home, but I think at pretty good price. A couple of other things that I'd highlight, relative to the other two buyer groups that we serve, they were -- the active adult was in the middle. Again, I think because they don't have to move, they've got options, they can be a little more patient. They were certainly more strong -- or did better than the move-up buyer, I think, mostly driven by the fact that they're not as rate sensitive. So on balance, Carl, we feel pretty good about the active adult space, kind of all things considered. Anthony, I think what I would tell you is that it's fluid. And sometimes things that start as kind of discounts off of a price or adjustments to lot premiums, sometimes those are rolled into kind of base price changes or base price reductions. So, to Bob's point, we are not going to probably break it out at this point. But you can see, based on the incentive load that I talked about as well as the kind of reduction of base price, we are finding what we think is the market-clearing price to continue to sell homes. So in answer to the first question, I think we, on average, been buying 3 to 4 years of land. When you add in development time lines, land is going to be hanging around 4 -- in the neighborhood of 4 years. And so if you think of that, pre-pandemic land would be kind of working its way through the system now. In response to the impairment question, obviously, we do impairment reviews every quarter. We are coming from a pretty strong margin position, but we always look and, for instance, in this most recent quarter, we actually looked at 16communities for impairments and impaired 4 of them for about -- it was about $2 million in costs that flow through the quarter, the other 12 did not. And so I think, absent some real structural shift in the market, I wouldn't anticipate a widespread kind of remark of our book. I think you will continue to see us as we look at this, evaluate communities one by one. And depending on the market conditions for that community, if we are in a position like we were with these four communities in the quarter, we'll adjust. In terms of the incentives, I think -- and maybe I'm mistaken, but I think the incentives, given we are on closings, the increase to 4%. Can you just help us understand, you talked about the improvement in demand, but also making further adjustments on price incentives. And to the comment that Ryan just made, I think he said it well. And so if you adjust base pricing, it doesn't show as an incentive, it's just a lower sales price. And so on a relative basis, over time, we are in a position where we haven't given a guide on margin. We have given you what the incentive load went to, which was 4.3%, which is almost double, but there were price changes embedded in that, too, right? So all those things factor in, so the guide we've given for Q1 margin reflects everything that we've done to this point, and I think we will leave it there. Yes, Mike, we don't -- we've never kind of given that type of kind of inter-quarter trajectory. So we are going to leave it probably where we're at, which is we are optimistic and encouraged, not only based on what we saw things kind of progressed through the fourth quarter, which, as I mentioned, is pretty atypical to see the fourth quarter build strength, but we've certainly seen that strength also continue into January. But all things considered, the operating environment, which we've -- I think we've talked at  is going to be more difficult. Encouraging stuff regarding your comments on the market, and that certainly aligns with what we're hearing as well. So you're actually not seeing them able to qualify compared with, let's say, what you would have seen in 2019. And when you think longer term about your business, I think you said 25,000 starts or something like that. How much of that production do you expect to be used for rental purposes relative to, again, a normal time, let's say, 2019. I would tell you rate -- the first, your comment on rate, rate is part of it. What's really driving kind of the sales trajectory right now is affordability, and rate is part of that equation. We've also done things in the way we've repriced, the way we've created incentive loans that have helped so affordability as well. Just to clarify so everybody is on the same page, we've got enough production based on what was already in production, plus what we intend to start that will deliver in this year such that our universe -- our production universe will be big enough such that we'd expect to have enough homes to close, approximately 25,000 homes. So -- and then from a rental -- your rental question, we've targeted -- if you go back to the announcement we made a few years ago that we want to do -- have roughly 7,500 homes over a 5-year period, kind of works out to be about 1,500 homes a year once we get fully kind of ramped up. So fairly small piece of our business, which is kind of how we strategically designed that. I guess the good news is, Stephen, we haven't seen a change really in people's ability to qualify, or we haven't seen people not being able to qualify increasing in a disproportionate way because of the rising rates. So over the -- I won't say that I know that versus 2019, but if you look back over the last year or 2 we have seen a pretty consistent cadence of the percentage of people that are canceling contracts because they can't qualify. I guess, Ryan, you just mentioned you sort of were more specific about your comment about that 25,000 unit mark, and that's helpful. And what I gathered from your comment is that you may actually start fewer than 25,000, correct me if I'm wrong, and so you're addressing sort of your ability to sort of scale down your starts as you have because you actually, I think, peaked at like 35,000 starts in 2021, I think it was. Well, Stephen, so there's a lot to unpack there. We've highlighted with the amount of land that our land spend for the year, which is going to be down substantially from 2022 with the lion's share of kind of what we're going to spend in 2023 be in development. Soon stuff that we've owned and we've purchased and we've underwritten and we're -- and we've got it in the kind of entitlement pipeline, we are going to spend the money to get those communities developed and open. So assuming the market cooperates and we see continued strength, I think that we've got the land pipeline such that we can ramp our production in concert with the consumer behavior. I think it was the â\u0080¦\n In lots owned, yes, decline in lots owned this year or next quarter. Well, like anything else, it depends on the demand environment, how many homes we close for lots, as an example, part of it will be things that are under option today. So it's hard to give you an answer on that, Stephen, because we are negotiating contracts all the time. Stephen, that's what I was trying to address with my commentary around land. But suffice it to say, I think we've got a production machine that's capable of delivering that if demand is there. Well, there's less production overall in the supply chain. There was also a decent sized piece of it in terms of the work environment, work-from-home, safe work environment, less inspectors in the job sites -- on the job sites, less permit reviewers in municipal offices. I mean it was really a combination of things, but probably the biggest variable that is really -- I don't want to declare victory, but it's probably better than it's been over the last couple of years as the supply chain environment is healing."
}