{
    "symbol": "BR",
    "quarter": 1,
    "year": 2021,
    "date": "2021-11-03 13:17:10",
    "content": " The biggest driver of our 7% organic growth across all 3 of our businesses was the on-boarding of closed sales, as we continue to invert our $385 million backlog into recurring revenue. Finally, our strong start to the year puts us in a very good position to reaffirm our full-year guidance, including 12% to 15% recurring revenue growth, and 11% to 15% adjusted EPS growth. Beyond those 3-year objectives, we are focused on delivering sustainable, long-term growth driven by ongoing industry trends and investments across our governance, capital markets, and wealth franchises, in turn generating consistent top - quartile shareholder returns. Regulatory revenues rose 23% to $165 million, powered by higher mutual funded ETF communications, strong equity position growth in the U.S, and closed sales revenue. Broadridge delivered strong first quarter results with 16% recurring revenue growth driven by new sales, strong underlying volume trends in the acquisition of activity. When you look at Capital Markets of wealth management, inside of that 30 billion in market opportunity, we're coming off a strong year in GTO overall at 7% in fiscal year 21 and now 21% this year, a lot of that as I activity of course, but the organic business in GTO was 2% growth. If you think about back component, it grew at 6% for the quarter, that's well within our 5% to 7% organic growth objectives, and that's coming from continued onboarding of new sales and the retail trading that we've seen. It grew 6% in this quarter, and that's a contribution of both continuing to bring on close sales and having strong retail trading growth help drive that business as well. I thought it was something that -- whatever, not a big percentage change from the June quarter, but I know I'm just trying to make sure I understand what's going on\n In this quarter, Chris, you're going to see about 6% growth of that, about 5 points of it is on the organic component."
}