{
    "symbol": "BR",
    "quarter": 4,
    "year": 2021,
    "date": "2021-08-12 15:05:13",
    "content": " ICS recurring revenue rose 11% in fiscal '21 to $2.1 billion, driven by both new sales and internal growth. The net result of strong fiscal year '21 results, continued execution against our growth strategy and outlook for continued growth in '22 means that Broadridge is well positioned to deliver at the higher end of our three year growth objectives, including 79% recurring revenue growth, and 8% to 12% adjusted EPS growth. For the full year, regulatory revenues rose 20%.Issuer revenue also contributed to growth rising 20% in the fourth quarter to $106 million and 21% growth for the full year. Full year revenues rose 5% driven by the fiscal year '20 acquisition mentioned earlier, in revenue from net new business. For the full year, customer communications revenue growth was slightly positive but more importantly, higher margin digital revenues within customer communications grew by 15%. Across both capital markets and wealth, solid revenue growth from new business was offset by $7 million of lower license revenue which declines as expected and modestly lower trading volume. For the full year, GTO revenues rose 7% to $1.3 billion driven by four points of organic growth and three points from acquisitions. While higher distribution revenues contributed to our overall growth, their share of the full year total revenues declined to 31% down from 32% in fiscal year '20 and 38% five years ago. And while there might be some quarterly cyclicality, we expect full year fiscal '22 event driven revenues to be approximately $220 million in line with the fiscal year '15 to fiscal year '21 long term average. Our guidance for fiscal '22 calls for low teen recurring revenue growth, healthy margin expansion, and another year of strong adjusted EPS. We are expecting our adjusted operating income margin of approximately 19%, up from 18.1% in fiscal year '21, driven by a combination of incremental scale, digital, efficiency gains, as well as the addition of the higher margin activity business. Good morning, for your fiscal '22 guidance, could you discuss some of the potential tailwinds that take you to the high end of the 12% to 15% recurring revenue and 11% to 15% EPS growth range and the headwinds that might land you toward the lower end of that range. So as you think about the variability in our model, going to fiscal year '22, I think we'll continue to focus on executing on sales, converting that sales to revenue, driving the activity integration, I think event driven revenue is more in line with what we've historically seen in volumes are back to mid single digit levels. I think we expect to get back in our organic core business back into the 5% to 7% growth range across both of those businesses really driven by net new sales, as Tim talked about earlier in both our capital markets business and wealth management business. But I think you'll start to see driven by new sales, let's get back to the 5% to 7% three year objectives that we have across both of our businesses. We did a really landmark study of investing patterns and investors based looking at across $7 trillion of assets that we concluded last year, and it really did show how the millennial are here and their proportion of positions and a growth is really an interesting, but nevertheless, we are seeing really strong growth across all segments of brokerage firms. I don't whatever I'll ask if you quantify Robinhood is the size of a customer, but I imagine it fits in the context of what I seen in your 10-K that like -- your, I think your, yes; your largest customer was 6% of revenues in the last couple of fiscal years."
}