{
    "symbol": "BR",
    "quarter": 3,
    "year": 2021,
    "date": "2021-05-04 14:54:04",
    "content": " The net result of all these points, our strong third quarter results, our continued internal and M&A investment and our outlook for fiscal 2021 is that Broadridge is executing well and is on track to deliver at the higher end of our 3-year financial objectives, including 8% to 12% adjusted EPS growth. As a result of that strong organic growth and an increase in our outlook for the fourth quarter, we are raising our guidance for recurring revenue growth to 8% to 10% for the full year, up from our prior guidance of growth at the higher end of 3% to 6%. Regulatory revenues rose 20% to $290 million driven by the 20% equity record growth, higher mutual fund and ETF communications volumes and net new sales, including from our Shareholder Rights Directive 2 solution that Tim highlighted earlier. Capital markets revenues fell 1% of strong growth from international sales, was offset by $6 million in lower license revenues, which declined as expected. Total revenue growth this quarter was stronger than usual, reaching 11% with distribution revenue contributing 3 points due to the increased mailings that correspond with the high record growth and the increased event driven activity this quarter. And I will also note that we continue to feel good about our recurring revenue backlog, which was 12% of our fiscal ‘20 recurring revenues as of Q4 ‘20 and gives us great visibility into our top line growth. We expect Itiviti to add $25 billion to $30 billion or 1 point to our full year recurring revenue growth, which equates to 3 points to our fourth quarter growth. In fiscal year ‘22, we expect Itiviti to add approximately $250 million or about 8 points to our recurring revenue growth. Now turning to guidance on Slide 17, we are raising our outlook for fiscal ‘21 recurring revenue growth to 8% to 10% from the higher end of 3% to 6%, and that includes 1 point of growth from Itiviti. We continue to expect our adjusted operating income margin to expand to approximately 18%, up from 17.5% in fiscal year ‘20 as we balance near-term returns with continued investments to sustain long-term growth. And finally, thanks to our consistent investment in our capabilities, we are on track to deliver another year of $190 million plus of new closed sales, which combined with our strong backlog, positions us well for additional recurring revenue growth. I will also add, Chris, when we gave the 3-year objectives, we talked about 5% to 7%, organic recurring revenue growth and we talked about, 1 to 2 points from M&A in acquisition and Itiviti makes it I think that’s what makes us feel good about the objectives is that, Itiviti comes on and adds this type of contribution putting us at the higher end of those 3-year objectives."
}