{
    "symbol": "UEPS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-11 21:21:10",
    "content": " This is a key milestone in the evolution of our business and is timed to coincide with the transformational acquisition of the Connect Group, which is an important building block in achieving our stated objective of establishing a leading FinTech focused on providing innovative digital solutions to merchants and consumers in Southern Africa. Together with the Connect Group, Lesaka has over 58 and a half thousand touch points with our consumers and merchant customers positioning us with a significant opportunity to gain market share in this estimated $11 billion market. Growing our merchant business with the transformational connect group acquisition competitively positions us to capitalize on an exceptional growth opportunity, especially in the informal market. Looking at our Kazang business, providing VAs and bill payment solutions, we've seen a 3-year compound annual growth rate of 26% in device growth resulting in around 46,000 active deployed devices. This has been a real success story and demonstrates the value that we bring to our informal merchants through this offering as discussed our card connect and Kazang Pay business provides payment solutions to our targeted formal and informal merchants, respectively. Our cash connect business, which targets predominantly the formal SME sector has been very resilient during the disruption over the past years and returned a 3-year compound annual growth rate of 18% in transactional throughput to $99 billion for the 12 months to save 2022 with the recent expansion into the informal sector, as well as expanding our market share in the formal sector, we anticipate this good growth to continue. We've seen a 3-year compound annual growth rate of 58% in the number of loans extended and a 69% compound annual growth rate in loan capital advanced as mentioned, we have advanced 1.2 billion to SMEs since inception and closed Feb 2022 with a loan book of ZAR 211 million being 64% up for the 12 months ended Fe 2022. We are very excited by the prospects for the business, especially as part of the greater Lesaka business with respect to the informal merchant market and low income consumer market, Lesaka and connect group have both made significant inroads in bringing financial inclusion to the underserved."
}