{
    "symbol": "SOR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 19:54:04",
    "content": " You can ask text questions at any time by locating the Q&A box on the left side of your screen, type your question and click new questions to submit. Good afternoon, everyone, and thank you for joining us today. In just a moment, you will hear from Steve Scruggs, the Portfolio Manager of the Strategy. Over those 20 years, the Fund has delivered benchmark beating returns with less risk over the long-term and protected capital during every large drawdown. First, we often get questions regarding availability of our Small Cap Value Fund on various platforms and we want to update you on our progress. The Fund is currently available on most major platforms, including Fidelity, Schwab, LPL, TD Ameritrade, Ameriprise, Commonwealth, Wells Fargo, RBC, Raymond James and Vanguard. If you have any trouble transacting in the Fund, please feel free to reach out to crm@fpa.com and we will be happy to assist. And finally, Steve and I have collected questions from investors and turned it into a little Q&A, which will allow Steve to provide his views on the small-cap market, review the strategy and walk through an investment example. If at any time during this webcast, you have questions, please submit those through the device on your screen and we will get to them at the end of the presentation. The audio, transcript, slides and a visual replay of todayâ\u0080\u0099s webcast will be made available on our website, fpa.com and that typically takes about a week to two weeks. Steve, I think, you are still on mute. The recent period shows that making a lot of money in a frothy speculative market, it doesnâ\u0080\u0099t really matter if you are going to give it all back when stock prices fall. Itâ\u0080\u0099s based on classic Benjamin Graham principles, we always focus on fundamentals is regardless of what the market happens to be focused on. We are confident that in the long run, it always gets back to fundamentals. Because we participate enough in the up markets and we hold up better in down markets, our investments compound better over time. And since inception and over the most recent cycle, we have met our objective and we have done it with considerably less risk, measured either by standard deviation or market drawdown. And by that we want companies that have staying power, ones that arenâ\u0080\u0099t reliant on capital markets. These are ones that are going to get through any unforeseen crisis that would happen, whether itâ\u0080\u0099s an economic or financial crisis or pandemic, ones that arenâ\u0080\u0099t going to get an unpatched and ones that are going to have staying power. We look at management, just management that can lay out a strategy and execute to that. If they do that, itâ\u0080\u0099s going to show up in the financials. We would love to see management take calculated risks, try new things as long as they are open and honest about it, and we donâ\u0080\u0099t like to see what to see management take -- make wholesale bets on changing the direction of the company. We will typically are going to avoid commodity industries, overly competitive industries and make sure that the companies are competing in industries that have attractive long-term growth expectations. And so as we go through this process, it leads us to a portfolio of high-quality companies. And most are mature companies, they are consistently profitable and they show a slow but steady growth and this process is what helps us with downside protection. Itâ\u0080\u0099s going to have a rock solid balance sheet, a great management in an attractive industry thatâ\u0080\u0099s trading at a 12% free cash flow yield. So when we go through the pillars, balance sheet, thatâ\u0080\u0099s one of the things that helps us provide us with downside protection. And it also allows us to take a long-term view, because we have confidence that these companies can make it through any type of short-term disruption. But we also -- we model every -- when we are coming up with an estimate of intrinsic value, they are all modeled with expected rate of return that we think we need to get based on the riskiness of the company. And then when we look at management, we are not just looking at the management of the company, but also the culture of the company, what their business model looks like and what are the things that they are focused on. And lastly, the industry analysis, over the last 20 years, the mistakes that we have learned from, the most common one was buying a really cheap company in an industry that was in secular decline. So this, on one hand, helps us avoid value traps, but it also leads us to companies that have the wind at their back with regard to the industries they are competing in. You and I both really like this chart, because it shows how the Fund has performed during various market types and the Fund is again very consistent. During times of market weakness, we protected capital better than our benchmark and our peer group. And our outperformance during this -- the most recent downturn, itâ\u0080\u0099s in line with what our expectations are. As I say, we are going to outperform -- we tend to outperform in down markets and we are going to trail somewhat in robust markets. But what this chart really shows is, when you look at it on a rolling five-year return basis, since the Fundâ\u0080\u0099s inception, this correlation is very strong. When the benchmark is down, the Fund has outperformed in 23 out of the 23 instances when there was a five-year rolling return period that the Russell 2000 Value was down. When markets return between zero and 10% on a five-year period, the Fund outperformed roughly 70% of the time. So we are in a -- what we would call a normal market, not that there is anything such as a normal market. But in a market like that, we outperformed 70% of the time. But when the market average return is greater than 10%, we have only outperformed 7% of the time. But if you do -- if you see, our performance during those periods was about 12% versus roughly 14% for the index. So when we look at that on a full market cycle basis, by taking this long-term view, we have achieved our objective and itâ\u0080\u0099s our long-term view that allows us to do this. In 2022, the Russell 2000 broad small-cap, it fell over 20%. Small-cap energy stocks, if you look at measured by a broad-based small-cap energy ETF, they were up about 50% last year and that was after being up almost 60% the previous year. And as I said earlier, we typically are going to avoid energy in the portfolio, because the long-term track record is not an impressive one. It is -- I mean, if you think you can predict the price of oil, you can trade in and out of those companies and be profitable, but we are not going to try to predict short-term movements in oil prices. And incidentally, the ETF that I just mentioned, the one that was up 60% last year -- 50% last year and 60% the year before, over the last decade, that Fund is down over 80% and that is a broad-based small-cap energy ETF. But our lack of energy for 2022, thatâ\u0080\u0099s one of the things that hurt our relative performance and we are okay with that. We also had a couple of individual holdings that did poorly, one in particular is Synaptics. We sold a good portion of our holdings due to valuation during 2021 and then we sold a little bit more in early 2022, but we still had it as an equal weight. And in spite of the recent price decline, when we look at the fundamentals, they look great. We feel good about the company, and in fact, late last year, we started adding back to our position. And as far as portfolio positioning, there were no fundamental changes to the portfolio during the year. We initiated six new positions, companies that were really beaten up and we also had four portfolio holdings were bought out during the year. And we get asked about this a lot, because tech stocks arenâ\u0080\u0099t what you really think of when you think of small-cap value stocks. They are process companies, distributors, component manufacturers, and all of them are consistently profitable with very strong balance sheets, and right now, a lot of them are trading at really attractive valuations. When they make money, they make a lot of money when they lose money, they lose a lot of money. And unless you are going to be able to predict short-term movements in oil prices, you are not going to be able to know when to buy or sell, and we think thatâ\u0080\u0099s for gamblers and itâ\u0080\u0099s not what we do. And you can see, broadly speaking, small-cap companies are cheap. When we look within small-caps, what we are seeing is that, the lower quality companies were clearly hit the hardest last year, and many of those look statistically cheap. But when we look at the higher quality companies within small-cap, the ones that we are seeking to buy, they held up better last year. But, overall, I will say the opportunity set, itâ\u0080\u0099s much more attractive. We started last year with over 15% cash in the portfolio, and today, we are just under 10%. So things look more attractive, but we are not seeing broad-based screaming bargains like we have during some softs . Control by Barry Diller, who has a very long successful track record going back decades. And that may sound like something that Kathy Wood would say, but thereâ\u0080\u0099s a difference. He runs in a breakeven or slightly cash flow positive, so that heâ\u0080\u0099s not reliant on capital markets or outside funding. Another they bought a company called Meredith, which they merged into their Dotdash unit and it was a large merger or a large acquisition and integration did not go to smoothes plan. The two companies that they own significant stakes in one is Angi, which used to be known as Angiâ\u0080\u0099s List and it matches home repair contractors with homeowners. And between the two of those, they own about $1.2 billion worth of Angi and they own about $2.5 billion worth of MGM and this is for a company who has got a market cap of $5 billion. If you net out the stakes in those companies and the net debt, the remaining company is trading for about $1.7 billion. They are expected to do about $250 million in pro forma or not pro forma, in EBITDA this year. And so when you look at the two major holdings and publicly traded companies, you look at what we think Dotdash Meredith is worth, the company looks undervalued, somewhat undervalue. But then they have a collection of other companies that they are working on doing similar to what they have done in the past and thatâ\u0080\u0099s running them not for quarterly profits, but building the business. They want to make sure that the companies are self-funding, but they put profits back into R&D and marketing, et cetera. One is Care.com, which matches family care providers with individuals, it could be either a babysitter or someone for eldercare, does $350 million a year in business, revenue growing rapidly. So when you -- when we look at the core holdings of the business, we can get to a market valuation thatâ\u0080\u0099s greater than $5 billion and then when we look at these other companies that arenâ\u0080\u0099t as profitable but are growing quickly, we see a lot of optionality there. So if we go through the four pillars, if brief -- you briefly go to the four pillars and the way we would look at that, balance sheet strength with regard to their marketable securities and cash on the balance sheet. And when we model out what we think the Dotdash Meredith is worth, again, we get to something above the $5 billion market cap of the entire company. And then the remaining companies, we view as options. Companies like that are not our specialty to come up with levels of intrinsic value, because they arenâ\u0080\u0099t throwing off lots of free cash flow, which is one of the key things we like to see in our core investments. But as I say, they are profitable and they are growing, and itâ\u0080\u0099s because of Dillerâ\u0080\u0099s track record over many decades of running companies this way and doing so to the benefit of shareholders, we have confidence in that. And then lastly, if we look at the industry, the industries these companies in are all growing. One, the Dotdash Meredith online advertising had a rough year last year and it looks like itâ\u0080\u0099s going to be another rough year this year, broadly speaking. But as the company has gotten this integration finished, they have made some changes in some things. We think we are going to see some margin improvement there, even though it took a little bit of revenue out. So we like to see a company thatâ\u0080\u0099s willing to do that, sacrifice revenue for profitability when it makes sense and it clearly makes sense here to us. So, again, itâ\u0080\u0099s an equal weight holding right now, but we are slowly adding to it and expect to continue to do that. When we say we take a long-term view and long until, say, we are looking three year to five years out and itâ\u0080\u0099s not as though we think we know what the world will look like in five years. But what it does, it helps us approach investing with a long-term view and it helps us overlook some of the noise today and I will give some examples that may be helpful. And we have property casualty, underwriting profits are going to be under pressure in the near-term. When we look at a situation with a long-term view, we accept that we factored into our estimates of intrinsic value. And thatâ\u0080\u0099s an example at the company level, but the same holds true at a macro level. Right now, everyone is predicting a recession and it does seem kind of inevitable. And so then in six months, our prediction will be tested and we can see what we got right, what we got wrong, and then we would have to make another prediction and position the portfolio accordingly to that prediction. So having that long-term three-year to five-year view outlook, it keeps us from engaging in that fatal  task. At all times, we are bottom up with a long-term focus. And in some ways, markets have become more efficient with regulation fair disclosure, kind of evening the playing field with regard to what management can say and win in. And also technology -- the technology available to analyze companies efficiently, I think, has made more markets more efficient. But I also think in other ways, itâ\u0080\u0099s gotten much less efficient. And most notably, itâ\u0080\u0099s from shortsightedness and I think thatâ\u0080\u0099s from both investment managers and management. And while we think there is some value in that information that came out with that number, very often, the market overreacts to it and it provides us with an attractive opportunity a lot of the times. And back to shortsightedness, as an aside, within the last year, I have spoken with two friends and they are both C-level employees. And they both said independently and they were adamant about it that they would never work for a public company again, because of the shortsightedness. And while we have learned a lot over 20 years, our framework remains the same, and we think a consistent process will lead to consistent outcomes. We focus on the diligence, discipline in patients and taking a long-term view is core to what we do and we are sure that thatâ\u0080\u0099s not no change. And as I started this, our goal remains the same and has to outperform the Russell 2000 Value over full market cycles and we think we can continue to do that. The valuations that you are starting at, look, 10 years ahead, you are going to have better returns if you are starting from a lower valuation than a higher valuation. Historically, rising rates have helped small-cap stocks versus large-cap stocks. And then also a recession -- coming out of recession, small-caps and small-cap value in particular, have led the way out of eight of the last 10 recessions. We donâ\u0080\u0099t know what interest rates are going to do, but higher interest rates have historically helped small-caps, again, thatâ\u0080\u0099s just relative to large. And if we should go into a recession, which we think is very possible, although, we have no idea what the depth of it, we think that a lot of the worries of a recession are priced in. Coming out of that, small-caps 80% of the time over the last 40 years have led the way out. We invite you, your colleagues and shareholders to listen to the playback of this recording and view the presentation slides that will be available on our website within a few weeks at fpa.com. We urge you to visit the website for additional information about the Funds, such as complete portfolio holdings, historical returns and after-tax returns. Following todayâ\u0080\u0099s webcast, you will have the opportunity to provide your feedback and submit any comments or suggestions. If you did not receive an invitation via e-mail for todayâ\u0080\u0099s webcast and would like to receive them, please e-mail us at crm@fpa.com. We hope that our quarterly commentaries, webcasts and special commentaries will continue to keep you appropriately informed on the strategies discussed today. These views may differ from other portfolio managers and analysts at the firm as a whole and are not intended to be a forecast of future events, a guarantee of future results or investment advice. Any statistics or market data mentioned during this webcast have been obtained from sources believed to be reliable, but the accuracy and completeness cannot be guaranteed. You should consider the Fundâ\u0080\u0099s investment objectives, risks and charges and expenses carefully before you invest. The prospectus details the Fundâ\u0080\u0099s investment objective and policies, risks, charges and other matters of interest to a prospective investor. The prospectus may be obtained by visiting the website at fpa.com, by e-mail at crm@fpa.com, toll-free by calling 1-800-982-4372 or by contacting the funded writing."
}