{
    "symbol": "ONDS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 12:22:13",
    "content": " I want to start the call by highlighting that business momentum remains strong at Ondas, with both Ondas Networks and American Robotics leveraging their respective technology platforms to drive market adoption and deployment, which we believe will result in substantial growth. This American Robotics field work with customers along with the ongoing regulatory work with the FAA is positioning us to define the market for automated, drone-driven data solutions in terms of how they're architected and delivered to large, sophisticated blue-chip companies in critical sectors of our economy. Lastly, I want to highlight that our operations team at Ondas has been working diligently to prepare for the volume orders we expect from the class one rails of Siemens, we have now qualified and secured contract manufacturers and component vendors, and this is important work as we navigate supply chain issues like those reported by many technology and industrial companies. We utilized $8.8 million in cash during the quarter, which included $7.1 million of cash used in operations, reflecting primarily operating expenses related to serving customers for Networks and American Robotics. We used $1.6 million in investing activities primarily related to one-time capital expenditures associated with the build-out of the new welcome headquarters for American Robotics and Ondas Holdings, in addition to spending related to building out Scout Systems. We continue to expect Ondas Networks will generate orders this year from at least five railroads, and we're maintaining our goal of at least $20 million in bookings, and I will highlight that this bookings target is a significant component of our bonus plans at Ondas Networks. American Robotics will continue to scale operations in its key target markets, oil and gas, mining and rail, as we expand the number of customers in Scout installations and do the work to transition these franchise customers to fleet orders."
}