{
    "symbol": "ONDS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 15:32:03",
    "content": " I'm happy to be joined today by Derek Reisfield, our President and CFO; Stewart Kantor, the Founder and President of Ondas Networks; and Reese Mozer, American Roboticsâ\u0080\u0099 Founder and CEO. If you look at Ondas Networks, American Robotics and now with Airobotics, where we are in the process of acquiring, we have collectively invested well over $250 million in our businesses. We believe the revenue ramp will start with Ondas Networks, where we continue to advance the 900 megahertz network with Siemens and the Class I rails. At American Robotics, we continue to make progress with customers toward large revenue opportunities. We have learned a lot in the field in new verticals, including oil and gas and mining in our engineering the scalable solution by integrating new data capabilities with payloads and analytics development. Airobotics is similarly progressing their plan, while we and the Airobotics team more closely on supporting the integration of the two companies. I will then provide a brief update on Airobotics, focusing on the deal time line and highlighting the integration activity between the two companies as well as recent significant customer announcements. To sum it up, we have secured an agreement for investment of up to $60 million in Ondas demonstrating, in my opinion, a strong belief in the value of our technology, end markets and growth outlook across Ondas Networks, American Robotics and soon Airobotics. Moving to Airobotics, I would like to provide an update on the deal time line and business progress. We have spent time with Airobotics customers and partners and they are very happy with the strength of the combined company, both from a balance sheet and technology standpoint. Similarly, our customers here in the US with American Robotics are excited about the breadth of services we can offer in future product development road maps. We believe we will see significant interest in the United States for the Airobotics Optimus platform from both commercial and government customers, as well as potential strategic partners. Last Wednesday, Airobotics announced that a UAE government agency in Dubai has placed a $2 million follow-on offer for two Optimus Drone platforms. Importantly, this order marks the initial rollout of a fleet of autonomous drones that will be deployed by Airobotics with this customer throughout the city of Dubai. From a regulatory standpoint, operations of drones, both autonomous and piloted have to pass an incredibly high bar in terms of reliability and safety to be widely deployed and that bar is even higher for heavily populated environments. As I get started, I want to remind our investors that our financial statements reflect the investment and preparation for larger commercial rollouts within Ondas Networks and American Robotics, which we believe we will soon see. Revenues for the periods presented have been generated by FullMAX product sales and service revenues for customers, including Class I railroads, in addition to product development programs with Siemens. Of course, we believe this activity has served to establish the broader opportunity and will lead to significant growth in the FullMAX based wireless systems and Scout deployments in the coming years. As we have described in our prior calls, due to the historically lumpy nature of development programs and customer product sales and services, gross margins can be volatile on a quarterly basis. Operating expenses, increased to $13.9 million for the third quarter of 2022, as compared to $4.9 million in the prior year. The increase in operating expenses was primarily due to spending at American Robotics, where we grew headcount over the last 12 months to support customer activity and due to deal expenses incurred for the Airobotics acquisition. Depreciation and amortization expenses increased from $700,000 in the third quarter of 2021 to approximately $1.3 million in the third quarter of 2022. Operating expenses in the third quarter of 2022 also included approximately $1.7 million in professional and advisory fees, related to the Airobotics acquisition. Excluding non-cash expenses and non-recurring professional fees related to the Airobotics transaction, operating expenses were equal to approximately $9.5 million, which were higher than expected due to accelerated spending on customer-related activity at American Robotics. While our operating expenses were higher than initially expected, we believe the additional investments we made were prudent and necessary for the expansion of our services and capabilities to ultimately drive larger revenue opportunities over the longer-term. The company realized an operating loss of approximately $13.5 million for the third quarter of 2022, as compared to $4.9 million for the third quarter of 2021. As noted, the increase in both cash and non-cash expenses related to the business development activity and the addition of American Robotics operating expenses, which were not included in last year's full Q3 results were the biggest driver of the year-over-year increase in operating losses. I will start by reiterating that our business plan is on track, and we believe we are creating significant shareholder value as we work with customers to adopt our technology platforms. While we are happy to begin building inventory with Siemens for commercial customer deployments in 900 megahertz, I want to be very candid about the pace of orders and our expectations for growth. Remember, our rail customers are operating a mission-critical network, a decision that is a 10, if not 20-year commitment to our platform and involves nearly all aspects of their trading operations. We continue to expect additional orders in backlog growth, which will lead to a breakout year in 2023 in terms of realizing shipments and revenue. To that point, Stewart will shed more light on the work we are doing to secure additional orders, both from the initial two Class I rails, we are the first to deploy on the new 900 megahertz network in the other freight rail operators as well. As Stewart will highlight, the internal activities that the two initial rail launch customers are undertaking to support commercial deployments have been successful, which is moving us closer to an order ramp. Before moving to American Robotics, I want to highlight that our success with valid in the platform with Siemens and on the 900 megahertz network is leading to adjacent network and end market opportunities. We are now developing on locomotive products for the Class I rails for the 450 megahertz network in North America, in addition to similar on locomotive products tailored to large Asian and European markets. Today's announcement, that Siemens has placed an initial order of the jointly developed on locomotive 802 radio for a large Asian railway is a signal that our FullMAX models platform has broad, global opportunities. As further evidence of broadening opportunities, we announced an initial order from ELTA, a large Israeli defense contractor for a maritime network deployment to support coastal surveillance in a large Asian country. This program with ELTA began several years ago but was slowed by COVID-19, we are happy to see it back on track, and we expect follow-on orders for this homeland security project in use case in 2023 and beyond. At American Robotics, activity supporting solutions for marquee customers continues. We announced a new oil and gas customer who is deploying in the strategically important Permian Basin, in addition to a new program with Nevada Gold Mines, as we continue to concentrate our energy on developing a scalable set of data solutions for focused industries. I will reiterate, we believe the acquisition of Airobotics clearly positions Ondas as the leading provider of autonomous drones for data-intensive, industrial and government services, and we have already done substantial work on integration in front of the deal closing. As most of you are aware, in the last call, we announced our initial volume order from Siemens for the 900 megahertz greenfield network in North America, where we now have five of the Class 1' active with our FullMAX technology; and two, having completed their launch activities. This order from Siemens was a pivotal event for Ondas Networks, and we're well down the path to scaling production, including having qualified contract manufacturing to start deliveries this quarter. We believe this initial volume order is a reflection of the progress MxV Rail, the AAR and the Class 1 Rails have made in qualifying Airlink dot16 and completing their associated launch activities. We expect these activities to drive follow-on orders and rail deployments, including expansion into the North American passenger and transit rail markets. And in September, we transferred the Rail lab to MxV Rail's new headquarters in Pueblo, Colorado, where the lab will be under MxV's control, along with ongoing support from Ondas. We expect new development programs on behalf of derails as MxV and their customers standardize on dot16 in the 900 megahertz network, in addition to other mission-critical Class 1 rail wireless systems. Evidence of this includes our announcement today of our first international volume order from Siemens for delivery in Q1, 2023 for a major rail customer in Asia. This is an on locomotive HOT radio, and it's part of a multiyear delivery program for a large railroad in Asia, with a total addressable market of approximately 10,000 units. We progressed on our development work on the advanced radio multiple, which is part of a new joint development program with Siemens UK for the European locomotive market, with deliveries expected in the second half of 2023. As previously announced, we have obtained a new order from ELTA, an Israeli-based global defense contractor for coastal surveillance in Asia, and that's to be delivered this year. In parallel, the rails are testing expanded use cases, which we expect to drive follow-on orders in 900 megahertz and other frequency bands in North America. Furthermore, the advanced radio module is part of a new development program to be delivered to Siemens Rail customers in Europe by Q4 of 2023. In M&A and partnership activity, we entered into the definitive agreement to acquire Aerobotics, one of the world's foremost leaders in autonomous drone systems, expanding our portfolio of industry-leading talent, industry-leading IP, and broadening our customer pipeline. This partnership was a direct result of customer requirements determined during our pilot engagements as well as the expected updates to EPA regulations, governing rigorous requirements for oil and gas companies to routinely monitor all existing assets across the United States from--. Regulatory reactivity, American Robotics received three new milestone approvals from the FAA, further solidifying our leadership position in fully autonomous BV loss approvals in the United States. The first, in the form of a new exemption permits wide-scale commercial operations of our autonomous Scout Systems without limitations on use by removing a prior restriction that constrained operations to R&D, crew training, and market surveys. The second approval, a waiver, permits expanded area for autonomous BB loss operations, unlocking inspection opportunities for customers with very large industrial sites and linear assets. Despite often misleading claims from other vendors, we believe American Robotics remains the only drone manufacturer in the United States to be granted the approval to operate fully autonomous drone systems with no humans on site. In commercial activity, we announced a new purchase order from a leading oil and gas company to deploy Scout Systems in the Permian Basin and continue to have other active oil and gas opportunities in the pipeline. Behind customer deployments and regulatory milestones, our team is working on a host of initiatives that we believe lead to significant and sustained revenue growth. Tying this to our customer pilot programs, we are in what can be considered Phase 2 with many of our customers, where we've taken learnings from our proof-of-concept phase and our integrating payload upgrades and analytics features that have been directly requested by our customers. One of the most notable payload enhancements in process is methane detection, which through our engagements with customers, including ConocoPhillips and Chevron we believe to be heavily driven by current and pending EPA regulations. As customers within certain markets require customized payload packages, this translates to an average of 12 to 18-month phase for this initial proof-of-concept and an average six to 12 months for initial fleet rollout, which we characterize as two to 10 units per customer. We expect this cycle to conclude in the third quarter of 2023, at which time we will enter an accelerated cycle where focus is no longer on design and new features, but instead success duplications, both within existing customer accounts as well as new ones. After initial fleet rollouts occur, we expect regional fleet rollouts to follow, followed by national fleet rollouts where we can expect hundreds of orders per customer account. With our customers in this market, we anticipate fleet readiness to occur in the first half of 2023. For Rail, we expect product readiness for the Scout System in the first half of 2024, though it's important to note that we expect pure SaaS sales of the Ardenna software to occur prior to that in 2023. First, let's recap some of the key differentiating features of the Airobotics Optimus system. Optimus comes equipped with up to 10 swappable batteries, up to nine swappable payloads, all powered by Airobotics ARM within the base station. As a result of this industry-leading feature set and reliability, last week, it was announced that Airobotics has received the first in history order for commercial fleet deployment of autonomous drone systems in an urban environment. Additionally, we believe similar fleet adoption opportunities for smart city use cases are in the pipeline. As a result of this customer success, planned increase inventory at Airobotics have begun, which we at Ondas are supporting. And as I mentioned a moment ago, we are working with Airobotics and plans to build inventory, which we expect to support revenue growth in 2023. The market opportunity for autonomous drone-in-a-box technology is massive, estimated at over $100 billion in annual recurring revenue and spans numerous sectors and use cases. Airobotics -- Optimus system targets the high end of the market spectrum, including smart city, security, public safety and defense, whereas, the Scout System targets a different set of markets with an estimated larger total addressable market, including oil and gas, rail, bulk materials, mining and agriculture. Together, we believe we are the clear market leaders in autonomous drone-in-a-box technology. As discussed, we are focused on ramping production at Ondas Networks to meet the initial demand from Siemens. Of course, our rail team is working in parallel with Siemens and customers to secure additional 900 megahertz orders from additional railroads. The networks being built by the railroads have 10 to 20-year lifetimes, if not longer, and of course, they are large. While we don't expect to meet our original bookings targets for 2022, we do see at least $8 million in product and developing bookings as a reasonable goal for 2022 and expect to secure significant growth in bookings in 2023. I want to highlight that we expect increased public dialogue in the rail industry regarding their support for the dot 16 wireless standard and plans to adopt our FullMAX platform, starting with the greenfield 900-megahertz network. As we have highlighted, the rail industry has been active in the IEEE 802.16 standards group and the Federated Rail Lab operated by MxV Rail is poised to become a showcase for our FullMAX technology in critical rail networks. Raising awareness within the industry, which, again, we expect the rail customers to do will help accelerate broader ecosystem in vendor participation, driving integration of more and more applications being developed to run on the network. Lastly, for Ondas Networks, we expect to continue to grow in new markets, as Stuart highlighted. We are tracking passenger and transit product and network development opportunities and look to transition those networks into formal development programs with customers and strategic partners in the coming months, if not sooner. Of course, we were also focused on delivering the new on locomotive products we plan to introduce with Siemens in both Asia and Europe. And similarly, we are targeting follow-on orders for the Asian Maritime networks with ELTA in creating new opportunities in Homeland Security. For American Robotics, we plan to selectively add customers in our targeted oil and gas, mining and rail verticals. Remember, the pathway to success sooner is much higher by concentrating on solutions development with a handful of motivated customers as opposed to solving the same problem with many customers at the same time. The scalable data solutions, combined with the capability and autonomy of our Scout system in the Airobotics Optimus system will be critical to drive fleet adoption. For American Robotics, we believe we're on the path to fleet adoption in 2023 in both the mining and oil and gas verticals with existing customers. Lastly, we expect to close the Airobotics acquisition in early 2023 with a target of mid- to late January. We believe American Robotics, India robotics have impressive customer opportunities and will deliver revenue growth in 2023 via fleet deployments. We expect cash OpEx of about $9.5 million for the businesses in the fourth quarter, not including ongoing costs related to the Airobotics transaction. We are attacking a huge opportunity at both Ondas Networks and AR and have an ambitious plan, but we need to earn the right to expand that plan, and that's by rewarding shareholders with upside. From here, we are extremely focused on driving revenue growth across our businesses and believe we are positioned to deliver meaningful revenue growth in 2023. This is important, not just for our investors, but I think if the topic, the wider drone industry has to embrace in front of what we continue to believe is a huge investment cycle in drones. From our view, the drone industry has made significant technical advancements in technologies ranging from UAVs and components, batteries, wireless communications networks and other infrastructure, payloads and data analytics in addition to professional services groups that are emerging in many other parts of the drone ecosystem. Importantly, customers and regulators are taking notice that these drone driven scalable solutions are emerging. The adoption cycles droves these scale providers and that's required for and will be valued by customers, regulators and importantly, investors. The industry needs significant consolidation, which we think â\u0080\u0093 we think we will see in the next three to five years, leading technology providers, industry talent, and investors should embrace this opportunity. We believe Ondas with our wireless and autonomous drone platforms and expanding global capabilities has a role to play, and we look forward to continuing to engage with drone industry leaders, regulators and investors to help drive industry growth. In the context of our leadership position, I want to reiterate again that, we believe our shares are undervalued, as we discussed on our last call, leading UAS platforms are valuable. I want to reemphasize, we believe the industrial and commercial markets for automated drone services targeted by AR and Airobotics may ultimately prove to be the most valuable of all drone segments. Before we turn the call over to Q&A, I want to reiterate that we remain bullish on the outlook for Ondas and believe our business is strengthening. We believe this starts with Ondas networks in that our drone platforms with American Robotics and soon, Airobotics will be strong contributors as well. So the timing still is -- in terms of the focus on the railroads, continues to be a three-year build-out with certain deadlines in 2023. And that's why you're seeing these orders come, and we expect to see more as we're moving into 2023. So Optimus system, there's a certain amount that are already manufactured and we're working to manufacture more to deliver for that Dubai order as well as some other orders that we expect to see in 2023. So as for the Airobotics Dubai contract, what I think I heard or what I read is that you have the potential of 24 units, and I believe I read or heard that there are $1 million of product per drone. The initial order, which is a follow-on order for beginning the role of the fleet, it was for two systems for $2 million. And as I said in the prepared remarks, we are working with the rail industry, including the customers, the AAR and MXP Rail to more broadly communicate the plans for the dot16 platform adoption in network rollouts. I think the Dubai order certainly represents a significant portion of the expected revenue in 2023, although we do see some other similar opportunities forming. I do think it's important to note that once a â\u0080\u0093 when a order like this is complete for the city of Dubai, the ability to duplicate that at a faster rate becomes a lot more feasible because other customers around the world see the success at this place and feel more comfortable about placing orders. Just what kind of additional regulatory approvals you need to get for Airobotics to sell it in other regions, particularly in the U.S.? And that's one of the reasons that we decided to join forces is because American Robotics has this unique approval set, driven by some of our intellectual property. Probably important to note though, that one of the unique things that Airobotics has is they're very far along in what's called the Type certification process, which is important to being able to fly over very populated areas. So that's not something that American Robotics has pursued, because we typically operate in very rural areas. But as far as duplicating the Dubai success in cities in the United States, Airobotics is extremely far along that path, and we expect some pretty big news around that topic over the next year. I guess...\n Mike, just one more thing on Airobotics and the rollout of fleet, so the Dubai order brings basically double the system and that starts the fleet deployments. And I'd also add that, we expect more than one-fleet customer building out in 2023."
}