{
    "symbol": "HCAT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 15:51:08",
    "content": " Our Q1 2022 total revenue was $68.1 million, representing 22% growth year-over-year, and we achieved positive adjusted EBITDA of approximately $700,000 with these results beating the midpoint of our quarterly guidance on each metric. Next, Community Health Network in Indianapolis-based health system customer was committed to ensuring its patients received appropriate primary and preventative care, but burdensome time-consuming documentation processes in the EMR made it difficult to improve performance and close care gaps, leveraging our DOS data platform and our embedded care gaps application, which was acquired through our healthfinch acquisition, our software-enabled community health networks providers to have visibility into care gaps within their workflow, decreasing the administrative burden on their care teams, and optimizing processes to use data and analytics to easily track and measure performance year round. And similar to what we shared a couple of months ago, our current pipeline continues to support the bookings expectations for 2022 shared at the beginning of the year, including net new DOS subscription customer additions in the high teens and a dollar-based retention rate between 108% and 111%. In the Professional Services segment, our Q1 2022, adjusted professional services gross margin was 29.3%, representing a decrease of approximately 220 basis points year-over-year and an increase of approximately 600 basis points relative to the fourth quarter of 2021. First, in terms of our full year 2022 year-over-year revenue growth by segment, consistent with what we shared on our last earnings call, we continue to expect the Technology segment to grow a little above 20% and the Professional Services segment to grow a little below 20%. Lastly, and consistent with what we shared -- on our last earnings call, we continue to expect some seasonality in our operating expenses, especially in the third quarter related to our Healthcare Analytics Summit, as well as the timing of certain other nonheadcount operating expenses, including the onetime Twistle integration expenses throughout the year. And that's encouraging for us when coupled with the fact that as we shared in our last earnings call, the most recent Gallup engagement survey data came in with team member engagement in the 96th percentile as that is such a central component of our differentiation as a company, we're really pleased to see some meaningful measures suggesting that things are going well. And then also, we've made a deliberate decision, including this last annual planning cycle to prioritize to your point, John, cash compensation for our team members so that we make sure that we're very competitive on cash compensation, and that was embedded in operating plan and our 2022 guidance was meaningful progress on base salaries and on cash compensation in general, which makes it easier for team members is still challenging, but it makes it easier for them to think about the equity component as a longer-term component of their compensation. So as we mentioned in our prepared remarks, based on our Q1 performance and our view of the pipeline today, we felt comfortable reaffirming the full year guide for both of those bookings metrics around net new DOS subscription clients and the dollar-based retention, and that's definitely informed by some encouraging data around the cross-sell."
}