{
    "symbol": "HCAT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 00:41:02",
    "content": " In the second half of 2022, we anticipate we will see an improvement in our pipeline conversion rates and timelines relative to the first half of the year, though there will likely continue to be some amount of strain on our near-term conversion rates given the ongoing end market financial pressure. This quarterly Technology revenue dynamic is driven by the items Dan highlighted previously, with our Technology dollar-based retention being in the low 90s percent range year-to-date, inclusive of the large enterprise DOS customer loss that accounted for a little over $1 million per quarter, along with some more modular reductions in our customers' application and analytics spend. Just to add to that, Dan and Jared, so Dan mentioned on the prepared remarks, Jared, but we're also, as part of our updated thinking around the operating plan and where we're investing and kind of deemphasizing, we're continuing to emphasize areas from a sales and marketing and a solution development standpoint that speak more to near-term financial ROI and savings opportunities for our customers and prospects. And then outside the one enterprise DOS subscription client churn that we referenced earlier, the other category of technology reduction that we're seeing is more in that modular client space, which as we've mentioned previously, we've always known is a little bit different space where they're not quite as deeply committed to Health Catalyst long term as compared with those more broad enterprise DOS subscription clients. Another kind of change, Jess, that we're reemphasizing and focusing on is a little bit less directly tied to kind of the more traditional sales force and team, but it's actually tied to our â\u0080\u0093 to Dan's point, our customer success and account management functions where part of what we're seeing this year to Dan's earlier comments is some trimming and pullback on the technology side of more modular components to what we do or more narrowly focused scope there."
}