{
    "symbol": "HCAT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 23:05:25",
    "content": " We were excited to hold this year's conference back in person in Salt Lake City, and we were energized by what we viewed as a highly successful growth-focused event that included over 1,000 attendees, representing more than 175 existing clients and prospective client organizations and included over 70 representatives from existing client organizations presenting their improvement case studies realized in partnership with Health Catalyst. Second, as it relates to tailwinds, while financial strain has continued to pressure health system budgets, in our recent sales conversations, we have heard a strong acknowledgment from our clients that our portfolio includes solutions that directly reduce health systems' current financial pressure, especially related to the segments of our offering that have a clear near-term financial ROI such as our Financial Empowerment Suite, our Population Health Suite and our tech-enabled outsourcing offering. In terms of the mix of our Q4 new client pipeline, we do anticipate a few opportunities with new DOS light subscription clients will begin at a lower price point than our historical average and will also include other newer platform offerings, including continued integration with the KPI Ninja platform component with significant upside opportunity over the medium to long term, which will enable us to get started with certain prospects while they navigate near-term budget constraints. Based on the multitude of client and prospect conversations that we have had over the last quarter, including at our Healthcare Analytics Summit, it is clear to us that there is high satisfaction with many aspects of Health Catalyst existing solutions, as clients and prospects are focused on the most effective ways to utilize our software and services to alleviate their near-term financial strength. We are continuing to make several strategic R&D investments in order to maintain our position as a market-leading data platform over the long term with a focus on providing our clients with a strong ROI over time, as we have continued to share these investment focus areas with our clients and prospects, including at our recent Healthcare Analytics Summit user group, the feedback was very enthusiastic and affirming of our R&D direction. Thanks for the question, Ryan. The first layer is, as I mentioned just a minute ago and in our prepared remarks, often that direct near-term hard dollar savings that we can offer through something like tech-enabled outsourcing or through our Financial Empowerment Suite of health really helps our clients feel that assurance that those are the kinds of cost savings that they can build right into their budget in the near term. Just to add to that, Dan, the other component, Ryan, that we're working on in addition to the kind of team member contributions that Dan mentioned and the use of the technology to share data and best practices and uncover opportunities for savings, we're also working on continuing to utilize our case studies, our success stories across our client base to share with other clients and prospects and what's working well. Thanks for the question, Ryan. One of the other benefits that we've seen over the last eight years is because we use our own technology to produce that meaningful savings often up to 15% savings relative to what the client has been spending, we do require that, in most cases, that our clients remain current on their technology subscription. But we have found that that's a benefit that Health Catalyst realizes, and it's one of the reasons why many of our clients are interested in tech-enabled outsourcing, where they've had a lot of difficulty from a hiring perspective and a retention perspective, and they see the results that Health Catalyst has achieved and believe that we can help them benefit from much higher engagement levels and much lower turnover levels as well. And certainly, right now, we wanted to be transparent with the investment community that we're certainly seeing certain elements of our portfolio, now that includes technology, meaningful technology like our Financial Empowerment Suite, like our Pop Health Suite and even with tech-enabled outsourcing, we use DOS heavily and other components of our technology like ARMUS heavily to automate steps in the process for items like chart abstraction that would have otherwise been manual."
}