{
    "symbol": "HCAT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 00:16:02",
    "content": " Building on this recent client success story, we are pleased to have announced today that INTEGRIS has recently meaningfully expanded its partnership with Health Catalyst, inclusive of an all-access technology subscription and a new tech-enabled managed services contract. As it relates to tailwinds, while we have seen that financial strain has continued to pressure health system budgets in our recent sales conversations, we have continued to hear a strong acknowledgement that our portfolio includes solutions that directly reduce health systemsâ\u0080\u0099 current financial pressure, especially related to the segments of our offering that have a clear near-term financial ROI, such as our tech-enabled managed services offering, our financial empowerment technology suite and components of our population health technology suite. At the same time, we anticipate some modular technology churn in our smaller, more limited client relationships and some professional services churn outside of tech-enabled managed services driven primarily by continued financial pressures faced by these health systems. This is partially driven by our continued lower anticipated utilization rates as a result of higher per client staffing levels than we anticipate at steady state and partially driven by the anticipated mix of services to be delivered in the quarter, inclusive of a higher percentage of tech-enabled managed services, which start out at a lower gross margin. From a revenue mix standpoint, we anticipate 2023 professional services year-over-year revenue growth will slightly outpace Technology year-over-year revenue growth, driven by the heavier weighting of our tech-enabled managed services bookings in the second half of 2022 and anticipated in 2023. Your line is open. Your line is open. Your line is open. We're first focused on these two areas where we have a really strong demonstrated track record both on the technology side and on the tech-enabled managed services side, where we've been managing this on behalf of plans for over eight years in a number of cases, but we're also looking for opportunities to pilot some other potential expansion areas, and we're grateful that clients seem willing to consider that together with us. Your line is open. And then on the tech-enabled managed services side, so of our total professional services revenue around 35% to 40% is this tech-enabled managed services component across those clients â\u0080\u0093 that weâ\u0080\u0099ve shared those DOS clients with the majority of it being this traditional professional services consulting that weâ\u0080\u0099ve had in the past, and then a small amount of implementation revenue as well. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}