{
    "symbol": "PAYO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 22:16:03",
    "content": " We delivered revenues and adjusted EBITDA well ahead of our expectations as we continued to drive strong new customer acquisition and increasing adoption of higher value services, especially in faster growing markets around the world. The Payoneer brand continues to be an important and growing asset as we see increasing demand among small businesses, marketplaces, and partners around the world eager to participate in the digital economy across a diverse range of vertical markets, including e-commerce, freelancing, content creators, social platforms, digital marketing, remote work, travel, and distance learning. We had year-over-year revenue growth of over 50% for our fastest growing markets, which include regions like Latin America, Southeast Asia, and South Asia, the Middle East and North Africa and excludes the developed markets of North America, Europe and Greater China market investments are delivering strong results as we continue to have a new customer payback period globally of less than 12 months. And we're particularly excited by the progress we're making, executing on our strategy to broaden Payoneer's portfolio of higher-value services and to increase the number of Payoneer customers using those services. While it is still in the very beginning of our gradual roll out of Payoneer checkout, we're getting very positive customer feedback and we are building momentum with a growing pipeline of new customers and with new partners for what we expect will be an important growth driver for many years to come. Based on our strong first-quarter results and our review into April, together with our current assessment of how our business is trending in light of the broader macroeconomic and geopolitical environment, we're raising our revenue guidance from $550 million to $560 million, reducing transaction costs as a percent of revenue to 21.5% and increasing our adjusted EBITDA guidance to be between negative $10 million to negative $20 million. And so I think -- well we believe that the approach that we should take is accelerated investment, we think we see that the opportunity to onboard customers, the needs, the ability to cross-sell is a strong driver in our commitment to expand the platform investment technology build-out additional products, bring on more customers that we can sell more to and get larger share of wallet to drive lifetime value and ultimately drive profitability in the long term. So it really was execution really across the board on those same themes we've been talking about for a while; the higher-value services, in particular B2B AP/AR and commercial card, and the strong performance in these faster growing parts of the world that we think again, have tremendous opportunity ahead and we're still relatively early days."
}