{
    "symbol": "DB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 12:07:13",
    "content": " We also achieved average revenue growth of 10% year-on-year across the four core businesses, driven by business volume growth, market share gains, improving interest rates and business investments, all of which will support sustainable growth in future years. In the Corporate Bank, revenues are up 20% year-to-date, thanks to the further improving interest rate environment and higher fee income, supported by volume growth in loans and deposits. Adjusted costs, excluding transformation charges and bank levies, increased by â\u0082¬177 million or 4% year-on-year, but declined 1%, excluding FX movements, as we managed to offset investments and inflationary pressures with our cost. Corporate Bank revenues in the third quarter were â\u0082¬1.6 billion, 25% higher year-on-year. Corporate Treasury Services revenues of â\u0082¬963 million increased by 28% year-on-year, driven by further improvements in the interest rate environment and a strong operating performance, reflecting higher commission and fee income and volume growth in loans and deposits. Business banking revenues of â\u0082¬200 million grew by 15% year-on-year, reflecting the transition to a positive interest rate environment in Germany. Non-interest expenses declined by 5% year-on-year, reflecting a benefit in the quarter from deposit protection costs, lower internal service cost allocations as well as incremental salary savings from workforce reductions and branch closures, partially offset by negative FX movements. Revenues, excluding specific items in Wealth Management and bank for entrepreneurs, increased by 24%, driven by continued loan growth and higher revenues from deposits, supported by rising interest rates. Everything what we can see is that the momentum in the Corporate Bank, but also in the Private Bank in terms of the interest rate environment, but also in terms of the business volume, we see we are clearly on the trajectory of further increasing revenues also in the fourth quarter, in particular, for the Corporate Bank. And this is exactly what we said in the IDD in March 2022, where we said this volatility, we will see for the next couple of years and therefore to be honest, rising revenues in Private Bank and in the corporate bank, clearly, rising revenues in both businesses, I think, at least a flattish revenues to 2022 and 2023 in the Investment Bank, flattish, so to say, in asset management. That would mean - you would assume almost half - 50% reduction in the Investment Bank, which, on the basis of the financing business, which is pretty stable, as you know, the market share and the positioning we have achieved in the macro business and then also in the O&A business, which was very weak this year and which is starting, in my view, to reemerge next year, is, again, would be a drastic number."
}