{
    "symbol": "DB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:27:17",
    "content": " This brings our cost/income ratio down to 73%, 4 percentage points lower compared to the prior year or 66% if bank levies were apportioned evenly across all 4 quarters. Revenues in the Corporate Bank were up 11% year-on-year, a second consecutive quarter of double-digit growth, driven by continued deposit repricing and business growth. Investment Bank revenues grew 7% year-on-year over a strong first quarter in 2021, a 15% increase in FIC revenues more than offset a 28% decline in Origination & Advisory. Asset Management revenues rose 7% year-on-year, driven by a 13% rise in management fees, which reflects consecutive quarters of inflows and assets under management growth during last year. Noninterest expenses were down 4% year-on-year despite an increase in bank levies of 28% or more than €150 million, which was offset by lower transformation charges and the cessation of Prime Finance costs. Adjusted costs, excluding bank levies, transformation charges and Prime Finance, were also down 1% year-on-year, reflecting lower investment spending needs after the completion of some IT projects and delivery of efficiency gains in line with plan. Total revenues for the group were €7.3 billion, up 1% versus the first quarter of 2021 despite the revenue decline of around €370 million in CNO and CRU. This captures three main cost components: Firstly, bank levies came in at €730 million, up 28% year-on-year and about €150 million higher than we originally expected due to a higher assessment of basis applied by the SRB and the unchanged conservative determination with regard to the use of irrevocable payment commitments. Corporate Bank revenues in the first quarter were €1.5 billion, 11% higher year-on-year. Corporate Bank profit before tax was €291 million in the quarter, up 25% year-on-year despite higher credit loss provisions, evidencing improvements in our profitability and efficiency. Corporate Treasury services revenues of €917 million grew by 14% year-on-year, driven by strong business momentum, in particularly, in corporate cash management, higher loan volumes, deposit repricing and the improving interest rate environment. The Private Bank reported a strong pretax profit of €419 million in the quarter, up 54% year-on-year, reflecting both continued cost savings and revenue growth. Revenues grew by 7% versus the prior year, primarily due to an increase in management fees of €74 million, mainly from higher average assets under management, which more than offset lower performance fees recognized in the quarter. Profit before tax of €206 million in the quarter increased by 12% over the same period last year, reflecting a stable margin and a strong increase in revenues. Funding and liquidity impacts were negative €127 million versus negative €36 million in the prior year quarter, and they include certain transitional costs relating to the bank's internal funds transfer pricing framework as well as costs linked to legacy activities relating to the merger of Db Privat- Und Firmenkundenbank Ag into Deutsche Bank AG, as we have previously disclosed. When I look at that guidance, the €4.9 billion of revs, the 73.5% cost/income ratio, it's still -- it does imply a slightly higher kind of monthly cost trend in the 1.5 in Jan-Feb. Where we see accessions arising for any number of reasons, market risk RWA, regulatory changes, growth that exceeds our expectations or other things, we take offsetting actions, and it's part of our day-to-day management of RWA as we do all of the other resources tightly within the firm."
}