{
    "symbol": "NYCB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 10:49:04",
    "content": " Please proceed with your question. Please proceed with your question. Please proceed with your question. Dave, I would just say, to John's point, we want to have some flexibility to go into 2023, depending on our balance sheet renewability, depending where rates start to normalize here and we have an opportunity to really look at the assets that we've acquired and see what assets weâ\u0080\u0099re going to hold. Please proceed with your questions. I made a very clear commentary probably about 1.5 years ago, that if you go from zero to a much higher rate environment, now we'll just reiterate the zero to, let's say, 5% I don't think you're hiding from people getting paid on excess liquidity. I think that's the game changer for us as we look at this combined business of Flagstar and NYCB, that we're going to position ourselves to not be vulnerable to rates going up. Please proceed with your question. Please proceed with your questions. When you think about the choices going forward -- absent the funding side, on the asset side, we really do have a unique opportunity to have a lot more assets repricing into the marketplace, as well as a much more, we call, higher-yielding offering when it comes to the floating rate instrument, and more of a focus to allow our customers to utilize derivatives to finance their long term as an alternative solution and traditional fixed rate terms. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. So, it's not as attractive as it was six months ago, but it's an alternative, and we're seeing probably half of our customers on the multifamily side opt into that choice, which we like that prefer for interest rate risk balance sheet management perspective, but a much higher coupon. But in 2023, we have about another $2.5 billion, around $388 million on the multi-side, and if you take in over the next two years, it's about -- but just about $6 billion on multibit $375 coupon and market yields are around 6%, assuming they all go into a five-year structure, not doing a whole lot of seven-year tenure, reluctant to do that as we look at the marketplace and in general, I think people are sitting on the sidelines right now. And that's why earlier I mentioned that even though you're going to start seeing cost savings starting in February, there is noise as a result of the onetime restructuring charge, the runoff of the pipeline and I expect us to have a real clean run rate beginning April 1. Please proceed with your question. One of the things we look at when we put both companies together is there's a large portion of the assets but even though they have really low loss content in them, including multi-family, mortgage warehouse, they're 100% risk-weighted assets. Please proceed with your question."
}