{
    "symbol": "CASY",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-08 13:54:06",
    "content": " As you have seen in the press release, we had an outstanding first quarter for diluted EPS finishing at $4.09 a share, a 28% increase from the prior year and a record high for the first quarter. Inside same-store sales were up 6.3% for the first quarter or 14.9% on a 2-year stack basis with an average margin of 39.8%, down 70 basis points from the prior year. Total inside sales for the quarter were $1.3 billion, an increase of $123 million or 11% from the prior year. Reported figures were favorably impacted by operating 3% more stores on a year-over-year basis, primarily due to the acquisitions, which closed over the course of the prior year first quarter. Caseyâ\u0080\u0099s had gross profit of $836 million in the first quarter, thatâ\u0080\u0099s an increase of $112 million or 16% from the prior year. The grocery and general merchandise margin was up 90 basis points to 33.9% from a year ago, which is an impressive feat given the inflationary environment and itâ\u0080\u0099s a testament to the merchandising team, their ability to manage margin through procurement, product mix and retail adjustments. Other gross profit was down $2.1 million primarily due to a reduction in lottery and carwash sales, while other revenue was up from the prior year due to the higher price of fuel delivered into the dealer network, margins from that business are fairly static regardless of the price of fuel or the direction wholesale fuel prices are going. Finally, total operating expense should improve sequentially versus the first quarter as expected and will likely be up approximately 10% versus the prior year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Wanted to follow-up on the OpEx and just clarify, is there something that is coming in or has the potential to come in higher than your original expectations because it just seems like with where the gas prices are now and the math that you gave last quarter, it seems like it should translate into about $40 million in lower credit card fees on an annual basis. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}