{
    "symbol": "SABR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 15:12:02",
    "content": " We would like to advise you that our comments contain forward-looking statements that represent our beliefs or expectations about future events, including the duration and effects of COVID-19, industry and recovery trends, benefits from our technology transformation and commercial and strategic arrangements, our financial outlook and targets, expected revenue, adjusted EBITDA, free cash flow, costs and expenses, cost savings, margins and liquidity among others. During our third quarter conference call, vacated expectations of a Q4 air bookings recovery in the low 60% range and adjusted EBITDA for the fourth quarter of approximately $30 million. To provide more context on this line item, on a year-over-year basis for the quarter, we experienced a $25 million benefit from higher volume offset by no longer having air center revenue of approximately $30 million and lower revenue from our airline IT business in Russia of approximately $4 million as compared to Q4 2021. Looking forward in 2023, we expect an approximate $100 million headwind to our IT solutions revenue, the vast majority of which is the result of the impact of the Russian law. With that, we expect first quarter 2023 revenue of approximately $725 million and adjusted EBITDA of approximately $50 million. For the full year 2023, we expect revenue between $2.8 billion and $3 billion and adjusted EBITDA between $300 million and $320 million. Regarding IT Solutions, as a result of the $100 million headwind and the impact of the air center disposition in Q1 2022 mentioned earlier, we would expect modest year-over-year declines in IT Solutions revenue throughout 2023, with the year-over-year decline being greatest in Q1 2023. In 2023, we expect to generate approximately $25 million in working capital benefit from growth in our business, and we are targeting $125 million of working capital initiatives, which we expect to begin delivering value in the second quarter. As we look at our 2025 targets that we have previously provided and are reiterating, we expect adjusted EBITDA to grow at least $600 million between 2023 and 2025 and to be greater than $900 million in 2025. Now as we look at $100 million, that we referenced because most of that was revenue that was generated in the first three quarters of this year, that will create the greatest headwind in the first three quarters of 2023."
}