{
    "symbol": "KMX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-04-12 14:05:22",
    "content": " For the fourth quarter of FY ‘22, our diversified business model delivered total sales of $7.7 billion, up 49% compared with last year’s fourth quarter, driven by growth in average selling prices and wholesale volume gains partially offset by a decline in used units sold. Across our retail and wholesale channels, we sold approximately 343,000 cars in total during the fourth quarter, up 11% versus last year’s period. We bought approximately 324,000 cars from consumers during the quarter, up 69% versus last year’s period. Wholesale unit sales were up 43.8% from the fourth quarter last year and gross profit per unit was $1,191 compared to $990 a year ago. Total gross profit was $711 million, up 11% from last year’s fourth quarter. Used vehicle margin of $427 million was relatively flat over last year’s fourth quarter, with the decrease in units largely offset by an increase in margin per unit. Other gross profit was $107 million, down 4% from last year’s fourth quarter. On the SG&A front, expenses for the fourth quarter increased to $621 million, up 23% from the prior year’s quarter due to continued investment in our strategic initiatives and in marketing, the consolidation of Edmunds and growth costs related to the increase in appraisal buys, new stores and customer support at our customer experience centers or CECs. For the fourth quarter, CAF’s penetration net of 3-day payoffs was 41% compared with 43.5% last year. This improvement in CAF’s margin and the growth in average managed receivables more than offset a substantial increase in the provision for loan losses, which was a more normalized $54.4 million in the current year’s fourth quarter versus $4.6 million in the prior year’s fourth quarter. In regard to our fourth quarter online metrics, approximately 11% of retail unit sales were online, up from prior year’s quarter of 5%. Your line is open. Your line is open. So whether it’s the right time to invest for us, and whether there is periods of strong industry performance or more challenged industry performance like we faced in the fourth quarter, our goal is to take profitable market share, which as Bill talked about in his prepared remarks, we do believe in the fourth quarter, despite sales being down that we still have market share in our segment. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. And I know you don’t measure market share on a quarterly basis, but in the fiscal fourth quarter, according to CAF, the used vehicle retail saw a decline 4%. Your line is open. Your line is open. Your line is open."
}