{
    "symbol": "KMX",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-22 12:47:07",
    "content": " For the third quarter of FY ’22, our diversified business model delivered total sales of $8.5 billion up 64% compared with the third quarter of FY ‘21, driven by both higher average selling prices and volume gains. Across our retail and wholesale channels, we sold approximately 415,000 cars in total, up 29% versus third quarter last year. In our retail business, total unit sales in the third quarter were up 16.9% and used unit comps were up 15.8 versus the third quarter last year. In addition to strong unit sales, we reported record retail gross profit per use unit of $2,235, up $84 per unit versus the third quarter last year. Wholesale units were up 48.5% from the third quarter last year, and gross profit per unit achieved an all-time record of $1,131 compared with $906 a year ago. Total gross profit was $837 million, up 32% from last year's record third quarter. This was driven by a wholesale vehicle margin of $212 million, which was up 85%, and used vehicle margin of $508 million, which was up 21% from last year's third quarter. Other gross profit was $116 million, up 18% from last year's third quarter. While penetration was stable at approximately 60%, this year's third quarter reflects a $6 million unfavorable return reserve adjustment compared to a $3 million favorable return reserve adjustment during the prior year's quarter. On the SG&A front, expenses for the third quarter increased to $576 million, up 34% from the prior year's quarter, due to costs related to unit volume growth and continued investment in our strategic initiatives. This included a more normalized loan loss provision of $76 million as compared to the significantly reduced provision of only $8 million in the same quarter last year that was driven by the continued reduction of the reserve that was established at the start of the COVID pandemic, almost fully offsetting the provision headwind with a year-over-year increase in total interest margin of $65 million or 7.2% of managed receivables. In the third quarter, a little more than 9% of retail unit sales were online, up from the prior year's quarter of 5%. Total revenue resulting from online transactions was approximately 30%, this is up from 20% in last year’s third quarter. Your line is open. And three quarters ago in our Analyst Day, we communicated kind of the new way that we were looking at SG&A, which is SG&A as a percent of gross margin or gross profit dollars, as we believe that's much more reflective of how we actually run the business, and more reflective of our efficiency, because we are investing not only in our used car business, but we're investing in technology and platforms and resources to grow our wholesale business, which certainly we've seen so far this year, and certainly this quarter, as well as our CAF business. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}