{
    "symbol": "KMX",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-22 14:44:06",
    "content": " Actions that we took during the quarter include further reducing SG&A, selling a higher mix of older lower priced vehicles, slowing buys in light of the steep market depreciation, maintaining used saleable inventory units while driving down total inventory dollars more than 25% year-over-year. For the third quarter of FY 23, our diversified business model delivered total sales of $6.5 billion down 24% compared with last year's third quarter driven by lower retail and wholesale volume. On the SG&A front expenses for the third quarter were $592 million up 3% from the prior year's quarter, reflecting a slowdown from the year-over-year increases of 19% during the first quarter and 16% during the second quarter of this year. In the prior year's third quarter, we received a $23 million settlement from a class action lawsuit adjusting for that settlement, SG&A actually would have declined 1% year-over-year this quarter. SG&A as a percent of gross profit was materially pressured as compared to the third quarter last year, due primarily to the 31% decrease in total gross margin dollars compared to last year's quarter. And maybe the run rates and really, I don't know if we can think about an SG&A to gross kind of level for the next couple of quarters, or just help us understand kind of, what might be reasonable for you guys, just because there's been a lot of growth SG&A. But again, when you back out the $23 million settlement that we received last year in the third quarter, you're really looking at a slight decrease in overall SG&A. I think the better way to think about it Sharon, or the best way to think about it is just the cadence, the year-over-year cadence that we've had, because there's always seasonality that occurs right quarter-to-quarter in our business, and that also impacts SG&A. Is that positive because it means the industry is moving back to normal, but or is it a short-term negative because they're going to have fresher inventory that's going to lower your unit numbers and just kind of want to know how to think about that and how that's kind of trended in the past."
}