{
    "symbol": "AMR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 14:35:30",
    "content": " It wasn't long ago that $300 million of EBITDA on a quarter would have been considered a , so Alpha is very proud of this quarter's performance and over $14 of earnings per share that we have reported today. As Todd will discuss with you shortly and from the press release we issued this morning, in the quarter, we sold approximately 44% of our exported met production into markets that are priced on Australian indices, which resulted in realizations of $161 per ton. At the end of October, Alpha has bought back over $450 million worth of common stock, exhausting more than three quarters of the Board's prior $600 million share repurchase authorization. As we look to our third quarter results, the Alpha team put together another very solid quarter of performance with adjusted EBITDA of $295 million in Q3. Export tons priced against Atlantic indices and other pricing mechanisms in the third quarter realized $208 per ton, while export coal priced on Australian indices realized $161.58, a quarter-over-quarter reduction largely resulting from lower priced volumes into Asia. Due to the elimination of Alpha's term loan debt earlier in the year, our 2022 cash interest expense is trending toward the lower end of our established guidance range of $18 million to $22 million. Alpha's Board has declared a cash dividend of $0.418 per share, an increase from prior quarters $0.392 per share, which will become payable on January 3, for holders of record as of December 15. As of October 31, we have spent approximately $452 million to acquire 3.1 million shares of Alpha's common stock at a weighted average price of $144.12 per share. Taking a specific look at metallurgical price movements during the third quarter, the Australian Premium Low-Vol index dropped from $302 per metric ton on July 1, to $270.50 at the end of September. The volatility in the seaborne thermal coal market, largely a result of Russia's invasion of Ukraine and its effects in Europe, continued through the third quarter with the API2 index at $328.95 per metric ton on July 1 and declining to $312 per metric ton as of September 30."
}