{
    "symbol": "AMR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 00:25:20",
    "content": "  Operator: Greetings, and welcome to the Alpha Metallurgical Resources Second Quarter 2022 Results Conference Call. Before we get started, let me remind you that during our prepared remarks, our comments regarding anticipated business and financial performance contain forward-looking statements, and actual results may differ materially from those discussed. For more information regarding forward-looking statements and some of the factors that can affect them, please refer to the company's second quarter 2022 earnings release and the associated SEC filings. Participating on the call today, our Alpha's Chairman and Chief Executive Officer, David Stetson; and President and Chief Financial Officer, Andy Eidson. Also participating on the call are Jason Whitehead, our Chief Operating Officer; and Dan Horn, our Chief Commercial Officer. This over six years ago, I joined the Alpha team. During those years, we have certainly experienced our share of obstacles and hurdles. And on many occasions, we had our share of people questioning whether Alpha would survive those ordeals. I come before you today as proud as ever of the accomplishments of the Alpha team humbled by the opportunity given the six years ago as part of that team, and confident that this team will be stronger and achieve more in the coming years during my tenure as CEO We have always been transparent about our goals about them. Over the past quarters, we've clearly laid out the plans and actions we needed to take in order to accomplish those goals. To that end, let me share with the great news in the second quarter This is our first earnings call is fully paying off the remaining term loan balance in early June, completing our long-term debt elimination. Just over a year ago, Andy laid out a plan to reduce and possibly eliminate our debt by 2023. As user-focused approach to our financial management as well as actions taken to short all aspects of our balance sheet, enabled this time frame to be realized in the second quarter, well ahead of anyone's expectations. It has not only transformed our balance sheet, but I believe it marks the start of a new chapter for the company is a more flexible, resilient organization that is better able to withstand the inevitable cycles of our industry. Strategic and tactical decisions of the team, along with strong markets we experienced this year, allowed us to post back-to-back record performance with the second quarter, generating adjusted EBITDA of nearly $700 million. We have made significant progress in buying back our shares with approximately $268 million spent to acquire 1.9 million shares, representing roughly 10% of our issued and outstanding shares when the program began. In our previous earnings call, we not only spoke to you about dedication to eliminate debt, but we began the conversation of our plan for the long-term growth and sustainability of Alpha. As always, both Dan and Jason generated not only a road map to bridge our current production and customer base with our vision of what Alpha will be in 15 years from now. Behind-the-scenes efforts that Roger's team allows Alpha to stay focused on our safety and environmental stewardship efforts while maintaining the critical support framework the company needs areas like legal, human resources, and land. Over these past years, I've been fortunate to be surrounded by the best management team in the industry, a team navigated some of the most difficult financial, operation and marketing hurdles that could easily lead to value disruption. Instead with courageous decision-making and flawless execution, we are reporting another record quarter now as a debt-free company with robust capital return program. I've been thinking about retirement for some time, especially knowing that we build a strong and experienced team that can lead Alpha decades to come. The board of directors met last week and formally and unanimously appointed Andy to serve as CEO beginning on January 1st, 2023. As of December 31, 2022, I will transition to the role of executive chairman of the board, which allows me to step away convey management and take on a higher level over cycle. Andy and I have been working closely over the last few years, taking steps to prepare for a seamless transition. Over this time, he has taken on increasingly broader cover responsibility and have complete confidence in going to step into the COE role at the end of the year. With that, I will now turn the call over to Andy to share some additional details about the transition plan for his current role and his vision for the company. Before I get started, I want to take a moment to acknowledge the incredible work that David has done as Alphaâ\u0080\u0099s CEO. And we achieved a win never failed to give the team credit, and we face serious challenges and never will to seize the opportunity to turn setbacks in even greater ways. As he mentioned, today's announcements are a window into what Alpha's next act will look like. It will be different without the weight of our previous debt load, but I believe that the discipline, resilience, and leadership vision that brought us at this point are the same thing that will propel us into an even more successful future. What this team has accomplished over the past three years is nothing short of incredible, and that is due primarily to two things: the strategic vision and foundation that David created and the unparalleled efforts of the world-class Alpha team members. In addition to the CEO transition, we have announced today, I'm pleased to report that the board has selected Todd Munsey to take over the duties of CFO as of tomorrow. The board has named Todd is the role of Executive Vice President and Chief Financial Officer, effective as of August 9. I have great confidence and possibility to excel in this new role, and we look forward to bringing him into the earnings call process next quarter. Additionally and very importantly, I want to highlight one more change that will happen at year-end. The board has appointed Jason Whitehead to serve as Alpha's President, in addition to his current position as Chief Operating Officer, effective January 1, 2023. In my opinion, he's the best operator in the industry, and I'm super excited for him to take on this broader leadership role. Before I turn to the quarter's results, I want to echo David's comments about the strength of this team. I think Jason, Roger and Dan are the best in this industry, best-in-class, and Alpha is very lucky to have them on the team. I'm truly humbled by the opportunity to lead this phenomenal company, and I couldn't be prouder to be a part of this team. I'm pleased to say that we achieved yet another record in back-to-back quarters -- excuse me, back-to-back-to-back quarters, that's three in a row. In terms of volumes, we sold 4.3 million tons in the second quarter with 4.1 million tons back coming from our Met Segment. As we mentioned in the press release, thermal market volatility has created some opportunities for crossover met tonnage to be sold into the thermal market. As expected, realizations on export tonnage continued to improve quarter-over-quarter with an average of $337.38 per ton realized on export business for second quarter compared with $278 in Q1. Total weighted average realizations for our pure met production as a whole of $304 per ton for Q2, an increase of 20% over the prior quarter's $254 per ton. Realizations in the All Other category were $61.41 for the quarter, up in comparison to the $57.39 realized in the indices having called up off from their highs earlier in the year, we expect to see that downward pressure flowing through our realization over the next couple of quarters. However, even with the significant drop from recent record highs, current pricing levels are still very strong relative to historic norms. SG&A, excluding noncash comp and nonrecurring items increased to $16.8 million in Q2 as compared to $14 million in Q1. As a result of increased incentive compensation due to outperformance against budgeted metrics, we are increasing our SG&A guidance to get a range of $55 million to $59 million. CapEx was $41.9 million, up from $28.1 million in the prior quarter. This amount is also net of our final term loan payment, which was $99.4 million on Q3 and eliminated our remaining balance and $176.3 million in share repurchases during the quarter. As of June 30, our ABL had no borrowings under $64 million of letters of credit outstanding, a significant reduction from Q1 $121 million of LCs standing. Since our last earnings call, we've made significant progress in buying back shares using a programmatic approach that allows for opportunistic purchasing and maximizes the efficiency of our dollar being spent. As a reminder, the board authorization is for $600 million in the program. As of August 5th, we spent a total of $268 million, or nearly half of the authorization to require roughly 1.9 million shares of Alpha's common stock at a volume-weighted average price of approximately $140 per share. As of today, we have approximately 17.17 million shares outstanding, not including the impact of approximately 220,000 exercises. In addition to our everyday focus on Safe Production, the quarter was also positive in terms of advancing the ball on several of our special projects. Our teams have worked incredibly hard and against a number of supply chain obstacles to keep this mine's development on track, and I'm pleased to report that the Glen Alum Mine took its first cut of call in June. We're excited to bring this mine into our portfolio, and we continue making progress on the plant upgrades and other various CapEx projects we announced late last year. This is a river barge loading facility in Canola County, West Virginia, and we believe this property will provide some future optionality for logistics and transportation of our coals. Thermal coal and dices have jumped higher than even the highest quality met coals, inverting what has historically been a predictable pricing hierarchy. As a result, high-volatile metallurgical coals are finding their way into thermal coal markets and Alpha has taken advantage of some opportunities in this regard. We have High-Vol B commitments for both Q3 and Q4 for servicing thermal markets, and we continue to mind the reclamation on our Black Castle surface mine, where we're producing incremental thermal production while cleaning up legacy ARO on the balance sheet. Similar to this, we will resume production in the fourth quarter of this year on two permits on our republic surface mine. Formerly planned to idle this year, more resource tons have been identified and mine plans are being developed. As a result, we've increased our guidance for the incidental thermal buy product of the Met Segment by 200,000 tons on either end of the range. We moved from a previous guidance range between 800,000 tons to 1.2 million tons to a new range of 1 million tons to 1.4 million tons. Before I wrap up my remarks, I want to again highlight the collective efforts of our employees that have fueled Alpha's back-to-back-to-back record quarters. Without their daily focus on safety, environmental compliance, and efficient and reliable production, we wouldn't be able to post financial results like we have announced today. Our employees are critically important to our success, and therefore, we've continued to invest in our workforce and incentivize strong performance toward our safety, environmental, and production goals. Since the beginning of 2021 and on an annualized basis, we have invested an additional $120 million in our employees in the form of wage increases, expanded benefits offerings, and incentive bonuses. We believe Alpha is the employer of choice, and we strive to continually maintain that distinction by sharing the company's financial success with our employees when possible. As Jason mentioned, coal markets continue to shift in response to a variety of factors. We're roll weakening of the global economies, the ongoing war between Russia and Ukraine, inflation concerns, and recession peers have all influenced the pricing and movement all across the globe. On the metallurgical side of things, concerning regarding global steel demand has caused markets to soften at these ones with indices retreating significantly from their record highs early. Alpha levels are still considered strong relative to historical averages, they represent a meaningful drop from where they started earlier in '22. After the quarter, the PLV indices continue to drop further down to roughly $203 per metric ton in recent days. As a comparison, the U.S. East Coast low-vol index declined from $485 per metric ton at the start of the quarter to $317.50 per metric ton at the end of June and is now down to around $232 per metric ton. Correspondingly, the East Coast high-vol B index all from $455 per metric ton down to $320 over the course of the second quarter and is down now to around $243 per metric ton. Before we go to reports, humongocrude steel production decreased about 6% as compared to the year-ago period, with all regions represented in analysis posting the decline against their June 2021 levels. Among office key markets, European is June 2022 crude steel production represented a decline of about 12% compared to year-ago levels. South American production was down about 5% against June 2021, while here, North American production decreased by 2.4% as compared to that year into rate. The words created an energy crisis in Europe, which has caused certain thermal coals to command a higher price and premium cooking coals in some markets, further challenging pre-pandemic whole market norms. Looking at the seaborne market, where this is most pronounced, the API 2 next started in the second quarter at $260 per metric ton on April 1st rose to $375 per metric ton as of quarter close on June 30. As a comparison point, central out prices from 12,500 feet oil on CSX has been around $190 per short tons. And as Jason said, we continue to capitalize on opportunities to sell some incremental tonnage into the coal markets to take advantage of the current price environment. While net logical coal pricing has significantly declined from the all-time highs we saw earlier this year, the recent levels are still quite strong relative to historic averages. Before we move into the Q&A section of the call, I want to end on a positive note regarding our transportation providers. Alpha generally continues to see improvement from our rail partners, the service moving toward our pre-pandemic benchmark levels at certain times within the second quarter. We understand the labor issues are complex and cannot be fully solved overnight, but we are grateful for the effort and cooperations of the railroads that resulted in a significantly improved performance of supply. Please proceed with your question. Good morning everyone and congratulations on a strong quarter, being debt free. David, I want to congratulate you on your well-deserved retirement, and Andy, Todd, and Jason also congratulations on your promotion. So a lot's really going really well here, and this is terrific to see. Yes, that's -- where could it go is a question I'm resyncing answer, but what we're doing in Alphaâ\u0080\u0099s we're looking at these opportunities as they come along. And by the way, we've been selling to some thermal coal into the market for several months here, not just lately. But some of the constraints that do affect are some of the things you've probably read already, all matter FS, sizing of the coal. There's a lot of the utilities, particularly in Europe that haven't used a lot of capitals in several years. So there are some technical issues to overcome as well as some of the logistic issues that -- but again, for us, that's what DTA comes in handy for us, and we can use DTA as a platform to move some additional thermal over. So there's still plenty of opportunities out there, but the thermal market does have some limitations. But I suppose if you're looking for a number, we can add easily several hundred thousand tons more into the thermal market going forward in the coming months if we see something we like. I mean, we're already doing roughly 1 million tons a year of thermal. And for -- Dan, I think you mentioned the contract season for 2023. So a few cross currency would appreciate your thoughts as how you think placement could make sense and if there might be any deviation fromâ\u0080¦\n Lucas, this is David. But we're right the middle of our budget process for 2023, and we'll look across the board of where our portfolio is. As Dan mentioned, we have a lot of our existing customers that are already speaking with us, both domestically and internationally. And then we've also -- with the relationships we've developed, we're also exploring new markets in Asia. This will be -- if you look at historically at Alpha, we've historically been right around that 35% domestic, 65% international. But again, we're going to approach the season like we do always. We've got some great products, great quality, great diversity, and we have strong interest across the board, both domestically, internationally. And certainly, in our November call, we'll have some updated information on how we come out of the net side. I guess to some other companies, yes, what I mentioned on our previous calls that last year, about a year ago when the market started moving up, we and other companies signed more long-term contracts than we had in the past. Certainly, the industry has come down, but the volumes for Alpha at least remain strong. But we're absolutely looking to don't want any opportunities on the thermal side, as I mentioned earlier. And then with regard to the domestic met, we're still working on the RFPs for goodness sakes. David, you mentioned the improvement on the rail side and that's great to hear. So any insight you might have for...\n Well, I think I'll just add that when we saw the changes coming with the railroad in the case of one real, there were several new changes. I'm going to give a shout-out to my team, the logistics team for reacting quickly and changing some of the way we do things and shout out Jason's team, the people at the preplant, and readouts to react to these changes as well. So part of the reason I think we're more successful here in the last quarter is due to the -- everyone stepping up and realizing it is a bit of a different world on the transportation side, and we had to change things we do in the business. Please proceed with your question. Hi, good morning guys, congrats on the results, and I'll go Lucas' comments, congrats on all the transitions being made there by the team. I think you also mentioned bringing back it was 0.5 million tons at the Republic Surface Mine, I think it was. So therefore, we're able to bolt on small sections to the mine and mine them at a relatively good cost to where the market is. And then the republic permits that we plan to start in the fourth quarter of this year, you did hear me right that it's upwards of 0.5 million tons. And these are, I guess, currently inactive surface mine permits, but they would be in the all -- I'm sorry, they would be in the Met Segment, but they'd be incidental thermal tons to the Met Segment, but available and will be sold into thermal markets. And I thought we mentioned that on the last earnings call, but maybe my memory is fuzzy, but we have been releasing tons, not large amounts from Black Castle in the second quarter. I would estimate that somewhere between 80,000 and 110,000 that would be in the Met Segment but would be in the other incidental thermal bucket. Obviously, first half has done extremely well below $50. There'll be recovery type work and mine closeup type work, being spread across fewer tons, and probably expect to see a bit of an increase there. Your clear preference has been share buybacks nearly completing half of that $600 million program, so far, it looks like. Our other priority was twofold: one, to increase cash balances and the other was to reward our shareholders for their loyalty over these past years. So we commenced our earnings program earlier than the last quarter, we increased it to $600 million. We have spent, as we've heard earlier, approximately 50% of that has been spent to the market. So from our perspective, we're going to continue our share repurchase program. As Andy mentioned, we battled our tone in some opportunities in the M&A side but to know Abel. We're constantly evaluating that reserve base, the purpose of bringing on new production. But you also recall in the previous quarter, we went through a 15-year mining plan that show that over the next 15 years, we simply mine what we currently have in play. On the other hand, we're constantly evaluating opportunities to either bolt on and make some incremental production increases and/or replace existing mines with more efficient mines. We're going to continue to build strong cash balances and that is where our future is, Andy, I'll let you provide any other additional commentary. And while that's not a hard and fast rule, and there's really not much of a side to, I do think that broadly speaking, we like to look at somewhere in that $250 million to $300 million range for total liquidity target. And as David mentioned, we've got the 15-year plan as a bit of a guide. We're also going through our budget cycle for 2023, and that will inform what kind of capital projects we'll be looking at for next year. But as we've said in the past couple of calls, we don't have those huge projects that really require any material deviation from any of our plans. And I think that in the decent markets and such the really good markets we're experiencing now, that has certainly been the case. Please proceed with your question. Hi, good morning, everyone, congrats on the quarter, as well as everybody with the new promotions. I think, Jon, it's sitting here today. And I guess it's somewhat related, and I'm sorry to beating a dead horse here. Yes, I mean, just based on actual realizations and where the futures are sitting through the rest of the year, at least pointing right now, I think Q2 doesn't appear to be the high watermark and it was very, very high water. But yes, it looks like while the curve is and it's still in a bit of contango going into Q4 and Q1 of next year, it looks like there's overall going to be downlink as compared to Q2. So naturally, the outperformance in the first half of the year drives bonus programs. Now depending on where the pricing goes, it may come down a little bit over the back half of the year, but that's just getting us caught up based on the extraordinary first half on the super extraordinary second quarter. No, I think it's obviously a struggle, Jason mentioned in his prepared remarks, the amount of additional costs that we've put into the system to maintain our employment and keep our folks happy and productive and to try to battle some of the exits from the coal industry. But all of that's baked into the cost We're obviously seeing some productivity improvements elsewhere and Jason's team is always finding a couple of places to save some -- find some productivity enhancements, reduce costs to offset some of these things. But Jason, if there's anything you want to add specific on just what you're seeing in the labor markets. No, I think you said, Andy, we've, as we've mentioned, we've done what's necessary to stay competitive and I think Andy said that I believe we'll be able to stay in the range through the rest of the year. And obviously, the support of my board of directors and our shareholders over the past six years has been phenomenal, and I want to thank each and every one of them for that support loyalty."
}