{
    "symbol": "ANSS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 13:51:06",
    "content": " For additional context, when translated at 2019 foreign exchange rates, full year 2022 ACV would equal approximately $2.113 billion, further demonstrating the magnitude and quality of our outperformance, which we delivered amidst a global pandemic and a challenging and volatile macro economic environment on. For the full year 2022, ACV performance continues to be fueled by the strong growth in subscription leases which grew 18% or 24% in constant currency. For the full year, we had operating cash flow of $631 million, which grew 15%, meaningfully outpacing ACV growth despite significant foreign exchange and nonoperational headwinds. We delivered an outstanding Q4 and full year 2022 and we are entering 2023 with momentum and a robust pipeline and backlog, which gives us continued confidence in achieving the long-term outlook that we laid out at our 2022 investor update of 12% constant currency ACV compounded annual growth, inclusive of 1 to 2 points of tuck-in M&A and $3 billion of cumulative unlevered operating cash flow from 2022 to 2025. We expect our full year ACV outlook to be in the range of $2.265 billion to $2.335 billion, which represents growth of 11.5% to 14.9% or 9.9% to 13.4% in constant currency. And yes, we were really, really pleased with the exceptional close of our cash flow performance at the end of the year, as you point out, it grew quite substantially delevered operating cash flow in 2022 in our outlook range of 10% to 17% unlevered operating cash flow indicates continued momentum in the business overall. But when you look at the combined -- the 2-year growth rate of 2022 and 2023 from the ECB perspective, and the comparative unlevered operating cash flow growth rate over that period, you could see the substantial operating leverage and margin expansion associated with that it's a little early for us to update long-term guidance we just gave it 6 months ago. So that would put us around the 10% constant currency growth in ACV when you exclude Dyna more our full year outlook which is on our business model of double-digit growth, including ACV. We do also have similar variability in quarters as customers have moved to multiyear leases -- it is not as much of a selling motion where it's only about an event at a point in time that kind of comes up once a year, there's an ongoing selling process that happens kind of throughout the year where ACV can be remixed relative for a single customer relative to what the prior year looks like. And that's why we're really focused on being really clear about our full year guidance where our full year outlook is for ACV and operating cash flow and particularly in particular, in the P&L overall."
}