{
    "symbol": "FMTX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 10:21:10",
    "content": " Including those under the heading Risk Factors in our quarterly report on Form 10-Q for the quarter ended June 30, 2022 that will be filed with the SEC today and in subsequent reports, including our current reports on Form 8-K. On today's call I'm joined by our President and Chief Executive Officer, Frank Lee; Dr. Tino Melian, Head of Research and Development. We're grateful to Pat for his contributions to our programs and for establishing a world-class hematology development team comprised of six MDs who have deep experience leading centers that treat patients with sickle cell disease, thalassemia and MDS. Since joining last month I've been impressed by the level of scientific rigor across the organization, the compelling data generated to-date and across our clinical programs and the potential of etavopivat to truly transform the treatment of sickle cell disease, thalassemia and more risk MDS. Looking forward, my priorities are to drive operational excellence across etavopivat development program as we advance toward a potential approval in sickle cell disease and data readout in Phase II studies, expanding its therapeutic potential to additional populations, including transfuse populations in sickle cell disease, thalassemia and lower-risk MDS. This event included a presentation of encouraging analysis from our Phase I study of etavopivat in sickle cell disease, indicating a reduction in reported pain related adverse events, which we believe further underscores the potential of etavopivat to reduce vaso-occlusive crises in ongoing Phase II/III Hibiscus Study. We continue to advance the Phase II Gladiolus study of etavopivat in transfusion dependent and non-transfusion dependent thalassemia, as well as sickle cell disease patients who are receiving chronic transfusion. Taken together, we believe the concordance of these data across measures of sickle cell pathophysiology, vaso occlusive crises and other pain events provide further support for the potential of etavopivat to provide benefits to patients with sickle cell disease, including reduction of vaso occlusive crises in the ongoing Phase II/III Hibiscus Study. This increase was primarily attributable to the increase in research and development staff to support our advancement of etavopivat and other programs, including the conduct of our Phase II/III Hibiscus trial in sickle cell disease patients and the Phase III trial of etavopivat in thalassemia. First, with respect to olutasidenib and -- Iâ\u0080\u0099ll let Todd here to provide some additional color, but overall what's really important here is not only that we found a very good home for this asset in support of our overall mission in terms of doing right by patients, but it also allows us to now really focus on our key programs, and those are related to etavopivat as you know going forward."
}