{
    "symbol": "NOVT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 12:19:04",
    "content": " In the third quarter, we delivered a new record high $223 million in revenue, representing 25% year-over-year revenue growth on a reported basis and 21% growth on an organic basis and up 4% on a sequential basis. In addition, our operating profit in the third quarter was fantastic with adjusted EBITDA of $49 million, up 22% year-over-year and adjusted diluted earnings per share of $0.81, up 8% versus tougher comps in the prior year. In the third quarter, our sales to advanced industrial markets saw 33% growth year-over-year and 5% growth sequentially. For the third quarter of 2022, sales to medical applications grew 19% versus the third quarter of 2021 and 6% sequentially. For the third quarter, our Vitality Index, which is the revenue from new products launched in the last 4 years, continues to be healthy at about 25% of sales with year-over-year NPI revenues up high-single digits versus the last year. Adjusted EBITDA was approximately $49 million in the third quarter of 2022, a 22% adjusted EBITDA margin. Our non-GAAP adjusted earnings per share were $0.81 in the quarter compared to $0.75 in the third quarter of last year, an increase of 8% year-over-year. For the third quarter of 2022, this segment saw revenue growth of 28% year-over-year. Within Photonics, new product revenue stayed strong at greater than 20% of sales in the third quarter, while design wins were up double-digit year-over-year as our sales teams continue to win excellent new customer platforms in attractive high-growth medical industrial applications. Microelectronics applications, which represent approximately 10% of our sales, which declined to 9% of sales in the fourth quarter or nearly 20% reduction sequentially, whereas medical applications, which represent approximately 48% of our sales year-to-date, will represent 50% of sales in the fourth quarter. For the fourth quarter of 2022, we stand here today, we expect GAAP revenue in the range of 215 and $217 million, which represents revenue growth in the range of 7% to 9% year-over-year. For the full year 2022, we now expect GAAP revenue in the range of $857 million to $859 million, which implies revenue growth of 21% to 22% year-over-year, representing approximately 12% organic growth for the full year of 2022. On a segment level, in the fourth quarter, we expect the Photonics segment to grow revenue in the 25% to 30% range year-over-year. Finally, our Precision Motion segment is expected to be down 8% to 10% year-over-year due solely to a year-over-year decline in our Westwind product line, which will fall more than 60% in revenue in the fourth quarter. Moving on to overall Novanta's gross margin, we expect gross margins in the fourth quarter to be greater than 46%, which is expected to lock our 46% gross margin target for the full year of 2022."
}