{
    "symbol": "NOVT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 10:49:13",
    "content": " In the second quarter, the company delivered $215 million in revenue, representing 29% year-over-year revenue growth on a reported basis and 13% growth on an organic basis and up 5% on a sequential basis. In addition, our operating profit in the second quarter was fantastic, with adjusted EBITDA of $45 million, up 22% year-over-year and adjusted diluted earnings per share of $0.78, up 26% versus prior year. In the second quarter, our sales to advanced industrial markets saw 42% growth year-over-year and 5% growth sequentially. For the second quarter, our vitality index, which is revenue from new products launched in the last four years, continues to be healthy at above 25% of sales with year-over-year NPI revenues up low-double digits versus last year. Our non-GAAP adjusted earnings per share was $0.78 in the quarter compared to $0.62 in the second quarter of 2021, an increase of 26% year-over-year. So, starting with revenue guidance for the third quarter of 2022, as we stand here today, we expect GAAP revenue in the range of $214 million to $216 million, which will imply revenue growth of 20% to 22% year-over-year. Thanks to our continued focus on new products which are launching with gross margins above the company average, as well as significant investments and progress with the Novanta growth system across our business units and a pricing strategy focused on sharing the inflationary pressures and supply chain disruptions with our customers, we feel confident we are on a path to continued and sustained gross margin expansion this year and the next. Turning to R&D and SG&A expenses, which were up $62 million in the second quarter, we expect â\u0080\u0093 are expected to be approximately $63 million to $64 million in the third quarter, which is higher mainly as a consequence of recent acquisitions and higher variable compensation and timing related to investments in new product development."
}