{
    "symbol": "NOVT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 16:58:04",
    "content": " In the first quarter, our company delivered $204 million in revenue, representing 26% year-over-year revenue growth on a reported basis and 7% growth on an organic basis and up 3% on a sequential basis. In addition, our operating performance in the first quarter was excellent with adjusted EBITDA of $44 million, up 33% year-over-year and adjusted diluted earnings per share of $0.73, up 26% versus prior year. And in the first quarter, our sales to advanced industrial markets saw 7% growth sequentially, as well as 47% growth year-over-year, including acquisitions and 10% growth year-over-year, excluding acquisitions. For the first quarter of 2022, sales to medical applications were 47% of Novanta's total sales and grew 8% versus the first quarter of 2021 and roughly flat sequentially. During the quarter, we saw very strong orders and shipments to many of our medical OEM customers with particular strength in surgical robotics and DNA sequencing, both of which saw another quarter with greater than 50% growth in sales year-over-year. For the first quarter, our vitality index, which is revenue from new products launched in the last 4 years, continues to be healthy at above 25% of sales with year-over-year NPI revenues up low single digits versus last year is high-runner NPIs rolled off and as we were supplied to constraints on newer products. Our non-GAAP adjusted EPS was $0.73 in the quarter compared to $0.58 in the first quarter of 2021, an increase of 26% year-over-year. Excluding the impact of ATI and IMS, Precision Motion's new product revenue grew 75% year-over-year and was over 20% of total sales in this segment and design wins for the full year were up double digits versus the prior year. Design win activity in the segment declined year-over-year as the segment was faced with very difficult comparable in the prior year as 2021 saw a record level of design win activity in the first quarter with significant customers, which we discussed in prior earnings call. In addition, new product revenue stayed strong at greater than 25% of sales in the first quarter and total MVI sales were up 14% year-over-year. R&D and SG&A expenses, which were $60 million in the first quarter, are expected to be approximately $60 million to $63 million in the second quarter, which is higher than the prior year, mainly as a consequence of recent acquisitions as well as further ramp-up of project spend in key NPI programs and the higher variable compensation. Overall, the strength of our performance in the first quarter, along with a favorable outlook in the second quarter positions us well to deliver full year results towards the upper end of our previously communicated guidance range for the full year of 2022."
}