{
    "symbol": "NOVT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 16:01:06",
    "content": " In the fourth quarter, we delivered $218 million in revenue, representing 10% year-over-year revenue growth on a reported basis and 14% growth on an organic basis. For the full year, we delivered $861 million in revenue, representing 22% year-over-year revenue growth on a reported basis and 14% growth on an organic basis. For the fourth quarter and full year, our vitality index, which is the revenue from new products launched in the last four years, continues to be healthy at about 25% of sales with year-over-year NPI revenue up low double digits versus last year, driven by new product revenue in DNA sequencing, smoke evacuation insufflators and detection and analysis for in vitro diagnostics. For the full year, adjusted EBITDA was approximately $184 million in 2022 compared to $153 million in 2021, representing growth of more than 20% year-over-year. For the fourth quarter of 2022, this segment saw revenue growth of 27% year-over-year. Within Photonics, new product revenue stayed strong at greater than 20% of sales in the fourth quarter and total new products grew more than 30% year-over-year. Design wins for the full year were up high single digit year-over-year as our sales team continues to win excellent new business in attractive high growth medical and industrial applications, overcoming difficult year-over-year comps. Our first quarter 2023, as we stand here today, we expect GAAP revenue in the range of $210 million to $212 million, which represents revenue growth in the mid single digit territory year-over-year. For the full year of 2023, we expect GAAP revenue in the range of $890 million and $915 million, which also implies mid single digit revenue growth year-over-year. Finally, our Vision segment is expected to demonstrate revenue growth in the range of 10% to 15% in the first quarter year-over-year. Interest expense, which was nearly $6 million in the fourth quarter and nearly $16 million for the full year of 2022 is expected to be slightly above $6 million in the first quarter of 2023 and is expected to be in a range of approximately $24 million to $26 million in the full year of 2023, driven by the rise in interest rates."
}