{
    "symbol": "TACT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 22:29:12",
    "content": " Our total revenue of $18 million for the fourth quarter was up a full 61% from the year prior period, with our casino and gaming market being up an incredible 123% to nearly $11 million. Our FST recurring revenue was also up approximately 14% to $2.4 million in the quarter, reflecting strong use of labels and additional software across our installed base. For the full year, we saw a total revenue grow by almost 48% to just over $58 million, which was our highest full year revenue numbers since 2015. This fantastic result was driven by an increase in our casino and gaming market of approximately 96% to $30 million for the full year and an increase in our FST recurring revenue by approximately 18% to $8.7 million, which was within our $8 million to $10 million guidance. I mentioned earlier, our FST recurring revenue which as reminder consists of software label sales and service, saw its third full year of sequential increase and its third quarter straight of over $2 million in revenue. Total net sales for the fourth quarter were $18 million, up 61% compared to $11.1 million in the prior year period. For the full year â\u0080\u009922, total net sales were $58.1 million, which was up 48% compared to $39.4 million in â\u0080\u009821. Sales from our food service technology market or FST for the fourth quarter were $3.1 million, down 13% compared to $3.5 million in the prior year period. For the full year, FST sales were $12.4 million, down 2% compared to $12.6 million in â\u0080\u009821. Our recurring FST sales which includes software and service subscriptions, as well as consumable label sales for the fourth quarter were $2.4 million, up 14% compared to $2.1 million in the prior year period. For the full year, recurring FST sales were $8.7 million, up 18% compared to $7.4 million for the full year â\u0080\u009821. Our casino and gaming sales reached a quarterly record of $11 million, up 123% from the fourth quarter of â\u0080\u009821 and up 42% sequentially from the third quarter of â\u0080\u009822. For the full year, casino and gaming sales were up 96% slightly more than $30 million. POS automation sales for the fourth quarter more than doubled, increasing 143% from the prior year to $3 million. POS automation sales for the full year were $10.7 million, up 121% from the full year â\u0080\u009821. For the fourth quarter, TSG sales were down 24% year-over-year to $946,000. For the full year â\u0080\u009922, TSG sales were $5.1 million down 15% from the full year â\u0080\u009821. For the full year â\u0080\u009922, operating expenses were $32.1 million, up 30% from the full year â\u0080\u009821. And for the full year, our selling and marketing expenses were $11.3 million, which was up 48% on year-over-year basis, largely due to return to pre-COVID levels of spending, as well as the build out of the FST sales group and higher sales commissions to our casino and gaming sales team. I always thought of the business is $5 million quarterly in terms of capacity at your market share, that would suggest you're near 100% market share now."
}