{
    "symbol": "TACT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 04:26:00",
    "content": " Combined with record high software sales, and adding in the hardware sales in the quarter, we reached total FST revenue in the quarter of $3.7 million, which, as I already mentioned, is a record for total FST sales dollars in a quarter. For the third quarter, Casino and Gaming sales were $7.6 million, which is up almost 92% year-over-year. Total net sales for the third quarter were $17.9 million, which was up 68% from $10.6 million in the third quarter of â\u0080\u009821. Sales from our Food Service Technology market, or FST, were up 14% to a record $3.7 million compared to the third quarter of â\u0080\u009821. Our recurring FST sales which includes software and service subscriptions, as well as consumable label sales were $2.6 million, also a record high and up 27% from the $2 million in the prior year period, and up 18% sequentially. Our Casino and Gaming sales were $7.7 million, which was up 92% from the third quarter of â\u0080\u009821 and 19% sequentially from the second quarter â\u0080\u009822. POS Automation sales more than quadrupled in the third quarter â\u0080\u009822, increasing 340% from the prior year to $5.2 million. Turning to operating income, we generated operating income of $387,000 or 2.2% of net sales in the third quarter of â\u0080\u009822, which compares to an operating loss of $1.6 million in the prior year period. And finally, as Bart mentioned, Iâ\u0080\u0099m pleased to report that we generated positive adjusted EBITDA of $1.2 million in the third quarter of 2022, compared to negative $1.2 million in the prior year period. Itâ\u0080\u0099ll be clearly record sales, I think the fourth quarter will be record sales for Casino and then the first quarter is going to be, if we can get that fourth line and get all the chips in you know weâ\u0080\u0099ll have another record in the first quarter. So we bought a lot of those chips and weâ\u0080\u0099re buying where we know weâ\u0080\u0099ve had issues before, weâ\u0080\u0099re going out and buying those chips or those electronics also, again, the goal is to get the third line up and running in the fourth quarter and get the fourth line up and running in the first quarter next year to meet this demand you know that weâ\u0080\u0099re seeing."
}