{
    "symbol": "VRT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 17:17:07",
    "content": " We list some of the components of this reduction at the bottom of the page, but in summary, there was $11 million or $10 million unfavorable price costs and $45 million headwind from FX and other, including a $10 million foreign exchange headwind, $10 million from direct labor, inflation and inefficiency in part driven by the supply chain challenges and approximately $20 million from cost headwinds in the Americas, primarily related to customer support costs, our sales incentive compensation program, and several other drivers. Americas adjusted operating profit of $82 million was negatively impacted year-over-year by price cost, higher fixed cost, including to support the volume ramp up in the second half and additional cost headwinds we referenced on the previous slide. Despite the reduction, third quarter guidance still reflects a material sequential step up from the second quarter across all of our key financial metrics with organic sales expected to be up approximately a $100 million, 70% of that volume and adjusted operating profit expected to be up almost $60 million at the mid-point. Despite the reduction from our prior guidance, our third quarter expectations return us to an adjusted operating profit level from last year's third quarter, and will serve as a strong bridge to a substantial improvement in the fourth quarter and transition us into a very strong 2023. Once again, we provide detail of this reduction on Slide 10, the next page, but from a macro perspective, it is driven by a $25 million foreign exchange headwind and an additional $12.5 million net from additional cost wins in various categories, partially offset by the benefit from incremental sales volume. As you can see on the slide, foreign currency translation certainly driven by the strengthening U.S. dollar negatively impacted net sales by approximately $160 million for the full-year and adjusted operating profit by approximately $25 million. We provide a sequential bridge from third quarter to fourth quarter for both net sales and adjusted operating profit, a $220 million increase in net sales, and a $113 million increase in adjusted operating profit. We anticipate approximately $10 million additional adjusted operating profit from E&I in the fourth quarter, primarily from incremental volume which should flow through at higher margins, pursuant to improved pricing, similar dynamic at base loadof business. So in summary the fourth quarter adjusted operating profit guidance of $253 million at the mid-point certainly represents a substantial quarter for us, especially considering the $13 million adjusted operating profit in the first quarter and the $82 million in the second quarter. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I think that's exactly right, Rob. Your line is open. Your line is open. I think that's exactly right, Rob."
}