{
    "symbol": "VRT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 15:26:04",
    "content": " We anticipated the volume ramp up in the back half of 2022 and we're certainly seeing it, with organic net sales up 20% in the third quarter, orders, excluding FX, were up 15%, which is even better than our preliminary orders number we provided earlier this month. We are affirming the fourth quarter adjusted operating profit guidance of $230 million at the midpoint, which continues to support our view of a very strong fourth quarter and we believe a very good position and very well for 2023. We still feel good about customer demand with orders up 15% in the quarter, excluding FX, and that is compared to last year's third quarter, where orders were up 17% from the prior year. Our net sales increased 21% from last year's third quarter and were up 20% organically, including 11% from volume and 9% from pricing. Adjusted operating margin sequentially improved to 9.1% in the third quarter from 5.9% in the second quarter as we continue our margin expansion actions, expecting approximately 14% in the fourth quarter, which would be a record quarterly high. Americas adjusted operating profit of $115 million and margin of 16.2% were positively impacted from improved price/cost, but offset by higher investment in fixed costs, including to support the launch of our new Monterrey facility. Organic sales in APAC increased 17% from last year's third quarter, 70% from volume, 30% from price. Of course, we still have to execute, and there is much work to be done to capture significant opportunity going forward, but as we have consistently communicated since the beginning of the year, this strong fourth quarter should provide a solid foundation for a very good 2023. This slide provides a lot of detail compared to last year's fourth quarter, and it captures the progress we have made in 12 months, notably the $135 million of incremental pricing. As Rob mentioned in his key messages earlier, we are reducing full year free cash flow guidance by $125 million at the midpoint with approximately $60 million of that from changed expectations for year-end inventory, $30 million from lower expected EBITDA and $30 million from lower expected cash collections. We had previously projected a more significant inventory reduction by year-end, but as we enter the fourth quarter with record projected sales volumes, and we anticipate continued strong volumes at the beginning of next year, we have reassessed those targets and will not press actions simply to hit a target."
}