{
    "symbol": "CELH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 18:48:08",
    "content": " The company achieved a record quarter in the third quarter of 2022 with sales over $188 million, delivering revenue growth of over 98% and according to their most recent scan data at retail, per IRI MULOC total energy, one week ending October â\u0080\u009823, 2022, Celsius is now the third largest energy drink in the United States. In addition, according to the trailing 12-week IRI MULOC total energy as of October 2, 2022, representing the majority of the third quarter, Celsius was again the number one brand driver of growth in the energy category in the United States, responsible for 29% of the category growth, driving over approximately incremental $123 million in sales for the category. We continue to see growth across all channels, including the non-tracked with our club channel sales in the third quarter totaling over $34 million in sales, increasing by approximately $20 million from the third quarter of 2021. Amazon sales, another non-tracked channel for the third quarter, hit a new quarterly record of approximately $16 million and year-to-date in 2022 totaled approximately $43 million and was up 108%, compared to approximately $21 million in the nine months ending 2021. In the convenience channel where we see the largest opportunity, Celsius continues to perform extremely well and according to the convenience and gas IRI as of the 12 weeks ending October 2, 2022, total U.S. energy, Celsius sales increased 158% in the channel setting a new sales record. In addition, Celsius has seen an approximately 11% increase in ACV, since October 1, 2022, and the initial launch with the PepsiCo distribution network with average items carried per store increasing from an average of 7.7% to 8.3% over the same three week timeframe. International sales only represented approximately about 4.6% of total sales for the quarter with total sales approximately $8.7 million, compared to $10.4 million in the prior year quarter. Our European revenues represented a $7.5 million of international revenue, compared to $9.5 million a year ago quarter, a decrease of approximately 21% with around a third of the revenue decrease associated with foreign exchange impacts, as well as timing of innovation and supply chain disruptions. Gross profit for the quarter increased 109% to approximately $79 million, up from approximately $38 million a year ago quarter and gross profit margins were 41.8$ and 49.6% excluding outbound freight for the three months ending October or September 30, 2022, compared to 39.7% and 48.8%, excluding outbound freight in the prior year quarter. Our product channel mix, sales mix also has been impacted margins as the club channel revenues has historically had a lower margin levels due to the secondary repack nature of the product with the rapid growth of the channel, which contributed to approximately $34 million in revenue in the third quarter has increased our overall margin pressure and we continue to initiate production efficiencies to improve margins in this channel, including working with our co-packers, who have the capabilities to produce in line and also so we can limit the number of secondary production facilities. U.S. store count now totals 174,000 locations nationwide in the U.S. growing over 60,000 doors or 54% from 114,000 doors as reported in the third quarter of 2021 with additional expansion planned throughout the rest of the year and into 2023, acceleration by the -- and yet being accelerated by the PepsiCo distribution agreement. Our effective tax rate for the nine months ended September 30, 2022 was negative 33.5% -- nine months ended September 30, 2022, deferred from the statutory federal income tax rate of 21%, primarily due to the tax impact of the $282.5 million Series A preferred stock value adjustment, which will be expensed over 20-years for book purposes. And looking at other activities that occurred during the quarter, we had previously planned on bringing our FAST bar brand to the U.S. from Finland, but as a result of the Pepsi partnership we will be focusing on our core Celsius Energy brand in the U.S. transition and rolling this product out internationally and in turn, we performed evaluation whereby we determined that the FAST brand was impaired in the amount of $2.4 million. Our third quarter ended September 30 2022, had revenue up -- revenue of approximately $188.2 million, an increase of $93.3 million or 98% from $94.9 million for the three months ended September 30, 2021. Approximately 102% of this growth was a result of increased revenues from North America, where third quarter 2022 revenues were $179.5 million, an increase of $95.1 million or 112% from the same period in 2021. The balance of the revenues for the three ended September 30, 2022 quarter were mainly attributable to European revenues of $7.5 million, which increased by $2 million from the same period in 2021, due to foreign exchange rates, timing of new product launches and continuing supply chain challenges. Other international markets generated approximately $200,000 in revenues during the three months ended September 30, 2022, an increase of 3%. For the three months ended September 30, 2022 gross profit increased by approximately $41 million or 109% to $78.7 million. Gross profit margin reflected an increase to 41.8%, 49.6% excluding outbound freight of revenues for the three months ended September 30, 2022, relative to 39.7% or 48.8% excluding outbound freight for the prior year quarter. Sales and marketing expenses for the three months ended September 30, 2022 were approximately $198.8 million, an increase of approximately $176.1 million or 779% relative to September 30, 2021. In the third quarter of 2022, after backing out the $155.4 million of termination fees, compared to 24% for the third quarter of 2021. General and administrative expenses for the three months ended September 30, 2022 were approximately $27.5 million, an increase of $4.2 million or 18% from $23.3 million for the three months ended September 30, 2021. G&A expense as a percentage of sales 6% for the third quarter 2022, and excluding the stock-based compensation of $17.9 million in 2021."
}