{
    "symbol": "CELH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 20:43:02",
    "content": " We continue to see growth across all channels, including those not tracked with the club channel sales increasing by approximately $24.9 million for the second quarter from 2021, an additional rollout and expansion in over 175 new BJ wholesale locations that have been -- took place in the second quarter. Sales hit another quarterly record of $154 million, and our U.S. revenue totaled $145.4 million as approximately $22 million increase sequentially from the first quarter in U.S. revenues. Gross profit for the quarter increased 110% approximately to $59.3 million, up from $28.2 million for the year ago quarter. With this rapid growth in the channel, which represented approximately $30.9 million of revenue in the second quarter, it has increased the overall margin pressure. Our DSD network sales delivered growth of in the second quarter when compared to the prior year, totaling approximately $61.9 million with over $41.8 million approximately in incremental revenue generated during the quarter. The convenience store channel accounted for on retail on sales, according to IRI SPINS of about $87 million in the second quarter, and our sales were up 227% compared to the second quarter and 2021 core IRI SPINS. Their most recent reported Nielsen scan data as of July 16, 2022, shows Celsius sales were up 143% year-over-year for 4 weeks, 194% for the 12 weeks and 185% for the second quarter. And this is as of the latest 4 weeks ending July 30, 2022, Stackline Energy category data total U.S. Celsius year-over-year sales is up 185% compared to Amazon energy category, which is up 79%. Celsius is outpacing the category growth on the platform by approximately 2.5% on a year-over-year basis, and that is the 4 weeks ending July 30, 2022, Stackline total energy total U.S. Our total U.S. store count now totals approximately 196,000 locations nationally, growing over 59,000 doors and locations or 54% growth from 109,000 doors or stores reported as of the end of the second quarter of 2021 with additional expansion planned throughout 2022 and acceleration anticipated with the new partnership with PepsiCo. Internationally, Nordics revenue totaled at $7.3 million, a decrease from the prior quarter, primarily due to foreign exchange rates and timing of orders -- and both timing of new launches with end consumers as well as supply chain delays in the market. Before I turn the call over to Jarrod, I want to close my prepared remarks recognizing the amazing job of our entire team and all of our partners has -- which they have done, establishing Celsius as the leading driver of brand growth in the energy category over the first half of 2022 and the incremental opportunities for growth going forward with our new partner, PepsiCo. Our second quarter revenue for the 3 months ended June 30, 2022, was approximately $154 million, an increase of $88.9 million or 137% from $65.1 million for the 3 months ended June 30, 2021. Approximately 103% of this growth was as a result of increased revenue from North America where second quarter 2022 revenues were $145.4 million, an increase of $91.8 million or 171% from the 2021 quarter. Asian revenues, which include royalty revenues from our China licensee, contributed an additional approximately $900,000, an increase of 43% from approximately $600,000 for the prior year quarter, which includes increases in royalties payable under our licensing agreement. Other international markets generated approximately $400,000 in revenues during the 2022 quarter, an increase of roughly $400,000 or 634% from the prior year quarter. For the 3 months ended June 30, 2022, gross profit increased by approximately $31.1 million or 110% to $59.3 million from $28.2 million for the 3 months ended June 30, 2021. Gross profit margins reflected a decrease to 38.5%, 44% excluding outbound freight for the 3 months ended June 30, 2022, from 43.4% or 51.8% excluding outbound freight for the 2021 quarter. General and administrative expenses for the 3 months ended June 30, 2022, were approximately $14.4 million, an increase of $2.1 million or 17% from $12.3 million for the 3 months ended June 30, 2021. Employee costs for the 3 months ended June 30, 2022, reflect an increase of $1 million in investments in this area also required to properly support our higher business volume in the commercial and operation areas of the business as well as travel and expenses, which are now being incurred. Lastly, as a total percent of revenue, G&A costs decreased to 9% of sales for the 3 months ended June 30, 2022, compared to 19% in the prior year. When excluding stock-based compensation, G&A costs decreased to 7% of sales for the 3 months ended June 30, 2022, compared to 8% in the prior year. Net income for the 3 months ended June 30, 2022, was $9.2 million or $0.12 per share based on a weighted average of 75,451,165 shares outstanding and diluted earnings per share of $0.12 based on a fully diluted weighted average of 78,000 -- 78,371,705 shares outstanding, which includes the dilutive impact share-based awards of 2,920,540 shares. Cash flows provided by operating activities totaled approximately $42.3 million for the 6 months ended June 30, 2022, which compares to $30.3 million net cash used in operating activities for the 6 months ended June 30, 2021. In addition, raw material inventory decreased from approximately $90 million in the first quarter of 2022 to $57 million in the second quarter with the reduction primarily representing the pull-through of international cans as well as the fantastic job our sales and operations teams have done in selling product over the summer."
}