{
    "symbol": "NOV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 14:14:09",
    "content": " Helped by solid orders in renewables technologies through the past year, NOV's consolidated book-to-bill for the trailing 12 months through the third quarter has been 116%. That is why we were not surprised to see growth starting to accelerate in international markets, and frankly, would not be surprised to see it surpass North America, where, in addition to free cash flow reinvestment constraints, the market is facing some short-term ceilings on crew and equipment availability, which by the way, is translating into higher rig rates and oilfield service pricing our customers in North America have seen over the past couple of quarters. So as U.S. supply growth continues to disappoint to the downside, even as we've drawn down half of our inventory of DUC wells, with SPR releases of 1 million barrels per day set to wind down soon with Russian oil supply in decline following sanctions with OPEC underproducing its quotas even before its recently announced cuts, with Europe poised to see more gas to oil switching this winter and with global demand generally suppressed from normalized levels due to continuing COVID restrictions in China, it feels like we, and by that, I mean mankind, are hurtling towards a catastrophe, a very painful and damaging energy crisis. Our downhole business reported revenue growth in the upper teens with solid EBITDA flow-through, improved execution against supply chain-related challenges that limited the availability of special elastomers and certain grades of steel used in the business's high-spec products, allowed the unit to better meet robust demand for its proprietary tools, which drive improved drilling efficiencies for oil and gas operators. For our Wellbore Technologies segment, we expect building momentum in the Eastern Hemisphere and pent-up demand for our products to be partially offset by plateauing North American drilling activity, resulting in revenue growth of 2% to 6% with EBITDA flow-through in the 30% range in the fourth quarter. For the fourth quarter, we expect growing opportunities associated with our Completion & Production Solutions segment's backlog to be mostly offset by certain projects that were pulled forward into the third quarter and supply chains that remain elongated, resulting in revenues that should be relatively flat. Our Rig Technologies segment generated revenues of $511 million in the third quarter of 2022, an increase of $49 million or 11% sequentially and an increase of 31% compared to the third quarter of 2021. The wind installation vessel space where NOV is leader, and we've come out with new technology that we referenced in our press release is the majority of that $90 million, but we're seeing really good growth in particular around geothermal offerings and I think we mentioned in our prepared remarks, ReedHycalog has emerged as a market leader in terms of hard rock drilling that's required for geothermal, but also generating a little bit of revenue in our solar initiative and a lot of interest in CCUS technologies."
}