{
    "symbol": "NOV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 15:25:02",
    "content": " For the first quarter of 2022, NOV's revenue of $1.548 billion grew 2% sequentially, and EBITDA increased $34 million to $103 million or 6.7% of revenue. The organization's execution against shifting challenges and supply chain freight and labor improved during the first quarter, in part by broadening our base of suppliers as well as recovering escalating costs through higher pricing, where costs for certain raw materials like resins appear to be easing. Despite the soft quarter, the business unit achieved 41% revenue growth with incremental margins in the 70% range in comparison to the first quarter of 2021 and had several recent commercial successes, which should drive wider adoption of the unit's newer technology offerings. For our Wellbore Technologies segment, we expect the continued improvements in global oil field activity to drive revenue growth despite ongoing supply chain challenges, resulting in a sequential revenue improvement of 1% to 5% during the second quarter. Our Completion & Production Solutions segment generated revenues of $530 million in the first quarter of 2022, a decrease of 3% from the fourth quarter of 2021, but an increase of 21% compared to the first quarter of 2021. Just off the cuff, I would say, I think the shorter cycle catching up improving the situation around our very, very constrained supply chain challenges meeting sort of the near-term demand of supporting rigs and frac fleets and stimulation equipment going back to work, both land and offshore, I think that's kind of the biggest near-term needle mover for for NOV. As Jose mentioned in the guidance, we're facing some constraints in rig around catching up on our spare parts backlog and working through that. But longer term, yes, I think these larger projects will contribute, and we're going to continue to see good demand for renewables and offshore wind revenue opportunities for NOV. And so it's -- what I like about where we are today is, in my opening remarks kind of reflected this, I feel like we're sort of at an energy crossroads, and it's going to take all forms of energy. And I think I think as they gain pricing power, which this quarter has been really interesting to kind of hear their reports of how their first quarter -- it feels like, to us, they're getting a lot more purchasing -- our pricing power across their businesses that sort of paves the way for reinvestment in their fleets and to kind of build out the infrastructure required, which look at the end of the day, you have to put heavy assets back in the field to drill wells and bring production on."
}