{
    "symbol": "NOV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 15:38:04",
    "content": " While North America drove most of the growth during 2022, as Clay noted, momentum in international markets has been building throughout the year and outpaced North America in the fourth quarter, resulting in 14% sequential revenue growth in international markets and 4% in North America, which included strong growth in offshore Gulf of Mexico. Despite the increase in working capital arising from strong revenue growth, cash flow from operations was $154 million in the fourth quarter. While weâ\u0080\u0099re in the infancy of providing digital solutions, which drive higher levels of efficiencies for both drilling and now completion operations, M/D Totcoâ\u0080\u0099s success in developing industry-leading digital solutions beyond its legacy data acquisition systems has already allowed the business to achieve its highest revenues and EBITDA in eight years, and the outlook remains bright. Our Completion & Production Solutions segment generated revenues of $738 million in the fourth quarter, an increase of 8% from the third quarter and an increase of 34% from the fourth quarter of 2021. Our Rig Technologies segment generated revenues of $620 million in the fourth quarter, an increase of $109 million or 21% compared to the third quarter and 44% compared to the fourth quarter of 2021. While 2023 is expected to be a year of growth and improved profitability for our Rig Technologies business, we expect seasonality and the timing of projects to result in first quarter revenues contracting 10% to 15% with decremental margins in the 30% range. And one of the things that kind of distorts the booking -- how you look at book-to-bill there is this massive backlog that we have associated with our Saudi rig manufacturing contract, which was that $1.8 billion of backlog, if you sort of strip that out in terms of the revenue produced by it and just sort of look at the quarter, excluding contributions from that facility, book-to-bill was a little bit over 100% from a conventional rig capital equipment standpoint."
}