{
    "symbol": "TPC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 22:38:05",
    "content": " Keep in mind, however, that our backlog does not yet include the more than $3 billion of significant potential awards, including the New York City Brooklyn Jail project, which we have released now, have we not, Gary, which we'll release their decision to move forward with an award shortly, valued at $2.95 billion; and two hospitality and gaming projects in California, collectively valued at more than $500 million. Other larger near-term opportunities include the $3 billion-plus Queens jail for the same city of New York prisons that we are very optimistic about that we will make our proposal in May; part of the replacement, of course, of the Rikers Island prison facility, which has been mandated by the federal government; the $2-plus billion Honolulu Rail Transit project, which we bid in 2020 and were announced as the apparent low bidder even though it was ultimately rejected because it was significantly over budget; and the $1.5 billion Inglewood Automated People Mover Project in Southern California, which will bid between the third and fourth quarter. Revenue for 2022 was $3.8 billion, down 18% compared to 2021, with the decrease driven by various factors, as Ron mentioned earlier, including the lack of major new awards over the past few years that were primarily induced by the COVID-19 pandemic and related customer budgetary constraints as well as delays in 2022 on certain mass transit projects in California. Our operating income for 2022 was negatively impacted by an aggregate $330 million related to adverse judgments or decisions, significant settlements and changes in estimates for project charges that I mentioned earlier. These totaled $120 million in 2022 due to increases of unapproved work on various projects as well as the successful negotiation of significant lower margin and lower risk change orders on a Civil segment mass transit project, which are all expected to reverse themselves over the remaining lives of the respective projects. Building segment income from construction operations was $7 million compared to $29 million last year, and Specialty Contractors segment reported a loss from construction operations of $168 million in 2022 compared to a $10 million loss in 2021. The $330 million of adverse judgments, settlements and changes in estimates for project charges in 2022 negatively impacted the Civil, Building and Specialty Contractors segments by $128 million, $22 million and $180 million, respectively, while the $120 million of temporary negative project adjustments affected the Civil, Building and Specialty Contractors segments by $77 million, $3 million and $40 million, respectively, with about half of the Civil segment impact due to the successful negotiation of change orders on the civil project in California that I just mentioned. Revenue for the fourth quarter of 2022 was $907 million, down about 13% compared to approximately $1 billion for the same quarter last year. The Civil segment had income from construction operations of $9 million for the fourth quarter of 2022 compared to $78 million for the fourth quarter of 2021, while the Building segment had a $2 million loss compared to a $9 million of income from construction operations for the same quarter of last year, with Specialty Contractors segment reporting an $86 million loss from construction operations in the fourth quarter of this year compared to a loss of $16 million last year's fourth quarter. For the fourth quarter of 2022, adverse judgments, settlements and changes in estimates for project charges totaled $142 million and impacted the Civil, Building and Specialty Contractors segments by million $44 million, $12 million and $86 million, respectively, while temporary negative project adjustments were rather nominal in the quarter. Due to the various factors that I mentioned, net loss attributable to Tutor Perini for the fourth quarter of 2022 was $93 million or a loss of $1.80 per share compared to net income attributable to Tutor Perini of $29 million or $0.57 of earnings per share for the same quarter last year. To briefly recap, we recorded operating cash of $207 million in 2022 and ended the year with a reduced backlog flat at $7.9 billion with the clear expectation that in 2023 we will book significant new awards, especially since we just announced the potential of the New York City prison award at $3 billion."
}