{
    "symbol": "SBLK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-17 14:38:05",
    "content": "  Operator: Thank you for standing by, ladies and gentlemen, and welcome to the Star Bulk Carriers Conference Call on the Fourth Quarter 2022 Financial Results. We have with us Mr. Petros Pappas, Chief Executive Officer; Mr. Hamish Norton, President; Mr. Simos Spyrou; and Mr. Christos Begleris, Co-Chief Financial Officers; Mr. Nicos Rescos, Chief Operating Officer; and Mrs. Charis Plakantonaki, Chief Strategy Officer of the Company. I'm Simos Spyrou, Co-Chief Financial Officer of Star Bulk Carriers, and I would like to welcome you to our conference call regarding our financial results for the fourth quarter of 2022. In today's presentation, we will go through our Q4 results, cost evolution during the quarter, an overview of our balance sheet, an update on banker benefit and vessel operations, the latest on the ESG front and our views on industry fundamentals, before opening up for questions. Net income for the quarter amounted to $86 million and adjusted net income of $93 million or $0.84 per share, adjusted earnings per share. For the fourth quarter, as per our existing dividend policy, we declared a dividend per share of $0.60 payable on or about March 14, 2023. The graph on the bottom of the page highlights the cumulative performance over the last 12 months, which illustrates the strength of the platform in a robust drybulk market. Our last 12 months, adjusted EBITDA is $809 million and adjusted net income is $609 million. Over the same period, we have returned a cumulative dividend of $5.1 per share or $526 million to our shareholders. Since 2021, we have declared a total dividend of $9.35 per share or $961 million. Our time charter equivalent rate was $19,590 per vessel per day. Our combined daily OpEx and net cash cost G&A expenses per vessel per day amounted to $5,182. Therefore, our TCE less OpEx and G&A is approximately $14,400 per day. We started the quarter with $393 million in cash, and generated positive cash flow for operating activities of $116 million. After including debt proceeds and repayments, CapEx payments for energy saving devices and ballast water treatment system installments and the third quarter dividend payment, we arrived at a cash balance of $286 million at the end of the quarter. For the calculation of our dividend distribution, we have backed the debt prepayment of $44 million that we drew from January 2023 to end at an adjusted balance of $331 million. Since 2022, we have completed refinancings totaling $430 million that reduced our interest costs by approximately $5.2 million per year as a result of achieving significantly lower margins. In an increasing interest rate environment, we have interest rate swaps with an outstanding notional of approximately $722 million fixed at an average rate or 46 basis points for an average remaining maturity of 1.1 years. As of December 31, 2022, the mark-to-market value of these swaps was $33 million. In Slide 6, we will illustrate how Star Bulk continues to benefit from a widening of the fuel spread between HSFO and VLSFO. 120 scrubber fitted vessels surpassed 131,000 operating days with the average system availability of 99.5%. The average power fuel spread currently hovers at around $230 per ton based Singapore export prices, when we cater approximately 60% of our annual fuel demand. Indicatively, the average lifetime spread achieved in Q4 was $253 per ton and $274 dollars per ton for the full year of 2022. For restructuring purposes, on the top left of the slide, we present a sensitivity table that shows the impact that market benefit can have on our bottom-line based on consumption of approximately 700,000 tons of HSFO per annum for our scrubber-fitted vessels. OpEx excluding non-recurring expenses was $4,205 for Q4 2022. During calendar 2022, Star Bulk assumes management of an additional 19 vessels for third-party managers, streamlining ship management operations and costs spread. Turning to Slide 8, we provide our fleet snapshot and guidance around our future drivers and vessel upgrade expenses and the relevant total off-hire days. For the second year in a row, Star Bulk has participated in the Carbon Disposal Project exceeding its score of B and improving its performance versus last year for a score of B minus. It also plays Star Bulk above growth the industry average of C, and the global average of C which indicates Awareness Level. During 2023 Star Bulk will aim to continue improving its environmental stewardship, by measuring and reporting for the first time also its Scope 3 emissions, namely the emissions which we indirectly affects in our value chain. On the regulatory front, Star Bulk has taken all necessary technical and operational measures to ensure compliance with the EEXI and CII targets as set by the international maritime organization, which came into force in January 2023. With regards to the Companyâ\u0080\u0099s governance, Star Bulk is deploying new systems to optimize its commercial and operational performance, and is also further strengthening its cyber security systems, processes and controls. During 2022, a total of 31.2 million dwt was delivered and 4.5 million dwt was sent to demolition for a net fleet growth of 26.7 million dwt or 2.8% year-over-year. As a result of the bulk trends, growth is unlikely to exceed 2% per annum over the next three years. According to Clarksons, total dry bulk trade during 2022 is estimated to have contracted by 1.9% in ton miles. Trade was affected by the war in Ukraine, weaker Chinese imports, and a slowdown of global economic activity due to surging commodity prices, inflation interest rate hikes, and a strong U.S. dollar. During 2023, dry bulk demand is projected to increase by 2% internal miles with the IMF forecast for global GDP growth presently standing at 2.9%. Furthermore, the shift of coal, grain, and minor bulk trade patterns to long -- longer haul route due to inefficiencies related to the war in Ukraine will continue to inflate ton miles. Iron or trade contracted by 3.4% during 2022, and is projected to expand by 0.4% during 2023. Crude steel production from the rest of the world decreased by 6.5% affected by surge in energy costs and weaker steel margins following the war in Ukraine, nevertheless, China's steel productions showed signs of stabilization during the second half, while lower domestic iron ore output and stockpiles provided positive indicator for imports point forward. During the last month, a resumption of Chinese coal -- Australian origin is taking place marking the end of the unofficial ban that started during the fourth quarter of 2020. At the start of 2022, grain trade market experience the supply shock as the war abrupt how did the Ukrainian export for six months, which account for 10% of total grain trade. The outlook for 2023 is positive as results of trade route is already taking place, another exporting nations filling the gap of the lost Ukrainian supply. Moreover, the container ship market correction is moderating support of smaller geared dry bulk vessels. Furthermore, West Africa bauxite exports continue to expand with the high base and generate strong ton miles for Capesize vessels. Finally, despite the current seasonal spot market weakness, the long term prospects of the dry bulk market remain encouraging given the 25-year low order book, the environmental regulations and the positive effect on dry bulk demand from the opening of the Chinese economy. Star Bulk is well-positioned due to its scrubber fitted in diverse fleet, take advantage of recovery in freight rates. Just wanted to talk about the cash flow movement kind of expected in the coming quarter, I think, probably people are pretty hyper focused on the upcoming dividend here and then testing the bottom of seasonally weak rates. As we said, this is approximately $190 million for 2023 for the entire year. Now for the first quarter of 2023 in market that is essentially decreasing, we would expect the change in working capital to be slightly positive. I think last Q the non-recurring OpEx was reported around $4,700 dollars per day, now it's down around $4,200 dollars per day. Just really quick last question for me, I mean, I think capital discipline is very much a feature of Star Bulk. It looks like based off of on Slide 13 that the bookings you've got so far in the first quarter that even if rates remain as soft as they are, you'll remain profitable in the first quarter. The bulk of our open position has to do with Newcastlemax, and we think that we'll be able to maintain the level depending of course how market goes. You look at the spot rate being like $2,500 on the capes, but that is according to a speed of I think 13 knots. What we usually do in situations like this is like that, we slow steam the vessels and a trip that would calculate the 2.500 actually ends up calculating at 8,000 because we burn much less fuel oil. If to that you add the scrubber benefit, which for capes Newcastlemax is higher than other vessels, and the carrying capacity of the bigger vessels, you can reach levels which should be very close to what the average is, even if the market during March stays where it is. Now, if you add to that, the scrubber benefits and the fact that we slow steam vessels during not very good markets, I think we will be profitable again in Q2 and probably, hopefully better than guess the Q1, and we're very positive for the rest of the year. If you run cape by 13 knots and you burn 50 tons, then if you go at 11 tons, which is like 15 -- sorry, 11 knots, which is about 15% less speed, you probably burn 25 tons or 28 tons, which is almost 50% below the 13 knots consumption, and therefore, that's where you gained from. And maybe just one final follow-up and maybe related to Chris' first question about the dividend; obviously, you've had this long-term policy paying out cash and excess of 268 million threshold. Well, our policy is pretty clear and we don't frankly anticipate any market in the foreseeable future leaving us with less cash than the minimum amount that would call for a dividend. But if basically our cash balance declines over the quarter and declines below the minimum threshold, then as in 2020 -- parts of 2020, there might not be a dividend, but we don't anticipate that actually happening."
}