{
    "symbol": "SBLK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 15:36:03",
    "content": " We have with us Mr. Petros Pappas, Chief Executive Officer; Mr. Hamish Norton, President; Mr. Nicos Rescos, Chief Operating Officer; Mr. Simos Spyrou and Mr. Christos Begleris, Co-Chief Financial Officers of the company. I am Christos Begleris, Co-CFO of Star Bulk Carriers and I would like to welcome you to our conference call regarding our financial results for the second quarter of 2022. In todayâ\u0080\u0099s presentation, we will go through our second quarter results, cash evolution during the quarter, an overview of our balance sheet, an update on our scrubbers and vessel operations, the latest from ESG front and the views on industry fundamentals before opening up for questions. For the second quarter, as per our existing dividend policy, we declared a dividend per share of $1.65, payable on or about September 8, 2022. The graph on the bottom of the page highlights the cumulative performance over the last 12 months, which illustrates the strength of the platform in the robust dry bulk market. Over the same period, we have returned a cumulative dividend of $6.55 per share or $674 million to our shareholders. Our time charter equivalent rate was $30,451 per vessel per day. Our combined daily OpEx and net cash G&A expenses per vessel per day amounted to $5,684. Therefore our TCE less OpEx less G&A is $24,767 per vessel per day. Looking at our chartering coverage for the third quarter of 2022, we have covered 61% of our fleetâ\u0080\u0099s available days at the daily rate of $29,000 per day. Slide four, graphically illustrates the changes in the companyâ\u0080\u0099s cash balance during the second quarter. After including debt proceeds and repayments, CapEx payments for ballast water treatment system installments and the first quarter dividend payment, we arrive at a cash and cash equivalent balance of $385.6 million at the end of the quarter. Please turn to slide number five, where we highlight the continued strength of our balance sheet, our total cash today stands at $474 million. Meanwhile, our total debt stands at $1,410 million . After the completion of the recent refinancings, we have 12 and 11 vessels with market value in excess of $210 million, improved debt maturities until 2024 where we have $2 million payments  part of which were in the process of refinancing. On the scrubber utilization front, Star Bulk  108,000 scrubber operating days, with an  99.5% of system availability for us. Indicatively, the average Hi5 spread achieved during the second quarter was $323 per ton. Operating expenses excluding non-recurring expenses was at $4,674 for the quarter -- second quarter 2022. Net cash G&A expenses were $1,010 per vessel per day for the same period. Despite continued adverse COVID-related expenses and inflationary pressures, which have a direct impact on our operating expenses, the combination of our in-house management and scale of the group, enables us to sustain a very competitive cost base and maintain our position as the lowest cost operator amongst our peers. A major new redevelopment is a decision by Star Bulkâ\u0080\u0099s Board of Directors to establish an ESG Committee, which will guide and support management on environmental, social, and governance matters in order to ensure that the company promote and integrate ESG in its strategy and business operations. On the environmental front, Star Bulk has taken part for a second year in the annual assessment cycle for the Carbon Disclosure Project. Furthermore, in an effort to continuously improve on our sustainability performance, we have participated in the annual S&P Global Corporate Sustainability Assessment, which will provide us with a score and ranking based on various financially relevant ESG criteria. During the first half of 2022, a total of $15.6 million deadweight was delivered and $1.8 million deadweight was sent to demolition for a net fleet growth of $13.8 million deadweight for 1.5% year-to-date and 3% year-on-year. The order book stands at only 7.1% of the fleet, with just $9.4 million deadweight reported as firm orders between January and June. Uncertainty on future propulsion, along with surging shipbuilding costs has helped keeping new orders under control, while shipyards continue to fill 2025 capacity with more profitable to the shipyards vessels. Furthermore, despite the correction of global steel prices during the second quarter, inflated scrub prices may simplify the demolition of overage tonnage without scrubbers during seasonal downturns. The average steaming speed of the fleet has decreased by 2.8% during the last year to 11.3 knots, as a result of a strong increase of bunker costs. As a result of the above trends, net fleet growth is projected to drop below 2.5% in 2022 and is unlikely to exceed 2% during 2023 and 2024. According to Clarkson, total dry bulk trade during 2022 and 2023 is projected to expand by 0.1% and 1.7% in tons and by 1.4% and 1.9% in ton-miles, respectively. During the first half of 2022, total dry bulk volumes were down by approximately 0.5%, mainly due to a 6% decrease of Chinese imports as a result of a candid zero COVID policy, export disruptions and the war in Ukraine. Furthermore, there is softening of coal, grain and minor bulk trade patterns to longer-haul routes will inflate ton-miles and help moderate the weaker volumes seen during the first half of 2022. Chinaâ\u0080\u0099s steel industry went through a strong slowed down over the last year, due to significantly higher input costs and a weak real estate market. Nevertheless, China big iron output is experiencing a recovery supported by infrastructure stimulus and iron ore port stockpiles during the second half of the year experienced a sharp decline. During the first half of the year, Brazil iron ore exports decreased by 7% with Valerie simply announcing an annual guidance between 310 million tons and 320 million tons, which is flat from last year but indicates higher shipments for the rest of the year. During the first half of the year, China and India have increased their domestic production significantly in order to help raise stocks, reduce prices and be less dependent on imports. However, Indiaâ\u0080\u0099s stockpiles still stand at relatively low levels and the imported coal mix to remain high in order to avoid last yearâ\u0080\u0099s blackouts and therefore strong demand is expected after the monsoon season. Ukraine exports account for approximately 10% of total grain trade and since the invasion in late February, exports have fallen to almost zero. During the first half of the year, grain shipments declined by 11.5% as a result of war or weather conditions in Brazil and a strong spike in prices. On the other hand, U.S. soybean outstanding sales stand at record high levels for this time of the year, while the Brazilian corn season has started with inflated volumes indicating stronger grain trade during the second half and the fourth quarter. During the next few years, Chinaâ\u0080\u0099s demand for grains is projected to be strong as their five-year plan is focused on food security and inventory building. Moreover, expanding West African bauxite exports continue to inflate ton-miles with the year-to-date exports up by 8%. Finally, we remain optimistic for the prospects of the dry bulk market, now the company is well positioned to enjoy and take advantage. The record low order book, combined with the lack of yard space, upcoming environmental regulations, and high bunker costs and some pressing orders and speeds create a favorable supply side picture for our industry in the long-term. On the demand side, there are short-term risks, but strong commodity flows over longer distances due to the change of trade partners are expected to support earnings over the next years. Well, the younger vessels have lower consumption than the older vessels and therefore in effect, they have -- on the one hand, they have the advantage of being eco, on the other by burning more -- less tons they get less over scrubber advantage. First of all, it depends on the price of bunkers, and second, it depends on what -- how the market rates are. So, it would -- the highest speed would be at a very -- at very high rates and very low bunker prices and the lowest speed would be with very high bunker prices and very low speeds. We expect the old bunker remain where they are, not to fall much, and therefore, we also expect that -- we expect also the market to be decent during the next four months, five months, especially towards for the quarter. Now as vessels  time, 1 knot difference from 11.3 to 12.3 is about -- I think thatâ\u0080\u0099s about a 9% reduction or 8.5% reduction and you multiply that by 60%, so thatâ\u0080\u0099s about 5% effect on supply. I think I was reading a figure of like 68% less congestion this year than last year, which we think actually it has run its course. If anything and as we expect to have much more iron ore trade during the next four months, five months, we believe that for the Capesize possession will actually increase in China going forward. However, I was just -- last week I saw that containers from a well-known public -- big public shipping company fixed for three years with like $54,000. Also, one interesting thing is that, congestion on Supramxes is actually increased by a bit like 6%. And this is maybe impacting a little nuance I noticed and then maybe just so happens to give this way, but you spent $20 million on the buyback this year, you are buying at an average price, letâ\u0080\u0099s say, $25 and the issue close to $20 million also under the ATM at $31. So, definitely good pricing on both counts, but is that a coincidence that they are lined up like that $20 million orâ\u0080¦\n Yeah. And so do you think that would be, how you guys approach it in the future andâ\u0080¦\n Well, hopefully, in the future, we will be able to issue shares and buy lot of vessels in a way that very profitable for the shareholders. And one final one, I just -- I saw in the cash flow statement a $35 million pre-bill outlay. This is -- this was just a short-term investment we place below six months, but since the maturity was after the end of the quarter June 30th, under U.S. GAAP we have to report them not in our cost, but in our investment portfolio. So we consider them costs and we add them back to the cash balance for the calculation of the dividend, all of these bills are maturing within the third quarter. The cash balance divided by the number of shares outstanding, came up with $1.65 based on the formula and it was a pretty mechanical operation, and I think, you can anticipate that we would go through the same basically mechanical calculation every quarter. Your extensive program, retrofit program is yielding outstanding results given the outside spreads kind of seen as of late and although the spread in the futures market is slower course should continue to provide a significant tailwind. Indicatively, the spread in Singapore is in the high $200s per ton, close to $300 per ton. And the calendar 2023 right now is at levels around $160 per ton, $170 per ton."
}