{
    "symbol": "UTI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-12 11:28:05",
    "content": " Revenue for the year was up 25% to approximately $419 million while adjusted EBITDA was up 72% to approximately $56 million, while new student starts grew 2.7% for the year. As a result, I'm happy to announce that we now expect to deliver in excess of $700 million in revenue and adjusted EBITDA approaching $100 million in fiscal 2024 and thus achieving one of our key milestones a full year sooner than we previously projected. For the full year, adjusted EBITDA was $55.9 million versus $32.5 million in 2021, representing 72% year-over-year growth and above the high end of our guidance range. For reference, during the 12 months ended September 30, 2022, the Concorde generated unaudited results of approximately $200 million of revenue and $17 million of adjusted EBITDA, both showing healthy year-over-year growth. The lower than initially anticipated UTI new student starts in 2022 along with the timing of the new campus launches, increasing contribution from the high school channel and 2023 program expansion all impact the pacing of UTI revenue throughout the year, with growth skewing towards the second half. However, I will offer that on a like-for-like basis, we expect to see some margin compression in 2023 on the historical UTI business given the lower revenue flow through from 2022, new campus and program expansion ramps, ongoing investments to support our growth and diversification strategy and in our emissions channels and pockets of inflationary pressure. As such, with our currently announced and in flight initiatives, we now expect to deliver an excess $700 million of revenue and adjusted EBITDA approaching $100 million in fiscal 2024 with additional revenue and adjusted EBITDA growth in 2025 in subsequent years both from our existing business and initiatives and potential future growth opportunities. And of course, a little bit of a shift as Jerome was just talking about with adult, we're not counting on growth from adult in â\u0080\u009923  last year in '22, really that growth coming primarily out of high school and military and with that then a skew toward later in the year given the timing of ramping those admissions resources as well as just when those students would start their programs. So there's just a number of factors in the first part of the year that will weigh us down on the UTI business and then reverse as we get into the fourth quarter and into â\u0080\u009824, which to the latter part of your question is then the momentum that we carry into â\u0080\u009824 with both the base business, as well as with the growth initiatives in the full year of Concorde, which give us confidence in the $700 million and approaching $100 million in â\u0080\u009824."
}