{
    "symbol": "SKIN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 14:43:04",
    "content": " For the full year, our planned strategic investments, paired with continued consumer and provider demand, drove strong sales growth of 41% year-over-year to $365.9 million. As you can see, despite the negative impact of China's shutdown and foreign exchange headwinds, we have seen sequential net sales growth throughout the year when excluding the significant trade-up sales from the Syndeo launch during the second quarter. For the full year, we achieved net sales of $365.9 million, up 41% year-over-year or up 32% year-over-year when excluding the Q2 trade-up sales from Syndeo's U.S. launch. These margins declined year-over-year on a GAAP and adjusted basis driven by trade-up mix, costs associated with Syndeo's U.S. launch and international launch readiness, including trade-up volumes and premiums paid on accelerated manufacturing and shipping, global supply chain challenges, inflationary pressures and foreign exchange headwinds. With continued momentum in delivery system sales, the international launch of Syndeo in the second quarter and resilient consumer demand around the world, we estimate to deliver net sales of $450 million to $470 million for 2023 or 23% to 28% growth versus 2022. When you look at Q1 being the lowest quarter of the year and the fact that we're launching globally Syndeo in Q2, I think -- and with all the investment we're going to be making on marketing to support the growth, all of which will speak to the higher investment for the first half of the year. And of course, if the rebound in China is more accelerated than originally anticipated in the second half of the year, as Liyuan stated earlier, that's when we'd be looking at more of the 20% higher range of our adjusted EBITDA guidance for 2023. I think we have an exciting year ahead with Syndeo's Q2 international launch, differentiated partnerships to drive consumable sales and recruit new consumers to the brand, China's reopening and the integration of SkinStylus."
}