{
    "symbol": "SKIN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 18:45:28",
    "content": "  Operator: Good morning, and welcome to Beauty Health Corp.'s 2022 Earnings Call. Iâ\u0080\u0099d like to turn the call over to Mr. Eduardo Rodriguez, Senior Director of M&A and Investor Relations. Thank you for joining The Beauty Health Company's conference call to discuss the company's second quarter 2022 financial results, which were released this morning and can be found on our website at beautyhealth.com. With me on the call today are Beauty Health's President and Chief Executive Officer, Andrew Stanleick; and Chief Financial Officer, Liyuan Woo. Before we get started, I would like to remind you of the company's safe harbor language. Management may make forward-looking statements, including guidance and underlying assumptions. For a further discussion of risks related to our business, see our filings with the SEC. This call will contain non-GAAP financial measures, such as adjusted gross margin and adjusted EBITDA. I will now turn the call over to Andrew Stanleick, President and Chief Executive Officer of The Beauty Health Company. Good morning, everyone, and thank you for joining our second quarter earnings call. As the founder of Bluemercury, Marla brings invaluable beauty industry, D2C and retail experience to our Board and her positive impact is already felt. Since becoming the CEO six months ago, I've had the privilege of working with and meeting hundreds of you on my travels. With that, I am pleased to announce that we achieved a record breaking quarter, reaching sales above $100 million in a single quarter for the first time ever. You will see in our results that Beauty Health is firing on all cylinders with outstanding momentum across the business and a growing enthusiasm from our community for our efficacious patent-protected Hydrafacial technology, which is fueling our growth. With our compelling competitive advantages, we believe we are just getting started on our growth journey. Turning to slide 5; we posted record high net sales of $103.5 million, representing nearly 56% growth year-on-year. We also delivered a strong adjusted EBITDA of $12.6 million, up nearly 11% year-over-year. Our sales growth is both impressive and accelerating, driven by record Hydrafacial system sales. We accelerated momentum in Q2 with total Hydrafacial delivery system sales growth of 85.4% year-over-year, setting another record of 2,738 total delivery systems sold. As part of this, the Syndeo rollout in the U.S. has been a tremendous success with 2,265 Syndeo's placed since launch in March. We are also seeing that consumer interest in Hydrafacial has never been higher, and I will come on to the growing momentum we are seeing here shortly. We are breaking records across our business, and the outlook has never been better. Based upon our performance and ongoing momentum, I am pleased to raise our 2022 net sales guidance to a range of $340 million to $350 million, and I reaffirm our $50 million adjusted EBITDA outlook, a growth of 53% versus 2021. In the Americas, we achieved growth of 76.6%, fueled by the launch of Syndeo. Having visited with hundreds of providers and consumers across the U.S., there is an incredible enthusiasm for our new Syndeo delivery system, and we see it in our results. In line with our omni-channel approach to reach consumers where they live, work and play, we are also rapidly expanding into new channels, including retail. We have just announced a permanent Hydrafacial presence at the iconic Galeries Lafayette Flagship on Boulevard Haussmann in Paris in partnership with Innerskin, who will be the exclusive aesthetic clinic provider in their state-of-the-art wellness gallery set to open in September. Turning to APAC, the region is dynamic and unsurprisingly, persistent COVID lockdowns in China impacted our results. APAC net sales declined 16.5%, partially offset by continued strength outside of China, especially in Australia. Liyuan and I recently had the privilege to visit our teams and providers across the APAC region, and the trip reinforced our belief in the large and untapped reservoir of growth that exists in APAC over the long-term. Looking ahead, the success we are seeing across the business and our growing momentum reinforce our confidence in the future. We are at the nexus of a thriving market for beauty and health, pair this with a resilient upper middle-class consumer with a high affinity for beauty, and we have a powerful flywheel that gives us the conviction to continue reinvesting in growth for the future. Turning to slide 7, we continue to make strong progress against our 5-point master plan, and I will share an update on each point. First, we remain focused on placing new systems. And on slide 8, you can see some of the feedback we have received. This is a first of its kind digital experience in Beauty Health, and the buzz in the U.S. is creating growing excitement abroad. Internationally, we plan to launch Syndeo in early 2023. In the meantime, we continue our remarkable expansion across existing and new channels in these important regions via our Elite system. Second, we continue to invest in our providers. This highly engaged community of providers and estheticians, the Hydrafacial nation are our most powerful advocates. Providers who go through our training become our most loyal, engaged and enthusiastic brand evangelists. One example of our investment in providers is EstiPalooza, an event we created to educate and celebrate our wonderful Hydrafacial community. On slide 11, you will see examples of other investments we have made in our providers. We featured Hydrafacial at high-profile tradeshows in every region and have taken Hydrafacial on the road with our GLOWvolution tour, which we extended to Europe this year. Third, we continue to invest in initiatives to drive brand awareness. We have a best-in-class product that is loved by those who try it, and we made significant strides this quarter to expand our funnel by our investments in digital media, partnerships with influencers and key opinion leaders such as Dr. Paul Nassif and the expanded GLOWvolution tour. As you see on slide 12, more consumers are seeking information about Hydrafacial, with Google Search activity reaching an all-time high in Q2, up 30% year-over-year. As we look ahead to Q4, we will launch an incredible Hydrafacial booster partnership with JLo Beauty by Jennifer Lopez. We are excited about the positive impact this will have on brand awareness, given the strength of JLo's global community of loyal fans. As you know, late last year, we beta tested an at-home device called Glow & Go. Through this test, we gained valuable insights that validated our belief in the potential opportunity of a take-home product from Hydrafacial. In the meantime, we remain laser-focused on continuing the successful global rollout of Syndeo. As a reminder, revenue from Glow & Go was never part of our 2022 guidance. The international integration of our ERP system is on track to be completed by the end of 2022, and our global efforts in hiring talent, network automation and brand building are well underway. Looking forward, we see a great opportunity in front of us to use M&A in a strategic and disciplined manner. During the quarter, we invested $2 million in , an early-stage technology advanced personalized skin care company. As you know, we continue to be prudent in our approach and remain focused on digestible, accreted, differentiated products that leverage our unique community. Before I turn it to Liyuan, I want to reiterate how incredibly proud I am of what our team have achieved in the first half of the year. We attract a resilient, highly desirable consumer and continue to see strong demand. The enthusiasm of our team is electrifying, and we are eager to sustain our profitable hyper growth trajectory. Thank you, Andrew, and thank you, everyone, for joining the call. To reiterate Andrew's comments, I'd like to thank our dedicated employees and partners around the globe for delivering our best quarter ever. Over the past few months, Andrew and I traveled throughout the U.S. and APAC, meeting our teams and providers, I could not be more stoked about the passion and excitement shared amongst our community. Today, I'll walk you through our second quarter results, catch on our balance sheet and discuss our full year guidance in a bit more detail. Turning to our net sales results on slide 16; we delivered record second quarter net sales of $103.5 million, up 55.7% year-over-year despite softness in APAC from the COVID lockdowns in China. On the left, you will see Delivery Systems sales growth was 85.4% year-over-year. We shipped 2,738 systems, of which 1,203 were trade-ups, accounting for approximately $23.3 million in incremental net sales this quarter. Excluding the net sales generated from trade-up, Delivery Systems growth was 21.5% year-over-year, a testament to the continued demand for our products. As a reminder, we include an initial 2- to 3-month supply of consumables with each new system sold and with each Syndeo trade-up sold. This contributes to a lag in the pull-through of consumables revenue, a trend we expect to continue as we rapidly expand our install base and launched Syndeo internationally in early 2023. Moving to the regional performance on the right; Americas net sales grew 76.6% year-over-year or 22% excluding trade-ups, driven by the outstanding performance of new Syndeo placements. In EMEA, we saw sales growth of 56% year-over-year, driven by high conversion on our marketing activations in the region. The results are a validation of our test and learn approach, where we experiment with driving consumer demand in various ways, including targeted tradeshows, hosting experience center events and driving retail-related activations. As a result of the COVID lockdowns in China, net sales in APAC declined 16.5%. Despite this, we remain confident in our view on the APAC market opportunities even more so after the productive and inspiring visits we had to the region. Our original guidance anticipated lockdown in China in the first half of this year, and our guidance models are gradually opening in the second half. We ended the quarter with an install base of 22,929 delivery systems. As a reminder, trade-ups have a net zero impact on our install base as an existing system is removed from our installed base when the new trade-up system is sold. Lastly, the average selling price or ASP of a delivery system in the quarter was $23,543. With the impact of the enticing promotions associated with Syndeo's launch behind us, we expect to see sequential improvement in ASP for the balance of the year. As a reminder, we guided to a high single-digit blended ASP increase for 2022, incorporating both trade-up and the Syndeo rollout in the U.S. Moving to slide 17, we reported a GAAP gross margin of 69.2% or 72.3% on an adjusted basis. Gross margin came in above our expectations due to the incredible strong demand from providers for delivery systems, creating fixed cost leverage from higher sales volume. With the most enticing of our promotions having expired at the end of March and associate units shipped, we expect trade-up volume to moderate in the second half of the year. During the quarter, we delivered adjusted EBITDA of $12.6 million. For the balance of the year, we expect our adjusted EBITDA to ramp up significantly, consistent with historical seasonality as we see the pull-through from our first half marketing spend and capitalize on the global demand. As we have stated repeatedly, we reserve the right to continue reinvesting our upside as growth accelerates in order to set the business up for long-term success. These investments in our golden triangle of sales, marketing and training, driving engagement, build loyalty and expand our community, all of which are key ingredients to sustain long-term growth. Selling and marketing expenses in the second quarter were $44.9 million compared to $26.2 million for the second quarter last year, primarily driven by increases in planned marketing programs, personnel-related expenses and sales commissions associated with higher revenues. Breaking this down, selling and marketing increased to 43.3% of sales, up by 393 basis points compared to the second quarter of 2021 or down 495 basis points compared to the first quarter of 2022. The year-over-year percentage increase was driven by increased spend in marketing, invest in our training program and personnel-related expenses, including commissions. Touching on R&D, we invested $2.6 million in the second quarter compared to $3 million in the prior year, which reflects the wind down of Syndeo related R&D consulting costs, partially offset by investments in data and technology personnel. We also continue to carry $750 million of 1.25% convertible notes on the balance sheet, which we opportunistically raised for M&A among other uses. Finally, our current shares outstanding are approximately $151 million. Turning now to our full year outlook on slide 20; as Andrew detailed, we raised our guidance for net sales to a range of $340 million to $350 million, up from our previous guidance of $330 million to $340 million. Moving to the right, we reaffirm our 2022 adjusted EBITDA guidance of $50 million. As Andrew already mentioned, a vast market opportunity and favorable dynamics support our investment to cement our leadership position in the rapid growing Beauty Health category. In conclusion, we are proud of our performance in the first half of the year and pleased with the position we're in to achieve our goals as we enter the second half. So obviously, another quarter raising the revenue guide and then reiterating the adjusted EBITDA guide. Yeah, as we've previously stated, we're a young company with a large white space ahead of us. So with the Board, we've put in a business plan that we are successfully delivering against that balances growth with . So in 2022, we're continuing to invest in the business to drive that growth and demand around the world. And I would also remind you that we're delivering $50 million EBITDA, which is a growth of over 50% more than last year. So I acknowledge it's important to grow EBITDA, and we're on track to do that. But look, we aren't just investing for growth here. So 2022 is our final year of elevated investment, and we will then focus on driving EBITDA margins towards historical levels in 2023 and beyond. As we said in the recorded notes, weâ\u0080\u0099re really thrilled with the launch of Syndeo in the U.S., and it was co-invented with our providers in mind and you saw their feedback on page 8 of the deck, which has been very consistent with what weâ\u0080\u0099re hearing. I mean, itâ\u0080\u0099s a leap forward in technology and some of the feedback weâ\u0080\u0099re getting, which gives us confidence. So the global launch is â\u0080\u0093 the data connectivity, the improvements in user interface, the touchscreen technology, the LightStim LED, etcetera, all really big leap forwards, which the â\u0080\u0093 weâ\u0080\u0099re getting really good feedback on. Itâ\u0080\u0099s obviously early days with the 2,000 Syndeo plus systems placed. And of course, just like any IoT product, weâ\u0080\u0099ll continue to improve the software and app experience as we learn and grow together with our business partners but very excited to launch internationally in the early part of 2023. Liyuan, if you could just talk a little bit about your comments on the delivery system ASP. And then Andrew, my bigger picture question is for you related to marketing strategy. So I'll let Liyuan kick off, then I'll handle the second part of that question. So in terms of the ASP, all along what we have mentioned is obviously giving the actual sticker price for Syndeo. As we roll out in the U.S., we're no longer selling other systems such as Elite. So as a result, all the new units should automatically have a higher ASP. What we've been really stating is the fact that given the amount of trade-ups, right, the most significant promotions ended in March, and we'll continue to sell trade-up and we reserve the right to promote as we see appropriate as we test and learn going forward. So when we take the entire year, this is to try to reinforce the guidance from the beginning. We believe on a blended basis compared to last year, the ASPs to be increasing by high single digits. And then on the second part of the question, yes, it was six months in the role yesterday, Steph. I think as I've articulated before, our biggest opportunity for Hydrafacial is to build our brand awareness. I shared last quarter that we recently tested it, aided awareness, 9%; unaided is 2%. So we're really set on the best kept secret in beauty knowing that we have such a high NPS score at 44, which has been increasing. And with that, we've been tweaking and amending our marketing strategy since I've been on board. We've obviously approached it as this pyramid approach to building a brand where we're really leaning in on those doctors, physicians, key opinion leaders at the top. We've really refined our search, our paid social to really get that ticking well. And finally, we've been working very closely with our aestheticians and other influencers to really amplify our branding. And hopefully, if you follow our chain, you've seen it really leap forward in the quality and the amount of our content with this content factory, which we have created in-house, which is driving out fabulous content every day. And it's complemented by so much free earned media, which we get posted every day from our highly engaged community of aestheticians and providers, the Hydrafacial nation, as I always refer to it, who are such powerful advocates of the brand. And then finally, we're still doing the on-ground activations, the GLOWvolution tour, we just finished a really successful tour of the U.S. We also extended it to Europe for the first time this year. So we're still doing the on-the-ground events, but I think the big pivot is balancing that with broad-reach digital marketing. It's our approach, test and learn and pivot with the data on ROA, which we received. So from a seasonality point of view, all the big event happened already in the first half of the year. So this is another reason why we feel really comfortable, especially given all the ROI where weâ\u0080\u0099re going to land for the second half of the year. Andrew and Liyuan, congrats on a great quarter. As we think ahead, your guidance includes that gradual reopening of China. And then Andrew, longer term, marketing as a percentage of sales, there's a huge awareness opportunity. So look, I will kick off, hand over to Liyuan and maybe finish off with the last question. As to China, Oliver, as we've discussed before, we had a gradual opening in China built into our guidance. That's where we obviously feel confident reiterating our commitment to our $50 million EBITDA, and we've raised our net revenue. Saying that we're just so thrilled with the results, which we have been seeing outside of China and outside of the lockdown cities within China across the APAC, especially in Australia. And I think Liyuan and I just returned from an extended trip of APAC, excluding China. I think we just returned with such a huge optimism of the future, and we see what a large sort of untapped reservoir growth this region is for our business in the future. Because we keep on talking about you have to hire the sales team, the marketing and training. So from an investment point of view, it's always going to be ahead a bit. And followed by that, we feel very strong in terms of the reception outside of the  area. But as Andrew had mentioned, it's hard to predict. One, we continue to buy ahead and really manage the cost under our own control. Two, we've been sharing with you with the network optimization play we've been having, not only setting up a 3PL in Europe, but also trying to figure out secondary manufacturing in China. This is why we see potential margin upside beginning in Q4, and that would really work towards the next year as well. To your last point on the marketing; so historically, when this company was private, which was not so long ago, by the way, they spent less than 5% on marketing. I think last year, we finished at 10% this year, we're tracking for 12%. And as for next year, I think, look, it will continue to review and look at that. It's not a very, very high media model. We invest through that important golden triangle of sales, marketing and education, as you know, is a business driver. So as we scale, we'll be looking at the ROIs on our investment very carefully to ensure that we're balancing our need to drive awareness, but also ensuring that we're delivering continued levels of profitability. But I think also the way we're refining our plans, that balance now we have between on-ground events, which deliver high ROI, but they are expensive with more broader reach activity has really helped us. And a good example of this year is the U.S. We cut down from 10 stops on the GLOWvolution to five this year, but that should not be seen as a negative because one of the reasons we did that is that we've opened a network of education centers around the world. So if you have a fantastic experience center, and I think you've been to the one in New York, clearly, you don't need to bring the GLOWvolution tour. So in terms of M&A, weâ\u0080\u0099ve been â\u0080\u0093 we believe that M&A will be an important component of the future. Weâ\u0080\u0099re actively looking, but weâ\u0080\u0099re going to wait to find the right opportunity, which is best for the company and our shareholders. In the meantime, weâ\u0080\u0099re laser-focused on delivering our commitments and obviously globalizing the successful launch of Syndeo. In terms of Glow & Go, look, we did a beta test with a limited range of consumers to get better. But with all the learnings, which weâ\u0080\u0099ve now had from Syndeo in terms of its beautiful, itâ\u0080\u0099s connected and it gives a great user experience. We want to take all the insights from the test and ensure what we launch in the future as new, better and different. So I wouldnâ\u0080\u0099t include in any model for the moment, and we will obviously update the market in future. At the moment, of course, weâ\u0080\u0099re laser-focused on really globalizing the Syndeo. Because you maintained your EBITDA outlook, obviously, a maintenance of profit on higher sales would suggest more spending or less leverage. Yes, it's a great point. This is why we've been emphasizing from a seasonality point of view, whatever we invest in Q1, Q2 really benefit for the rest of the year. So suffice to say there's always digital marketing plan and other type of marketing, but you wouldn't see the outsized marketing activation as you witnessed in Q1 and Q2. To my point, Olivia, just to sort of really reinforce this point. It's not -- we're investing not just for growth, but as I said, building this moat around the business. And it's like -- as I said, it's like that Monopoly analogy, you need to own the properties to collect the rent. That's why we invested in the first half, and we're securing that leverage in the second half as we obviously continue the rollout of Syndeo. So if you think about what we had mentioned, given this is a new launch, we provided training kits, usually itâ\u0080\u0099s two to three monthsâ\u0080\u0099 worth of free consumables essentially for all the trade-up and the new system sales. And usually it depends on, as we mentioned previously, 12% of our customers actually buy trade-up systems. If you just sit back and look at the lag, usually, itâ\u0080\u0099s between one to two quarter of lag before they really speed up. Itâ\u0080\u0099s really based on is that one system is a multisystem, how long theyâ\u0080\u0099ve owned it, what sphere of customer they are. So in that thing, thereâ\u0080\u0099s always a ramp-up when it comes to consumables, and weâ\u0080\u0099re trying to track utilization accordingly. Obviously, you've been doing really well in the first half of the year and utilization looks to be trending pretty well. We obviously sit on this fabulous intersection of wellness, aesthetics, beauty and skin care. We've seen absolutely no slowdown in appetite for our category, for Hydrafacial, and demand remains very strong. And historically, that's proven time and again be it the lipstick index or the strength of skin care or aesthetics during periods of recession, etcetera. When we look back at our own data when we're a private company for the Global Financial Crisis of '09, we still continue to grow because of twofold. First, consumers, just like they were lipstick continue to prioritize spending in items which make them feel good. We're all on Zoom more often these days, hybrid working. Secondly, as we've talked before, really, the secret of our business model is Hydrafacial is a gateway service. So even the GFC, we saw a trade down of consumers come in, they perhaps not doing more invasive expensive surgeries or fillers, but they still want to invest in themselves to make them feel good, make them confident. And Korinne, the only thing Iâ\u0080\u0099ll add, when we look at our guidance for the second half of the year, we take into consideration of the COVID impact in China in addition to that, believe it or not, talking to folks even in the U.S., the only cancellation we would be hearing are related to COVID. But absolutely, we feel really good in terms of consumables. Because we are still building that whole infrastructure and network optimization, you continue to kind of spend and scale for the future. But absolutely, in the meanwhile, we're searching for kind of the accretion side of the equation. So we feel very strong in terms of that sequential improvement when it comes to gross margin, which would contribute. As we always say, if the market environment improves, especially in China and other markets and if we generate additional revenue, we will continue to invest back into the business, but we have pretty strong lever in terms of control for G&A. Think about as almost 50-50 split, roughly speaking, between fixed versus variable and there's various levers we can pull when it comes to the variable side of the equation, especially when it comes to marketing, as we emphasize a lot of the heavy lifting has been done in the beginning of the year, we can certainly pull the lever there. And in terms of some of the other infrastructure build, the onetime items, some of them are coming to finish. But Andrew, just any reason to think about the international ramp for Syndeo being different than what you've experienced here in the U.S., better or worse? I guess where I'm going with this is, the demand here in the U.S. was through the roof. Absolutely, I will say that thereâ\u0080\u0099s a really growing excitement outside of the U.S. about Syndeo. Clearly, a big part of our model is that we have a playbook, which is very successful in the U.S., which we look to roll out globally in the New Year. What we do have, as you know, weâ\u0080\u0099ve discussed before together, is global pricing, we like to control the pricing internally. So no, we feel very good about the plan and looking forward to rolling out in Q1 of â\u0080\u009823. So relative to kind of where The Street was at heading into the print, it looks like you came in above by roughly $20 million on the top line, largely driven by your delivery system strength. But when I look at the guide, you only raised it by around $10 million on the top and bottom. So back to Jonâ\u0080\u0099s point earlier, weâ\u0080\u0099re really controlling the pricing. So in that vein, we will continue to sell trade-up, but you will see from a trend point of view, that should be moderate because weâ\u0080\u0099re not really launching international to the earlier point till beginning of next year. So Allen, with that said, we should be really seeing the momentum building based on the new sales and especially given whatâ\u0080\u0099s going on with the gradual opening in China, and itâ\u0080\u0099s kind of hard to see, right, in terms of how the lockdown will continue to evolve. So in that vein, weâ\u0080\u0099re being very thoughtful in terms of providing our guidance. And we reemphasize as weâ\u0080\u0099re selling a lot of these new Syndeoâ\u0080\u0099s and the trade-ups, we keep on giving free consumables as well. And just like every other quarter, we emphasize, if we do sell more, obviously, we will continue to build the business and inform the market as we see â\u0080\u0094we have more clarity. We're extremely thrilled with the success in Europe, plus 56% for the quarter and really continued momentum in demand. You've seen us showing up if you follow us, the tradeshows, events, influence events, you can see that payback coming through, which really talks to our investment and then getting leverage later. We have the GLOWvolution tour now, which we've extended to Europe for the first time, making its way around Europe and obviously, complemented by the Jennifer Lopez, JLo launch, which is a global launch from Q4, which will also help amplify. Of course, if things accelerate and China opens up, we'll obviously upgrade now. So if you think about, we have over 20,000 systems out there, but our biggest customer is less than 3% of our revenue. But usually, it doesn't really necessarily move the needle. Weâ\u0080\u0099re likely not going to go through a hedging program from an accounting treatment point of view because those are very complex, but weâ\u0080\u0099re constantly working on operational hedging just to make sure we have enough currency purchase, both in APAC and in EMEA to make sure from a real cash, not necessarily unrealized in this point of view to preserve our right and manage our hedging and currency. So look, I just wanted to see if you could comment a little bit more. I realize today was early days, and it's only plus or minus 2,000 units, but just the overall interaction that you're seeing with respect to the connectivity of Syndeo relative to what you're seeing on the consumer-facing apps. And then secondarily, just following your social over the course of the last several months, we've seen a big focus maybe outside the face, including , the decolletage, I think you're treating other body parts as well. Thanks for joining the call and I'll start with the second part of your question, which you're absolutely right. Look, I think what is the beauty of our system is that for a provider, an aesthetician, the revenue stream is just more about the pace. And I think I've been really intentional with the team since I joined that where there's so many bigger parts of the body, which we can utilize the service on, which bigger surface space means bigger consumables. HydraBeauty and legs has been a big thing this summer, if you've been following us. And we put training and protocols in place and who knows other boosters activity, which could be coming down the line in the future, which we'll come and talk about in a later stage so very excited about that area. In terms of Syndeo and data connectivity, our first phase of this, as we talked last quarter, is really getting the systems out, and we've placed over those 2,000 Syndeo. With that learning, which we're getting in real-time providers in that data, which we're beginning to collect, that's going to help us renew and re-launch the app to give a better user experience in the near future. And I will say at the moment, we'll look forward, I think, in a quarter or two and sharing a lot more data of what we're learning. The reason we're not sharing now, there's a lot of bias in it, you can imagine the first couple of thousand providers have bought it. So let's just even out the kinks, and we'll come back and share some of the great and powerful learnings we're getting, which will help us really unlock future growth for our business in the future. It's just obviously, really strong demand for Syndeo. I think obviously, we've launched at this stage only in the U.S. only. I mean, I think our largest providers all across the U.S., every state we had a look at actually before the call. There's nothing like it, anything really in the Spa and facial. With EMEA and APAC, thereâ\u0080\u0099s no slowdown in terms of buying the Elite System either. Thatâ\u0080\u0099s why we feel very confident to really roll it out at the most optimal timing, which is the beginning of next year. Retailers, as you say, small but really rapidly growing. Obviously, we just announced today our partnership in Europe with Galeries Lafayette, which weâ\u0080\u0099re super excited about to continue to expand our retail. Weâ\u0080\u0099ve got partnership with luxury hotels, gyms, which if you follow, youâ\u0080\u0099ve seen really growing over the last quarter. I think what we will say about retailers, we donâ\u0080\u0099t break out in detail is that certainly, if we speak for North America with our biggest presence in Europe, biggest presence is across Ulta, Nordstrom and Sephora. And I think, of course, now with the opening, weâ\u0080\u0099ve seen consumers come back in the store. And of course, Hydrafacial is really the only skin care experience on the floor in so many of these retailers. So of course, theyâ\u0080\u0099re getting makeovers and getting blowouts of hair and weâ\u0080\u0099re the skin service provider in this space. You previously anchored us to 3,500 to 4,000 systems annually. '21 sale, over 6,000 systems this year, 7,000, 8,000, even if you look on a net basis, we're still well above that 3,500 to 4,000. I think the context we were giving when we were talking about the 3,500 to 4,000, is much more historical. As you recall, itâ\u0080\u0099s a very U.S.-centric business, right? And as we continue to grow, we kind of have to take that into consideration. The way as a company, as we look at the trend, we are very much focused on new system sales as a trend, which weâ\u0080\u0099ve been disclosing to you on a quarterly basis. In closing, I will say, we are ecstatic about our results and are as confident as ever about the future of our business. Beauty Health exists in that bright space where beauty, aesthetics, wellness and health converge. This is a space post-COVID, which is growing rapidly and adding new devoted consumers by the day. The Beauty Health category has proven its resiliency time and time again and our upper middle-class consumer who is generally less impacted by economic downturns, reinforces the conviction we have in achieving our outlook. The time to play offense is now, and we expect our investments this year in sales, marketing and training to strengthen our community and propel future growth while still delivering an implied 2022 EBITDA growth of 53% growth year-over-year. And I'm eager to share more of our vision and detail about our long-term growth ambition during Investor Day on September 15, and I look forward to seeing many of you there."
}