{
    "symbol": "SKIN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 13:17:06",
    "content": " Even against this complex macro backdrop, we saw positive momentum in both delivery system and consumable sales, producing net sales of $88.8 million, up 30% year-over-year, one of our strongest quarters on record. EMEA grew 21% year-over-year, despite a meaningfully strengthening dollar, which negatively impacted our topline by approximately $3 million and roughly $2 million of loss opportunity in Russia compared to last year's third quarter. Breaking down the OpEx items, selling and marketing expenses in the third quarter were $39.8 million compared to $30.5 million in the quarter last year, primarily driven by sales commissions associated with higher revenue, increasing planned marketing program, and a net increase in personnel-related expenses. First one, just a little detail, but I think I heard Andrew or Liyuan, you call out FX impact of $8 million on the topline, is there just an EBITDA number you can give us, I don't know, $2 million, $3 million, it seems like we're getting caught up on $2 million, $3 million in EBITDA. And I think it's important to know our revised EBITDA guidance does not reflect a demand or profitability problem, rather guidance reflects just this potential of temporary macro pressures, blunting our operating leverage, and as we said, we remain really cautiously optimistic about our ability See to achieve $50 million EBITDA guidance this year. But when we really think about the underlying consumer will pull through, I think there is an understanding now that there is a bit of a delay, especially with Syndeo, where you offer a free quarter or so of consumables along with the initial sale, but even stripping out, some of the strong Syndeo sales you've had so far this year, it does put the consumables are lagging a little bit behind expectations, you highlighted that you're continuing to see, strong demand from the end consumer."
}