{
    "symbol": "SKIN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 17:35:19",
    "content": " In the Americas region, first quarter sales increased approximately 43% year-over-year to USD 44.6 million, due to SYNDEO and strong sales productivity driven by conversion of marketing-driven leads. As Andrew detailed, we are raising our guidance for net sales to a range of USD 330 million to USD 340 million, up from our previous guide for USD 320 million to USD 330 million, driven by the early success of SYNDEO and continued strong demand for systems around the world. So, as I stated earlier, we intentionally and planned the launch in mid-March to encourage as many of our providers to get on the SYNDEO system, especially those and we've talked before about who've recently purchased the elite system, but, of course, our ultimate goal is to get everyone on SYNDEO because it's data and consumer knowledge will ultimately drive further growth. So from a margin's point of view, as we alluded to at the prepare remarks, Oliver, essentially we anticipate ASP and gross margin impact in the second quarter because that's really when you capture the big trade-up volume and then we anticipate to see that margin start to come back up in the second half and that actually goes hand-in-hand with all of these network, kind of optimization work we've been doing, and we haven't even started when it comes to value engineering since this is a brand new machine and we actually bought quite a bit up front for the components. We actually had a tremendous start to January and February by existing system sales, new doors and consumables globally before we even launched SYNDEO in the U.S. And I think it's just a testament to the strong demand for the HydraFacial and the fact that consumers are still choosing to invest in their health care and skin care and ultimately confident. It sounds like there's a little bit of flex on when the international launch of SYNDEO might really start, so when we think about the guidance range that you have today and the fact that we saw that in only one partial quarter, you were able to generate so much interest and trade-up volumes of SYNDEO. I think what really struck us though was the chains where we expected them to buy one or two new SYNDEO, but I think this really interesting facts when they decide they want to do the entire fleet all at the same time, so they have an identical fleet and I think that's what drove enormous upside during March as they took advantage of that trade-up, which was really fantastic to see because we're very keen to get everyone on SYNDEO as fast as possible, so we can really unlock the power of that data and really having that direct access to the consumer. Yes, John just to reiterate, I would say two-folds, one utilization is absolutely key area of focus and to your point, we're actually doing a lot of training element to really speaking with our -- with the customer, but obviously we're just launching and the fact that we had a lot of trade-ups happening, suffice to say, there's a lot of effort on our end the field is going to continue to really feel that and educating along the way with our customers. Really, we see just with the robust trends we've seen in Q1 and into Q2, we want to keep that virtuous spiral going and just seeing, as with the deployment in the global until with the paid social, with the upcoming JLo event, we're very keen to ensure we have the right investment to really maximize those opportunities and keep that virtuous spiral of growth turning. Yes and Olivia, I just want to emphasize that's been planned all along because we are a hybrid growth company, so we've always wanted to make sure there's ample dollar to fuel the growth and there's no -- in the sense that we just want to reiterate the point, we're always going to be very thoughtful, but if that's going to drive further top line and speeding up our process to go forward, we will always allocate a dollar back to marketing and training in other areas to fuel future growth."
}