{
    "symbol": "WFCF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 15:03:05",
    "content": " During this call, we'll make forward-looking statements based on current expectations, estimates and projections that are subject to risk. Statements about current and future financial performance, growth strategy, customers, business opportunities, market acceptance of our products and services, and potential acquisitions are forward-looking statements. Listeners should not place undue reliance on these statements, as there are many factors that could cause actual results to differ materially from our forward-looking statements. Today, we'll also discuss adjusted EBITDA, a non-GAAP financial measure provided as a complement to GAAP results. Revenue in the first quarter growth, 39% to $6.2 million from $4.4 million in the first quarter last year. All three revenue categories contributed to that growth, including verification and certification services revenue was up 16% year-over-year to $3.8 million from $3.3 million. Product sales increased 39% to $1 million from $724,000. And software and related consulting services was up threefold to $1.4 million from $453,000. The increase in verification in certification services was primarily driven by strong demand for beef verifications, which historically dominate this category. Demand for U.S. beef and overseas markets, particularly China, remains very strong and drive steady growth and source and age verifications. Additionally, consumer demand in the U.S. for a host of other premium verifications we offer is resulting in more verifications per beef producer, which not only impacts revenue, but also generates higher margins by virtue of our audit bundling advantage. During the first quarter, we continue to see increased activity in pork, poultry, dairy and egg audits as producers who are forced to limit access to their operations due to COVID return to business as usual in terms of site access. We're also seeing continued strength in our, Where Food Comes From organic business, which continues to benefit from consumer preferences for organic certified products. Our CARE Certified Program, which covers beef, dairy, pork poultry, and now seafood, also continues to gain traction and notoriety as a market-leading sustainability solution. We were also pleased with the year-over-year growth in product sales in the first quarter, following a rare decline in that category in the fourth quarter of 2021. During Q1, our Postelsia business unit, which operates under the SureHarvest umbrella executed on a contract with the Japanese government trade entity to promote Japanese seafood in the United States. These additional costs pushed our COGs up by approximately $720,000 and significantly reduced our margins on the project. Overall, gross margins decline to 39% from 42%, but that's a little misleading due to the margin pressure, I just mentioned relative to the large Postelsia contract. It's important to note that margins in our verification and certification segment, which represent our core businesses, were up nicely year-over-year. SG&A expense in the quarter remain flat at $1.8 million, reflecting our focus on managing costs. The combination of higher revenue and a stable expense base resulted in a six-fold increase in operating income in the quarter to $623,000 from $89,000. Net income in the first quarter was $497,000 or $0.08 per share compared to net income of $1.15 million or $0.19 per share in Q1 last year. However, keep in mind that last year's $1.15 million profit included the benefit of a little over $1 million in PPP loan forgiveness. So on an apples-to-apples basis, excluding loan forgiveness, net income was up significantly in this year's first quarter. And finally, during the first quarter, the company bought back 33,550 shares of common stock that compares to buybacks totalling just under 81,000 for all of 2021. You may proceed with your question. It's called Yellowtail and it's been branded under  trade name, and it's a product that's produced primarily in Japan and the Japanese Export Association, it's a group called JETRO, was interested in introducing the product to high-level chefs across the United States. And I think really what – what chefs here are looking for from a sustainability and a traceability perspective, so all in all it was great JETRO and the Japanese Government were very pleased with the results and we anticipate doing more of these projects in the future. So it's – the drought continues to impact all of our beef supply chains and literally are making decisions daily about retention rates and how many of their calves and cows they're going to – they're going to be able to see through based on the reduced amount of feed that they've got. And we're – I think what we continue to see is verification being, being a benefit to producers even in this market that has a lot of volatility. So most of our producers are continuing to participate in the programs, I think what's a new factor that is pretty much across the board as we see – as we see all of our domestic retailers looking to incorporate some type of a sustainability claim. So that's probably a pretty long answer to it, it's having a fairly dramatic effect on our customers. But again because verification offers a premium to even, even the high priced commodity traditional programs, there's still a market for our producers to participate. Again, it's a product that's – that's fairly new and fairly – fairly exclusive to Japan, so they could want to continue to promote that. We also, in this quarter, we haven't – we haven't talked about it, but we've conducted our – well, I did mention a little bit. We have conducted our first fish care audit and that's, that was done on a domestic operation here in the United States in Idaho. And so we over the next several months we'll start to see some promotion of that and seafood's unique because it has so many different types and varieties that are included in seafood that range from shrimp to crab to lobster, but also into fish. So it could come from Japan, it could come from Yellowtail, but it could also come from something that's – that's more – more domestic, more aquaculture focused as well. I will make sure we get those to you, but we've continued to see a real good growth. You may proceed with your question. Yes, we – as I've said many times in the past, we're constantly looking at potential acquisitions and we've – 2021 was a great year. Ladies and gentlemen, we have reached the end of today's question-and-answer session."
}