{
    "symbol": "BLK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-15 13:05:21",
    "content": " Over the last 12 months, BlackRockâ\u0080\u0099s broad-based platform has generated over $460 billion of total net inflows, representing 5% organic base fee growth, providing a strong foundation to help immunize our base fees from the impact of double-digit market declines on our assets under management. Second quarter annualized organic base fee decay of 1% reflected client portfolio repositioning, favoring lower fee index and cash products and higher redemptions in active fixed income and equity mutual funds. Second quarter revenue of $4.5 billion was 6% lower year-over-year, primarily driven by the impact of significantly lower markets and dollar appreciation on average AUM and lower performance fees. Despite double-digit declines in equity and fixed income indexes year-over-year, second quarter base fee and securities lending revenue of $3.7 billion was down just 2% year-over-year. Our second quarter as-adjusted operating margin of 43.7% was down 320 basis points from a year ago, reflecting the immediate negative impact of markets and foreign exchange movements on quarterly revenue and the ongoing longer term strategic investments we have been making in technology and our people. BlackRockâ\u0080\u0099s second quarter net inflows of $90 billion, once again demonstrate the stability of our diversified platform to adapt to changing markets and client needs. BlackRockâ\u0080\u0099s second quarter ETF net inflows of $52 billion were positive across each of our product categories, core, strategic and precision representing 7% annualized organic asset growth. And another challenging quarter for fixed income markets, our bond ETFs once again delivered for clients and generated $31 billion of net inflows. BlackRockâ\u0080\u0099s institutional franchise generated $26 billion of net inflows as we continued to partner with institutional clients to deliver investment expertise, greater customization, industry leading risk management and the benefits of our global scale. Across institutional and retail clients, demand for alternatives continued with nearly $5 billion of net inflows across liquid and illiquid alternative strategies during the quarter driven by private credit, infrastructure and private equity. Finally, with cash becoming a more attractive asset class as rates rise, BlackRockâ\u0080\u0099s cash management platform generated $21 billion of net inflows in the second quarter, benefiting from the investments we have made to build this business in recent years. Our strategic investments over the years, including iShares, ETFs, private markets, active whole portfolio solutions at Aladdin, have allowed us to build a comprehensive platform to solve our clientsâ\u0080\u0099 needs across market environments. BlackRock manages nearly $475 billion in dedicated sustainable AUM on behalf of our clients, and we saw over $20 billion of net inflows across active index and cash management in the quarter."
}