{
    "symbol": "BLK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-13 12:23:09",
    "content": " Despite the most challenging market backdrop in decades, BlackRock generated industry-leading long-term net inflows of $248 billion during the first 9 months of 2022, demonstrating the strength and stability of our globally integrated multi-asset solutions-oriented platform. Over the last 12 months, BlackRockâ\u0080\u0099s broad-based platform has generated approximately $400 billion of total net inflows, representing positive organic base fee growth of 2%. During a tumultuous market environment, BlackRock generated third quarter long-term net inflows of $65 billion, representing approximately 3% annualized organic asset growth. However, total quarterly annualized organic base fee decay of 4% reflected outflows from higher fee precision ETFs, the continued impact of elevated redemptions in active equity and fixed income mutual funds and outflows in institutional money market funds. Quarterly technology services revenue increased 6% from a year ago, reflecting this increased demand, but also reflecting significant headwinds associated with the FX impact on Aladdinâ\u0080\u0099s non-dollar revenue and market declines on Aladdinâ\u0080\u0099s fixed income platform assets. Our third quarter as-adjusted operating margin of 42% was down 560 basis points from a year ago, reflecting the immediate negative impact of markets and foreign exchange movements on quarterly revenue and the ongoing longer term strategic investments we have been making in technology and our people. Third quarter ETF net inflows of $22 billion were led by surging demand for our bond ETFs partially offset by sentiment-driven outflows from commodities, broad emerging markets, exposures and small-cap equity precision ETFs. Institutional active net inflows of $71 billion were led by fixed income and multi-asset net inflows and included the impact of several previously announced significant outsourced CIO mandates, including the funding of approximately 45% of the AIG Corebridge fixed income assignment. Our cash management platform experienced net outflows of $40 billion, primarily driven by redemptions from U.S. government money market funds as reduced debt issuance in a higher rate environment, coupled with ongoing capital management and a general reduction in corporate cash levels, contributed to industry-wide institutional outflows. Even when much of the industry has experienced outflows, clients entrusted us with more than $248 billion in net new business in the first 9 months of 2022, including $65 billion in the third quarter. iShares bond ETFs generated $76 billion of net inflows in the first 9 months in 2022, even as a generational rise in inflation and tighter monetary policy resulted in sharp price declines in the bond markets. As investors seek additional sources of yield or uncorrelated returns amid this more challenging public market alpha, we raised $6 billion through commitments and net inflows in the third quarter and $23 million in the first 9 months of 2022. And as I noted earlier, in the third quarter alone, we had 40 â\u0080\u0093 excuse me, $84 billion in long-term net inflows awarded to BlackRock by U.S. clients. We saw $37 billion of net inflows into bond ETFs, which is the second best quarter we have had in history, and then an additional $1.5 billion into private credit and active fixed income inflows of where we have significant good performance for the long-term. But going into this year, our focus at a minimum will be on aggressive reallocation to a number of the areas that we have talked about, again, whether it would be private markets, ETFs, technology supporting whole portfolio solutions and making some tough calls in terms of how to make sure that we are balancing that organic growth in a way that benefits not only our clients, but also our employees and our shareholders."
}