{
    "symbol": "ALKS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 13:14:03",
    "content": " The launch of LYBALVI continued to perform well during the quarter and weâ\u0080\u0099re pleased to raise our financial expectations for the year based on this performance, and updated assumptions related to our royalties from sales of the long acting INVEGA products outside the United States. We generated total revenues of $276.2 million driven by strength in our proprietary commercial product portfolio, which increased net sales by approximately 19% year-over-year. Starting with VIVITROL, net sales in the second quarter were $96.1 million reflecting 9% growth year-over-year. Gross the net adjustments were 54.2% in the second quarter, and inventory levels decreased by approximately $2 million. LYBALVI net sales in the second quarter increased 44% sequentially to $20.1 million, driven primarily by demand growth. Overall, we're increasing our full year 2022 expectation for LYBALVI net sales from a range of $55 million to $75 million to a range of $75 million to $90 million. For the second quarter, cost of goods sold increased approximately $5 million year-over-year to $58.4 million driven primarily by higher volumes of key manufactured products. Turning to our balance sheet, we ended the second quarter in a strong financial position, with approximately $760 million in cash in total investments, and total debt outstanding of approximately $295 million, resulting in a positive net cash position of close to $465 million. For the top line, we now expect higher total revenues in the range of $1.05 billion to $1.12 billion, a net increase of $40 million at the midpoint due to improved expectations for the LYBALVI launch. In the second quarter, total product revenue from our proprietary commercial portfolio grew approximately 90% year-over-year to $190.8 million. Total prescriptions in the second quarter were approximately 17,000, representing growth of approximately 64% quarter-over-quarter, driven by LYBALVI's differentiated product profile and our commercial execution. Turning to ARISTADA, for the ARISTADA product family net sales in the second quarter increased to $74.6 million, driven primarily by TRX growth at 11% year-over-year on a month of therapy basis, outpacing the aLAI  market which grew 7% year-over-year. VIVITROL net sales in the second quarter increased approximately 9% year-over-year to $96.1 million, driven primarily by the alcohol dependence indication. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}