{
    "symbol": "ALKS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 11:46:10",
    "content": " Net sales in the fourth quarter were $79.2 million, driven primarily by TRx growth of approximately 7% year-over-year on a month of therapy basis. Now, turning to VIVITROL, in 2022, we recorded net sales of $379.5 million, up 10% year-over-year driven primarily by growth in the alcohol dependence indication. In the fourth quarter, VIVITROL achieved net sales of $102 million, reflecting 6% growth sequentially and 11% growth year-over-year. Royalties from sales of the long acting INVEGA products were $115.7 million, compared to $303.1 million in 2021. Ladies and gentlemen, thank you for standing by. Royalties from sales of the long acting INVEGA products were $115.7 million, compared to $303.1 million in 2021. So, our guidance for the year reflects continued expected growth of our proprietary products, focus on disciplined expense management, and investment in the strategic priorities that we believe will drive growth and value for shareholders, including continued progress with the launch of LYBALVI, advancement of our orexin 2 receptor agonist program in clinical studies, and separation of the oncology business. R&D expenses are expected to be in the range of $370 million to $400 million, driven by investments in the potential registration enabling studies for nemvaleukin, as well as the early clinical development for the orexin program, which is expected to yield initial proof of concept data in patients by the end of the year. Ladies and gentlemen, thank you for standing by. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}