{
    "symbol": "CRBG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 07:11:04",
    "content": " The breadth of our portfolio and the strength of our distribution partnerships helped us generate premiums and deposits of $3.8 billion in the fourth quarter contributing to $15.1 billion of new deposits over the course of 2022, with positive net flows of $2.4 billion, reflecting nearly 200% growth in net flows year-over-year. We delivered sales of more than $1.3 billion in each quarter of 2022, contributing to $5.7 billion in premiums and deposits for full year 2022, an 89% increase year-over-year. In Group Retirement, premiums and deposits were also strong at nearly $2.2 billion for the fourth quarter or approximately $8 billion for the full year, supported by new planned acquisitions and growth of out-of-plan deposits, in particular, in fixed annuities. For the full year, Blackstone executed approximately $8 billion of new transactions across a variety of asset classes, including private and structured credit at an average gross yield of just over 6.5% and an average credit quality of single A. We maintain a clear line of sight toward achieving an ROE of 12% to 14%, and we remain committed to delivering capital to our shareholders through a combination of $600 million in annual dividends along with share repurchases, resulting in a 60% to 65% payout ratio on adjusted after-tax operating income. Fourth quarter adjusted ROE was 10.6%, operating EPS was $0.88, and adjusted pretax operating income, or APTOI, was $639 million. Assets under management and administration was $357 billion as of December 31, up 3% sequentially, reflecting both market conditions and new business growth. Base spread income, which is our largest source of earnings, grew 25% compared to the fourth quarter of 2021 due to higher new money rates coupled with strong growth in our spread-based products. We expect that approximately $130 million will earn in, in 2023, with an offset from the full year earn-in effect from incremental costs that we picked up during 2022 to operate a standalone public company, which we estimate at $75 million to $100 million. Individual Retirement reported APTOI of $436 million, benefiting from strong growth in base spread income as well as overall lower expenses, partially offset by lower fee income. That being said, our surrender rate remains below our expectation and net inflows in the general account were quite strong at $740 million in the fourth quarter and over $4 billion for all of 2022. The second thing I would say is that kind of indicative of that is that despite the higher surrenders, because of the strength of the new business, we have had strong positive flows of $700 million in the fourth quarter, as Elias pointed out, and $4 billion in the full year."
}