{
    "symbol": "BSY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 10:19:05",
    "content": " This is particularly the case given that what we and I think you consider to be our key operating performance indicator, business performance year-over-year ARR growth rate is expressed in constant currency unaffected by ambient FX oscillations, which consternates comparisons to the outlook. Back in constant currency, the '22 Q3 business performance ARR growth rate year-over-year. But to better understand our '22 Q3 tone of business, I would like us to look more closely at this year-over-year business performance ARR growth rate compared to the same rate in 2022 Q2. We measure this KPI on a year-over-year basis because of intrinsic seasonality, due to the historical deliberately unequal distribution by quarter of contractual renewal dates of our annual subscriptions that would otherwise obscure sequential quarterly trends in ARR growth by always including all 4 calendar quarters to abstract from such seasonality, sequential changes in year-over-year business performance ARR growth rate are meant to signal real trends in the tone of business rather than other noise. Accordingly, although '22 Q3's year-over-year business performance, ARR growth reads nominally the same at 11.5% as '22 Q2. All considered, in light of the risk of more geopolitical disruptions, such as in '22 Q1, especially in China, as shown here and not including 2.5% from the PLS platform acquisition onboarding, we continue to reaffirm the range of our full year 2022 constant currency business performance, ARR growth outlook. Our constant currency ARR growth rate remained at 14% year-over-year, which is the combination of 11.5% from business performance and 2.5% from the onboarding of PLS in '22 Q1. Considering these factors, a nominally stable year-over-year constant currency ARR growth from business performance at 11.5% seems to reflect an uptick in tone of business fundamentals and gives us sufficient confidence above '22 Q4 to maintain the range of our full year constant currency ARR growth outlook."
}