{
    "symbol": "SEER",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 20:42:02",
    "content": " Earlier today, Seer released financial results for the quarter ended September 30th, 2022. If you've not received this news release or if you'd like to be added to the company's distribution list, please send an e-mail to investor@seer.bio. For a more complete list and description, please see the Risk Factors section of the company's quarterly report on Form 10-Q for the quarter ended September 30th, 2022, and in its other filings with the Securities and Exchange Commission. Except as required by law, Seer disclaims any intention or obligation to update or revise any financial projections or forward-looking statements, whether because of new information, future events or otherwise. I'm encouraged by the growing enthusiasm for the Proteograph Product Suite we across a variety of applications spanning discovery, translational, and clinical research. During the third quarter, our team continued to make important progress against our strategic plan and we ended the quarter with $4 million in revenue, and approximately $441 million of cash, cash equivalents, and investments on our balance sheets. Our technology will meaningfully enable researchers to undertake population scale studies that can uncover the complexity of the proteome, including the discovery and identification of previously unknown protein variants. To that end, key leaders in proteomics are calling for the establishment of the Human Proteoform Project, similar to the Human Genome Project, which was profoundly important in the transformation and acceleration of biological and medical research using genomics. Now, the gold standard for unbiased detector for proteomics is mass spec, and the only commercially available platform for deep unbiased sampling of proteins at scale is a Seer's Proteograph Product Suite. We expect Seer's platform will be a major enabler of initiatives, such as the Human Proteome Project, because of our ability to deeply interrogate the proteome in a scalable way, which provides an unmatched ability to discover and catalog novel content. As a reminder, our five key objectives are first, supporting customers to scale their use of the Proteograph Product Suite for projects of increasing size and scope. Fourth, expanding our partnerships to make it even easier for customers to adopt our technology, and fifth, driving a product roadmap to enable more applications. We're excited to see our more established customers ramping the use of our technology, with an increasing interest in larger studies, ranging from hundreds to thousands . As we've said previously, the Proteograph removes the barriers that previously constrained deep unbiased proteomic studies in complex sample types to fewer than 50 samples. Through our engagement with customers, and prospective customers, we're seeing significant interest in utilizing the Proteograph to explore a broad range of sample types, diseases, and organisms through studies of various scopes. With our growing installed base, our Centers of Excellence are COEs coming online and the addition of prospective customers to a sales pipeline, we have a line of sight to a growing number of larger studies. For example, Evotec has used the Proteograph to deeply interrogate the proteomic content of biological samples beyond plasma such as urine, cerebrospinal fluid, and condition media. Our technology is inherently species-agnostic in that it also enables researchers to use the Proteograph Product Suite on studies with model organisms and applications and other end markets, such as animal health. We're encouraged by the breadth of projects among our customers, and are excited to see multiple studies that were run earlier this year, moving closer to manuscript submission. We believe that as more third-party data enters the public domain over the coming months and years, the differentiated value proposition of the Proteograph Product Suite to provide novel insights into the proteome, and to enable the next generation of multi-omics studies will become more and more established. To that end, during the third quarter, we announced the publication of a groundbreaking study in advanced materials, demonstrating the power of engineered nano-bio interactions to enable deep access to the proteome. Over the past few months, we attended several conferences, where we continue to see a growing interest in the presentations from both Seer and our customers. Although this conference is traditionally more focused on genomics, we're involved in by the exceptional enthusiasm for potential customers who attended our posters, talks, and visited our booth. Researchers are excited about having unbiased access to the proteome, which enables them to discover novel protein variants and to deepen their multi-omics insights. To that end, we presented at the ASHG demonstrating the power of our Proteograph Analysis Suite to enable user-friendly data, visualization, and reproducible analysis of proteomic and genomic data at scale, including the identification and exploration of variant peptides. We also demonstrated how the Proteograph enables disease classification and biomarker characterization in the poster looking at 200 sample Alzheimer's cohort performed in approximately four weeks and generating data for over 5,000 proteins. Finally, in a study of non-small-cell lung cancer patients, we showed that peptide level resolution can reveal biologically important differences in the expression of distinct variants of the same protein as the protein isoform level. These presentations help demonstrate to researchers how the Proteograph Product Suite can enable high resolution proteogenomic by providing unbiased peptide level data at scale, in a timeframe not previously possible. We continue to pay attention to the evolving macroeconomic environment, particularly related to the uncertainty with respect to its impact on biopharma spending, constrained CapEx budget, staffing shortages, and limited customer access in certain markets such as China. To that end, we're making great progress hiring top talent to support our growing commercial efforts. Seer continues to attract leaders from across genomics, proteomics, and other leading omic companies. As a reminder, this is a multi-year collaboration that we established with Discovery Life Sciences  in which discovery will offer deep unbiased proteomics capabilities to the existing and new genomic services customers, with a goal to ramp to an annual capacity of over 100,000 samples. Finally, we're driving towards the next set of innovations to further extend the capabilities of the Proteograph Product Suite. Last quarter, we released our proteogenomic workflow or PAS 2.0, which makes high resolution proteogenomic and novel biological insights accessible with a click of a button. As we mentioned, we're extremely encouraged by the interest and reception received for our presentations on this topic at the recent ASHG Conference. At Seer, our overarching objective is to allow our customers to see deeper into the proteome by innovating across workflows in our instrument, assay, consumables, and data analysis software. Our data and software teams are continuously expanding our data tools, data management, and data analysis with an eye on enabling a broad range of labs to adopt the Proteograph. We're also paving the path into the future, as we expect to see studies experiences thousands and even tens of thousands of samples, by innovating how large datasets can be managed to enable population scale deep unbiased proteomic studies. Using these libraries, we're able to go up to 50% deeper into the proteome that we could previously reanalyzing prior studies and discovering more content. Our goal is to incorporate these libraries, as well as multiple tools for larger studies and data sets into our Proteograph Analysis Suite releases in 2023. Our customers continue to amaze us with the use of the Proteograph and to imagine what's possible in their proteomics studies, a testament to the value and power of our technology. I'm encouraged by the enthusiasm we're seeing across our current and prospective customer base, and I'm confident that we're well-positioned to capitalize on the large opportunities ahead. Total revenue for the third quarter of 2022 was $4 million, representing an increase of 84% compared to $2.2 million in the third quarter of 2021. Product revenue for the third quarter of 2022 was $3.9 million, including related party revenue of $1.3 million and consistent of sales of SP100 instruments, consumable kits, and platform evaluations. Since our SBIR grant from the NIH was renewed in the third quarter, we expect a resumption of revenue contributions from grant and research-related collaborations, beginning in the fourth quarter. Total gross profit was $1.9 million for the third quarter of 2022, representing a gross margin of 49%. Our gross margins improved sequentially as a result of higher consumable sales in the third quarter, particularly as our early customers begin to ramp. We will continue to see variability in our overall gross margin on a quarter-by-quarter basis, as a proportion of instrument and consumable sales will fluctuate between any given quarter. Total operating expenses for the third quarter of 2022 or $27 million, including $9.1 million of stock-based compensation, compared to $19.6 million, including $6.8 million of stock-based compensation in the third quarter of 2021. Research and development expenses for the third quarter of 2022 were $11.6 million, an increase of 49% compared to $7.7 million in the third quarter of 2021. The increase in R&D expenses was primarily due to an increase in product development efforts related to the Proteograph Product Suite, including $2.7 million in employee compensation costs and other related expenses, including stock-based compensation due to growth in research and development personnel, and an increase in expenses related to the build out of our facilities to support our R&D efforts. Selling, general, and administrative expenses for the third quarter of 2022 were $15.4 million, an increase of 30% compared to $11.9 million in the third quarter of 2021. The increase in SG&A expenses was primarily driven by $1.2 million increase in employee compensation and other related expenses, and a $1.1 million increase in stock-based compensation. We ended the quarter with approximately $441 million in cash, cash equivalents, and investments and continue to be disciplined about our level of spend and the rate of return that we will earn on our deployed capital. Turning to our outlook for the year, we continue to expect revenue to be in the range of $14 million to $16 million for 2022. As Omid said, we're paying close attention to the evolving macroeconomic environment, which we believe may impact the timing and the scope of customers purchasing decisions. Despite this environment, we are enthusiastic about the interest in our technology and expect for your revenues to be in the upper half of our guidance range. We made great strides this quarter and we continue to work closely with our customers as they scale their studies is exciting to see the Proteograph Product Suite being adopted by customers around the world to conduct first of their kind studies that explore the proteome at a depth, resolution, and scale that was not possible previously. Your line is now open. So, we're seeing interest, across really three different groups, proteomics folks that are mass spec experts, genomics folks that are really kind of new to proteomics, and are interested in adding proteomics to their research. And then genomic folks who are already generating proteomic data, but are looking for alternatives to current offerings, and looking to see more from their studies. So, broadly speaking, that is the bucket of customers we're dealing with. I think as we're bringing customers from interest to a close, while the pipeline is about equally split between those two, we're seeing that the close rate for the commercial customer is higher, I think it's just a cycle of the funding dynamic differences between an academic researcher and a commercial researcher driving that more rapid sales cycle in the context of a commercial customer. That said, given the broader macro picture, we are seeing that the purchasing decisions for potential customer, both in terms of academic and commercial customers getting elongated. And the breadth of this study that folks are taking, it knows everything from basic research, to translational work, looking at cohort studies, with diseases, neurodegenerative, aging, cancer and also we're seeing studies now being done in the face of animal health. Just in terms of the guidance, look I think we're trying to factor that in what we're seeing just from an interest level and then just some of the macro headwinds. Only -- having line of sight on a growing number of larger studies and also publications, which we agree we've heard, publications will certainly drive interest and maybe help to sales processes certainly should. Of course, we just started in 2020, so that year had about five presentations from Seer and none from customers. But what's interesting is if you look at 2022 alone, 66 presentations from Seer and 12 from customers, this is at conferences. So, I look at -- publications, the visibility, at least to a handful of manuscripts among customers that my expectation is they are going to be submitted tail end of this year and then heading into next year. And he was just giving me an update on a study that they had ran, where they were able to see upwards of 5,000 protein and in his judgment, an unbiased proteomics with the ease of the workflow that Seer offers for a high degree of accuracy, reproducibility to give you 5,000 proteins in the market. But in addition to that, biomarker papers, folks looking at different diseases, there's actually one KOL, who's also has used other platforms in the past other proteomic platforms in the past, so is that -- if you would earn an expert user of the various different proteomic technologies, and has also gotten access to the Seer technology, my expectation is that data set is going to get published. Anyway, so I think what's coming then should be really validating of exceptional quality of high impact papers. If I going to sneak one more in any guideposts as we're heading into the fourth quarter, how to think about next year, obviously, you're not going to guide here, but no consensus or revenue doubling. Look, as you know, we're not going to give guidance until our fourth quarter call next year. Look, I think as we as we think about it, again, sometime will pass, but certainly, macro environments not lost on us, both with inflation and raising interest rates, as well, as you know, some of the, layoffs and things people are seeing across the sector. So, again, I think we're just going to have to weigh everything, both, again, as we've said, the positive tailwinds from the customers, relative to just the macro constraints of budgets being tightened in CapEx, decisions being elongated, kind of how that all factors in. Your line is now open. So Dan just asked the question that was sort of the one I was getting from investors, which is sort of the outlook for next year. And look, we're going to be very thoughtful about keeping that in check, and not doing anything that's imprudent. And we certainly feel like our at -- we do have a huge asset and our cash and we want to preserve that and deploy that as appropriately as we can over the course of next year, so that we're in good position to weather -- to weather the storm, however long it lasts, and when it comes. So again, I think we're going to be really, really mindful in terms of -- in terms of our spend. But I think the key point to keep in mind is that the premise that the underlying foundational premise for starting this company is consistently proving to be exactly correct, which is, this field is directionally moving towards deciphering the complexity of the protein at the protein variant and the proteomics form level, we're beginning to see the scientific community talk about it in that way, and see as uniquely offers that solution with them. So we started off before Seer, we're the largest unbiased study in plasma doing the proteomic was 48 samples. Now we've got customers that are talking about doing multi 1000 sample studies, shortly after launch, so this is remarkable. And by the way, I have every expectation that are that we will absolutely see that multi 10s of 1000s of sample studies also come it's just not as these today. Your line is now open. So certainly, China remains China, in terms of the lock downs, and just lack of access to customers, depending on -- on how that's rolling through, and so that that continues to be a factor, just access, if you will. In terms of Europe, I think that's certainly something where, certainly with the, the inflation headwinds that they're seeing there, not to mention, the FX risk, I mean, obviously, we sell in dollars, and our products become more expensive. And then in the US, again, I think, as we've mentioned on previous calls, again, it's really just the macro of, not only inflation, but then capital budgets, that people are, looking at reassessing, we've seen, approval levels get kicked up a level for people. We've actually heard of a couple of customers, putting a freeze on all CapEx budget or CapEx spend for the rest of the year. And I think it's globally with various factors, factoring in terms of the global -- the global picture in terms of headwinds. But as you know, I mean, look wonder given we're on a very small revenue base, one or two, one or two deals can swing it either way. I'm not going to comment on 2023 yet with respect to the partnership, I will say DLS and SCIEX have been fantastic partners, I think we all have the same goal to get it up and running and scaling as quickly as we can, and working closely with them. There were certain genomics customers who said sounds great, would love to just get access to data, how can I do that quickly. And for those customers, it's not -- probably not buying an instrument, but it's going through one of our COEs including the Proteogenomics Consortium. So being able to kind of have them talk to DLS, at the same time they're talking to us, I think was great. And so we're really encouraged by that, and look forward to working closely with both the DLS and SCIEX next year to ramping the consortium further. Your line is now open. I noticed this quarter, you guys see a 5% increase in gross margin. So yes, I mean, I think the big contributor this quarter was, we did see higher consumable sales, which is in our view a positive in terms of people are ordering kits and using the system. In terms of the long-term getting to the long-term gross margins, I think there's lots of areas we see to being able to drive that. And then we also see significant ways to improve our overall gross margins on our kits, not only -- the kits consists of not only our nanoparticles with all the reagents and enzymes and buffers, you need to run the experiment, as well as plastic. So as we continue to optimize that, I think over time, not only from an assay perspective, but also  in the kit, and how we source those products in the kit will allow us to significantly improve the gross margins on the kits themselves. And over the course of the next couple of years, we'll continue to see the gross margins turned upward. You mentioned like starting in Q4, the grant again improved the revenue from research customers or academic customers is going to start coming in. So what we were talking about there, as you may recall, we've had a small business innovation research grant from the National Institutes of Health, and that was always characterized as grant revenue. So that grant revenue, in other words, revenue from getting reimbursed for our research under this grant will start to get reimbursed again in the fourth quarter. So it's simply a grant revenue process that now is going to start again, and as you can see, historically, again, those that was in anywhere from 10s of 1,000s to low 100s of 1,000s of types of revenue in any given quarter. Number one, we spun off a company out of Seer proteomics that is squarely focused on multiomic Core two, which is deep unbiased proteomics, but in addition, looking at other omics, as well, Transcriptomics, metabolomics, lipidomics. And in addition to proteomics, we've had a number of dialog with just about anyone that you can imagine, in terms of the possibility of integrating to see a Proteograph into the workflow. And of course, we're not disclosing the number of existing with the name of the existing customers in that liquidity box, the space that have adopted the platform or are considering it. So, in general, we said that we will not disclose the name of our existing customers, a certain set of customers who themselves have publicly announced or using the Proteograph, those customers we discussed, but otherwise, we don't but want answer your question very unequivocally, the answer is yes."
}