{
    "symbol": "MAN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 11:42:05",
    "content": " Adjusting for the U.S. acquisition integration costs and a loss on our previously announced disposition of our Russia business, EBITA was $162 million, reflecting growth of 64% in constant currency year-over-year. In the second quarter, we expect ongoing underlying improvement and revenue growth for the U.S. in the range of 46% to 50% year-over-year, or 15% to 19% organically. 19:39 After adjusting for the acquisition of the U.S. Experis business, the disposition of Russia, and a slightly lower number of billing days in the second quarter, our organic days-adjusted revenue growth rate represents 5% at the mid-point. Your line is open. Your line is open. Your line is open. I think if you look at that appendix to our release, you can see auto overall has been holding about 5% of our revenues that's been pretty consistent the last couple of quarters, but as we said, we are seeing some bigger impacts specifically in Germany. Your line is open. 39:08 So, at least based on what our clients are seeing today and what we're seeing across the labor markets, demand remains strong, our clients are noting the increased turbulence, of course, they are concerned, but they're not taking any actions discernible to us that really change their behavior as you can tell from our second quarter outlook as well. Your line is open. Your line is open. Your line is open. Your line is open. 56:39 So, it's really been a good evolution for Manpower and Experis and ManpowerGroup Talent Solutions as well that we are seen as a provider of perm hiring and a scale that we've frankly never seen before and we’re reaching record numbers of perm every quarter, which is a really good shift in terms of the perception of the kinds of services and the value that we can provide to our clients in the market that is very tight now, but of course, we also know that demographically speaking, you know all of the countries and where we do business are demographic challenged. Your line is open."
}