{
    "symbol": "PBI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 12:22:11",
    "content": " In the quarter we successfully concluded a going forward agreement with the USPS that enables us to essentially retain the economics we earned through the resellers reflecting the value we provide to the USPS and shippers in the market. In the third quarter we began the quarter at 2.8 million parcels per week and finished the quarter at 2.9 million parcels per week, so a slight improvement, but basically holding steady. Through the first three weeks of the fourth quarter, we are running at approximately 3.6 million parcels per week, so you can clearly see the impact of our improved service levels driving volume to our network. To conclude, as Ana foreshadowed at the last earnings call, the third quarter was similar to the second quarter financially, but again, looking back in the third quarter, I'm quite confident that the headline won't be any particular financial metric for the quarter, but the substantial wins that position our business for success going forward. In the quarter we successfully concluded a going forward agreement with the USPS that enables us to essentially retain the economics we earned through the resellers reflecting the value we provide to the USPS and shippers in the market. In the third quarter we began the quarter at 2.8 million parcels per week and finished the quarter at 2.9 million parcels per week, so a slight improvement, but basically holding steady. Through the first three weeks of the fourth quarter, we are running at approximately 3.6 million parcels per week, so you can clearly see the impact of our improved service levels driving volume to our network. To conclude, as Ana foreshadowed at the last earnings call, the third quarter was similar to the second quarter financially, but again, looking back in the third quarter, I'm quite confident that the headline won't be any particular financial metric for the quarter, but the substantial wins that position our business for success going forward. In the quarter we successfully concluded a going forward agreement with the USPS that enables us to essentially retain the economics we earned through the resellers reflecting the value we provide to the USPS and shippers in the market. In the third quarter we began the quarter at 2.8 million parcels per week and finished the quarter at 2.9 million parcels per week, so a slight improvement, but basically holding steady. Through the first three weeks of the fourth quarter, we are running at approximately 3.6 million parcels per week, so you can clearly see the impact of our improved service levels driving volume to our network. To conclude, as Ana foreshadowed at the last earnings call, the third quarter was similar to the second quarter financially, but again, looking back in the third quarter, I'm quite confident that the headline won't be any particular financial metric for the quarter, but the substantial wins that position our business for success going forward. In the quarter we successfully concluded a going forward agreement with the USPS that enables us to essentially retain the economics we earned through the resellers reflecting the value we provide to the USPS and shippers in the market. In the third quarter we began the quarter at 2.8 million parcels per week and finished the quarter at 2.9 million parcels per week, so a slight improvement, but basically holding steady. Through the first three weeks of the fourth quarter, we are running at approximately 3.6 million parcels per week, so you can clearly see the impact of our improved service levels driving volume to our network. To conclude, as Ana foreshadowed at the last earnings call, the third quarter was similar to the second quarter financially, but again, looking back in the third quarter, I'm quite confident that the headline won't be any particular financial metric for the quarter, but the substantial wins that position our business for success going forward."
}