{
    "symbol": "SRCL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 14:47:04",
    "content": " Our quarterly results included organic revenue growth at 5.7%, free cash flow generation of $130.9 million, expanded margins, reduced debt, improved leverage, and continued portfolio optimization. As a result of strong free cash flow generation and divestiture proceeds, we reduced debt by $175.4 million and finished 2022 with a debt leverage ratio of 3.28x a year-over-year improvement of 33 points. As noted on slide five, revenues were $670.4 million, compared to $657.3 million in the fourth quarter of 2021. Excluding the impact of unfavorable to foreign exchange rates of $15.7 million, divestitures of $10.8 million and an acquisition of $2.1 million, organic revenues increased $37.5 million. Of the increase, Secure Information Destruction organic revenue growth was $24.5 million and Regulated Waste and Compliance Services organic revenue growth was $13 million. As noted on slide 6, Regulated Waste and Compliance Services revenues were $449.3 million, compared to $455.7 million in the fourth quarter of 2021. North America Regulated Waste and Compliance Services organic revenues grew $17.9 million or 4.9%, mainly driven by our three pricing leverage, which include pricing and existing contracts, new customer pricing and surcharges and fees. Secure Information Destruction delivered revenues of $221.1 million, compared to $201.6 million in the fourth quarter of 2021. In North America, Secure Information Destruction organic revenues increased $22.8 million, or 13.2%, compared to the fourth quarter of 2021. Recycled paper contributed approximately $4.6 million more than in the fourth quarter 2021, reflecting higher SOP pricing. In international, Secure Information Destruction organic revenues increased $1.7 million, or 6.1%, compared to the fourth quarter of 2021. Commercial pricing levers resulting in revenue flow through of $32 million, lower adjusted litigation settlement and regulatory compliance expenses of $17.8 million, lower bad debt expense of $6.8 million as we lowered the reserves and our allowance for doubtful accounts, mainly due to improved collections in the fourth quarter, lower annual incentive compensation expense of $5 million and lower self-insurance expense of $3.4 million due to favorable trends and claims. Cash flow from operations for the year ended December 31, 2022 was $200.2 million, compared to $303.1 million for 2021. Adjusted income from operations was $90.6 million, or 13.5% as a percentage of revenues, compared to $64.2 million or 9.8% as a percentage of revenues in the fourth quarter of last year. Excluding the impact of foreign exchange rates, divestitures and an acquisition of a $1.00, the remaining $0.23 year-over-year increase was driven by $0.26 from revenue flow through, $0.09 from favorable SG&A expenses, mainly due to lower bad debt expense of $0.05 and lower annual incentive compensation of $0.04, $0.03 from lower self-insurance expense and $0.03 from taxes and other. As noted on slide 9, the year-over-year decline of $118.2 million was mainly driven by the lower operating cash due to FCPA settlement payments of $81 million and higher capital expenditures of $15.3 million, mainly attributable to the timing of cash payments and operational infrastructure investments. As a reminder, in the third quarter I provided guidance on how we would achieve free cash flow expansion of $100 million to $120 million from the third to the fourth quarter. $10 million of lower capital expenditures, which was within our stated range of spending $7 million to $17 million less in the quarter, approximately $20 million less in vendor payments, which is below our target of $30 million. Net debt was reduced by $175.4 million in the fourth quarter compared to the third quarter, reducing net debt for the year ended December 31, 2022 to approximately $1.46 billion. Excluding the impact of unfavorable foreign exchange rates of $53.4 million, divestitures of $52.7 million, and an acquisition of $8.1 million, organic revenues increased $155.8 million. Of the increase, Secure Information Destruction organic revenue growth was $129 million and Regulated Waste and Compliance Services organic revenue growth was $26.8 million, when 2022 and 2021 results are normalized to exclude the revenues from our most recently divested businesses, Communication Solutions and Sanypick Plastic, revenues were approximately $2.64 billion in 2022 compared to $2.52 billion in 2021. The $81.4 million increase was mainly due to commercial pricing leverage, resulting in revenue flow through of $116.7 million, lower adjusted litigation settlements and regulatory compliance expenses of $63.1 million as we had accrued approximately $80 million for the FCPA settlement expenses in 2021, versus approximately $10 million in 2022. These were partially offset by higher vehicle wage utility and facility related inflationary costs of approximately $65.5 million higher ongoing IT operating costs of $33 million associated with their August 2021 ERP deployment now reported in our ongoing expenses, higher headcount onboarding and overtime costs of $27 million and higher bad debt expense of $17.4 million. Adjusted diluted earnings per share was $2.04 in 2022, compared to $2.19 in 2021, as illustrated on the bridge on slide 15, excluding the impact from foreign exchange rates, divestitures and an acquisition of $0.06, the remaining $0.09 year-over-year decrease was driven by $0.51 from higher vehicle wage and utility related inflationary costs, $0.26 from higher ongoing IT operating costs associated with their August 2021 ERP deployment reported in our ongoing expenses, $0.21 from higher headcount, onboarding and overtime costs and $0.03 from interest expense. In 2023, we expect to generate adjusted earnings per share in a range of $1.75 to $2.05, anticipated underlying operating margin growth is expected to be tempered by higher incentive and stock-based compensation costs of approximately $0.20 to $0.25 and higher income taxes and interest of $0.10 to $0.15. Third, 2022 free cash flow was $68 million, after normalizing 2022 results for our two recent divestitures, their free cash flow baseline is $55 million. This is lower than the previous outlook of at least $400 million of free cash flow in 2025, mainly due to expected short term macroeconomic trends impacting the business that are reflected in the 2023 guidance. The recent Communications Solutions divestiture for which we had anticipated future free cash flow of $20 to $30 million, higher anticipated income tax payments of $10 to $15 million, and higher anticipated interest payments of $5 million to $10 million based on the current interest rate environment. On the new platform, it is operational efficiencies that are driven by the modernization, a new incinerator going live, new autoclaves, modernized autoclaves everything that Cindy mentioned, route optimization, and leveraging the systems that are not still fully in until we get to this year with the RWCS, and then you get the system reduction, eventually of $20 million to $30 million, when we take, get the international off the platform, so you get an uplift there."
}