{
    "symbol": "SGHC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-25 11:49:03",
    "content": "  Operator: Good morning, and welcome to Super Group's First Quarter of 2022 Earnings Conference Call. Following management's prepared remarks, we will open the call for Q&A. During this call, we may make comments of a forward-looking nature that are subject to risk, uncertainties and other factors discussed further in our SEC filings that could cause our actual results to differ materially from our historical results or from our forecast. Additionally, on today's call, we may refer to certain non-GAAP financial measures. And now, I would like to turn the call over to Neal Menashe, Super Group's Chief Executive Officer. Good morning, everyone, and thank you for joining us on the call today to discuss our results and developments for Super Group's first quarter of 2022. I'm joined by Richard Hasson, our President and COO, who will discuss how we're executing on our growth strategy and Alinda Van Wyk, our CFO, who will discuss our financial performance for the quarter. Super Group began trading as a public company on January the 28, 2022, following the business combination with Sports Entertainment Acquisition Corp. With the deal behind us, we've been focused on moving forward, operating as a public company, including appointing two additional independent board members, the Natara Holloway and Jonathan Jossel. We are thrilled that Natara and Jonathan have joined our Board, as they bring a wealth of experience relevant to our dynamic industry and they provide valuable perspectives, as we continue to pursue our global growth strategy. However, I want to add that Super Group continues to expand in both existing and new markets and continues to generate consistent cash flow. Specific to Super Group, we've had some regulatory changes in several European markets that make the year-over-year comparisons challenging. Going forward, we're also unsure as to how consumers react to high inflation and to various worldwide events that may affect discretionary spending patterns. These headwinds crop up from time to time, so we continue to operate the business with discipline, with a focus on long-term growth, but we think that it will be tough to meet or exceed our original 2022 forecast. Given the volatility we've seen and known uncertainties, we're working on a reforecast for 2022 and should be able to provide an update about our expectations when we release second quarter results in August. I want to spend a moment on the Super Group balance sheet, because we believe there is a competitive strength in a period of uncertainty. During the first quarter of 2022, we remain focused on expanding our ready substantial global footprint, which includes licenses in over 20 jurisdictions. In Europe, Betway was launched in Bulgaria for both a sports betting and casino offering during the quarter. In the US, through Digital Gaming Corporation or DGC, the Betway brand was launched in Arizona during the first quarter and in Virginia just last week. The Betway brand is now live in seven states in the US with these two recently launched states being added to the existing US footprint of Colorado, Indiana, Iowa, Pennsylvania and New Jersey. We continue to explore opportunities to expand into new markets, and we still see lots of opportunities to grow both in the US and across the globe. In the meanwhile, both Betway and Spin continue to operate in Ontario with the regulator's knowledge. Our Betway brand partnership portfolio includes over 70 active partnerships in 17 different countries, spread across all the major international sports, including soccer, basketball, tennis, e-sports and golf. During the first quarter, we signed nine new Betway brand partnerships, including the Milwaukee Bucks, the Stock Car Pro Series Brazil, and the Ghana Women’s Football League. This activity is in line with our strategy to expand our partnership network in order to reinforce the Betway brand around the world, helping to support all of our other marketing activities, and thereby the growth of the business. Year-on-year comparisons are complicated by the second wave of the worldwide COVID pandemic, which no doubt positively affected the numbers in the prior year quarter, as well as the subsequent closure or restriction of business in Germany, the Netherlands and Uganda, which obviously hurt customer numbers in the most recent quarter. Excluding the effect of closed and restricted markets, gives the year-on-year growth of 18%. In the long run, success in this business depends on adding new markets and growing the customer base in both existing and new market. In the past quarter, our existing markets delivered a respectful increase in customers and in due course, the several new markets that we've recently opened will help to power our customer growth further. As Neal alluded to in his earlier comments, we believe that recent conditions, while challenging in the short-term, may, given the strength of our balance sheet, reduce additional opportunities for Super Group. In order of priority, the way we think about capital allocation is to be constantly looking at the following three general areas; tuck-in or bolt-on M&A to expand our geographic footprint in sports betting or gaming or to enhance our technological capacity or marketing resources; continued expansion into new markets based on projected relative return on capital; and other appropriate uses of cash, including various means of returning cash to shareholders. Starting with revenue, net gaming revenue for the first quarter, inclusive of both Betway and Spin, increased by 5% year-over-year to €315 million. On a like-for-like basis, eliminating the material countries, which were closed during 2021, net gaming revenue would have increased by 8%. Sports revenue increased by €24 million or 28%, mainly due to a strong growth in key markets in the African and Asia-Pacific regions. Despite sports also bearing the brand of the negative impacts from Germany, Austria, and The Netherlands headwinds, growth was achieved by continued expansion of the customer base, with monthly active sports betting customers increasing five percentage in double-digits. For casino gaming only, we saw a year-on-year decrease of €8 million or 4%. This was in part due to regulatory changes in markets such as Germany, Austria, and The Netherlands, which resulted in adverse impacts on casino revenues that we estimate to be approximately €4 million for the quarter. With regards to future of these markets, Super Group has submitted all of the necessary documentation for The Netherlands licensing and assessing the viability of casino gaming in Germany given the current onerous tax regime there. The remainder of the decrease was largely due to the outperformance of the casino product in quarter one of 2021 during the peak of the COVID second wave in prominent markets, combined with our relative weakness in acquiring new customers in quarter one of 2022, which has already shown an uplift in quarter two of this year. On that basis, adjusted EBITDA for the first quarter decreased by 3% year-on-year to €63 million for the quarter. Looking into the details of the year-on-year comparison, Betway global brand sponsorship increased by 46% during the first quarter of 2022, representing an increase of €7 million. The majority of this was due to new partnerships with NBA and NHL teams as the group expands into the USA alongside its brand partner, DGC. Operational expenditure, were up by €10 million or 18%, mainly due to an increase of staff expenditure and infrastructure and technology costs. Staff costs rose, mainly due to annual salary increases, the cost of aligning employment benefit policies across the group and an increase in headcount, arising from additional corporate governance requirements following the Super Group's listing in January. Our free cash flow ratio remained strong at 75%, but was lower compared to the prior year quarter due to increases in taxes paid and capital expenditure. Super Group's effective tax rate remains at below 8%, thanks to a tax-efficient structure. The full picture is better illustrated by cash and cash equivalents, which was €312 million at the end of quarter one, compared to €342 million before the business combination closed in January. The decrease in cash and cash equivalents was driven by additional investments made, receivables outstanding, not yet recognized in cash and in-part offset by free cash flow generation. Our fully diluted share count will be slightly increased in the coming months, due to the issue of approximately 6.8 million restricted stock units, broadly distributed to over 3,000 staff members, who are not currently shareholders in the business, further aligning employee interest with shareholders. In closing, online gaming and sports betting are by definition, potentially volatile businesses, because our products are all built on top of random outcomes. Despite that, our team has built Super Group into a reliable cash-generating business, one that is debt-free, work full-scale, position for new market entry and capable of creating meaningful operating leverage as it grows. In conclusion, Super Group continues to grow its broad global footprint and profitable, diversified revenue streams. The company has been growing for over 20 years, generates reliable cash, operated scale, is profitable and is debt free. For over 20 years, we have managed this business through many changes and challenges. And we believe that the strategy that we are executing on will enable us to continue doing so, as we take Super Group from strength to strength. Please proceed with your questions. So, in Germany, as you know there's no online casino, we don't have an online casino license, whereas a year ago, we did. So, we're still looking at it to understand, if it's viable to be able to operate casino in Germany. Obviously, Betway is fully operational as a sports – with sports bet, no online casino. But as you know, only certain operators were given the licenses this year and then Betway and Spin are now waiting to get their licenses. So, it's more about a regulatory side in the Netherlands, just waiting to go live. So, specifically in Betway and Spin, on the Betway side, the registration has been awarded and we are expecting the similar registration to come shortly for Spin. Please proceed with your questions. Thanks for taking my questions. So, obviously, we built this business market by market. It's just about going into each of these markets and affecting them and understanding the spend, if it’s the OpEx spend, the marketing spend in those regions. So overall, obviously revenue for Q1 was difficult, especially with the hold in March, but the fundamentals of our business, nothing has changed. It's all about now really being long-term growth versus short-term profits, and it's getting that mix right to be able to take this business to the next level. As Richard mentioned earlier, Canada, as we’re all ready to go there, and we're just waiting for the regulator. And then, just as you kind of think long term, can you talk about the -- I guess, we see the Betway branding all over in the NHL and even in some arenas in the NBA. I think, as we've mentioned before, this global brand spend, the partnership that you referenced, those are part of the global portfolio, they're not measured specifically on the market in which those loans are present. They're done more for the global audience and they're part of a multichannel coherent marketing strategy, where the branding and the global branding makes up one component of one channel of numerous channels. And, yes, on that basis for the business as a whole, as a global brand, it still makes a lot of sense, yes. Please proceed with your questions. Thanks for taking my questions. It's just full quarter impact, but it has been considered in the remainder of the guidance for 2022. And 100% right, we are working around casino in Germany to see what is beneficial and how to proceed with the way forward, but we do suspect that and hope that -- we do know that Netherlands is coming back, depending on the regulatory outline. But after that,-- and this is Neal, so just for Germany, what I said earlier is, obviously, Betway is live and that's still been live with sports. So, we should expect the regulatory impact in -- for the remainder of the year to be less than €4 million a quarter. So, if by an impact, you mean versus the previous year's equivalent quarter, then there's still some level showing up in the second and part of third quarter for 2021. Germany, I'm just looking at the same time, I think that went off that we took the pedal off a lot earlier than that. And I guess maybe more directly, what -- you called out the March hold so -- but you guys provided guidance six weeks -- six or seven weeks ago and now taking it off the board. What's -- yes, that's Spencer, you’ve got first. Bernie, I mean I think if you go back to a year ago, when we were -- when we curtailed first hit of guidance, what you might remember from back then is we go into an intense amount of detail on this process. Some of them are very stable and produce great cash flows, and others were quite fresh and growing, and I’ve got some investments for a while to come. So, it's I think six weeks ago, eight weeks ago, there was a little bit harder to take a call on where we're looking at those. We're still not in a position to be exact or more detailed with our guidance, but I think we're in a position to call that we have pulled out at this point in time as to where we see three years and up. If I look at the press release, it shows that -- sorry, that North America revenue was up 1% year-over-year. I know that, there's some difficulties in terms of the year-over-year comparisons with looking at the press release. What was – it's interesting because of – we definitely in Q1 of last year got a very solid COVID fund, I think, is probably the best way to describe it. And then we have this yeah in 2021 year and we're still playing out, I mean, we think that goes for the remainder of the year. I just think if you compare this year to last year, obviously, you had what we talked about over and now obviously, people coming out in their discretionary spend going to other industries. But from our point of view is, the software and the robustness of the customers coming in from those markets is still there. So, if it's Canada and all the other country, each of this is a separate business within itself. Please proceed with your questions. Thanks for taking my questions. Just obviously, it's sort of a big surprise here given that you just gave guidance April 13 to sort of throw out your 2022 numbers here. And so just curious, if you can – I know, you touched on it, but obviously, it's a pretty big change. I mean, it's a little unusual to sort of retain guidance versus just lowering it. I mean, obviously, if we annualize your first quarter here, you might be €100 million off your EBITDA guidance. I think just macro, obviously, as Neal just referenced now, the business is made up of a number of different markets, and all of those markets are at different stages. And for us, it's very much a balancing act between finding how best to invest in these markets for the long term and balancing that with say, the current or the short-term profitability. We look at the business, the business has run over the long-term and our view is to keep doing what we’ve been doing and striking that right balance between all the different markets and between the short-term and the investments for the longer term. This business is -- we talk about market, but also about the product in each market. And it's enhancing that product, which is what's happening every day, new features coming out. But again, we're not going to be a business, which is going to be spending a fortune of marketing if we're not getting the returns on that extra step. Over the last say, two-plus decades, what we have understood is how to adjust the levers that are within our control even when we find ourselves in the markets like we are or if there are certain headwinds. And when I mention it was made, the reforecast will come with the next set of results, we'll be using that time to understand how exactly to adjust those levers and ultimately respond to the current scenario. So that's where Spencer touched on, it's a market-by-market forecast. And then again, I think the question is, is this a little miss on revenue versus 2022 original expectations, or are we taking a big step down here. But any, sort of, setting the stage or giving us some guardrails here, coming out of first quarter that was clearly a disappointment versus consensus. I was just going to say that one of the interesting parts of this business is that you spend a lot of money upfront in investing in the growth of the market, and we've called that out in terms of some of the sponsorship deals that are underway and the significant increase in brand spend versus year-on-year. So if you, sort of, play out the rest of the year, if we carry on trading the way that we have been in April and May, then the top line, the revenue number is not looking particularly scary. The issue is to catch up on the bottom-line, on the EBITDA line, thanks to, for example, the brand spend that we've put into growing the business worldwide and some of the operational expenses that come out of and we listed the business, some of the additional compliance requirements, et cetera, et cetera. But the point is that this business is made up of a lot of different parts with a lot of levers to pull, which we're reasonably comfortable we can do. And then when the season picks up again later in the year, it's -- it gives us a chance at recovery. So I'll do that also you know, the – and was familiar – the clear global business, you've got football, et cetera, there's the World Cup in November, December. So the lots of sports events still to come in the second half of the year, plus -- the business, it's a strong business. And so for us, we will continue to do that and continue to assess every single market as if it's its own business. We manage and control, we own the software from beginning to end and to about return on investment of the -- on the smart thing and we've got a very, very, very strong balance sheet. We don't have the banks any money, we generate lots of free cash, and we'll be putting that to good use. What was sort of interesting, I know you've been a long-term operator here and have had a tremendous amount of success. But you mentioned sort of maybe a pullback in discretionary spend, which sort of is a bit in contrast with some of your peers that are sort of highlighting that stand in gaming tends to do well in good times and bad. And so, just looking back on your wealth of experience here and operating in challenging markets, can you sort of double-click for us on how the consumer behaves, how the better behaves when you have more challenging economic scenarios that we're all dealing with now. I was going to say that historically, over the last 20 to 25 years, as all these settles, so it’s also -- relative to the sense of business in terms of economic cycles. But where I was going to go with that is that, we definitely do see an effect or have seen an effect in past business cycles, but it felt like it was little bit lucid compared to how radically it can affect other verticals. So, I mean, we cautiously weighing our plan there, just because we think, it's likely to have an impact. Exactly that's going to be, really, really hard to call for that, but geopolitically, we find ourselves in quite unique circumstance, one which, I don't know, appears as analog in the last 25 years. And, again, I'll say that I think we will be less effective than others, but that's a very personal opinion."
}