{
    "symbol": "CNO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 17:09:04",
    "content": " Client assets and brokerage and advisory were down 3% year-over-year to $2.6 billion in the second quarter, driven by declining equity impacts on account balances. Turning to the financial highlights on Slide 9, we generated operating earnings per share of $0.85 in the quarter, which is up 29% year-over-year as reported and up 3% excluding significant items in both periods. We deployed $60 million of capital on share repurchases in the quarter, contributing to a 12% reduction in weighted average diluted shares outstanding year-over-year. Turning to Slide 10, insurance product margin was down $19 million or 9% in the second quarter as compared to the prior year period. Excuse me, our new money rate of 5.53% for the quarter was up 180 basis points sequentially reflecting higher interest rates and spreads, and also benefiting from an allocation to alternative investments in the quarter. Investment income not allocated to products, which is where the variable components of investment income flow through increased by $21 million or 43% reflecting higher call and prepayment income, higher contribution from the FHLB program, and the addition of the FABN program. Turning to Slide 12, at quarter end our invested assets totaled roughly $25 billion, down 10% year-over-year reflecting declining market values in the quarter driven primarily by higher interest rates. The remaining 4% of the fixed income portfolio at quarter-end was rated below investment grade, which is down 10 basis points year-over-year. Turning to Slide 14, at quarter end our consolidated RBC ratio is 360% and our holdco liquidity was $140 million. Given the current market value of a good portion of these options is approaching zero additional downward movements in equity markets would not have a materially adverse impact on the value of the call options and therefore no material adverse impact on statutory income and capital Turning the Slide 15 in general, we are pleased with our earnings results in the first half of 2022 and our outlook continues to hold in most respects."
}