{
    "symbol": "OMIC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 16:13:06",
    "content": " As we look towards the rest of 2022, moving into Q4, we expect to deploy one to two systems per month with the goal of understanding each of the four operational and commercial factors outlined, manufacturing scale-up, installation and customer bring up, ongoing support and extended sales dynamics. Please announce your affiliation, then post your question. So there's not really anything specific other than we need that time for each one of those phases and some of the complex parts have really just been hard to come by, not delivered on time, and we've had issues with vendors kind of getting things here on time to get those builds going which has had a cascading effect. What is extended execution commercially looks like on the boards of initial interest in adopting a new platform, scaling it past 20, 30, 40, 50 orders, it's going to take a lot of understanding of really how to feel the business and we're still kind of getting that under our feet. So moving into next year, we think given all those factors, it's 2 to 4 units per month entering next year beyond that first month or 2 or 3, I think we're going to have to learn more before we can tell you exactly what that ramp looks like. Please announce your affiliation, then post your question. Please announce your affiliation, then post your question. Please announce your affiliation, then post your question. Please announce your affiliation, then post your question. The first one is it really did come to a head in what the delays of parts were going to result in over the last month or two, meaning we thought and had hoped that there was a best case scenario where given the delays in parts and given some of the challenges with getting vendors to meet their commitments, we could still potentially compress that phase that we spoke about, which is really bringing up the instruments, doing the testing, the validation and getting the reps done."
}