{
    "symbol": "OMIC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-15 02:46:04",
    "content": "  Operator: Good afternoon, ladies and gentlemen, and welcome to the Singular Genomics’ First Quarter 2022 Earnings Conference Call. Presenting today are Singular Genomics’ Founder and Chief Executive Officer, Drew Spaventa; and Head of Finance, Dalen Meeter. Earlier today, Singular Genomics released financial results for the 3 months ended March 31, 2021. Before we begin, I would like to inform you that comments and responses to your questions during today’s call reflect management’s view as of today, May 10, 2022, only and will include forward-looking statements and opinion statements including predictions, estimates, plans, expectations and other information. My prepared remarks today will touch on a few key areas, a brief reminder of our mission, commercial progress and opportunities, partnership activities and our newly published sequencing and applications note in progress on our product roadmap. Here at Singular Genomics, our approach has always been to prioritize the needs of our customers and to advance sequencing to meet their needs. This philosophy remains at the forefront of how we think about our technology, our products, our business and how we pursue our mission to accelerate genomics for the advancement of science and medicine. The incredibly talented team of scientists, engineers, operators and commercial staff at Singular are more focused than ever to execute on this mission as we are about to commence our first customer shipments later this quarter. The G4 is the most powerful, fastest and most flexible benchtop sequencer available today. No other offering comes close to providing this level of flexibility and modularity, which allows customers to scale up or down to optimize their sequencing run capacity as they need. In addition to these fundamentally differentiated performance metrics, it is imperative to deliver gold standard accuracy and data quality. Now with 7 external preproduction units placed in third-party labs over the past year, the G4 has consistently demonstrated industry gold standard accuracy levels of up to 99.9% for Q30 for 75% to 90% of base reads. We provide direct cost savings across the pricing spectrum in terms of cost per gigabase, cost per read or cost per experiment depending on the setting and customer profile. To sum it up, compared to other competitive systems, the G4 can achieve a data output rate that is 2x to 4x higher, over 2x faster runtimes, unmatched 4 flow cell and 16 lane flexibility, gold standard accuracy and highly competitive pricing. For customers, this combination will enable new, more desirable workflow patterns through daily runs, flexible run sizes and simultaneous run type variation. Turning to our commercial progress, we continue to build our sales funnel and have added to our system order book since the last earnings call held in March. We are actively scaling our commercial team, adding experienced sales reps and customer support personnel in key regions around the U.S. in anticipation of serving our customer and future installed base. As we think about our target customers, three profile standout, academic core labs, clinical and research commercial labs and emerging growth labs. These labs are often serving multiple PIs and run a wide range of applications with different requirements, including RNA-Seq single cell targeted panels, exome and whole genomes. The flexibility of 1, 2, 3 or 4 flow cells, each with individually addressable lanes, coupled with a 19-hour less run time is ideal for their needs. And we can offer favorable pricing across all G4 consumable kits, down to single digit dollars per gigabase for many of these users. These labs consist of small and large commercial organizations utilizing both clinical and research sequencing applications such as targeted panels, RNA-Seq, exome and rapid genomes. The power in terms of gigabase throughput, combined with attractive pricing provides a more scalable solution relative to other benchtop offerings in this segment for a number of clinical and commercial labs, the G4 serves as the first alternative option for those currently using high-throughput sequences. As we have noted on prior calls, the amount of capital that has flowed into healthcare over the last 2 years is more than the previous 10 years combined. The G4 can scale up with their sequencing needs over time, providing scalable throughput options comparable to instruments ranging from MiSeq through NextSeq all the way up to NovaSeq, SP or S1, ultimately providing high throughput level volumes and pricing on a benchtop sequencer. We realized there are considerations beyond the power, speed and flexibility, that factor into customers’ purchasing decisions. For some labs, largely academic core labs, costs are among the most important consideration given funding limitations. Our pricing strategies provide attractive economics for all users across the pricing spectrum, cost per gigabase, cost per read and cost per experiment. Oftentimes, pricing comparisons are quoted solely in the context of the highest number of cycles on a 100% fully utilized flow cell. Full flow cell utilization is not always practical based on customer sequencing and application needs, required turnaround times and sample flow. As a result, customers end up paying more for their run. Alternatively, they wait days, if not weeks, to batch samples and run only after a flow cell is more fully utilized. Because of this, all customer types, low, mid and high volume users can realize cost savings with the G4 through operational efficiencies. In summation, we look the G4 as a superior sequencing platform in terms of core KPIs with favorable pricing and strong value propositions in some of the largest and fastest-growing markets. Now, I’ll turn to our recent highlights and partnership activities. We have already made significant progress with 9 partners previously announced, including some of the most widely used library prep providers. As such, we are excited to announce that we have entered into two new partnerships with library prep solution providers, Bio-Rad Laboratories and Quantabio. With Bio-Rad, we are validating it’s SEQuoia library prep kits for RNA-Seq, with Quantabio we are validating its kits, a product line for both DNA and RNA sample prep. In addition, we’re proud to announce our partnership with market leading bioinformatics solutions provider, NVIDIA. With NVIDIA, we’re validating G4’s workflows with their Parabricks secondary analysis platform with the goal of providing accelerated secondary analysis and data handling. Next, I will provide a few updates on our recently disclosed G4 sequencing data and application note. If you recall from our last quarterly earnings call, we highlighted a technical report where the G4 demonstrated state-of-the-art accuracy in whole human genome sequencing. Samples were individually loaded on to different flow cells on the G4 to highlight the sequences reproducibility, both within the system and compared to the NextSeq. The G4 process need on a library using 2,100 base care sequencing. The overall comparison was nearly identical across all secondary RNA-Seq analysis metrics substantiating that the G4 meets customers’ needs on quality and accuracy, coupled with the potential to produce results at a much faster rate given the shorter sequencing run times. In addition to our progress on standard sequencing applications, we continue to make headway on our specialized applications kits, HD-Seq for rare variant detection and extended rate sequencing or XR-Seq. We believe it has the potential to fill unmet needs in areas such as immunology for therapeutic antibody and T cell discovery, protein engineering and vaccines for infectious disease. We anticipate having a G4 system onsite for demos, hosting KOL discussions and networking events, showcasing new technical developments and application nodes and providing additional data and highlights from our specialized application chips. In addition, at AGBT, we are excited to provide a sneak preview of one of the disruptive innovations that our development team has been working on, the MAX read flow cell. We believe the MAX read flow cell will redefine how customers think about cost and flexibility for short-read applications in the 30 to 100 base care range, a configuration that is applicable to applications such as short read counting for NIPT, proteomics and single cell RNA-Seq. We recently issued a press release noting a distinguished group of academic and industry experts on the SAB; David Barker, Lawrence Fong, David Ledbetter, Elaine Mardis and Daniel Shoemaker. With that, I will now turn the call over to Dalen to go over the details of our first quarter financial results and operational progress. I’ll start by covering the Q1 2022 financials and then provide brief remarks on our operational progress, including our infrastructure build-out and manufacturing capacity planning to support future growth. The year-over-year increase in total operating expenses was driven primarily by our product pipeline and R&D roadmap, scaling headcount and infrastructure to support the G4 launch and the costs associated with being a public company. The year-over-year decrease in net loss and net loss per share was driven primarily by the change in fair value of convertible notes and warrants in Q1 2021, which were converted to common stock with the IPO and no longer outstanding in Q1 2022. This was partially offset by higher operating expenses, as previously noted. In addition, the year-over-year decrease in net loss per share was driven by the increase in weighted average share count used to calculate net loss per share because of the common stock issued in connection with the IPO. Ending cash, cash equivalents and short-term investments, excluding restricted cash, totaled $316 million. Looking ahead through 2022, we continue to expect investment across the business to increase as we scale up manufacturing, add headcount sales, customer service and support and marketing and progress the product roadmap and future innovations in R&D. We expect our longer-term manufacturing and lab space needs will be accommodated with our new 78,000 square foot headquarters facility. Since inception, we’ve raised approximately $450 million and have spent less than $140 million. With initial orders in, we are ramping up our commercial organization and we will continue to make the necessary investments to support our commercial goals and scale the business. We continue to advance the technical capabilities of the G4 with expanded library prep provider integration, improved accuracy and advanced specialized applications to further differentiate it as the most versatile and powerful benchtop sequencer in the market. We are well situated with two differentiated technology platforms well-funded with $316 million of cash and investments, providing roughly 3 years of runway for us to scale our operations and products, execute on our exciting technology roadmap and generate valuable customer relationships. In the near-term, we are laser-focused on getting G4 manufacturing scale and identifying market segments and customers where the G4 offers a differentiated value proposition. Your line is live. Drew, maybe I’ll start with where you just finished on the customer service part. I mean, needing to properly balance in terms of the headcount and resources you put towards it, but knowing that the service and support element is so important to the beginning part. So early on with an initial launch, it really is bringing multiple parts of the organization together. But largely, it’s a collaborative effort with R&D to really bear hubs the customers, the early ones. So for your first handful of customers, you really want to make sure you understand their assays, you understand how they are going to use the sequencer. You do ample testing in-house first and you work with them to make sure that once you drop a box in, they are going to get the expected type of data quality and results that they are expecting and that you’ve already done yourself in your own lab. And within that whole process, you’re building out the customer sales and support infrastructure, which is CS&S/SAS technicians to really shadow closely the first few units to make sure that we can absorb all the learnings we need to kind of learn and iterate forward. And it’s going to be more work for the first few up to dozens of systems as we start to learn kind of what Install looks like, what customer service looks like, understanding the nature of the early technology and third-party hands. And then secondly, Drew, you talked about the emerging growth labs and totally appreciate the level of funding that we’ve seen over the past couple of years. So looking forward, it seems like a different environment and maybe cost consciousness might be a little bit more on the minds of these types of customers. I guess I’ll take the first one, which is kind of – the short answer is we added to the order book. But at the time and point, when we’re able to, with confidence, provide more color around things like order book and installs, we absolutely will, it’s just still early for us. In terms of the emerging growth segment specifically, we directly haven’t heard or seen too many people that at this point are rethinking purchasing decisions or rethinking their investment into their own businesses to advance their science. I mean, taking a step back, the figure that we quoted on the earnings call just a few moments ago, the number or the amount of capital that’s flown into the space over the last 2 years, a lot of that’s going to need to be put to work. That being said, I think we’re going to have to be adaptable to how customers want to step into a new technology or spend money and that might be different solutions. Your line is live. Following up on the previous question, I want to start with the valuation process for some of these customers. If you’re talking about kind of academic labs, it’s going to be a longer sales cycle in general. You’re going to have to provide data, whether it’s publicly available or other data that’s not publicly available yet that we would engage with the customer and really get them confident that the system can perform. And once they are confident the system can perform, they are going to have to see a cost savings relative to alternatives typically. Now, there is some academic cores that have specific value propositions, where the speed of the flexibility specifically makes it a very different dynamic for them to purchase. And again, those are where we want to, for a large part focus our efforts, places where our competitive advantage really highlights the need to adopt our system versus others. As we’re thinking about other customers, whether they are emerging growth customers or commercial labs, typically with a private entity, it’s a quicker buying decision. And that’s something that, again, was not a surprise or a reaction. Now, of course, you hope that you’re qualifying your customers and understanding who’s a high potential buyer if you do spend the time and work to evaluate those samples versus somebody that just wants to see free data. And then there’s people all over the spectrum from that very quick decision that doesn’t meet me much all the way to the customer that needs many, many months of education of interaction of testing samples to the point when they get to a buying decision. In the last couple of months, obviously, there has been a lot of noise by some existing competitors by some new competitors with product entry to the market. No, it’s a good topic. I would say that, again, it varies based on customers. And if you are looking at an F2 versus a P1 or P2, it’s a very simple buying decision. It’s going to be much cheaper on a cost per rear, cost per gigabase. For those customers, they really do want to wait and understand that is the F3 going to be on time, that’s really how I want to use this sequencer. And then within that subset of customers, some are willing to get in line early and know that the roadmap is going to be there and others are candidly saying we want to wait until we have an F3 and then we are a customer. In terms of your question on Chemistry X, we still don’t really know enough to kind of handicap where or what that means, especially for our segment, which is really bench-top kind of mid to low end of the high throughput. I think the rumors that we have heard and again there are simply rumors that Chemistry X most likely makes its first appearance at the very high end, which again is not our target market. But back to the question on roadmap, absolutely, the ability to continually push our cycle times faster and our run time faster and to push the density or the throughput of our system higher are top of mind. Yes, like you highlighted, the primary focus right now is shipping, placing systems in customer labs, getting them up and running. Like you highlighted on the last call, the revenue recognition is going to follow the specific terms and conditions for each of the orders. Those initial shipments, there is going to be a customary acceptance or validation process that we are going to engage with the customer on to complete. That’s not uncommon for a new product launch, right. And the team continues to grow in terms of a leader, we have been very happy with the quality of potential candidates out there and expect to be moving forward with the CCO position fairly shortly. And while we absolutely want to not ignore the macro situation and make sure that we have as much flexibility as possible to extend runway, very much the next 12 months to 18 months to 24 months are an opportunity for us to invest that cash into R&D, into product, into commercial and to really grow our business and further advance our technology. So, there is a lot of thought that’s going into this. In terms of the rest of this year, I will let Dalen talk about kind of how we are thinking about cash. Yes, on the last call, we talked about 2022 operating expenses could potentially be about double in 2021. Yes, I would just say we have always been really capital efficient, like we said in the prepared remarks. Next, we have Tom Stevens with Cowen. Your line is live. Next, we have Tom Stevens with Cowen. So, I believe you said you exited last year with about 40 sales people on staff. And we plan to grow the commercial team, and that’s sales support and marketing to about 40 by the end of this year. Outside of that, I don’t know if we have guided further on headcount. And that allows us to achieve not only inherent high accuracy of sequencing, but also get around other air modes that can be introduced by DNA damage by polymerase, miscopying and so on. And then just the last one, soo given you kind of wrapped up your access program, I was wondering if you could kind of give an overall kind of spread of the metrics you saw. If you give any metrics overall, so maybe the range of accuracy across the access partners and kind of the key learnings from the final two, would be really helpful. So, maybe I will provide kind of a few overall metrics, and then I will let Eli talk about any additional learnings. So, I would say, if you think about kind of the core performance metrics of sequencing, you start with accuracy. We were able to get the cycle times down to our target specs, which under three minutes, and that’s also on that table. We had 150 million reads per flow cell, so across four flow sales at 600 million reads. And what we were showing on the EAP is that we were actually able to achieve not only above 150 million reads, but on some of the EAPs, we were getting over 200 million reads on the F2 flow cells. So, we started off with relatively easy applications like RNA-Seq and then progressed to full paired N150 reads with index reads additionally. So, kind of working through that and putting us in a position where we are comfortable about hitting our commercial specs, like Drew mentioned, 150 million reads per flow cell in the F2, flow cell every flow cell will have double that 300 million reads. And then overall, run times, accuracy and some of the secondary metrics that Drew mentioned in terms of GC coverage and in certain length that we can handle in the sequencing. So, given the recent kind of IT battle between Illumina's and BGI, I just want to make sure you guys use four kind of chemistry and not the two color. To the first question, yes, we are a four-color novel chemistry that was developed from the ground up internally, so very different composition of matter, different polymerases than anything else out there. And we actually call it rapid SBS chemistry, given the fact that we are able to push the cycles so fast. And then on the second question, MAXRead, yes, MAXRead is something that really, again, was born out of deep understanding of how a lot of customers are using sequencers. And we saw that as an opportunity if you can deliver lower cost or a higher number of short reads at a lower cost, you are really offering something differentiated that’s a pain point. If someone is doing a 50 or 70 base reads versus a 300 base reads, they are not getting a third of the price for that read. So, how do you allow people to see real cost savings for short reads and it’s the technology we are working on and there is actually a configuration that we are looking to share in a technical paper where we can produce up to about 1 billion reads on a single flow cell for short reads. And that dramatically will increase the number of short reads that you can do on a G4, which we think will be a big differentiator for a lot of the short-read applications."
}