{
    "symbol": "ZLAB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 14:16:48",
    "content": " Also at ASCO, Zai Lab and Novocure announced the EF-31 Phase 2 pilot study, evaluating the safety and efficacy of TTFields together with standard-of-care chemotherapy alone or in combination with trastuzumab for HER2-positive patients as a first-line treatment in patients with advanced gastric cancer. In addition to these results, Mirati reported updated findings from a pooled analysis from the KRYSTAL-1 study, including the registrational Phase 2 and Phase 1/1b non-small cell lung cancer cohorts. Also in June Mirati announced the results of a prospective analysis from the Phase 1b cohort of the KRYSTAL-1 study evaluating intracranial responses of adagrasib in patients with KRASG12C-mutated advanced non-small cell lung cancer with active and untreated CNS metastases. For bemarituzumab, our partner Amgen reported that the final analysis of the FIGHT study, Phase 2 randomized, double-blind, controlled study evaluating bemarituzumab and modified FOLFOX6 in patients with previously untreated advanced gastric and GEJ cancer was completed. Throughout the year our oncology pipeline will continue to be productive, including regulatory and clinical data updates from the  program in the second half of the year, top line data from the TTFields Phase 3 pivotal LUNAR study in early first quarter of 2023, as well as numerous regulatory submissions and clinical trial initiations from across the franchise. Also at ASCO, Zai Lab and Novocure announced the EF-31 Phase 2 pilot study, evaluating the safety and efficacy of TTFields together with standard-of-care chemotherapy alone or in combination with trastuzumab for HER2-positive patients as a first-line treatment in patients with advanced gastric cancer. In addition to these results, Mirati reported updated findings from a pooled analysis from the KRYSTAL-1 study, including the registrational Phase 2 and Phase 1/1b non-small cell lung cancer cohorts. Also in June Mirati announced the results of a prospective analysis from the Phase 1b cohort of the KRYSTAL-1 study evaluating intracranial responses of adagrasib in patients with KRASG12C-mutated advanced non-small cell lung cancer with active and untreated CNS metastases. For bemarituzumab, our partner Amgen reported that the final analysis of the FIGHT study, Phase 2 randomized, double-blind, controlled study evaluating bemarituzumab and modified FOLFOX6 in patients with previously untreated advanced gastric and GEJ cancer was completed. Throughout the year our oncology pipeline will continue to be productive, including regulatory and clinical data updates from the  program in the second half of the year, top line data from the TTFields Phase 3 pivotal LUNAR study in early first quarter of 2023, as well as numerous regulatory submissions and clinical trial initiations from across the franchise."
}