{
    "symbol": "TRV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 12:35:04",
    "content": " We're off to a terrific start for the year with an excellent bottom line results, growth in all 3 segments, strong and improved profitability in our commercial business segments, progress addressing the environmental headwinds facing the personal insurance industry and another quarter of progress on a number of important strategic initiatives. These results were driven by net earned premiums of $8 billion, up 9% over the prior year quarter and an excellent combined ratio of 91.3%. In light of our strong financial position and confidence in the outlook for our business, I'm pleased to share that our Board of Directors declared a 6% increase in our quarterly cash dividend to $0.93 per share, marking 18 consecutive years of dividend increases with a compound annual growth rate of 9% over that period. Our first quarter results include $160 million of pretax cat losses, much lower than last year's record high first quarter of $835 million pretax. Our after-tax underlying underwriting gain of $580 million was consistent with the prior year quarter, reflecting higher levels of earned premium and an underlying combined ratio of 91.2%. Net written premiums increased 9% to an all-time quarterly high of $4.5 billion, benefiting from historically high renewal premium change and retention as well as an increase in new business. And finally, new business of $544 million was up 17% from the first quarter of last year, driven by our success with large accounts in Middle Market as well as our continued success with our innovative BOP 2.0 product in Select. As for the individual businesses, in Select, renewal premium change was a strong 9%, while retention of 83% ticked up 1 point sequentially and was up 4 points from the prior year quarter. Segment income was $217 million up 58% from the prior year quarter, driven by higher underlying underwriting income, lower cat losses and a higher level of net favorable prior year reserve development. In automobile, the first quarter combined ratio was 99.3%, an increase of 17.5 points compared to a prior year quarter that reflected low loss activity due to the pandemic. The underlying combined ratio of 86.9%, was 3 points higher than the prior year quarter, as we continued to see higher severity related to a combination of labor and material price increases. I think Greg gave you what's a pretty straightforward story to the quarter, about a point better in the loss ratio really tied to earned pricing being ahead of what we're seeing in the loss environment and about 1 point of improvement in the expense ratio. If you believe that the inflationary impact is going to be somewhat persistent at least over the medium term if you'd put it in loss trends, that's reflected in the numbers that Greg talked about in terms of a point of margin expansion in the quarter and in the commentary that on a written basis with the production results we saw this quarter, we expect margins to continue to expand going forward. I mean we -- which is one of the reasons why when we talk about book value per share, we almost always talk about adjusted book value per share, the unrealized gain or loss position in the portfolio, we think of as we have duration in the portfolio, interest rates are going to move, we're going to have an unrealized gain or loss, it's not really driving the economics of how we think about the capital position of the company. And so if I just compare the 4.4 renewal rate change in Business Insurance with the loss trend of, call it, 5% to 6%, it implies that to expand margin, you would need around 1 point to 1.5 points of the exposure change that's acting as rate."
}