{
    "symbol": "TRV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 13:41:03",
    "content": " Our strong operating results over the past few quarters together with our solid balance sheet enabled us to grow adjusted book value per share by 7% over the past year, after making important investments in our business and continuing to return excess capital to shareholders. Net written premiums of $4.4 billion were up 9% over the prior year quarter, with growth in all domestic markets and lines of business. The underlying combined ratio was a terrific 78.4% and improvement of five points from the prior year quarter, reflecting both the benefit of earned pricing and about a two point impact from the favorable re-estimation of losses for the first two quarters of 2022. We're also pleased that we increase new business 20% from the prior year quarter, as we leverage the investments we've made and continue to make in our competitive advantages to grow these profitable businesses. Your line is open. I like the point of the comments today, we're really to just reinforce for folks that one, we're not a big user of reinsurance, especially relative to some other parts of the market; and two, our track record and our long tenure with a lot of our trading partners, as is pretty confident that we're going to be able to place what we want to place at appropriate prices, the CAT aggregate XOL treaty, specifically, we've said -- I think we've said, every year we had it. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I would simply say don't expect to see us make a wholesale turn over in the portfolio to realize a bunch of losses and then take higher yields on the money going forward and think economically, that's sort of a wash. And we're looking at what's best for the company from an economic perspective. Your line is open. Your line is open. Your line is open. Your line is open. And so we're seeing a little more of that severity pressure on that first cohort that has some of the same supply and demand dynamics that that Michael's feeling, but we're continuing to make good progress on pricing and underwriting and as I share that at the recent Investor Day, we're bringing out a new auto product that we think is going to be really segmented and help us with our prospects even more. Your line is open. Your line is open."
}