{
    "symbol": "TRV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 13:05:21",
    "content": " We are pleased to report a very strong second quarter, including an excellent bottom-line result, double-digit top line growth in all 3 segments, strong and improved profitability in our commercial business segment, progress addressing the rental headwinds facing the personal insurance industry, a meaningful contribution from net investment income and another quarter of progress on a number of important strategic initiatives. These results were driven by record net earned premiums of $8.3 billion, up 9% over the prior year quarter and a solid underlying combined ratio of 92.8% -- environmental issues impacting insurance industry, consolidated results reflect the benefit of our diversified portfolio of businesses. Looking at the 2 commercial businesses together, the combined BI-BSI underlying combined ratio of 2.7% for the quarter, an improvement of 1 point from the prior year quarter. Turning to the top line, thanks to excellent execution by our colleagues in the field and the strong franchise value we offer to our customers and distribution partners, we grew net written premiums by 11% this quarter to a record $9 billion with, as I mentioned, each of our 3 segments growing double digits. At the same time that we continue to make significant investments in strategic initiatives, the second quarter expense ratio improved 70 basis points from last year to 29% driven by the combination of our focus on productivity and efficiency and strong top line growth. In Business Insurance, net favorable PYD of $202 million was driven by better-than-expected loss experience in workers' comp across a number of accident years and favorable movement in CMP partially offset by an increase in general liability reserves, including for runoff operations. Adjusted book value per share, which excludes net unrealized investment gains and losses, was $112.37 at quarter end, up 2.4% from year-end and up 8.2% from a year ago. Second quarter segment income was $666 million, up about 4% from the prior year quarter driven by higher net favorable prior year reserve development and higher underlying underwriting income. As for the individual businesses, in select, renewal premium change was strong at over 9% while retention of 83% was up 3 points from the prior year quarter. Segment income was $228 million, up 22% from the prior year quarter driven by a higher level of net favorable prior year reserve development and higher underlying underwriting income. The underlying combined ratio was an excellent 82.2%, an improvement of 1.2 points from the prior year quarter. While it's not unusual for us to generate an underwriting loss in the second quarter, it typically has the highest weather-related loss activity, this quarter's results were also impacted by the inflationary pressure that we and the industry have been experiencing for the past few quarters. In total, the combined ratio increased 11.5 points compared to the prior year quarter and included a higher underlying combined ratio, higher catastrophe losses and lower favorable prior year reserve development. In automobile, the second quarter combined ratio was 104.3% and the underlying combined ratio was 101.8%, an increase of about 10 points relative to the prior year quarter. We continue to experience loss severity related to a -- higher loss severity related to a combination of labor and material price increases, but that was largely offset by various items, including a comparison to a prior year quarter that included elevated non-weather losses as well as the current quarter benefits of earned pricing. Brian, if we think about the non-cat property losses that are in underlying last year, we said the -- as you pointed out, last year we said they're about 1.5 points better than what we would have expected in the second quarter."
}