{
    "symbol": "DNOW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 15:01:05",
    "content": " For the fourth quarter, EBITDA was $47 million or 8.6% of revenue strong performance, especially in a period with seasonal and holiday headwinds. For the full year 2022 EBITDA was $175 million or 8.2% of revenue a consequential - turning point for the company, setting the stage for a significantly improved earnings power and cash flows into the future. During the second half of 2022, we generated $48 million in free cash flow in on a full year basis in a year where we increased revenue over $500 million added over $130 million in inventory for our customers and $9 million in infrastructure and rental equipment. We also delivered several large pipe orders during the fourth quarter for utilities, company in the Southeast and an operator in the Gulf of Mexico totaling more than $12 million, which drove our strong 4Q revenue beat and those $12 million in orders are not expected to recur in the first quarter of 2023. In Canada, revenue was $75 million for the quarter, a 13% decrease sequentially primarily due to a seasonal impacts as expected and revenue was up 4% year-over-year. Total fourth quarter 2022 revenue was $547 million, down 5% or $30 million from the third quarter. On a year-over-year basis, the 2022 fourth quarter revenue was up $115 million or 27%. On a full year basis totaled 2022, EBITDA reached 8.2% of revenue or $175 million nearly four times the EBITDA dollars delivered in 2021. 2022 U.S. revenue totaled $1.591 billion for the full year, up 37% or $428 million from 2021. Turning to Canada for the fourth quarter revenue was $75 million, down $11 million or 13% from the third quarter of 2022 on fewer rigs and the primary result of customer projects, delivered in the third quarter. On a full year basis, Canada revenue totaled $315 million, an increase of $66 million or 27% when compared to 2021. International revenue for the fourth quarter of 2022 was $58 million, up $2 million sequentially. On a full year basis, international revenue totaled $230 million, an increase of $10 million or 5% when compared to 2021 largely impacted by 7% negative foreign currency impact, approximately $16 million our fourth quarter gross margins remained flat from the third quarter at 24.1%. Looking back one year ago to fourth quarter of 2021, we expanded quarterly revenue by $115 million yet only added $6 million in quarterly WSA or about 5% of the increase in revenue demonstrating improved efficiencies in our ability to leverage our cost base. Moving to the balance sheet at the end of the year, we had zero debt and a cash position of $212 million cash decreased $55 million in the fourth quarter, primarily related to the successful completion of two acquisitions totaling $59 million in the quarter. Accounts payable was $304 million, a decrease of $35 million from the third quarter and for the fourth quarter of 2022 working capital, excluding cash as a percentage of our fourth quarter annualized revenue was approximately 16.7%. Compared to the last two quarters of 2022, when we generated $51 million in cash from operations in the second half of the year on a lower build in working capital and improved earnings. 1Q, '23 EBITDA dollars could reach as much as 50% above 1Q, '22 EBITDA dollars, which was $28 million and we upgrade our forecasted full year 2023 revenue to now increase 8% to 12% compared to the full year 2022 revenue. For the year, we achieved revenue growth of $504 million or 31% growth compared to 2021 without consuming cash from operations as we turned working capital seven times delivered impressive gross margins of 23.7% and generated $175 million in EBITDA excluding other costs or 8.2% of revenue. Well, I think, where we're at today is - three quarters in the U.S. energy and approximately 25% is a Process Solutions naturally we want them both to grow and I'd be happy  The growth both grew 50% neighbor and the ratios were the same three years from now, but Process Solutions to me, it's primarily a pump business, but a lot more than that it has a level of stickiness with our customers."
}