{
    "symbol": "SEMR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 10:48:01",
    "content": " Forward-looking statements include statements concerning our expected future business and financial performance and financial condition, expected growth, adoption and demand for our existing and any new products and features, investments and acquisitions and their anticipated benefits, industry and market trends, our competitive position, our market strategies, market opportunities, our guidance for the first quarter of 2023 and the full year 2023 and statements about future operating results, including margin improvements, profitability and free cash flow goals can be identified by words such as expect, anticipate, intend, plan, believe, seek or will. We reported a strong year, a full year revenue of $254 million, up 35% year-over-year as we beaten range estimates throughout 2022. For the first quarter, we expect revenue in the range of $70.3 to $70.7 million, up approximately 23% year-over-year. For the full year, I expect revenue in the range of $306 million to $309 million, which would represent growth at the midpoint of approximately 21% year-over-year. We expect non-GAAP net income equivalent to $3 million for the full year 2023, including approximately $1.3 million of exit costs. In 2022, margins reflected brand marketing campaigns, and higher personnel costs in new locations as our operating expenses grew faster than revenue, largely due to our education program, which cost approximately $11.3 million. Operating expenses, excluding equity costs, were $70.2 million in the quarter, up 53% year-over-year and up 22% from the previous quarter. Sales and marketing expense was $39.6 million in the fourth quarter, up 54% year-over-year and up 30% from the previous quarter. I would also note that the sequential and year-over-year increase was partly a function of a pre-classification of costs from G&A into sales and marketing as previous to the fourth quarter, sales and marketing leadership expenses were recognized in G&A. Research and development expense was $13.3 million in the fourth quarter, up 94% year-over-year and 31% from the previous quarter. G&A expense of $17.4 million was approximately 31% year-over-year, but essentially flat from the previous quarter. During the quarter, solid revenue growth and higher gross margins were more than offset by higher expenses, including nearly $2 million of exit costs and contributed to a non-GAAP net loss of $11.6 million compared to a non-GAAP net loss of $2.9 million a year ago."
}