{
    "symbol": "BTAI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 13:42:09",
    "content": "  Operator: Good morning, and welcome to the BioXcel Therapeutics Fourth Quarter and Full Year 2022 Financial Results Conference Call. Just to remind everyone, certain matters discussed in today's conference call and/or answers that may be given to questions asked are forward-looking statements that are subject to risks and uncertainties related to future events and/or the future financial or business performance of the company. Risk factors that may affect future results are detailed in the company's quarterly report on Form 10-Q for the quarter ended September 30, 2022 which can be found at www.BioXceltherapeutics.com or on www.sec.gov, and which will be updated in its Annual Report on Form 10-K for the year-end December 31, 2022. As a reminder, today's conference is being recorded. Joining us on today's call are Dr. Vimal Mehta, Chief Executive Officer; Richard Steinhart, Chief Financial Officer; Matt Wiley, Chief Commercial Officer; Dr. Vince Oâ\u0080\u0099Neill, Chief R&D Officer of OnkosXcel Therapeutics; Dr. It is now my pleasure to turn the call over to Dr. Mehta, the CEO and Founder of BioXcel Therapeutics. It was exactly 5 years ago that BioXcel Therapeutics became a public company, and we embarked on our journey with a clear mission to build a uniquely disruptive biopharmaceutical company model using artificial intelligence approaches to bring transformative medicines in neuroscience and immuno-oncology to patients. We are making great strides in building on our accomplishment in 2022, which was truly a transformative period for BioXcel Therapeutics as we transition to a commercial stage company. Last year, we received FDA approval for our first drug, IGALMI for the acute treatment of mild, moderate and severe forms of agitation for schizophrenia and bipolar disorder in adults. Most notably, using our AI platform we advanced from IND to commercial launch in less than 4 years. Today, we are building on these accomplishments and remain laser-focused on accelerating our growth in 2023 and beyond. First, our commercial execution of IGALMI is fully underway. We believe that IGALMI's mechanism of action and ability treat agitation, creates a commercial path in an institutional setting with no obvious analogue. To date, we have made impressive progress with our initial field force of 26 sales rep. Now, with our commercial operation fully deployed with 70 sales reps in all major markets across the U.S. We look forward to accelerating this momentum. We are pleased with the market reception of IGALMI, which is supported by highly favorable market dynamics. initial response from health care providers has been extremely positive, especially rewarding to hear about the difference IGALMI is already making for patients, families and health care providers. Second, turning to our robust clinical pipeline, we believe the upcoming quarter may represent a watershed moment for the company. In the second quarter, we expect to announce pivotal clinical data that potentially support significant market expansion opportunities for our lead neuropsychiatric program BXCL501. It is comprised of an estimated 139 million agitation episodes per year across bipolar disorder, schizophrenia and Alzheimer's, our three priority indications across various medical settings. In TRANQUILITY III we are accelerating enrollment of patients with moderate to severe dementia in nursing home, with first patient dosing having a third largest sample. Turning to SERENITY III, we build this program upon 501's demonstrated benefit for agitation associated with schizophrenia or bipolar I or II disorders in adults. The two-part, pivotal trial is evaluating the safety and efficacy of a 60 microgram dose in acutely agitated, bipolar I and II disorder, and schizophrenia patients who support use of 501 in the at home setting. We estimated 23 million agitation episodes occur in the U.S,. With SERENITY Part III, Part 1 -- SERENITY 3 part One, more than 90% of patients are already enrolled. With complete enrollment imminent, we plan to enter the data cleaning and validation phase shortly. In addition, we anticipate reporting top line results from our Phase 1b multiple ascending dose trial for major depressive disorders, in the second quarter. For the first time, we are conducting chronic dosing of 501 in healthy volunteers, and evaluating its safety and tolerability on a daily or twice-daily dosing basis over a 7=day period, including in combination with an antidepressant. The trial outcome is expected to inform those selection in combination with selective Serotonin or serotonin, norepinephrine reuptake inhibitors in MDD patients. Beyond these three important near-term data readouts, we are advancing our research and development pipeline. We are developing BXL502, a novel serotonergic receptor antagonist as a potential therapy for chronic treatment of agitation in patients with dementia and other related neuropsychiatric conditions. It has demonstrated positive efficacy results in two cancer types and CRPC small cell neuroendocrine prostate cancer, SCMC and adenocarcinoma, which is supported by 800 subjects -- clinical safety database. As presented at ASCO GU in February, BXCL701, in combination with KEYTRUDA, the most ready to complete response rate of 25% in SEMC. We believe the results support moving forward with a potential pivotal study for BXCL701 as a monotherapy and in combination with KEYTRUDA in SEMC in second half of this year, ending FDA discussions Finally, we are excited about the tremendous potential of OnkosXcel Therapeutics and are actively seeking to unlock its full value for our shareholders. Looking back, I can proudly say that 2022 was a year of significant accomplishment for BioXcel Therapeutics on all fronts. We are truly a driver of the industry change and have demonstrated that our AI based approach can improve the probability of success, reduce development timelines, and enhance R&D economics. Before I provide an update on our commercial activities, I want to reinforce Vimal's message of how proud we are of what we accomplished last year with the approval and launch of IGALMI. Not only did we focus on building a strong commercial organization, we took the necessary steps and investment in building an entirely new market for the treatment of agitation episodes, an area which there have been no new developments in more than a decade. Looking back at 2022, I can report that the fourth quarter was transformational for the commercial organization. Most importantly, we improved the volume of potential patient exposures to IGALMI and continue to pave the way for broader access to this meaningful treatment. We're working hard to change the lives of patients, and each one matters to us. Considering that objective, we successfully expanded the sales force of 70 representatives with full deployment commencing last December. This allowed us to expand our reach from 700 target hospitals to more than 1,700 and positioned us to fully launch IGALMI as we entered 2023. They have extended our reach to more than 1,100 of our target hospitals to date and reaching over 7,000 unique health care providers. With that in mind, I'll provide some updates on our formulary adoption progress. As you know, we launched IGALMI last year with a small team of 26 representatives. This has been our experience to date, and we continue to be pleased with the perceived value of IGALMI to hospitals, patients and health care providers. As hospitals gain experience with IGALMI, we've received possible -- positive anecdotal feedback regarding patient response, throughput and staff safety. On this topic, we expect to launch a free trial program to qualifying hospitals later this quarter. We have now contracted with three group purchasing organizations or GPOs, covering half of the targeted hospital beds. While we are in negotiations and discussions with the remaining two major GPOs, we have focused our attention on system specific contracting that will help accelerate the pace of integrated delivery network or IDN reviews, and adoption to provide system wide access to IGALMI. As noted in previous calls, our corporate account director team is targeting 59 IDNs, having a total of approximately 280,000 beds in the United States. So far, we've secured formulary approval for just over 7,000 of those beds or 2% with more than 70,000 or 25% anticipating a vote over the next two quarters or so. At the same time, we're beginning to gain access. We're deploying this campaign through print media, digital media and our sales team and expect to generate more than 10.5 million impressions in the second quarter. In addition, the marketing team deployed a large scale peer speaker effort to provide a comprehensive presentation on IGALMI to targeted HCPs. While there's an expected for traction to hospital launches and uptake, market receptivity and excitement continues to grow and the promise of this drug to patients is peerless. So let me start with our lead immunotherapy candidate BioXcel701, which is our investigational oral innate immune activator design to turn  via DPP9 inhibition. In combination with KEYTRUDA, 1WE believe 701 can expand the activity of immunotherapy into large, underserved patient populations. Importantly, we believe 701s clinical pathway continues to be derisked, as we know have demonstrated clinical POC in both adenocarcinoma and small cell neuroendocrine cancer. In the second half of this year, we intend to initiate a potential registrational Phase 2b study for BioXcel 701 and small cell neuroendocrine cancer subject to FDA line. Building and the positive clinical data for 701 and based on our deep knowledge of DPP biology and cancer, we are pursuing new indications. We're particularly excited about 701's potential in this indication, because it shares many, many commonalities with small cell neuroendocrine cancer. In addition, we're partnering with two premier academic Cancer Institute's to explore 701s potential beyond our company sponsored trials. First with Georgetown Lombardi Cancer Center, and a Phase 2 trial in pancreatic cancer; and secondly, with Dana-Farber Cancer Institute in a Phase 1b/2 trial in AML. So taken together, we're very pleased with the recent progress for our lead immunotherapy program 701 and are excited about the future for OnkosXcel. Net revenue was approximately $238,000 for the quarter, and $375,000 for the full year 2022, which resulted from early product trials and reflects limited market access. Due to the company's direct shipping model to hospitals, wholesaler stocking was neither expected nor occurred. For the full year, the company reported a net loss of $165.8 million, compared to a net loss of $106.9 million for the same period in 2021. Cash and cash equivalents totaled $193.7 million at December 31, 2022, compared to $233 million at December 31, 2021. Please proceed with your question. Secondly, just looking a bit further into the future, just given the progress you are making, what's the potential to provide some sort of revenue guidance in 2024. I'm sorry, we're winning about two-thirds of our formularies in process. And so what that means is, we have 65 out of roughly 100, and that's what we expected. We saw that in market research, and we would expect that to continue. And what we're finding, Colin, is that no doesn't necessarily mean no. In many cases, they just want more experience. So we're not getting the hard no come back in a year, we're getting the -- we want a little bit more information to understand how the offset of cost impacts our hospital system. And then thereafter, in market research, we anticipated that roughly a third of health care providers would trial the drug in the first 6 months. So there is a lag between P&T approval, that's really when we have freedom to operate and generate demand as a sales organization. So there is a -- as I said, there's a protraction in the hospital process. Now TRANQUILITY II enrollment has been completed, that was our primary focus and we wanted to learn as much as we can with TRANQUILITY II. We don't expect trial enrollment to be any different than the TRANQUILITY II, but we have not conducted any trial and we are collecting the data once we have all the data we will provide a guidance when the data readout is expected. And we have multiple quarters under our belt where we know, launch matrix is robust. The revenue as it comes behind that you should be able to add those things up and get a decent idea, but the most right will provide as we get more of a steady ramp up. Please proceed with your question. But so it looks like your sales implies over 2,000 scripts to date used. And you said that there are some orders coming in, I guess, several questions here first. All right, there's quite a bit to unpack there. Typically, we look at reordering patterns and we're not disclosing those metrics. So there could be hospitals that bring in units, and it could be several units, it could be just one of each strength to give it a shot, to see how it works in their patients, where they may be waiting for some type of protocol development in order to help guide them and utilize drugs. So not every carton that's been ordered, necessarily has triggered a reorder yet, but we're still early in the process. So the 7,000 numbers, actually, the number of unique health care providers that we saw year to -- actually launch to date, through both our original and expanded sales organization. Again, we were at over 1,100 hospitals within our target universe that we've seen. We actually around 2,000 hospitals total that we've seen, so we've seen non target hospitals as well, when necessary, and those might be in systems where there are downstream institutions that want to hear from us. But that represents about 64% reach, which is really good considering we just expanded our team back in December. So that's where the 7,000 number comes from. Right now when we look at the P&T reviews in process, there are over 600 or so, in process. Roughly half of those, 280 of those are within our targeted institutions for the original sales team for the original 26, which means it implies that they have almost half of their original targets that are either -- they either have formulary access, or they have those hospitals in process to vote. I think it's a little too early to kind of bifurcate the ordering patterns we've had those that have approved the drug order, now we've had those that have non-formulary access or order. What I can tell you is that once the product is on formulary, it makes it easier for them to reorder, because they're not just trialing the product at the time. Adjusting the cost, we're not considering adjusting the whack price of the drugs. However, it's something that we may do to get access to a broader swath of hospitals, especially those that are not within our target universe. Given that you to turn cold tumors high, you're going to be -- have to combine with the checkpoint inhibitor. How are you thinking about going forward, if you expand in obviously KEYTRUDA is expensive. But as you know to date we have purchased KEYTRUDA on the open market, and that certainly has given us flexibility, since we wouldn't then need to deal with or negotiate with a partner. Please proceed with your question. So what we're hearing from the field is everything that we would expect promise of IGALMI is landing exactly the way that we'd want it to, they're seeing better throughput. They're using it to potentially avoid staff injuries, the onset of action has been everything they thought it would be, they consider it rapid. And of course, providers are seemingly trying this on the worst of the worst. Physician saw patient in 4 point restraints, both wrists, both ankles are shackled to the gurney, and they released one arm to provide the film. And within 15 minutes, the patient was out of 4 point restraints, they were clearly improving, and they were discharged some hours later from the hospital. And it's clearly having an effect in clinical practice and we hope that this fits nicely with the new sort of standards of care, certainly a more humane way to treat people. And I just like to add on top of that, that if you think of our label, it says mild, moderate and severe. Regarding your second question, how -- Greg, this is Vimal. Regarding your second question how we plan to disclose the data, we will follow the company process which we have done in the past. Please proceed with your question. Thanks for taking my questions. One, just wanted to get a better sense of how you think the uptake is going. I think you have done a good job resetting expectations that the uptake would be slow and gradual, given the process on getting into hospital formularies. And then secondly, just wanted to also ask about your efforts to kind of maybe raise the awareness of the product. I think previously, we had an impression that perhaps  made that the product is basically selling itself. But yet I think what we're hearing on this call is that there's now a free drug program, there's clinician targeting campaigns. So the uptake curve, I would think about this way as it takes, again, 6, 12 months for the formulary process to really take place. So for our first 26 reps, recall that re-launch was in July of last year. Thereafter, once you have P&T formulary approval, that's when your uptake curve begins and I just shared some of those data from commercial day earlier. Now keep in mind that our next 44 representatives started this cycle, beginning in December. So their 6 to 12-month window for P&T review and formulary approval is going to be in the May, June timeframe, that's when it's going to start. Theoretically, you shouldn't really see a lot of revenue for the first 6 months of a drug launch in the hospital. Regarding your question about marketing effort and the free trial program, so one of the things that I have said before is that when physicians try it, and they experience  and patients themselves, they see exactly what we're talking about. So we're not a big hat, no cattle, drug launch, this drug delivers as promised. And so doing a free trial program, where there's some pushback on cost or some evaluation that needs to be had to see value in their own hospital. As it relates to the marketing efforts, we want to raise awareness to put additional pressure on the P&Ts and on these formulary decision makers in a hospital. So we have geo-fenced every target hospital in the United States, and they're going to see IGALMI a lot. And that's all part of the process to drive, not just awareness, but pressure on the P&T process  demand. And what I will add, Greg is why you're seeing more marketing effort, because we have 70 member team deployed. Please proceed with your question. Thanks for taking my questions. The first is very specific, and on behalf of investors that might be very sales focused. So, Sumant, that's -- it's a great question. So to answer the question about the 600 hospital P&T decisions in process, I would expect that to happen over the next several months. Certainly, I think we saw this in commercial day that P&T committees may not get through full agenda, may push out their meetings, they may cancel meetings if they don't have quorum. And we expect to not just see those matriculate, to see a lot more come online and take up the votes over the next couple quarters. So your next question about the data cleanup and verification, as you can imagine, we have three data readouts. So realize this is -- although it's a quick trial, it's a 3 months duration for any particular patient. And so there's a range of dosing for patients, some doses or some patients may have only had a couple of doses, other have had many, and we have to do what's called source data verification. So it's anywhere from 8 to 10 weeks of literally daily work by many people to make sure our data is accurate, correct and precise. Please proceed with your question. So I'll just address a very straightforward, there's no additional safety requirements we're doing, in fact, going above and beyond what's necessary to demonstrate the safety. And that is, in fact, why we're taking the lower dose and outpatient setting. In terms of the safety, obviously, we are doing 3-month follow-up monitoring. So if they have more episodes, we are trying to show what the safety and efficacy of the drug is after the primary endpoint is to our  and that's the primary endpoint in terms of the efficacy what we need to show. So in terms of the -- what our current understanding, or what we know as of today is to our endpoint, primary endpoint in terms of efficacy, when 3-month follow-up to show that drug works over a period of time, both in terms of efficacy and safety. Yes, so at home when a patient feels agitation, they're well aware of it. So the patient may take the medication and of course, after a period of time, if there's no improvement, they may be able to take a second dose. In terms of who would be prescribing this, their outpatient mental health provider, typically a psychiatrist or nurse practitioner, et cetera might be prescribing this for them. I mean, so, Eddie, one of the things that we've done we're working on market entry strategy for this. When we look at those prescribers who are either initiating therapy or switching therapy for Alzheimer's dementia patients, roughly half of the prescribers are neurologists. Some are psych and then some are what I put in the primary care bucket, although if they're double boarded, I don't know what they are, they could be in memory centers as well. It could be through PBM  benefit, or Medicaid if they're in that bucket. Please proceed with your question. We have very specific belts and suspenders on quantity, some serve the hospital is not to be able to order more than a very what I'll call a very limited trial program. We want these hospitals to get experience and we want to make sure that they get experienced with the right patients, but we certainly don't want to flood the market with free goods. And then maybe on the TRANQUILITY program, just assuming  need statistical study evidence on the primary endpoint. The primarily in the 3-month period, it's -- if they have another episodes, they get another dose, so that we can demonstrate that if they have episodic agitation, which is three episodes a month, or they start getting into more, three episodes a week, that drug is effective, and that's what we are trying to show in the 3-month follow-up. Of course, the FDA is interested in not just efficacy, but also safety and that is what the study is designed to do. Please proceed with your question. Firstly, I was wondering if you could comment on the degree to which formularies that have said no, but not hard, no, are looking for trends in demand, and what kinds of trends they are looking to see before they reconsider their decision with respect to IGALMI. Secondly, I was wondering if you could comment a little bit about the timing and prioritization of the development of the rest of the neuroscience pipeline beyond 501. And lastly, if you could just clarify whether at this juncture, the potential spin out of OnkosXcel is no longer being considered and you're simply focusing on partnering opportunities for 701. Certainly they're looking for more evidence, specifically in their own institution or institutions to evaluate the value. So whether the value to them is improved throughput, reduction of staff injuries, they just want to see the patient response or response time. Those are the sorts of things that they might be looking for, certainly the more noise in the hospital from their stakeholders that want this drug, that's going to help. And then as we think about the larger systems like the IDNs, they're looking for more of their hospitals to raise their hand and say, I want this in my institution. And certainly we want to create the noise and the groundswell to push them to a decision, positive decision. I've heard from so many sales people that hospital things if they can avoid one injury to a staff member, IGALMI will pay for way beyond. And obviously, like as IGALMI gets used, we are seeing the reordering pattern once people know what value it's bringing, and the case study that Rob presented to you. Now we are seeing that drug is being used in the patient who came completely changed like, and then drug allowed them to get out of that situation within 25 minutes. Coming back to your timing and prioritization on neuro pipeline, 501, 139 million episodes, 16 million already covered with IGALMI, 23 million at home setting and 100 million with Alzheimer's agitation, all investments and plans have been put in place so that we can get two additional sNDAs for at home setting and Alzheimer's and that will expand our market. All of you know it's a $15 billion target addressable market, it's a huge opportunity and we have a leadership position in this space. So we are continuing that, but our AI platform is very productive and it has been generating more assets and we are already announced 502. We are initiating the IND enabling study, and we believe it can go to the clinic in first half of 2024. Partly, there was no bandwidth in the company, whether clinical or regulatory to execute on more things when you are conducting four pivotal trials, like the TRANQUILITY II, TRANQUILITY III, SERENITY part I, SERENITY part II. And normally we will have about dozen product concert before we select our next stage and they are going through a privatization process, one that has happened that will generate a sustainable R&D pipeline outside 501 and 502. So that's the game plan for next 3 to 5 years, focus in neuropsychiatric symptoms as well as the neuro-rare. In terms of the OnkosXcel, I think this is the timing couldn't be any better, time is now. And we have very actively started pursuing both options, partnering as well as seeking independent investment so that OnkosXcel can execute on their business plan and the upcoming plan that Vince has already outlined, a potential Phase 2 pivotal trial at CLC human proof-of-concept and exploring 701 potential outside prostate cancer in pancreatic and AML. Thank you very much. Please proceed with your question. Thanks for taking my questions. Really, just I guess, a little bit more interested in terms of the operating costs for this year. I think, Rob, you talk about a 14 million incremental sales and marketing spend. And also on R&D, obviously, we saw the ramp reflecting the ongoing pivotal studies. Is it sort of Q1 similar levels to Q4 last year, maybe Q1 and Q2, and then dropping away in Q3 and Q4. Our -- if you look at our quarterly costs, it was around $32 million or so in the previous three quarters in 2022 because in Q4 it was a little bit extraordinary because we were conducting multiple pivotal programs and now some of them have completed and some are still continuing. I would say that you should be thinking of the cause if you're thinking not Q4 should be outlier, and what it was in 2022 somewhere in between I would say. So as we go through this year, several of these significant and pivotal trials have start to drop off as you suggest and we should be not burning much money in terms of the sales force thatâ\u0080\u0099s fully deployed. No, we have full commercial operators in place, 70 sales team. We have CAT team, we have marketing, we have commercial operations. Please proceed with your question. I was curious as to whether the fact that they those haven't been secured yet is related more to the timelines with which they run their process or was wondering if you could give color, whether they are providing some sort of pushback, whether it's related to price or any other discussions that are separate from a timeline perspective. We have had discussions with them, but we expect them to be a protracted  process on their side. Thank you very much. Thank you, everyone for joining us today, and for your interest in BioXcel Therapeutics. This concludes today's conference, and you may disconnect your lines at this time."
}