{
    "symbol": "BTAI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 15:22:04",
    "content": "  Operator: Good morning, and welcome to the BioXcel Therapeutics Third Quarter 2022 Financial Results Conference Call. After the presentation, there will be a question-and-answer session. Just to remind everyone, certain matters discussed in today's conference call and/or answers that may be given to questions asked are forward-looking statements that are subject to risks and uncertainties related to future events and/or the future financial or business performance of the company. Risk factors that may affect future results are detailed in the company's quarterly report on Form 10-Q for the quarter ended June 30, 2022 which can be found at www.BioXceltherapeutics.com or on www.sec.gov, which will be updated in its quarterly report on Form 10-Q for the quarter ended September 30, 2022. As a reminder, today's conference is being recorded. Joining us on today's call are Dr. Vimal Mehta, Chief Executive Officer; Richard Steinhart, Chief Financial Officer; Matt Wiley, Chief Commercial Officer; Dr. Rob Risinger, Chief Medical Officer of Neuroscience; Dr. Frank Yocca, Chief Scientific Officer; and Dr. Vince Oâ\u0080\u0099Neill, Chief Medical Officer of Oncology. It is now my pleasure to turn the call over to Dr. Mehta, the CEO and Founder of BioXcel Therapeutics. In the last few months, we have transitioned to a commercial organization and successfully launched IGALMI. We continue to fully execute on our land and expense strategy for lead program, BXCL501 to build our neuroscience agitation franchise. In that regard, we have multiple pivotal data readouts from our ongoing trials expected in the first half of 2023. This consists of 139 million episodes in total for our first three indications, including bipolar disorder, schizophrenia and Alzheimer's. There are approximately 16 million agitation episodes of these conditions in the US annually, which are treated in the institutional medical setting. In short, we are leading new trails in the agitation market. We recently hosted a commercial days and clearly outlined the evolving agitation market dynamics, positive initial momentum and launch performance matrices. Within the first four months and with only 26 reps initially covering 700 target hospitals, we have already observed increasing market access, efficient targeting and highly favorable market drivers. We recorded our first product revenue, and are pleased to have extensive market reach and hundreds of formulary reviews scheduled in hospitals within a short-span. Based on these factors, we made the strategic decision to expand our sales footprint across all major geographic markets. By December 1st, we will increase our sales force and deploy a total of 70 reps to cover approximately 1,700 target hospitals. To drive additional awareness and understanding of IGALMI, our medical affairs teams have been actively engaging with the Medical Community and P&T committee members in addition to participating in leading industry conferences across the country. We believe all of these efforts will facilitate formulary approvals, our key focus that will result in demand generation. Our Chief Commercial Officer, Matt Wiley will walk you through our launch progress to-date and will review the launch performance basis shortly. In addition to our loan progress, our robust clinical pipeline is advancing rapidly. We are extremely enthusiastic about our indication expansion opportunity in Alzheimer's-related agitation, with an estimated $100 million annual agitation episode in the U.S. and no current FDA approve therapies for these patients this represents a large and growing unmet medical need. Also, we will be initiating the TRANQUILITY 3 pivotal trial by the end of this year. Truly, a pipeline within a product, BXCL501 also continues to be evaluated as an adjunctive treatment for Major Depressive Disorder, or MDD. BXCL701, our lead program is a systemic activator of indemnity in development for aggressive forms of prostate cancer in combination with KEYTRUDA. We are pleased about the promising data for 701 in small cell neuroendocrine cancer or SCNC, recently presented at the Prostate Cancer Foundation Scientific Retreat. Recall, there is no FDA-approved treatment in SCNC and a high mortality rate. In addition, today at Sydney, we are presenting data on potential predictive biomarker for 701 in patients with leukemia, including acute myeloid leukemia. For 501 in this quarter, we had two new US patents issued, two US notices of allowance and seven patents from foreign offices. We expect these patents will be included in FDA's approved drug products with therapeutic equivalent evaluation, which is commonly known as Orange book. Additionally, for 701, we had eight patents allowances/issuances received from foreign offices. In closing, BioXcel Therapeutics has had a remarkable quarter. We are developing a leadership position in the agitation market, have multiple upcoming data catalysts and are well positioned for growth in 2023. I would now like to turn the call over to Matt Wiley, to review our launch progress. Thank you, Vimal, and good morning, everyone. As we reported in our Commercial Day a few weeks ago, we are making very good progress on our IGALMI launch efforts. These efforts are continuing to pay off, and I'm pleased to share some additional updates with you today, specifically in relation to our launch performance metrics. As we have mentioned in previous communications, the typical contracting time frame of GPOs averages six to nine months. We are now contracted with two GPOs, including the largest in the country, covering nearly 50% of the bed in our target universe. As a reminder, the three largest GPOs represent over 90% of our target beds. In tandem, we continue to engage with integrated delivery networks, or IDNs, focusing on those systems that exert high control to drive further downstream utilization of IGALMI. As part of our ramp-up efforts, we've deployed a team of corporate account directors dedicated to coordinating with our sales team and driving the formulary and contracting activity. In the first wave of our sales deployment, we chose 26 high-volume territories covering 700 target accounts and received resoundingly positive traction. These positive results give us great confidence to deploy our full 70-person sales force, targeting approximately 1,700 hospitals. To ensure ongoing optimization and informed deployment of our field force, we have taken a unique approach to our sales strategy by building out a database of 81 billion records spanning more than five years. With this data lake, we are able to examine and refine our targeting methodology by building a hierarchy of target hospitals informed by the location and frequency of agitation episodes. To date, our peer-to-peer programs have engaged over 1,000 HCPs at speaker venues and conventions. And the IGALMI now available digital campaign has yielded significant engagement with over 140,000 visits to our HCP website. Just a month or so ago, new data from the American College of Emergency Physicians was released, showing that more than half of emergency room physicians have been physically assaulted, with one-third sustaining an injury. The dynamic provides a nice tailwind for going to enter the market, highlighting an additional and previously underappreciated value proposition. In summary, the market conditions and IGALMI receptivity are setting us up for success in 2023 and beyond. We have 21% of the Target IDN beds scheduled to vote with nearly 41,000 target beds and an additional 15,000 Tier 2 beds in progress. Additionally, we have over 120 out of 700 target hospitals scheduled for P&T vote, and nearly 350 P&T votes for Tier 2 hospitals in process. Both the IDN and P&T scheduled votes have improved since we last reported these figures on Commercial Day, and we expect these votes in process will continue to climb. Additionally, we have added positive formulary wins since our last readout, and we'll provide more specific details on this metric in future calls. Now, I'll turn the call over to Richard, who will give a financial update. Net revenue for the quarter was $137,000, driven primarily by early trial of IGALMI with limited market access. Due to the company's direct shipping model to hospitals, no wholesaler stocking was expected. The increase in R&D expenses was primarily attributable to an increase in clinical trial costs as the company expanded its BXCL501 clinical program for Alzheimer's related agitation, schizophrenia and bipolar-related agitation at-home use and MDD. Cash burn for the quarter was approximately $31.5 million, which is consistent with the first two quarters of 2022. As of September 30, 2022, cash and cash equivalents totaled approximately $232.3 million. Now, I'd like to turn the call back to Vimal. Your line is now live. Thank you for your question. So, Greg, those are currently scheduled between now and the end of the year or into Q1 of next year. So we would expect that should those agendas actually go to vote on time, which these things can get pushed, but typically, we would expect the majority of them to happen on time, then they'll go to vote. And once the decision is made to put IGALMI on formulary, one of the things that I had provided in the Commercial Day is the expectation of uptake. And so, over the course of the year, both emergency department physicians and psyches, the majority of them would expect to try IGALMI within that first year post formulary access. And then on the OnkosXcel side, what are your expectations for the differences between the 701 monotherapy arm and the KEYTRUDA combo. So, I think, the bottom line is, we don't know how 701 will behave as a monotherapy in a cold tumor. We know 701 has single-agent activity in a hot tumor, and that's now a normal and that was data generated by Point  Therapeutics quite some time ago. We do know from the preclinical work that we've done, extensive preclinical work and we presented a lot of that. And we don't know, but we think that primarily fundamentally, it is the synergy between the two drugs. Well, thanks for taking questions and congrats on the progress, again. Your line is now live. Hey, good morning and thanks for taking my questions and congrats on the continued progress. I know this is a much debated topic, but I think it's an important one from an investor standpoint. Thanks, Colin, for your questions. So regarding the sales guidance, as I said that we are in -- currently unprecedented area, because a product like IGALMI with a novel mechanism of action has never been launched in an institutional setting. And once we build robust confidence in those matrices, based on that, we will start providing the guidance. So Colin, I think the way I would frame it up is this. I mean, we said that the process for formulary access typically takes 6 to 12 months. Certainly, getting on formularies when we can truly open up true demand driving activities. Now we do know, and I mentioned this earlier, that there are uptake expectations and trial expectations based on market research. And just dovetail on Vamil's point, this is unprecedented. And so we're breaking new ground here, but we feel really good about the response we're getting. We have completed the full cohort of now 28 patients, and that data is now getting analyzed and will be presented early next year. With this data in hand, we will explore all the possible strategic options, including partnering as well as third-party investments. We are very excited with the progress for 701, what we have seen in SCNC. Your line is now live. Well, I mean -- so first of all, thanks for the question, Robyn. Of course, directors are former are always going to question the price, but that isn't truly a negative. And actually, when we think about the value proposition of IGALMI and the potential for either throughput or the reduction of staff injuries and things of that nature, administrators and hospital pharmacists do understand that value. The expectation in just reading through the product profile and hearing our IGALMI story, they truly do understand the value proposition. Keep in mind that prior to launch, we conducted market research where we provided just a product profile. And just based on that product profile, the intent to use the drug was 20%, after we told the complete story that we're now using in the field that doubled. That's a pretty compelling set of market research, and that's playing out in the field. So Robyn , we're doing the work now to create a market entry strategy. Suffice to say, the early market research that we're seeing is very compelling and that there's definitely an unmet need in this market. And it's a different market dynamics, because it's been not in an institutional setting. So as Matt said, we are developing a market entry strategy and we lay it out more close to our data readout. Thank you for your question. There's -- yes, I think the first part of your question, are we seeing any geographical adoption or concentrations geographically. So we know, for example, it will improve or augment sleep and treat insomnia. For example, we know that patients reported regardless of the illness we've studied, they reported an improvement in anxiety. So this is, again, our strategy to move the medical setting, and this will be at home setting like our SERENITY III program. Your line is now live. The study is ongoing, the daily dosing study in healthy volunteers, the fact that it's ongoing, and we continue to enroll cohorts testing greater and greater doses. We've not run into a stopping criteria, whereby you would not dose the next scheduled cohort. When we reach that point, we'll then be testing it in conjunction with an SNRI. So turning now to your first question about TRANQUILITY, the readouts for the TRANQUILITY 2 study will be very similar to what we reported for TRANQUILITY 1. We will also be reporting some of the efficacy measures that are secondary or exploratory for example, the Pittsburgh Agitation Scale and clinical global improvement. So just Yatin, to add to what Rob said, it is pretty much a similar study, what we have seen in TRANQUILITY 1, which forms the basis for breakthrough therapy designation with the FDA. So pretty much everything is same except here, we are following up for three more months after first dosing each patient. Your line is now live. And certainly, you have been telegraphing for some time, that it would be slow and gradual. So as we think about the fourth quarter and perhaps into 2023, should the expectation be that it will be kind of similar to this and then there's a kind of inflection maybe after year 1. So Graig, it's Matt. So as we mentioned at Commercial Day and reiterated again this morning, we have over a dozen formulary wins. And so the expectation of uptake after formulary win, you know, you can kind of look back in the market research we did to see what that looks like. We will have 70 deployed by December 1, and we think that that's going to have a meaningful improvement and acceleration on all of these metrics. And certainly, we feel really bullish about the early signs that we're seeing. Maybe my other question just has to do with the 137,000 in sales that you did, in fact, record by the math, if you divide by 105, it's about 1,300 strips. But if you could just give us a sense of when you expect those clinical programs to reach full enrollment, that would be helpful. So, hey Ram, it's Matt. So, on the wholesaler stocking question for future indications, typically, when you go into a retail setting, you would go full line in the channel, which means that we would stock the wholesalers and there'd be some stock inventory there. And then secondarily for Alzheimer's dementia, we would have to cross that same bridge. So, I think as we get our market entry strategies in a more complete form, we can communicate that out to you at a later date. But if we go full retail, you would expect to see that there'll be some wholesaler stocking in the distribution centers. As you can see, we already had DSM meeting and that normally happens like when you have a well advanced in your clinical trial. So, enrollment is progressing well. As I indicated, there are two components, after first dosing, patients are followed for three months. So, we are well into that process and lots of patients have completed the three-month period as well. In addition, for -- that was for the TRANQUILITY II. SERENITY III, we'll be initiating before the end of this year. SERENITY III recall is similarly designed to SERENITY I and II, our pivotal trials, which enrolled in a matter of months, even during the peak of COVID, perhaps because of isolation, but we have now opened enrollment in the SERENITY III to both bipolar patients and patients with schizophrenia. So, we believe we're using the same site, same design, same raters. We believe this will be equally, if not faster enrolling than our pivotal trials were. Your line is now live. Right now, we have about 40,000 of our targeted IDN votes in process. To date, we have not had any negative response for IDN votes. I did not, Kyle, get your second question. But patients, we've only spoken to hospital pharmacists that have observed some of the velocity with IGALMI. And so the feedback that we're getting from them is that the drug is working as expected that the patients are able to take it, and that we've seen some improvements in discharge time, et cetera, and that it's well-tolerated to the profile that we present. Well, I mean, I think one of the things that our guest speaker at the Commercial Day expressed that the P&T committees handle a lot of things beyond just drug evaluation for formulary inclusion, a lot of things. And so because the agendas and schedule can change, those are risks to getting formulary approval. And assuming that they have a quorum, we would expect to be reviewed, and we believe that we put ourselves in a position for a positive formulary review. Your line is now live. We saw a very consistent dose-dependent response and we compare, for example, SERENITY I in patients with schizophrenia with Serenity II in patients with bipolar disorder and there's very little, precious little difference in their response. So knowing that it's a very consistent response, the FDA has agreed that we can enroll both patients with bipolar disorder or patients with schizophrenia in the trial. We have a total N, I believe, it's not on clinic trials that got it will be very shortly. Again, we know it's a very high effect size, number needed to treat in the range of two or three. And these are pretty much same CRO like same size, similar size pretty much. I think once we have our first patient dose and we have good handle on the TRANQUILITY full enrollment then we will be able to provide guidance on TRANQUILITY 3 data readout, when the data readout is expected. But as you can see, size is pretty much similar to TRANQUILITY 2 and how long did it take us to complete the TRANQUILITY 2 starting from first dose -- patient dose, which was somewhere around May timeframe. Thank you, everyone, for joining us today and for your interest in BioXcel Therapeutics."
}