{
    "symbol": "NSIT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 02:11:05",
    "content": " For our consolidated results, net sales in the second quarter were $2.7 billion, up 26% in constant currency and up 23% in U.S. dollars compared to the second quarter of 2021. Services net sales in the second quarter grew 16% year-over-year, with Insight delivered or core services growth of 15% and partner and cloud services growth of 17%. Services gross profit increased 16% year-over-year, driven by growth in Insight core services and partner and cloud services. Adjusted earnings from operations for the second quarter were $142 million, up 49% year-over-year in constant currency and up 45% in U.S. dollars. For the second quarter, adjusted diluted earnings per share was $2.78, up 5% in constant currency and 46% in U.S. dollars year-over-year. North America had an outstanding second quarter with record net sales of $2.2 billion, up 28% year-over-year. Gross profit in North America in the second quarter increased 26% year-over-year and gross margin at 15.6% was down 20 basis points, primarily driven by changes in product and services mix. Services gross profit increased 23% year-over-year, primarily driven by Insight core services and cloud solutions. Selling and administrative expenses increased 14% year-over-year, driven by higher personnel and variable compensation costs, primarily from higher gross profit and our investment in solutions and services teammates. On to APAC, net sales of $70 million in the second quarter increased to 41% year-over-year in constant currency, driven by software, hardware, Insight core services, and cloud solution sales. Gross profit of $18 million increased 35% year-over-year in constant currency, primarily due to higher gross -- higher profit sales in services and higher volume of cloud solutions. In the first half of 2022, the decrease in cash flow from operations activities was primarily driven by growth in hardware net sales, changes in partner mix, including increased volume with distributors with early payment terms, and securing inventory for future client projects."
}