{
    "symbol": "NSIT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 14:34:01",
    "content": " Our adjusted EFO margin expanded by 40 basis points to 4.2%, and we generated operating cash flows of $236 million in the quarter. Net sales in the third quarter were $2.5 billion, up 6% in constant currency and up 4% in U.S. dollars compared to a very strong third quarter of 2021. Tenet gross profit increased 9% year-over-year, driven by growth in sales of software and improved margins on hardware net sales, which expanded with higher margin infrastructure sales and lower device sales. Services gross profit increased 10% year-over-year, driven by good third quarter. Adjusted earnings from operations for the third quarter were $107 million, up 16% year-over-year basis for the third quarter. For the third quarter, adjusted EBITDA was $112 million, an increase of 11% year-over-year, and adjusted EBITDA margin was 4.4%, up 30 basis points over prior year. For the third quarter, adjusted earnings per share was $1.99, up 8% in constant currency and 6% in U.S. dollar terms year-over-year. Our cloud gross profit was $312 million, up 23% and was 19% of consolidated gross profit, up 140 basis points from prior year. North America had a strong third quarter with gross profit increasing 12% year-over-year and gross margins at 15.8%, up 110 basis points, driven primarily by changes in product and services mix. Selling and administrative expenses increased 14% year-over-year, driven by higher personnel and variable compensation costs, primarily from prior gross profit and our investments in solutions and services . On to APAC, gross profit of $15 million decreased 21% year-over-year in constant currency, primarily due to higher volume of cloud solution. This led to adjusted earnings from operations of $4 million in the quarter, up 5% from constant currency. As we discussed on our second quarter call, the slower growth in hardware in this third quarter versus prior quarters this year, we generated $236 million in cash flow from operations. Our 2027 metrics are EBITDA margin in the range of 6.5% to 7%, return on invested capital greater than 25%, a cloud gross profit CAGR in the high teens, core gross profit CAGR also in the high teens, adjusted diluted earnings per share CAGR approaching 20% and free cash flow as a present of adjusted net income greater than 90%."
}