{
    "symbol": "NSIT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 07:43:49",
    "content": " With supply constraints somewhat easing for devices, hardware net sales grew 27% year-over-year which was higher than expected. Net sales in the first quarter were $2.7 billion, up 22% in constant currency and up 21% in U.S. dollars compared to the first quarter of 2021. Services net sales grew 14% year-over-year, primarily driven by Insight delivered services. Product gross profit increased 18% year-over-year, driven by growth in sales of devices, as I mentioned and services gross profit increased 10% year-over-year. Adjusted earnings from operations was $90 million, up 31% year-over-year also up 19% on a GAAP basis to $80 million. First quarter net sales were a record $2.1 billion, up 25% year-over-year, driven by a 31% increase in hardware net sales. Product net sales grew 26% year-over-year, primarily driven by hardware net sales and more specifically devices. Services net sales grew 15% year-over-year, primarily driven by Insight-delivered services and higher sales of software assurance. Gross profit in North America in the first quarter increased 18% year-over-year and gross margin was 14.5%, down 80 basis points, driven by the mix of products and services. Product gross profit increased 24%, driven by growth in the sales of devices, as I mentioned and services gross profit increased 12% year-over-year. Selling and administrative expenses increased 14% year-over-year, driven by higher personnel and variable compensation costs associated with higher gross profit and our investments in solutions and services teammates. Net sales of $55 million in the first quarter decreased 3% year-over-year in constant currency, driven by a shift from software to Cloud solutions. Gross profit of $14 million increased 23% year-over-year in constant currency, primarily due to higher profit sales in services and higher volume of Cloud solutions. In the first quarter of 2022, the decrease in cash flow from operating activities was primarily driven by growth in hardware net sales and changes in partner mix, including increased volumes with distributors with early payment terms. This outlook assumes interest expense between $30 million to $35 million and effective tax rate of 24% to 25% for the full year 2022; capital expenditures of $65 million to $70 million, including final completion of our new corporate headquarters and an average share count for the full year of 35.6 million shares."
}