{
    "symbol": "SKX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 21:56:04",
    "content": " However, macroeconomic headwinds, including foreign currency exchange rates, and congestion within our distribution centers due to the strong demand for our products and supply chain disruptions over the past year, impacted our reported results in the third quarter, and we expect will remain a factor into the new year. We remain focused on executing our long term growth strategy and delivering a diverse assortment of innovative, comfortable products for consumers across the globe even as we navigate historic headwinds from supply chain disruptions, ongoing COVID related restrictions, inflationary pressures and growing uncertainty around the macroeconomic environment and its impact on consumers. While we look ahead to our goal of 10 billion in annual sales by 2026 we remain focused on the here and now delivering fresh product as quickly as possible, creating awareness of the innovations and features in each collection and increasing the opportunities to shop or brands be it at our expanded network of direct to consumer locations, including a retail base of approximately 4,450 locations or through visible spaces within third party stores. In regards to the incremental 50 million we quantified, I think most of that long term is going to go away as efficiency works its way back into the system but as we mentioned, and we have mentioned for a while now weâ\u0080\u0099re experiencing severe congestion from supply chain issues and thatâ\u0080\u0099s giving rise to the need to spend in order to make sure weâ\u0080\u0099re preserving as best we can our customer delivery went down and working our way through that inventory. The one note I would give you, though, on the plus side, and I think David mentioned in his remarks we are starting to see some favorable trends on freight rates, container rates, that will work its way into the P&L over time, because weâ\u0080\u0099re still, we still have the inventory that we imported under the higher rate structures, but in terms of green shoots in the supply chain, thatâ\u0080\u0099s one of the more encouraging ones weâ\u0080\u0099ve seen. There are also some big unknowns, though I think, again, the Asia-Pacific region is going to be a big unknown for us, given how COVID has continued to have an effect on that marketplace, but overall I would consider our view to be cautiously optimistic, and getting more optimistic as we continue to see demand at the consumer level fairly robust for Skechers. So as you know weâ\u0080\u0099ve some of our key markets were also those most significantly impacted by negative foreign currency movements, and with nearly 60% of our sales from outside the United States, that FX impact is going to be felt throughout our key metrics and ASPs are certainly one area, otherwise, on a constant currency basis, we actually felt pretty good about AFP performance."
}