{
    "symbol": "CTMX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 20:40:06",
    "content": " Our collaborative work with Bristol Myers Squibb continues, including the randomized Phase 2 study of BMS-986249 and we're also well underway with Phase 1 dose escalation for CX-904, our EGFR CD3 T-cell engaging bispecific. BMS previously reported Phase 1 safety data for 249 at ASCO 2020, showing the CTLA-4 targeting Probody was well tolerated at elevated doses both as monotherapy and also in combination with nivo. We're proud of the significant progress we continue to make building on the consistent achievement of technical milestones, including six INDs filed across three therapeutic modalities, four programs that have advanced to Phase 2 studies and more than 500 cancer patients who have been treated with our product candidates to date. So I think as we've discussed previously in the data release that we presented towards the end of last year, just to recap that data, we presented -- announced data on 16 efficacy-evaluable patients towards the goal ultimately of enrolling 25 in that particular cohort. We will be -- now that the -- as we've announced today now that the enrollment into the -- all three of the solid tumor cohorts specifically head and neck lung and esophageal has been completed, we'll obviously be sitting down with our partner AbbVie later in the year to review data and start to think about next steps and disclosure strategy will be a part of that discussion as well. So I think, you're referring to we've previously discussed and in fact we presented some data on a program we call CX-2043 an anti-EpCAM Probody drug conjugate or conditional ADC with the payload -- the maytansine payload DM21. So something that we continue to learn about continue to evaluate in regards to understanding mechanistically the anemia and also potential mitigation strategies, we've discussed this quite a bit in the past in our previously reported clinical work, the anemia has been managed through various means, including dose reductions, dose delays, erythrocyte stimulating agents."
}