{
    "symbol": "CTMX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-27 19:51:05",
    "content": " We encourage everyone to read today's press release and the associated materials, which include the 2022 10-K and 2021 amended 10-K, which have been filed today with the SEC. Please also note, the comments made in this call regarding the companyâ\u0080\u0099s financials reflect restated financial statements as outlined in our most recent SEC filings today. With me on the call today is Dr. Sean McCarthy, CytomX's Chief Executive Officer and Chairman. On today's call, I'll provide an overview of the company's therapeutic pipeline, including status updates for our emerging programs, CX-904, CX-801 and CX-2051. At CytomX, we believe that as biologic anticancer therapies become more and more potent, the need for localizing empowered modalities such as antibody-drug conjugates, T-cell engagers and cytokines into cancer tissue becomes increasingly important as a way to improve therapeutic window. We aim to realize our vision for the benefit of patients by leveraging our Probody platform to create high impact therapeutics that are localized to diseased tissue, thereby reducing systemic toxicities and maximizing overall benefit. Since our early years, CytomX has pursued a consistent strategy focused on long-term company build around the Probody platform and maximizing impact for patients. Our substantial investments to date have allowed for broad clinical evaluation of our platform, have resulted in a uniquely strong scientific foundation and a deep pipeline of therapeutic candidates positioned to deliver significant near and long-term value. We currently have more than 15 active Probody therapeutic programs, including three clinical stage molecules and we expect to file two new INDs for wholly owned programs later this year. CytomX entered 2023 with robust financial resources and funding into 2025, positioning the company to execute towards multiple milestones over the next 12 months to 24 months. Our lead program in this area is CX-904, a clinical stage Probody T-cell engager targeting EGFR and CD3 partnered with Amgen in a global co-development alliance. The primary goal of dose escalation for this drug candidate is to assess safety and we aim to reach dose levels and exposures by the end of 2023, which we can start enrollment into back law cohorts in certain EGFR positive tumors. Looking ahead to 2024, a key milestone on the horizon will be the selection of recommended Phase 2 dose and the potential decision to initiate Phase 1b expansion cohorts in EGFR positive tumors. CytomX would then be responsible for the execution of expansion cohorts and upon the conclusion of the expansion phase, Amgen will take over global development with CytomX retaining certain co-funding, co-development and co-commercialization rights. Staying with T cell engagers, we were delighted that in January 2023, our partner Astellas nominated the first collaboration clinical candidate triggering a $5 million milestone payment to CytomX. CytomX and Astellas are also collaborating on additional T cell engagers and CytomX is eligible to receive future preclinical, clinical and commercial milestones across these programs. In November 2022, CytomX has had a multi-target R&D collaboration with Regeneron to discover and develop new bispecific immunotherapies. Regeneron has considerable efforts in T cell bispecifics and both companies see opportunities to broaden the reach of T cell engagers by utilizing CytomX platform to localize these highly potent agents to tumor tissue, widening therapeutic window. Given Regeneron's acknowledged high bar for external innovation, this collaboration is yet another point of validation of CytomX scientific and platform expertise. Starting with CX-2051, our conditionally active Probody ADC targeting EpCAM. EpCAM has been regarded as a high potential target for decades and has been clinically validated by others, but clinical activity has only been achieved with local administration. We have optimized masking, protease cleavability, and we have selected a camptothecin derivative, topoisomerase 1 inhibitor in the  class as the payload for this program and with a drug antibody ratio of 8. The EpCAM (ph) payload class has shown exciting clinical results with ADCs, including N HER2 and Trodelvy, and we really think this payload is an optimal choice for this program. CX-2051, however, when systemically administered has demonstrated a wide predicted therapeutic index and strong preclinical activity in multiple preclinical models including colorectal cancer. Turning now to CX-801, our dually masked interferon alpha-2b, the lead program within our broad efforts in the cytokine field. Interferon alpha-2b is an approved immunotherapeutic that has demonstrated clinical activity in multiple cancer types, and we believe provides a potentially superior approach to activating anti-tumor immune responses than cytokines such as IL-2, IL-12 and IL-15. Interferon alpha stimulates antigen-presenting cells to activate cytotoxic T cells and combines effectively with checkpoint inhibition, offering tremendous potential to unlock checkpoint refractory and/or resistant cancers. In data presented at 16, 2022, we demonstrated that CX-801 has a wide therapeutic index and an enhanced tolerability profile compared to unmasked interferon. At CytomX, we have had a long-standing interest in leveraging the unique molecular properties of CD71, the transferrin receptor as an anti-cancer target. Our goal is to use our Probody platform to open a therapeutic window for this high potential, but previously undruggable target. We partnered the program with AbbVie,  back to 2016 and that was focused on the advancement of CX-2029 into IND-enabling and clinical studies. Under the collaboration agreement, CytomX was responsible for early development up to the completion of cohort expansions and with AbbVie being responsible for later-stage development. We have made substantial progress since this alliance started, and in January this year, we announced updated results from the cohort expansions, which included encouraging clinical activity in unselected heavily pretreated patients with tumors of squamous histologies, including a 21% confirmed response rate in squamous esophageal cancer. Our January data update for CX-2029 essentially marks the conclusion of CytomX's responsibilities for execution of the clinical program within the AbbVie alliance, and the data has been under evaluation at AbbVie in recent months. AbbVie informed us on March 21 that they do not plan to advance CX-2029 into further clinical studies for strategic portfolio reasons, and the alliance will conclude. CytomX regains full rights to CD71 and has an exclusive option to reacquire full rights to CX-2029, and these discussions are underway. While we are disappointed with AbbVie's decision, in our work to date on CD71, we have pushed new scientific boundaries and demonstrated for the first-time that targeting CD71 with an antibody drug conjugate can lead to tumor shrinkage in late-stage cancer patients. Going forward, CytomX will be evaluating next steps for CX-2029 while also continuing to pursue next-generation strategies to targeting CD71. Our alliance with BMS has continued to make progress, and I would like to take a few minutes to cover the latest updates on the CTLA-4 program. At their earnings call a few weeks ago, BMS announced their prioritization and advancement of the non-fucosylated Probody, 288, which is now the leading edge of their next-generation CTLA-4 program. At SITC in 2022, BMS presented Phase 1 data on 218, which is the non-fucosylated antibody that underlies 288, showing intriguing activity, including in microsatellite-stable colorectal cancer. The 288 Probody is being advanced to Phase 2, and we look forward to future updates from BMS. Lastly, I'd like to reemphasize our most recent collaboration with Moderna, which highlights CytomX's continued innovation, breadth and pioneering efforts in the field of conditional activation and also our continued ability to leverage partnering as a financing vehicle for our company. We're excited to have already kicked off this collaboration, which brings together two leading platforms to research and develop mRNA-encoded conditionally activated biologics. CytomX and Moderna share a vision of investing at the intersection of biology and technology to transform the lives of patients in oncology and also in non-oncology therapeutic areas, and we look forward to doing great things together. CytomX entered 2023 with a strong balance sheet with $194 million in cash, cash equivalents and investments as of December 31, 2022, which we project will fund the operations of the company into 2025. We continue to operate from a position of financial strength, and our recent collaborations continue to highlight CytomX's ability to leverage its differentiated science to bring capital into the company and build long-term value. I would like to note that my comments regarding the financial statements refer to our most recent SEC filings, which include restated financial information from 2019 to 2022 as a result of a change in our revenue recognition accounting method for certain collaboration agreements. Also, the restatement has no impact on the company's current cash position or cash flows. Revenue in 2022 was $53.2 million compared to $37.3 million in 2021, driven by higher estimated percentages of completion for research and development programs in the company's collaborations with AbbVie and Bristol Myers Squibb. Overall, full year 2022 expenses related to the company's restructuring, which was announced in July of 2022 were $7.7 million. Our progress with CX-904, taken together with our exciting collaborative efforts with Regeneron and Astellas positions the company with significant ongoing efforts in T cell engagers and an opportunity to make an important impact in one of the most promising areas of oncology R&D. We also continue to invest in cancer immunotherapy strategies through our work on CX-801, our conditionally active interferon alpha, which is on track for IND filing this year. As we assess potential next steps for the CX-2029 asset and our CD71 program more broadly, we're also excited to advance our latest ADC, CX-2051 targeting EpCAM towards IND filing. Your line is open. Sean, you mentioned you potentially will go through the dose escalation by the end of this year and moving into the expansion next year. With an agent like this really, like, any T cell engager, the stepwise dose escalation, these are highly potent molecules and the selection of doses to move forward. I think these days, we need to be even more thoughtful about this, given FDA's guidance with Optimus and how to think about MTD, how to think about RP2D. We're on track with manufacturing steps with toxicology programs, and everything remains on track for our guidance for these INDs being filed this year. In terms of tumor types, let's take EpCAM first. And that's one of the reasons that we've selected the camptothecin payload, which we think is well matched to that tumor type, given the high target expression as well. But there are many other tumor types that we could potentially move into, including pancreatic, ovarian, to name just two. Our strategy there with 801, given the potency of interferon alpha as an immunotherapy is to work in the area of increasing antitumor immunity, turning colder tumors into warmer tumors, turning warmer tumors into hot tumors and there will be several opportunities to pursue there. Maybe just one last question, and I will hop back on the queue, is for the CD71. Since you are regaining the rights for this target and potentially for the entire 2029, so you talk about the next generation for CD71, and that we know the anemia is on target kind of probability finding you have been observing. And so, with regard to -- let's maybe start with the 2029 data. This is an ADC, a very novel ADC that has shown antitumor activity in several tumor types, and most recently, this really intriguing signal in squamous esophageal. Your line is open. So, the target -- the program broadly, as far as the target is concerned, reverts to CytomX. 2029 as a Phase 2 asset, we have an exclusive right to negotiate full rights back from AbbVie and those discussions have been initiated. And then under the AbbVie -- the original AbbVie agreement, they had chosen a second target a couple of years ago. But the collaboration is structured such that we are responsible for certain discovery and lead authorization efforts, and Moderna will be responsible for development and commercialization with milestones and royalties coming to CytomX. One moment while we prepare for the next question. Your line is open. And then, there's 288 which is the Probody version of 218, the non-fucosylated. So the clinical data that BMS has presented previously relates to, as you rightly point out, to 249's Phase 1 study and also the 218 Phase 1 study. With the Probody 249, the Probody version of ipi, the dose escalation was able to achieve really very high levels of the mass ipi. And you can see how -- and I think this is pretty consistent with the work we've done over the years in the clinic that the masking shifts the dose response curve for toxicity, so they can get to higher levels and still have a well-tolerated drug. The other aspect of the Phase 1 data, and this was really the update last year at ESMO, clear evidence of clinical activity for 249 demonstrated in that poster presentation, including a response in MSS stable CRC, which was highlighted as a case study. The 218 poster was important, I think, for several reasons, demonstrated again that 218, the non-fucosylated ipi is clinically active. The other noteworthy data from the 218 poster is that this drug, you can see how it's a lot more potent. And the prioritization of 288, the masked version of that 218, I would think has the potential to evaluate higher doses of the non-fucosylated in mask form. And then, yeah, just I was also curious if you have any visibility in terms of -- or should we assume that the current ongoing studies with the 249 will sort of stop enrolling patients and going forward and that's it. One moment while we prepare for the next question. Your line is open. I can't really comment on the 2029 negotiation for obvious reasons at this point other than to say that those discussions have been initiated, and there's a process laid out in the contract that we negotiated some years ago for how to go about that. The signal that we've seen there, one of the intriguing features of esophageal that relates to the target is published data from others showing or suggesting that CD71 is amplified in certain squamous esophageal tumors. And that is something that we're aggressively pursuing, as to figure out whether there's a potential patient selection strategy there. So speaking in general terms, of course, given the high incidence of anemia that we have with this drug, but also given its clinical activity, if we elect to move the drug forward in esophageal, letâ\u0080\u0099s say, obviously, weâ\u0080\u0099d be wanting to do everything we can to select patients in our favor to increase the likelihood of response and also, of course, continue to work to find ways to manage and mitigate anemia to give the drug its best chance of future success. One moment while we prepare for the next question. Your line is open. Just to reiterate what we've communicated on cash runway in the prepared remarks, so we reported $194 million of cash at the end of the year. As I mentioned, that does not include the Moderna upfront payment of $35 million received in Q1 of 2023 nor the Astellas milestone that we achieved of $5 million in January of this year. From an overall capital allocation and resourcing perspective, we communicated in the summer of last year the focus on CX-904 and the next-generation pipeline. Like, as we mentioned in the comments earlier, the -- both the AbbVie and Amgen alliances have been structured in a way that we -- without we had, I guess, now we're obviously concluding that relationship that we had with Amgen, we have the opportunity to invest in later-stage development. So as Chris mentioned, current financials and guidance is really focused on advancing the earlier-stage programs to key near-term assets. One moment while we prepare for the next question. Your line is open. And then if you could maybe speak to sort of maybe the safety tolerability differences potentially between 218, the antibody from Bristol and the ipi sort of AE profile, which we now know are fairly, notorious, if you could maybe talk a little bit about that as well. So first of all, with regard to the 288 leapfrog as you put it, they have been pretty clear that they have prioritized 288 over the other programs, and the advancement from Phase 1 to Phase 2 reflects that. I think if one looks at the broad landscape of CTLA-4 next-gens that are being pursued by various parties, there is a move towards more potent versions of anti-CTLA-4 antibodies using strategies like FC enhancement or in the case of BMS, non-fucosylation, which are functionally very similar. With regard to safety of 218, again, I think the question would be much better answered by our partner. I would just observe from the data that we've seen in their presentations that 218, as I mentioned earlier, is a more potent antibody when one thinks about engagement of the target, the target biology. So, I don't -- I'm not aware of anything that's particularly unique with the FC enhanced but we'd have to study the data a bit more closely. And the goal of the Probody, of course, is to open that therapeutic window, and that's why we're encouraged that they prioritized 288."
}