{
    "symbol": "IMCC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 13:05:57",
    "content": " Joining me today are IM Cannabis Chief Executive Officer, Oren Shuster and Chief Financial Officer, Shai Shemesh. Todayâ\u0080\u0099s call will include estimates and other forward-looking information and statements, including statements concerning future revenues, results from operations, financial positions, markets, economic conditions, product releases, partnerships and any other statements that maybe constructed as a prediction of future performance. Good morning, everyone and thank you for joining us for our second quarter 2022 earnings call. We are very pleased with our financial results and operational execution in the quarter particularly compared to our peers, have recently performed. We are a multi-market cannabis company with the leading position in each of the three largest federally legal markets in the world, Canada, Israel and Germany. Our global supply chain and regional expertise set us apart from our peers and we will apply that to upcoming growth opportunities, particularly in Germany. When it comes to recreational cannabis consumption, our estimates suggest that the German market could be 2.5x greater than that of Canada. As such, we believe Germany legalization efforts could encourage similar initiatives in other European countries such as Italy, Spain, France and the UK. In Canada, we have achieved significant market share in the all important premium dried flower and pre-roll markets. When it comes to our global operation and execution, as you may recall from the previous quarter, we have embarked on ambitious integration and restructuring plan. Our operation in Israel are now more centralized, both based on a safe supply model leveraging our Canadian yield. To further streamline our operation in Israel, Focus Medical closed the Sde Avraham cultivation farm. If you recall, Focus Medical had an exclusive commercial agreement with IM Cannabis to distribute and production under the IMC brand. In Canada, we have also embarked on the streamlining of our operation as part of our global integration efforts to enhance operational efficiency and reduce costs. Collectively, these initiatives are expected to yield approximately $4 million in annual cash savings in Canada. We expect our global supply chain model to match the demand and supply for premium indoor grown Canadian cannabis in each of our markets, resulting in higher margins and income. It was yet another quarter of record revenues, which increased 114% year-over-year and 1% sequentially to $23.8 million. I will now provide an overview of each of our market segments: Israel, Canada and Germany. I would like to reiterate that these countries are the three largest markets in the world, where cannabis is federally legal and we are the only multi-country operator active in all of them. In Israel, we successfully responded to the increased demand for premium indoor grown Canadian cannabis from Israeli customers through our global and fully licensed import/export supply chain. In addition, based on the strong consumer demand for premium and ultra premium medical cannabis, we have benefited from increased selling prices in Israel. We are a market leader in Canada, one of the most mature and competitive cannabis markets globally. We have continued to grow revenues, marking the fifth consecutive quarter of recreational revenue growth. WAGNERS and Highland Grow maintained commending market share in Ontario, the largest and most important regional market in Canada. For the 3 months period ending June 30, WAGNERS was number two in the premium segment and Highland Grow was number three in the ultra premium segment in Ontario. In response to market demand for highly popular brands WAGNERS and Highland Grow, we launched numerous new products at the end of Q2. And in the first weeks of Q2, the WAGNERS pre-roll catalog at the OCS grew through the launch of Tiki Rain and Blue Lime Pie pre-rolls, two new 3.5 gram dried flowers SKUs, Tiki Rain and Purple Clementine. Highland added new dried flower SKUs to its OCS portfolio, Gas Tank and Dimond Breath with well â\u0080\u0093 as well as white lightning pre-rolls. In Germany, we are already one of the top companies among the 100 that the country operates in the country, reaching a market share of 3.5% in April. Of the three strains, we have our Hindu Kush strain was the top selling T20 in the market, with 20% market share with our recipient of extended EU GMP license on May 24, including additional production testing and release steps we achieved another milestone that supports our strategy of product and brand variety such as WAGNERS. When this happens, we expect our strong positive reputation among German healthcare community through our IOC branded products to position us well. Lastly, I would like to commend that we are working with our legal team to address the notification of company received from the NASDAQ stock market with respect to maintaining the required minimum bid price. I will now turn the call over to our Chief Financial Officer, Shai Shemesh who will review our second quarter 2022 financial results. The increase in revenues is primarily attributed to an increase in the quantity of medical and recreational cannabis products sold as well as from the higher average selling price per gram, the company realized from its portfolio of premium branded cannabis products in Israel and Canada. The increase in operating expenses were partly due to restructuring expenses of approximately $9.2 million, of which the vast majority are non-cash expenses associated with the closure of the facilities in Israel and Canada as well as the growing corporate activities in Israel and Canada following the companyâ\u0080\u0099s acquisition in 2021. Cash and cash equivalents totaled $5.86 million at June 30, 2022 compared to $34.05 million at June 30, 2021. In Q2, we begin to see our consolidated operation yield substantial synergies as reflected by our immense year-over-year revenue growth. By pursuing efficiencies while also introducing new and sought after premium brands in different markets, our goal is to position ourselves as a leading consumer packaged goods company serving the cannabis industry. As mentioned, during our call last quarter, we are building our track record of success in Israel and product category leadership in our brands in Canada, while leveraging our distribution infrastructure in Germany. Just want to get some further color in terms of, the Israeli market going forward, we are hearing a lot from the LPs about, there being too much products in the market. What we see in the Israeli market is that on one hand, there is over-capacity I would say of indoor grow of greenhouse grow in Israel. We launched in this quarter, the ultra premium segment in Israel actually. So, I think that there is over-capacity of low quality products and high demand for high quality products in the market. I think that this will continue in Israel, the demand for high quality products. Regarding the general market in Israel, we donâ\u0080\u0099t have indication, strong indication for significant change in the market in the near future. And then when we look at other international opportunities for you guys, UK has been a market that a number of international operators have started to focus on a bit and seeing the growth opportunities there. In Germany, we just extended our facility to be able to have â\u0080\u0093 to be to be able to get products and to process it in our facility and then to distribute it in Germany or in other European countries. So, now we are more focused on building the supply chain to be able to have a premium supply to our facility in Germany. Thank you, operator and thank you all for joining our call today. Please continue to track our progress as we continue to execute on our growth strategy. And I know that Shai mentioned some segments of the business being cash flow positive, and the overall business close to being cash flow positive. Well, as I said, as I previously said currently â\u0080\u0093 first of all, currently we have the sufficient cash in order to proceed with the operation and growing concern and all this. Canada is part â\u0080\u0093 this is part of the restructuring in all the cost, the cash cost saving that we did, we are aiming to get there, I believe by the most likely by the end of the year or even before that. Thank you, operator and thank you all for joining our call today. Please continue to track our progress as we continue to execute on our growth strategy."
}