{
    "symbol": "AGYS",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-24 21:14:03",
    "content": " In summary, on the Marriott PMS selection topic, I cannot overemphasize the fact, there is a lot of focused execution during the next approximately 1.5 years, that will be required from our product development services and other teams by Marriott and by other involved third-party partners that will have to go well, before the system can be rolled-out at any of the planned properties, that is before this win can get translated to real and substantial subscription revenue for us. While we do expect to recognize services revenue directly attributable to this project during the next few quarters, it is possible that's the extent of investment increases required to expand our customer support help desk, software monitoring tools, cloud engineering operations, information security, and other internal systems infrastructure to support the next phase of major revenue growth could happen ahead of the subscription revenue increased timeline, which could reduce our EBITDA by revenue percentage profitability levels by two or three percentage points during the short-term. One-time product and services revenue, combined, was $19.8 million, that is $19.8 million, 38% higher than the comparable prior year period and 5.7% higher compared to the sequentially preceding second-quarter of fiscal 2023. Subscription revenue generated from add-on experience, enhanced software modules, most of which were developed internally ground-up during the past few years constituted 17%, 1-7, 17% of total subscription revenue this quarter compared to 11% during the full previous year fiscal 2022. Taking a look at our financial results, beginning with the income statement, third-quarter fiscal 2023 revenue was a quarterly record of $49.9 million a 26.5% increase from total net revenue of $39.5 million in the comparable prior year period. Combined, the three main operating line-item -- the operating expense line items, product development, sales and marketing and general and administrative expenses, excluding stock-based compensation, was 45.6% of revenue compared to 45.9% of revenue in the prior year quarter and in-line with our FY '23 plan. Now the rest of the revenue growth that's going to happen during the next say two to six quarters should provide enough provision for that, but we are just warning you, that there could be some margin compression, 2% to 3% of EBITDA by revenue, nothing more than that and, that margin compression, may not happen as well due to the infrastructure and other buildups, as we get prepared to be a much larger-scale cloud SaaS company."
}