{
    "symbol": "AGYS",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-25 19:53:03",
    "content": " In annual contract value terms this was our best quarter in three years for total value of new customers, new properties and new product sales combined. This quarter, fiscal 2023 Q2 was our best quarter in more than six years in terms of sales measures, annual contract value of PMS and related add-on attachment modules. Across all products combined Q2 fiscal 2023 was our highest quarter ever with respect to subscription sales bookings measured in annual contract value terms and it was about 15%, one-five, about 15% higher than the previous best quarter, which was Q2 last fiscal year. Fiscal 2023 Q2 revenue was a record $47.7 million, the third consecutive record revenue quarter close to 26% higher than the comparable prior year quarter, but sequentially only slightly higher than Q1. One-time product and services revenue combined at $18.7 million, that is 1-8, $18.7 million was 35% higher than the comparable prior year period, but down compared to the sequentially preceding Q1 fiscal 2023 quarter. Subscription revenue generated from add-on software modules, most of which were developed ground up during the past few years constituted 16%, one-six, 16% of total subscription revenue this quarter compared to 11% during the full previous year fiscal 2022, and 10% during the fiscal 2022 second quarter. Adjusted EBITDA for the quarter was $7.4 million and 15.5, that is one-five, 15.5% of revenue, a slight improvement over the sequential Q1 quarter and in line with our expectations for the first half of fiscal 2023. Taking a look at our financial results beginning with the income statement, second quarter fiscal 2023 revenue was a quarterly record of $47.7 million, a 26% increase from total net revenue of $37.9 million in the comparable prior year period. This sales surge also drove the combined product recurring revenue and services backlog to close to peak record levels, giving us increased confidence and comfort in the revenue guidance provided at the beginning of the fiscal year. We continue to expect fiscal 2023 annual revenue to be in the range of $190 million to $195 million driven by year-by-year -- driven by year-over-year subscription revenue growth of approximately 30%, three-zero, 30%. We also continue to expect EBITDA levels for the full year to be better than 15%, one-five -- better than 15% of revenue despite the first half of fiscal 2023 being less than that level."
}