{
    "symbol": "AGYS",
    "quarter": 1,
    "year": 2023,
    "date": "2022-07-26 21:46:07",
    "content": " Fiscal 2023 Q1 revenue was a record $47.5 million, the second consecutive record revenue quarter and close to 23% higher than the comparable prior year quarter. Recurring revenue during Q1 fiscal 2023 grew to $27.7 million, driven by a close to 30 -- driven by a close to 30% year-over-year subscription revenue increase over the comparable prior year quarter. Subscription revenue from add-on software modules, most of which were developed ground up during the past few years constituted about 15% of total subscription revenue this quarter compared to 11% during the full previous year fiscal 2022. Similar to the sequentially preceding Q4 fiscal 2022 quarter, product and services revenue added up to close to $20 million, about 28% higher than the comparable prior period. Compared to that, we made a good start this fiscal year with close to $20 million between product and services revenue in the first quarter. Adjusted EBITDA for the quarter was $6.7 million, and 14.1% of revenue, that's one for 14.1% of revenue, in line with expectations provided for the first half of fiscal 2023. In line with previous guidance provided, we expect fiscal 2023 annual revenue to be in the range of $190 million to $195 million, driven by year-over-year subscription revenue growth of around 30% -- 30%. First quarter fiscal 2023 revenue was a quarterly record of $47.5 million, a 22.7% increase from total net revenue of $38.7 million in the comparable prior year period. Total recurring revenue represented 58.3% of total net revenue for the fiscal first quarter, compared to 59.9% of total net revenue in the first quarter of fiscal 2022. increased revenue from professional service implementations and product revenue coming back into the business drove the change in revenue mix, and the drop in recurring as a percentage of total revenue compared to the prior fiscal year. Add-on software modules comprise 15% of subscription revenue in Q1 fiscal year 2023 compared to 10%, in the comparative prior year quarter, and they continue to be a meaningful contributor at this subscription revenue. The gross profit margin decrease is primarily due to product and professional service revenue coming back into the business combined the three main operating expense line items, product development, sales and marketing in general and administrative expenses, excluding stock based compensation were 46% of revenue and in line with our FY 2023 plan. And there are many customers who are moving from our old products to our newer products, which are more cloud-based, it's a combination of all of them together, that our subscription revenue is 30% higher."
}