{
    "symbol": "RIVN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 21:15:25",
    "content": " Before we begin, I would like to remind you that during the course of this conference call, our comments and responses to your questions reflect management’s views as of today and will include statements related to our business that are forward-looking statements under federal securities laws, including, without limitation, statements regarding our market opportunity; industry’s trends; business operations; strategy and goals; our second domestic manufacturing facility; our future products, including R2; and our expectations regarding vehicle deliveries. We have a lot of work ahead, but the passion and endorsement we have seen from customers and third-parties, such as being named MotorTrend’s 2022 Truck of the Year demonstrates the impact our team can drive as we remain laser-focused on ramping production and getting more vehicles on the road. Your line is now open. Your line is now open. And as we just talked a little bit about with John’s previous question, right, we do see significant path forward as we are ramping production and able to ultimately have that step change where we are now harvesting, right, the profitability of all of those foundational investments that we have made in the production capacity that’s online and the launch vehicles that we have come to market with. So our, what we call Enduro, this is the single-motor drive unit that’s used in the EDV platform in a front-drive application and in the R1 platform in a dual-motor or all-wheel drive application, our next-generation network architecture and associated family of ECUs, and of course, our LFP battery pack, which is going to be launching in the EDV later this year. Your line is now open. And additionally, as you heard from RJ, a number of the strategic decisions we’ve made to really focus and prioritize our product development road map also come with embedded CapEx savings as well as we think about the CapEx forecast over the next handful of years. And as we now look at Georgia, the opportunities to learn from a production line layout point of view as well as the product itself and pull all those together to create really a world-class product in terms of affordability, world-class product in terms of CapEx efficiency, that’s been – that is the major focus from a development point of view for the product teams and for the plant design teams. And so, what’s also important to note is that, that product coming to market in 2025 will have the time to even further encapsulate more learnings as we continue to go through ramp and as the vast majority of our organization continues to be focused on ramping up in our Normal facility between the R1T, the R1S, the EDV 700 and the EDV 500. Your line is now open. Your line is now open. We have also continued to see an acceleration of preorders because truly, our customers are best salespeople out there in the market, giving their own test drives and in some cases, actually reaching out to our customer experience center to ask them for how best to address their own friend’s questions as they are educating and really empowering and educating others about what the Rivian brand is and importantly, what that driving experience feels like within the market. And we, as a leadership team, are very focused on making sure we take the $17 billion in cash that we have, the 150,000 units of installed capacity and the incredible demand we have from consumers, both on the – our customers, both on the consumer side as well as with our partner, Amazon, and taking all those core elements and ensuring we are positioning ourselves for significant growth over the coming years, but also focusing our capital deployment on ensuring that we launch R2 in 2025 and can do that with the cash that we have on hand."
}