{
    "symbol": "RIVN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 21:47:16",
    "content": " Before we begin, I would like to remind you that during the course of this conference call, our comments and responses to your questions reflect managementâ\u0080\u0099s views as of today only and will include statements related to our business that are forward-looking statements under federal securities laws, including, without limitation, statements regarding our market opportunity, industry trends, business operations, strategy and goals, our second domestic manufacturing facility, our future products, including R2 and our expectations regarding vehicle deliveries. Your line is now open. And then secondly, RJ, I was hoping you can maybe elaborate a little bit on the longer term implications of the Inflation Reduction Act for the competitive landscape and for Rivian specifically and whether you see a path to achieving the material sourcing requirements that are in there and the value requirements and a little bit more on the commercial side, which sounds like it could be really meaningful up to, I think, $40,000 on certain gross vehicle weight vehicles. So those are things like in-sourcing of our motors, the introduction of our LFP pack, which will be introduced first in our commercial vehicles, that allow us to really drive a step change in terms of vehicle performance in that time frame, which enables us to increase pricing on the vehicles, given the fact we will have vehicles with added range and added performance and capabilities, but they also importantly drive significant cost-downs within our bill of materials as we look at that roadmap ahead. So, I am just curious, as you think about the retail side if there is an opportunity to keep mix incredibly strong and push maybe to the higher end of the range and then also grow the commercial vehicle side of the business kind of to those credits that Rod just going over with you and that sort of the mix maybe just far superior to anything you were expecting mix and pricing in the past and thatâ\u0080\u0099s really what helped offset to offset the inflation and maybe you hit your margin targets or maybe something better. And Iâ\u0080\u0099ll unpack a little bit of the higher COGS outlook, which includes both the fact that weâ\u0080\u0099ve seen higher startup costs or inefficiencies associated with ramping four vehicles across two production lines at our plant in Normal. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}