{
    "symbol": "PHM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 10:17:11",
    "content": " I suspect that throughout this morning's call, we will find ourselves delineating between the favorable demand environment that existed earlier this year, which drove PulteGroup's third quarter earnings versus the more challenging market conditions we're encountering today. The favorable demand and pricing dynamics, which existed at the time are reflected in the 15% or $71,000 increase in the average sales price of closed homes that we reported for our third quarter. In the quarter, orders among first-time buyers increased 3% over the prior year as sales benefited from a double-digit increase in community count and the availability of quick move-in homes as the majority of our spec production is in our Centex communities. Given the demand and pricing dynamics we are currently experiencing in the market, in addition to the increase in incentives needed to attract sales, we currently expect our fourth quarter homebuilding gross margin to be approximately 28%. Your line is open. Your line is open. Your line is open. So running higher and also that financing incentives, and we talked about this in the second quarter, we're up over sales in the third quarter of last year, so that the total load of incentive is up on current sales, by a couple of hundred basis points versus the closings that we had in this quarter. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. My first question, just maybe a follow-up on Ivy's questions around cancellations and maybe it's â\u0080\u0093 I don't know if it's a terminology issue in terms of talking affordability versus outright qualification â\u0080\u0093 challenges, but Ryan or Bob, could you address what percentage of your cancellations or as you're kind of hearing from the field around prospective buyers, how you're seeing outright inability to qualify impact versus just a, hey, maybe I can qualify, but I can't actually afford the x dollars a month in incremental payments. Your line is open."
}