{
    "symbol": "PHM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 13:36:05",
    "content": " Taking a step back from the specifics of our Q1 financial results, I think, it’s fair to say that, the supply/demand dynamics of the first quarter were consistent with the trends the industry has been experiencing for the past year or more. Higher revenues for the quarter were driven by an 18% increase in average sales price to $508,000, while closings of 6,039 homes were consistent with last year. So is the right way to think about it that agnostic to the option and own split that roughly 90,000, 100,000, so maybe 40% of your portfolio has been kind of contracted or tied up for over the last 18 months -- 15 months, 18 months or I know there’s a lot of moving pieces there. I wanted to press on the strategy of restricting sales a little bit, because I think we are all synthetic to the supply chain issues, and obviously, recent quarters, been very clear that, that’s the right thing to do, but this is a pretty dynamic and rapidly evolving market, especially with rates. We were able to close homes that were at the high end of our guide, which I think also demonstrates the fact that we are -- we have got pretty good control and predictability around what’s in production and so we are actively moving through bringing our backlog down to a level where we can start to release more things for sale and we are certainly looking forward to that. Ordinarily, you would actually, I think, in a -- given it’s the spring selling season, you would see sales orders build through the quarter and we just didn’t let that this year. So just to push on that a little bit more and to clarify, when you talk about rate locks, which is something that we have been hearing builders talk a lot more about in recent days, I just want to confirm that the orders that you are taking and that you have taken, let’s say, over the last month, forgetting about the closings, but the orders, those buyers are -- but today’s buyers are qualifying at today’s rate and if they are locking, they are basically at today’s rate. So the -- the gross margin guide that we have given incorporates all of the information that we have, and kind of what we would expect to play out over the coming quarters and the balance of the year and it’s a healthy gross margin, as I think, you can probably appreciate."
}