{
    "symbol": "CINT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-19 14:42:05",
    "content": " The main factors contributing to our higher growth base continue to be the expansion of our engagements with existing clients, the addition of 60 new clients in our portfolio, reaching 110 clients with annual revenue above BRL1 million and our programmatic M&A strategy. With 100% of the student's journey available online, this story is evidence of a vision where people from any part of the country at any time or on any device can access quality education easily and we're leading companies like eDOCS can count on CI&T to expand and materializes its strategies. With CI&T's, we can help our clients test the hypothesis to find out how Crypto and Web3 can be used in creating new business models, opening new channels of engagement with their customers, joining a new global market and repositioning their organization within a revised mindset of value portability and composability. At CI&T, the crypto and Web3 powerhouse allow us to accelerate the impact we can bring to our clients by combining this distributed knowledge and experience on the space with the development of our people in a new way that allowed us to help our clients in looking at the possibilities and having experience with all the different types of technologies that are involved to make it happen. Finally, our adjusted net profit was BRL33.5 million, a decrease of 16% compared to first quarter '21 due to higher financial expenses as we incurred new debt last year to finance the extra acquisition as well as higher depreciation and amortization from M&A. To summarize today, I would just recall that we have been expanding our growth pace in recent years based on a combination of three growth forces, a domain-driven digital strategy as a core component of our offering, our growth unit business architecture fostering a scalable and tempered organizational model and a programmatic approach for M&A as an enduring new capability focused on a flow of selective and strategic acquisitions."
}