{
    "symbol": "VRSN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 18:39:04",
    "content": " At the end of 2022, the domain name base in .com and .net totaled 173.8 million domain names with a year-over-year growth rate of 0.2%. For the year ended December 31, 2022, the company generated revenue of $1.425 billion, up 7.3% and delivered operating income of $943 million, up 8.8% from 2021. For the quarter ended December 31, 2022, the company generated revenue of $369 million, up 8.5% from the same quarter of 2021 and delivered operating income of $245 million, up 10.5% from the same quarter a year ago. Revenue related to this agreement during the full year of 2022 was approximately $19 million, of which approximately $10 million was recorded in the fourth quarter. Net income in the fourth quarter totaled $179 million compared to $330 million a year earlier, which produced diluted earnings per share of $1.70 for the fourth quarter of 2022 compared to $2.97 for the same quarter of 2021. As a reminder, net income for the fourth quarter of 2021 included the recognition of a deferred income tax benefit related to the transfer of certain non-U.S. intellectual properties between wholly-owned subsidiaries which increased net income by $165.5 million and increased diluted earnings per share by $1.49. Operating cash flow for the fourth quarter of 2022 was $217 million, and free cash flow was $209 million compared with $206 million and $193 million, respectively, for the fourth quarter of 2021. In summary, VeriSign continued to demonstrate sound financial performance during the fourth quarter and the full year of 2022, and we look forward to continuing our focused execution in 2023. As I mentioned in my prepared remarks, we did during the year, it was actually late in the fourth quarter, transition out of .tv management at TLD and in doing so, we -- as we completed all our obligations there, we did recognize about $8.4 million of deferred revenue in the fourth quarter."
}