{
    "symbol": "MDWT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 13:22:04",
    "content": " During today's call, we will reference this announcement, a copy of which may be found on the Investor Relations page of our website at ir.midwestholding.com. While this call will reflect items discussed within that document, for more comprehensive information about our financial performance, we also encourage you to read through our Q1 2022 Form 10-Q and 2021 Form 10-K which has both been filed with the Securities and Exchange Commission. Before we begin, I will remind you that matters from today's call will include forward-looking statements related to our operating performance, financial goals and business outlook, which are based on management's current beliefs and assumptions. These forward-looking statements reflect our opinions as of the date of this call, and we undertake no obligation to revise this information as a result of new developments that may occur. Forward-looking statements are subject to various risks, uncertainties and other factors that could cause our actual results to differ materially from those expected and described today. In addition, we are subject to a number of risks that may significantly impact our business and financial results. For a more detailed description of our risk factors, once again, please review our Q1 2022 Form 10-Q and 2021 Form 10-K where you will see a discussion of factors that could cause the company's actual results to differ materially from the statements. I would also like to remind you that during the call, we will discuss some non-GAAP measures in addressing Midwest's performance. Today, I'll cover strategic focus and opportunity for growth, the financial results of the first quarter and the trends driving the business forward. During the first quarter, we took action to position the company for further growth relating to pricing, product and investing in technology and foundational capabilities. Overall, the first quarter has provided a base for us to continue to expand on. Strategically, we're working to capitalize on a growing market, aided by demographics, by distinguishing ourselves in product, industry indices and technology. And we're working to create and use reinsurance structures, including our including our captive reinsurer, to mitigate risk and provide capital support for which interest and demand is strong from our partners. And finally, we continue to provide management services around investing assets in those reinsurance structures and leveraging core capabilities to support the administration of those vehicles. Midwest is designed to be a services oriented company, generating recurring fee revenue with a business model, supported by capital and reinsurance that allows us to provide best-in-class products for our customers. We combine a flexible capital model with a long-term outlook, allowing us to maintain stability while we quickly meet the changing demands of our customers and the marketplace. Turning to results for the first quarter of 2022, we reported GAAP net income of $187,000 compared to a net loss of $1.6 million reported in last year's first quarter. Driving this improvement was an increase in total revenue, which reached $2.6 million in the quarter compared with negative total revenue of $614,000 reported in the prior year first quarter. Overall, GAAP reported expenses were held by negative interest credited due to the fall in value of the options embedded in our liabilities and the increase in the mark-to-market value of our options allowance. We did see an increase in salaries and benefits and other operating expenses excluding the option mark, as we continue to build the business and processes and work on technology initiatives. Overall, annuity direct written premiums on a statutory accounting basis for the first quarter of 2022 were $98.1 million compared to a $104.2 million at the fourth quarter of 2021 and $123.7 million in the first quarter of 2021. There was a slow start in the first quarter of 2022, but we are seeing the positive results of these actions and encouraging trends as we move into the second quarter. Overall, we received $2.4 million in ceding  2022 compared to $2.9 million in the first quarter of 2021. As of March 31, there was $30 million on the balance sheet under deferred gain on co-insurance transactions, which will be recognized in revenue over time. Our invested asset base continues to grow at $1.1 billion as of March 31, up from $976 million at year end. Overall, we're benefiting from core capabilities developed to source alternative assets in the areas of private credit, commercial mortgages and structured products, which is producing an overall portfolio yield of approximately 5.5%. Anticipated premiums written are expected to be in the range of $500 million to $600 million influenced by state expansion, IMO expansion, reallocated personnel, and other initiatives. The goal is to cede, on average, approximately 70% to 90% of the premium in the year to generate ceded commission fees and manage capital. We are working to bring general and administrative expenses on a management basis, a non-GAAP measure, to be approximately $27 million to $28 million for the full year 2022. The continued performance of the business, actions being taken and the potential for growth continues to build value in the platform. As we move forward, our opportunity is strong and the team at Midwest is committed to positioning the business for continued growth. I think as we think about the top line, we expected first quarter to be somewhat consistent with fourth quarter and the trends that we saw there. During that quarter though, we took quite a bit of action around pricing ensuring that we were staying in a competitive position. We also did a number of things around allocating resources and focus on our distribution partners just to, again, be more active, ensure our name and brand is getting out there. I think what our expectation is, is that it will continue to grow as the year goes on. And we think, again that we have a little bit of an edge there with our asset capabilities and what we're seeing with movement in rates to be able to continue to match that along with our reinsurance capacity. So I would expect Q2 to see, again, some growth given the encouraging trends that we saw coming out of the first quarter and then that to continue to grow as the year progresses. And then one more, if I can just on your guidance for ceding 70% to 90% as kind of the production, and obviously it looks like you are warehousing a bit at the moment. Yes, I think again, as we look at this, the ceding percentage, it really is about making sure that we're building the capacity, to in our existing reinsurers and potential new ones, we have a transaction in the pipeline and potential others in the back half of the year. And, I think, as we've seen the warehousing that was kind of the first time we did that with SRC1 in ORIX and that's been a successful transaction. So I think as we are growing our own capabilities, we're finding that growing the size is important. So I would expect us to see maybe not as many numbers of transactions, but size a little bit bigger. And we've been kind of running around 50, we think with some of what we have in the pipeline that that will increase. Service fee revenue rose to $1.1 million from $438,000 a year ago. And as we noted, we continue to see that which is encouraging and that's generating a nice revenue stream. I think in addition to that there is some kind of, I guess, trials, I would say, that we've been looking at around the fees – somebody is. And really that relates to we've been building quite a bit of capability in the team around structure transactions, private credit, and we've been able to really begin to leverage some of those capabilities to source assets or structure, investment vehicles where we were able to generate additional fees with our reinsurers to support that. A lot of low loan-to-value supported by strong rental collateral or collateral that's again, supported by rental vehicles feel good about the partners. We certainly go through a process of stressing that and ensuring that again, we understand the volatility potential around that and what's happening in the markets that they are located. So we are looking to ensure that we're diversifying those assets and the geography around those, as well as the type of again, commercial vehicle that they may be in. So I think as we kind of look at return, that's probably running somewhere in 6.5% to 7% sometimes higher, depending again, on the structure. So I think again, if you look at the retained portion of the book if we look at – that's disclosed in the Q and the K you can see again that some of the assets that we're holding for the reinsurers, right and we're managing that taking fees for it. So as we look at that, just finding my page here with me, there is a good portion again, that's kind of supporting that. So we've kind of got about $598 million, right in funds withheld and Mod Co. accounts that are supporting those reinsurance transactions. Yes, I think, our target is to maintain that consistent kind of view of where we were for 2021, which is similar 75%-25%. I think we are seeing some dynamics in the market around pricing, which may move that slightly, but we would expect that to be somewhat consistent given our distribution and where we're seeing activity. I think for us obviously we tend to lean towards the MYGA in some cases with the reinsurance and that's a piece of it, but we would expect that to be somewhat consistent given the market dynamics at the moment."
}