{
    "symbol": "CSWC",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-02 16:43:06",
    "content": " Capital committed this quarter included $107.8 million in first lien senior secured debt committed to 6 new portfolio companies, one of which we also invested $1 million in equity alongside our debt; $3.8 million in first lien senior secured debt committed to one existing portfolio company and $400,000 in sub-debt and equity follow-on investments in 3 existing companies. The company’s NAV per share as of September 30, 2021, was $16.36 as compared to $16.58 at June 30, 2021, representing a quarter-over-quarter decrease of 1.3%. And then when you go through the pandemic, things like a pandemic, and you have stress in the portfolio and you sit across the table as a first lien lender, which, by the way, gives you the freedom to make good business decisions that balance your shareholders’ capital interest with the interest of that company and that sponsor to make reasonable fair decisions on how you deal with stress. I think this coming quarter, we’re -- as I think Bowen said earlier, we expect to see net portfolio growth, but it’s going to be on significant repayments as well as significant originations. It’s more of a -- I mean our business model is an organic growth story with respect to just developing an excellent track record, just keeping our head down and just executing what our guys know how to do and then have access to the equity market to grow -- slowly grow the equity after the permanent capital base in lockstep with the net portfolio growth. I’m trying to think about -- I would say, first of all, we definitely wouldn’t read too much into the percentage of equity co-investments this quarter or past quarters. And I do think as a first lien lender, remember, we always -- the log don’t understand, I mean when the company breaches covenants, I mean that -- as a first lien lender, you have all kinds of options and things and way to extract a little bit of economics here and there and its market to do so. So over the next 6 months, we’re going to be drawing -- we would anticipate drawing around $60 million off of the SBA at 1% and that gets pooled into maybe it will be 1.5%, maybe be a little higher than that."
}