{
    "symbol": "CSWC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-24 12:47:12",
    "content": " I'll start by saying that during tumultuous times like we have seen recently in the public markets, it's covering to have a portfolio heavily weighted to first lien senior secured debt, built with the full cycle underwriting mentality have deployed over the past seven years since the launch of our credit strategy. Our NAV per share grew 5% to $16.86 from $16.01 in the prior year, driven primarily by over $17 million in net realized and unrealized gains in the portfolio. During the fiscal year, we grew our total portfolio at fair value by 36% year-over-year to $937 million from $688 million in the prior year, while increasing our pretax net investment income by 6% to $1.90 per share from $1.79 per share in the prior year. Portfolio growth during the quarter was driven by $103 million in new commitments, consisting of investments in three new portfolio companies, totaling $50 million, two refinancing transactions, totaled $41 million and add-on commitments in eight existing portfolio companies, totaling $12 million. On the capitalization front, we raised $25.2 million of equity through our ATM program, at an average price of $24.27 per share, representing an average of 150% of the prevailing net asset value per share. We remain in the quarter, our equity co-investment portfolio consisted of 41 investments with a fair value of $85.2 million, which included $25.1 million in embedded unrealized appreciation or approximately $1.01 per share. Our equity portfolio, which represents approximately 9% of our total portfolio at fair value as of the end of the quarter continues to provide our shareholders' attractive upside from growing the lower middle market businesses. To illustrative on Slide 11, our on-balance sheet credit portfolio as of the end of the quarter, excluding our I-45 Senior Loan fund grew 7% to $794 million, as compared to $745 million as of the end of the prior quarter. Capital committed this quarter included $49 million in first lien senior secured debt committed to three new portfolio companies, including one, in which we also invested $1 million in equity. Finally, during the quarter, we also committed $51 million in first lien senior secured debt to nine existing portfolio companies. Since the launch of our credit strategy over seven years ago, we have generated a cumulative weighted average IRR of 14.4% on 60 portfolio exits, representing approximately $695 million in proceeds. As of the end of the quarter, the total portfolio fair value was weighted 84.2% to first lien investments, 6% to second lien, and 0.1% to subordinated debt, and 99.7% to equity co-investments. Our investment portfolio continues to perform well generating $7.7 million in net realized and unrealized gains this quarter, bringing the net realized and non-realized gains on the investment portfolio over the past four quarters to $17.3 million. Turning to slide 20, the company's NAV per share as of March 31, 2022 increased 4.1% for the quarter to $16.86 per share compared to $16.19 per share as of the end of the December quarter."
}