{
    "symbol": "CSWC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-01 13:35:04",
    "content": " We are also pleased to announce that our Board has declared an increase in our regular dividend per share to $0.48 for the quarter ended March 31, 2022, an increase of 2.1% from the $0.47 per share paid in the December quarter. Portfolio growth during the quarter was driven by $268 million in commitments to 14 new portfolio companies and 12 existing portfolio companies, of which, $213 million was funded at close. Furthermore, in lockstep with our strong deal pipeline, we raised $16 million of equity through our ATM program at an average price of $25.97 per share, representing an average of 159% of the prevailing net asset value per share. As of the end of the quarter, our equity co-investment portfolio consisted of 39 investments with a total fair value of $74.5 million, which included $17.7 million in embedded unrealized appreciation or approximately $0.74 per share. The successful exit of one of our lower middle market equity co-investments this quarter, which produced a realized gain of $5.6 million, is an example of the benefits of this component of our strategy. As illustrated on Slide 10, our on-balance sheet credit portfolio as of the end of the quarter, excluding our I-45 senior loan fund grew 8% to $745 million as compared to $689 million as of the end of the prior quarter. On Slides 11 and 12, we lay out the $268 million of capital invested in and committed to portfolio companies during the quarter. Capital committed this quarter included $204 million in first lien senior secured debt committed to 14 new portfolio companies, including 1 in which we also invested $3.3 million in second lien alongside our first lien debt. Finally, during the quarter, we also committed $54.3 million in first lien senior secured debt to 9 existing portfolio companies. Since the launch of our credit strategy over 7 years ago, we have generated a cumulative weighted average IRR of 14.6% on 56 portfolio exits, representing approximately $638 million in proceeds. As of the end of the quarter, the total on-balance sheet portfolio at fair value was weighted 82.9% to first lien investments, 6.5% to second lien investments, 1.5% to subordinated investments and 9.1% to equity co-investments. Specific to our performance for the December quarter, as summarized on Slide 18, we earned pretax net investment income of $11.8 million or $0.51 per share. Our investment portfolio continues to perform well, generating $700,000 in net realized and unrealized gains this quarter, bringing the net realized and unrealized gains over the past 4 quarters to $12.2 million. We also have seen an uptick in our DDTLs or delayed draw term loans so that we see maybe $5 million to $10 million being funded off of those DDTLs each quarter, and our repayment activity is somewhere in the $20 million to $30 million each quarter."
}