{
    "symbol": "SR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-06 16:20:58",
    "content": " I would like to also highlight that the Missouri Public Service Commission recently approved an interest revenue increase of $8.5 million effective May 7, including in this order is $5 million of overheads that were deferred as part of that settlement. Gas Utilities had earnings of $169 million, $9.5 million ahead of last year as growth from new rates in Missouri and Alabama more than offset the benefits of Winter Storm Uri last year that did not recur. However, after removing Missouri regulatory adjustments and the reclassification of pension costs and deferral, as outlined here on the slide, O&M costs were $5 million below last year. Our per share earnings growth target remains 5% to 7% and while our current year will fall short of that target due largely to regulatory headwinds, we do anticipate growth above the range in fiscal year 2023 and '24, assuming a reasonable outcome in the Missouri rate case. As Scott outlined earlier, with the deferral of our Missouri overhead cost, we have refined our fiscal year '22 earnings target to a range of $3.75 to $3.95 per share. And while our Gas Utilities delivered a strong quarter, we have lowered our forecast to reflect the impacts of 3 headwinds: first, warmer weather in the Southeast; second, a higher run rate of depreciation and property tax expenses, offset in part by continued cost control on the O&M line; and finally, recognition of the cadence or seasonality of rate recovery, which has pushed more of our recovery to the winter heating season just ended and out for the back half of the year. But I think that the key is if you go back to the slide deck and you look at the waterfall, you look at the results of operation in our forecast for the year, and we brought down our forecast from our own expectations against the normal growth and marketing a little bit, but really at the utility driven by a combination of what's happening down in Alabama, which is probably 1/2 to 2/3 of the total reduction, what's happening to Missouri from a cost run."
}