{
    "symbol": "SUZ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 16:22:12",
    "content": " As a result of strong volume prices, revenue management and operations stability, our EBITDA has reached BRL 525 million in the first quarter, a 41% increase compared to the first quarter of 2021. This first quarter was marked by increasing tightening of the supply-demand balance, mainly as a consequence of supply disruptions all over the world due to factors such as planned and unplanned downtimes, sanctions on Russian hardwood, European pulp production as well as the persistent logistics constraints, which consequently resulted in low pulp stocks throughout the chain. Since we had the concentration of sales volumes in the end of the quarter, when FX appreciated significantly, the translation of our effective price in U.S. dollar terms using the average FX for the first quarter does not represent precisely our invoice prices to customers, which was approximately $655 per ton in the first quarter '21. Our EBITDA of BRL 4.6 billion being 2% over the first Q '21 and was mainly a result of higher prices despite lower in-force volumes, FX depreciation and cost pressure. Cash costs, excluding downtime in the first quarter 2022, came to BRL 868 per ton, 16% higher than in the fourth quarter '21 and both of our expectations on the last quarter earnings call in the beginning of February when the Russia and Ukraine war was not foreseen. Cash production costs excluding downtime in the first quarter 2022, was 39% higher than in the first quarter '21 due to the same most relevant inflationary pressures just mentioned when comparing quarter-over-quarter figures. As presented recently at the Suzano Day in the end of March -- moving to the next slide -- the Cerrado Project is progressing precisely as scheduled, closing the first quarter of 2022 with the \"inside the fence\" execution, which corresponds to industrial and infrastructure investments, reaching fiscal progress of 10%, which is in line with the respective financial disbursements. I mean if it's purely related to the fact that you maybe had more pulp sales concentrated in a period in which the BRL was stronger or if there is some -- there are some lagging volumes from previous periods in which the prices were not as high as they are right now, that would be pretty interesting."
}