{
    "symbol": "SUZ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 19:30:02",
    "content": " Considering the first 2 months of the third quarter when compared to the same period of 2021, the available data shows 8.5% demand increase, mainly due to increase on the demand for paper linked with the Brazilian National Government Program and the Brazilian general elections. EBA's public data on paperboard demand shows a strong 11.7% increase in the first 2 months of the third quarter, even when taking into account the same strong comparison period in 2021. This third quarter was marked by tight supply and demand balance, mainly based on continued supply disruptions, especially in Europe, some of which weather-related and also due to a lack of birch for hardwood pulp production, as well as the effect of an absence of new volumes in the stream from new projects, which, as a result kept hardwood inventories low globally and throughout the whole chain. Demand and order entry levels for hardwood continued at a good pace during the quarter, which in addition to the low hardwood inventory scenario still places challenges in the management of supply chain for some paper and paperboard producers in order to keep their production rates unaffected. Coming back to the slide, our average price for export markets has increased to $821 per ton during this third quarter, which is 12% higher than the second Q in U.S. dollar terms and 20% higher in Brazilian real terms. Now looking forward, I would like to highlight the following points: we continue seeing an unchanged scenario of low hardwood inventories throughout the chain as a consequence of persisting value-related events and war-related sanctions affecting hardwood production, especially in Europe as well as no sizable volume from new projects coming into market up to year-end with no additional tonnage being visibly marketed as we speak. On top of these factors, the planned and announced recovery by the retrofit of Suzano's Aracruz mill, impacting our pulp production in October, November, as well as new unlimited hardwood deliveries by some leading agent producers should constrain pulp availability in the market and so keeping the supply side of the S&D balance tight in this next period. Despite the expected slowdown in Europe, and we recognize as I said in my speech, a lower visibility in that sense, consultancy such as  factoring in that number, forecast global demand for hardwood pulp to grow close to 1 million tons in 2023, and that's hardwood alone, which is in line with historical growth as tissue is very resilient even in more adverse scenarios."
}