{
    "symbol": "FLL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 20:12:03",
    "content": " So less certain on the opening date there than we are in Illinois, because after Illinois, and I wish we're installing slot machines, so itâ\u0080\u0099s -- but it's looking pretty good. Fast forward to a year from now, two years from now with both Waukegan and then Chamonix opening, I strongly, strongly suspect you're going to see those margins continue their way back up for what it's worth. And then we can tie it in that says if you -- when you bet on the final four games and so on, we will give you credit towards around the Gulf or towards a weekend stay at our hotel and it's a lot easier for us to do that than it is for DraftKings or FanDuel, because they don't actually own the hotels, they're a little more complicated. And then at some point when we are -- as we start zeroing in on the day, like roughly by Thanksgiving, we have to make a decision on when people actually start getting paid and because there's a large number of people who then say, okay, you're on the payroll on this date, and then a number of them are already going through licensing. And so then you're training them in a new facility, then there's a point where you say, okay, we're going to have play nights, where you take two or three nights where you're playing with artificial money and you get the restaurants going with invited friends and family just so the cooks learn how to cook and the waiters learn how to serve. We have one in our heads just, so you know David, weâ\u0080\u0099re going to --\n But David, if I tell you it's January 15, we're actually ready to open on January 5, don't you want to open on January 5. I guess, I'm not -- I mean, at this point, there's different things that happen like I know -- I haven't heard the final outcome, but I know we had one of those great events that happened this weekend, because we had a Golf Tournament in Mississippi, we invited all these high rollers in and they all came in on Friday night. And  pay 1.5% of gaming revenue in a contribution to the city and you get into the city's municipal budget and back into it and they're doing revenues about $400 million a year, gaming revenue and have for a long time."
}