{
    "symbol": "INVE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 22:33:10",
    "content": " Revenue was $112.9 million, reflecting 9% year-over-year growth while full year adjusted EBITDA grew 33% year-over-year to $5.4 million. So with that context, in Q4, total revenue was $29 million, up 2% over last year and adjusted EBITDA was $1.7 million, an increase of $2.5 million over last year in EBITDA. By segment, Premises grew a solid 11% year-over-year and RFID grew 5%, compared to the prior year period when RFID revenues included a greater mix of lower margin orders that both these growth trends were partly offset by a decline of almost 25% in our non-core smart card reader business. For the full year of 2022, non-GAAP adjusted operating expenses were $37.1 million, as compared to $34.2 million, an increase of 8%. Our non-GAAP adjusted EBITDA was $1.7 million or 6% of EBITDA margin in Q4 2022, landed above consensus estimates of $1.5 million and was an increase of $2.5 million year-over-year. Our next slide further analyses trends by segment beginning with identity, revenue from our identity products totaled $16.8 million or 58% of our total revenue in Q4 of 2022, as compared to $17.5 million in Q4 of 2021. For the full year 2022, our identity revenue were $57.4 million or 60% of our total revenue as compared to $64.7 million in 2021. For the full year 2022, non-GAAP adjusted gross margins were 58%, compared to 56% in 2021. As we move to the first quarter of 2023, our total backlog for all future shipments was $35 million exiting Q4 of 2022, up 16% versus Q4 of 2021. That said, we anticipate an increase in total revenue in 2023 and we currently expect revenues to be in the range of $125 million to $130 million, while continuing to focus on gross margin and EBITDA expansion. Our focus for 2023 is delivering healthy growth with strong margins, expanding the strategic position we established in 2022, while sustaining our balance sheet and making clear progress towards our long-term business model. So as a result of this business environment and our strategic position, we expect 2023 net revenues in the range of $125 million to $130 million, with expanding EBITDA margins. This reflects premises growth in the 20% range and IoT high-value solutions growth in the 25% range, offset by rotation out of lower-margin IoT revenues of about $5 million to $7 million and flat smart card reader revenues. So first, on the growth side, the premises growth in 20% range you said the IoT solutions growing in the 25% range overall, but there's also some lower margin revenues we're rotating out of about $5 million to $7 million that offset that growth, and then the smart card reader revenue is staying flat. And I think you'll see that it shows in the market share we're already winning, the partnerships we're building, the ability to expand production and win some strategic business, while we're also expanding gross margins and EBITDA margins and that all comes from the strength of the technology and the teams."
}