{
    "symbol": "INVE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 23:06:06",
    "content": " We had two primary goals in Q2, growth in RFID of over 40% validating our long range plan and gross margins holding at the 37% or above range we guided for the year. As Steve mentioned, our financial results reflect our continued strength exiting the second quarter of 2022 with the delivery of sequential and year-over-year growth in revenue, sequential increases in GAAP and non-GAAP gross margin and a positive non-GAAP adjusted EBITDA. For the second quarter of 2022, non-GAAP adjusted gross profit margin was 38%, which was above consensus estimates and an increase compared to 37% in the first quarter of 2022 and comparable to 38% in the second quarter of 2021. In the second quarter of 2022, our GAAP and non-GAAP adjusted operating expenses, including research and development, sales and marketing and general and administrative costs were $10.5 million and $9.2 million respectively, compared to $10.0 million and $9.0 million in the first quarter of 2022 and $9.1 million and $8 million in the second quarter of 2021. Non-GAAP adjusted gross margin for Premises in the second quarter of 2022 was 58% compared to 57% in Q1, 2022, and 59% in Q2 2021. Our non-GAAP operating expenses in the second quarter of 2022 adjusted to exclude restructuring and severance costs and certain non-cash charges consisting of stock-based compensation and depreciation and amortization was 33% of revenue compared to 36% in Q1, 2022, and 33% in Q2 2021. As we move to the third quarter, our total backlog for all future shipments were $34.2 million exiting Q2 2022 up 23% versus Q2 2021. As you can hear from Justinâ\u0080\u0099s comments, our growth in RFID and Premises continued gross margin expansion, and EBITDA strength show our business model continuing to strengthen, trending towards our long-term operating model of growth, gross margins and EBITDA margin. RFID growth accelerated, gross margins expanded beyond our target for the year RFID driven NRE projects, reach record numbers and revenue strengths in RFID offset legacy revenues where cost increases wouldâ\u0080\u0099ve pressured margins."
}