{
    "symbol": "INVE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 21:21:13",
    "content": " As Steve mentioned, our financial results reflect our continued strength exiting the first quarter of 2022, with the delivery of year-over-year growth in revenues, sequential and year-over-year increases in gross margins and future backlog, and a sequential return to positive non-GAAP adjusted EBITDA. For the first quarter of 2022, non-GAAP adjusted gross profit was 37%, which was above consensus estimates, and an increase compared to the 34% in the fourth quarter of 2021 and 36% in the first quarter of 2021. non-GAAP adjusted gross profit margin changes resulted primarily from our product mix, as well as a focus on tracking and prioritization of higher margin products. Our non-GAAP adjusted EBITDA margin increased 4% from Q4 2021 to a positive 1% in the first quarter, which was above consensus estimates and we're continuing to deliver leverage in our operating model. Non-GAAP adjusted gross margins for premises in the first quarter of 2022 were 57% compared to 52% in Q1 2021, and 54% in Q4, 2021. As we move to the second quarter, a total backlog for all future shipments was $32.4 million exiting Q1 2022, up 24% versus Q1 2021, which provides visibility into the current business momentum we anticipate continuing through 2022. In addition to the ones I've mentioned before, like , seller and , we've also got entry project going for eBay, Life Fitness through Promate, iRobot, a medical device for orthopedic surgery, the world's largest provider of casino chips, several industrial applications, several different million-dollar-plus medical testing products across both humans and animals, high-end consumables for general appliances, spending everything from coffee buds to high-end refrigerator systems, and a lot more. We've just started tracking it partly with the supply situations to make sure that we're looking actually at six to eight quarters out to make sure we got coverage, it's not just for backlog and -- because we need to cover backlog, firm forecasts and the new deals that they're hunting and bringing in."
}