{
    "symbol": "INVE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 23:34:02",
    "content": " Now the recent pressures in small cap growth equities have reached a point that any reasonable value placed on the Premises business alone, a business that's growing sustainably at 15% to 20% with strong gross margins and over 15% recurring revenues, a strong balance sheet and no debt should support our company's entire current value. As Steve mentioned, despite significant supply chain issues and customer demand reductions, our financial results reflect our continued strength exiting the third quarter of 2022 with the delivery of sequential and year-over-year growth in revenue, with total feature backlog increasing 31% year-over-year. Our next slide further analyzes trends by segment beginning with Identity revenue from our Identity products totaled $19.2 million or 62% of total revenue in Q3, 2022, which is a 13% increase from Q2, 2022 and a 2% increase from Q3, 2021 The sequential and year-over-year increase in Identity revenue was primarily driven by higher sales of RFID transponder and access card products. Moving now to our operating expense management, our non-GAAP operating expenses in the third quarter of 2022, adjusted to exclude restructuring and severance costs and certain non cash charges, consisting of stock based compensation and depreciation and amortization, was 31% of revenue compared to 33% in Q2, 2022 and 28% in Q3, 2021. As we move to the fourth quarter, our total backlog for all future shipments was $36.9 million exiting Q3, 2022 up 31% versus Q3, 2021 which provides visibility into the current business momentum we anticipate coming through 2022. Even though we delivered record quarterly revenues, built a strong backlog and reported positive momentum in our transformational categories the current environment we outlined delayed customer orders, shifting supply chain availability and production related challenges combined with today's difficult macro economic conditions impacted our results. for 2022 for Identiv overall, we're expecting around 10% to 12% growth, with RFID growth continuing at the same rate in 2023 with continuing supply constraints, and with premises growing 20% to 25% we expect 20% to 25% growth overall for Identiv in 2023 with solid gross margins. This 2023 growth doesn't incorporate some end user demand growth and RFID like Wiliot and others, which would add well over $20 million in 2023 in addition to our current projections, if we can get supply, and if the demand all comes through, even as the economy softens. And you can diligence at all on their own website, they, they placed an order for 25 million units, which they would love right in the fourth quarter, ramping up from a standing start, both from a process perspective and a supply perspective is going to be, we're not we're not going to get to 25 million. Well, no, because we're talking about 20% to 25% growth in the overall business, Wiliot will contribute, as you said that about 10% of 30 million will contribute about three. Very fair question and Amir can answer that as well, more directly, because he's got very close related, but no, we've talked with them very openly about this order, just came in right at the end of the quarter, and they're asking for that kind of step up, and you got to get process going, and you've got to get supply going."
}