{
    "symbol": "TRVN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 13:50:04",
    "content": " I would now like to turn the conference over to Barry Shin, Chief Financial Officer. With me today are Carrie Bourdow, our President and CEO; Patty Drake, our Chief Commercial Officer; and our Chief Medical Officer, Mark Demitrack. As a reminder, OLINVYK was approved by the FDA and indicated in adults for the management of acute pain severe enough to require an IV opioid analgesic and for whom alternative treatments are inadequate. The important safety information, including the box warning and full prescribing information, are all available on olinvyk.com. Let me start the call this morning talking about OLINVYK, what we're seeing in the overall environment, how we're executing and what our plans are moving forward. While the pace of formulary wins and customer engagement levels are noticeably increasing, the hospital market environment remains challenging. It's the staffing shortages, the tight margins, formulary delays, they're all a factor. Importantly, inpatient admissions are still not up to pre-pandemic levels. Well, first in August, we downsized our field and medical teams, brought the remainder of the field team in-house and signed a contract with Vizient, so that their  can help us educate hospital customers on OLINVYK. And together, we're covering approximately 50% of the IV opioid volume. By doing this, we're managing our resources and our cash to be as effective and efficient as possible to help weather the aftermath of the pandemic. Second, we focused on new business areas, like burn centers and ambulatory surgical centers. And in December, the OLINVYK cognitive data versus IV morphine will be presented at another large meeting. Well, we'll continue to be focused on efficient management of our resources. We do believe that it is important to continue to highlight OLINVYK's unique profile with new data in areas that our customers care about, like respiratory depression and cognitive function. And now that we've completed that cognitive study versus IV morphine, our plan is to approach FDA early next year about potential next steps for label expansion. With regard to our pipeline, we're very excited about TRV045, our novel S1P receptor modulator. And we're interested in two areas, non-opioid treatment of chronic pain and epilepsy, large markets where there is tremendous unmet medical need and an interest in new product mechanisms. This morning, we were pleased to report topline Phase 1 data for TRV045. And based on this data, together with our extensive non clinical work and studies with the NIH, we believe that TRV045 may be a first-in-class molecule with anti-seizure, anti-inflammatory and analgesic effects. First, as you'll recall in last quarter's call, we announced a significant contract win with Vizient, the largest member-driven healthcare performance improvement company in the country. And importantly, that is what we're seeing, as well as reorders continuing from those customers. While we're optimistic about the long-term potential opportunity with Vizient, these types of large GPO contracts do take time to ramp up. Second, in addition to Vizient, we have a new capability to contract directly with national ambulatory surgical centers, or ASC chains. In fact, there's a 7% compound annual growth rate predicted through 2028 for outpatient surgeries. Finally, as it relates to reimbursement, OLINVYK received CMS pass-through designation that just went into effect in October. While the majority of IV opioid usage currently takes place in the inpatient hospital setting, the CMS decision represents a good opportunity for initial use for surgeons and anesthesiologists who can use the OLINVYK in the ASC and then bring that experience to the inpatient setting and P&T discussions. In addition to our contracting and reimbursement wins, we've also made progress across a number of metrics. As of today, we have 172 formulary wins, which is a reflection of the direct contracting with the ASCs that I referenced previously. While we're pleased with this, the work to now pull through those formulary wins into orders and reorders is just beginning. We're also seeing an increase in orders, new customers and repeat customers, although the base remains small. And as Carrie mentioned, we had an important presentation at the American Society of Anesthesiology Meeting where Dr. Albert Dahan's double blind study comparing oliceridine and morphine on ventilation in the elderly was selected as one of the best in clinical science abstracts. We're also attending the Southern Burn Conference, which is taking place this week. As a result of our focus on burns, we have several clinicians interested in trying OLINVYK in their own institution to demonstrate the potential benefits of it in this important patient population. To close, we continue to make progress, so we understand it is not as fast as we'd hoped to deliver. We've received CMS pass-through status, and we're gaining efficiencies with our field team. With that, let me turn the call over to Mark to discuss our clinical programs in more depth. Throughout the last quarter, we've made significant progress with TRV045, our novel S1P receptor modulator. I'll start by touching on what makes TRV045 mechanism of action unique, what sets it apart within this important class of drugs. With that in mind, I'll then comment on what we've seen in our Phase 1 and non-clinical data that are consistent with this mechanism. Based on this overview, I hope to convey why we're excited about the potential opportunities this compound presents. One of its key features is that, when TRV045 binds to the S1P receptor on the surface of cells, the receptor drug complex is internalized, but then dissociates and the receptor is rapidly able to return to the cell surface. And we believe this rapid receptor recycling process, or lack of receptor desensitization, sets TRV045 apart, causing no reduction in peripheral lymphocyte levels, which we would expect to lead to no long-term immunosuppression. This would point to targets like epilepsy and chronic pain, indications that have not been clinically practical to explore with other S1P modulators. These cells are believed to play key roles in the pathophysiology of how seizures develop and how they persist to cause epilepsy, as well as playing a central role in the regulation of brain signaling events, key to the development of chronic pain. Finally, our non-clinical safety data suggests that TRV045 shows no evidence of cardiac, pulmonary or ophthalmologic effects, which have been reported with other drugs that target the S1P receptor. In short, we began to assemble data that suggests this unique mechanism may produce antiseizure, anti-epileptogenic, anti-inflammatory and pro-analgesic effects and introduces the exciting possibility that TRV045 may have the potential to be disease modifying in the case of epilepsy-related disorders. With that as background, I'm excited to announce that we have now completed our first-in-human Phase 1 study. Important observations were the TRV045 was well tolerated, and there were no serious adverse events. The PK profile of 045 also showed a half-life, consistent with anticipated once-daily dosing. The study also examined a range of targeted laboratory measures to evaluate the safety of 045, including total lymphocyte counts, ECGs and ophthalmologic examination since changes in these measures have been reported with existing S1P targeted compounds. First, at an upcoming neuroscience meeting in December, we'll be presenting the results of our positive animal model epilepsy data obtained from our longstanding collaboration with the NIH's epilepsy therapy screening program. I've previously reviewed these data, which highlights significant positive outcomes of 045 in several acute and chronic animal models of epilepsy. Second, along with our Phase 1 top line results, we also reported the completion of a recent study examining the ability of 045 to directly modulate the inflammatory signaling of astrocytes in vitro. This was a study of primary astrocytes, derived from mouse brain isolated and studied in cell culture. In that work, we examined 17 different cytokines and chemokines produced by astrocytes and demonstrated that TRV045 modulated the concentrations of these substances released from astrocytes with a net action to dampen the inflammatory response of these cells. We believe these data are significant, since it is known that inflammatory signals from astrocytes and other brain cells appear to play an important role in the development of seizures and the emergence of epilepsy. While more work lies ahead, we're excited by the prospect that TRV045 may have the potential to have a disease modifying effect on the treatment of epilepsy in humans. With the results of these studies in hand, we're now preparing a focused proof of concept study in approximately 25 healthy subjects. The benefit of a targeted study like this is that it offers the possibility of a quick data readout and will provide confirmation of CNS target engagement relevant to clinical indications, such as epilepsy and pain. In the third quarter, our net loss was $15.3 million or $0.09 per share compared to $13.8 million or $0.08 per share for the same period last year. The results include $2.6 million of non-recurring, non-cash adjustments that I'll discuss in more detail. As Patty discussed, though our wholesalers are seeing growing order and reorder rates, they continue to fill these orders from existing stocks. Given the uncertainty of predicting future OLINVYK sales in this environment, in Q3, we recorded a $2.2 million non-cash valuation adjustment for slow moving or obsolete inventory, which are recognized as cost of goods expense. We also made a $0.4 million non-cash adjustment to our returns reserved for OLINVYK held at our wholesalers, which appeared as negative product revenue. We're actively managing our expenses to preserve resources, and we finished the quarter with $40.4 million in cash and marketable securities, which we believe will fund our operations into the third quarter of 2023. I'd note this cash balance does not include a $3 million milestone and $15 million non-dilutive financing tranche that we'd receive upon OLINVYK approval and commercial sale in China, respectively. Moving on, I'm also happy to announce we received shareholder approval in September for a reverse split of a common stock, which we expect to implement shortly. We'll now open the call for questions, after which Carrie will provide some closing remarks. My line broke up, Mark, when you were talking about the S1P and the planned clinical study that you're running. But you can imagine from the targets that we're interested in with 045, including both pain and epilepsy. So, think experimental pain models, also models that are accessible to us that could probe measures of cortical excitability, think things like TMS or transcranial magnetic stimulation, models like that are commonly used at this stage of development in these targets. The other thing I mentioned in my remarks is the beauty of doing a study like this is these tend to be very efficient, quick data readout types of studies. And I know, from an end market opportunity, it's not as big as the inpatient for the product. But given that you have pass-through status, it would seem that this could be an easier sell in the short term. Yeah, you've been out and about in ASCs. I was just going to say, as I mentioned in the remarks, more complicated surgeries are happening in the ASCs, and ASC outpatient surgeries just in general are growing versus what you see in the inpatient hospital where it has not returned to pre-pandemic levels yet. While it's not ever going to be as large as inpatient, it just gives an opportunity for surgeons and anesthesiologist to get some experience because they usually do work in ASCs and the inpatient hospitals. So, that's really how we view the opportunity with both the growth happening and now with the pass-through status happening. But in early conversations with physicians and administrators that are running the ASCs, they really do appreciate the additional reimbursement. They absolutely are seeing the kinds of benefits that we've talked about before in their patients, getting patients up, moving around more quickly. I've been pleased because, as you mentioned, the vial usage in the ASCs is less than in the inpatient setting, but I've been pleased because, as you described, the opportunity in the ASCs is growing. With regard to cardiac, we had a pretty comprehensive look at that in the study. So in addition to vital signs, which were measured quite closely throughout the dosing period, we had a very good ability to see an effect on heart rate, of which there was not. So we did not see the first dose bradycardic effect, which is often described with S1P modulators. And so, we were able to look at interval data quite closely and saw no impact on any intervals. Obviously, the ones we'd be most closely interested in as PR and QT intervals given the pharmacology of this class of drugs, and so no effect on those measures. Given what we see emerging as our understanding of the mechanism, as I've been sort of emphasizing on the call, the role in inflammation as a mechanism is key here. And that's really what undergirds some of our hope in thinking about the disease modifying potential because inflammatory processes, as you know, are critical to the development, onset and persistence of this. When we think about target, we've got a lot more sort of cogitating, if you will, about that moving forward, but focal epilepsy, refractory focal epilepsy is certainly on the docket. As you probably know, there's certain rare diseases where inflammatory processes are thought to play a critical role in development. I'd point to something like West syndrome or infantile spasms, which has a pretty well-known pathophysiologic underpinning that involves inflammatory signaling. So, things like that are certainly on our short list of targets to consider moving forward. So, understand that that data is a medical place. Because if you have cognitive function, you'll have the opportunity to discharge earlier or get out of the ICU earlier, or have better PACU efficiencies. Also, being able to ambulate gives you the opportunity not to run the risk of ileus and you'll have more, again, opportunity for an easier or quicker discharge and very efficient. And so, it's an important piece of data when they see a patient checking in that has a CPAP, for example. That's where that data had been very, very supportive of the use of OLINVYK in those patient populations. Jason, on the formulary question, we actually have had institutions that are really looking at OLINVYK. So, these are institutions early, early on before we even had our field team out that had not put OLINVYK on formulary. And so, the team, we just had a discussion about this yesterday where we've got some of the inpatient institutions. Because the cognitive data is considered new, they are able to go back now with a different advocate, a KOL advocate to get OLINVYK on formulary. And the cognitive data, as Patty said, is playing really well there as well. Obviously, it's a promising asset. We're interested in partnering all of our assets, as we've said in the past. Certainly, the Phase 1 data and even the non-clinical data that we've got now on epilepsy, I think, will be interesting to partners. It's probably, though, around the proof of concept, which is why Mark's comments around getting that data as quickly as we can will be important because I think that will really highlight the broader potential of 045 in a couple of different areas that we've mentioned. But I think, certainly, there's interest, but proof of concept is probably where we'll get the bigger levels of conversations happening. And as far as reallocating, so we've been â\u0080\u0093 as you heard this morning, we've been very efficient in how we're managing OLINVYK, given the hospital climate that we have right now. So, I think we're making the right choices. So we're pretty excited to get 045 moving in this direction, but also being very focused, if you will, in managing how we how we promote OLINVYK. On the Cleveland Clinic study, it looks like you're now targeting complete enrollment by the end of the year. In terms of financials, I believe the R-Bridge financing has a substantial milestone on first sale in China. Jeff, on the VOLITION study, you're correct. From where we stand today, we're on track to close enrollment shortly in that project. So, this year, we will end enrollment in the VOLITION study. We haven't yet been that specific about meetings that we would present it at, but, obviously, we'd be working as quickly as possible to reduce that data to publication and get it submitted and then get as much visibility at the scientific meetings throughout the year as we can. The other thing I'll say is, obviously, given that this is Cleveland Clinic and Wake Forest, two pretty prominent hospitals, that alone will help the conversations that we're having with other formulary committees. And I'd note that we would receive both a $3 million milestone from Nhwa upon the approval, then a $15 million non-dilutive financing tranche from R-Bridge on first commercial sale. So, yeah, a relatively significant financing event and non-dilutive as well for us. First, as I mentioned earlier, we continue to believe in the science behind Trevena with OLINVYK. Although the challenges with hospitals remain, we're really pleased to receive CMS pass-through, which will help reinforce the science and our value message in the hospital outpatient ambulatory surgical centers. With TRV045, you've heard a lot of exciting news on this call."
}