{
    "symbol": "CAT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 13:48:03",
    "content": " In today's call, I'll begin with my perspectives on our performance in the quarter and for the full year. In today's call, I'll begin with my perspectives on our performance in the quarter and for the full year. Adjusted operating profit margins increased to 17% in the fourth quarter, an all-time record, as we saw our margins improve both on a sequential and year-over-year basis. Finally, despite the strong sales in the fourth quarter, backlog grew by $400 million in the quarter to end the year at $30.4 billion, a 32% year-over-year increase. In the fourth quarter of 2022, sales increased 20% versus last year to $16.6 billion. Dealer inventory increased by about $700 million in the fourth quarter, which is above our expectations, compared to a decrease of about $100 million in the same quarter last year. Operating profit increased by 4% or $69 million to $1.7 billion as strong price realization and volume growth were mostly offset by a goodwill impairment charge, higher manufacturing costs and restructuring expenses. Starting with Construction Industries, sales increased by 19% in the fourth quarter to $6.8 billion, driven by favorable price realization and sales volume, partially offset by currency. Fourth quarter profit for Resource Industries increased by 110% versus the prior year to $605 million, mainly due to favorable price realization and higher sales volume. Energy & Transportation sales increased by 19% in the fourth quarter to $6.8 billion, with sales up across all applications. We'll have about a $1.4 billion cash outflow in the first quarter related to the payout of last year's incentive compensation, slightly higher than we saw in the first quarter of 2022. In the first quarter compared to the prior year, we expect sales to increase on price and slightly stronger volume, reflecting higher sales to users. Compared to the fourth quarter of 2022, we expect adjusted operating profit margins to be flattish to down for the first quarter of the year at the enterprise level."
}