{
    "symbol": "SCPH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-22 20:11:03",
    "content": " While it has only been a few weeks since we announced the launch and commercial availability of FUROSCIX on February 20, initial interest among patients, providers and payers is very high, reflecting the important role that FUROSCIX can play in the heart failure treatment paradigm, either pre-hospital admission or post discharge. Taking a step back, or for the benefit of those may be new to the story, in October of 2022 we received FDA approval for FUROSCIX, a proprietary formulation of furosemide delivered by an on-body infuser, the outpatient treatment ingestion to the fluid overload in adult patients with the New York Heart Association Class II and Class III chronic heart failure. Heart failure is a significant financial pain point for both health care payers and hospitals, with the estimated that up to 90% of patients presenting to the emergency department with symptoms and worsening heart failure are admitted to the hospital, and 50% of these admissions may be potentially avoided. The results of the study with patients treated with FUROSCIX had heart failure related costs that were lower by an average of $16,995 versus historically matched comparators. We have 40 field territory sales representatives fully trained and conducting face-to-face in services at hospitals, doctor's offices and heart failure clinics, targeting the approximately 150 to 200 HCPs in 10 hospitals per territory, in surfaces provide HCPs with training and prescribing instructions for FUROSCIX designed to ensure office readiness. Please proceed with your question. Please proceed with your question. Some of the key things, we'll start communicating as early as May Q1 earnings call would be kind of a number of new prescribers that are -- have used FUROSCIX average length of script, which is a big thing for us, as I think we've said we anticipate 3% to 4%, so we'll be able to report on that. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}