{
    "symbol": "SCPH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 16:57:10",
    "content": "  Operator: Greetings, and welcome to the scPharmaceuticals Third Quarter 2022 Earnings Call. Before turning the call over to management, I would like to make the following remarks concerning forward-looking statements. All statements on this conference call, other than historical facts, are forward-looking statements within the meaning of the federal securities laws, including, but not limited to, statements regarding scPharmaceuticals expected future financial results and management's expectations and plans for the business and FUROSCIX. The words anticipate, believe, estimate, expect, intend, guidance, confidence, target, project and other similar expressions are used typically to identify such forward-looking statements. These forward-looking statements are not guarantees of future performance and may involve and are subject to certain risks and uncertainties and other important factors that may affect scPharmaceuticals business, financial condition and other operating results. These include, but are not limited to, the risk factors and other qualifications contained in scPharmaceuticals' annual report on Form 10-K, quarterly reports on Form 10-Q and other reports filed by the company with the SEC to which your attention is directed. Any forward-looking statements made on this conference call, including responses to your questions, are based on current expectations as of today, and scPharmaceuticals expressly disclaims any intent or obligation to update these forward-looking statements, except as required by law. It is now my pleasure to turn the call over to Mr. John Tucker, Chief Executive Officer of scPharmaceuticals. Thank you, Hans, and thanks to everyone listening to this afternoon's call and webcast, our first in the history of our company. I will begin with an operational overview, including a recap of recent development, and Rachael Nokes, our SVP of Finance, will follow with a brief review of our financials. The October FDA approval of FUROSCIX, the first and only self-administered subcutaneous loop diuretic for the at-home treatment of congestion in chronic heart failure, represents the culmination of years of unwavering effort on behalf of the entire scPharmaceuticals team. FUROSCIX offers a treatment option outside of the hospital, either pre- or post-admission. By reducing preventable hospital admissions and readmissions, we have the potential to effectively treat patients in the comfort of their own homes and potentially deliver significant cost savings for payers. Given that the benefits of FUROSCIX can accrue to multiple healthcare stakeholders, we anticipate positive uptake and are preparing for a robust commercial launch of FUROSCIX. It is worth noting that we are very pleased with the final approved package insert and label, which we believe allows us to pursue the large population of New York Heart Association Class II and III heart failure patients who may stand to benefit from this novel treatment. For those who may be new to the scPharmaceuticals story, FUROSCIX is our proprietary formulation of furosemide that is designed to be administered by an on-body infuser, West Pharmaceutical Services proprietary SmartDose on-body drug delivery system technology. Furosemide is the most widely used oral and parental diuretic available for patients with congestive heart failure, but the bioavailability of oral furosemide decreases and becomes highly variable during episodes of worsening symptoms. However, by enabling subcutaneous administration via the West SmartDose on-body delivery system technology, we have been able to achieve greater than 99% bioavailability, comparable to that of an IV bolus, which is typically administered in a hospital setting. So with FUROSCIX, the patient can receive IV comparable treatment in the comfort of their own home when oral furosemide isn't sufficient. It has been estimated that up to 90% of patients presenting to the emergency department with symptoms of worsening heart failure are admitted to the hospital, and 50% of these admissions may be potentially avoided. The average cost of a heart failure-related hospital admission for a Medicare patient is nearly $19,000, and heart failure is a top condition that is being targeted by the Centers for Medicare and Medicaid Services under its Hospital Readmission Reduction Program, or HRRP. The average length of stay is 5.2 days, while CMS reimburses just 3.9 days under the current DRG. So to demonstrate the magnitude of the cost savings that can potentially be realized with FUROSCIX, we ran a prospective clinical trial, FREEDOM-HF, the results of which we read out in July of last year. To summarize the key takeaways, select patients who present at the emergency room with a worsening heart failure event were treated with FUROSCIX at home as opposed to being admitted to the hospital. As compared to historically matched comparators, patients we treated with FUROSCIX had a heart failure-related costs that were lower by an average of $16,995. Though this figure excludes the cost of FUROSCIX, which had not been established at the time of the study completion, the conclusion is unchanged. By more aggressively treating patients outside of the hospital, where possible, significant healthcare costs can be avoided. And in fact, based on the results from a planned prespecified interim analysis conducted to confirm the final sample size, and following input from statisticians, principal investigators, payer advisers and health economics and outcomes research experts, enrollment was terminated early at 24 subjects versus the original enrollment target of 34. The final analysis, therefore, included 24 subjects treated with FUROSCIX and 66 matched comparators based on 7 variables associated with hospitalization. More recently, we announced positive results from a Phase II pilot study, AT HOME-HF. Along the key findings, subjects randomized to FUROSCIX had a 37% reduction in the risk of a heart feature hospitalization at Day 30 relative to patients randomized to treatment as usual. In addition, all predefined secondary endpoints measuring symptoms of congestion, quality of life and functional status favored the FUROSCIX group. Needless to say, we were very pleased with the results of these studies, which added significantly to the growing body of clinical and pharmacoeconomic evidence favoring the FUROSCIX versus the current standard treatment protocol. To that end, last month we presented 2 posters at the 2022 Annual Scientific Meeting of the Heart Failure Society of America. This is among the most important, well-intended gatherings of heart failure experts each year. Of these, we estimate 2.1 million episodes to be addressable by FUROSCIX. If we assume an average cost of FUROSCIX of approximately $3,300 per episode, the equivalent of 4 doses, at a WACC price of $822 per dose, that yields an addressable market opportunity of $6.9 billion. So we believe there is a substantial amount of opportunity here, and we believe FUROSCIX, once launched, will be adopted rapidly. In terms of reimbursement, we have held productive discussions with the largest provider of Medicare Part D plans. With our compelling pharmacoeconomic data, such as those that we obtained from our FREEDOM-HF study, we have P&T committee meetings arranged with a number of the top payers this quarter. As we indicated previously, given the strong clinical and pharmacoeconomic case we made for FUROSCIX as a key component of updated heart failure treatment regimen, we anticipate few obstacles in securing favorable formulary placement. From a marketing perspective, we rolled out our comprehensive coming-soon campaign at both the recent Heart Failure Society of America Annual Meeting and the American Heart Association Scientific Sessions that generated encouraging interest. Our MSLs have been busy in the field and have already made contact with over 500 key opinion leaders in the heart failure space in 2022.Finally, in terms of sales team and infrastructures. We are advancing a comprehensive, multifaceted launch plan that we believe positions us well to maximize our reach broadly to both heart failure physicians and patients. To ensure that we have the resources available to support our launch and commercialization plan, we entered into a $100 million secured debt facility with funds managed by Oaktree Capital Management on October 13, 2022, at which point $50 million became payable to us immediately. The remaining $50 million becomes available in 2 $25 million tranches, each tied to the achievement of prespecified commercial milestones. The debt facility carries an interest rate equal to the 3-month secured overnight financing rate, SOFR, plus 8.75% with the interest rate capped at 11.75% per year. Following the achievement of $100 million in trailing 12-month U.S. net sales of FUROSCIX, the SOFR premium will be lowered to 8.25%. We believe these terms are favorable to our company, and we are very grateful for the support of Oaktree at this transformational time. At this point, I'll turn the call over to our Senior Vice President of Finance, Rachael Nokes, for a review of our third quarter results and financial position. As of September 30, 2022, we held $45.4 million in cash, cash equivalents, restricted cash and investments. The increase in general and administrative expenses for the quarter ended September 30, 2022, was primarily attributable to an increase in employee-related costs and commercial preparation costs. Based on our current operating plan, we have adjusted our 2022 net loss to $38 million to $41 million, a decrease over prior guidance of $43 million to $48 million. As of September 30, 2022, we had 27,402,121 total shares outstanding. At this point, we will open the call for questions. Despite that background therapy, they're still increasing in symptoms and signs and the severity. They've been treated, stabilized and they're discharged. We know a significant portion of those, 25%, 30% of them are readmitted within 30 days. And also particularly curious what you're hearing about the monitoring recommendations, because my sense is it did seem fairly flexible. So when they see the label, they just see it as routine and normal. They'll do what they normally do today without FUROSCIX when they do prescribe FUROSCIX, and that's to order labs within a couple days of escalating care. So we plan to, when we launch, have about 6 months of inventory ready to go at launch and then continually update that as we sell through it. John, last time we spoke, I think you sort of talked about already having roughly a 40-person sales infrastructure -- sales force ready to go. Cardinal's our third party logistics, but when it's sold to the specialty pharmacy and they take title. And then consistent with that, should we -- you have the agreements already in place with the sales people. We'll talk about the number of total doses, the average number of doses per prescription. The payer formulary coverage, the percentage of lives that have access. I guess I'm going to have Steve answer that one, too. People are reaching out to us, asking when they can begin to prescribe, when they can get access to it. So we'll make contact with the prescribers, with the HCPs in the first week on the job. There's a big unmet need, and we've had a lot of time to increase awareness of the product. And Doug, we did -- we've been doing a coming-soon campaign to drive awareness of the name and the brand. Yes, we super target for the real high prescribers, and we'll see them at launch as often as weekly, Doug. And just maybe some color on some of the initial interactions with payers now that you are an approved price, you have a WACC in the market, and just how those are going and what you -- how we should think about the reimbursed access landscape. We'll have P&T formulary meetings and decisions made with a couple of the biggest Medicare Part D PBM plan combinations in November, and they don't have to do that. Typically it's 3 months, 4 months, 5 months. We're getting -- we were just approved in October, and we'll have meetings, P&T decision meetings in November and more in December. Before we launch in Q1, we'll have formulary decisions, and we expect those to be positive. They see the cost effectiveness of this product relative to the alternative, which is going to ER and hospitals. So yes, we're pretty bullish about it. I think we're really bullish on the fact that they're scheduling these meetings so quick, these P&T committee meetings. Well, they might on the oral, but that's fine because that's how the product's indicated. If they fail oral, they're going to -- this is why they need it. Because our goal, again, is to get them back on that generic oral as soon as they can without them being hospitalized. Not that we're hearing, no. Boy, that's a big number, Steve. What I can say is there's about 10 plans that cover about 85-plus percent of Medicare Part D beneficiaries, and we're meeting with all of them. So yes, I'd have to say when we're done with this, we'll have talked to people responsible for 85-plus percent of the Medicare Part D lives. In fact, I'll let Steve talk about it. No, we haven't targeted the regional commercial plans just yet. But when you're talking to the big PBM plan combinations like CVS Caremark and Aetna Optum and United, ESI, Cigna, we're talking to them about the commercial side of their business as well. As I said, commercial will make up 10% of the total opportunity for FUROSCIX. I think it'll take until the end of 1Q, just based on when they have P&T committee meetings. We're fortunate that we're getting a few done with some big ones in November and December, but there's others that will take until their normally scheduled meeting in Q1, which could be January or February. But Q1, for sure, we'll have had all of the meetings scheduled, reviews conducted and decisions made. It'll be surprising to us, very surprising if anyone makes a decision not to cover FUROSCIX. We hope we were successful in conveying our enthusiasm for FUROSCIX following its approval and the significant advancement that it represents along the heart failure treatment paradigm, a multibillion dollar market in the U.S. alone. We are well financed, and we will be initiating what we think is a very robust commercial launch in the coming months."
}