{
    "symbol": "PAHC",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-05 23:51:05",
    "content": " In terms of profitability, Animal Health adjusted EBITDA was $27.6 million, a decline of 8%, driven by lower gross profits and increases in SG&A costs, reflecting the challenges that Jack spoke about, earlier on the call. Starting with Mineral Nutrition, net sales for the first quarter were $54.4 million, an increase of 6% versus the same quarter prior year, driven by increased average selling prices, partially offset by lower volumes. Mineral Nutrition adjusted EBITDA was $4.5 million, an increase of 49% and reflects an improvement in adjusted EBITDA margin of 240 basis points, driven by increased average selling prices, partially offset by lower volumes. Net sales of $19.2 million for the three months ended September 30, 2021, reflect an increase of 25% over the same quarter prior year, driven by strong demand for copper-based products, coupled with increased selling prices, correlated with underlying raw material costs. The increased gross profit drove $2.1 million of adjusted EBITDA for the quarter, an 8% increase versus the prior year same quarter and an adjusted EBITDA margin of 11.1%, which is a 170 basis point decline from a year ago. As a result of these actions, we are raising our full year net sales projections by $20 million from the initial range of $840 million to $870 million to the revised range of $860 million to $890 million, which, as revised, complies a full year growth rate of approximately 3% to 7% and a 1% to 6% growth rate for the remaining three quarters of our fiscal year 2022. We are still planning to spend the year-over-year incremental $10 million on investments and strategic initiatives, relating to our companion animal development pipeline, the facility in Sligo, Ireland, where work continues, despite recording our first sale from the facility this quarter, African swine fever vaccine development activities and the cost of ongoing product registrations."
}