{
    "symbol": "PAHC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-25 10:51:07",
    "content": " As we look ahead, we are anticipating further year-over-year top and bottom line growth on an adjusted basis in fiscal 2023 with net sales projected to be in the range of 960 million to $1 billion and adjusted EBITDA projections in the range of $113 million to $118 million, reflecting 2% to 6% growth in both key financial metrics. On a consolidated basis fourth quarter net sales increased $35 million to 16% driven by growth in all three of our business segments, namely Animal Health, Mineral Nutrition, and Performance Products. After making adjustments to our GAAP results, which include acquisition related adjustments, foreign currency movements and one off, fourth quarter adjusted EBITDA, adjusted net income, and adjusted diluted EPS were up 17%, 13%, and 13% respectively, driven by higher Animal Health revenue and gross profits as well as stronger Mineral Nutrition gross profit, partially offset by increased selling, general, and administrative expenses. Net sales increased $109 million or 13% driven again by growth across all three business segments, Animal Health, Mineral Nutrition, and Performance Products. In terms of profitability, Animal Health adjusted EBITDA was $33.5 million, an increase of $4 million or 14% over the prior year quarter, while adjusted EBITDA margin was flat. In terms of profitability, Animal Health adjusted EBITDA for the year was $124 million, which was consistent with the prior year while the adjusted EBITDA margin declined 230 basis points as stronger sales and gross profits were offset by higher selling, general, and administrative expenses, reflecting the impact of higher-than-typical inflation and the macroeconomic headwinds . Let's start with Mineral Nutrition, net sales for the fourth quarter was $69.4 million, an increase of 22% versus the same quarter prior year driven by higher average pricing of trace minerals. Mineral Nutrition adjusted EBITDA was $6.7 million, an increase of 44% driven by increased gross profit and the adjusted EBITDA margin for the quarter was 9.6%, an improvement of 150 basis points versus a year ago. Moving to our Performance Products segment, we finished the year strong with net sales of $19.3 million for the three months ended June 30, 2022, reflecting an increase of 16% over the prior year same quarter driven by strong demand and pricing for copper-based products as well as strong demand for ingredients used in personal care products. The increased demand drove adjusted EBITDA of $2.4 million for the quarter, a 5% improvement versus the same quarter prior year, while the adjusted EBITDA margin declined 100 basis points to 12.3%. Mineral Nutrition net sales for the full year were $250 million, an increase of 18% versus the prior year driven by higher average selling prices of trace minerals. Net sales was $76 million, an increase of 13% over the prior year driven by strong demand for ingredients used in personal care products and strong demand and favorable pricing of copper-based products. For fiscal year 2023, largely driven by strong demand for our products across all regions, coupled with the annualization of price increases taken in fiscal year 2022, we are projecting consolidated net sales in the range of $960 million to $1 billion, which reflects a year-over-year growth rate of approximately 2% to 6%. Adjusted net income of approximately $52 million to $56 million and adjusted diluted EPS of approximately $1.28 to $1.38, reflecting a year-over-year 2% decline on the low end of the range or 5% growth on the high end, and an adjusted effective tax rate of 30%, which is comparable to the 29.5% actual effective tax rate for fiscal years 2022 and 2021."
}