{
    "symbol": "LW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-04-07 15:00:23",
    "content": " With respect to pricing, our price mix growth accelerated sequentially in the third quarter as we continue to execute on our previously announced product and freight pricing actions in our food service and retail segments to offset inflation and as we began to implement pricing actions in our global segment. Price mix was up 12% as we continued to execute our previously announced product and freight pricing actions in each of our business segments to offset input, manufacturing and transportation cost inflation. The increase in our potato costs, decrease in potato utilization rates, and how the crop is performing storage are all in line with the expectations that we shared with you last quarter and we believe we’ve secured enough potatoes to deliver our volume forecast until we begin to harvest the early potato varieties in July. Favorable price mix and higher sales volumes were largely offset by input inflation and higher manufacturing and distribution cost in both Europe and U.S.  Moving to our segments, sales in our global segment were up 2% in the quarter. International shipments, which have historically accounted for about 40% of the segment’s total volume were down nearly 20% versus the prior year quarter due to limited shipping container availability and disruptions to ocean freight networks. As expected, the rate of increase in food service’s price mix accelerated sequentially to 22% in the third quarter from 8% in the second quarter as the benefits of the product and freight pricing actions that we began implementing earlier this fiscal year to mitigate inflation continued to build. Food service’s product contribution margin rose 52% to $107 million with favorable price, volume and mix more than offsetting higher manufacturing and distribution cost per pound. In the fourth quarter, we expect sales to be driven by price mix as we continue to execute our previously announced product and transportation pricing actions to offset input and transportation cost inflations. We expect equity earnings excluding the impacts of any mark-to-market adjustments will remain pressured due to input cost inflation and higher manufacturing cost in both Europe and the U.S. For the year, we continue to expect interest expense to be approximately $110 million excluding the $53 million of cost associated with the senior notes that we redeemed in the second quarter; total depreciation and amortization expense of approximately $190 million and an effective tax rate of approximately 22%."
}