{
    "symbol": "LW",
    "quarter": 1,
    "year": 2022,
    "date": "2021-10-07 14:11:05",
    "content": " Our supply chain cost on a per pound basis have increased significantly due to input and transportation cost inflation, as well as labor availability and other macro supply chain disruptions that are continuing to cause production inefficiencies across our global manufacturing network. As Tom discussed, we feel good about the health of the category and our top-line performance in the first quarter and expect our gross margins going forward will improve as we benefit from our recent pricing actions, as well as from other actions that we are taking to mitigate some of the macro challenges affecting our supply chain. As expected, volume was the primary driver of sales growth reflecting the ongoing recovery in fry demand outside the home in the U.S. and in some of our key international markets, as well as the comparison to relatively soft shipments in the prior year quarter. However, shipments to these end-customers along with restaurant traffic slowed in August due to the surge of the Delta variant across the U.S.  Volume growth in August was also tempered by the inability to service full customer demand due to lower production run-rates and throughput at our plants, largely due to labor availability. For the second half of the year, we continue to expect our sales growth will reflect more of a balance of higher volume and improved price mix as we begin to lap some of the softer volume comparisons from the prior year and as a benefit from our earlier pricing actions continue to build. Below gross margin, we expect our quarterly SG&A expense will be in the high 90s as we continue our investments to improve our operations over the long-term, while equity earnings will likely remain pressured due to input cost inflation and higher manufacturing costs, both in Europe and the U.S.  We've also updated a couple of our other targets for the year. For fiscal 2022, we expect net sales growth will be above our long-term target of both mid-single-digits, but that our earnings will continue to be pressured for the remainder of the year due to higher potato cost from a poor crop and persistent inflationary and macro challenges. And then, I guess, as we - I think a lot of us certainly knew that even from the fourth quarter call that – you are getting a lot of pressure points and sort of pain points on the cost side for a host reasons in fiscal 2022 and that it was really all about just like sequential improvement as you went through the year."
}