{
    "symbol": "LW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-06 13:48:04",
    "content": " While our overall volume growth in the quarter was strong, it was tempered by industry wide upstream and downstream supply chain constraints, including delays in the availability of spare parts, edible oils, and other key materials to our factories, as well as labor shortages, which impacted production run rates and throughput at our processing plants. We expect volume growth in the third quarter will decelerate sequentially versus the 6% we delivered in the second quarter as a result of the near-term impact of COVID variants on restaurant traffic and demand, the macro industry supply chain constraints and labor challenges that will continue to affect production run rates and throughput in our factories, and global logistics disruptions and container storages that affect both domestic and export shipments. With respect to earnings we continue to expect net income and adjusted EBITDA including joint ventures will be pressured through fiscal 2022, reflecting significantly higher potato costs in the second half of the year resulting from the poor crop, double-digit inflation for key production inputs and freight and higher SG&A expenses. Equity earnings will likely remain pressured due to input cost inflation and higher manufacturing costs both in Europe and the U.S. We expect our interest expense to be approximately $110 million, excluding the $53 million of costs associated with the redemption of the senior notes in the second quarter. So my first question is really trying to take a step back, and you've updated kind of the margin framework for this year to 18% to 20% and maybe just as we think about those longer term aspirations to get back, the margins back to pre-pandemic levels 25% to 26%, can you help us think about kind of the key buckets of that bridge and the 500 to 700 basis points, and you still have to get whether it is just much more aggressive pricing, recapturing kind of that 10 points of capacity utilization and the benefits that would have on your unit cost, I am just trying to think about the productivity actions you're taking, just trying to think about how we walk back up to 25 and kind of some of the key milestones to think about getting there?"
}