{
    "symbol": "NOTV",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-13 21:22:07",
    "content": " Revenues increased 45.8% to $122.8 million from $84.2 million in last year's first quarter and revenues for DSA and RMS business segments increased from last year's first quarter, although results at the RMS business were impacted by our decision to temporarily pause shipping NHPs from Cambodia following the recent allegations against our NHP supplier employees and government officials in that country. Adjusted EBITDA for the quarter was a negative $5.5 million, as compared to an adjusted EBITDA of $10.1 million in Q1 of fiscal 2023, driven by the effects of the temporary halt of NHP sales, inflationary pressures on product expenses, energy and wages and professional fees,  related to NHP issues during the quarter, which impacted audit, legal and third-party professional fees totaling approximately $1.3 million. Our DSA business generated first quarter revenues of $41.1 million, up 25.3% from revenue of $32.8 million in last year's first quarter. As it relates to our outlook, we are reiterating our full-year fiscal 2023 guidance of at least $580 million in revenue and at least $75 million of adjusted EBITDA and with adjusted EBITDA margins of approximately 17% for fiscal 2023 nine-month period ending September 30, 2023. Total revenue for the 2023 first quarter rose to $122.8 million from $84.2 million in last year's first quarter, driven primarily by significant incremental revenue from our RMS segment and higher revenue in our DSA segment. DSA segment revenues grew 25.3% in the fiscal 2023 first quarter to $41.1 million up from $32.8 million in the fiscal 2022 first quarter, driven by an increase in the DSA revenue generated from ILS, which was acquired on January 10, 2022. Our operating loss for the first quarter was $90.6 million, reflecting an increase in operating expenses to $112.3 million, up from or $53.0 million in last year's quarter. As we note in our press release, higher operating expenses were driven primarily by a non-cash goodwill impairment charge of $66.4 million for our RMS segment as a result of the November 16, 2022 NHP event which led to our decision to refrain from selling or delivering any of our Cambodian NHPs held in the U.S., the uncertainty related to our ability to import NHPs from Cambodia and the decrease in our stock price, the carrying value of our goodwill as of December 31, 2022, was quantitatively assessed. The remaining $30 million increase in operating expenses reflected an increase in amortization expense of $5.4 million, increases in selling costs, primarily due to increased revenue and general and administrative expenses, or G&A, reflecting various acquisitions, including the addition of the RMS business, as well as strategic investments in unallocated corporate G&A expense to support additional future revenue growth, and this included additional headcount, higher compensation expense and higher legal expense. Adjusted corporate unallocated G&A totaled $18.6 million or 15.2% of revenue in the first quarter of fiscal 2023, compared to $7 million or 8.3% of revenue in the first quarter of fiscal 2022. The variance as a percent of revenue was due to lower Cambodian NHP volumes sold in the first quarter of fiscal 2023, compared to volumes that were sold prior to the event on November 16, 2022 and due to the company's decision to pause shipping of the Cambodian NHPs. In connection with these events, the variance as a percent of revenue was also impacted by the $1.3 million in professional fees related to audit, legal and third-party costs associated with the NHP situation in Q1 fiscal 2023. Interest expense increased to $10.5 million up from $4.8 million in last year's first quarter, reflecting our higher debt balance for borrowings obtained for the acquisitions and an increase in interest rates. CapEx in the first quarter was $8.4 million or 6.8% of total revenue and reflected investments in facility improvements, site expansions, enhancements to laboratory technology and system enhancements to improve the client experience."
}