{
    "symbol": "BHLB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-20 15:07:03",
    "content": "  Operator: Good morning or good afternoon all, and welcome to the Berkshire Hills Bancorp Q1 Earnings Release Conference Call. Good morning, and thank you for Berkshire Bank's first quarter earnings call. For details, please see our earnings release and most recent SEC reports on Forms 10-K and 10-Q. On the call today, we have Nitin Mhatre, President and Chief Executive Officer of Berkshire Hills Bancorp; Subhadeep Basu, our Chief Financial Officer; Sean Gray, our Chief Operating Officer; and Greg Lindenmuth, our Chief Risk Officer. Thank you, Kevin, and good morning, everyone, and welcome once again to Berkshire's first quarter earnings call. I'll begin my remarks on Slide 3, where you can see the highlights of the first quarter. It was another solid quarter with strong financial performance, continued balance sheet strength and steady progress on our best strategy. Revenues were lower year-over-year driven by runoff in the PPP and nonstrategic loan portfolios, while our continued expense discipline resulted in expenses flat quarter-over-quarter and lower by 8% year-over-year. As we've said before, we will self-fund our best strategy through optimization initiatives while reinvesting those saves in bankers, customer experience and technology investments that enable our future growth. As indicated on previous calls, we were expecting to reach an inflection point on the total loan balances growth in the first half of 2022. Overall, our balance sheet remains strong. On the strategy front, we've made good progress, and we'll continue to stay focused on execution of our journey forward. Our Board replenishment continues, and we've expanded our partnership with Narmi to further improve our digital experience and Net Promoter Score. After 7 quarters, we are starting to see loan balances grow once again, primarily driven by growth in commercial portfolio. Finally, I'd like to thank all of our employees for their hard work in the quarter. Their dedication and commitment to Berkshire's customers is what is driving our success and our progress towards becoming a high-performing, leading, socially responsible community bank. With that, I'll turn the call over to Subhadeep to discuss our financials in more detail. Sequentially, we had stable net interest income despite 2 fewer days in the quarter. Our after-tax income rose 3% and 30% quarter-over-quarter and year-over-year, respectively. As Nitin mentioned, we are pleased to report over 3% increase in average loans with particular strength in C&I lending, which is up 7% quarter-over-quarter. While available cash funded strong loan and securities growth in the quarter, ample liquidity remains to opportunistically deploy excess cash as rates rise. Year-over-year, our cost of funds has dropped by 25 basis points to 23 basis points. Broker deposits and wholesale borrowings have dropped to $341 million, down 67% from $1 billion in the first quarter of 2021 and down 82% from $1.9 billion in the first quarter of 2020, a very significant decrease. Our net interest margin was 2.61%, up a basis point in the first quarter. Adjusted NIM, excluding PPP and purchase loan accretion or PLA impacts, was 2.58% in the first quarter versus 2.46% a year ago. Sequential growth was primarily driven by higher wealth management fees, swap fees and lower tax credit impairments. The year-over-year fee decline was driven by the sale of our insurance business, lower SBA gain on sale and mortgage banking revenues. However, the pipeline and outlook for SBA loans and corresponding fees remain strong for the remainder of the year. Overall, our focus on expense management has helped us self-fund our investments in frontline bankers and technology. Strong improvements in credit across the board, continuing the trend over the last several quarters, delinquencies are down 45% year-over-year, and our net charge-offs dropped to 15 basis points. Next slide, Slide 11, shows detail on our capital and liquidity positions. Our top priority, by far, remains in deploying capital to support organic balance sheet growth. Like many banks, we recorded a negative bond mark in other comprehensive income in our equity account, which amounts to $75 million. As rates rise, the negative marks to the securities book are immediate, while the significant positive impact of higher asset yields and net interest income accrues over time. So in summary, a solid quarter with robust balance sheet growth, strong capital position, ample deposits to fund future growth, and importantly, strong credit performance and expense management. The New England economy is strong; labor markets are strong; and consumer demand, which is 2/3 of GDP, is high as we come out of the pandemic. The pipeline is robust, and we're seeing solid loan growth momentum. As a result, we're expecting NII lift of approximately 6% in 2022. On an adjusted basis, excluding PPP and Mid-Atlantic, the NII growth in 2022 is expected to be low double digits. About 60% of our loans are floating-rate loans, and we have loan growth. However, I would like to remind you that expenses can be lumpy quarter-to-quarter. Our asset quality remains strong, and underwriting continues to follow our conservative guidelines. Finally, we expect to continue to execute our new $140 million stock repurchase program in 2022 and complete the remainder of $111 million in buybacks in 2022. On Slide 12, we have our BEST program's North Star chart, which shows our progress on 5 key performance metrics of the program. NPS score remains at 50th percentile, and ESG percentile ranking improved further this quarter to 22nd percentile nationally. Overall, the program is working as expected with potential upside to balances, revenues and profitability over long term, if the current trend continues. As indicated during the last earnings call, we're updating our BEST program to reflect this positive momentum and a significantly higher rate environment we are in now compared to last year when the program was launched. We also recognize that the geopolitical, macroeconomic and the rate environment has changed further since our last earnings call and is expected to evolve even more over the next few months. Given that, we will schedule an investor call dedicated to provide details of the updated BEST program after second quarter earnings, which will also be around the time we complete the 1-year anniversary of our BEST program launch. We believe that it is highly effective and efficient for us to pursue the strategy of optimizing the core versus building a new core or wrap the core system with individual integrations, and that's the journey we are on. Cloud migration, API enablement, data warehousing, CRM system and integrated digital banking experience are the foundational elements of our technology road map, and we've completed implementation of most of these elements over last year or so. Many of these foundational elements have been established through partnerships with best-in-class partners, some of whom are listed on the slide, with Narmi as the latest partner that will help us deliver exceptional customer experience for digital banking. Slide 14 provides a more detailed view of the scope of the features, functionalities and the overall ecosystem in which we can now participate as a result of this expanded relationship with Narmi. Slide 15 is a short bio of our new Board member, Mihir Desai. In summary, a solid quarter with continued momentum on our transformational BEST plan, strong loan growth, disciplined expense management and improved financial returns. First, Subhadeep, you had mentioned the pipelines were strong. I wondered if you could help us size those, how large those pipelines are and maybe what the average rate for new loans was. I wouldn't give you the specific number, but I think it's sufficient for you to know that it is actually higher. I think on the yield side, we are seeing stabilization on the portfolio this quarter. Overall portfolio yields went down, but that was primarily due to some prepayment activity that we saw, and that's likely to reduce in a rising rate environment. So we are -- as we have guided also in our last call, we expect to see the yields increase. And also, I would like to point out that 60% of our book are floating-rate loans. It was $75 million impact, about a 6% reduction in tangible book. So as we have guided all along and also our annual guidance, we expect to maintain $60 million to $70 million run rate expenses for the remainder of 2022. And if you expect an increase in those expenses, we'll be sure to guide in subsequent earnings calls. I guess I'm curious sort of how many -- roughly, how many senior lenders you have today. What I would say is we continue to hire, especially on the commercial side and a little bit on the resi side. And more importantly, the new producers that we're hiring are bringing in new pipeline, and their production levels are higher than what we anticipated them to be early on. So in terms of our deposit growth, I think overall for total deposits, that stayed more or less like flat. I mean, on an average basis, it was 1% up. On the overall -- I think on an end-of-period basis, our deposits were up like around 6%. I'm not sure if you look -- because if you look at our Slide 7 of our earnings presentation, Billy, we talk about our liabilities, and it has CDs and time deposits. Just so you know, I think on the -- broadly speaking, for the first quarter, the originations mix was about 60-plus percent was commercial. So I think, overall, the mix would be 50-plus percent commercial and the rest coming through resi and consumer. Chris, so from a guidance perspective, we're still going to stick with our low single-digit deposit growth that we gave out. In terms of our -- the payroll deposits, as you know, and as the business dictates, depending on sort of as the dates of the payrolls are processed, the balances come in, and then you see the balances getting drawn down in a matter of 3 or 4 days. I think this quarter, we experienced higher inflows of payroll deposits than normally we would expect to, and we are being watchful and seeing how that trend plays out. And so how does the -- there is a sharp decline in money market, and I'm assuming the payrolls are going into now. So typically, that substantial movement you would see between money markets and now is almost always driven by payroll balances moving between -- switching between those 2 accounts. Chris, just to give you maybe a little bit of a -- Chris, just a macro color on this. On the payroll, which has its component of seasonality, like you said, and depending on the day of the week, there could be a spike at the end of period balances. But what we are seeing is the -- it seems to be the payroll itself is growing, and workers are -- as workers get back into the payroll, it looks like at least our average for the first quarter, and we don't know if that makes a trend yet. And on the commercial side, it's improved productivity from the existing bankers, new hires and specific programs that we've kind of rolled out. On the consumer side, we have the growth in the frontline bankers on the retail channel. And as I said earlier, I think commercial will continue to be 50% to 55% of the originations and as the pie grows overall. And then on the other fees this quarter, those came in a bit strong. Thank you, Adam, and thank you all for joining us today on our call and for your interest in Berkshire."
}