{
    "symbol": "PWFL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 10:28:10",
    "content": " Joining us for today's presentation is the company's CEO, Steve Towe; and Global Controller, Joaquin Fong. During the call, there will be forward-looking statements made regarding future events, including PowerFleet's future financial performance. All statements other than present and historical facts, which include any statements regarding the company's plans for future operations, anticipated future financial position, anticipated results of operation, business strategy, competitive position, company's expectations regarding opportunities for growth, demand for the company's product offering, and other industry trends are considered forward-looking statements. Such statements include, but are not limited to, the company's financial expectations for 2022 and beyond. All such forward-looking statements imply the presence of risks, uncertainties, and contingencies, many of which are beyond the company's control. The company's actual results, performance, or achievements may differ materially from those projected or assumed in any forward-looking statement. Factors that could cause actual results to differ materially could include, amongst others, SEC filings, overall economic and business conditions, demand for the company's products and services, competitive factors, emergence of new technologies and the company's cash position. Finally, I would like to remind everyone that this call will be made available for replay in the Investor Relations section of the company's website at www.powerfleet.com. Now I would like to turn the call over to PowerFleet's CEO, Mr. Steve Towe. The leadership team and I appreciated the opportunity to share with you PowerFleetâ\u0080\u0099s enhanced vision, our growth drivers, go to market strategy, software, NII roadmap, all of which we are executing on well, as you'll hear a lot about this morning. As you can see from our results, during the second quarter we built on the momentum we established in Q1 and delivered solid sequential and year-over-year growth. Moreover, the 34.6 million in total revenue in this quarter marked a 10 quarter high for PowerFleet and third successive quarter where we've overachieved external consensus estimates. Taken together, we realized very positive improvements in both operating expenses and our key profitability measures in the second quarter, all of which exceeded external consensus estimates and expectations. Overall, the leadership team and I are very encouraged by the progress we're making, the execution we're delivering, and the results we're seeing. Before I dive into our operational highlights and outlook, I'll turn it over to our Principal Finance Officer, Joaquin Fong to cover our financial results for the second quarter of 2022. Total revenue was a 10 quarter high of 34.6 million, which was up 4% from the first quarter of 2022. As Steve alluded to, we're really encouraged by the composition of revenue in the quarter, which is characterized by higher SaaS and high quality recurring revenue compared to the prior quarter and Q2 of last year. Along that line, high margin recurring and services revenue was 19.8 million or 57% of total revenue. Gross profit was 16.2 million or 47% of total revenue, compared to 16 million or 48% of total revenue in the same year ago period. Service gross profit was 12.7 million or 65% of the total service revenue, an improvement compared to 11.4 million or 63% of total service revenue in Q2 of last year. Product gross profit was 3.5 million or 23% of product revenue, compared to 4.6 million or 30% of total product revenue in the same year ago period. Looking at our expenses, total operating expenses were 17.8 million down from 18.1 million in the prior quarter, but up from 16.2 million in Q2 of last year. The sequential decrease reflects the initial impact of our ongoing rationalization efforts, which will be reducing our annual operating expenses by approximately 5 million over the next 12-month period. Looking at our profitability metrics, loss from operations improved by 2.2 million, or 58% to 1.6 million compared to a loss of 3.7 million in the first quarter of 2022. Based on our current visibility and success with our rationalization efforts, we expect to cross over to profitability on an operating basis in the first half of 2023. GAAP net loss attributable to common stockholders totaled 1.3 million, or $0.04 per basic and diluted share. Non-GAAP net income and non-GAAP metric totaled 2 million or $0.06 per basic and $0.05 per diluted share, compared to non-GAAP net income of 1.4 million or $0.04 per basic and $0.03 per diluted share in the same year ago period. Adjusted EBITDA gain, a non-GAAP metric stayed consistent at 2.8 million compared to adjusted EBITDA of 2.8 million in the same year ago period. Today PowerFleet has more than 600,000 recurring subscribers, long standing customer relationships with some of the largest companies in the world, tremendous industry experience, and proven technology that we're actively deploying globally. And not only do we have a tremendous upsell opportunity in front of us, we have the capabilities to operate in an X demanded  market that is growing at North of 20% annually. With our customer base, along with the breadth of portfolio that we have across our geographies and the end markets we operate in, we are confident we can capture significant new logos, establish new recurring revenue streams, and grow our subscriber base substantially in the years ahead. Now that I've highlighted the broader opportunity, let me dive into the increasing opportunity we're seeing currently today in our key regions and the traction that we're realizing. In the U.S., a market PowerFleet is operating for more than 20 years, we delivered a much improved 12% growth in the first half of the year, driven by building demand from our industrial customers. In addition to the robust double-digit growth, our industrial fleet segment recently surpassed 3000 customers, which is not only a testament to our commitment to innovation, but also validation that the industry is seeking enterprise technology solutions to drive improved safety and productivity across business operations. As you have heard during our Investor Day, our team has been focused on how data can help customers improve safety operations and lower risk in material handling facilities while balancing increased demand and workforce shortages. We're excited by the momentum and market acceptance of our latest products in the pedestrian safety arena, further driving our success as the best in class solution provider utilizing artificial intelligence and data science. We look forward to further accelerating the innovation of our software and data solutions and we remain fully on track to deliver our single pane of glass software interface, and our new enterprise modular SaaS approach in Q4 of 2022. From a market synergy perspective, there's lots of capability today that live and exists with our customers and verticals in our global markets, which we haven't yet bought to the North American market with advanced solutions in car leasing, insurance, electric vehicles, and connected car. With a 20-year history, tens of thousands of subscribers, and a 40% market share in the region, we're bringing to market new technology solutions that are not yet released anywhere else in the world. Last week, we announced that we expanded our IoT technological services to MDA, Israel's only national blood and medical emergency service, for more than 800 IoT-enabled defibrillators countrywide throughout Israel. In addition to the leading edge solutions we have already brought to market in the expanded IoT arena, we expect to announce some very exciting strategic innovation partnerships in Q3 for the next-generation IoT ecosystem. In other international markets, we're actively working to introduce the IoT solutions to Dubai and the United Arab Emirates, relatively untapped markets that have expressed a deep interest for our solutions. In parallel, we're seeing strong growth in Mexico and Argentina, and the team is focused on driving even more growth out of these regions. As you've heard, we're gaining momentum in our key regions and go-to-market strategy execution. We also entered Q3 in the second half of the year in a strong position supported by building customer engagement and that growing pipeline as well as several strategic opportunities, which are moving forward nicely. We anticipate that the second half of 2022 will bring more momentum, building on the very solid first half of the year, and position us for higher growth inflection in 2023. Please proceed with your questions. And then also, I think we've done a better job of choosing the business that we've taken from a profitability perspective. And also, we've been quite robust internally around making sure that we get a fair price for the costs that we are entertaining today. But I think overall, we set it as a key KPI to get that balance back going, and we're very, very pleased that we've moved from 16%, 17% up to 24%. So I get asked this question, is it getting better anytime soon, and I think the answer is, we can't give a solid answer that it's going to get better. I think from our perspective, we look to improve again next quarter off the back of malls that reengineering coming to play. But I'm not going to say, it's going to kind of all get better within the next three to six monthsâ\u0080\u0099 period. It's a bit of both and some of them are quicker wins in terms of what we can do with freight and some of the efficiency savings and then some of it is a bit longer term in terms of systems being introduced into the business, which is why we're saying it was a 12-month plan to get to that full operational run rate of the five-year reduction. So there's some in product gross margin, there's some in service gross margin in terms of the way that we're kind of managing our relationship with our suppliers and some of the synergies of bringing Pointer and PowerFleet together from a kind of economy of scale perspective. And then there's some OPEX savings as well but we've -- as you've heard, we've reinvested some of that, living within the envelope that we had in terms of putting more people on the street from a go-to-market perspective and some more kind of data science software folks as well in the development. Please proceed with your questions. First full quarter out of the gate here, starting to see some of those improvements, particularly on the gross margin front. Maybe looking into the back half of this year, it sounds like they were far from perfect visibility, but I'm wondering if you could give us some idea in terms of how you're seeing sequential visibility to product ramping into the second half of this year from a sales perspective? So I think if you look at the last three sequential quarters, we've delivered solid growth. As we said, this is a 10-Q high, which is important to us as a business that we're doing better than we've done before. So I think Q3 was quite challenging for the business in terms of revenue last year, but we're hopeful that the rhythm that we're now in will continue in back half. We're not kind of so reliant on one individual large deal or one customer that makes or breaks the quarter, that was the other kind of, I think, interesting dynamic within this quarter plus on top of that, the services move. As I've said, I think 2023 is going to look a super year, but we expect this momentum to continue through the second half. In terms of product gross margin, then I'd want to get North of 25% in this year and then I would expect we get back to the 30% plus margins in 2023 that we've experienced in the past. So in terms of that one, I'll let Joaquin give you some detail, but we were able to capitalize some software on some new products that came to market. So we are pretty much where we want to get to, relatively keeping OPEX flat, but revenue obviously growing at pace, which gives us the expanded EBITDA. I think as we invest in product development, you continue to see the capitalization of the software, but as we kind of develop the products and you'll see that start to tail off in the future. So much for working within the envelope, but as you can see, we're moving things around to get the right people and the right cost into the future areas that we want to invest in. Steve, and then just on the pipeline front, and if I could throw in there as well, right, in terms of the evolution to analytics and AI and the monetization on that front, any color you could provide on the front, it sounds like, look, we've got the new single pane of glass in the fourth quarter, but in terms of some of those opportunities, I don't know if you're willing to start to quantify that opportunity as we get out into late 2023? I mean in terms of pipeline, we're North of 15% higher in, what I call, qualified pipeline from this time last year. And in terms of the kind of monetization, so we'll be launching in Q1 the modular -- our first new module, and by that time, we would have already carved out the solutions into the modular categorization. So what that means is people will be able to buy the solutions based on that business need that we talked about in the Investor Day with the first updated kind of true, I think, AI-led module being available in Q1 next year. And as we start to kind of ramp that up and we were able to sit down and work through that upsell program that we talked about, the renewal program that we've already started to put in place, then I think another quarter out and we can give you some more concrete views on what went and how from a volume perspective. Please proceed with your questions. So in very simple terms, there's a number of components that obviously have been engineered into our hardware solutions over the years, and some of those are older than others. So what we've looked to do is to take our volume solutions and understand where there's optimization efforts in terms of the functionality, in terms of those components where there are new more advanced components that are more in screen, and it's obviously a cheaper price. And the team are just doing an actually bang-up job in terms of driving that change, and it was -- we're kind of six months into that change. We've got another probably six months to go, but ultimately, what it will lead is to a more cost effective from our perspective, units to put out in the market, which obviously helps the gross margin and bring it back and maybe exceed where it was previously. I'm now realizing it's early in the game here, but with the new sales team and the new philosophy and all that, but of the 3% total revenue growth that you had in the quarter or really from products, I suppose that would be where you would do some upsells and cross-sells. No, I think in terms of the new solutions, I mean the good news about the growth in the first half, it hasn't come from introducing new solutions to new geographies. And that's where we're very excited about that growth opportunity, particularly in the U.S. So the 12% half loan growth was -- a lot of that was in the industrial segment of the market, the traditional segments where we've launched the pedestrian warning system. And I think we're getting a better level of sales execution across in the U.S. across the board, basically in industrial and logistics. So it doesn't give you the volume, but it gives you the quality in terms of that high margin recurring revenue. So -- and as we kind of look at the U.S. market and the demands of that subscription versus the hardware model, we'll continue to evolve that over time. And where we're now really putting our foot on the accelerator for half two is those conversations where we have logistics customers or industrial customers in the U.S., all of which have -- they have connected car opportunities, they have light commercial vehicle opportunities. And I think what's really energized us is, we brought in some sales folks that have industry experience, and without any kind of incentive from us, they've all come and said, your solutions are as good as it gets out in the market. Looks like from year-end, your cash is down almost $10 million, maybe let's call it $9 million. It's in terms of the strong pipeline, but also, we're making sure that we invest in some inventory with the inflation being so crazy as those prices are still continuing to rise. And -- but as we look into 2022 second half, as we look into the first half of 2023, which we're getting more visibility on longer-term pipeline, which is great, then we felt that was the right thing to do. We are a work in progress, but I think we're making very good progress in the six -- first six months of this year, especially with the change that's taking place in the organization."
}