{
    "symbol": "PWFL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 12:15:05",
    "content": " From a profitability perspective, we improved gross profit by $4 million, reduced loss from operations from Q4 2021 to Q4 2022 by 65% and grew adjusted EBITDA 19% in 2022. For the second half of 2022 versus the first half of 2022, high margin services revenues increased 5% to $40.3 million. From a profitability standpoint, we realized a 54% or $2.9 million improvement in loss from operations, as well as a $2 million or 76% improvement in adjusted EBITDA. Compared to the same period last year, we increased gross profit by $4 million or 13%, improved our operating losses by $3.5 million or 59%, as well as saw a $2.7 million or 132% improvement in adjusted EBITDA. Venturing the business around high margin SaaS revenue is a central tenet of PowerFleet Reimagined, with the fourth quarter mix of service revenue increasing to 60% or $20 million in 2022 from 56% or $19.1 million in 2021. Product revenue, where the quarterâ\u0080\u0099s sales were focused on deals with a high attachment of SaaS service revenue was $13.1 million versus $15.3 million in Q4 last year. Fourth quarter service gross profit was $12.8 million, with margins of 64% of total service revenue in line with expectations. While deal discipline was a primary driver of quarterly product gross margins expanding to 28% of product revenue, up from 20% last year, 2022 performance was adversely impacted by $600,000 or 5% gross margin for inventory and warranty reserve adjustments and out-of-period charges. And finally, adjusted EBITDA, a non-GAAP metric in the fourth quarter of 2022 totaled $1.4 million, compared to an adjusted EBITDA of $1 million in the same year ago period. Product revenue, which drives future services revenue was $56.3 million, compared to $53 million in 2021. Gross profit was $64.2 million or 48% of revenue, compared to $60.2 million or 40% of revenue in 2021. Services gross profit was $50.5 million or 64% of total service revenue, compared to $46.6 million or 64% of total service revenue in 2021. Product gross profit was $13.7 million or 24% of total product revenue, compared to $13.5 million or 26% of product revenue in 2021. Operating expenses were $72 million, compared to $68.2 million in 2021, while net loss attributable to common stockholders totaled $11.9 million or negative $0.34 per basic and diluted share in 2022, which compares to a net loss tribute to common stockholders of $18.8 million or negative $0.52 per basic and diluted share in 2021. Please proceed with your question. Please proceed with your question. Please proceed with your question. Several questions here and really a lot to get through in a short period of time from when you issued the press release, but first of all, on the $2.5 million of the business that you did not or you walked away from in Q4, how does that break down between products and services? Please proceed with your question. Please proceed with your question."
}