{
    "symbol": "LCI",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-03 21:40:01",
    "content": " I’ll now turn the call over to Mr. Robert Jaffe, Investor Relations for Lannett. Good afternoon, everyone and thank you for joining us today to discuss Lannett Company’s fiscal 2022 first quarter financial results. On the call today are Tim Crew, Chief Executive Officer; John Kozlowski, the company’s Chief Financial Officer, Maureen Cavanaugh, our Chief Commercial Operations Officer; and Steve Lehrer, who leads our biosimilar insulin initiatives. In addition, during the course of this call, we refer to non-GAAP financial measures that are not prepared in accordance with U.S. Generally Accepted Accounting Principles and may be different from non-GAAP financial measures used by other companies. In a moment, Tim will provide brief remarks on the company’s financial results as well as recent developments and initiatives. In addition to issuing our fiscal 2022 first quarter financial results, we also announced the substantial restructuring and cost reduction plan. Overall, first quarter results were on track. Our top line and bottom line were respectively above and at our expectations, largely due to solid sales of several key products. Our gross margin, however, was lower than anticipated, primarily due to growing competitive pressures on our base portfolio. Our cash position increased to more than $105 million as of September 30, 2021, up from approximately $93 million at June 30, 2021. We continue to emphasize the importance of our cash position, as we believe it affords a strategic flexibility in how we run our business. Meanwhile, as often mentioned across the industry, we are operating in a particularly competitive environment, especially for oral generics. The market generally and some of our products, such as Probenecid, Esomeprazole, Levothyroxine Tablets, and Chlorpromazine specifically, has been deteriorating more quickly than the declines we had anticipated. This environment certainly reinforces our pivot towards expanding our portfolio to include more durable assets, such as the three respiratory and two insulin products in our pipeline. However, we do not expect the current competitive environment to abate in the near-term. First, we have revised down our fiscal 2022 guidance. And second, while preserving our core portfolio strategies, we are taking immediate and proactive steps to make Lannett a leaner and more focused organization. So with that, let's turn to the restructuring and cost reduction plan we announced earlier today. Key elements of the plan include: first, consolidating our manufacturing footprint from two facilities to one. This includes transferring liquid drug production to our main plant and Seymour, Indiana from our facility in Carmel, New York. Our Seymour plant will be strengthened in this process by increasing the technologies it supports, and expand its portfolio with smaller volume but decent margin liquid products, thus further optimizing our overall network. This includes reducing headcount and eliminating development formerly dedicated to the Carmel site, and discontinuing future development programs targeting liquid generic medications, as we no longer see adequately scaled returns in that sector. We will also raise product threshold requirements and start internally developed products and API selection earlier, the goal of which is to focus on fewer potentially larger market opportunity products and come to mark as part of the so-called first wave of generics. We will continue to be a targeted generic manufacturer focused on attractive, select internal development areas where we believe we can successfully compete. This particular exercise primarily involves scaling back or phasing out some low margin and low volume OTC products that were made at Carmel, and two very low margin prescription products. Ultimately, the plan is expected to result in a workforce reduction of approximately 11% from current levels. Another 3% or so of the workforce, mainly the plant, we expect not to replace as attrition occurs. While we tend to focus on the potentially transformational value of our durable pipeline, there are a number of interesting pipeline assets that could be launched before the end of next fiscal year, including subflooring, sulfate oral solution, sumatriptan and flutamide. We currently have approximately 12 ANDAs pending at the FDA, including partner products, plus three additional products that are approved in pending launch. We also have more than 20 products in development, and expect to add more from both external and internal efforts. With regard to our large durable partnered product pipeline, I'll provide an update on 2 of the 5, starting with our generic ADVAIR DISKUS product. We expect to receive additional comments from the FDA on the FDA assigned goal date of January 31, 2022. As previously disclosed, we expect the product to undergo more than one review cycle. The CRO site that conducted the bioequivalence and clinical studies has already been inspected by the FDA and the observations they shared, we believe are addressable. We have formally asked the FDA to schedule an inspection of the manufacturing site and look forward to their visit in the near future, regarding our biosimilar insulin glargine product. While there are always execution risks, we expect to launch this product in fiscal year 2024. In terms of our expectations for next year's clinical trial, we are not aware of a U.S. trial failure of a well-characterized biosimilar. And at this point, we believe our product is well characterized and highly similar based on the results of our structural and functional assays. We are also seeing positive trends in formulary decisions for 2022, demonstrating payers continued effort to pursue affordable insulin. Express scripts has added Viatris' biosimilar and interchangeable insulin glargine, Semglee as a preferred product for 2022 on one of their formularies. In addition, Florida, Illinois and Texas have included Walmart's ReliOn insulin as a preferred product on their 2022 state Medicaid formularies. So for all of these products, we expect only a handful of competitors and thus more durable value. Also, as noted on the last call, we are evaluating and in negotiations for additional market and product opportunities for insulin and drug device inhalation products. When combined with our targeted internal development efforts, we believe we have built and continue to expand an exciting pipeline of opportunities. While the terms of the settlement are confidential, the various court challenges levied by Genus related to the product and our right to market it have all been dismissed. To sum up today's remarks, we’ve reported better-than-expected top line for the quarter. Our core strategies remain in place, and we have begun implementing restructuring plans to become a leaner, more focused organization. However, our optimism on future expectations remains quite high. Our durable pipeline of exciting opportunities are steadily progressing, and we believe we have the capabilities, discipline and resources to get them to market over the next few years. With that in mind, our management and our Board will continue to carefully consider various options looking to enhance investor value across the near, immediate and longer term. For the 2022 first quarter, net sales were $101.5 million compared with $126.5 million for the first quarter of last year. At September 30, 2021, cash and cash equivalents totaled approximately $105 million, up from $93 million at June 30. Cash increased during the first quarter due to a few factors: first, as a result of our refinancing earlier this year, we did not have any required debt interest or principal payments in Q1. Looking ahead, we expect to receive additional income tax refunds, continue to benefit from initiatives to improve our working capital, and we have no mandatory principal payments on our debt until maturity. Accordingly, we expect to maintain a healthy cash position of $80 million plus through the end of fiscal 2022. As for our liquidity, we also have access to our $45 million credit facility, which to date, we have not drawn upon. For fiscal 2022, we now expect net sales in the range of $370 million to $400 million, down from $400 million to $440 million. Adjusted gross margin, as a percentage of net sales, of approximately 19% to 21%, down from approximately 23% to 25%. Adjusted R&D expense in the range of $25 million to $28 million, down from $26 million to $29 million. Adjusted SG&A expense ranging from $55 million to $58 million, down from $58 million to $61 million. Adjusted interest expense of approximately $52 million, unchanged. The full year adjusted effective tax rate in the range of 22% to 23%, up from 21% to 22%. Adjusted EBITDA in the range of $22 million to $32 million, down from $40 million to $55 million. And lastly, capital expenditures to be approximately $10 million to $14 million, down from $12 million to $18 million. Regarding the phasing of the quarters, we expect net sales and adjusted EBITDA in Q2 to be lower than Q1, ramping up slightly in the second half of fiscal 2022, with Q4 net sales and adjusted EBITDA to approximate Q1. But obviously, there was some revenue upside in Q1 and some downside the rest of the year. So the upside for the quarter was the strength in infectious diseases, specifically posaconazole. We had talked about that category coming down in Q1, and we saw it relatively even actually ticking up a little bit. You're seeing that in antipsychosis, which came down to a little below $4 million, which is a continuous decline from Q4. And Numbrino is still seeing sales that are less than what we were -- what we would call a more normalized number, which is -- and it's running about a little bit less than half of that. I would note, Scott, it's Tim here, that -- towards the end of last year, one of our contract manufacturing opportunities concluded, and that was part of the step down. We still are open for business and appreciate those sort of opportunities, but they're smaller this year than last year. Just to be clear, it wasn't an FDA meeting, we noted in the script that there was disciplined review letters that come back from the various parts of the FDA that reviewed those applications. Some of them take a bit longer and thus will reappear in a -- what we call the CRL, complete response letter, that we'd expect in January. All in all, I think we are where we want to be and need to continue to work with the FDA, including the overseas inspection of the facility to get this product into next fiscal year. And therefore, we noted in our script that this product could come back into our forecasting for next fiscal year. The EBITDA guidance certainly down for the rest of the year, particularly if I pull out the stronger first quarter, that EBITDA number is pretty significantly below the interest expense number, even if not cash interest expense. I know you're sitting on a lot of cash, but sometimes the debt covenants can be cumbersome. Well, Scott, we will start with the debt covenants as part of our refinancing from last year. And to bridge for this year, there's one large item that's included in our overall cash flow expectations. Scott, just to add, as John noted in the script, we are forecasting a cash balance in excess of $80 million at the end of this fiscal year. And of course, the restructuring itself will start improving our cash flows as they -- as it comes into full effect later this year. So the gross margin that we have talked about toward the end of our strategic plan in 2025 are clearly driven by the emergence into our in line from our current pipeline, the bespoke and larger durable assets. To the extent those products are successfully launched, their in-market margins are quite a bit higher than 30s, but we, of course, have -- we are expected to be higher -- well higher than the 30s. So while the pressures on our near-term portfolio are being reflected in our near-term results, most of those products would have had lower margin -- significantly lower margins by the time we launch. It's the near-term results that we're facing those pressures, and we remain optimistic about our pipeline in the out years. Thanks again for joining the call, and thanks to our employees, customers and partners still working hard in challenging times to provide high-quality, low-cost medicines for our patients. We look forward to sharing our progress on our next call and some of you perhaps at the upcoming investor conferences, which we'll be at this quarter and into next."
}