{
    "symbol": "BORR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 13:45:02",
    "content": " This was split in $90.5 million in day rate revenues for our rigs on regular contracts and $17.4 million in related party revenue, which is bareboat earnings in our Mexico joint ventures. Our free cash increased by $249.3 million in comparison to the prior quarter and is primarily driven by the cash proceeds generated from operating activities of $9.3 million, which includes the impact of $9.9 million cash interest paid and the payment of $7.5 million financing fee. Cash used in fixed asset additions of $20.4 million, mainly driven by activations of three rigs and $260.4 million of net proceeds from our August 2022 equity offering. So once this is resolved, this will dictate the amount of leverage that we put on these rigs, whether it's around $50 million to $60 million per rig level or higher level depending on the contracts. As we think about demand for these rigs, just given the â\u0080\u0093 if I were to say we went from a spot market to a one to two year term market, maybe three, depending on â\u0080\u0093 let's just think outside maybe the Middle East where contracts are longer, are we seeing durations or contract durations be ramped higher interest from customers, just given the fact that pricing really continues to go up, it seems like almost weekly, i.e., do we think we could see the rigs on three-plus year contracts or something? And if you think about rigs costing that kind of initial investment, you would have to think about day rates in excess of $200,000 to actually justify a rig in the high 200s, and you would probably have to have a contract in hand or something like seven years before somebody gets into it. So I think from the speculative behavior of our industry in the past where people would build rigs without having contracts in hand because the capital intensity increasing as much as it's doing today, I don't think people will do that, but it will require contracts of seven-year plus, and I would say day rates well over $200,000 per day for that to make sense."
}