{
    "symbol": "IAC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 13:58:23",
    "content": " But if you're selling ads and leads, meaning you're offering to help homeowners -- or you're offering to help service professionals, find new customers in a time when there's a reduction in service professionals because some stopped doing business through the pandemic, and you have a growth in homeowners looking for work to get done. That means we're focused on getting the right service professionals onto their platform, service professionals for whom the product is more likely to work, who can spend money who can deliver great customer experience. You can see here, our advertising expenses as a percent of our total adds and leads revenue in 2021, that went high to 45% that was the year we did the rebrand, which means we got the least efficiency out of our ad dollars, then improved a little bit in 2022, down to 44%, but we think we have real room for improvement to get to the levels that we've seen previously in this business. Again, there's a there's a revenue recognition difference, which is -- if you stick with the $400 billion, think what percentage do you think is spent on marketing, some say between 10% and 20%, is spent on marketing call that $40 billion to $80 billion, that's still the area that we're playing in, it's just booked. But that's with growth and ads and leads and then some declines in aggregate services revenue as we lap, having closed down a number of the complex money losing services as the year went on. So what that results in is we do expect gross profit to grow mid-single digits across the overall Angi business this year, really due to even if net -- total revenue is flat and favorable mix between ads and leads and services. And really the fixed costs leverage that exists in ads and leads, which is such a high gross margin business, but also a new reference this, you can see in the segment reporting, that our new segment reporting the magnitude of the EBITDA losses in both services and roofing in '22 for different reasons that we've documented well, throughout last year. And I think that's really important in areas like cakemaking, which we're doing with in a literal sense with food, but also in travel and, and home and things like that, like creating new tastes and creating new content around that is really important to have a brand and have a voice, which is what we have at Dotdash Meredith. You can imagine are showing that much earlier in the process, not pushing the customers for whom it's relevant through the service requests and sending them directly into a services experience and exposing that in the categories where we really can deliver those less complex services have lower average order value services, we can expose that actually more often and get more people to see that product and use that product."
}