{
    "symbol": "UTZ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 12:55:42",
    "content": " Looking at IRI retail sales in the quarter, we gained share in the salty snacks category for the 13-week period ended April 3, 2022, which again, was done through a balance of both price and volume gains as our loyal Utz consumers, combined with our very strong brand equities are driving our top line momentum. For perspective on our distribution, even though we are now per IRI, the third largest salty snack brand platform in the United States, with retail sales over the last 52 weeks of $1.45 billion, our household penetration is still only just below 50%, and we have tremendous runway for our brands to travel and grow across the country. However, it's very important to note that as inflation continues to rise, we continue to take pricing actions and drive our productivity initiatives to fully offset these increased costs, all while making the necessary investments to support the strong growth of our brands. Adjusted gross profit grew 11% and adjusted EBITDA declined 4% as margins were impacted by the supply chain cost increases that I described earlier, partially offset by our building pricing of 9.4% in the quarter and our productivity momentum. It's very clear that as expected, we are successfully lapping the impact of the pandemic on our retail sales results and due to the strength of the Utz platform and our 100-year history of consistent growth and industry know-how that we are winning share, and we are building for a much higher sales baseline for continued future growth. We are well positioned for strong organic net sales growth and market share gains in the attractive salty snack category, and we are off to a tremendous start with retail sales growth of over 19% through April 17. I would like to start by congratulating the Utz team for delivering record sales this quarter by working together as one team to supply and service our customers while ramping up pricing, optimizing our brand portfolio and delivering volume growth through high-quality customer wins that will help deliver the company's long-term top line and bottom line growth strategies. In addition, adjusted SG&A improved by 180 basis points to 23.2% of sales primarily due to expense leverage from strong sales growth, synergy benefits from our recent acquisitions, and IO route conversions. In response to these rising costs, we continue to implement pricing actions and you have been seeing these build in our sales results as price mix contribution to net sales was 6% in Q4 2021 and increased to 9.4% in Q1 2022 as we implemented new actions in mid-February. Given the continued strong consumer demand and higher pricing related to increased input costs, we are raising our total net sales growth to approximately 10% to 13%, and our organic net sales growth to approximately 8% to 10%. You raising organic revenue growth from 4% to 6% to 8% to 10%, which seems like a pretty big jump this early in the year, but you've also called out the 10-ish percent full year pricing that you're expecting and you're just a hair away from that already in the first quarter. As Ajay mentioned in his remarks and I mentioned in my remarks, the pricing engine that we have put into place that is significantly better and more talented than a year ago, not just in people but in technology, where we stand today versus where we stood 12 months ago with the installation of the new ERP and our abilities really does give us a lot of room where we think that we're in the early innings of our ability to take price and trade in all of the aspects of their price like architecture that can really benefit us as we look forward to the rest of '22, but also into like '23 and beyond."
}