{
    "symbol": "UTZ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 15:26:00",
    "content": " I am pleased to report that our very strong start to the year continued in the second quarter, with record net sales of over $350 million and our organic net sales increased 13.6% as demand from a combination of both our loyal and new consumers remains robust. While we continue to closely monitor consumer behavior and the impact high inflation is having on shopping and purchasing patterns, both continues to execute against our core strategy of reinvesting to accelerate revenue growth, including accelerating our Power Brand sales, expanding distribution, and under penetrated channels and customers continuing our national expansion and increasing our presence in key salty snack subcategories and adjacencies. As costs continue to rise, we are continuing to work closely with our retail partners to implement strategic and selective pricing actions that we've already announced in the second half of the year, to help cover inflation and enable us to continue investing in our brands, our people and our supply chain. Based on our performance year-to-date as well as our expectations for continued strong consumer demand for our brands, along with what we are seeing currently in regard to limited price elasticities, we are raising our net sales guidance for the year. In addition, based on our year-to-date performance and momentum building actions to help mitigate inflation, we now expect adjusted EBITDA to grow 2% to 5% versus our previous guidance of modest growth. Adjusted gross profit grew about 20% and adjusted EBITDA increased over 18%, as margins are beginning to stabilize, and we expect this to continue for the remainder of the year, building a stronger foundation from which to build on in fiscal 2023. In our core, which represents over 60% of our retail sales, we registered approximately 17.5% growth versus the category of 15%, with our flagship Utz brand up nearly 23% and ON THE BORDER tortilla chips up over 30%. And this shift will result in an increase of approximately 40% in consumer pool marketing spend versus 2021, with most of that spend growth actually occurring in the second half of the year. I want to build on Dylan's comments and say how proud I am of our team's ability to continue to navigate a dynamic operating environment to deliver another quarter of record net sales performance, while our margins begin to stabilize, and we return to year-over-year profit growth. A more apples-to-apples comparison would show adjusted gross margin to be 47 basis points better in the second quarter of this year versus last year, and adjusted SD&A expenses as a percent of net sales to be 40 basis points higher in the second quarter this year compared to prior year. Our adjusted EBITDA increased by 18.2% to $42.2 million or 12.1% of sales, which was slightly better than the second quarter of last year and a sequential improvement of 140 basis points relative to our first quarter 2022 results. In the second quarter, adjusted EBITDA increased 18.2% and margins modestly expanded to 12.1% of sales, which was ahead of our expectations. Decomposing the change in the adjusted EBITDA margin for the quarter, positive drivers include price/mix of 13% as we continue to take pricing actions to offset inflation, and productivity improvement of 190 basis points. Given our stronger than expected year-to-date performance, continued strong consumer demand and better than expected price elasticity, we are raising our total net sales growth outlook to 13% to 15%, and our organic net sales growth outlook to 10% to 12%. Within our net sales growth outlook, we continue to assume that sales volumes will soften in the second half of the year, but given our first half volume performance, we now expect for full year 2022 volumes to modestly grow versus the prior year. Given our stronger net sales outlook, unchanged assumptions for gross input cost inflation and the building benefits from pricing and productivity, we are raising our adjusted EBITDA growth outlook from modest growth to a growth of 2% to 5%. Given the strong second quarter performance, the weighting of adjusted EBITDA in the first half of the year versus the second half of the year, is now expected to be more balanced at approximately 49% and 51%. In addition, we continue to expect net sales dollars to be slightly more first half weighted given our strong first and second quarter sales performance, and the expected impact from strategic SKU rationalization, and price elasticity in the second half of the year. So, even with the upwardly revised full year guidance range, organic sales are expected to decelerate from about 17% in the first half to around 5% or so in the back half, which is actually even a little bit lower than the street is currently looking for. And as part of that, as mentioned on the call, that price is expected to be about 10% for the year, which is actually a little bit lower than what it delivered in the first half, but also discussed implementing some strategic pricing actions in the second half."
}