{
    "symbol": "UTZ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 14:35:41",
    "content": " Briefly touching on our third quarter financial results, total net sales grew approximately 16%, which reflects our strong organic growth of 12.6% as well as the contribution benefit from our acquisitions of 4.7%. That being said, even as we lapped very strong growth in the prior-year, our Power Brands continued the strong momentum in the quarter with growth of 17.4%, six of our nine Power Brands delivered double-digit growth. Salsa in Queso, a subcategory for us that is currently approaching $100 million in annualized retail sales, also continued to significantly outperform, once again, with growth of 22% and 65%, respectively. In our emerging geography, which is our second largest geographic area, sales increased a robust 20.6%, with our Utz Brands growing over 34% even as we lap significant above-market growth of 23% in the prior year. And consistent with the earlier context, we shared related to our tortilla chips sales performance against the overall category, and given the weighting of ON THE BORDER brand in our expansion geographies and lapping strong promotional features in the mass channel in the prior year, this impacted sales growth in the quarter in expansion. Importantly, our flagship, Utz Brands, continues to show that its brand strength travels across the United States and was again, up nearly 30% in the expansion geography, and similar to the emerging geography, was building on the prior year's growth of 21%. Also, in the developing Better-For-You segment of salty snacks, we thought it was important to share that our retail sales in the natural channel increased by over 19% in the third quarter, significantly outpacing category growth of approximately 10%. Just to name a few, since 2019, we have increased annual retail sales from about $970 million to over $1.55 billion, our market share has gone from 3.8% to 4.6%, and we've improved our salty snack category ranking from the fourth largest brand platform in the U.S. to now the third largest. We've also expanded into key subcategories, like tortilla chips, where we essentially had no share in 2019, and now we're up to almost 4% of share, driven by the acquisition of the ON THE BORDER brand, which is approaching $300 million in annual retail sales over the last 52 weeks. I would also like to congratulate all of our associates across the company for delivering another record quarter of net sales performance, along with continued sequential improvement to margins and year-over-year profit growth. Our adjusted EBITDA increased by 6.5% to $47.7 million or 13.1% of sales, which was a sequential improvement of 100 basis points relative to our second quarter 2022 results. As we have better visibility into price elasticity impact, given our third quarter results, our net sales growth outlook now assumes fourth quarter volume performance to be similar to our third quarter results, and fourth quarter price to deliver more than 12% in price/mix benefit. Given our stronger net sales outlook, unchanged assumption for gross input cost inflation and the building benefits from pricing and productivity, we are again, raising our adjusted EBITDA growth outlook from a growth of 2% to 5% to a range of $166 million to $170 million. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}