{
    "symbol": "MPWR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 09:30:03",
    "content": " Thanks, Gen. MPS achieved record second quarter revenue of $461.0 million, 22.1% higher than the first quarter of 2022, and 57.2% higher than the second quarter of 2021. Turning now to the second quarter 2022 revenue by market, in our enterprise data market, second quarter 2022 revenue of $65.2 million increased 53.4% from the first quarter of 2022, primarily due to an accelerated ramp in our data center and workstation computing sales. Second quarter 2022 industrial revenue of $55.9 million increased 15.1% from the first quarter of 2022, reflecting increased sales of products for power source and security applications. Non-GAAP gross margin for the second quarter of 2022 was 59.0%, up 70 basis points from the gross margin reported for the first quarter of 2022 and 270 basis points higher than the second quarter from a year ago. Our non-GAAP second quarter 2022 operating expenses were $92.7 million, up from the $86.6 million we spent in the first quarter of 2022 and up from the $70.3 million reported in the second quarter of 2021. For the second quarter of 2022, total stock compensation expense, including approximately $1.2 million charged to cost of goods sold was $42.9 million compared with $39.8 million recorded in the first quarter of 2022. Our second quarter 2022 GAAP other income â\u0080\u0093 other expense was $5.1 million compared with $634,000 in the first quarter of 2022. Our second quarter 2022 non-GAAP other expense was $7,000 compared with non-GAAP other income of $1.6 million in the first quarter of 2022. Second quarter 2022 non-GAAP net income was $157.0 million, or $3.25 per fully diluted share compared with $118.3 million or $2.45 per fully diluted share in the first quarter of 2022 and $86.5 million or $1.81 on a per share â\u0080\u0093 per fully diluted share in the second quarter of 2021. Cash, cash equivalents and investments were $814.1 million at the end of the second quarter of 2022 compared with $775.9 million at the end of the first quarter of 2022. For the quarter, MPS generated operating cash flow of approximately $105.2 million compared with Q1 2022 operating cash flow of $107.4 million. Accounts receivable ended the second quarter of 2022 at $125.5 million, representing 25 days of sales outstanding, which was 4 days lower than the 29 days reported at the end of the first quarter of 2022 and 1 day higher than the 24 days in the second quarter of 2021. Our internal inventories at the end of the second quarter of 2022 were $359.6 million, up from the $311 million at the end of the first quarter of 2022. We are forecasting Q3 revenue in the range of $480 million to $500 million; GAAP gross margin in the range of 58.4% to 59.0%; non-GAAP gross margin in the range of 58.7% to 59.3%; total stock-based compensation expense in the range of $42.8 million to $44.8 million, including approximately $1.3 million that would be charged to cost of goods sold; GAAP R&D and SG&A expenses between $136.2 million and $140.2 million; non-GAAP R&D and SG&A expenses in the range of $94.7 million to $96.7 million; litigation expense in the range between $2.3 million and $2.7 million; interest and other income in the range from $1.3 million to $1.7 million before foreign exchange gains and losses; fully diluted shares in the range of 47.9 million to 48.9 million shares. It tends to be on a quarterly basis, can be somewhere between $14 million and $18 million per quarter with a lot of that being testing equipment or even if we are purchasing buildings, we purchase our own office space."
}