{
    "symbol": "MPWR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 23:13:02",
    "content": " MPS had a record fourth quarter with revenue of $460.0 million, down 7.1% from revenue generated in the third quarter of 2022, but up 36.7% from the comparable quarter of 2021. Q4 2022 non-GAAP net income was $154.0 million or $3.17 per fully diluted share compared with $3.53 per share in the third quarter of 2022, and $2.12 per share in the fourth quarter of 2021. For fourth quarter â\u0080\u0093 for the fourth quarter of 2022, MPS generated operating cash flow of about $52.2 million compared with Q3 2022 operating cash flow consumed of $18.2 million. Accounts receivable ended the fourth quarter of 2022 at $182.7 million or 36 days of sales outstanding compared with the $153.4 million or 28 days of sales outstanding reported at the end of the third quarter of 2022, and the $104.8 million or 28 days reported at the end of the fourth quarter of 2021. Quinn, your line is now open. Tore, your line is now open. Alex, your line is now open. Alex, your line is now open. Ross, your line is now open. And MPS all going to move into a new type of modules I mean in modules, power module has a bad connotation, I know that I mean lot of companies in a power module business and those are 30% gross margins and I donâ\u0080\u0099t know whatâ\u0080\u0099s the right word to use it, it is a power modules and like in place okay with, but thatâ\u0080\u0099s not your old grandpaâ\u0080\u0099s, again, power modules. But â\u0080\u0093 and we sell it was all well over $100 stuff, and thatâ\u0080\u0099s kind of I see as a part of its hardware plus service and customers, the users, they donâ\u0080\u0099t need to know like how does â\u0080\u0093 how to use the product or how to â\u0080\u0093 you have to have a very deep knowledge how to design a power supply, okay. Tore, your line is now open. Quinn, your line is now open. Ross, your line is now open."
}