{
    "symbol": "MPWR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 22:47:05",
    "content": "   Company Representatives: Michael Hsing - Chief Executive Officer, Founder Bernie Blegen - Vice President, Chief Financial Officer Genevieve Cunningham - Marketing Communications Manager\n Welcome everyone to the MPS Third Quarter 2022 Earnings Webinar. MPS achieved record third quarter revenue of $495.4 million, 7.5% higher than revenue in the second quarter of 2022, and 53.1% higher than revenue in the third quarter of 2021. Third quarter automotive revenue of $87.1 million increase 42.7% from the second quarter of 2022, due primarily to new platform launches. In our enterprise data market, third quarter 2022 revenue $75.3 million increased 15.5% from the second quarter of 2022, primarily due to continued strength in our data center and workstation computing sales. Third quarter 2022 revenue represented 15.2% of MPSs third quarter 2022 revenue, compared with 9.2% in the third quarter of 2021. Consumer revenue represented 18.0% of MPSs third quarter 2022 revenue, compared with 22.8% in the third quarter of 2021. Third quarter 2022 GAAP gross margin was 58.7%, which was 10 basis points lower than the second quarter of 2022, and 110 basis points higher than the third quarter of 2021. Non GAAP gross margin for the third quarter of 2022 was 59.0%, essentially flat from the gross margin percentage reported in the second quarter of 2022 and 120 basis points higher than the third quarter from a year ago. Our GAAP operating expenses were $139.0 million in the third quarter of 2022 compared with $129.1 million in the second quarter of 2022, and $109.2 million in the third quarter of 2021. Our non GAAP third quarter 2022 operating expenses were $98.4 million, up from $92.7 million in the second quarter of 2022 and up from the $78.7 million reported in the third quarter of 2021. For the third quarter of 2022, total stock compensation expense, including approximately $1.2 million charged to cost of goods sold was $43.0 million, compared with $42.9 million recorded in the second quarter of 2022. Switching to the bottom line, third quarter 2022 GAAP net income was $124.3 million or $2.57 per fully diluted share compared with $114.7 million or $2.37 per share in the second quarter of 2022 and $68.8 million or $1.44 per share in the third quarter of 2021. Q3 2022 non GAAP net income was $170.7 million or $3.53 per fully diluted share compared with $157 million or $3.25 per share in the second quarter of 2022, and $98.6 million or $2.06 per share in the third quarter of 2021. Cash, cash equivalents and investments were $738.1 million at the end of the third quarter of 2022 compared to $814.1 million at the end of the second quarter of 2022. For the quarter, MPS generated operating cash flow of about $18.2 million compared with Q2, 2022 operating cash flow of $105.2 million. Accounts receivable ended the third quarter of 2022 at $153.4 million, representing 28 days of sales outstanding, which was three days higher than the 25 days reported at the end of the second quarter of 2022, and six days higher than the 22 days at the end of the third quarter of 2021. Our internal inventories at the end of the third quarter of 2022 were $397.4 million, up $37.8 million from the $359.6 million reported at the end of the second quarter of 2022. On this basis, you can see inventory at the end of the third quarter of 2022 represented 189 days, 29 days higher than 160 days at the end of the second quarter of 2022 and 56 days higher than the 133 days at the end of the third quarter of 2021. And if I can just follow-up on one quick point as we made in our script here, is that as the supply demand imbalance has normalized, that frees us up from just being in pure production mode to actually be able to invest time in business relationships, to be able to expand and diversify our capacity, which we talked about about three quarters ago, where we're going to go from $2 billion of capacity currently to $4 billion within the next two years, two to three years."
}