{
    "symbol": "CTRN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-29 11:34:06",
    "content": " If you have not received a copy of the release, it's available on the company's website under the Investor Relations section at www.cititrends.com. Good morning, everyone, and thanks for joining us today on our third quarter fiscal 2022 earnings call. I will begin the call with a review of third quarter results, as well as some fourth quarter to date insights. To begin, we delivered $192 million in top line sales, which equates to a three year comp stack of 1.4%, both of which were in line with our expectations. Our Buy, Move and Sell teams worked tirelessly to deliver compelling value driven trends coupled with an engaging in store experience to post a 39.8% gross profit, our 10th consecutive quarter of expanding gross profit when compared to pre pandemic 2019 levels. Total inventory at the end of the quarter was only 1% higher than 2021, an improvement from 26% higher at the end of the second quarter. Lastly, I'm pleased to share that we delivered positive operating income of $2.4 million. At the end of the second quarter, we committed to lowering our expense structure while shoring up our foundational infrastructure and most importantly, offering an exciting curated assortment that will never break the bank for our customers. More specifically, we focused on four key areas to ensure we met expectations in the third quarter, while preparing for a successful fourth quarter holiday season. They were: number one, we shipped record amounts of packaway inventory, chock full of incredible values to excite our customers; Number two, we continue to roll out new zip codes in our product cities, including Q merchandise, missy size ranges and tween girls offerings; Number three, we infused hot price points in key categories to capture market share from value shopper. And number four, we successfully lapped last year's macro supply chain issues to deliver an on time gift assortment for a strong start to the fourth quarter. It's important to recognize that the inflationary backdrop our core customers facing is truly unprecedented, particularly in the areas of rent, food, utilities and transportation. Our core customer with an annual household income of about $40,000 and 50% of our customer base having an annual household income of $25,000 and below has been hardest hit from these extreme macro pressures. Having said that, the Citi Trends customer is doing an admirable job adjusting his and her shopping patterns. What we saw in the third quarter is that our customer is shopping much closer to -- much closer to need, employing a buy now, wear now strategy for important events and end use needs in their lives. Slide back to school, which I'm pleased to report was a solid performance for Citi Trends this year. Throughout the third quarter, our traffic and conversion rates remain steady and strong and our average dollar basket size continues to hold up very well against last year's results. Through it all, I can assure you and consistent with my points in the past, the Citi Trends customer relies on -- in the heart of neighborhoods where we are the primary destination for their family apparel and accessories, home and essential needs. First, we are set-up really nicely for the remainder of fourth quarter. And lastly, it's no secret that the marketplace is right for procurement of high quality, high value goods. With that, I'll turn it over to Heather to discuss our third quarter results in detail, as well as our outlook for the second half of the year. As David mentioned, our third quarter results were in-line with our expectations despite the challenging macro backdrop and the significant inflationary headwinds our customers facing. We manage the business prudently and our teams continue to execute against our transformation strategy, delivering strong gross margins and a reduction in SG&A dollars for the quarter. We ended the quarter with a strong balance sheet, including $77.8 million of cash, well-controlled inventory and our $75 million revolving line of credit remained unused. We also completed the sale-leaseback transaction on our Roland, Oklahoma distribution center for $36 million in proceeds. The strength of our balance sheet positions us well to continue to navigate the current environment, while focusing on our strategic initiatives. As mentioned in our earnings release, we are comparing select operating results for the third quarter and 39 weeks of 2022 relative to the same periods in 2019 in order to provide a more normalized comparison of performance. Total sales for the third quarter were $192.3 million, a decrease of 15.6% versus Q3 2021, or an increase of 5.1% versus Q3 2019. Comparable sales decreased 18.3% compared to Q3 2021, lapping a 19.7% increase in Q3, 2021 versus Q3, 2019, representing a three year stack of 1.4%. Comparable store transactions versus prior year sequentially improved 760 basis points from Q2 to Q3, an improvement of 1,270 basis points from Q1. Gross margin was 39.8% versus 40.3% in Q3, 2021 and 37.4% in Q3, 2019. While SG&A expense dollars declined 7.6% versus Q3 2021, we experienced SG&A expense deleverage of 310 basis points versus Q3 2021 to a rate of 35.9% of total sales. In the third quarter, we made terrific progress, rightsizing our expense structure and driving operating efficiencies across our business. As a result, we remain on-track to deliver approximately $10 million in expense savings for the second half of 2022 or about 7% of total SG&A expense. Operating income was $31.6 million in the quarter or $2.4 million as adjusted for the gain on the sale of our distribution center, compared to operating loss of $1.6 million in Q3, 2019. Third quarter adjusted EBITDA was $7.5 million compared to $2.9 million in Q3, 2019. GAAP net income was $24.6 million in Q3, 2022, compared to net loss of $1.1 million in Q3, 2019. Earnings per diluted share was $3.02 or $0.24 as adjusted versus diluted loss per share of $0.09 in Q3, 2019. For the fourth -- for the first nine months of 2022, sales were $585.6 million, a decrease of 22% to prior year and 2.6% increase to 2019. Comparable store sales declined by 24.5% versus 2021 on-top of a 26.9% increase in 2021 sales versus 2019, a three year stack of 2.4%. EBITDA in the 39 week period, adjusted for the gain on sale of our two distribution centers was $19.6 million versus $82.2 million in 2021 and versus $22.6 million in 2019 as adjusted. Year-to-date earnings per diluted share was $6.34 or $0.35 as adjusted for the two sale leaseback transactions compared to $5.71 in the first nine months of 2021 and compared to $0.60 in 2019, $0.67 as adjusted. As David mentioned, total inventory at quarter end increased only 1.3% to Q3, 2021 versus an increase of 25.5% at the end of the second quarter. Compared to Q3 2019 total inventory decreased 5.1%, while sales increased 5.1%. Average in-store dollar inventory was down 19% compared to 2019 with units down 29%, reflecting our focus on turning goods fast and offering our customers fresh merchandise each and every time she shop. We continue to leverage this important merchandising strategy packing away near to current season goods that represents a tremendous value for our customers, while supporting our high gross margin rate. Turning to our fleet, during the quarter we opened two new stores, closed four locations and remodeled three. Year-to-date, we've added 12 new stores, closed six stores and remodeled 35 locations. As it relates to our buyback program, year-to-date we repurchased approximately 331,000 shares at an aggregate cost of $10 million, leaving approximately $50 million remaining on our program. That guidance, including the impact of the sale leaseback of the Roland distribution center included low-single digit increase in second half total sales compared with first half total sales. Gross margin in the high-30s to low 40s range for the second-half, less SG&A deleverage versus prior year and the second-half compared to the first-half due to aggressive expense reductions, net of incremental lease expense from the sale-leaseback transactions. In summary, we are pleased with our third quarter results in light of the difficult inflationary environment. While we expect these challenges to continue, our teams are focused on managing inventory and expenses, while continuing to execute against our transformation. Combined with our growth strategies, this gives us confidence in our ability to continue to delight our customers, especially during the upcoming holiday season. It's important to note that based on many external data sources, discretionary retail will likely be affected by inflationary pressures into a portion of 2023. You've seen us play offense, youâ\u0080\u0099ve seen us course correct when needed and you've seen us involve the Citi Trends brand to be as relevant as can be. Continuing to broaden the appeal of Citi Trends to new multicultural lower income households in search of trend right apparel, home and accessories at prices that don't break the bank. Number two, upgrading our fleet, continuing to upgrade our customer experience via our CTX remodel program with 42 remodels to date and combined with new stores to date within the CTX format, 78 stores or 13% of the fleet in the CTX format with many more to come. Number four, actively managing our balance sheet, longer strength of Citi Trends, Heather is focused on applying fresh and innovative thinking to managing operating expenses, working capital and cash usage. Some exciting things are afoot here when it comes to giving back and focusing on our CSR initiatives, which we will share in early 2023. I got to say, we're pretty excited about what's on the horizon. As we improve our execution and take advantage of new long overdue tools, we are optimistic about delivering better efficiencies and productivity throughout many areas of the business. As always, I want to thank the entire Citi Trends team, all the people that are the face of our brand, creators of our culture and drivers of our customer engagement. As we creamed into the rest of the quarter, we had some puts and takes based mainly on weather, but overall, our traffic conversion and sales flow was relatively consistent throughout the rest of September and October. The only thing that we really saw affected was the warm weather trends in late October into early November clipped some of our basket, because she and he bought less higher price outerwear and heavier weight clothing, that seems to have a higher retail. And then, in terms of just the environment that we're seeing out there or that you're seeing, clearly, there has been a lot of shift in focus towards value messaging, which is a sweet-spot for Citi Trends. Not everybody -- you did a remarkable job of managing your inventory levels, but not everybody in every apparel retailer has done quite as good a job. I wanted to get a sense for what you're seeing in terms of, either the promotional environment, the mark-down environment that you're seeing in Q4 as it relates to Q3 in your competitive set. So real focus, and it's really paying-off as you saw with our strong gross margin rates. So our strategy of being in their neighborhood and being everyday low-price, we're not high-low, we're not promotional, we don't need to be, because we are value all day long and our customer knows that, entrust us for it. I think within our brand positioning and where we're located, we're not seeing that big a difference, quite frankly, in the promotional environment. I think if we broaden the lens a little bit to go out to the outer rings, call it, the mall ring and the A&B centers that are kind of a little bit away from our neighborhoods. We're seeing, I would say, a heightened sense of from a promotional activity. But again, what I've learned over the course of many years as Q4 tends to be promotional, no matter what year and no matter what backdrop herein. Yeah, it's going to be promotional, but again for us, we tend to find ourselves more insulated from that activity, because where we sit in the neighborhood given our primary destination nature to our customers we don't feel this much. So I think we're watching it, we're looking at it, but it doesn't really change our behavior of that much, we got to stay focused on just making sure that the right gifts and stocking suffers are in-stock at the hot price points that we planned months ago to be in our stores and that's all unfolding nicely for us as we speak. Last one from me and I'll hop out, but just in terms of store hours for Q4 typically in need of little bit more staffing and sometimes you have a little bit of extended hours, you did less of that maybe in some years, but I wanted to just get a sense for with the addition of the rent expense from the DCs into your SG&A. I mean, we've got -- Q4 is typically a higher sales month than Q3. And you're right, there is extended hours to support that, there is a lot of product flow to support the sales. A question for you Heather, just follow up on Jeremy's question on the implied fourth quarter guide. It looks like it backs into around roughly a 4% or so operating margin, which would be below what you guys posted in the fourth quarter of 2019. Versus 2019, there are a couple of pressure points that we just want to keep in mind. 2019, we're told by our external sources is levels of freight rates that we might not see anytime in the near-future, even though we're starting to see some relief. The other on the SG&A front, of course, we're carrying the lease expense from the two sale-leaseback transactions versus 2019. And then within SG&A -- continuing within SG&A, merit increases from 2019 to 2022 in stores, DCs, we're not immune to that. I will tell you, in the third quarter it was $1.6 million. And then on an annualized basis, think $7.6 million for the two. And then, David, when you take a step-back, 2021  square foot, it's close to 150 this year, back to 128, which was pretty consistent with 2019 and 2020 levels, when you look out over the next couple of years. And then also  the initiatives that you have laid out for us in terms of CTX, the new ERP system Q lines, some of the assortment upgrades to women's and missyâ\u0080\u0099s. I think, look, as we look over the next few years, there's no doubt that we have a number of initiatives that we intend to use to fuel productivity gains and obviously overall topline gains, while continuing to expand our gross margins from a kind of topline sales point-of-view, which I sort of went on. The opportunity to grow productivity, we think is very, very bright and possible based on some serious initiatives that here to primarily haven't been part of our mix. The first and foremost is product and it's what you hit on, it is the adding of key options to our guy and woman and kids that we haven't had prior. And so, I probably put it in kind of one bucket, which is, enhancing our juniors business, that's anchored really by offering missy sizing. From a menâ\u0080\u0099s standpoint, we're beginning to see incredible traction and appealing to more multicultural guy, where we were really zeroed in on the African-American guy  American guy. And specifically, appealing to the tween girl just kind of in between the younger girl and first entry into juniors size range and we've been testing that throughout 2023 with -- excuse me in 2022 with some great results in a limited number of stores. But like you seen us do in the past two years, we will scale that pretty quickly across â\u0080\u009823 and â\u0080\u009924. There's no doubt that the system, the new ERP system that you picked-up on really is a game-changer for us. So that's the number two and it kind of sits in concert with the product initiatives as you can imagine, because we want to put all of those product initiatives in the right store and so on. And then the CTX should really kick in the gear even better than they are today, because we'll be smarter when it comes to nurturing those CTX remodels in the future. I think I'd add one more thing, which would be, our ability to utilize data in general across the business and just get smarter across all our functions. And so part of our ERP rollout was a new data center of excellence and that'll be used by all functions in the business, which will make us more efficient and productive in our DCs and across our stores from a labor and other standpoint in-store. So lots to come, but that's, a little over three four year, and I think that will all contribute to productivity. A little premature for us to share any specifics, like I mentioned in the call where we're knee-deep in planning, but I can assure you that all of what I ranked and then some are in kind of our sites to plan against them to develop a point-of-view for â\u0080\u009923, that we will share early next year. Please go ahead, your line is open now. I'll actually start with the customers and I'll turn it over to Heather for inventory and gross margin, but from a customer standpoint, we are pleased with the patterns we are seeing. And one of the biggest patterns that's exciting us is, we're attracting kind of more of that higher-end of our income range. We are seeing folks more than we normally see above that number kind of up to that $50,000, $55,000 range. And so, we're seeing some nice new customer capture their and they're responding to the portion of our mix that is the higher retail. So even though they're coming to us for what we're known for, meaning, everyday values, great churn rate products. And then on the sort of other end of the spectrum, whilst we certainly see the pressure on the $25,000 and below households, we are seeing, as I mentioned, a really interesting adjustment by those households. And what we're hearing is, their doing their best to adjust to mainly a rent landscape that's quite different than in the past, food with the assistance that they often get is manageable and then gas as you know, it's getting a little better. And it's our job to make sure our assortment on the other end of the AURs spectrum the extreme value price points, think 999 and below, it's our job to make sure we offer those in a consistent everyday basis, replenish them and keep them fresh and new. Back to-school is a terrific learning opportunity because we saw higher velocities and we were able to trial out of new things this past back to school that are definitely bearing fruit, many of which continue on through the end-of-the year and into â\u0080\u009823, meaning they just weren't back-to-school product. I'll tie into between margin and inventory, obviously, the two are very intertwined. We put some really -- the way I describe it, we put some really great product in the raptors in the beginning part of the fiscal year, tail-end of the last fiscal year, and we're excited to move those goods to the stores. So the team has been very, very focused on managing inventory to make sure that we aren't going back to what I understand have been 2019 kind of the old retail. If I could maybe pilot high  approach, we're not doing that and we can point to our average in-store dollar inventory down 19% to 2019 with units down 29%. So we're really working on making sure that the velocity is right on the products that we bring into the stores, that the margin is right and that is exciting compelling product for our very important customers. Please go ahead, your line is open now. David, would you talk just a little bit about, I mean, the 13% of the fleet that we've talked about CTX. Yeah, simple answer, we're still seeing some healthy lifts in our CTX remodeled stores. We said that single-digit lifts mid to-high single-digit lifts, and we're learning a lot from them and we're getting better and better at operating them as we look-forward to doing many more in our futures. So we're seeing a nice consistent performance across the Southeast, Southwest, Northeast, Midwest."
}