{
    "symbol": "CTRN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-24 14:35:19",
    "content": "  Operator: Greetings, and welcome to the Citi Trends 1Q 2022 Earnings Conference Call. If you have not received a copy of the release, it's available on the company's website under the Investor Relations section at www.cititrends.com. This morning, I will begin by reviewing the ongoing transformation of our business and highlight our financial and operational results for the first quarter fiscal 2022 before updating you on our focus on our highest priority, providing for our customers and associates during tough times and how we are doubling down on helping them show up for whatever comes their way. Before turning to our results, I want to recognize that the macro environment been difficult for our customers, given a number of factors, including ultra high inflation that is driving high food prices, rents and gas prices. These factors coupled with geopolitical instability and lapping the stimulus from last year, disproportionately impact our core customers, and also our associates who work tirelessly to operate our 600 plus store fleets. While it hasn't been easy for them, they are resilient, strong, and able to weather this storm, just like they have for so many other storms during the last 20 years. Importantly, Citi Trends will always be dedicated to our neighborhoods and will always be there for our loyal and new customers. Our unique ability to listen to the African, American and Latinx families we serve and respond with the right trends, fashion and essentials at the right time and the right store has never been stronger. No matter the headwinds, it's our responsibility to keep it fresh and fun for the family each and every day. I want to thank our associates throughout all functions and stores that keep Citi Trends purpose driven, and running the best way possible for our customers each and every day. However, our core customer metrics are holding up well, as we continue to see strong and consistent conversion and basket spend with basket well above 2019, and very close to 2021 levels. Looking back on the quarter, we successfully manage inventory levels and have newness and freshness arriving in stores weekly. With a soft store traffic setup, our store management teams have been intensely focusing on conversion while styling customers from head to toe in our specialty store experience to drive UPTs and healthy baskets. We remodeled 20 legacy Citi Trends stores in our new CTx format, and they are off to a great start, as customers engage with their revitalized neighborhood trends spot. As we look to the remainder of 2022, we expect the macro factors to continue to impact our customer and the broader discretionary shopping landscape. It's therefore prudent that we plan conservatively and thus, we are revising our growth targets for the rest of the year, while still comparing primarily to pre-pandemic 2019 as a baseline. With that, I'll turn the call over to Jason to discuss our first quarter results in detail, as well as our updated guidance for the balance of the year. For the first quarter of fiscal 2022, the operating environment remained difficult with headwinds of extreme inflation, freight pressures and lapping government stimulus to name a few. We ended the quarter with a strong cash balance and a clean inventory position, leaving us poised as David said to chase trends within our six cities or categories, keeping our powder dry so we can appropriately respond to our customer's needs based on the time of year and occasion. Now, let's turn to the specifics of our Q1 financial results. As mentioned in our earnings release, we are comparing select operating results for Q1 of 2022, relative to Q1 of 2019 in order to provide a more normalized comparison of performance. In addition, certain results are adjusted with 2022 figures adjusted to exclude the gain from selling our distribution center and 2019 adjusted to exclude expenses related to a proxy contest. Total sales for the first quarter were $208 million, an increase of 1.6% compared to Q1 of 2019. Comparable store sales declined 29% versus 2021 on top of a 35% increase last year versus 2019, representing a stack of 5.8%. Gross margin was 39%, 150 basis points higher than the first quarter of 2019. Our continued improvement in quarterly gross margin rates versus 2019 and prior is primarily the result of disciplined inventory management, starting with higher markups, stronger full price sell through, fewer markdowns and lower shrink rates, partially offset by 125 points of deleverage and freight costs due to the current supply chain headwinds. Adjusted SG&A for the quarter was 34.1% of sales, up from 30.9% in the first quarter of 2019. On a dollars basis, adjusted SG&A was 13.8% higher. GAAP net income was $30.2 million compared to $7.8 million in the first quarter of 2019, or as adjusted $3.6 million compared to $8.7 million. Total inventory at the end of the quarter was lower by 1.2% compared to the end of Q1, 2019. And our average in store inventory was 32.5% lower than 2019, which reflects our continued focus on freshness and improved store terms. During the quarter we completed the sale-leaseback of our distribution center in Darlington, South Carolina, resulting in gross proceeds of $46 million and a pretext gain of $35 million. As it relates to our buyback program, we repurchase approximately 170,000 shares at an aggregate cost of $5.3 million, leaving $54.7 million remaining. As we stated in the past, capital allocation is a primary focus of our Board, and we will prudently balance our use of cash between buybacks, investments in our growth strategy and ensuring adequate liquidity in this challenging environment. At the midpoint of this adjusted range, this implies the 32% increase compared to fiscal 2019. At the midpoint of this adjusted range, this represents an increase of 60% over adjusted EPS in fiscal 2019. I'll note that our full year guidance includes $2.3 million of incremental non-cash SG&A expense related to the conversion of certain cash settled awards to restricted stock, which negatively impacts diluted EPS by approximately $0.22 in our guidance. These converted awards will be fully vested during Q1 of 2023, and therefore, they will no longer result in the incremental expense after the first quarter of 2023. Finally, given our revised plans for opening 20 new stores during the year, we project capital expenditures of approximately $32 million. We recognize the challenging environment, and therefore, we are laser-focused on controlling the controllables, while we work to maximize our top line sales and amaze our customers each and every day. Before we take your questions, I want to provide some additional beliefs in our customers and business model that give us the confidence to navigate current unpredictable times and make the ongoing improvements to our model to maximize profitability in the years ahead. Our associates make it personal and often know their customers on a first name basis, and even what's happening on in their lives. Across our fleet, we play in a central role in the neighborhood where we quite literally help bring opportunities to life by suggesting value outfits for her and him and the kids for both work and play, suggesting value toys and accessories for the little ones, suggesting new value beauty items, tailored towards black and Latinx women and so much more. When I take a step back and look at how we manage the business through an incredibly challenging period, we are definitely behaving like a 75 year old startup. If you walk away with one thing today, it's the power and underlying foundational strength of a legacy value brand built by and for the neighborhoods it has served from many decades in the past and for many decades in the future. For this year and beyond as you've heard before, we remain focused on four strategic priorities; number one, growing our fleet and expanding our customer base; number two, optimizing our product mix; number three, reinvesting in our infrastructure; and number four, making a difference within the communities we serve. Your line is open. On price, I'll tell you that we've really not changed our stance versus what we've shared prior even dating back into 2021. We have maintained value on sort of the essential band within our cities, call that underwear, socks, the things that you kind of need, less trend driven, more basic driven, we've maintained those prices and really not passed on any increases to the customer. We've really managed not only the price in relationships and kind of resiliency to our customer, but also manage the ability for us to price the trend right. And bring it in at low early than maybe 2019 and prior inventory levels, which we've heard us talk about, and celebrate the trend, selling out and moving on at the next one. So, I think we've managed kind of price and assortment really successfully. On the labor headwind, I think at the end of the day, we've -- similar answer to price. As you've heard me speak, we haven't had to do drastic wage increases, but rather we've done very surgical and strategic and tactical wage increases where needed, and we've treated our people well from a cultural standpoint and from a benefit standpoint. And we've had great loyalty from our teams in our distribution centers, as well as in our stores, and of course, in our headquarters, that indicate a passionate team, ready to serve the customer no matter what function you're a part of. So, we're excited about where that's going. The pace of which we do that, we're just kind of slow it down a little bit this year. We expect to return to a faster pace in 2023 and 2024 and beyond, and we'll move-- so we'll move that 15, for sure. In respect to lowering it, it's really just a more prudent measure on our part. We want to make sure that we're able to spread our resources throughout the company around on, not only managing the current business, but getting new stores off to a great start, managing the remodels in an effective way and running our core business in these times of challenges. So, that's kind of really how we thought about it. And then, as we've entered the early parts of Q2, we've seen a continued improvement off of the improvements we saw month-to-month in Q1. They're in sort of test learn, summer and rollout, gradual over Q2 and Q3, but we're liking the traction we're seeing and that's contributing to the improved momentum. Have a great day. Your line is open. So, historically, there's been this typical seasonality where Q1 on an absolute dollar basis is significantly stronger than Q2 and Q3. What I can tell you is that the Q2 to Q4 trend run rate is very similar in our projection and guidance to what we stated earlier, meaning it gets better over the Qs and ends with the numbers that we've guided as of today. So, we're -- while we're not sharing the relationship with every single quarter, what I can tell you is the sequential improvement offers us confidence that we'll accomplish that bill from quarter-to-quarter. The order and the way I think about it is we expect to have a strong remaining summer inclusive of July 4, which is an important time period for the brand. And then as you can imagine, we're putting the right emphasis and priorities around winning the gifting season in Q4. So, that's kind of some color around how the rest of the year shapes up in our minds. And so, you can take it away that Q2 has got a little more of that $60 million decline than Q3 and Q4. But they all -- as you can imagine, we sliced away a bit from each quarter to appropriately respond to the pressures from inflation and such. Inventory levels on a year-over-year basis are up about 27%, came in maybe a little bit higher than I expected, but consistent with what we're hearing from a lot of retailers in recent weeks that inventory levels for a variety of reasons are higher than expected. In terms of thinking about your gross margins, which I think probably came in pretty close to where you might have been expecting in Q1. And if I can, I'll give you a little bit of color versus . So, an important thing to remember about our business model is that we spend a considerable effort and devotion towards capturing forward season buys from roughly November of 2021 through even as late as March of 2022, and we packaway those goods for eventual selling in really back-to-school and later. And so, when you look at our end of quarter inventory levels against last year, up like you said, kind of mid-20s, we really believe you need to pull forward season buys out of there. So, we're really up when you do that up 5% because that forward season buy amount is sitting in the rafters in our distribution centers. And we pulled it out starting in back-to-school and then continuing through holiday, and we really basically drain it and deplete it in a good way. And that's a good margin and the unbelievable deals in that bucket, so to speak. And that's important to know, because we were extremely depleted last year during the stimulus fuel Q1 period. And so, to be only up 6% on an average store, that's literally what's in our four walls. It's just a testament to the team is focus on not getting over our skis, keeping the powder dry and manage inventory levels across all of our cities in a really effective manner. So, long story short, we're not terribly concerned yet we're extra maniacal about keeping it this way. And then on your point around risk around markdowns and margins, that -- you can assume that's all built into what we shared today. Last one for me is just around the SG&A understanding also, the $2.3 million non-cash stock charge. So, presumably that's going to be spread over the next few quarters. But then in terms of your absolute spend in Q1, that’s just $71 million, down from where you were in Q2 and Q3 of last year, so managing that really well. And then also specific to that $2.3 million award, if that was hitting all in one quarter or if that was spread over multiple quarters here throughout 2022? But on part one relative to the $2.3 million, kind of one-time event that will impact and deem our EPS about $0.22 for this year, it is spread across the year. It's probably more like 30% in Q1, and then the rest of it is spread by quarter. And as Jason pointed out, it runs out as of the end of Q1 of 2023 and no longer becomes \"non-cash charge\" to the EPS number. And then going forward, we have no cash settled awards, so no mark-to-market fluctuations in our equity awards and all future equity awards will just be straight line expense based on grant fair value. And generally speaking, we think we can keep it around the levels that we kept it in Q1 of 2022, with the caveat that -- we generally do have some fluctuations through the quarters. We're generally -- as part of the higher SG&A spend through Q2 through Q4, just as it relates to the variable expenses with our sales particularly in Q4. So, I think it will -- we expect still follow directionally along the same path, but 2021 followed and even as 2019 followed and staying around the levels, starting point being where we were in Q1 of 2022. Have a great day. Your line is open. And if I run the three-year stacks out over the next few quarters, it does imply a pretty big uptick sequentially throughout the year. And it is pretty consistent methodology -- methodologically with prior talk on this in the March release, meaning we expect sequential improvement from Q2 to Q3 to Q4, largely driven by, as I mentioned a few minutes ago, the seasonal patterns in the business winning back-to-school, winning holiday, but importantly also tied to the gradual rollout and incremental volume initiatives, so to speak, within many of our cities. As I've spoken about in the March call, the addition of a missy size range, for example, the expansion and rollout of a more intense Q line last UPT stop before you check out portion of our store, the further traction of our CTx remodels, which go into comp. Really, as I'm sure you thought about it, we just kind of tamped down the lifts that we thought we would potentially achieve based on a persistent level of the inflationary impact impacting our lower income customer. So, it definitely improved sequentially, and it's bolstered by -- these are incremental relationships. In that we're seeing some really good trend shifts within some of our cities regarding the change in habits of our end customer, mainly driven by greater wear to work trending activities that is benefiting us. So, we're kind of, if you will, way more in business than last year and the prior year on wear to work clothing from black and white simple pieces that you could put together with the trend flare and so forth. And then, we're also seeing a continued strong trend in -- I guess, the flip side, the at-home portion, the still remote worker/remote caretaker and matriarch of a household who is still wearing lounge, knit, streetwear in a casual sense, and we're seeing that boom. In fact, we're seeing both those businesses really surprise us every single day, and we're feeding them as best we can. So, all of that kind of like some base things that are happening while some incremental things are happening well, are bolstering our confidence in the build, so to speak, quarter-to-quarter over the year. We're in well over 100 stores now with conversion and traffic meters -- or I would say, traffic meters and therefore, able to compute conversion. And we're just seeing this really wonderful, consistent high conversion level that is just simply not wavering even with inflationary pressures. I mean, our basket is similar to 2021 levels, never mind well above 2019. And so, all of those as it pertains to Q2, specifically -- and the rest of the year, but just kind of holding on their point about Q2, we feel really good. We're seeing incredible take rates on Memorial Day goods, as we speak. So sports is going to be a banger, and then we have a very early back-to-school season because of where our stores are located. And so, we're already seeing some good traction on things like uniforms and back-to-school goods. It's being driven by both the basket that is -- both by UPT gains, and I'm talking now versus 2019 and AUR improvement. So, similar to how we reported the -- frankly, the resiliency and the acceptance of better quality value, slightly better and higher price points for the brand, the customer has not really bolted those and that combined with higher UPTs, call it, 50-50, Chuck, to the basket is contributing that trend being up significantly against 2019, in the neighborhood of almost $8 to $10 higher than 2019. And relative to 2021, it's almost flat to 2021, which is encouraging, as you know, given what was in the market in terms of stimuli and such during 2021. So, as we look at the complexion of that basket, it really hasn't changed much because of the fact we're a trend driven brand. The only sort of aberration in a good way to that is the Q line impact, we're seeing a contribution in UPTs to the basket, incremental for sure from the Q. But everything else, apparel to non-apparel, it's kind of holding its own kind of in the same way it did in 2019. You talked about business getting better each month of the quarter, to Dana's question earlier, and the continued improvement into May. And I was just curious if you could just maybe just speak to what work you guys have done internally to understand the concerns that your consumer has in terms of the food, rent and gas inflation. I think what we've done primarily to date, Chuck, is hold a series of internal focus groups, primarily led by the field and getting direct input from our associate base who often mirrors our customer base. We're hearing a disproportionate amount of pressure on gas and hearing things like, Hey, I fill up my tank with a portion of my paycheck and then I buy my driving time, so that I don't have to fill it up again a week later. And that's a real from the heart and it makes it hurt, because that's curtailing some of their, certainly, distance driving and probably pleasure driving choices. Our customer often rents in -- way over indexes versus the average population and even a slight higher cohort of income, these guys are renters. And they're feeling the pressure of landlord -- rents going up, utilities for my rents going up, and those utility costs obviously being passed on to the renter. They're facing some really, really tough times. So, we're watching that carefully, and we're talking frequently to our associate base and they're talking to customers just to kind of keep tabs on that. We do think that there's a kind of a benefit, so to speak, for being dedicated to our neighborhoods and being there, because over 50% of our volume is literally within a three-mile or less range and around the store. And as you know, in roughly three quarters of our chain, there really aren't a lot of options shop with the family. There might be a female option in the neighborhood once in a while, but there's not a lot of options to shop for a guy, a woman and a kid and even a baby in the neighborhood. So, I think there -- to some respect, like I talked about durability of our model and the sheer fact where we're located and how we curate for our audience, that's really, I think, fortifying, frankly, our basket and conversion levels. And then lastly, the loyalty, which I've talked about -- the loyalty of our customer is, frankly, boundless. And I think short-term, we, like most of retail, is going to do some more digging in research and that's what we're going to do actually in the next couple of weeks, do a little more research quantitatively to figure out what are we missing, if anything. And then lastly, like I mentioned earlier in the call, we're just doubling down, Chuck, on what we do best. Your line is open. Hi, David, would you sort of take Chuck's last question, just one step further. It's a great question, John. I think if you go back to historical trends, we have definitely shown resilience and strength in coming out of the kind of the post period of a recessionary time. I think, these times are -- as we've all read -- are a little different and have some different characteristics associated with what we're going through today. And what we know about our customer is back in 2021, they were reaching a bit outside of the immediate local trading area, aka, driving there, going on a trip and spending some of their wallet out, I'll call it, in the regional shopping pad or zone trading area. I think in these times, what we're seeing is a little less QS trips out to that sort of regional/30-minute away hub and they're staying in the local hub, us and a local grocer and probably a dollar player and maybe a beauty store. They are staying in that area, and they're patronizing us. And that's what's, I think, continuing to support the brand and our current reported trends and what we believe will be our year for the rest of the year. So that's a belief we have in the business, and it's something that for a local shopping base is affordable. And so, back to your word of trade down, maybe it's some of that or maybe it's still shopping value, but instead of going out to the regional ring, they are going to shop value in their local ring and save on gas and stay closer to home. So, again, a lot of that's qualitative, but I think it holds together in terms of how our metrics are posting up. For example, this week, we're dropping in three different programs that are just blowout great values that we happen to have in our forward season buy bucket, and we're pretty sure the customer is going to go, Thank you. We appreciate you, like we always do because you're thinking about us and you're dropping in great new value. It's a hallmark of who we are, and the customer responds from us doing that. So, we're on pace to what we've disclosed prior, meaning well over half within the first half of the year. The new stores coming out of the gate -- new, obviously, the remodel, we're measuring it against a control group of comp stores. But we're pleased with what we're seeing, and we're feeding each of those store groups, new and remodels, the appropriate fresh goods to feed back on the sales and it's -- yeah, it’s going as planned. Last question for me is, we've heard some other companies talk about the availability of merchandise is pretty robust out there. There is, needless to say, unfortunately, for the industry, but for us, it's a good thing. And now we're seeing goods come across our desk on a daily that represent terrific values across branded goods and private label goods that represents cancellations from other brands that unfortunately don't need it anymore, but becomes something that we can pick up on an attractive basis. And so, it is a very flush environment, which Citi Trends intends to take advantage of in the right strategic manner. And like I mentioned in the call, we look to do that for bolstering -- BTS is somewhat, although we're pretty good on BTS, and now it's more about bolstering fall and holiday with looking at those opportunistic buying opportunities. And most importantly, that's right for our customer. We make sure that, that product that we're picking up is right for our African, American and Latinx families. Have a great day. Ladies and gentlemen, that does conclude today's call."
}