{
    "symbol": "X",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-03 13:00:04",
    "content": " Best cash and liquidity positions of $3.5 billion and $5.9 billion, respectively, best year-end balance sheet ever with 0.2 times net adjusted debt to EBITDA, best strategic market volumes, second best adjusted EBITDA of $4.2 billion and second best free cash flow of $1.8 billion. The strategy we are executing is delivering our low-cost iron ore and a differentiated metallic strategy; our transition to Mini Mill steelmaking, which serves as a catalyst to generate increased and resilient free cash flow and our best-in-class finishing capabilities are crucial to sustainable steel solutions. As we continue to shift our domestic steelmaking volumes from integrated to electric arc furnace production, we are not only transforming the way we make steel, which is greener and with best capabilities, but we are also transforming the earnings power of steelmaking for our company, delivering higher margins and higher and more resilient free cash flow that's powerful value creation. In just a few short years, we've created a Mini Mill road map that we expect will deliver 6 million tons of Mini Mill capabilities and annual through-cycle EBITDA of $1.3 billion and annual through-cycle free cash flow generation of $1 billion or more. Our investment in electrical steel finishing capabilities is expected to add an additional $140 million of through-cycle earnings power to our business, expand our Big River margins by about 400 basis points and adds another layer of free cash flow from the Mini Mill segment. Best iron ore to create a differentiated metallic strategy, best Mini Mill performance to fuel a free cash flow engine and best-in-class finishing capabilities to deliver our customers the sustainable steel solutions they crave. Good morning, Dave, Jess and Kevin. Good morning, Dave, Jess and Kevin. Gordon, what I would is if you come back to our -- the framework of our capital allocation strategy, that's really a guide towards the way we're thinking about how we'll spend that cash, how we'll put that cash to work, how we'll look to grow the business and provide direct returns."
}