{
    "symbol": "HSC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 10:39:06",
    "content": " Adjusting for the impact of an accounts receivable securitization program last year, the cash flow from our two segments is expected to by more than $100 million. Harsco fourth quarter consolidated revenues from continuing operations increased to $468 million, up 1% compared with the prior year quarter or 6% if you exclude the impact of foreign exchange. Free cash flow for the quarter was $3 million, this result was lower than our expectations due mainly to some delayed payments from China-based customers, some of which have since been paid in early 2023. Hazardous materials revenues reached $169 million, up 8% year-over-year with the growth led by industrial markets followed by retail. Meanwhile, soil and dredged revenues totaled $42 million, representing an increase of 13% over the prior year quarter. For the full-year, revenues from continuing operations increased almost $1.9 billion and adjusted EBITDA totaled $229 million. Beyond higher revenues and price, EBITDA drivers for Clean Earth include various efficiency initiatives with anticipated benefits of over $10 million for the year. And lastly, corporate costs are expected to be between $40 million and $42 million versus adjusted corporate costs of $33 million in 2022, and the change in corporate costs can be attributed to normal compensation increases, including incentive compensation, as well as travel, IT spending and other smaller items. Harsco's full-year adjusted EBITDA is now expected to be within a range of $240 million to $260 million, 9% year-on-year at the midpoint. Net interest expense is expected to be $100 million to $105 million, including securitization fees, compared with $75 million in 2022 and pension expense in 2023 should be in the range of $20 million to $22 million versus pension income of $9 million in 2022, largely the result of higher discount rates. Adjusting for the accounts receivable securitization last year, the underlying improvement will be roughly $100 million, despite the fact that our cash interest will increase more than $25 million in 2023."
}