{
    "symbol": "BSMX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 14:40:30",
    "content": " This good performance was mainly driven by continued growth in consumer loans, which increased almost 15% as well as improved demand in commercial loans. Our total loans increased over 12% year-on-year above the systems growth rate and posting a sequential increase of more than 2%, reflecting our solid performance in individual loans. Similarly, payroll loans also delivered solid performance during the quarter, increasing close to 18% year-on-year of personal loans increased almost 2%. As shown on Slide 10, commercial loans increased almost 9% year-on-year, driven by a double-digit increase in loans to mid-market businesses and to grow and maintain financial entities and by high single-digit growth in loans to corporate. Like the previous quarter, deposits were driven by term deposits increasing almost 20% year-on-year on the back of a higher interest rate environment. Demand deposits decreased 7% year-on-year, mainly to a 13.8% drop in corporate deposits, as we continue foregoing certain expensive corporate deposits in order to improve the overall cost of our deposits. As you can see on the Slide 13, net interest income had a solid double-digit increase of 17% year-on-year and more than 6% quarter-on-quarter, mainly driven by higher retail volumes in loans and deposits, as well as higher interest rates. The solid performance was mainly driven by 18.5% increase in insurance fees and credit cards, which increased 18% year-on-year, mainly due to the excellent performance of our LikeU credit card that we've been discussing. Provisions in the quarter declined almost 73% sequentially and 82% year-on-year, mainly driven by the release of provisions related to certain corporate clients together with a positive performance in our retail portfolio. How do you view the entrance of fully digital banks and specifically if you can provide an update on Santander's plan to launch open bank in Mexico, and maybe kind of in the context of competition as a follow-up on the deposit base evolution or the mix really because your demand deposits fell 7% and term deposits were up almost 20%, and that that definitely contrasts to some of your largest competitors that showed double-digit growth in demand deposits and only low single-digit growth in term deposits. Thanks very much, Didier. Thanks very much, Didier."
}