{
    "symbol": "CPAC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-25 14:32:03",
    "content": " Even when there has been a slight deceleration in terms of volumes, consolidated EBITDA was $120.5 million, a 33.9% increase when compared to the same period of last year, achieving a margin of 24%. Second quarter 2022 revenues were $502.9 million, a 14.1% increase when compared to the same period of last year, mainly due to an increase price of baggage cement and concrete in line with increased inflation. The gross profit increased 35.8% mainly due to a reduction in average cost as we were able to prioritize our own clinker, decrease in the over cost of using imported clinker as well as the increased revenues mentioned before. Consolidated EBITDA 120.5 million in the second quarter of '22, an increase of 33.9% when compared to the same period of last year, mainly due to operational efficiencies and increased prices. The gross profit increased 29.4%, and the consolidated EBITDA increased 27.1% when compared to the same period of last year, mainly due to the increase in sales and decreased costs, as mentioned before. Administrative expenses for the second quarter of 2022 increased 16.3% and 14.8% for the six months of the year compared to the same period of last year, in line with increased sales, mainly due to increased salaries and an increase in personnel expenses due to the union bundles that is negotiated every three years and has a larger impact during the first year. Selling expenses in both the second quarter and during the first six months of 2022, increased 19.7% compared to the same period of the previous year, mainly due to higher salaries and the union bonus as mentioned before. Sales of cement increased 18.1% in the second quarter of 2022 compared to the same period of last year, as baggage cement sales continue to be the biggest driver of demand. During the first six months of the year, cement sales increased 16% and margin improved 4.6 percentage points, in line with the quarter's results. During the second quarter of 2022, concrete and payments and mortar sales remains in line with the same period 2021; however, gross margins increased 7.5 percentage points during the same period, mainly due to our decision to focus on higher-margin products. Sales of precast materials during the second quarter of 2022 and during the first six months of the same year, decreased 4.7% and 0.7% compared to the second quarter and first six months of 2021, mainly due to a slowdown in public sector spending. The net profit for the period increased a substantial 73.9% in the second quarter of this year as compared to the same period of last year, mainly due to the higher operating profit mentioned about as well as a positive exchange rate effect. During the first six months of the year, net profit increased 57.5%, mainly due to the higher operation profit, as mentioned before. In terms of coal, the cost compared to the same quarter compared to the last quarter of the last year, it's around $10 million increase in cost and energy, something similar, around 9.5 million per quarter."
}