{
    "symbol": "CPAC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 16:15:24",
    "content": " The first quarter 2022 revenues were PEN 525.4 million, a 13% increase when compared to the same period of last year, mainly due to the strong price strategy. Moreover, gross profit increased 23.9% this quarter compared to the first quarter of 2021, mainly due to the fact that we were able to decrease cost by optimizing our clinker production, hence reducing the need of imported clinker. Administrative expenses for the first quarter of 2022 increased when compared to the first quarter of 2021, mainly due to an increase in salaries, in line with an increased inflation as well as higher expenses in software licenses and occupational health expenses. Selling expenses this quarter also increased 19.7% when compared with the same period of last year, mainly due to an increase in personnel expenses. Cement sales increased 14% this quarter when compared to the first quarter of 2021, mainly due to the increase in the average price, both from overall increase as well as from an improvement in the sales mix as we sold more of higher price type of cement. Gross margin increased 3.7 percentage points during the first quarter of 2022 compared to the same period last year, mainly due to our ability to optimize our clinker production and hence decrease the use of imported linker. This quarter, concrete payment and mortar sales decreased 12.5% when compared to the first quarter of 2021, mainly due to the sales down -- to a slowdown, sorry, in sales to the public sector and the halt in construction work experienced during the first month of the year, as COVID-19 cases resulted in lack of workers. Despite this decrease in sales volume, gross margin improved 0.9 percentage points this quarter when compared to the same period of last year, mainly due to our decision to focus on higher margin markets. During the first quarter of 2022, precast sales increased 6.3% compared to the first quarter of 2021, mainly due to the sales of higher priced products."
}