{
    "symbol": "CPAC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 15:33:03",
    "content": " Fourth quarter 2022 revenues were PEN553.8 million, a 1.7% increase when compared to the same period of last year, mainly due to the increased prices of baggage cement in line with increased inflation. Similar, gross profit increased 1.1% when compared to the fourth quarter of 2021, and consolidated EBITDA was PEN121 million in the fourth quarter, a 14.5% decrease when compared to the same period of last year, mainly due to a nonrecurring expense this quarter. Gross profit increased 16.6% and consolidated EBITDA increased 8.8% when compared to the same period of last year, mainly due to increased sales and decreased costs. Administrative expenses for the fourth quarter of 2022 increased 19.8% and 16.1% for the whole year compared to the fourth quarter and the whole year of 2021, respectively. Selling expenses during the fourth quarter of 2022 increased 55.7% when compared to the same period last year, mainly due to an increase in personnel expenses derived from larger sales force as well as a significant savings in advertising and promotion in the fourth quarter of 2021. During 2022, selling expenses increased 26.6% when compared to 2021, mainly due to the higher salaries and the union bonus and higher profit share, as mentioned before as well as an increased provision for tape payment. As bagged cement sales continue to be the biggest driver of demand, gross margin decreased 2.6 percentage points this quarter when compared to the same period of last year, mainly due to the increase in the price of coal and electricity. During the fourth quarter of 2022, concrete payment and mortar sales decreased 13.1% and 11.1% in the whole year when compared to the same period of previous year, mainly due to a significant slowdown in sales volume for private and public works. However, gross margin increased 2.5 percentage points in the fourth quarter of 2022 compared to the fourth quarter of 2021 and 2.9 percentage points in the whole year 2022 compared to 2021, mainly due to our decision to focus on higher-margin services. Sales of precast materials during the fourth quarter of 2022 and the whole year decreased 19.8% compared to the same period of last year and 13.6% in 2022 compared to 2021, respectively, mainly due to a decrease in sales volume for the public sector. Gross margin was negative in the fourth quarter of 2022, and 2022 mainly due to the adjustment of missing inventories carried out during this year, which led to an increase in cost as well as higher prices of raw material and low dilution of costs. Net profit for the fourth quarter of 2022 decreased 24.6% compared to the fourth quarter of 2021, primarily due to a decreased operating profit as nonrecurring expenses increased this quarter. During 2022, profit for the period increased 15.4% compared to the whole year 2021, primarily due to the increased revenues as well as a higher operating profit since we were able to streamline our cost despite some inflationary pressure in prices of raw material. We don't foresee a post coming in the future because even if demand goes up 5%, 10% or 15% going to 3.7 million tons, it's always much smarter to import a little bit of clinker than setting up a new plant to be used or only 20% capacity."
}