{
    "symbol": "CPAC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 09:08:06",
    "content": " The third quarter 2022 revenues were PEN553.6 million, a 9.1% increase when compared to the same period of last year, mainly due to increased prices of bagged cement in line with increased inflation. Consolidated EBITDA was PEN124.9 million in the third quarter of 2022, an increase of 6.5% when compared to the same period of last year, mainly due to increased prices and operational efficiencies. During the nine months of the year, revenues increased 12%, gross profit increased 22.8%, and consolidated EBITDA increased 19.4% when compared to the same period of last year, mainly due to increased sales and decreased cost, as mentioned before. Administrative expenses for the third quarter of this year increased 14.6% and 14.8% for the first nine months of the year, compared to the second quarter and the first nine months of last year, respectively. Selling expenses in both the third quarter and during the first nine months of this year increased 21.1% and 20% when compared to the same period of the previous year, respectively, mainly due to the higher salaries and the union bonus, as mentioned before. However, during the first nine months of the year, gross margin increased 2.9 percentage points as we were able to mitigate some of the increase in the cost of raw material with lower use of imported clinker and optimization of our own capacity. During the third quarter of 2022, concrete payments and mortar sales decreased 15% and 10.2% in the nine months of 2022 when compared to the same period of previous years, mainly due to a significant slowdown in sales volume for private and public works. Sales of precast materials during the third quarter of this year and during the first nine months of this year increased 25.5% and 10.8% compared to the third quarter and first nine months of last year, mainly due to a slowdown in public sector spending. The net profit for the period increased 5% in the third quarter of this year as compared to the same period of last year, mainly due to the higher operating profit mentioned above. During the first nine months of the year, net profit increased a substantial 35.7%, mainly due to increased revenues and lower costs, resulting in higher operating profit and about -- as mentioned above."
}