{
    "symbol": "SKIL",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-14 22:56:05",
    "content": " And shortly after close, David Osborne joined as our new SVP of Global Tech and Dev Sales, bringing experience as a former Chief Revenue Officer, and General Manager of a $500 million revenue training and e-learning business. Adjusted revenue in Q3 was $179 million, an increase of $10 million or 6% over the prior year, and year-to-date adjusted revenue was $521 million, an increase of $4 million or 1% as compared to last year. Adjusted revenue for Skillsoft content in Q3 was $87 million, unchanged from Q3 last year and year-to-date adjusted revenue was $255 million, a decrease of $3 million. Adjusted revenue for Global Knowledge for Q3 was $62 million, an increase of $11 million or 21%. Year-to-date adjusted revenue was $177 million, an increase of $15 million or 9%. Adjusted revenue was 30 million, a decrease of $1 million from Q3 last year and year-to-date adjusted revenue was $90 million a decrease of $7 million. Finally, we've narrowed the range for adjusted EBITDA and now expect it to approximate $165 million for the full year as we continue to invest in the business to drive future growth. We are proud to operate what we believe is the largest corporate digital learning business in the world, expected to generate at least $685 million and adjusted revenue in fiscal 2022 for more than 12,000 corporate customers, and more than 45 million learners. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And then when I look at, you know, sort of the guidance range, you tighten the range by about $5 million and then increase the -- the kind of a target by $13 million sort of given sort of, you're seeing really good momentum in Q3. bookings obviously still 40% left to go in the quarter and in Q4, revenues at tighter range because revenue is a lot more known at this point in time, and we were able to narrow down the adjusted EBITDA because you know that that comes in a couple of million in either direction. Please proceed with your question."
}