{
    "symbol": "PRTY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 15:18:04",
    "content": " Overall, during Q3, we saw top line results largely in line with expectations, generating total sales of $502 million, down 1.6% from last year. We delivered third quarter results that were largely in line with our expectations, including sales that continue to demonstrate strength versus pre-pandemic time frames, offset on the bottom line by temporary cost headwinds that pressured profitability. For the third quarter, consolidated revenues decreased 1.6% versus the prior year period, primarily driven by continued pressure on retail sales as we lap 2021 strong performance in addition to helium driven declines in Anagram, partially offset by continued growth in the rest of our wholesale business. Adjusted SG&A expenses were approximately $173.9 million or 34.6% of net sales, a 370 basis point increase versus the prior year primarily due to higher store labor costs as a result of wage rate growth. As we've discussed, given the continued broader supply chain challenges, we strategically brought in inventory early to ensure that we are well positioned ahead of Halloween and to rebuild our in-stock levels versus last year, approximately $40 million of the higher inventory levels is associated with inflation and approximately $67 million was driven by Halloween receipts. Our 2022 guidance assumes $90 million in cost headwinds from incremental supply chain costs, inclusive of higher freight costs into Mirage incremental material input costs and $20 million of higher helium expense, all against 2019 levels for a combined headwind of $160 million. The total global supply is not returning as rapidly as we would like, resulting in tight supply and some out of stocks for the rest of the industry as well as higher costs for all mall 2022 was expected to be a year transition from tighter immune supply to ample supply due to the start of production from Gazprom in Russia, which has the potential to increase global easy and supply about roughly a third -- but after a brief start-up in September of last year, that had experienced a fire and an explosion and that not the helium production facility out of commission. And in cost has gone up in terms of the cost pressure for the year by about $10 million versus what we would have seen previously, and that is indeed some of those costs that are flowing through that we're having to be able to put ourselves in a good position from a supply decision on Helio."
}