{
    "symbol": "PRTY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 13:57:09",
    "content": " We expect continued wholesale sales growth in the second half of the year, driven by a continuation of growth from our traditional customer base, increasing Canadian Tire business and larger Halloween orders from customers that experienced unprecedented sell-through levels last season. For the second quarter, consolidated revenues decreased 1.5% versus the prior year period, primarily driven by lower retail sales partially offset by higher wholesale sales. Retail net sales decreased 4.6% versus last year driven by lower sales of product in our core categories, driven by the macro level inflationary impact on consumers as well as the lapping of a strong comparison period when COVID restrictions began to lift last year. Wholesale revenue for the second quarter increased 13.2% versus the second quarter of 2021, principally due to higher sales to franchise customers as well as strong performance in our Canadian business. Adjusted operating expenses were approximately $151.2 million or 28.7% of net sales, a 60 basis point increase versus prior year, primarily due to higher store labor costs as a result of wage rate growth. Inventory was up approximately $250 million or 59% year-over-year, but down 14% versus the second quarter of 2019. As Brad mentioned, given the continued broader supply chain challenges, we strategically brought in inventory early to ensure that we are well positioned ahead of Halloween and to rebuild our in-stock levels versus last year. And third, approximately $25 million of higher than expected inflationary and supply chain cost impacts in the second half of 2022, driven predominantly by higher port and container fees, as well as higher freight expense than previous expectations. We estimate headwinds of approximately $90 million in incremental supply chain costs inclusive of higher freight costs , $50 million in incremental material input costs and $10 million of higher helium expense, again, all against 2019 levels."
}