{
    "symbol": "ENLC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 13:53:03",
    "content": " Thank you for joining us today to discuss our second quarter results, which include the highest second quarter adjusted EBITDA in company's history, as well as our increased 2022 guidance and plans to future increase returns to investors. Now, let's walk through our assets starting in the Permian, where we continued the momentum from last quarter by generating segment profit of $112.1 million during the second quarter of 2022. Segment profit in the quarter included approximately $9.4 million of operating expenses tied to the relocation of the Phantom plant, and $12.5 million of unrealized derivative gains. Excluding plant relocation OpEx and unrealized derivative activity, segment profit in the second quarter of 2022 grew an impressive 24% sequentially, and over 76% from the prior year quarter. Segment profit for the second quarter of 2022 came in at $89 million, including unrealized derivative gains of $11.8 million. Excluding the impact of unrealized derivative activity segment profits in the second quarter of 2022 decreased by approximately $18.9 million sequentially, mainly driven by normal seasonal activity in the NGL segment, and was relatively flat compared to the prior year period. Segment profit in the quarter included approximately $1.7 million of operating expenses tied to the relocation of the Phantom plant, and approximately $8.2 million of unrealized derivative gains. Excluding plant relocation OpEx and unrealized derivative activity, segment profit in the second quarter of 2022 decrease 3% sequentially, that grew about 1% from the prior year quarter. During the second quarter of 2022, we generated $87.1 million in segment cash flow. Excluding unrealized derivative activity, segment profit in the second quarter of 2022, increased 8% sequentially and also increased 8% from the prior year quarter. EnLink achieved $300 million of adjusted EBITDA, representing an increase of 16% from the second quarter of 2021. EnLink also achieved $68 million of free cash flow after distributions for the second quarter of 2022, driven by strong operational results. Driven by the improved performance and outlook across our segments and the incremental investments we are making, we now see free cash flow after distributions in the range of $285 million to $315 million, which at the midpoint represents our third consecutive year of generating at least $300 million of free cash flow after distributions."
}