{
    "symbol": "ENLC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 12:25:09",
    "content": " In this short time, we've set new quarterly adjusted EBITDA record, are on pace to grow 2022 adjusted EBITDA 23% over the prior year, and secured a landmark carbon transportation deal with ExxonMobil. Last night we announced quarterly â\u0080\u0093 record quarterly EBITDA of $343 million, which represents a 34% growth rate year-over-year. In various recently highlighted EnLink's opportunity by estimating 49 million metric tons per year of sub $55 per ton, capture breakevenâ\u0080\u0099s within 10 mile ratings of our system. Now, let's walk through our assets starting in the Permian where we continued the momentum from last quarter by generating segment profit of $111.4 million during the third quarter of 2022. Excluding plant relocation OpEx and unrealized derivative activity, segment profit in the third quarter of 2022 grew 8% sequentially and an impressive 74% from the prior year quarter. Excluding the impact of unrealized derivative activity, segment profit in the third quarter of 2022 increased 20% sequentially and over 28% from the prior year quarter. Segment profit in the quarter, including approximately $1.1 million of operating expenses tied to the relocation of the Phantom plant and approximately $9.5 million of unrealized derivative gains, excluding the plant relocation OpEx and unrealized derivative activity, segment profit in the third quarter of 2022 increased 4% sequentially and 7% from the prior year quarter. Excluding unrealized derivative activity, segment profit in the third quarter of 2022 increased 25% sequentially and increased 33% from the prior year quarter. Natural gas gathering volumes increased 18% sequentially and increased 22% compared to the prior year quarter, driven by our acquisition of Crestwood's North Texas assets, new producer activity, and some on-load volumes from other midstream companies in the area. EnLink also achieved $85 million of free cash flow after distributions for the third quarter of 2022, driven by strong operational results and timing of capital projects. The increased buyback activity during the third quarter takes our execution year-to-date to approximately $147 million, and we're on pace to spend $200 million on the buyback program this year. Driven by the strong results and the growing momentum in our operations, we expect to end 2022 at the top of the adjusted EBITDA guidance range of $1.29 billion, and to achieve our third consecutive year of at least $300 million in free cash flow after distributions. On Matterhorn, you know that's going as planned and so we expect the investment to be $70 million this year, and at leaves $30 million for next year for a total of $100 million, since we still expect the project financing, that is about 75% loan to value. But suffice it to say, that like you just said, we went from high single digit to low double digit, which means our expectations have increased from the last time that we were together, now whether next year that's 12% or 14% or 16% remains to be seen a little bit as we ramp up plans with our producer customers to see how the year unfolds, but itâ\u0080\u0099s in that kind of the range."
}