{
    "symbol": "BELFB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-01 08:19:10",
    "content": " The highlights this quarter were led by the Magnetic Solutions group, where gross margin rose to 20.1% in the first quarter as of 2022 as compared to 13.7% in the first quarter of 2021 as a result of higher sales from our enterprise networking customers and despite the temporary government mandate factory closes in China related to COVID. As we mentioned last quarter, demand from our commercial aerospace, direct and aftermarket customers continue to rebound and reached $6.2 million of sales during the first quarter of 2022, up 90% from last year's quarter, including the rms business we acquired in early 2021. Our strong bookings from 2021 for power products in the EV end market generated into $5.9 million of sales during the first quarter of 2022, an increase of 89% from quarter 1 last year and leaves us well positioned for incremental sales growth in the second quarter and beyond. By product group, Power Solutions and Protection sales were $58.8 million, up 35% from last year's first quarter. In addition to Dan's commentary on circuit protection and e-Mobility sales, the power group also benefited from incremental sales from the 2021 acquisition of EOS, which generated sales of $4.2 million in the first quarter of 2022. Our CUI business also remained strong for the first quarter, posting an increase of $3.8 million or 37% from Q1 2021. Our Power Solutions and Protection group had a book-to-bill ratio of 1.6 during the first quarter of 2022 and a backlog of orders of $277 million, an increase of 15% from the 2021 year-end. Sales were $43.7 million, an increase of 15% from last year's first quarter, with the continued rebound of the commercial aerospace end market, which improved by $2.9 million or 89% from last year's first quarter. The Connectivity Solutions group had a book-to-bill ratio of 1.2 during the first quarter of 2022 and a backlog of orders of $92 million as of March 31, an increase of 8% from December 31. Lastly, our Magnetic Solutions group had Q1 sales of $34.2 million, up 18% from last year's first quarter, led by higher demand for our integrated connector modules that are used in next-generation switching applications. Our selling, general and administrative expenses were $21 million or 15.4% of sales, the same from a dollar perspective from last year's first quarter, but down as a percentage of sales. But our best guess today based on what we're seeing is we do expect to be north of the $139 million marker from last year, and we do expect to be north of the $137 million, let's call it, of this quarter as well."
}