{
    "symbol": "BELFB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 17:28:03",
    "content": " Commercial aerospace continued to rebound with $7.8 million in sales, up 43% for the same period last year and up 26% sequentially. Overall, second quarter sales were $170 million, an increase of 23% from the second quarter of 2021. Power Solutions and Protection sales were $71 million, up 28% from last yearâ\u0080\u0099s second quarter. In addition to Danâ\u0080\u0099s commentary on EV sales and expedite fee invoicing, the power group also benefited from strong sales in our CUI business, which posted an increase of $1.8 million or 13% from Q2 2021. Gross margin for this group was 28.2% for the second quarter, a 230 basis point improvement from Q2 2021, largely driven by the benefits of pricing actions taken over the last year. Our Power Solutions and Protection group had a book-to-bill ratio of 1.9 during the second quarter of 2022 and a backlog of orders of $338 million, an increase of 41% from the 2021 year-end. Sales were $46.1 million, an increase of 7% from last yearâ\u0080\u0099s second quarter, mostly due to the continued rebound of the commercial aerospace end market and higher sales of our passive connector and cabling products. The Connectivity Solutions group had a book-to-bill ratio of 1.2 during the second quarter of 2022 and a backlog of orders of $103 million at June 30, an increase of 21% from December 31. Lastly, our Magnetic Solutions group had Q2 sales of $53.5 million, up 33% from last yearâ\u0080\u0099s second quarter, led by increasing demand for our integrated connector modules that are used in next-generation switching applications. Our Magnetic Solutions group had a book-to-bill ratio of 0.7 during the second quarter of 2022 and finished the quarter with $140 million of orders, down slightly from the 2021 year-end level. Our selling, general and administrative expenses were $24 million or 14% of sales, up from $21.8 million in the second quarter last year, but down as a percentage of total sales."
}