{
    "symbol": "HTHT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-28 22:32:06",
    "content": "  Joining us today is our Chairman, Mr. Qi Ji; our CEO, Mr. Hui Jin; our President, Ms. Xinxin Liu; our CFO, Ms. Chen Hui; our Deputy CFO, Ms. Fei Year-on-year; and our CEO of International Business Ms. We are happy to report that our China business grew positively  in the third quarter recovered to 90% of 2019 levels, thanks to ending up leisure travel demand as well as a rate cover of business travel. Although the continuous resurgence of COVID, we still achieved a relative good RevPAR recovery in the third quarter in China, with the RevPAR recovered to 90% of 2019 level. We found out that after upgrading to newer versions, the RevPAR would improve by roughly 20% than older version in average, at the end of the third quarter Hanting 2.7 versions and above accounted to roughly 59% of total Hanting Hotels in operation improved by 25 percentage points in 2020 -- compared to 2020. Thank you, Qi Ji and Jason. Thank you, Qi Ji and Jason. As a result, we can report the third quarter EBITDA of RMB 94 million, a significant improvement compared to the loss of RMB 115 million in the third quarter 2021 and an achievement of 213% increase compared to second quarter 2022. Total revenue grew by 16% year-over-year to RMB 4.1 billion in Q3, mainly driven by the 7.7% year-over-year revenue growth of Legacy-Huazhu to RMB 3.2 billion and 68% year-over-year revenue growth of Legacy-DH to RMB 932 million. Due to the strong business recovery of Legacy-DH Leased & Owned Hotels during this quarter, at the group level the Manachised & Franchised revenue contribution was flattish to 32% in Q3 compared to last year. But China only although considering the management fee waiver provided to our franchisees our Manachised & Franchised revenue contribution in the third quarter further expanded to 40% compared to 38% in Q3 last year, thanks to our continuous network expansion with asset-light model. Excluding DH, Legacy-Huazhu's operating income in Q3 was RMB 449 million, grew by 88% year-over-year and improved significantly from RMB 21 million a quarter ago. Excluding DH, Legacy-Huazhu recorded an adjusted EBITDA of RMB397 million declined by 20% year-over-year, but significantly improved from RMB23 million a quarter ago. Turning to page 24 on guidance, given lately there are more resurgences of COVID happened in many provinces and cities, each world expects revenue to grow 7% to 11% in the fourth quarter of 2022, compared to the fourth quarter of 2021 or, to decline 1% to 5%, if excluding DH."
}