{
    "symbol": "HTHT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-31 12:09:03",
    "content": " Given the normal business and the leisure traveling demand declined sharply due to the traffic restriction during the pandemic period, the requisition actually helps hotels to achieve relatively better occupancy rate and support the hotel’s operational performance. The ADR in Q1 was up by 1.2% compared to 2019 level as RMB 224, mainly driven by the mixed change from midscale and upper midscale hotels, but the occupancy in Q1 is 21 percentage points lower compared to 2019 due to the impact of Omicron variant outbreaks in mid-March. In Q1 2022 the reported operating loss was RMB 708 million compared to a loss of RMB 575 million last year and a positive RMB 39 million a quarter ago, mainly due to the weaker china business performance. SG&A for Legacy-Huazhu increased by 29% to RMB 424 million, the increase was mainly attributable to the increase of headcounts for our BD team to support penetration into the lower tier city, operation team in Southern and Western China, sales team for corporate customer expansion, enhanced IT team, as well as the expansion of upscale hotel division. Excluding DH, Legacy-Huazhu recorded an adjusted EBITDA loss of RMB 93 million compared to a positive EBITDA of RMB 207 million in Q1 2021, due to the impact of the large scale Omicron outbreak and also the higher cost. So we actually achieved relatively great new signings for the first quarter, but since the Omicron outbreak starting from the late March and this has very obvious impacted our new signings due to the pandemic, due to the strict traffic control, as well as the franchisees confidence level is declining as well. All right, thank you. However, you know, despite the uncertain market conditions, we are still insisting on our own strategies which including our local sales capability to capture the local demand, as well as during the pandemic we have to capture some of unusual business traveling demand which including those corporates which needs the hotels for the resumption of production and the work. All right, thank you. All right, thank you."
}