{
    "symbol": "EVRG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 12:04:05",
    "content": " I'll begin on Slide 5, and I'm pleased to report that we had another solid quarter as we delivered adjusted earnings of $2.01 per share compared to $1.97 per share in 2021. In order to allow our adjusted EPS to reflect the impact of the accounting change in the periods in which revenues were collected, we've excluded the amount of the deferral associated with the revenues collected prior to the third quarter and prior to 2022 from our third quarter and year-to-date adjusted EPS, respectively. As a result, within the quarter and year-to-date, the net impact of the change in Sibley accounting reflected in our adjusted EPS was approximately $0.01 for the quarter and $0.03 year-to-date. For the third quarter of 2022, Evergy delivered adjusted earnings of 462 million or $2.01 per share compared to 452 million or $1.97 per share in the third quarter of 2021. As David mentioned earlier, we also saw a 1.7% increase in weather-normalized demand this past quarter, which drove $0.06 per share. These positive drivers were partially offset during the quarter by higher operation and maintenance expense as well as increased depreciation expense, which impacted our EPS by $0.01 and $0.03 per share, respectively. These items were partially offset by increased O&M expense due to higher generation maintenance driven by weather and outages as well as increased vegetation management, leading to approximately $0.07 per share, $0.08 of higher depreciation expense due to increased infrastructure investment, $0.05 of increased interest expense and lower AFUDC equity, again primarily driven by higher debt outstanding at higher interest rates. These items are partially offset by an $0.11 per share increase in O&M driven by increased generation maintenance to maximize fleet availability due to higher than expected demand and power prices year-to-date, and higher vegetation management spend. $0.09 per share from COLI driven by immaterial COLI proceeds year-to-date and assuming no further COLI proceeds in fourth quarter, $0.06 driven primarily by higher interest expense. And finally, turning to Slide 14, having raised our midpoint guidance for 2022 and increased our dividend by $0.07 to $2.45 per share annualized, we are reaffirming our 2021 to 2025 long-term annualized EPS growth target of 6% to 8% and continue to target dividend growth in line with EPS at a 60% to 70% payout."
}