{
    "symbol": "PRSO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-24 12:27:04",
    "content": " GAAP operating expenses for the fourth quarter of 2022 were $16.2 million, which included a $9.9 million non-cash charge for the impairment of goodwill. The $9.9 million non-cash charge for the impairment of goodwill in the fourth quarter of 2022 was determined by performing an impairment test, of which a key factor is the price of the companyâ\u0080\u0099s common stock and resultant market capitalization. Total operating expenses for the fourth quarter of 2022 on a non-GAAP basis, which excludes stock-based compensation, amortization of reported intangible assets and the aforementioned goodwill impairment charge were $4.8 million compared with $3.7 million in the prior quarter and $3.7 million in the same quarter a year ago. On a non-GAAP basis, net loss for the fourth quarter of 2022 was $2.8 million or a loss of $0.13 per share which exclude the stock-based compensation, amortization of acquired intangibles, the change in fair value of warrant liability and the goodwill impairment charge. The weighted average number of basic and diluted shares outstanding for purposes of calculating both GAAP and non-GAAP EPS for the fourth quarter of 2022 was 20.5 million shares, which excludes 1.8 million shares of our common stock and exchangeable shares that are escrowed pursuant to the terms of an escrow agreement related to the December 2021 business combination and is subject to earn-out based on achievement of certain stock price targets. Adjusted EBITDA, which we define as GAAP net income or loss as reported, excluding stock-based compensation, amortization of reported intangibles, change in fair value of warrant liability, goodwill impairment charges, interest expense, depreciation and amortization and the provision for income taxes was negative $2.5 million in the fourth quarter of 2022 compared with negative $1.8 million in the prior quarter and negative $2.8 million in the prior year period. Specific to the first quarter of 2023, the company expects total net revenue to be in the range of $4.7 million to $5 million, which, at the midpoint, would represent sequential growth of approximately 25% and year-over-year growth of more than 40%."
}