{
    "symbol": "FLWS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-01 11:25:03",
    "content": " This is on top of more than 40% growth we saw in revenues last year and represents revenue growth of more than 75%, compared with our fiscal 2019, which was prior to the pandemic. For the fourth quarter, total net revenues were 485.9 million, essentially flat compared to 487 million in the prior year period. For the year, total net revenues increased 4% to 2.21 billion, compared with 2.12 billion in the prior year,   growth across our three business segments. Gross profit margin for the quarter was 33.7%, down 700 basis points, compared with 40.7% in the prior year period, primarily reflecting significantly increased cost of labor, shipping, commodities, and perishable inventory write-offs. Operating expenses as a percent of total revenues was 35.3% for the year, essentially unchanged compared with 35.2% in the prior year as higher marketing costs were offset by lower incentive compensation. For the quarter, adjusted EBITDA loss was 16.8 million, compared with adjusted EBITDA of 30.2 million in the prior year period, primarily reflecting significantly higher year-over-year cost for labor, shipping, commodities, and digital marketing along with perishable inventory write-offs. In our Gourmet Food and Gift Baskets segment, revenue for the fourth quarter was 148.4 million, down 2.4% compared with 152.2 million in the prior year period. In our Consumer Floral and Gift segment, revenues for the quarter increased 0.4% to 299 million, compared with 297.7 million in the prior year period. Gross profit margin was 38%, compared with 41.1% in the prior year period, primarily reflecting increased labor and shipping costs. Now BloomNet segment, revenue for the quarter increased 3.2% to 38.5 million compared with 37.3 million in the prior year period. Gross profit margin was 39.6%, compared with 43.2% in the prior year period, primarily reflecting higher shipping costs, as well as product mix. In terms of corporate expense, for the fiscal 2022 fourth quarter corporate expense, including stock-based compensation, but excluding the impact of the company's non-qualified deferred 401(k) compensation plan was 30.7 million, compared with 29.1 million in the prior year period. For the year, corporate expense, including stock-based compensation, but excluding the impact of the company's deferred compensation plan and the one-time costs associated with the acquisition of Vital Choice was 120.7 million compared with 121.2 million in the prior year. Looking ahead, we anticipate that the combination of the investments in our business platform we have discussed this morning combined with the strong growth we have seen in our customer file and Celebrations Passport program, strategic pricing initiatives, and moderation in several cost headwinds we have incurred will enable us to gradually achieve improved gross margins and bottom line results during the latter half of the current fiscal year. As a result, for the current fiscal first quarter, we anticipate revenues will be down in the range of 3% to 6%, compared with the prior year period."
}