{
    "symbol": "FLWS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-27 11:36:07",
    "content": " Nonetheless, our solid revenue growth on top of last year's tremendous increase reflects our continued focus on engaging with our customers to deepen our relationships with them, to continue the expansion of our product offering, our ability to attract a significant number of new customers, the growth of our Celebrations Passport loyalty program, and our increasing ability to personalize our customers experience using AI and machine learning. Our 7.5% consolidated growth on top of the prior year's 44.8%, illustrates our ability to drive solid growth on top of the more than $2 billion revenue level that we reached last year. Gross profit margin was 39.3%, a decline of 660 basis points compared with 45.9% in the prior-year period, primarily reflecting increased costs for inbound and outbound shipping, as well as limited availability and higher costs for labor. Segment contribution margin was $110.5 million, down 18.5% compared with $135.6 million in the prior-year period, reflecting the reduced gross margin, as well as higher year-over-year digital marketing rates. In our Consumer Floral and Gifts segment, revenues increased 3.2% at $315.1 million compared with $305.5 million in the prior-year period, with the 1-800-FLOWERS brand and Personalization Mall going at 2.8% and 4.6% respectively. Gross profit margin was 41.3%, down 270 basis points compared with 44% in the prior-year period, primarily reflecting increased costs for inbound and outbound shipping, as well as labor. contribution margin was $38.2 million, down 16.4% compared with $45.7 million in the prior-year period, primarily reflecting reduced gross margin combined with increased digital marketing rates. BloomNet revenues for the quarter increased 11.4% to $37.9 million compared with $34.1 million in the prior-year period, primarily reflecting increased wholesale shipments of hard goods. The profit margin was 42.2% down 720 basis points compared with 49.4% in the prior year period, primarily reflecting higher inbound shipping costs and product mix which offset the strong top-line growth. Inventory was a $191.1 million, up approximately $90 million compared with the end of last year's second quarter, reflecting the investments to help mitigate the headwinds we have discussed. While we're clearly operating in a challenging macro environment, we are well positioned to address these challenges and over the longer term to build on the success that we have achieved over the past several years, during which we have doubled the size of our business and significantly transformed our company, becoming a unique e-commerce platform that inspires and enables our customers to express, connect, and celebrate. I wanted to talk about what you're seeing in terms of labor and supply chain pressure as you get -- start gearing up for the big Valentine's Day and Mother's day holidays obviously from a big picture, it sounds like these headwinds aren't really going away. And that's why we saw this unexpected significant increase in our costs where we're spending $28 million, $30 million more on that component of the business than we did in prior years."
}