{
    "symbol": "FLWS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-10-29 03:14:06",
    "content": " In our Consumer Floral and Gift segments, the double-digit revenue growth in the quarter was driven by the strong performance of PersonalizationMall, along with continued growth in the 1-800-FLOWERS brand, including additional bundling of our best-selling floral arrangements with Shari’s Berries products that are already proving to be customer favorites. Celebrations Passport also continues to be one of the key drivers of strong growth in our best-performing customer cohort of multi-category, multi-brand customers, which increased more than 15% year-over-year during the quarter. With that said, we believe the combination of the positive trends in our business that I’ve just described, along with our unique business platform with our expanded product offering and the tremendous momentum that we’ve built over the past several years positions us well as our customers’ destination for the solutions they need to connect, express and celebrate with the important people in their lives. Essentially, the first quarter played out as we expected, with soft demand in July and August, reflecting the increases in travel and other activities in the macro environment this summer versus a year ago, combined with the significantly higher marketing rates this year versus last year’s record lows. The significant expansion of our product offering, both organically and through strategic acquisitions like PersonalizationMall, Shari’s Berries and now Vital Choice, the significant growth of our customer file along with continued positive customer behavior trends and the continued strong growth in our Celebrations Passport loyalty program, which is helping to drive increased frequency, retention and lifetime value. And maybe just to kind of follow-up on that and at the risk of being wrong in my math here, I still think in the September quarter, if you exclude PMall from both periods, you still had some, I don’t know, 4% consumer floral growth off of, I don’t know, 55% or so percent growth last year, something like that. Just with your numbers, both on consumer flow and overall, we highlighted it in the formal remarks about overall 9% growth on top of last year’s over 50% growth, which got us a 65% growth over 2 years ago, and very similar numbers in the consumer floral category, over 4% organic growth consumer flow on the 1-800-FLOWERS brand over last year is well over 50%, bringing us 60% growth over 2 years ago."
}