{
    "symbol": "GEL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 20:49:06",
    "content": " As we look ahead to 2023, we expect sequential growth in our full year financial results, driven primarily by visible growing volumes out of the Gulf of Mexico as well as increased volumes of soda ash as we restart our Granger facility in January and bring the full expansion online in the third quarter. Given the fixed cost economics in the Gulf of Mexico and the structural undersupply in the worldwide soda ash market, it's our view, as we sit here today, that virtually any sort of \"normal\" policy-driven economic slowdown or recession will have a limited, if not negligible impact, on the upward trajectory of our businesses. Accordingly, we do not see any reasonably likely scenario where we do not generate adjusted EBITDA next year in the low to mid-$700 million range, and we would expect to exit 2023 with a leverage ratio, again, as calculated by our senior secured lenders, near or potentially even below 4x, pretty remarkable given the challenges of the last several years. As we mentioned in our earnings release, our Offshore Pipeline Transportation segment benefited from a return to normal operations for our base business in the second quarter, along with increasing volumes from Murphy's King's Quay development, which by the way, continues to meet or even exceed our preproduction expectations. Assuming soda ash prices remain in the ZIP code of where they are today and as we have argued we believe there is biased even higher prices, at least certainly for the next 3 or 4 years, we would expect that the Granger expansion project could meaningfully exceed our original forecast for incremental segment margin once fully ramped and online. So the timing on -- in one sense, the timing on range or given that we FID-ed it 5 months from COVID, which nobody saw but allowed us to lock in our prices and then we delayed it for a year, but reinitiated and finalized all of our other installation contracts in early 2021 prior to the inflationary pressures, we think was very fortuitous, especially what it would cost in today's dollars, which every other natural expansion is going to face, is today's dollars, not the Granger kind of parameters so."
}