{
    "symbol": "RWAY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 07:44:21",
    "content": " During the first quarter, we completed 7 investments in new and existing portfolio companies, representing $135 million in new commitments, including $83.5 million in funded loans. We recorded record total and net investment income of $19.3 million and $12.5 million at the end of the first quarter, up 17% and 8.5%, respectively, from the prior year period. Net assets were $597.5 million at the end of the first quarter, up 26% from $473.5 million at the end of the first quarter 2021. Runway Growth completed seven investments in new and existing portfolio companies in the first quarter, which is traditionally a slower quarter, representing $135 million in new commitments, which resulted in $83.5 million in funded loans. At the end of the first quarter, our total investment portfolio, excluding U.S. treasury bills, had a fair value of approximately $754.3 million compared to $684.5 million at the end of 2021 and $590.1 million at the end of the first quarter 2021, representing increases of approximately 10% and 28%, respectively. As of March 31, 2022, Runway Growth had net assets of $597.5 million, decreasing slightly from $606.2 million at the end of the fourth quarter. In the first quarter, we generated total investment income of $19.3 million and net investment income of $12.5 million compared to $16.4 million and $11.5 million in the first quarter of 2021, driven by an increase in the size of our portfolio of $164.1 million or approximately 28%. For the first quarter, total operating expenses were $6.8 million, increasing from $4.9 million for the first quarter 2021, driven by an increase in debt financing fees due to our increased leverage and fees incurred pertaining to amendments of our credit facility that has resulted in more favorable terms. Our base management fee was $2.6 million, up from $2.1 million in the first quarter of 2021 due to the increase in average size of our portfolio. We recorded net unrealized depreciation of $9.2 million in the first quarter, which was the result of the decline in value of our equity portfolio, driven primarily by two public holdings. Finally, on April 28, 2022, our Board declared a dividend distribution for the second quarter of 2022 of $0.30 per share, an 11% increase from our first quarter dividend of $0.27 per share and second consecutive quarter increase in our dividend as a public company."
}