{
    "symbol": "RWAY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 20:48:05",
    "content": " Runway Growth completed nine investments in new and existing portfolio companies in the second quarter, representing $200 million in new commitments, which resulted in $151.7 million in funded loans. At the end of second quarter, our total investment portfolio excluding US treasury bills had a fair value of approximately $807.7 million compared to $754.3 million at the end of first quarter and $587.6 million for the prior year period. As of June 30, 2022 Runway Growth had net assets of $579.4 million, decreasing slightly from $597.5 million at the end of the first quarter. In the second quarter, we received $86.8 million in prepayments inclusive of interest fees and proceeds from the exercise and sale of warrants. In the second quarter, we generated total investment income of $25.2 million and net investment income of $14.5 million compared to $18.7 million and $11.3 million in the second quarter 2021. For the second quarter total operating expenses were $10.7 million increasing from $7.4 million for the second quarter 2021, driven by an increase in management fees, incentive fees, interest expense, as well as expenses related to being a public company. Runway had a net realized gain of $0.9 million for the second quarter, which compares to net realized loss of $4.6 million for the second quarter 2021. We recorded net unrealized depreciation of $16.2 million in the second quarter, largely due to the decline in fair value of our loan to Pivot3 and public holdings of Brilliant Earth common stock. As mentioned earlier, all investments in the second quarter were funded with proceeds from our revolving credit facility, as part of our strategy to generate prudent portfolio growth with leverage. Finally, on July 28 2022 our Board declared a dividend distribution for the third quarter of 2022 of $0.33 per share a 10% increase from our second quarter dividend of $0.30 per share and our third consecutive quarterly dividend increase."
}