{
    "symbol": "IIIV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-09 13:54:10",
    "content": " Our software and related services revenue grew 49% of our federal revenue in the quarter, up from 38% in the first quarter of fiscal year 2021, and surpassed our payment revenue for the first time. Revenues for the first quarter ended in December increased 66% to $73.9 million from $44.6 million for Q1 2021, reflecting continued double digit organic growth and acquisitions. Software and related services revenue continued strong growth representing a record 49% of revenues for the quarter compared to 38% for the first quarter of fiscal year 2021, reflecting the continued focus of our acquisition strategy. With the public sector acquisition effective December 31, we have crossed the 50% mark for software and related services revenues, an important milestone in our evolution. Accordingly, we have started giving more granular data on the composition of our revenue streams on page two of the supplemental presentation, including an annual recurring revenue metric, which totaled $248.4 million in Q1 22 compared to $157.5 million for Q1 2021, a growth rate of 53%. Adjusted EBITDA as a percentage of revenues increased to 24.7% for Q1 2022 or 23.7% for Q1 2021, reflecting a higher proprietary software margin and lower corporate overhead as a percentage of revenues. Segment performance; revenues in our proprietary software and payments segment increased 124% to a record $44.8 million for Q1 2022 from $20.0 for Q1 2021 principally reflecting growth in our two largest verticals, public sector and healthcare. The segment's adjusted EBITDA improved 133% to $13.6 million for Q1 2022 from $5.8 million for Q1 2021, a new quarterly record. Revenues for our merchant services segment increased 16% to $29.2 million for Q1 2022 from $25.1 million for Q1 2021 reflecting broad based growth in B2B, hospitality and retail. The adjusted EBITDA margin was 29.7% for Q4 2022 -- for Q1 2022, improving sequentially three quarters in a row with higher revenues. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead."
}