{
    "symbol": "ML",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 22:14:25",
    "content": " Adjusted revenue for the quarter grew 131% year-over-year to $84 million, another record quarter for us in our sixth consecutive quarter with a 100% year-over-year growth. We expect to continue our remarkable triple-digit year-over-year growth trend with a Q3 guidance of $85 million to $90 million of revenue, representing 102% to 114% year-over-year growth. Off the back of our full year '21 adjusted revenue of $165 million, our last 12 months of adjusted revenue is nearly $250 million, representing about a 50% increase. Given our strong momentum, we are increasing our adjusted revenue full year guidance from $325 million to $335 million upwards to $330 million to $340 million, which is a 103% increase over 2021 at the midpoint of our guidance. In Q2 '22, we generated $48 million of adjusted gross profit, which is an increase of 116% over our Q2 '21 adjusted gross profit of $22 million and represents a gross profit growth acceleration over Q1 '22. The Q2 '22 adjusted gross profit was realized at a lower gross profit margin of 57% versus 61% in Q1 '22, and is lower quarter-over-quarter given the revenue mix shift towards the Enterprise business that has a slightly lower gross margin profile versus the Consumer business. That increase gives us confidence to forecast $182 million to $204 million of 2022 full year gross profit, representing a lower gross profit margin range of 55% to 60% versus our original guidance of 60% to 65%. We are targeting $85 million to $90 million of adjusted revenue in Q3 '22, representing 102% to 114% year-over-year growth. Our Q2 adjusted EBITDA continues to keep us on track to target exiting 2022 EBITDA breakeven, and we expect Q3 '22 to realize another step down in quarterly EBITDA losses in the range of $10 million to $15 million, which is a 33% quarter-over-quarter improvement at the midpoint and an 8 percentage point margin improvement compared to Q2."
}