{
    "symbol": "RCI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 13:32:13",
    "content": " Our drivers of top line growth centered on a few main factors, namely the return of travel as well as market share gains in our Wireless business, the expansion of our footprint into new areas while capturing a growing penetration rate in our Cable business and the return of fans to the Rogers Centre together with meaningful growth in advertising revenues for our Media business. Our improvements will include changes to our network architecture that will separate our wireless and wireline networks for better redundancy; better partitioning of our network to reduce the risk of a national spreading of an outage; changes to our internal processes on how we plan, control and execute network upgrades; and, importantly, a fail-safe method of ensuring communications for emergency and essential services work all the time, irrespective of any 1 carrier's outage. Service revenue and adjusted EBITDA both increased 11% this quarter, driven by higher roaming revenue and a larger mobile phone subscriber base as the economy continued to grow. And finally, Wireless adjusted EBITDA was also up 11% year-over-year, driven by the flow-through of service revenue growth and the adjusted EBITDA service margin remained a strong 62% in the second quarter. This includes the onetime impact of the estimated $150 million in 5-day service credits and related customer costs associated with the network outage, which will flow through both our Wireless and Cable businesses in the third quarter. For the third quarter, our Wireless and Cable financials will be impacted by the network outage and by the related onetime customer service credit, but we expect customer additions will normalize through the third and fourth quarters and we'll recover more in line with our first half trending in the fourth quarter. In terms of subscriber activity, both in terms of gross adds and churn, as I mentioned earlier, we certainly saw an impact in the early days following July 8, but we're very much encouraged by the improvements we're seeing each sequential day on those metrics that really get at the customer sentiment over our entire customer base."
}