{
    "symbol": "RCI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-20 11:08:05",
    "content": " Welcome to the Rogers Communications, Inc. First Quarter 2022 Results Conference Call. Please review the cautionary language in today's earnings report and in our 2021 annual report regarding the various factors, assumptions, and risks that could cause our actual results to differ. Thanks for joining us on this very busy day as we highlight our strong Q1 results, update our positive 2022 outlook, and hold our AGM virtually later this morning. As I discussed back in January, the Rogers Organization is focused on three priorities: better execution across our businesses, increasing our investments in our networks and customer service, and continuing our extensive efforts to successfully complete the Shaw transaction in the first half of 2022. Starting with better execution, each of our businesses delivered better revenue and profitability than expected. 02:16 Across the organization, our teams are focused on targeting or accelerating all efficiencies and process improvement opportunities to deliver results that will meet or even exceed the targets we've set for ourselves. 02:37 Our wireless service revenue increased by 7% this quarter as the economy continues to grow, supporting this growth was significant improvements in quality smartphone loading, strong churn performance, and continued growth in ARPU. 02:53 Postpaid mobile phone net adds were 66,000, more than triple the volume from last year. And finally, mobile phone ARPU was a solid $57.25, up 3% from one year ago, reflecting continued improvements in roaming revenue. 03:21 In cable, we continue to make progress in improving our execution and delivering better performance. 03:46 While financials are improving nicely here, we still need to deliver better results on topline growth and subscriber additions, but we know what we need to do and the team is doing a terrific job on this journey. Revenue grew 10%, primarily as a result of higher sports related advertising and we're targeting positive adjusted EBITDA this year, with the return of in-stadium revenues for the Blue Jays at our Rogers Center. 04:18 In Q1, we continue to make the bold investments needed to ensure that we not only lead in Canada, but to continue to have amongst the best networks in the world. In the first quarter alone, we invested 34% more than we did last year. 04:40 In wireless, we are leading in 5G coverage and performance and as this technology brings new solutions for consumers and businesses, we will be ready to offer the world class network that Canadians need and can rely upon. And in our Cable business, we'll continue to lead on having the best internet and TV experience period. 05:03 As you saw yesterday, we announced a major milestone in our 10G initiative, where we successfully tested 8 gigabit symmetrical, upload and download speeds on our fiber powered networks. We generated cash flow from operating activities of more than $800 million, up 20% largely as a result of higher adjusted EBITDA. 05:37 Overall, our team's renewed focus on execution and performance is starting to deliver results and puts us in a strong operational and financial position as we come together with Shaw. 05:50 Given our confidence in our assets and our execution, we have increased our financial guidance for this year prior to any growth associated with the Shaw transaction. As we continue to build momentum, we see further opportunity for industry leading revenue, profitability, and cash flow growth in 2022 and beyond. 06:45 This transaction remains subject to the approvals of two important government bodies, ISED and the Competition Bureau, and as we have highlighted since announcing the transaction 13 months ago, both the Rogers and Shaw teams believe the strength of this transaction is compelling for all stakeholders, especially Canadians. I want to thank the entire Rogers team who have reenergized this organization by working together to not only drive better execution and improve our financial performance, but to prepare us for the years ahead. 07:41 Their entrepreneurial spirit and dedication to our customers will enable Rogers to reach its full potential, and I am grateful for their positive attitude and unified efforts as we strive to achieve our goals as an organization. Our Q1 results reflect solid operational improvements in each of wireless, cable, and media, underpinned by disciplined execution and accelerating economic growth. 08:24 In wireless, we delivered very strong postpaid mobile phone net customer additions of 66,000, a 200% increase from one-year ago, while typically a very quiet quarter. The net additions were driven by strong base management, low postpaid mobile phone churn and an overall increase in market activity. 08:47 Wireless service revenue was up 7% year-over-year, benefiting from higher roaming revenue as global travel continues to recover and from a larger postpaid subscriber base. We delivered strong customer retention this quarter, achieving postpaid mobile phone churn of 0.71%, which is a 12 basis point improvement year-over-year. 09:35 Additionally, we are seeing further migration towards the Rogers Infinite Unlimited plans, which is helping to stabilize our base ARPU in addition to the ongoing recovery in roaming revenue. 09:48 Finally, wireless adjusted EBITDA was up 7% year-over-year and adjusted EBITDA service margin remained a strong 63% in the quarter. The growth and adjusted EBITDA was driven by the flow through of service revenue, which was partially offset by investments in customer care. 10:09 In our cable business, we saw strong financial results, driven by improved execution with total cable revenue up 2% year-over-year and adjusted EBITDA, up 13%. 10:30 Cable adjusted EBITDA increased by 13%, primarily as a result of improved cost efficiencies, including lower content related costs, partially due to negotiation of certain content rates with suppliers and overall lower people related costs. 10:53 Importantly, our current cost reduction activities are being implemented in anticipation of the Shaw close where we are targeting $1 billion in synergies for the combined organization in the first 24 months following the close of the deal. 11:10 On a product basis, we saw 13,000 retail internet net customer additions in Q1, down about 3,000 from last year. In video, we saw improvements this quarter on consolidated TV loading to 14,000 net customer additions across both our legacy and Ignite products, compared to 12,000 video losses one year ago. Total customer relationships increased in the quarter to  , up 53,000 year-over-year. 11:47 Moving to our media business, results reflect further growth and recovery. Revenue grew 10% due to higher sports related revenue, including negotiation of certain content rates, while adjusted EBITDA fell 12%, driven by higher programming and production costs in the quarter and higher Toronto Blue Jays payroll due to timing of player trades. 12:39 At a consolidated level, total revenue for the first quarter was up 4% and total service revenue was up 6% year-over-year, largely driven by our wireless business. The continued expansion of our 5G networks, as well as additional cable service expansion and cable upgrades. 13:33 Cash income taxes decreased this quarter due to the tax installment in the prior year arising from our transition to a device financing business model, which results in earlier recognition of equipment revenue for income tax purposes. 13:48 Turning to the balance sheet, we exited the quarter with an adjusted debt leverage ratio of 3.3x, sequentially down from 3.4x at our 2021 year-end. You would have seen in the quarter, our announcement that we replaced the $13 billion committed bond bridge facility with our very successful Canadian dollar and U.S. dollar bond issue completed in March. 14:45 Additionally, we issued US$750 million of subordinated notes due 2082 with an initial coupon of 5.25% for the first five years in February 2022, further strengthening our balance sheet and diversifying our funding ahead of the Shaw transaction. 15:05 Our total weighted average cost of borrowings at March 31, 2022 now stands at 4.2% and our weighted average term to maturity was 12.4 years, compared to 3.95% and 11.6 years respectively at December 31, 2021. 15:25 Through these offerings and through our multi-decade track record of prudently managing our balance sheet and capital priorities, the bond markets continue to show their confidence in Rogers and their support for the Shaw transaction. 15:41 And finally, let me turn to our guidance, where we announced this morning that we are increasing our consolidated guidance ranges for Rogers on a standalone pre-Shaw basis for the full-year 2022. 15:54 We are increasing our total service revenue range by 2 points to an adjusted range of 6% to 8%, up from the 4% to 6% range provided in January. 16:16 Next, adjusted EBITDA guidance range is increasing to 8% to 10% from the 6% to 8% range announced in January, reflective of the better execution we are starting to see across most parts of our business. 16:30 And lastly, free cash flow guidance now sits at $1.9 billion to $2.1 billion, an increase of $100 million from our previous guidance range of $1.8 billion to $2.0 billion, largely reflecting the flow through of increased EBITDA growth. In wireless, on a year-over-year basis, we believe service revenue and adjusted EBITDA will continue at a 7% improvement. In Cable, we are targeting approximately 5% EBITDA growth for Q2. Additionally, we will continue to focus on improving our execution to drive better revenue growth. 17:37 And lastly, in our media business, revenue will grow year-over-year and adjusted EBITDA is expected to be up year-over-year as well, but still remain modestly negative in the quarter. 17:51 And finally, on cash taxes and free cash flow, we expect our cash taxes to be approximately $145 million, down from Q2 of 2021 when they were $175 million and similar to what we saw in Q1 of 2022. 18:09 In closing, this is an exciting time for Rogers as we drive improved execution and continue to see the growth opportunities ahead of us. And then, I guess the second question if I could, Glenn, I think you mentioned you've gotten back to maybe 90% of your roaming revenue run rate, if I remember correctly, when this all began, you kind of talked about it being a $500 million kind of hole that was created by the pandemic and then you've been slowly refilling. 21:00 We're seeing masking and travel restrictions freeing up around the world, while we continue to deal with COVID and with waves and excited to see the travel coming back both consumer, as well as business travel. I think consumer has been earliest and first to recover, but certainly we're seeing business travel will come back. 21:31 Over time, you would expect to see growth in that category and a mindful of the fact that we're looking to get back to levels that we saw three years ago. And so, I would anticipate that with the volume of flying, as well as with the rates we’ll see further recovery going forward. 21:54 On the second part of your question, David, as you would expect, there's not a lot we can say and given the transaction is in front of the government bodies, we're not going to comment on any rumors that are out there as you would expect in terms of competitive landscape. And he said what he said, and so we continue to work with the government to close the transaction and that's all I could really say at this time. And it also sounds like you are executing on some of the cost synergies on your side on the deal, wondering if you can help us think about whether you are actually taking some of those cost synergies even as we speak right now before the deal closes. In terms of identifying the   and the nature of recurring and otherwise, I think there's a mix across a few categories in there, which we've touched on in my comments and in the release around your right content rates as well as some of the people costs. We are in its early days, but we are starting to look at preparing with our vendors and getting ready to lean in on day one or earlier where we can work with suppliers who understand the size of this company when we come together with Shaw particularly on wireline. It's also creating headroom for coming together with Shaw and starting the exercise of just making preparations for when we do close on the Shaw transaction that we're able to come together with a combined entity that has leadership coming from both sides, and so that exercise we've leaned in on hard, again, more to come ahead of the transaction and following it, but you're seeing the benefits of that also in the cost reductions. 26:47 On our video net adds, that really is coming from just focus on execution and better execution around customer service, around the sales function and focused on closing the sales still much more work to be done there. And so, focused on customer service and sales execution around that where you have the best service, we should be doing better than we had been and then we are now. 27:39 A good top , particularly pleased on the Cable margin performance as Glenn talked about a number of process and efficiency improvements that yielded the upside in margin notwithstanding the additional investments we put into areas like our call centers, customer service, and a few others. And so in terms of sustainability, Glenn talked about, our outlook for the second quarter and I think that captures it. 29:25 And also Glenn on your 5% reference for Q2 relative to 13% which I saw in the first quarter, I think you guys are generally tried to set a bar on your guidance at a level that you know you can hit and hopefully you can deliver a positive surprise like you've done today. So, I want to make sure we don't read too much into that, because we can all do quick math if the difference between 13 and 5 is considered to be non-recurring items that would be about a $40 million benefit to OpEx, I think in this quarter. And so, inside that, and so we're saying 5% over to us to continue to focus on execution. We're leaning in on other things and I anticipate those will drive revenues, but they are also going to impact expenses and so that's all sort of rolled into that number Vince. So…\n 30:44 And on Cable one, I just want to make sure I don't read too much into the 8 gig trial you've been talking about and moving to all fiber in a few places. Is it – you seem to be talking a lot about fiber performance as opposed to your DOCSIS speeds lately, so just want to make sure I don't misinterpret anything. 31:13 Vince, I'll start off and then George can provide some color, but in terms of strategy, we are certainly not abandoning DOCSIS 4.0. And so, think about them as working in tandem and we're just practical depending on the area where we have that type of Cable or fiber. We're very happy with the progress that we're making on DOCSIS, both in terms of what we have available on DOCSIS 3.1 and also with DOCSIS 4, the speeds that that will provide in the not too distant future. And so, essentially what you're seeing is a combination of all these capabilities come to bear on the market. Secondly, just a quick one on media, lot of moving parts and great to see things normalize here and particularly for the Jays. In terms of mobile phone ARPU, as you saw the uptick in 3% was largely attributable to the increase in roaming revenue. One of the things you saw underlying and you'll see it play out in future quarters is a very good migration in the first quarter, much like cable, migration from the Fido brand onto the Rogers brand in part due to our emphasis, in large part due to our emphasis back on the Rogers brand, and so that migration is happening nicely. But importantly, when you look at the underlying data usage trends, we’re back up to 30% to 50% year-on-year growth rate. 35:17 And we've talked about it before as we move in and out of lockdowns and the pandemic, coming out of it, we see out of home usage spike up and therefore the used case for unlimited becomes much more compelling and so, that's what we're seeing play out in the marketplace. So, at the core, the fundamental ARPU driver is going to be data usage, and the demand is driven by 5G, higher speeds, much lower latency, etcetera. So, that's what we expect to see play out in future quarters, but the reality is, it'll be overshadowed by roaming revenue increases for the next while. 36:05 And then maybe on media, Drew, I think we're certainly in a position that we will deliver positive EBITDA for the year. We're still working through the recovery through COVID and the shifts that have occurred through COVID, but certainly seeing the resumption of live sports and our portfolio of sports asset being second to none. We're seeing a strong recovery building through the first quarter and anticipate that will continue through play-off season for the NHL, as well as through the young season underway now for the Blue Jays. And so, we were confident that we've got the best sports content available and we're seeing a recovery and growth coming back from advertising around those products. 37:04 There's been a shift in just general population trends and work schedules over the last couple of years as we all know, that's impacted some of the media assets, particularly across our radio stations. So, overall, we will see positive EBITDA through this year, it's continuing to build. 38:19 Good morning, Drew, and thanks for the question on the – on the fiber cable question. I mean, think about this way, our entire wireline and frankly wireless network is enabled by fiber. And so, whether it's DOCSIS or cheap one, really what you're talking about is the last mile, everywhere else we have fiber. 38:51 As I said, we're very comfortable and very happy with the DOCSIS roadmap and the speeds and capabilities that it provides. And the choices of where we deploy one versus the other technology really depends on the age of the infrastructure, the passive infrastructure available to us as well with its , and so that's how we make the choice, not so much on the capability that exists in the last mile. And then related to that, the capital intensity spend in Cable stepped up this quarter, and as we’re discussing fiber to the home deployments, if you have network expansion efforts. I would say the landscape at least in-part driven by us, but the market in general has pivoted from Internet only to a whole home solution that includes video that we've talked about, and increasingly, you'll see smart home monitoring as part of that. 41:22 The second piece of it relates to and the reason we're so focused on that is, how are we doing in terms of penetration of homes passed and Glenn will talk about our CapEx outlook, but think about it broadly as we want to increase the number of homes passed. And so this quarter, you saw our homes past increase by 3% on a year-on-year basis. 41:49 As we look to population growth within our territory footprint, it's growing at 5%. I think in terms of driving the KPIs through that, we – you heard me say earlier, we are confident that we have the best Internet and television experience available to customers over to us to lean in on investing in customer service and sales execution to help drive those KPIs. And so, I think we're seeing early signs of that. And so, we're on it, and seeing early signs of that more to come. 43:31 On the Cable investment, you're going to continue to see capital intensity levels, roughly where they are right now rolling forward. I think Jeff asked about it earlier, but, you alluded to your comments executing against some of the synergies into the deal close, I mean, expectations would still be, I think in your prepared remarks going, expectations on post deal close still targeting that 1 billion synergies. Think of it in that context over the 24 months post closing, we're leaning in now. I think in terms of the financing that's done, and so we have a permanent financing in place. 46:16 In terms of trajectory for delivering, I don't think there's not really anything to update further than what you've heard previously. As I’ve just mentioned, the target remains a $1 billion of cost synergies, post-closing over two years, I think that remains our target. You will see us de-lever on the back of cost synergies, as well as revenue synergies that we drive. You'll see that follow through on higher earnings, but really, that's what we're executing around Simon. 47:35 On the second part of your question Simon, in terms of macro supply chain issues, I would say they're at the margin, by and large, our supply chain has improved and we're getting what we need. 48:13 We see costs coming up, but we're managing it and we'll figure it out within our total CapEx and OpEx spend structure. 48:21 I think one add-on for that Simon is with the sheer size that we will have with coming together with Shaw, it is helping us to manage delivery schedules better with vendors. You talked about, sort of 5G and sort of continuing increases in speeds and lower latency and as some of the used cases that have increased as well, maybe just talk about how you, sort of look to monetize those increased capabilities. We're seeing really good progress in terms of our focus there, particularly on IoT. It isn't part of our disclosure yet, but you can expect to see it post Shaw close in terms of how we're progressing on that front. It will be future quarters that you start to look at that when we have something meaningful to say, that's relevant to the financial projections. 50:44 First part of your question related to, how we think about ARPU drivers beyond just data usage, and absolutely with the functionality that 5G brings in terms of not only speed quality, but other functionality and you see it in other markets, particularly in the U.S. And so you can expect us to have value propositions that start to tier it based on beyond just speed. 51:11 What we're finding is, speed is one thing, but the customers are actually interested in other factors like latency and other features, if you will that they find a value. And so what you're beginning to see with these new capabilities and now low latency really becoming a feature also as we start to light up the 3.5 gig spectrum and that will be available for wireless enablement later this year, then you're really going to start seeing not just a combination of the more spectrum equating to more speed. We've seen a few definition changes, would you agree that in terms of ARPU growth, your definition change is slightly boosting the number in terms of growth that we're seeing. In terms of the change we made, what we wanted to do was align our disclosure with what you're seeing in the Canadian landscape on disclosure and focused on mobile phone and take out some of the noise with respect to tablets etcetera. And so, the increase you're seeing of just over 3% on mobile phone ARPU, it's the same if you were to unpack it and do it on the way we used to do it. And then the second one, if I may, I was wondering if we're starting to see some fixed wireless net adds in your Internet numbers. And so, as we stated the last quarter, it's a big focus area for us. And so, I would say that ramp up was relative to our core Internet offering, light and small in terms of numbers, but we are targeting significant ramp up as we head into the second quarter and for the rest of the year, and it will be included in our cable internet net adds. 55:48 I think from a personal standpoint, and bear with the short commercial from me here, but I live on a farm road, an hour west of our offices here and over the last couple of years, spent just about every day working from my home office. I still use that to run my home office, and over the course of two years of video conferencing calls, my service was interrupted a total of five calls through that two years."
}