{
    "symbol": "SB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 11:43:05",
    "content": " Currently, the Baltic Capesize Index 5TC stands at $12,400 per day, while as in the left graph of Slide 8, 7 out of 8 of our Capesize class vessels are charted under period charters with 2.8 years average remaining duration and $22,700 average daily charter rate, totaling to $185 million contracted revenue from Capes alone. We would like to emphasize that the company is maintaining a healthy cash position of about $136 million as of 4th November 2022, another $144.3 million in available revolving trade facilities as well as $51 million in undrawn borrowing capacity available on the two loan facilities in relation to newbuild vessels. Furthermore, in addition to our contracted liquidity, we have contracted revenue from our non-cancelable spot deals and charters of more than $313 million, net of commissions and excluding scrubber revenue and additional borrowing capacity on relation to seven debt-free existing vessels and seven newbuilds upon their delivery. They are happening at a very good time as far as the contribution of that part of the fleet to the revenue of the company simply because the ships are the latest technology, very economical on fuel oil consumption at the time when fuel oil prices are around $700 per metric ton. At the same time, we are taking advantage of the high fuel oil prices to install scrubbers on the remaining capes in our fleet in order to work in spreads of around $200 for 2023, which are â\u0080\u0093 give a very quick payback of 25 years for those ships. So to understand that we have gained substantially the revenue during 2023 in terms of environmental investments because this corresponds directly to our ability to take these cases at higher charter rate compared to the average in the market based on the consumption not only this is one part so another indication of how when we are prepared is that Capes, for example, we have expanded the fleet during 2022 and earlier."
}