{
    "symbol": "MTTR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 21:19:04",
    "content": " I am pleased to share that we have delivered record revenue of $41.1 million for the fourth quarter, up 52% from a year-ago, with subscription revenue hitting a record of $19.3 million Both of these figures exceeded the high-end of our guidance range, and demonstrate the success we can achieve as we execute on our plan to digitize the built world. At the same time, we continued to see strong expansion with our enterprise customers in the fourth quarter, particularly driven by customers outside of residential real estate, for example, in retail facilities management, insurance, construction and travel and hospitality. Notably, growth of subscription revenue from vertical markets outside of real estate from new and existing enterprise customers has continued to grow over the past several quarters. Services revenue for the fourth quarter was $8.3 million, a 122% increase year-over-year, driven primarily by growth in all of our services offerings. Our service offerings include digital content for marketing residential real estate listings in the U.S. capture services, which rapidly captures our customers physical spaces at scale with contracted certified Matterport technicians globally and other industry specific and inept offerings. Now the last point is, you may remember in our Q3 call, we released the Enterprise Essentials package, which is a new pricing and service offering or subscription offering for large customers, and it is more value-based pricing, targeted at the various vertical markets that are some of the major growth drivers of the business right now. And as we discussed over a year or so ago, as this product really took hold was not just for the long tail of residential real estate and putting a Digital Twin in the hands of every homeowner or a real estate agent, but actually connecting with the enterprise and mid-market companies that now had a way to evaluate our technology without using one of our specialty cameras to get started. And then finally, the outperformance can again come from continued growth from those enterprise customers, along with some of the new service offerings, such as Digital Pro and if we see the small and medium business kind of return to growth as we go through the year."
}