{
    "symbol": "CFG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 14:55:06",
    "content": " Moving to Slide 7, given the Fed’s recent rate hike and the expectation for Fed funds rate to end the year in the 225 to 250 basis points range, we thought it would be helpful to discuss why we are confident that we will realize meaningful benefits from rising rates as the forward curve plays out. Your line is now open. But I think the fact that we’ve assembled an excellent commercial bank with very strong capabilities and have targeted focus on private capital and serving private capital and helping the industries that really are the engine of the economy, technology, health care with our JMP acquisition, I think we’re very confident that we can grow revenue sustainably in capital markets and they’ll move around a little bit from quarter-to-quarter. And now I would put it up against any other company’s treasury service business, and that’s driving an above trend growth rate, 7% to 10% in terms of year-on-year growth and also driving a skew towards non-interest-bearing deposits. Your line is now open. And I think we’re in a dramatically different position in up cycle than we were certainly in the last up cycle, we continue to make improvements sort of on the consumer side, starting with just the breadth of the levers that we’ve built, whether it’s the Citizens Access platform nationally to raise deposits away from our core book the new markets that we’re entering, where we’ve got a solid and stable deposit base, but we think there is a lot of up running room. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Maybe that’s a little bit of the volatility in the capital markets, maybe that’s a little bit of the loan market aggressiveness right now, but we are seeing a little bit of a benefit from lower pay-downs, which were running very, very high last year for almost the whole year and really eating up a lot of the origination activity that we are receiving. Your line is now open. Your line is now open."
}