{
    "symbol": "CFG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-19 10:30:22",
    "content": " Net interest income was up 31% linked quarter driven by a 29-basis point improvement in margin and strong loan growth, including the impact of the HSBC and ISBC transactions. The net interest margin is 3.04%, up 29 basis points, which as you can see on the NIM walk in the bottom left-hand side of the slide shows the benefit of higher rates with a 24 basis point increase related to asset yields reflecting the asset sensitivity of our balance sheet and improved securities reinvestment rates. This is down from 7% for the first quarter, reflecting the incorporation of ISBC's NII base and liability-sensitive profile as well as hedging actions taken to stabilize the margin and protect against downside interest rate risks. Excluding the impact of the HSBC and ISBC transactions, loan growth was 4% with strong commercial loan growth again this quarter, up 6%, led by C&I as we emphasize strong relationships to optimize risk-adjusted returns. Line utilization continued to rebound with an increase of about 300 basis points to 39% on a spot basis, primarily driven by corporate banking with the largest quarterly increase in utilization we have seen since early in the pandemic. From a revenue standpoint, we are seeing higher NII given net interest margin, reaching approximately 3.25% in the fourth quarter, driven by higher rates and loan growth within our 20% to 22% guidance range. And the loan beta side of it is loan betas basically are rising, and they will continue to rise into the Fed tightening cycle and even after the Fed stops and our, in particular, all the tailwind from some of the term fixed lending that often really gain steam when you get to the end of the Fed tightening cycle, that's really what continues to drive net interest margin rising which we would say, would continue to rise throughout '23 even as the Fed continues to rise, given the fact that loan betas would exceed deposit betas. Well, I mean I think the -- in the second quarter, just talking about the jump off here, maybe helpful because in the second quarter, we had -- on the commercial side of the house, we had 5% average growth. Can you share with us what you guys are thinking about not so much the traditional credit areas like consumer lending, home equity, or student loans, but more from a institutional market if the Fed pursues this quantitative tightening, which they claim they will $95 billion a month, what kind of disruption are you guys kind of looking at possibly that could happen separate from the traditional unemployment rates going up and all that stuff, I think most of us can understand that."
}