{
    "symbol": "WAB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:31:19",
    "content": " We delivered a strong first quarter as shown by the 5% sales growth, adjusted operating margin expansion of 1.4 percentage points and adjusted earnings per share growth of 27%. Sales for the first quarter were $1.93 billion, which reflects a 5.3% increase versus the prior year. Sales were positively impacted by the continued broad recovery in our freight segment, higher pricing and the acquisition of Nordco, partially offset by lower year-over-year sales in transit, driven by unfavorable foreign currency exchange and supply chain disruptions. In the first quarter, adjusted earnings per diluted share were $1.13 and up 27% versus prior year. First quarter consolidated sales were up 5.3% versus last year, driven by higher sales in the Freight segment, partially offset by lower transit segment sales. Component sales continued to build momentum and were up 12.8% year-over-year, driven by higher OE railcar build, lower number of railcars in storage and a strengthening recovery in industrial end markets. In aggregate, the continuing effects of the supply chain disruptions, higher materials, transportation and labor costs are estimated to be $45 million to $50 million higher than last year's first quarter. As I already discussed, Freight segment sales improved for the quarter and segment adjusted operating income was $259 million for an adjusted margin of 19.6%, up 1.5 percentage points versus the prior year. Finally, segment backlog was $19.02 billion, up $1.02 billion from the end of the first quarter last year due to the broad multiyear order momentum that Rafael discussed earlier. Adjusted segment operating income decreased by $5 million to $74 million, which resulted in adjusted operating margin of 12.3%, up 0.1 percentage points versus the prior year. Also during the quarter, we returned more cash to our shareholders, repurchasing an additional $296 million of shares and paid dividends of $28 million which was up 25% and versus our prior year dividend rate."
}