{
    "symbol": "NJR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-06 15:25:05",
    "content": "  Operator: Good morning, everybody, and welcome to today's New Jersey Resources Fiscal 2022 Third Quarter Conference Call. My name is Drew, and I'll be coordinating your call today. I'm joined here today by Stephen Westhoven, our President and CEO; Roberto Bel, our Senior Vice President and Chief Financial Officer; as well as other members of our senior management team. As you know, certain statements in today's call contain estimates and other forward-looking statements within the meaning of the securities laws. We wish to caution listeners of this call that the current expectations, assumptions and beliefs forming the basis for our forward-looking statements include many factors that are beyond our ability to control or estimate precisely. These items can also be found in the forward-looking statements section of today's earnings release, furnished on Form 8-K and in our most recent Forms 10-K and Q as filed the SEC. We do not, by including this statement, assume any obligation to review or revise any particular forward-looking statement referenced herein light of future events. We will also be referring to certain non-GAAP financial measures such as net financial earnings, or NFE. Steve will begin with this quarter's highlights followed by Roberto, who will review our financial results. With that said, I'll turn the call over to our President and CEO, Steve Westhoven. As a result, we are increasing our previously announced guidance for fiscal 2022 by $0.10. To summarize a few highlights, New Jersey Natural Gas added nearly 1,700 new customers. In July, Clean Energy Ventures placed an 8-megawatt project into service. And finally, Adelphia is now servicing 75% of its contractual commitments, and we expect to reach 100% by the start of the heating season. This increase is due to a combination of factors, including strong performance at New Jersey Natural Gas, greater-than-anticipated financial margin from Energy Services long option strategy and increased electricity revenue adding Clean Energy Ventures. This transaction provides Energy Services with fixed payments over the next 10 years, while still maintaining the ability to capture value and the volatility from the remaining portfolio of assets, which is what we're experiencing this summer. Moving to the next slide, I'll take a few moments to discuss the quarterly achievements at each of our business units, starting with New Jersey Natural Gas. On the left, you can see that New Jersey Natural Gas is in a solid position with strong capital deployment across a variety of programs. Year-to-date, we've invested $231 million with over 40% of that capital providing near real-time returns. We continue to make investments to support energy conservation, reduce emissions and enhance the safety and reliability of our distribution system for the benefit of our nearly 570,000 customers. Thus far in 2022, we've added over 5,200 new customers through a combination of new construction and conversions. Yet, we believe the outcome will be improved efficiency that will ultimately strengthen and provide greater predictability for investing in renewable projects. We recently placed energy service in 8-megawatt facility in Howell Township, New Jersey, which will be eligible for TRECs under the BPU's transition incentive program. On Slide 8, I'll briefly discuss the latest developments for the Adelphia Gateway, which is part of our Storage & Transportation business. We're in the final stages of construction at Adelphia, a converted oil pipeline. We recently completed construction at Marcus Hook in Quakertown compressor stations, which keeps us on track to be fully operational by the end of the calendar year. At Leaf River Energy Center, we continue to benefit in a steady stream of contracted revenue with creditworthy counterparties. With that, I'll turn the call over to Roberto for a review of the financial results. As usual, I'll highlight a few operational and financial metrics for the third quarter. NJNG saw an improvement of $1.1 million, primarily due to the impact of new base rates that went into effect on December 1. As a reminder, NJR has historically sold the majority of its SREC in the fourth quarter. Energy Services reported an improvement of $7.5 million, largely driven by the contributions of . Storage & Transportation reported an improvement of $1.1 million during the quarter, driven by increased revenues at Adelphia Gateway and Leaf River. Finally, home services improved by $1 million, mostly driven by higher installation revenues. On Slide 11, we have highlighted the details of CEV's SREC hedging program. The sale of SRECs remains a large portion of CEV's revenue, and we lock in these cash flows by hedging our expected production of SRECs. As you can see, our expected SREC generation is only hedged through an early year 2025 and 29% hedged for energy year 2026. For the current fiscal year, we expect capital spending at NJNG to following the rate communicated during our last quarter's call. Similarly, we expect CEV's CapEx for fiscal 2022 to remain unchanged from last quarter's communication. And at Storage & Transportation, the construction of Adelphia Gateway is approaching completion and represents the largest capital expenditure for this segment. As we mentioned last quarter, we continued to assess the impact that elevated gas prices would have in our cash flow from operations is sustained through the end of fiscal 2024. Despite higher working capital needs at Energy Services and measures in natural gas, we remain in a strong position to execute on our growth objectives. With that, I'll turn the call to Steve. We're working to grow our existing assets through organic growth initiatives, while positioning our portfolio of businesses to take advantage of the clean energy future. And as existing infrastructure becomes more valuable, our assets will continue to deliver earnings growth as well as help achieve our decarbonization goals. And before I turn the call over to questions, I want to take a moment and highlight that after 38 years of service to our company, our Director of IR, Dennis Puma has decided to call it a career. Dennis, I'd like to thank you, and I know I speak for everyone here and wishing you well. And with that, I'll open the call for questions. Could you speak to what you're seeing at this point, both in terms of impact to existing opportunities and if there are any expansion opportunities of some of the new tax credits considered in the legislation. Generally, we think it's very positive for our business. If you look at it and you talk about extending the ITC, the support for clean energy and solar battery storage support for hydrogen. So we're going to keep an eye on it, and we'll certainly update as information becomes available. But right now, it's just too early to say anything. We -- at the last earnings call, we changed the capital plan a little bit. So we believe all these be constructive, we adjusted our capital plan as we were going forward. So when this loan is finally release, we expect that we'll be able to develop. We need to feel confident in our business going forward, you can talk from our earnings today, that the complementary portfolio of businesses support our capital programs going forward. Clearly, there's been a lot of volatility I also want to confirm, is there any expectation that Energy Services earnings here being drawn a little bit full relative to, I'd say, the traditional Energy Services earning profile of earning in the winter time, given the volatility we're seeing now or you could still see the same upside in winter as usual? I mean, it's really a short-term volatility it's influenced. And you can see the inflationary it's raising gas prices, electricity prices. We're also seeing that over at CEV, we're increasing electric prices has benefited that group for the amount of electricity that we sell into the wholesale markets -- on a and monthly basis as well. So certainly, we don't like to see the inflation, but it is nice to see that the businesses that they came together are able to work in concert and create value. I'm just curious kind of what your, I guess, ordering strategy is around components that you'll need for your future projects. It's too early to point to either end, but we say that the same thing that we said before that we have reserved and purchased a number of solar panels to add in our construction schedule. So feeling good about that, and it will be -- we think, as I said before, we were talking to Rich, some of these loans that are associated with the PJM process, state of New Jersey process, get clear, we're going to be able to develop. But ultimately, it does impact you've got forward volatility that continues to storage and being able to balance that region as it becomes under more and more stress, is going to be extremely important. But as does come to roll over and renegotiate yes, we're expecting to get higher prices for that facility into the future. So if the market does get up to the point that there's more capital that can be deployed, and we'll certainly look at that as well. Again, congratulations to Dennis, it's always been a pleasure here over the years working with you. In terms of customer bills, I wonder if you could talk a little bit about the trajectory you see going into the winter. Obviously, you had the gas prices peak here earlier this year and then going into the winter, maybe coming down, you have the kind of hedging program through New Jersey's system. I mean to speaking generally to Travis, yes, we've got a pretty robust hedging program that's been in place for a very long time and a majority of the gas supplies are purchased well ahead of the winter. So ultimately, you don't like to see it, but you can temper that against as gas market, which is up almost 200% or 250%. And certainly, we'll see how the market plays out, hopefully normalizes and you get back down to a more normal gas price at least in recent history. You got the hydrogen shot at the federal level in developing green hydrogen, driving down prices from their current levels, then with like  kilogram, which is around $8 on an equivalent basis. We've got a very high-quality pipeline system that NJR, we believe we can deliver to carbonized fuels in the future. And over time, like any of the grade and clean technologies as you come to scale, we'll start to implement that and drive our way towards a lower carbon impact in the future. But ultimately, it is moving forward, and there's a lot of, I'll say, third-party effort outside our company driving down these costs, and there's a lot of companies that are looking at it, which is going to be helpful for us and happening for the whole industry. As Steve said, I'll be retirement in September, so this will be my last call, and I wanted to take a few minutes to say a few words. To my friends and colleagues in the financial community, I want to thank you for the opportunity to work with you, learn from you and get to know you over the past years. It's been an amazing journey and  and I, we've had a few laughs all the way. Also I wanted to thank our entire management team, one of the best in the industry for their support and always being available when I needed a question-and-answer or listening as we discuss the financial community perspective on our initiative. Finally, I want to thank my family for their unending support and patients over the years. Guys, I can assure you that the only thing I'll be doing for the November call is listening. As I transition into retirement, my wife and I'll be doing some traveling, perhaps back to some of those places where I've only seen conference rooms and airports. Enjoying life with family and friends and this is new, I decided to finally forgive golf for being so unforgiving to me over the years and take another shot at it. But until then, and as always, I appreciate, we appreciate your interest in us in New Jersey Resources."
}