{
    "symbol": "GSK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 10:25:27",
    "content": " In 2022, we delivered double-digit sales growth of 13%, 10% if you exclude COVID solutions, including the more than GBP 2 billion sales of Xevudy; adjusted operating profit growth of 14%, 17% excluding COVID solutions; adjusted EPS growth of 15% and strong free cash flow of GBP 3.3 billion, further strengthening our financial flexibility. In 2022, we delivered 13% sales growth or 10% excluding COVID Solutions, and we're proud to report that 10 products exceeded GBP 1 billion in sales for the year, including Shingrix, Trelegy, Nucala, Benlysta and Dovato. Benlysta remains the market leader with 85% of new patient starts in Q4, and we continue to see a strong growth globally in both SLE and lupus nephritis with only 25% buyer penetration in the U.S. Nucala continues to lead the IL-5 class across all major markets, and Nucala remains the first and only biologic approved for 4 esinophilic diseases with new indications driving growth and differentiation. In General Medicines, we expect 2023 sales to decrease slightly and remain on track with our broadly stable sales outlook between 2021 and 2026; and in Vaccines, overall, we expect to increase mid-teens percent, excluding pandemic-adjuvant sales and expect to see Shingrix momentum continued with double-digit growth with another record year of sales. Our HIV business delivered sales of GBP 5.7 billion in 2022, growing 21% in Q4 and 12% for the year with our U.S. and European businesses both reporting significant growth. Within free cash flow, cash generated from operations increased around GBP 700 million, up 10% to GBP 7.9 billion, with higher operating profit being the key driver, partly offset by other factors, which you can see on this slide. They're very much within the normal range of 1.1% to 0.9%, so we ended the year at 0.9 levels in the U.S. Now in terms of RSV, I don't want to give too much color on RSV, but I think Pfizer has made statements around penetration similar to flu. Just as a reminder for everyone, part of our portfolio shift strategy, which is evidence is working when you see that shift from 46% of the portfolio up to 2/3 and our confidence by '26 is getting to 3/4 towards vaccination -- Vaccines, sorry, and Specialty Medicines is so that we're continuing to drive leverage in the P&L and affording our ability to keep investing at the same time in R&D and in our launches, too."
}