{
    "symbol": "JPM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-13 12:16:02",
    "content": " NIR ex Markets was down $3.5 billion or 26%, predominantly driven by lower IB fees as well as management and performance fees in AWM, lower auto lease income and Home Lending production revenue. Expenses of $19 billion were up $1.1 billion or 6% year-on-year, primarily driven by higher structural expense and investments. The net reserve build of $1.4 billion was driven by updates to the firmâ\u0080\u0099s macroeconomic outlook, which now reflects a mild recession in the central case as well as loan growth in card services, partially offset by a reduction in pandemic-related uncertainty. Looking at the full year results on Page 3, the firm reported net income of $37.7 billion, EPS of $12.09 and record revenue of $132.3 billion and we delivered an ROTCE of 18%. This quarter, CCB reported net income of $4.5 billion on revenue of $15.8 billion, which was up 29% year-on-year. Moving to Card Services & Auto, revenue was up 12% year-on-year, predominantly driven by higher card services NII on higher revolving balances, partially offset by lower Auto lease income. Expenses of $8 billion were up 3% year-on-year, primarily driven by investments as well as higher compensation, largely offset by auto lease depreciation from lower volumes. In terms of credit performance this quarter, credit costs were $1.8 billion, reflecting reserve builds of $800 million in Card and $200 million in Home Lending and net charge-offs of $845 million, up $330 million year-on-year. Security Services revenue of $1.2 billion was up 9% year-on-year, predominantly driven by higher rates, largely offset by lower deposits and market levels. Expenses of $6.4 billion were up 10% year-on-year, predominantly driven by the timing of revenue-related compensation. On a full year basis, expenses of $27.1 billion were up 7% year-on-year, primarily driven by higher structural expense and investments, partially offset by lower revenue-related compensation. Record revenue of $3.4 billion was up 30% year-on-year, driven by higher deposit margins, partially offset by lower investment banking revenue and deposit-related fees. Gross Investment Banking revenue of $700 million was down 52% year-on-year, driven by reduced capital markets activity. Revenue of $4.6 billion was up 3% year-on-year driven by higher deposit margins on lower balances, predominantly offset by reductions in management and performance and placement fees linked to this yearâ\u0080\u0099s market declines. Expenses of $3 billion were up 1% year-on-year, predominantly driven by growth in our Private Banking Advisory teams, largely offset by lower performance-related compensation. So say, 13.5% target and the sort of using your estimates, organic capital generation, minus dividends, etcetera and all of the elements of uncertainty there, I think a good number to use is something like $12 billion of buybacks for this year for 2023. So, for example, in this yearâ\u0080\u0099s ultimate outcome, and the number that we want on printing on Page 22, the year-on-year change in volume and revenue-related expense, still we are finding the numbers, we will probably show you more at the Investor Day, but itâ\u0080\u0099s probably close to $1 billion. And Jamie, you recognized, a couple of years ago at Investor Day, you said, â\u0080\u009cLook, sometimes you are going to waste money as you are innovating and you are growing.â\u0080\u009d But ultimately, who is accountable when investment doesnâ\u0080\u0099t go right, like the Frank deal or another deal or some of the other $81 billion that you expect to spend this year? Andrew, well, I think we have talked about CECL like quite a bit, and I think there is some decent color there in terms of Jamieâ\u0080\u0099s $6 billion over a few quarters in a world where the economic outlook is worse than it is today."
}