{
    "symbol": "BAP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-10 19:25:26",
    "content": " From a year-over-year perspective, net interest income registered very strong growth of 30.9%, driven by 10.4% expansion in structural loans measured in average daily balances, ongoing repricing of our portfolio in a context of higher rates and a very competitive funding base. Additionally, fee income increased 11.3% fueled by an uptick in transactional levels, particularly through digital channels and POS and growth of 12.4% in the net gain in FX transactions as we manage FX volatility and roll out improvements in products and channel offerings. Operating expenses grew 13.4%, driven by growth in variable compensation which was in line with higher income, an uptick in IT expenses bolstered transactional capabilities and an increase in investments in disruptive initiatives. On a quarter-over-quarter basis, our interest earning assets fell 3.1% due to a drop in available funds, investments and Reactiva loans and structural loans grew 0.8% driven by Retail segments and Mibanco. On a full year basis, core income grew 17.9%, fueled by growth in net interest income which rose 23.1% in line with an uptick in loan volumes and interest rates. In this context, Credicorp's efficiency ratio improved 150 basis points on a full year basis, driven by higher core income and BCP stand-alone and Mibanco. Thank you very much. So if we take out the specific events that impacted the fourth quarter we consider that the range of cost of risk between 1.5% and 2% is reasonable according to, and I'm going to review the general trend and the come back to the risk profile on a segment level, the shift towards more retail portfolio, the specific short-term impacts of the political rates that are going to impact the last quarter of last year and the first quarter in this year. But then when I look at your presentation, in your earnings release, there is a chart there that shows -- I think it's on Page 19, that shows the cost of risk or structural NPL -- sorry, structural NPL ratio for your various businesses and that one shows that Mibanco has actually declined in December 2022 to 4.96%. Thank you very much. Thank you very much. Thank you very much. Thank you very much."
}