{
    "symbol": "CWST",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 16:42:05",
    "content": " Along with a brief review of those results and an update on the company’s activities and business environment, we will be answering your questions as well. But first, as you know, I must remind everyone that various remarks that we may make about the company’s future expectations, plans and prospects constitute forward-looking statements for the purposes of the Safe Harbor provisions under the Private Securities Litigation Reform Act of 1995. And with that, I’ll turn it over to John Casella who will begin today’s discussion. Needless to say we’re really pleased with the results for the beginning of the year, myself, Ed, Ned, Jason, the entire senior team, we’re really proud of the work that our entire team is done to offset really significant inflation that everyone is faced with unfortunately in business today. We continue to grow the business meaningfully on a year-over-year basis in the first quarter, revenues were up 23%. We’ve advanced strong price, a hedge of – ahead of budgeted levels as we aim to pass through heightened operating costs to our customer base. We’re also taking a proactive stance with our fuel recovery fees that are offsetting rising fuel costs, albeit a lag in a rising price environment. Overall, our core pricing and operating programs, outpaced inflation, but several unique items weigh on margins this quarter that Ned will go through in greater detail. First on the landfills, we’ve advanced positive price, and in fact, our average price per ton was up on nearly 9% year-over-year in a quarter. This is a result of our team’s effort to offset significant inflation, including heightened regulatory costs. In the quarter, harsh winter weather results in lower – resulted in lower volumes both year-over-year and versus our budget. As I mentioned, we’ve been nimble with our pricing programs and we’re off to a great start this year. There’s no material operating income – excuse me, operating impact in 2022, with this revised timeline. Finally, I’d like to highlight our capital allocation and growth strategy. We remain well positioned to continue to execute against our growth strategy, given the strength of our balance sheet and we are focused on opportunistically putting capital to work on deals that meet our criteria that drive further value. And wrapping up, I’d like to take a minute to thank Ed Johnson for his outstanding contributions in helping to shape and build the company to where it is today. As announced last week, Ed is retiring on June 30, Ed’s 12 years, will leave a lasting impact as he’s made instrumental improvements to the organization that have become core principles to the way we operate on a day-to-day basis. Myself and the rest of the company will miss his guidance, but I know we’re in good hands. And with Ed’s retirement, I’m confident that we have a seamless transition as we have the right people in-house to continue to drive value and execute. We couldn’t be more excited for all of those individuals and as I said, well, deserved promotions. We’re getting a few texts that the web conference call is cutting in and out, but we’re hearing that the phone call’s okay. So, I hope that’s the case, hopefully there aren’t a lot of problems out there. And with that said, I’ll move on. Solid waste revenues were up 21% year-over-year with price up 5.6%, volumes up a 0.5% in acquisition growth of 12.5%. However, several identifiable factors negatively impacted margins in the quarter, including the construction delays at a landfill the expected margin dilution from acquisitions, margin and headwinds from the fuel recovery fees, and margin headwinds at our transfer stations due to higher fuel surcharges on long-haul transportation. Resource Solutions adjusted EBITDA was $6.7 million in a quarter up $2.7 million year-over-year with improvements from recycling, organics processing and non-processing. With our floating SRA fees for hauling customers in a floating processing fee or rebate structure at a recycling processing facilities, much of the year-over-year increase in recycling commodity prices was passed back to our customers in lower fees or higher rebates. Cost of operations in a quarter was up $35.3 million or up 234 basis points as a percent of revenues with a majority of the increase driven by higher fuel costs, higher labor cost and parts inflation. This out of period, Willimantic depreciation and amortization true up resulted a headwind to operate income margin to 60 basis points and a $0.03 per share headwind as well. Adjusted free cash was $16.3 million in the quarter up $6.1 million year-over-year with net cash provided by operating activities down $7.4 million, mainly driven by timing differences for accounts receivable associated with acquisition activity. This decline was more than offset by lower capital expenditures in the first quarter 2022, as compared to last year. As stated in our press release yesterday afternoon, we have increased our fiscal year 2022 revenue net income adjusted EBITDA and net cash provided by operating activities, guidance ranges, and reaffirmed our adjusted free cash flow range. As we currently expect at higher net cash provided by operating activities to be mainly offset by higher capital expenditures, including growth capital investments for new contracts and customers, additional investments to accelerate collection operating efficiencies and higher prices on certain budgeted capital items. Despite the margin headwind in the first quarter, we remain very confident in our ability to outpace inflation in fiscal year 2022 and improve adjusted EBITDA margins year-over-year. As a point of validation, our adjusted EBITDA margins were up 20 basis points year-over-year in the month of March. As we work past several of the operational challenges we faced during the winter months, our pricing programs further improve sequentially with solid waste price up 6.2%. As we discussed last quarter, if our cost inflation increases further, we have great flexibilities to advance additional price increases across our business and our floating energy and environmental fee effectively offsets most of the fuel exposure. With that, I’ll turn it over to Ed. I can’t help, but think of what happened in Q2 of 2019, when our cost spiked in that case, it was all labor related and we temporarily lost margin. So it excludes disposal both from the revenue and cost, but it’s a great indicator of how healthy our core business is. And Q1 on a same-store basis this metric improved 13.5%, the highest jump since we’ve been tracking it. There was some temporary margin pressure, but as you know, with a general statement, the tons that don’t come in the first quarter allow for more available capacity for the rest of the year. So over the past few years, I’ve focus much of my efforts on building a strong ops team and developing the key individuals and that team to be able to take on additional responsibilities. As I said in the past, he’s the best CFO I’ve ever known. With that, I’d like to now turn it back to the operator to start the Q&A. Your line is open. We’ve been monitoring really closely what our core inflation is in our business, and it takes a little bit of work to get at because you’ve got volume changes. You’ve got acquisitions, you’ve got new business, there’s a lot of things happening, but we’re calculating our core, the total inflation is 4.3% today. So, if you look at that and you look at our pricing across the solid waste business, our pricing across resource solutions, we yielded as a full company about 5.3% price. Now, if you layer in fuel, our fuel inflation was close to 125 basis points year-over-year in the quarter. So you look at that we’re ahead about of a 100 basis points on the core business, then backwards about 30 basis points on fuel. So, we’re in pretty good position, but then you start to get under the hood. Then we had acquisition headwinds as we’ve been talking about that will start to mitigate into Q2, Q3 as we anniversary Willimantic. So those couple factors offset a lot of really good work in cost recovery, costs offset programs and the rest of the business. So it sounds like some exceptional items in the quarter that, won’t repeat in the remainder of the year. And then just on the fuel recovery it’s, I’m just looking at diesel prices in the Northeast. It seems as, so they’ve remain flat. So for the last few weeks, so just as the lag catches up, I assume provided the prices stay relatively consistent that you won’t see much headwind from that and provided that plays out. Yes, you’re absolutely right. So, we’ve had a really effective energy and environmental recovery fee for a lot of years close to 17 years now. And in rapidly rising markets, it’s a lagging fee. That’s looking at, a standard index, diesel index, and if you’re looking at trailing numbers and in setting the fee for the upcoming month. So, we’ve never quite seen a market like this with diesel rise as fast as it did. So some of what we completed in the first quarter we would’ve, thought would’ve taken a little bit longer. But we were able to get those transactions done much quicker than we’d anticipated, but we’ve got a full opportunity from an M&A standpoint, and we’ve got various opportunities under LOI at this point. Your line is open. Hey, first off, I know there’s been a lot of title changes. Some position changes, just congrats to everybody, but particularly to Ed sounds like you’re going somewhere warmer. For the full year, we’re still expecting around a 35 basis point headwind for acquisitions. And that’s more of a relative issue where our margins overall we’re a little lower, so acquisitions didn’t pull them down, but our acquisition activity came in right around the targeted level in the quarter. And then it looks like you’re looking for 20 basis points up at this point versus 40, I think 90 days ago. But if you think about the big puts and takes for the year, I mean, my hunch is that fuel, it sounds like maybe M&A is about the same, but it feels like fuel’s more dilutive than what you were originally expecting. Yes, it’s a good question where we’re expecting acquisitions to be about. So, we’ve taken down, as you said guide, we’re expecting to be up about 40 basis points now about 20 basis points. We really didn’t change a lot of other parts of our guidance, Tyler, since it is the first quarter, but we felt compelled to change with such a larger acquisition for us coming into the business. So it’s interesting because if you look at diesel and this is just national average, but I think it was up called a little over a dollar year-over-year in Q4 is up above 40 in Q1. So it takes the step up in Q4, some of that was recognized in Q1 and then you’re absolutely right. And in terms of the break down between solid waste and Resource Solutions about $28 million in Resource Solutions in terms of revenue dollars and about $47 million in solid waste in terms of breaking down that $75 million, if that’s helpful, Tyler. I’ll pull up the dollars, but I don’t have that open in front of me. And I don’t want to talk too much month to month, but it just to be clear, it feels like April is starting to track better. I think that we’re beginning to, see the natural transition coming into spring Tyler with, roll offs picking up the construction demolition season. So, I think, we’re cautiously optimistic in terms of where things will be, but obviously a good deal of that remains tied to what happens from an economic perspective. Your line is open. I’ve done that before, which give you a headache and depress you on some level. And Ned and Jason, Sean, well done but more importantly, John, bothers to you for really thinking this through, succession planning is probably the most important thing you do and you’ve done it well. Appreciate that Michael we’ve had, we’ve got great interface with the board and we’ve done a good job over the last three or four years, really trying to position the company for the future. Yes, so you’re not talking huge numbers, that’s the whole thing. We’re – that we are off 32,000 tons, but as Ed said, things like that, we have a sites that have very high fixed costs. And important sort of observation is you feel good enough about the room in your annual caps plus, I mean, we’re talking about a 100,000 tons on a $4 million basis that you run through your system. So I don’t have to use price to move volume around to fill up this whole, this is, there’s enough volume in the market that it’ll come at you naturally plus your own efforts to manage cost and you use pricing. Well, that’s interesting because we, the innings keep extending as we move forward and create more momentum. Michael, as you know, every time you do a transaction, you’ve got more opportunity from a routing perspective and efficiency standpoint. So that, and that’s the way to think about it is, is that there’s, what has it been almost $200 million have added revenue, right, M&A in the last three years, four years. And then, within the guidance Ned, I appreciate that you’ve moved it for the M&A, that was chunk enough to do that. Michael, we’re going to be north of 5%, maybe even closer to 5.5% but we’re still, inflation stepped up as well against that model, as our margins reflect. So, we stepped up price costs are up and, we’re reassessing on a weekly basis right now where things sit, it’s a pretty dynamic time. Their comment about the $75 million of revenues is including rollover from last year, plus this year done. So would you share what you have under LOI, and two, you used to talk about the addressable market as $400 million, so you’ve now increased it by 25%. I think that, it’s a function of what’s happened in the marketplace in that, the challenges, from a labor standpoint, challenges across the board have caused folks that we never thought would really be interested in monetizing our really coming to market. So, I think that, we don’t have anything as chunky as what we did in the first quarter on LOI right now, it’s sporadic a few smaller deals. We don’t have one large transaction, Michael under LOI at this point in time. I’m asking, it’s sort of a question and statement in the same breath. I think there’s, this is exactly right. We have that challenge and we’ve added tremendous resources, Kelly Robinson and his team from an HR standpoint, we’ve built our own CDL School. We’re, teaming up to build a mechanic school as well. So, you really have to that the work Ed’s done over the last couple years to just really have a great vision for the future, what our replacements are and what we need in the system for a growth standpoint, position us really well during this period. As Michael, we’re ordering our trucks now a year in advance. We’ve gone to the board for the last four years, five years to get our CapEx for trucks a year in advance, because we’ve got to get the orders and slots for delivery. Yes, no, all the class eight guys have made it clear they’re on allocation. But to that point, just to close the loop on this, that’s not impacting your ability to grow, given the breadth of your model, you can work more overtime, you’ll find a way to do it in routing where the smaller guy just can’t add the capacity. We’ve modeled not before the quarter reported, we assumed you were going be slightly negative in 1Q and 2Q, just because of comparability issues. But right now we’re sitting in our model, slightly negative from margins in Q2. We are up in Q3, Q4 Jason…\n Yes, 75 basis points to 100 basis points, which gives us up close to the 20 basis points to 25 basis points for the full year embedded in our guidance, Michael. Your line is open. Actually, no but, I’m looking forward to it. I don’t think that, I think that we need to be really thoughtful stay within the bounds of the financial returns that Ned is outlined. I think that, we – you don’t see or feel the number of transactions that we don’t do. So, I think that we’re probably going to stay to our disciplined approach. They’ve served us very well over the last seven, eight years and so probably no changes from our perspective. But we’re – when you go in and you look from a due diligence standpoint, you’re evaluating fleet, you’re looking at the trucks. You’re looking at how many people that are down from a routing standpoint, all of those aspects of the M&A process are incorporated into the due diligence that we’re doing. So, I don’t think that we’re going to change things. It’s not growth for the sake of growth, this growth for the sake of creating and growing free cash flow. Yes, so we did have quite a bit of growth in the non-processing side of this business, which is a combination of our multi-site kind of retail, industrial brokerage business, our industrial services business, and then also our organics sourcing, and transport and disposal part of the business where we don’t process. I mean, we’re very focused on ESG, and every major institution across this country, whether it’s a company or institution, college, university, hospital. So that part of our business is really growing, you’re right, Sean, we’re having many of our customers who are thought leaders in this area, and they’re working with us to find solutions to create more value from the waste stream. So, you seeing quite a bit of that there, and it really is a continued opportunity for us to grow gain share of wallet from existing customers and quite a bit of this growth this year was from that area and will continue to be as well. It’s just, it’s becoming more and more important to every company, every institution. Yes, that’s super interesting. I mean, I think that it’s pretty fair to say that there’s a tremendous knowledge throughout the economy in terms of what’s happening from an inflationary standpoint. I think that, we really haven’t received a tremendous amount of pushback. And I think it’s a function of people having a clear understanding every time they go to the grocery store, they go to fill up their car. We think about, we’re now being asked to solve for PFAS and leach , and we’re doing our first pilot program at our waste USA facility. And by creating flexible fee structures, we’ve been able to be fair as well. So our customer base 16 reduction there, and we’ve been able to pass some of those higher commodity prices right back to our customers, which really has helped us a bit. And these programs are set up to be fair and they’re set up to manage risk, and we’ve seen that on both sides. One more meaningful data point, with all the price we’ve pushed through our customer count and each main line of business went up in the quarter. We had strong customer growth that’s on an organic basis or a same-store basis, excluding acquisitions. Your line is open. Can you discuss, I know you touched on this briefly a minute ago, but can you discuss sort of driver attrition in the quarter, it seems as the wider industry seems sort of accelerating pay for drivers in Q1 and some pretty large companies announcing, they’re paying their drivers 140K plus you haven’t – it doesn’t seem you’ve had any margin hand with their given pricing. I think that we’re – we’re still struggling, like everyone is to fill all of the seats. It’s and we’ve had – we’ve had from a driver’s standpoint, we’ve had some bumps in terms of negative issues from a retention standpoint. But I think when you look at, Casella you have to look at it over a three or four year period of time, because we’ve been raising rates over that period of time. So it’s not like we’re just – you’re seeing one raise, we’ve been doing market adjustments now for about four years. We’ve put 60, 65 people through the driver’s school, so far where we actually pay for them to get their CDL. So, I mean, we’re doing everything that we can, we’ve added some fairly Ned reminds me every now and then how much overhead we’ve added from a HR standpoint, in terms of adding people to help our teams, you can’t have ops managers out in trucks and interview drivers. So, we’ve added some people in the field to help interview drivers to when the application comes in, turn it within 24 hours, get that individual in for an interview and then help to source that for the ops managers and then get them obviously in front of them, and do a much better job of reacting very quickly to the applications that we do get. So, we’re doing a lot of things there. We’re putting the resources to it that are necessary to be successful, but we’re still struggling to fill all of the seats. And we’ve also been investing heavily in automation, which makes to be less seats to get the same work done. It’s a little bit less manual, intense work, and we see more and more women. And the work we’ve done in a lot of markets and through your team, sometimes we’ll take three manual trucks and replace it with two automated trucks. So into our waste USA facility, we’re doing a pilot program to remove the PFAS from the leach , which is something that every facility across the country will be facing over the next few years. And it’s, again, I was talking about it in the context of the regulatory environment that we’re in and the reality of higher costs and inflation, and some of that’s being driven by the regulatory environment that we operate in. Not only is it difficult to get that capacity permitted in place, it’s also very difficult to meet the issues from a regulatory standpoint. It’s interesting to see somewhat of a interest in hazard waste volume, what’s the sort of competitive dynamics or any advances you…\n I think – it doesn’t pose a negative for us in terms of if we find a solution, then we’ll incorporate the cost of that solution into our tip fees at the facility. If we’re expected to do these things, we can certainly do it. And I expected to continue, because I’m still a stockholder. And ladies and gentlemen, this concludes today’s conference call."
}