{
    "symbol": "CWST",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-17 13:04:06",
    "content": " In the year, we surpassed $1 billion in revenue, and also generated over $100 million in adjusted free cash flow for the first time in the company's history. I'm also proud of our continued capital discipline and execution against our growth strategies which helped drive adjusted free cash flow growth of approximately 17% in the year, exceeding our long-term 2024 plan of 10% to 15% growth per year. Moving on to the quarter, revenues in the fourth quarter were $272.1 million, up $30.3 million or 12.5% year-over-year, with 3.6% of the year-over-year change driven by acquisition activity, and the remaining 8.9% or $21.6 million of the year-over-year change resulting from organic growth. Resource Solutions revenues were up 10.6% year-over-year with 7.5% growth from acquisition, 6.9% volume growth, and 17% growth in processing fees and other price partially offset by lower commodities down 21.5%. Adjusted free cash flow was $111.2 million for fiscal year 2022, up $15.9 million, or close to 17% year-over-year, with higher capital expenditures more than offset by higher net cash provided by operating activities, mainly driven by improved operating performance and a small improvement in our changes in assets and liabilities versus last year. We expect adjusted EBITDA growth to come in the following areas, the collection line of business up roughly $17 million to $20 million, disposal line of business up $10 million to $12 million, resource solutions down $2 million to $4 million, about $2.5 million of rollover benefit from acquisitions, and then some other kind of headwinds in the business due to cost increases of $5 million to $6 million. We expect very strong flow through from incremental EBITDA with a few cash flow headwinds, including cash interest of roughly $2.5 million year-over-year, cash taxes up roughly $3 million, closure up $7 million, as we cap at several active sites and roughly $3 million of headwinds as delays in certain capital expenditures shifted cash outflows into early 2023 from late 2022. $10 million that we have in the plan should be the majority of the capital that we need for phase 1 which is the containerized MSW and getting into some C&D -- \n And so, that leads to me to my last question -- last two, is what's your thought about a two or three year stack on free cash flow growth, because things like this $10 million -- I don't assume you repeat that $10 million '24."
}