{
    "symbol": "CWST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 15:22:01",
    "content": " At the same time, our pricing and fuel recovery fees worked well to offset inflation, in fact we were fully offset â\u0080\u0093 we fully offset higher fuel costs in the quarter and our continued execution against our strategic growth strategy as we are growing the business through acquisitions and select development projects while ensuring proper follow through on our integration efforts. Moving on to the quarter, revenues in the second quarter were $283.7 million, up $67.8 million, or 31.4% year-over-year with 17% of the year-over-year change driven by acquisition activity and 14.4% of the change driven through organic growth. Solid waste revenues were up 26.4% year-over-year with price up 6.9%, volumes up 1.6%, acquisition growth of 12.1% and our fuel cost recovery fees up 5.3%. Resource solutions revenues were up 45.7% year-over-year with 5.3% from higher recycling commodity prices, 3.4% from higher customer solutions price, 30.8% growth from acquisitions and the remainder from higher volumes and fuel cost recovery fees. Adjusted EBITDA was $68.5 million in the quarter, up $16.4 million, or up 31.4% year-over-year with roughly $10.1 million of the growth driven by improvements in our base business and $6.3 million derived from the rollover impact of acquisitions. With overall price solid waste and resource solutions up 7.4% offset by a 5.2% headwind from inflation, excluding fuel, a 65 basis point headwind from our fuel cost recovery program, a 40 basis point headwind from acquisitions and the remainder associated with a shift in revenue mix year-over-year. Cost of operations in the quarter was up $47.5 million year-over-year, or up 140 basis points as a percentage of revenue with most of the increase driven by higher fuel costs. We expect higher net cash provided by operating activities to be partially offset by higher capital expenditures, including continued investments into newly acquired operations, growth capital investments for new contracts and customers, additional investments to accelerate operating efficiencies, and unfortunately higher prices on certain budgeted capital items due inflation. As we discussed last quarter, if inflation does increase further, we have great flexibility to advance additional pricing on roughly 70% of our collection book of business and our floating fuel recovery fee is now offsetting roughly a 100% of our cost. Your line is now open. However, with that all being said, I think, our pricing programs are working really well to help us offset inflation as John and I mentioned a few times, we've accelerated a number of cost efficiency programs, weâ\u0080\u0099re pushing hard to try and strip costs out of the business to tackle inflation in that manner as well. Your line is now open. Your line is now open. So as you're aware, original solid waste price guide for the year was 4.5% to 5%, and as we're looking over the balance of the year given the strength of our pricing programs to date we have upwardly adjusted our solid waste pricing metric and expectation to roughly 5% to 6% for the full year with some opportunity of course, based on the overall inflationary environment to go back out and advance more pricing if needed. Your line is now open."
}