{
    "symbol": "CWST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 14:26:11",
    "content": " Revenues in the third quarter were $295.3 million, up $53.3 million or 22% year-over-year, with 8.5% of the year-over-year change driven by acquisition activity and 13.5% of the year-over-year change from organic growth. Resource Solutions revenues were up 7% year-over-year with 18.2% growth from acquisitions, 7.7% volume growth, our processing fees and other price up 12%, with all of this offsetting the lower commodity prices in the quarter. Adjusted EBITDA was $70 million in the quarter, up $13.8 million or 22.5% year-over-year, with $10.7 million of the growth driven by improvements in our base business and a little over $3 million derived from the rollover impact of acquisitions. Adjusted EBITDA margins were 25.4% in the quarter, up 10 basis points year-over-year, a strong sequential improvement and exactly on plan for the quarter. Further margin bridging items include: an 80 basis point improvement from general operational improvements and volume gains; a 50 basis point improvement from our fuel recovery program, net of higher fuel costs; a 75 basis headwind from acquisitions; a 75 basis point headwind from recycling commodity prices; and roughly a 40 basis point headwind from the special bonus accrual. Resource Solutions adjusted EBITDA was $7.8 million in the quarter, down $1.2 million year-over-year, with improvements in the industrial and organic operations, offset by lower performance in recycling MRFs. Cost of operations in the quarter was up $36.4 million year-over-year or up 84 basis points as a percentage of revenue, with most of the increase due to higher fuel costs and mix changes driven by acquisition activity. General and administrative costs in the quarter were up $3.4 million year-over-year but down 120 basis points as a percentage of revenues as we continue to gain cost leverage on higher revenues, our efficiency programs and technology investments have also made a positive difference. Adjusted free cash flow was $81.7 million year-to-date, up $3.4 million year-over-year, with higher capital expenditures more than offset by higher net cash provided by operating activities, mainly driven by improved operating performance, partially offset by negative changes in our assets and liabilities. We expect to outpace this inflation, increase adjusted EBITDA margins by roughly 10 basis points for fiscal year 2022 with more significant year-over-year margin improvements in the fourth quarter. We're putting together our pricing strategy for 2023, and we'll look to outpace inflation again next year and more than likely look for pricing programs in excess of 6%, 6.5% for the year, depending on where inflation is. So I haven't done the calculation, but if we assume across the full year that LIBOR is up, say, 300 basis points or so, maybe that's not enough, but let's just assume 300 for the full average year, that would put us up $4.8 million of interest expense. And if you don't bifurcate the M&A from the base business, year-to-date, it's been about a 40 basis point margin headwind, which is also what we expect in the fourth quarter and then the full year as it relates to fuel being offset by our energy and environmental fee. So just kind of assuming the first one will come online in the first quarter, and then the second one is going to be towards the end of the year, Tyler, assuming pretty conservative $2 D3 RIN price, we're probably looking at revenue contribution of about $2.5 million or so next year."
}