{
    "symbol": "SRPT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 00:29:07",
    "content": " As you will have seen from our press release issued earlier today, Sarepta enjoyed yet another straight quarter of strong revenue growth for our three approved therapies, EXONDYS 51, VYONDYS 53 and AMONDYS 45, achieving total revenues of $210.8 million in net product revenues of nearly $190 million. Based on our performance to date, we can confirm our prior guidance of net product revenue of over $800 million for full year 2022, translating into product revenue growth of over 30% over 2021. Driven by continued demand for our three RNA-based PMO therapies, I'm pleased to report that the team delivered approximately $190 million in net product revenue for the first quarter of 2022. This performance represents more than 50% growth, or greater than $60 million in net revenue growth over the approximately $125 million in net revenue for the first quarter of 2021. For the first quarter of 2022 compared to the first quarter of last year, we delivered nearly 10% growth for EXONDYS 51 and more than 60% growth for VYONDYS 53, while maintaining our market leadership position in the exon 53 amenable population. Beginning with EXONDYS 51 which totaled roughly $117 million, representing approximately 9% growth over the first quarter of 2021, you'll notice the revenue dipped slightly compared to the fourth quarter of 2021 but this is expected and primarily driven by the insurance changes at the beginning of this year. For VYONDYS 53, revenue totaled approximately $28 million, representing roughly 60% growth versus the first quarter of 2021. For the three months ended March 31, 2022, the company recorded revenue of $210.8 million which consists of net product revenue and collaboration revenue compared to revenue of $146.9 million for the same period of 2021, an increase of $63.9 million. For the first quarter of 2022, individual net product sales were $117.1 million for EXONDYS 51, $43.6 million for AMONDYS 45 and $28.1 million for VYONDYS 53. On a GAAP basis, we recorded $194.3 million and $195.1 million in R&D expenses for the first quarter of 2022 and 2021, respectively, a year-over-year decrease of $800,000. On a non-GAAP basis, the SG&A expenses were $53.2 million for the first quarter of 2022 compared to $51.5 million for the same period of 2021, an increase of $1.7 million. On a GAAP basis, we recorded $17.3 million in other expenses, net for the first quarter of 2022 compared to $15.5 million in other expenses and that for the same period of 2021."
}