{
    "symbol": "FRT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 15:54:02",
    "content": " It's why we have nearly two dozen active and meaningful development projects in planning or underway totaling over $100 million this year and next which will likely yield double-digit un-levered yields over the ensuing years through higher customer traffic and rents, in line with our historically observed results following property improvement projects. These two acquisitions along with the previously announced 410,000 square foot Kingstown Shopping Center, in Northern Virginia represent a combined investment of $435 million at a 5.25% yield in year one and more importantly very strong IRRs on three dominant retail destinations in three particularly fast-growing markets from a good jobâ\u0080\u0099s perspective. Please proceed with your question. Please proceed with your question. And I mean, I know, Dan goes through the math of what it means, but when you think about inflationary time and being able to push three and sometimes four and sometimes better annual bumps into the lease that getting that along the way is a whole lot better than sitting there and looking at a flat lease and maybe getting 7% after five years or something like that. Please proceed with your question. Please proceed with your question. When this office building adjacent to it, which is a very attractive office building, but frankly lease in a very pedestrian way, we think we can do the same thing on the office side to make it way cooler to the right type of tenant base that would -- that's the same tenant base that we're aiming for in the adjacent retail property, putting those two things together, especially in a post-COVID environment where individuals and companies in the area are looking to be closer to home with an amenitized environment we feel like there's great upside all while yielding over a 6% yield while we do that. And then second, just kind of on a stand-alone basis, when you think about Forum, we bought Forum for roughly 60%, 65% of replacement cost, 85% leased at rents that are probably 10% to 15% below market, with a weighted average lease term of less than five years. We're a local developer that's done something similar to kind of Class B, B-minus buildings and much, much lesser location than Scottsdale Road across the street from Paradise Valley and those buildings sold basically a replacement cost at sub-5% caps recently. Please proceed with your question. And I think that's again in my prepared remarks I mentioned and gave a shout out to the strength of our legal leasing, tenant coordination and property operating teams they've been really successful on average getting tenants open on time and in many cases ahead of time and on budget. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}