{
    "symbol": "FRT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 20:42:03",
    "content": " Although not a huge absolute number since we strive for strong fixed rent in our leases, the broad based over trend contribution in the quarter, particularly among our restaurants and soft goods tenants over and above the fixed rent, is notable and contributed an additional $0.02 per share compared with last year's third quarter. Small shop leased occupancy basically hit 90%, up 60 basis points over 2Q, up 380 basis points year-over-year and up to a level not achieved since 2017, but still not back to targeted levels. We also had another solid quarter achieving sector leading rent bumps, as we continue to drive average annual contractual increases of 2.25% for retail leases only for banker and small shop-lended and as a result our rollover on a straight line basis is 13%. Onto the remainder of 2022 given another quarter of outperformance and a strong outlook for 4Q, we are increasing our guidance from $6.10 to $6.25 to a tightened range of $6.27 to $6.32 per share, an increase of $0.12 to the midpoint or 2%. And then I think you said that you're every year the embedded annual bumps are 2.5%, but one, I just wanted to validate that number; and two, is that just small shop or is that also in like the junior anchors and some of the bigger format retailers? As we said we also grow rents from contractual rent bumps, which we'll get this year, it is two-and-a-quarter percent retail leases only both anchor and small shop blended that we see in our portfolio, a little bit higher, if include the office leases where we get a little bit higher bumps. We're going to provide guidance in 2023 on our February call, but one thing I will tell you is we will see really, really good and strong robust property operating income at the property level in 2023, and we'll continue to see growth coming from our non-comparable portfolio, coming online as well contributing and that obviously in this environment we'll have to counter inflation on operating expenses and we'll look to counter the impact of interest expense. Obviously we got to deal with the current macroeconomic situation in terms of interest rates and all, but overall your point is a good one that that not only did we get there faster, we got there in 2022 verse 2023, but if you were to reset today and look at those POI goals that those goals are effectively even better with respect to the core portfolio because of the strength and the leasing over this period of time. So within the context of that, Steve, the bottom line is we're still â\u0080\u0093 we always through periods want to make sure that the company continues to view capital on long-term weighted average cost basis, not just yield for a particular project at any one time because it's as uncertain in terms of where it's going to end up at this point. I don't think there's necessarily onetime items in there, except for prior period rent and term fees, which really third quarter over third quarter, we're roughly modest and I don't see that. It's just stronger continued expectation that the trends that occurred and our outperformance in the third quarter will continue into the fourth quarter with regards to continued strong percentage rent, continued strength in occupancy buildup, asset in our pipeline, tenants taking possession of space and then, obviously, with some offset to a higher interest rate environment. We expect because of prior period rent continuing to be higher last year than we expected this year should be higher in the fourth quarter than that 3% to 5% range, probably more in the â\u0080\u0093 something of around 5% to 6%."
}