{
    "symbol": "NSYS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 21:18:14",
    "content": "  Operator: Good afternoon, ladies and gentlemen, and welcome to the Nortech First Quarter 2022 Earnings Call. Jay will begin today's call with a brief review of our first quarter operational performance, and then I'll review Nortech's Q1 financial results before turning it back over to Jay for his closing comments and business outlook for 2021. Before we continue, please note that statements made during this call and the Q&A session may be forward-looking regarding expected revenue, earnings, future plans, opportunities and other company expectations. These estimates, plans and other forward-looking statements involve unknown and known risks and uncertainties that may cause actual results to differ materially from those expressed or implied on this call. The statements made during this conference call are based upon information known by Nortech as of the date and time of this call, and we assume no obligation to update the information in today's call. Overall, we are very pleased with our first quarter results, which built on our positive momentum from 2021, and we are optimistic about our outlook for the rest of the year. During this call, I'll cover five key themes that will provide a framework for how to think about Nortech, the Board of Directors, our customers and suppliers, our core operations capabilities, R&D innovation and our people. They are an impressive group, and I'm honored to partner with them guiding Nortech's future growth. They have a wealth of diverse experiences and most importantly, they are great people who care deeply about helping each other and the management team realized Nortech's unlimited potential. Our medical, military and industrial customers are in the business of saving and improving lives, and their supply chain must meet the highest quality standards. Our people are in constant 2-way communication with suppliers and customers to overcome component shortages, increased plant throughput and provide as much visibility as possible. We also take every opportunity to use lean manufacturing principles throughout our locations to drive efficiencies, streamline operations, remove bottlenecks, eliminate waste and improve customer fulfillment. Before I describe our most recent R&D investments, I think it would be helpful to take a step back and provide a brief overview of Nortech's evolution for those of you listening who may not be familiar with our story. More and more often, we serve as a collaborative partner in our customers' product engineering and development, offering life cycle management and even complete fulfillment solutions. More than ever, our customers are looking for strategic partners like Nortech that can accompany them and sometimes lead them on their individual innovation paths. These cable technologies target challenging data-dependent applications, including factory automation, machine vision and robotics, and they complement the company's existing Intercon 1 product line. We are increasing our early engagement with customers, jointly developing new ways to make their products more cost effectively, which may include shifting production locations and leveraging our new technologies. This earnings call makes a financial comparison to the same quarter last year in January, February and March of 2021. I'm thrilled that we can turn our attention to developing new skills, providing more training, enhancing their careers, improving their health care and financial well-being and ensure enabling every employee to reach their potential and improve their lives and the lives of their families. So in the next few minutes, I'll provide details of our financial performance in the first quarter, but I would also encourage you to review our Form 10-Q, which we filed yesterday. It contains far more information about our business, our operations and financial performance than we'll cover on this call. First, revenue totaled $30.7 million, and this represents a 39.1% increase from revenue of $22.1 million in the first quarter of 2021. And though we're pleased with year-over-year revenue growth and revenue, we do believe that looking at revenue on a trailing 12-month basis provides greater insight into the quarterly momentum that we are building. That's a 25% increase from revenue of $99 million for the 12-month period ended March 31, 2021. Revenue in each of our last four quarters has been $30 million or more, and we see more predictability in future quarters in line with that $30-plus million quarterly trend. First quarter operating expenses totaled $3.9 million, a 3.7% increase from Q1 of 2021. Operating expenses were driven primarily by $300,000 in research and development costs compared to no expense in the prior year quarter. As a result, net income in Q1 totaled $138,000 or $0.05 per basic and diluted share, up from a net loss of $1.6 million or $0.58 per basic and diluted share in Q1 of 2021. First, net cash provided by operating activities in the quarter ended March 31, 2022, was $1.5 million. Positive operating cash flow was driven by EBITDA of $600,000, coupled with lower net working capital of $800,000. We watch cash daily, and over time, our aspiration is to build Nortech into an enterprise that reliably generates free cash flow every quarter and every year. Recall that in December 2021, we extended our $16 million credit facility until 2026. We had borrowings on that line of credit of $7.6 million as of March 31, 2022. We believe that cash provided by operations, one-time ERC funds, funds available under our credit agreement with BofA, cash on hand will be adequate to meet our liquidity needs, including working capital, CapEx and debt payment obligations. We're adding new operational capabilities that solve today's problems, and we are proactively anticipating new problems by investing in tomorrow's copper to fiber technologies."
}