{
    "symbol": "PAG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 18:21:05",
    "content": " Today's call is being recorded and will be available for replay approximately 1 hour after completion through February 15, 2022, on the company's website under the Investors tab at www.penskeautomotive.com. I will now introduce Anthony Pordon, the company's Executive Vice President of Investor Relations and Corporate Development. Good afternoon, everyone, and thank you for joining us today. A press release detailing Penske Automotive Group's record fourth quarter and record full year 2022 financial results was issued this morning and is posted on our website, along with the presentation designed to assist you in understanding the company's results. Joining me for today's call are Roger Penske, our Chair and Chief Executive Officer; Shelley Hulgrave, EVP and Chief Financial Officer; and Tony Facione, Vice President and Corporate Controller. Our discussion today may include forward-looking statements about our operations, earnings potential, outlook, future events, growth plans, liquidity and and the assessment of business conditions. We may also discuss certain non-GAAP financial measures, such as earnings before interest, taxes, depreciation and amortization or EBITDA, our leverage ratio and free cash flow. Our actual results may vary because of risks and uncertainties outlined in today's press release, which may cause the actual results to differ materially from expectations. Good afternoon, everyone, and thank you for joining us today. 2022 was a record year for PAG, and was driven by our diversification, certainly, our premium brand mix and our capital allocation. During 2022, we increased our revenue by 9% to almost $28 billion. We increased our income from continuing operations by 16% to $1.4 billion, and we grew our earnings per share by 25% to $18.55. And during the year, we repurchased 8.2 million shares or 11% of our shares outstanding at the beginning of the year. I'm pleased to report record revenue and earnings per share, which was driven by our diversified business model. Excluding FX, revenue increased 17% to $7.4 billion, and earnings per share increased 8% to $4.30. Again, during the fourth quarter, we repurchased approximately 2.5 million shares of stock for $284 million. Looking at our retail automotive operations, and this is on a same-store basis, Q4 '22 versus Q4 '21, our new units increased 11%. However, we do expect supply constraints to remain during 2023 for most of the brands in the premium side that we represent. In fact, in the U.K., our forward order bank is 23% higher than it was at the same time last year, representing 31,800 units or GBP 100 million of forward gross profit. Used units declined 4%, largely due to the challenges in acquiring affordable inventory to meet our customer expectations. However, when excluding FX, revenue increased 10%. When compared to Q4 last year, verbal gross profit declined 11% to $740. However, excluding FX variable growth only declined 7%. If you really look at that on a sequential basis, excluding FX, variable gross profit per unit only declined $33. However, when excluding FX, service and parts revenue increased 11%, driven by increases in customer pay, warranty and our closing repair business. During 2022, CarShop unit sales increased 12% to 71,242 units. However, our variable gross profit per unit declined 19% to 21 0 8 as vehicle acquisition prices, reconditioning costs and logistics continue to impact customer affordability and certainly our profitability. As you know, our Premier Truck Dealership business represents 39 locations in North America, and a very important part of our diversification. In 2022, this business generated $3.5 billion in revenue and contributed $215 million in earnings before taxes and had a return on sales of 6%. During the fourth quarter, our unit sales increased 28% to 5,704. Same-store unit sales increased 22% to 5,287 units. We outperformed the Class A market in the fourth quarter, growing our sales by 36% compared to the market, which increased 30%. Our same-store revenue increased 33%, including a 16% increase in our service and parts business. EBT increased 14% in the quarter to $51 million, and approximately 75% of our new unit sales are Class 8 commercial trucks. The Class 8 truck market remains strong, with retail sales of over 309,000 units in 2022. And as we look at the forecast for North American sales, for 2023, is 294,000 and the backlog today sits 244,000 units would represent 10 months of sales. Turning to Penske Transportation Solutions, our leasing, rental and logistics business. PAG owns 28% of PTS, which provides us with equity income, cash distributions and cash tax savings. As a result, our fourth quarter equity earnings increased 9% to $99.4 million. And year-to-date, we've received $357 million in cash distributions. For the entire year, PTS earnings before taxes were $1.7 billion. Our maintenance, our commercial rental and logistics will remain strong in 2023 as we expect to continue increasing the size of our PTS fleet. As Roger indicated, we had another strong quarter, driven by our diversification and our commitment to maintain operational efficiencies achieved through cost reductions beginning in 2020 as well as automation and other efficiencies gained through AI. SG&A to gross profit was 68.9% in the fourth quarter compared to 67.1% in the fourth quarter last year, and remains 1,020 basis points below the fourth quarter of 2019 prior to the pandemic. As we look to the future, we expect the ratio of SG&A to gross profit to be in the low 70s. Year-to-date, we generated $2.1 billion in EBITDA, representing an increase of 14% when compared to the same period of last year. Cash flow from operations was $1.5 billion and our free cash flow was approximately $1.3 billion, after deducting net capital expenditures. In 2022, we completed acquisitions and new open points, representing approximately $1.3 billion in annual revenue, consisting of 9 retail automotive franchises, 2 open points and 4 commercial truck dealership. For the full year, we repurchased 8.2 million shares of stock for $887 million, which represents 11% of the shares that were outstanding at the beginning of 2022. In addition to share repurchases, we returned $154 million in dividends to our shareholders, and most recently increased the dividend by 7% to $0.61 per share, reflecting our strong fourth quarter performance. In total, we returned $1.04 billion to shareholders, representing 75% of our net income. In 2022, we spent $228 million on net CapEx and an additional $42 million on land acquisitions for future growth. As you can see, our capital allocation strategy includes disciplined acquisitions, investments for future growth and shareholder return. Total inventory was $3.5 billion, which is approximately $400 million higher than December 31, 2021. We had a 25-day supply of new vehicles, including 18 days in the U.S. and 37 days in the U.K. Days supply of new vehicles for premium was 28 and volume foreign was 13. At the end of December, our long-term debt was $1.6 billion, representing an increase of $148 million when compared to December 31 of last year. The average interest rate on our total fixed rate debt is 3.8%, which we have secured for an average remaining term of 5.7 years. We have the ability to flex our leverage to 4x, leaving us plenty of opportunities to grow our business through acquisitions and to continue returning capital to shareholders. At December 31, we had $107 million in cash and over $1.1 billion in liquidity and we remain confident in our ability to manage through any macro challenges that may lie ahead. In the fourth quarter, 37,000 of our online service appointments in the U.S. were created using AI and total online BDC appointments increased 10% to over 520,000. We continue to integrate digital solutions to automate and streamline processes to ensure consistency, our compliance and quality control, while pursuing digital sales through our preferred purchase program, our OEM digital programs and our proprietary website in the U.K. In Q4, digital sales represented 5% of our total unit sales. We also focus on reputation management, and we are proud to congratulate 126 of our dealerships for being recognized as top dealers by CARFAX. Greg Penske brings extensive automotive retail industry experience, has relationships with automotive partners and has familiarity with all of the company's operations. Rich Shearing, formerly the President of Premier Truck, will oversee Penske Automotive Group's North American operations, including its automotive and commercial truck dealerships. Randall Seymore, formerly the Executive Vice President, Global Operations for Commercial Trucks and Power Systems, will oversee Penske Automotive Group's international operations in the U.K., Europe, Japan and Australia. These new  will work in tandem both with me and Rob Kurnik, our President, and our executive leadership team, while building further depth to ensure that we have the best leadership in place to remain the leading transportation service company in the world. In closing, our results continue to demonstrate the benefit of our diversification across the retail automotive and commercial truck industries, our cost control and a disciplined capital allocation strategy. New vehicle demand has clearly hung in there on the automotive side, despite price increases, rate increases, and I think a volatile backdrop. Well, let's talk about our business, which obviously is diversified. But point number one is on the vehicle side, we're premium luxury. And our prefilled inventory, both in the U.S. is 40% to 50%. I think that lease penetration is down significantly due to -- certainly, when we look at residual support and also some of the support we get from the finance companies. And when you look at it in real numbers, 55% of our premium was leasing prior to maybe the last 12 to 18 months. And our overall, from a Penske perspective, was 34%. And I think, at this time, we're going to have to wait and see. So to me, that's going to be something we'll look at as we go forward. But I think the premium customer right now, affordability hasn't hit them, obviously, even with higher interest rates. And when you think about what we're getting, they're building the best cars they have with the highest margins for not only the factory, the OEM, but also for us. And I think that growth continues to be strong, and I think when you look at our inventory, it's way below our historical levels, which you can see that based on looking at our numbers. So again, low inventories, OEMs building the right product for us in the premium side, I think bodes well for us as we look over the next couple of quarters. Well, let's look at SG&A. When you look at the fourth quarter, our SG&A went up probably 100 basis points from before. And most likely, an impact here in the U.S. was the fact that our loaner car vehicle maintenance was up significantly due to the fact that we have more loaner cars in fleet and we can't turn them today as we did in the past because we don't have the availability. Now when I go forward, and we look at it, I think we got to look at -- really got to look at 2 components. And I think looking today, we were 3,200 in 2019. And I looked at the numbers for January, we're at 6,600. But to me, when I look at our SG&A, if we took 2,000 off the gross profit, say, during the year, just as a number, our SG&A would go from roughly 69% to 72% from a gross profit standpoint in our SG&A. So I think what we're doing is looking at how we can reduce labor force in many cases, using AI. And we're seeing the customer satisfaction go up, the ability to schedule work and the way we want to more seasonally and also based on the days availability has been much better, plus we've got the benefit of putting filling our jobs at times that we wouldn't be able to do before. And again, I think that will help us with automation, will all help us in our absorption because we'll get more work through our shop, which maybe will offset lower margins with higher unit sales but also higher parts and service gross profit. But if we focus on this one, -- you can clearly see that units in total we're up 13%. Well, I think that, number one, we had the benefit of the U.K. Because they were locked that probably had less availability in '21. And over there, where 91% of our mix is premium luxury. And again, we are running with  low day supply and to me, that was probably when you look at the mix between U.S. and international, that probably would help that number. I mean the CarShop U.K. self-sourcing, 37% is far lower than what you're doing in the U.S. And what we're doing there, we're putting them on to  and giving those vehicles, the CarShop, which has made a big difference. We're looking somewhere between 250 and 400 cars a week, which will help us build that self-purchased vehicles from us rather than having to go out into the auctions. And basically, when you look at the OEMs who used to buy 300, 400, 500, maybe even 600 cars at a time from the OEMs and now they don't have those to buy. So we're somewhat restructuring that, which is going to help our margin, also help our availability. I mean whether you're a bull or bear on estimates for 2023, you're still going to have a high-class problem of reallocating a significant amount of free cash flow. So if we look at what happened in 2022, it was kind of spread across buybacks, acquisitions and obviously the dividend. We've talked before, we typically start with about a 50-50 split of return to shareholders versus growth. That was certainly planted a bit more 2/3 return to shareholders this year, 1/3 in growth. So from a growth standpoint, we typically target 5% growth acquisitions, 5% growth organically. Michelle, I guess we should assume that it remains kind of dynamic -- the target is 50-50, but if it's tilted towards your stock being a lot cheaper than those acquisitions, that will be the direction you'll lean in even in 2023. John was really seen from an acquisition standpoint, the things that we're interested in are certainly high priced at the moment. And the one good thing about our diversification is not all retail auto, U.S., it's international plus our truck business. I know there's opportunities you said all throughout the business, which is great. Well, I think there's no question. As we look at the truck side, the multiples have been less than they are on the auto side, point number one. So -- and also, if it's contiguous, if we can go into a market where we already have scale, we have infrastructure in place that we can take out certain admin costs which help us and gives us the returns we want. But we typically would say in the premium/luxury side here in the U.S. in volume foreign, which is primarily tilted to our Toyota and Honda business. And of course, internationally, we think that 91% market share we have today are mixed, we would stay in that lane from the standpoint of international. And on the truck side, we're committed to Freightliner across all markets and even in Australia with Western Star. Just curious, when you look at, say, at the franchise stores, a used vehicle customer versus a CarShop customer. In the CarShop model, I think we're $4,000 to $5,000 to $6,000 more than that typical customer is paying 12 to 18 months ago. So that's had some limiting factor for us to be able to source vehicles, recondition them, pay for logistics and be market share on a price for the customer. And we've been -- had a luxury over the years, number one, because of the leasing penetration. We've had a lot of leased cars coming back that we bought from the OEMs, which filled our leasing and used car opportunities across the premium brands. If you go back to last year or so, we would turn those probably every 60 or 90 days. So basically, when you look at that, that's limiting us maybe the 10,000 to 12,000 units for the premium side. So we're not going to struggle, but I would say this that we want that young used car, it's a good lease car. I think that the mix that we have today on the premium luxury side, volume foreign probably is the direction. We do have a Ford parts distribution business as part of PAG that operates out of Tulsa, Oklahoma, which is a parts operation, which has been very successful for us with Ford. I think number one, when you talk about gain on sale, we had $500 million in gain on sale in 2022. Now I wouldn't write that down in straight line, but at least shows that the market is still there for our used vehicles that are coming out. If we look at it today, just looking out at pricing and mix as we go into the rest of the year. We did a bond here, $750 million here in the last 10 days. From an overall standpoint, our maintenance costs will be up for one reason, some because we're growing the business, but also because we have 71,000 units on order. And many of these units are replacement units for customers, and many of those units are running high mileage, and we need to get them out of the fleet. So we're going to have the opportunity, hopefully, to get them out here as we go forward. But overall, we've got a very strong business going into next year, with the growth in our truck leasing or contract maintenance. And when I look at our utilization of our truck business and rental side in PTS, if you looked at January, we were at 86% on our tractors. Remember, we have 70,000 units on rent every day, 86% of our tractors are on rental and 82% of our midrange -- and when you think about that, because the size of our fleet, the quality of our fleet, I think that we have those customers coming to us. And because of the size of our leasing fleet, 50% of the revenue we get in rental comes from our lease customers. On the other hand, it will help drive some maintenance costs down, but I still think we'll see some creep on maintenance during the year. I believe U.S. was more like 9%, 10%. Maybe if you could help us across the different buckets like warranty, customer pay or body shop. But when you look at our parts and service growth, after excluding FX, we were up 11%, certainly in the fourth quarter. From the standpoint, our ELR effective labor rate, weâ\u0080\u0099ve been able to increase that across the board in all of our locations, really generally not only internationally, but also domestically, about $7 last year. And we would expect less discounts and hopefully grow that ELR thatâ\u0080\u0099s the effective labor rate that we charge the customer, which will drive more gross profit."
}