{
    "symbol": "VRNT",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-02 22:51:06",
    "content": " We also had strong new booking growth on a PLE basis across new logos and existing customers with 21 large cloud orders, each in excess of $1 million TCV. We're also expecting 30% cloud revenue growth, driving cloud revenue to over $500 million around 55% of our total revenue. As previously discussed, our shift to the cloud will positively impact cash flow, and we're expecting more than 20% growth in cash from operations next year. In addition, I would like to point out that we expect to finish the year with non-GAAP cloud revenue in Q4 of around $117 million, providing us with a solid starting point to achieve more than $500 million in cloud revenue next year. In fiscal 2019, only around 20% of our total revenue came from the cloud, and we're now expecting around 55% next year and targeting around 65% in fiscal 2024. For revenue, we are introducing guidance above our prior target and expect $935 million in revenue, plus or minus 2% or 7% growth, which is being driven by our strong PLE bookings. With continued margin expansion, we expect $2.49 diluted EPS at the midpoint of our revenue guidance, reflecting nearly 11% growth year-over-year. Your line is now open. When you look at our Q4 cloud revenue, we're expecting $117 million, so that's a good starting point to another year of more than 30% growth. Your line is now open. So first, just to make it clear, we passed the midpoint in bookings, and we expect to pass the midpoint in revenue during next year and get to 55% of revenue to the cloud. Your line is now open. If you look at like our 35% to 37% cloud growth this year and more than 60% is new deals, so that's like 21%, and 15% comes from conversion. Your line is now open. Your line is now open. And I think that as we have very large cloud baseline now that is growing 30%, even if perpetual will decline a little bit faster, I still think we have a good chance to accelerate growth rates – overall revenue growth rates. Your line is now open."
}