{
    "symbol": "NTWK",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-14 17:10:08",
    "content": " Following a review of the company's business highlights and financial results, we will open the call for questions. These forward-looking statements are qualified by the cautionary statements contained in NETSOL's press releases and SEC filings, including our annual report on Form 10-K and quarterly reports on Form 10-Q. Finally, I would like to remind everyone that this call will be recorded and made available for replay at www.netsoltech.com and via link available in today's press release. That said, our second quarter financial results were not where we wanted them to be. First, it's important to understand that in the second quarter last year, we had $3.5 million in onetime revenue due to onetime cumulative catch-up on a large contract, which impacted our comparisons. Second, approximately $2 million in revenue that we expected to realize in the quarter was delayed, and we expect to realize it in the third fiscal quarter. As such, we have reexamined our cost structure to not only better align it with today's revenue, but also reprioritize our capital allocation to the most attractive parts of our business with the greatest opportunity to drive sustained growth in revenue and profitability. In short, we will be more focused company better positioned to achieve a return to positive cash flow for our shareholders. Before we get into the details of the quarter, let's keep a few things in mind. Number one, we have a hard fought market-leading position in Asia, a growing market share in Europe and a unique opportunity to grow in the U.S. Number two, the higher margin recurring revenue portion of our business is doing well, and there's opportunity for it to do better. We are focused on expanding our presence in the North American market, particularly in the U.S., which is our most vibrant market. For example, Otoz or mobile, AI and machine learning-based solution has emerged as a very attractive product in this market, and we continue to develop and evolve our product range to specifically target North American customers. We're also growing our partnership with consultant, system integrators and tech partners, including Amazon Web Services and a Tier 1 automotive company through Otoz that will further help to scale our North American operations. The sales cycles can be very long in our business, particularly for some of the larger deals, but we are enhancing our positioning to compete for some of these larger deals and quite optimistic about many of the opportunities we are pursuing. Before I provide a more in-depth overview of our business, I'd first like to turn the call over to Roger Almond, our CFO, who will walk you through our financials for the quarter. Turning to our fiscal second quarter 2023 financial results for the period ended December 31, 2022, our total net revenues for the second quarter of fiscal 2023 were $12.4 million compared with $15.5 million in the prior year period. On a constant currency basis, net revenues were $14.6 million. License fees were $15,900 compared with $1.9 million in the prior year period and were $16,200 on a constant currency basis. The decrease in total subscription and support revenues for the second quarter of 2023 was primarily due to the recording of approximately $3.5 million as a onetime cumulative catch-up in the second quarter of 2022 due to our amendment to our 10-year contract with Daimler Financial Services. On a normalized basis, excluding the onetime cumulative catch-up in the same quarter of last year, we actually saw an increase in our total subscription and support revenue for the quarter on both a GAAP and a constant currency basis. On a constant currency basis, total services revenues were $6.9 million. Total cost of revenues was $9.3 million for the second quarter, an increase of $1.4 million from the second quarter of fiscal year 2022. On a constant currency basis, total cost of revenues was $11.3 million. On a constant currency basis, gross profit was $3.3 million. On a constant currency basis, operating expenses for the second quarter were $7.2 million or 49.4% of sales. For the second quarter of fiscal 2023, we had a net loss from operations of $3 million compared to net income from operations of $1.7 million in the prior year period. On a constant currency basis, the net loss from operations was $3.9 million. On a constant currency basis, our net loss attributable to NetSol totaled $2.7 million or $0.24 per diluted share. As always, it's important to point out that included in our net loss this quarter was a gain of $657,000 on foreign currency exchange transactions compared to a gain of $901,000 in Q2 of last year. On a constant currency basis, we realized a gain of $827,000 on foreign currency exchange transactions. Because we operate in several geographical regions, a significant portion of our business is conducted in currencies other than the U.S. dollar. A decrease in the value of the U.S. dollar compared to foreign currency exchange rates generally has the effect of increasing our revenues, but it also increases our expenses denominated in currencies other than the U.S. dollar. Similarly, as the U.S. dollar gains strength relative to foreign currency exchange rates, it tends to reduce our revenues, but it also reduces our expenses denominated in currencies other than the U.S. dollar. We plan our business accordingly by deploying additional resources to areas of expansion while continuing to monitor our overall expenditures, given the economic uncertainties of our target markets. Please see the reconciliation schedules contained in our earnings release for our revised calculations of adjusted EBITDA for the quarters ended December 31, 2022 and 2021. At the quarter end, we had cash and cash equivalents of approximately $21 million or approximately $1.86 per diluted common share. The NetSol stockholders' equity at December 31, 2022, was $44.4 million or $3.93 per share. This market represents a robust growth opportunity for our business, particularly as we exit the coronavirus pandemic, which created accelerated demand for modernization and digitization in the industry. Specifically, we are seeing demand related to customers that required a digital entry point to their financial services provider and employees who are certainly shifted to remote work and acquired the ability to digitally provide financial services to customers. As a result, our core customers, financial institutions, automotive and equipment OEMs and automotive dealers realize that their IT infrastructure needed to adapt to these changes and our products are ideally suited to meet their needs. Moreover, the increased demand for cloud-based services has positioned our NETSOL Cloud Services division to capture increased market share as we support both new and existing customers in modernizing their IT infrastructures. To that end, Otoz offerings continue to see excellent traction in the United States, which illustrates the power of NetSol's commitment to innovation. Since last quarter, Otoz has expanded its U.S. presence to include 37 dealers across the 16 states, showcasing the healthy and growing demand for SaaS and AI-based platform in this region. Additionally, in the second quarter of fiscal 2023, we entered into a new multimillion dollar agreement with a Tier 1 automotive company in the United States, which will implement and license our Otoz Mobility Solution to manage back-office operations for vehicle subscriptions. Otoz penetration in the U.S. has been an excellent catalyst for our growth in this market, and we are further accelerating our expansion by investing in our partnerships with consultants, system integrators and other technology partners. In the second quarter, we were pleased to expand our partnership with Amazon Web Services, or AWS, and became an API gateway delivery partner. We expect this partnership to position NETSOL to expand our cloud capabilities by providing us with a fully managed service with developers to create, publish, maintain, monitor and secure application programming interfaces at any scale. Finally, we're making good progress, establishing a support and delivery system center in Austin, Texas, which is quickly becoming a hotspot for tech businesses in the U.S. In APAC, our revenues decreased compared to the second quarter of 2022. However, this is our largest and most established market and with the progress that we continue to make on our multiyear, multi-country implementation roadmap, we are confident that we are positioned for sustainable positive results in this region. Our European operations provide us with more growth opportunities as compared to APAC, where we are already established as a leading provider of finance leading software in the region, our cloud-based and SaaS offering continue to gain traction in the European market. Contributing to our recurring subscription and support base revenues, which we believe represent a very attractive opportunity for NETSOL going forward. We anticipate that through a combination of our cloud-based and SaaS offering and the implementation of NFS Ascent for a major Scandinavian bank across 4 countries in 2024, we are well positioned to deliver improved results. In summary, while our second quarter results were not where we wanted to be, we are enthusiastic about the value-driving initiatives underway. I was wondering if you could give us kind of an estimate of your percentage of market share in Europe, Asia Pacific region and the North America. And it's very difficult to -- there's no, I think, any kind of monitoring or engaged to see what exactly is the market position. I believe in Europe, we are growing our market share because we can see the number of companies operating as a competitor, and we have been invited in most of all the opportunities in RFPs, and we are participating in a lot of different new bids in the European market. Again, it's very hard to say what the percentage is but we can -- our position in Japan, in China, in Australia, in New Zealand and other markets in the APAC is very strong. And as I mentioned in my comments, that our China market will continue to ramp up exactly because we have added a new vertical in -- to cater to the local Chinese market, which we call it professional services. And our head of the operation, Amanda Li has a very bullish program plan to promote this new offering, which means we hired about 45, 47 new employees in China in the last 6 months, all Chinese local to go towards a local Chinese companies and whether they're in auto sector or truck sector or whatever, there's opportunity for us to grow in the professional services on a very impressive daily rate. North America is the most exciting thing happening for us and simply because, yes, we have not seen the results as of this quarter. We're now investing because we realized that we've done enough in the APAC market, and we don't want to invest too much more other than a onetime investment in China. So we believe this second half, we're pretty confident that there will be good progress. We are fully committed about the U.S. market, and we believe this is the market, which will change the total landscape of this company in the coming quarters and coming years. So we're investing in this market, and we believe this is the right thing to do. I mean when I look at the 30,000-foot view, I see that we've hired on over 500 employees in the last few quarters. But our sales pipeline has gone, I remember, it was under $200 million. And it's -- when can we see this occur, it's just a little frustrating that salaries and consultant expenses have now grown to over 50% of revenue. So we've got all these new employees on, and we're kind of hoping that the dam breaks, so to speak, and we see this jump in revenues. What it does is that -- this is a time, I believe, to invest in growing the business in different verticals, which is linked to FinTechs and our core business. We believe the reason we are late in the market because we have now enough implementations of Ascent, particularly in China, and the 12 markets of Asia Pacific and some now in Europe. In addition to not just this core business that we're trying to position ourselves where the pipeline is, we're on cloud building our SaaS revenues, mobility. So there's a lot of action in a lot of front and you see the numbers, you're right, we have added 450 to 500 people. We started this exercise few weeks earlier before this quarter ended is to find ways to be more efficient company, to be more leaner, to be more productive. And we believe strongly about that we can really do a good job given that our experience as an IT company and now FinTech, we have the ability to reach out to larger customers and show them that we can build a new opportunity in the U.S. market, not just our main business, but the new opportunity like AWS and professional services and so forth. You mentioned rightly this is, we have to maintain our -- the core team in Lahore and other offices around the world to make sure that we don't lose them because of high inflation, everybody is at least a middle class that is suffering. So we do whatever it takes to not lose our good employees, bring fresh new people to build investment for the future in the U.S. And I think when we talk about these high pipeline, look, I'm sure you're familiar -- I don't know how much you understand how long the field cycle in our kind of business. We're not all the shell company which has ready to make these customers spend days, weeks, months and narrowing shortlisting from 10 to 5 to 3 to now 2. One of these deals or 2 of these deals in the next 6 months can hit the number that you're talking about, I'm pretty confident. Because this quarter, you didn't see any growth, and we obviously could not recognize at least $2 million in the Q2 because the timeline but the deal was signed and this is based in Australia and I think we can recognize that in the Q3. U.S. people sitting in Lahore or doing the calls day and night with these customers, 30, 40 at a time from other side and our side. So I think the timeline is you'll see some value -- tangible value if not in the third in the fourth quarter by the time you have some severances and timeline, all that happened. But the real, I think, benefit will be in the fiscal 2024, beginning of 24, which is about 2 quarters from now. Actually, we're also downsizing our U.S. corporate offices to a bit more leaner instead of investing in the business side of it. And I'm very, very bullish in the U.S. simply because I know what is happening in Europe, this struggling a lot more than U.S. U.S. has the ability to control the inflation, they can control inflation in the European market. Despite of that, I believe the U.S. is the only place we feel it is the market for us, and we'll put all our best talent, more energy and financial investment to get some penetration in this market and see on real results that we've been working for many, many years. We've hired some couple of MIT PhDs, and we brought them to our facility in Lahore, and they're playing a big part in building this for our customer basis. If your question was not addressed during the Q&A session, please contact NETSOL's Investor Relations team by e-mailing them at investors@netsoltech.com or by calling them at 949-574-3860."
}