{
    "symbol": "CI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 14:35:05",
    "content": " In our remarks today, David and Brian are going to cover a number of topics, including Cigna's second quarter 2022 financial results as well as an update on our financial outlook for the year. These businesses represent about 40% of our company's revenues, and we expect to grow these further with momentum from our specialty pharmacy and care services businesses within Evernorth and our U.S. government business in Cigna Healthcare. For Cigna Healthcare, our growth framework translates into strong performance driven by ongoing customer growth in U.S. commercial as we continue to improve affordability in key geographies, including through advancing our value-based care and site of care service programs. Also accelerating Cigna Healthcare's adoption of Evernorth Solutions, which creates even greater value for our customers and clients and as a driver of attractive sustainable revenue growth for Evernorth. Looking ahead, we are well positioned to drive continued attractive healthy growth across our Evernorth and Cigna Healthcare platforms by leveraging our portfolio of foundational assets, accelerated growth businesses and fueled by the power of our cross-enterprise leverage. Looking at the quarter specifically, some key consolidated financial highlights include total revenues of $45.5 billion, After-tax adjusted earnings of $2 billion, representing growth of 10% over second quarter 2021 and adjusted earnings per share of $6.22. Evernorth's results in the quarter were driven by the expansion of our accelerated growth businesses, led by our high-performing specialty pharmacy as well as a continued focus on affordability by delivering lowest net cost solutions for our clients and customers. Evernorth continues to deliver attractive results, while Cigna Healthcare continues to grow and expand both customer relationships and margins, giving us the confidence to deliver on our increased 2022 adjusted EPS guidance of at least $22.90. And we would expect, as we step into '23 that we'll be able to deliver within our targeted margin range of 9% to 10% for Cigna Healthcare, but likely at the lower end of that range, given the continued long-term margin opportunities we have in the accelerated growth platforms such as Medicare Advantage. As it relates to pricing in the commercial book of business, this year's 2022 medical care ratio performance has resulted in a higher margin profile for Cigna Healthcare, and that's driven largely by our commercial employer book of business. As we look back at prior year development, which has been largely in line with prior calendar years, the amount of activity we're seeing in the second quarter, Cigna Healthcare book of business as it relates to fundamental strength is quite high. And Lance, going to the last part of your question, those services were more likely than not be Evernorth care capabilities that are offered to Cigna Healthcare commercial or Medicare Advantage, but also offered to the open broad marketplace from that same point and customized to the needs of large stand-alone employers, integrated delivery systems and health line clients. And just to reiterate a few pieces, we built good momentum through the first quarter and we carried into the second quarter, and therefore, we're confident in our ability to deliver our increased EPS outlook of at least $22.90 for 2022 as well as our increased revenue and customer growth outlook."
}