{
    "symbol": "SHLS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 22:15:23",
    "content": " Gross margin in the quarter was 39.7% compared to 36.4% in the prior year period, driven primarily by a higher proportion of revenue from the company's combine-as-you-go system solutions, which carry higher margins and increased leverage on fixed costs as a result of higher sales volumes. Demand for our products continues to grow, and we ended the third quarter with record backlog and awarded orders of $471.2 million, an increase of 74% year-over-year and 44% sequentially. For the third quarter, revenue grew 52% versus the prior year period to $90.8 million, driven by higher sales volume as a result of increased demand for solar EBOS generally and specifically our combine-as-you-go system solutions. As of September 30, 2022, backlog and awarded orders were $471.2 million, representing a new record for the company and an increase of 74% and 44% versus the same time last year and June 30, 2022, respectively. One thing I do want to talk about from a Q4 perspective because I think it's very important, when you look at the midpoint of guidance that we have for the year, costs were nearly 80% year-over-year revenue growth. Yes, specifically on backlog and awarded orders, kind of referring back in Q2, everyone recall is one of the things that we said was we really didn't have a lot of coverage or a lot of spillover left in the quarter based upon the extension or -- I'm sorry, the moratorium on the 2-year panel tariffs. So when you look at where we are from Q2, Q3, obviously, you're having the full quarter with that in play, obviously, having some strong support from IRA perspective definitely allowed us to realize very strong growth in backlog and awarded orders. Feedback from customers has been nothing short of amazing and very excited that we've been able to accomplish not only a successful launch, but launch over 15 different states with validating that value proposition that we're able to bring with that 20% to 30% savings on installation time and cost while also maintaining our average corporate margin profile. In other words, do you think that some of your customers that have already said, \"Hey, we're going to give you this business today for BLA 1.0 may come around and say, actually, we want to upgrade to BLA 2.0\", and then we could see that backlog and awarded a move up faster entering 2023?"
}