{
    "symbol": "KMDA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 16:07:13",
    "content": " Moreover, we generated record operating cash flow of $28.6 million during 2022, supporting the increase in our cash position to $34 million as of December 31st, 2022, which is nearly double what it was at year end 2021. Our impressive results in 2022 and positive outlook for this year has been consequence of our ability to leverage multiple growth drivers, including the portfolio of full FDA approved IgGs that we acquired in late 2021, KEDRAB sales observed in the US, GLASSIA royalties received from the Takeda, other proprietary product sales in international markets, and our thriving Israeli distribution business. I'm thrilled to report that the full year 2022 revenues of acquired products increased by 24% as compared to full year 2021 and are generating gross margins of over 50% During 2022, as part of the establishment of our direct presence in the US markets, we deployed a team of US-based experienced sales and medical affairs professionals who have rapidly established operation in these key markets. For full year 2022, we generated royalty income of $12.2 million and we expect to receive payments in the range of $10 million to $20 million annually through 2040, which will help us grow our profitability and cash position. Total revenues for the full year were approximately $129 million, a 25% increase from the $104 million recorded in fiscal year 2021. For the fourth quarter of 2022, total revenues were approximately $45 million, an increase of 44% year-over-year. The year-over-year growth during the fourth quarter and throughout the duration of 2022 was primarily driven by continued strong sales of our previously acquired IgG products, which was fueled by strong sales in the US, resulting from our ongoing marketing efforts as well as the expansion of ex-US sales of these products. Total gross profit for the fourth quarter of 2022 was $15.3 million, representing 34% margin compared to $6.6 million or 21% margin in the fourth quarter of 2021. Adjusted EBITDA for the fiscal year 2022 was $17.8 million, representing 14% margin, which was in line with our annual financial guidance and represents a substantial increase over the $5.4 million of adjusted EBITDA or 5% margins recorded in 2021. To reiterate the guidance provided by Amir earlier, based on our expectations of significant revenue growth and enhanced profitability in fiscal year 2023, we expect revenues to be in the range of $138 million to $146 million and anticipate generating adjusted EBITDA of $220 million to $26 million. During the fourth quarter, we generated $6.7 million of operating cash flow and a record $28.6 million in total during fiscal year 2022."
}