{
    "symbol": "TOL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-07 12:00:09",
    "content": " In a year filled with supply chain disruptions, labor shortages, permitting delays, inflation, increasing mortgage rates and many other operational challenges, we delivered over 10,500 homes, the most in our history, and grew homebuilding revenues by over 15% to $9.7 billion. Our fourth quarter adjusted gross margin of 29%, a 310 basis point increase compared to last year, and we met our full year guidance of 27.5%, which was a 250 basis point improvement over fiscal 2021. Net income was a record $1.3 billion or $10.90 per share diluted resulting in a return on beginning equity of 24.3%, a 720 basis point increase over fiscal year 2021. As we navigate this market, we are strategically balancing the delivery of our large high-margin backlog in fiscal year 2023 which is down just 7% in value from year-end 2021 with the generation of new sales for future deliveries. With the year-end backlog of nearly 8,100 homes valued at $8.9 billion, and with a midpoint of 8,500 homes projected to be delivered, fiscal '23 is setting up to be another solid high-margin year. With over $3 billion of liquidity at fiscal year-end and substantial operating cash flow projected in fiscal year 2023, we are in a strong position to pay down debt, buy back stock and opportunistically acquire control of land that may become more attractively priced, all while maintaining a conservative and low leverage balance sheet. Adjusting for this net benefit, net income was $535 million or $4.71 per share, up 43% compared to last year's fourth quarter and still an all-time quarterly earnings record. With that said, we are projecting fiscal year 2023 first quarter deliveries of approximately 1,750 to 1,850 homes with an average delivered price of between $950,000 and $970,000. For full fiscal year 2023, we are projecting new home deliveries of between 8,000 and 9,000 homes with an average price between $965,000 and $985,000. But I do think if a buyer wants to buy a build-to-order home from Toll and it's a, call it -- let's just say it's a 13-month delivery, and they can't do anything with it right now in terms of a lock and let's say they have a home to sell, I think there may very well be some growing confidence over the next three to six months, that rates will be coming down when they can lock, call it, seven, eight, nine months out. We already mentioned 10% community count growth coming this year on the land we control, we have strategically delayed those openings, as I mentioned, so that they hit in a better part of the year, which is the spring season, and they hit, we're actively building models everywhere and holding off openings where in COVID, we would have opened them. They're less impacted by rates because they have a lot more equity in the home they raise the kids in that they've owned for 20 or 30 years, and they're more affluent and they're willing to put either all or a lot more cash up and have lower mortgages -- the softest -- and the other three segments, which -- there are two segments, which would be affordable luxury and move-up luxury are running about the same and City Living is doing the best, which is right now, New York only."
}