{
    "symbol": "PNC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-18 13:10:22",
    "content": " Loans for the fourth quarter were $322 billion, an increase of $9 billion or 3% linked quarter. Compared to the same period a year ago, average loans have increased 11% or $33 billion, reflecting increased loan demand as well as our ability to capitalize on opportunities and our expanded coast-to-coast franchise. Loan balances averaged $322 billion, an increase of $9 billion or 3% compared to the third quarter reflecting growth in both commercial and consumer loans. Consumer loans increased $1 billion compared to September 30, driven by higher residential mortgage home equity and credit card balances, partially offset by lower auto loans and loan yields of 4.75% increased 77 basis points compared to the third quarter, driven by higher interest rates. On an average basis, our fourth quarter securities of $143 billion grew $6 billion or 4%. On a spot basis, securities were $139 billion and increased $3 billion or 2% linked quarter. Looking more closely at the fourth quarter, total revenue was $5.8 billion, an increase of 4% were $214 million linked quarter. Capital Markets and Advisory revenue grew $37 million or 12%, driven by higher merger and acquisition advisory fees, partially offset by lower loan syndication activity. Lending and deposit services increased $9 million or 3%, primarily due to higher loan commitment fees, reflecting our strong new loan production. During the fourth quarter, our allowance for credit losses increased $172 million, and our reserves now total $5.4 billion or 1.7% of total loans. Looking at first quarter of 2023 compared to fourth quarter of 2022, we expect spot loans to be stable, which equates to average loan growth of 1% to 2%. I think we're going to -- I think we will get inflation under control, but I think it's going to be a struggle to get it under three long-term, and I think front rates will rise will stay higher they might cut and likely will cut from some 5% level."
}