{
    "symbol": "PNC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-14 13:56:04",
    "content": " And importantly, based on our performance and strong capital levels to the Board's confidence in our execution of our strategic priorities, we recently announced a substantial increase to our quarterly dividend of $0.25 per share to $1.50, or 20%. Investment securities grew $6 billion or 5%, and Federal Reserve cash balances declined $13 billion or 17%, reflecting higher securities and loan balances as well as lower borrowed funds. Our tangible book value was $79.68 per common share as of March 31, a 15% decline linked quarter, which was entirely driven by mark-to-market adjustments in our securities and swap portfolios as a result of higher interest rates. Average loans increased $2 billion linked quarter, and on a spot basis, loans grew $6 billion, or 2%. Looking at loan growth, excluding the impact of PPP loans, average loans increased $4 billion or 1%, driven by $5 billion of growth in commercial and industrial loans, partially offset by a $1 billion decline in commercial real estate balances and average consumer loans were stable linked quarter. On the right, you can see total deposits at period end were $450 billion, a decline of $7 billion or 2% linked quarter. As a result, average security balances increased by 5% or $6 billion compared to the fourth quarter of 2021, and now represent 27% of interest-earning assets. However, the increase in rates during the first quarter resulted in higher net unrealized losses of approximately $6 billion, and accordingly, our period-end balances remained relatively state. Expenses declined $619 million or 16% linked quarter, and excluding the impact of integration expenses, noninterest expense declined 7%. The first quarter provision recapture was $208 million, primarily reflecting the impact of improved COVID-19-related economic conditions, and our effective tax rate was 17%. Consistent with those revisions, first quarter fee income was $1.7 billion, a decline of $296 million or 15% linked quarter. Capital markets-related fees declined $208 million or 45%, driven by lower M&A advisory fees mostly due to elevated fourth quarter transaction levels, but also some delayed transaction activity in the first quarter. Nonperforming loans of $2.3 billion decreased $182 million or 7% compared to December 31, and continue to represent less than 1% of total loans. Total delinquencies were $1.7 billion on March 31, a $286 million decline from year-end, reflecting lower consumer and commercial loan delinquencies. And during the first quarter, we reduced our allowance for credit losses by approximately $300 million, and our reserves now total $5.2 billion or 1.8% of total loans. Looking at the second quarter of 2022 compared to the first quarter of 2022, we expect average loan balances to be up 2% to 3%, which includes a $1.3 billion decline in PPP loans. We expect total noninterest expense to be up 3% to 5%, and we expect second quarter net charge-offs to be between $125 million and $175 million. Considering our reported first quarter operating results, second quarter expectations and current economic forecasts for the full year 2022 compared to the full year 2021, we expect average loan growth of approximately 10% and spot loan growth of 5%."
}