{
    "symbol": "CMP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-05 12:11:17",
    "content": " Moving to our financial performance in the third fiscal quarter, we delivered results in line with our expectations heading into the quarter with revenue rising 8% to $215 million and adjusted EBITDA coming in at $29 million. With three quarters of our fiscal year now behind us and roughly 80% of the adjusted EBITDA we expect to achieve the fiscal year having now been delivered, we're focused on finishing the year strong and positioning the company to deliver improved financial results in fiscal â\u0080\u009923, more in line with underlying earnings power of our business. Consolidated revenue was $214.7 million for the third quarter of fiscal 2022, up 8% year-over-year, primarily driven by favorable Salt segment average pricing up 8%. Despite the revenue increase, our consolidated operating earnings decline $4.4 million to an operating loss of $3.5 million and adjusted EBITDA declined by the same amount reflecting continued pressure on production and distribution costs within the Salt segment. On a segment basis, Salt revenue totaled $156.2 million for the third quarter of fiscal 2022, up 10% year-over-year driven by 2% growth in sales volumes and an approximate 8% increase in price. Despite higher revenue, Salt operating earnings declined 35% year-over-year to $12.4 million, while EBITDA declined 25% to $27.7 million, primarily reflecting higher production and distribution costs. Turning to our Plant Nutrition segment, revenue for the third quarter rose 3% to $55.6 million year-over-year due to higher pricing, despite a 24% decline in volume. For the quarter, we ended June with net debt of $839 million, down $76 million from our 2021 fiscal year in and with net leverage of approximately 4.4 times as defined by our credit agreement, which allows for the add back of non-cash and non-recurring items of approximately $40 million for the trailing 12-month period. As we approach our next fiscal year, our focus will remain on restoring the profitability of our Salt business positioning our Ogden facility delivered more consistent, predictable, and reliable SOP production, identifying and executing productivity initiatives that allow us to offset the threat of additional inflationary pressures, and advancing our efforts to expand our premier essential minerals franchise into the attractive markets, the lithium and next generation fire retardants."
}