{
    "symbol": "CMP",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-30 17:45:28",
    "content": " I'm pleased with the team's efforts and expect to see substantial progress in fiscal 2023 as measured by EBITDA per ton rising to match or exceed the $20 per ton in EBITDA, the Salt segment has delivered on average over time, up from approximately $15 EBITDA per ton is delivered in fiscal 2022. From a funding perspective, our $45 million equity investment this fiscal year increased our stake to roughly 45% and helped position Fortress to build out its manufacturing infrastructure, stockpile inventories of raw goods, and began hiring key stack. Fourth, we announced our intention to construct by 2025, the conversion facility at our Ogden, Utah solar evaporation site with a target annual production of 11,000 metric tons of lithium carbonate with an expected NPV of between $626 million to $985 million and an after-tax IRR of between 28% and 36% on estimated development capital of approximately $262 million at an FEL-1 level of accuracy. From a valuation perspective, the projected after-tax NPV of Phase I of our lithium project is approximately $626 million, assuming an average lithium carbonate selling price of approximately $16,000 per MT, which equates to nearly 40% of our 30-day average market cap were approximately $15.25 per share. On a segment basis, Salt revenue totaled $188.9 million for the fourth quarter, up 18% year-over-year, driven by 15% growth in sales volumes and a 3% increase in average selling price. Despite higher revenue, Salt operating earnings declined 27% to $16.3 million for the quarter and by 34% to $117.4 million for the full year as increased production and distribution costs more than offset revenue growth. Plant Nutrition's full year results reflected operating earnings of $37.1 million, over 4 times higher than the prior year levels and EBITDA of $72.7 million, up 62% year-over-year, driven by a strong pricing environment. Throughout the year, we took several steps to align our financial policy and capital structure with our strategy to accelerate growth and reduce the weather dependency of our earnings profile, including recalibrating our dividend, earmarking $200 million of the net proceeds from the Coke equity investment towards funding Phase I of our lithium development, and approximately $40 million for permanent debt reduction; and finally, completing the divestiture of our South America Chemicals business and applying the net proceeds towards debt reduction. From a free cash flow perspective for fiscal 2022 despite the substantially below trend adjusted EBITDA performance and $45 million investment in Fortress, we nevertheless delivered positive free cash flow of approximately $18 million, benefiting from the $51 million in proceeds from the sale of our South America Chemicals business and an $18.5 million earn-out payment associated with the sale of our South America Specialty Plant Nutrition business. Overall, assuming normalized winter weather, we expect our Salt segment to show improved profitability year-over-year to around $20 of EBITDA per ton, up from roughly $15 per ton in fiscal 2022 on higher pricing driven by our successful efforts to pass through inflationary and fuel impacts incurred in fiscal 2022 as part of the recent bidding season and recalibrating our mix toward geographies where we have natural competitive advantages that enhance our profitability. On the topic of lithium, I would also note that lithium-related operating expenses are projected to be in the range of $10 million to $12 million this year versus $8 million in fiscal 2022. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}