{
    "symbol": "A",
    "quarter": 1,
    "year": 2021,
    "date": "2021-02-16 21:29:04",
    "content": " Mike talked about the investment in the MassHunter software, which I think is going to really help continue this momentum that we have going forward from a compliance standpoint, and it's an area of focus, and we're very excited about the biopharma business going forward. And as we think about, Mike mentioned this in his script, actually our focus on actually turning ongoing revenue into service contracts, this is an area where we've had a specific focus in China there, and it's really helped us. And that's -- when you have double-digit growth in LC, the strength in the cell analysis business, we had indicated when we acquired BioTek that we are buying not only high growth but also a high-margin company, I think you're seeing it in the numbers. We think the last couple of acquisitions have really borne that out with ACEA as well as BioTek in the cell analysis space, and it's really helped continue that shift to higher-growth markets, and that's the area that I would think -- and there's really opportunities across all of our -- both in instrumentation as well as in kind of consumables area or that recurring revenue stream as well. And Doug, we continue to look for companies also not only to meet that criteria, but also we think there are strong cultural fit that really would be part -- could really be a key part of the overall Agilent family, so to speak, and also a business where we think we can make that business even better. And for example, when they've had several years of an enterprise service arrangement with you, and you show them collectively -- or I should say, actually, objectively, what's been going on the lab with various different vendors in terms of equipment, it will point to, for our case, a decision to let's move more of our business to Agilent instrument side. So I think that's part of the story there, which is to really have focused our investments and our portfolio towards those segments of the marketplace, which we expect to have even higher growth in the overall pharma market space. I think also with food, I'm not sure I would really would use catch up describe this because, clearly, where you had some of the pharma companies just weren't having the research in and didn't work, had deferred investment, I think this has been part of the coming together of the new 5-year plan for China, and that's what's really driving this. I think it's hard to know, Dan -- we've always felt this thing was not a market that was shrinking, wouldn't shrink long-term, which it had been for a few years, but it's more like a high single-digit longer term."
}