{
    "symbol": "A",
    "quarter": 2,
    "year": 2021,
    "date": "2021-05-25 23:27:10",
    "content": " I think it shows the investments in the great execution by the team that has been paying off over the last several years and I think what you're seeing is not only a market recovery for sure, but I think the relevance of our portfolio across all three of our business groups in that business, and certainly we are benefiting from the investments to expand capacity and new therapeutics across various end markets. There is some testing that's done in the CLIA lab as you mentioned, there is a relationship with LabCorp, and that is something that we expect over time to ramp, both because of the testing for LabCorp and also testing that will result from actual companion diagnostics that are approved as part of the former work that we're doing, but both are important, but the substantial part of our revenue today in this year, and even in the coming 18 months, 24 months will continue to be some pharma services revenue. Yes, absolutely, Tycho to Mike's point I think we see this kind of reverting back over time, but certainly what we're seeing is increased investment and increased testing here really around the globe. And Bob and Sam you guys, keep me honest here as well, but pharma services business model we have where we can leverage a lot of investments that we've already made around our IHC base CDx business, we're not in the same position increment there perhaps maybe start up some of it brand new entering the space. And Derik, if I could just add on to that, I think it's fair to say Jacob, we're seeing both market expansion but also some acceleration of replacement market as well, particularly in pharma molecule. If you recall last year, we actually grew in that business and then saw a strong fall off when the pandemic really hit and we're expecting accelerated growth in Q3, but this is an area where we're watching to say, is there going to be sustained – how fast is that sustained recovery going. So, though we like to talk about our instrument, it's always connected – most of the time connected within a very strong position in Informatics, and we continue to invest in Open Lab, in fact, we believe that is the lab, where we connect all our instruments into an ecosystem in a cloud setup where you can also track your samples and in the end also connect into an e-commerce set up is going to be the future, and with Agilent's broad portfolio we can very quickly, we can very well do this. It’s been working for us Bob and I think we can adjust the question...\n Just quickly, we're not going to give a specific target around that other than to say that our intent is to maintain an investment grade and we ended the quarter at, kind of 1 times net leverage and that gives us plenty of flexibility to continue to invest in deals growth accretive deals as Mike just talked about. I think it's been a combination of all those factors helping us to do really well in our LSAG and ACG groups, and then obviously we talked earlier about the play in cell analysis, which is a new addition to the company in biopharma, and then our NASD play in Sam's business."
}