{
    "symbol": "INCY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 12:11:04",
    "content": " Revenues from our current portfolio of commercialized products grew 18% year-over-year, both in the fourth quarter and for the full year to $764 million and $2.7 billion, respectively. As we look across our portfolio, the drivers of this double-digit growth are the continued commercial execution for Jakafi, net sales of which increased $275 million in the year to reach $2.4 billion and initial contributions from recently launched products and indications, including Minjuvi and Pemazyre in Europe and Japan and Opzelura in the U.S. And this past July, we received approval and launched Opzelura in vitiligo as the first FDA-approved therapy for repigmentation. In the fourth quarter, Jakafi net sales grew 9% year-over-year to $647 million and grew 13% for the full year to $2.4 billion. Our fourth quarter results reflect continued strong revenue growth with total product revenues of $764 million, representing an increase of 18% over the fourth quarter of 2021. For the full year 2022, total net product revenues were $2.7 billion and total revenues were $3.4 billion, representing 18% and 14% year-over-year increase, respectively. While we will continue to work on reducing patient co-pay and in turn, improving gross to net, an average gross to net of 50% is a good working assumption for 2023 with a gross net discount in the first quarter of the year expected to be higher than subsequent quarters as plans reset patient deductibles at the beginning of the year. For the full year 2022, total R&D expenses, which in addition to the Villaris upfront payment also include $56 million in other milestone payment, were $1.6 billion representing a 9% year-over-year increase. For Jakafi, we expect net product revenues to be in the range of $2.53 billion to $2.63 billion, which at the midpoint represents an increase of approximately $170 million over 2022, driven by continued growth across all indications. If you remember last year, in terms of GVHD, we had bolus of growth in the fourth quarter of 2021 as patients transitioned from our expanded access program, about more than 300 of them transferred from our expanded access program to commercial drug. So seeing that kind of growth again is not likely to happen this year, but we'll continue to see the drug grow quarter-over-quarter, year-over-year in terms of new patients, total patients in MF, PV and GVHD. I think the issue there is really that the second line and the whole diffuse large B-cell lymphoma marketplace has changed dramatically with increased competition, particularly with the CAR-T therapies moving into the second line setting, it becomes a challenging place for us to break through, but it's absolutely a very good product that has -- can have complete responses with long durations of response and we're continuing to try to expand the use of this drug because we think patients will really benefit from it."
}