{
    "symbol": "EA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-01 21:24:06",
    "content": " Your line is now open. And what we’ve demonstrated over the course of our, the best part of 40 years is to really develop both our own IP over time, the Need for Speed, The Sims, Battlefield, Apex Legends, our BioWare franchises, we have Skate in development now, Dead Space on the way, so an incredible portfolio of own IP that has an extraordinary following across the industry. Your line is now open. And when you look at our strategy of what we’re doing around in great -- creating great entertainment, around building tools, so that now community can engage more deeply, around the aggregation and distribution of content across platforms, across business models, across geographies, and really leaning into the social ecosystem to the board out of engagement in our games, I think you should imagine that’s what the world look \n Got it. Your line is now open. Your line is now open. Your line is now open. Second question, I am curious, you are coming back to mobile, and maybe some of the recent acquisitions, kind of curious if you could talk a little bit about how you’re thinking about advertising, I know, it’s come up a bit, other companies might get 10% to 20% of their mobile bookings from advertising, Glu brings some new capabilities, I am curious how you are thinking about advertising, I am curious how you’re thinking about the Glu pipeline, you have almost a year into that deal. And as per my prepared remarks, we’re projecting well into double-digit growth next year and that includes Apex Mobile and renewed FIFA Mobile, and a full year of Golf Clash and ongoing growth across the portfolio and we’re excited about that. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. They deeply engage with their community and they are delivering content modalities, applying maps, these things that really speak to what the community are asking for and what we’ve seen since the very beginning of the launch of this game is them being able to work in a very calculated way around the delivery of really interesting new content, new maps and new models apply on a season by season basis that has continued to grow the overall player base, continue to grow the overall experience, continue to grow the engagement that play base has with the experience and the investment those players are making as part of their engagement. Your line is now open."
}