{
    "symbol": "MWA",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-08 14:42:10",
    "content": " Gross margin of 25.8% decreased 340 basis points compared with the prior year as benefits from higher pricing were more than offset by higher costs associated with inflation, unfavorable manufacturing performance and lower volumes. Selling, general and administrative expenses of $63.6 million in the quarter increased 12.4% compared with the prior year. Adjusted EBITDA of $38.6 million decreased 15.4% in the quarter, leading to an adjusted EBITDA margin of 11.6% compared with 15.4% in the prior year. For the full year, our adjusted net income per share increased 3.6% to $0.58 per share compared with $0.56 per share in the prior year. Net sales increased 8.8% compared with the prior year, primarily due to higher pricing across most of the segment's product lines. Adjusted operating income of $20.5 million decreased 26.5% as the benefits from higher pricing were more than offset by higher costs associated with unfavorable manufacturing performance, primarily at our brass foundry and specialty valve operations, inflation and lower volumes. Adjusted EBITDA of $28 million decreased 21.3%, leading to an adjusted EBITDA margin of 15.6% compared with 21.6% last year. Net sales of $152 million increased 16.3% as compared with the prior year, primarily due to higher pricing across this segment's product lines. Adjusted operating income of $13.8 million decreased 1.4% in the quarter as benefits from higher pricing and increased volumes were more than offset by higher costs associated with inflation, SG&A expenses and unfavorable manufacturing performance. Adjusted EBITDA of $21.9 million increased 2.8% in the quarter, leading to an adjusted EBITDA margin of 14.4% compared with 16.3% last year. Average net working capital using the 5-point method as a percent of net sales increased to 27.5% compared with 25.7% in the fourth quarter of last year, primarily due to higher inventories. Free cash flow for the year was negative $0.8 million compared with $97.1 million in the prior year, primarily due to the decrease in cash provided by operating activities, partially offset by lower capital expenditures. As a result of our sales growth forecast and improved operations execution, we expect adjusted EBITDA will increase between 10% and 14% as compared with the prior year. It's the last of the 3 major capital projects at ballpark-ish $150 million of multiyear spend that was associated, remind everybody, large casting foundry in Chattanooga. I think the way you should think about the outsource though is that if our total performance for the year was on a chart, let's say it's 100%, that somewhere around 40% of the year's performance problems occurred in 25% of the year in the fourth quarter."
}