{
    "symbol": "MWA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-05 14:38:09",
    "content": " Our third quarter consolidated net sales increased 7.3% to $333.2 million compared to the prior year, with growth in both water flow solutions and water management solutions. Gross margin decreased 440 basis points to 29.5% compared with the prior year as the benefits from higher pricing were more than offset by higher costs associated with unfavorable manufacturing performance, installation and warranty obligations. SG&A as a percent of net sales improved to 18.2% in the quarter, as compared to 18.9% in the prior year quarter, due to the leverage from higher sales. Adjusted EBITDA of $57.8 million decreased 7.7% in the quarter, leading to an adjusted EBITDA margin of 17.3% compared with 20.2% in the prior year. We increased adjusted net income per diluted share by 0.6% to $0.19 in the quarter, compared with $0.18 in the prior year. Net sales of $195.9 million increased 10.7% compared with the prior year, primarily due to higher pricing across most of the segments product line. Adjusted operating income of $38.1 million decreased by 5.2% as higher pricing was more than offset by higher costs associated with unfavorable manufacturing performance, inflation and SG&A expenses. Adjusted operating income of $16.5 decreased 22.5% in the quarter, as higher pricing was more than offset by higher costs associated with unfavorable manufacturing performance, inflation and SG&A expenses. Adjusted EBITDA of $23.7 million decreased 16.8% in the quarter, leading to an adjusted EBITDA margin of 17.3% compared with 21.3% last year. Average net working capital using the 5-point method, as a percent of net sales increased to 26.7%, compared with 25.9% in the third quarter of last year, primarily due to the increase in inventories and receivable. Your line is open. Your line is open. Your line is open. Your line is open. Thanks to everyone for joining today's call while we're pleased with our net sales growth and price realization at this point in the year, we are disappointed with the lack of progress this quarter in addressing internal and external challenges, most importantly, the machine downtime issue we've discussed."
}