{
    "symbol": "TU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 15:30:22",
    "content": " Importantly, LifeWorks International relationships will be complemented by TELUS International's proven expertise in digital, analytics and cloud transformation capabilities, and of course, their client service excellence, as well as their expansive client base and delivery teams now spanning 30 countries worldwide to allow us to extend our digital health offering to customers globally and to buttress the distribution strength on an international basis that we will secure through the LifeWorks acquisition. At TELUS Agriculture and Consumer Goods, our team drove revenue growth of 40% over the same period last year as a result of our team's ongoing efforts to integrate and grow this compelling business and the assets that we're assembling and integrating. In closing, our confidence in the strong outlook for our business and the long-term sustainability of our industry-leading dividend growth program is underpinned by our ongoing smart investment in technology infrastructure, including 5G and our accelerated broadband build program, our digital capabilities, our leading data analytics and our exploitation of the significant opportunities that we have in growth markets that enable the continued advancement of our robust operational and financial performance because we do those 2 things in concert at TELUS. Underlying our fixed data growth, our residential Internet revenue growth was an impressive 13% growth year-over-year as we continue to drive market share gains as well as higher ARPU as customers continue to move to higher speeds and recognize the compelling value of our superior PureFibre and bundled offerings. As we get closer to the end of your accelerated CapEx cycle and look forward to the improved cash production, can you discuss a little bit what your additional capital need might be for TELUS Ag and TELUS Health to get them to where you want them to be in order to become independent or do similar outcomes to TELUS International, i.e., trying to understand a little bit more what more -- what additional investments you need to make in those two assets that can take money away from maybe debt reduction or improved dividend growth? And as we move now into an era at TELUS in 2023 and beyond, where the sources of cash will chronically exceed the uses of cash, we will have plentiful resources to support the growth ambitions of our Health business and our Ag business, bringing them to scale as well as bringing them to some exciting multiple monetization events, and at the same time, achieve the goals that we've set out for ourselves with our balance sheet and, of course, underpinning the affordability of our dividend growth program. Melay, next question, please. Melay, next question, please."
}