{
    "symbol": "TU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 17:33:04",
    "content": " For the third quarter of 2022, TELUS International delivered an 11% year-over-year increase in revenue or 16% on a constant currency basis, a solid result given the prolonged geopolitical uncertainties and macroeconomic challenges we continue to operate within. In this regard, our team's ongoing diligence in harvesting efficiencies and productivity in our operations helped to deliver strong double-digit profitability growth in Q3 with adjusted EBITDA up 15% year-over-year, and an adjusted EBITDA margin up 25.7%. In the third quarter, we delivered revenue of $615 million, up 11% year-over-year on a reported basis and 16% on a constant currency basis, despite a challenging macroeconomic environment that has impacted the velocity of spend for some of our larger clients, who, as Jeff mentioned earlier, are approaching short-term spending decisions with more caution due to cooling demand in their own end customer markets. Salaries and benefits expense in the third quarter was $346 million, up 12% due to higher team member counts to support business growth and higher average employee salaries and wages, partially offset by the lower exchange rates across a variety of currencies relative to the U.S. dollar. Looking at overall profitability, our adjusted EBITDA was $158 million in the third quarter, a year-over-year increase of 15%, driven by higher revenue earned from existing and new customers, partially offset by the higher salaries and goods and services purchase that I just spoke about. And as long as we continue to remain in the double-digit top-line revenue growth zip code, which we are, 16% on a constant currency basis, and continue to deliver meaningful profitable growth, again, 16% EBITDA growth, I feel like we are appropriately managing those somewhat competing considerations on occasion as we weather through what I anticipate will be three, six, perhaps nine months of continued challenge. Again, not just looking at Q4 specifically, but looking at the full year, again, that puts us firmly in the 16% to 18% constant currency revenue growth, which, again, we think is a fairly impressive number given the times that we're in, especially when you think about the margin profile that goes along with it. We believe that the ongoing necessity for digital transformation continues to create significant long-term opportunities for TI, and we remain well positioned to capture our fair share, thanks to our 70,000 highly engaged team members and an AI community of more than 1 million talented members, our diverse set of end-to-end digital capabilities and new economy services, our globally scaled and agile delivery model, our relentless focus on efficiency and productivity within our operations and our caring culture that's brought to life through volunteer initiatives like our TELUS Days of Giving here in Central America to name but a few."
}