{
    "symbol": "HUBS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 21:24:08",
    "content": " HubSpot saw strong performance across the business with revenue growing 44% in constant currency year-over-year in the first quarter and total customers growing 26% year-over-year to more than 143,000 customers globally. Your line is open. Our product innovation is in high gear as you just heard me talk about the innovation that we – with the features we launched and relaunched this quarter, we're seeing customers consolidates on HubSpot because we are quick to implement, we're easy to use and we are easy to adopt and our value proposition is resonating within our customer base. Your line is open. Your line is open. And I wanted to get kind of what your response is at particularly in light of, if you look at what happened during COVID, it was a very short-lived challenge  and HubSpot in fact, accelerated meaningfully in the September and December quarters after the onslaught of COVID because many of the SMBs, in fact, weren’t prepared for the whole kind of work from home model and whatnot. Your line is open. Yamini, I was wondering if you could just talk about the upmarket opportunity for you all, if there’s anything you’re seeing, that’s different in say the U.S. versus Europe or international markets in terms of bundling, Europe would seem to be actually an area where there’s potentially more Greenfield where customers haven’t made as many decisions across as many hubs. And we are certainly see that within the market, but overall our approach to the value side of our sales play is build fantastic products, continue to solve for our customer’s biggest problem and enable our partner channel as well as direct channel to have great conversations that drive multi-hub growth. And when we know we have added value and when our customers have received a tremendous amount of value, then we look at pricing changes, and that’s exactly what we did with the service hub pricing increase that you just mentioned. Your line is open."
}