{
    "symbol": "CMMB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 14:40:21",
    "content": " With me today are Dale Pfost, our Chairman and CEO; Don Marvin, CFO, Chief Operating Officer and Executive Vice President; Dr. David Weiner, Interim CMO; and Dr. Adi Mor, our Co-Founder and Chief Scientific Officer. Today's call may contain forward-looking statements, which may be identified by words such as may, could, will, expect, intend, plan and other similar words and expressions. All forward-looking statements may today are based on management's current expectations, assumptions and beliefs about our business and the environment in which we operate. Exceptions required by Federal Security Laws Chemomab does not undertake to publicly update or revise any forward-looking statements subsequent to the date made as a result of new information, future events, changing circumstances or for any other reason. These include first advancing our clinical programs for CM-101, our first in class monoclonal antibody that neutralizes CCL-24, a novel disease targets at the confluence of fibrosis and inflammation. And fourth, adding a number of highly experienced staff essential for the progression of our scientific and clinical programs. On the clinical development front, we continue to make good progress in our CM-101 on one clinical programs, as Interim CMO, Dr. David Weiner will discuss in greater detail shortly. We finalized plan revisions and initiated global regulatory filings supporting expansion of our Primary Sclerosing Cholangitis or PSC Phase 2 trial, and we made significant progress on delineating the design of our upcoming Phase 2 trial in Systemic Sclerosis, or SSc. Turning to our Intellectual Property, I'm pleased to report that in June, the United States Patent and Trademark Office issued Chemomab, a new method of use patent. It covers the use of CM-101 and other anti CCL-24 antibodies in binding fragments for the treatment of a range of fibro inflammatory liver diseases, including PSC and other cholestatic related disorders. Liver diseases are an important target for CM-101, which is currently in a Phase 2 trial for treatment of PSC, a potentially lethal disease affecting the bile ducts of the liver. And as I noted, a Phase 2 liver fibrosis study in NASH patients that is nearing completion. In addition, there are a number of other liver diseases where CM-101 might have therapeutic value. This new patent adds to the protections provided by CM-101 core composition of matter patents that has already issued in the US, Europe and other global markets. We've also filed and intend to continue to file additional patents as warranted in an effort to assure the optimal protection for this key asset, which we believe may have wide applicability in a variety of fibro inflammatory diseases. Additionally, by sharing this research at major scientific meetings, our scientists are helping further educate the broader scientific and medical communities about the role of CCL-24, in fiber inflammatory disease, the therapeutic potential for CM-101 and interesting and robust science underlying our approach. First, in an oral presentation of the 2022 EASL International Liver Conference represented data from a preclinical PSC model that used advanced technologies to reveal unique liver macrophage subpopulations as the major source of CCL-24 production in the area of the bile duct that is damaged in PSC. Second, at the First International Extracellular Matrix or ECM Pharmacology Conference, Chemomab researchers presented a poster that included both preclinical and early clinical data demonstrating that CM-101 attenuates biomarkers associated with ECM expression. Importantly, this dataset supports our efforts to translate preclinical biomarker findings on ECM remodeling and deliver to the use of similar serum biomarkers in patients. Third, earlier in June, we presented data supporting the role of CCL-24, as a therapeutic target for systemic sclerosis and a poster at the 2020 to use our European Congress of Rheumatology. This study which was conducted by our collaborator Professor Francesco Delgado of Leeds University in the UK, examined the role of CCL-24, in longitudinal cohorts of diffuse cutaneous SSc patients. The study reported elevated serum levels of CCL-24 in these patients, and showed that high circulating CCL-24 levels were correlated with disease activity and worse prognosis, as reflected by high fibrotic activity and the deterioration of lung function over time. We're also welcoming Christina Crater, MD, as our new Vice President of Clinical Development, who will be joining us at the end of August. Dr. Backman is a terrific addition to Chemomab bringing more than 20 years of highly relevant experience in Immunology, Antibody Development, Translational Research and Biomarker Development, including more than a decade in Senior Science roles at Compugen. Let me now turn the call over to Dr. David Weiner, who has been leading our efforts to advance our clinical development program for CM-101. One, we will provide additional details on the status of our Phase 2 Safety Pharmacokinetics Biomarker study in Liver Fibrosis Patients. And three, we will update our progress towards finalizing the design of our Planned Phase 2 Biological Proof of Concept trial of CM-101 in Systemic Sclerosis. We continue to prudently manage our cash and currently expect our runway to last through the end of 2023 as we indicated in our last call, which is six months longer than our previous guidance last year."
}