{
    "symbol": "CMMB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 17:43:09",
    "content": " We are currently developing CM-101 for the rare disease indications of primary sclerosing cholangitis, or PSC, and systemic sclerosis, or SSC, as well as evaluating other potential clinical indications where its multiple mechanisms of action at the confluence of fibrosis and inflammation could be valuable. During the quarter, we presented data at two scientific meetings, at the International Rheumatology Conference in Israel, our CSO, Dr. Adi Mor presented preclinical data on CM-101 as a possible treatment for systemic sclerosis with the potential to impact inflammation, fibrosis, and endothelial damage. Let me start by taking a moment to recall the three key elements of our CM-101 clinical development program: One, expanding our effort in PSC with an enlarged clinical trial that adds an important dose-finding component; Two, establishing biological and clinical proof of concept for CM-101 in systemic sclerosis; And three, completing enrollment in our safety PK and biomarker liver fibrosis study in NASH patients with final readouts expected near the end of this year. We expect the revised trial design to enable an expedited path to proof of concept data in SSc, and importantly to provide additional information on CM-101's activity in modifying the skin, lung, and vascular pathophysiology seen in SSc patients. In summary, I'm pleased to report that we're making good progress towards obtaining data on dose-response relationship to inform the broader CM-101 development program, proof of concept data on clinically relevant aspects of systemic sclerosis, a complex disorder with inflammatory vascular and fibrotic components, relevant safety and tolerability data to support the evaluation of higher doses of CM-101, as well as to inform the next steps in the development of a subcutaneous formulation. And we believe based on the robust  clinical and initial clinical data that we already obtained over the years that the unique  (ph) CM-101, enabling it to interfere with fibrosis by inhibiting fibrosis activation with inflammation by inhibiting Type 2 immunity that is essential to support fibrosis, but also interfering with added pathologies that are very relevant for those diseases like cholangitis pelifiration for primary sclerosing cholangitis or the vascular angle in systemic sclerosis. So this is exactly why we're going to conduct these trials for systemic sclerosis, for example, the essence of this clinical trial will be to gain some initial proof of concept on the mechanism of CM-101 in systemic sclerosis to allow us to design than the registration -- the registrational study in a way that we will increase significantly the chances for success with regards to CM-101 and MLA specifically."
}