{
    "symbol": "EPR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 11:47:07",
    "content": " During the quarter, our investment spending was $24.4 million and including investments completed after quarter-end, our year-to-date spend through May 4 is $90.4 million. With our increased visibility and expanded investment pipeline, we're maintaining our 2022 investment spending guidance range of $500 million to $700 million, and we expect that our closing in fundings will ramp as we enter the second half of the year. Additionally, during the quarter, we collected $1.6 million in deferral repayments from cash basis customers that were recognized as revenue when received and which were not included in our guidance. I would like to note that percentage rents for the quarter exceeded our expectations by about $1.2 million, due primarily to some true-ups from the prior year related to two tenants. Property operating expense for the quarter decreased by $1.4 million compared to prior year, primarily due to fewer vacancies resulting from dispositions and re-leasing. G&A expense for the quarter increased by $1.9 million compared to prior year and was due primarily to an increase in payroll and benefit costs, including stock grant amortization as well as professional fees and travel expense. As I mentioned previously, during the first quarter, we recognized $3.4 million in percentage rents, which included certain amounts related to the prior year that were not anticipated. Also, consistent with the historical timing of percentage rents, we continue to expect such amounts to be weighted to the back half of the year, with approximately 50% anticipated in the fourth quarter and only about $1 million anticipated in the second quarter. We've also increased our expected G&A expense guidance by $1 million to a range of $50 million to $53 million, with about half of that increase due to higher-than-expected non-cash stock grant amortization. And then in the first quarter, it looked like if you look at the weekend sales, the ticket sales, rarely surpassed $100 million a weekend in pre-COVID, you're consistently exceeding that number and even touching $200 million plus."
}