{
    "symbol": "EPR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 12:38:07",
    "content": " Additionally during the quarter, we collected $4.7 million of deferred rent and $0.3 million of deferred interest from cash basis customers that were recognized as revenue when received and which were not included in our guidance. Moving on, we had higher other income and other expense of $8.9 million and $5.8 million, respectively, mostly due to the performance of the Kartrite Resort and Indoor Waterpark which was closed for a portion of the second quarter in 2021 due to COVID-19 restrictions, as well as from 2 theater properties that we operate. The $519,000 of percentage rents recognized for the quarter was less than the $1 million we had anticipated primarily due to an increase in a tenant's revenue threshold upon which percentage rent is calculated. Finally, equity and income from joint ventures totaled $1.4 million versus -- for the quarter compared to a loss of $1.2 million in the prior year. In addition, due to the recent renovations completed and the performance at the St. Pete Beach properties, during the quarter, we were able to refinance the nonrecourse secured debt at these joint ventures based on a significantly higher valuation, increasing the debt amount from $86 million to $105 million and lowering the interest rate. The increase in the midpoint of our FFO as adjusted per share guidance of $0.08 from $4.47 to $4.55 is due to $0.07 of deferral collections from cash basis customers during the second quarter and $0.05 of other favorable items, including improved performance expectations at our managed properties. Such amounts we booked as additional revenue, to the extent received over the last 6 months of 2022 and could represent as much as approximately $6 million or about $0.08 per share of earnings for each of the third and fourth quarters. We continue to be in the enviable position in this turbulent market with low leverage over $168 million of cash on hand at quarter end, nothing drawn on our $1 billion line of credit, no scheduled debt maturities in 2024 and expected operating cash flow after dividend payments of over $150 million for 2022. And so accordingly, with that movement, I think what's really interesting, and I'll ask Greg to comment is probably in the last quarter, we've seen the idea of a lot of tenants and operators who've kind of capitulated that, yes, costs are really staying higher. We will see -- again, part of it's going to be about looking at that as -- as Mark said, we're achieving kind of mid-level 15%, 16% returns going to a net lease, where will that land out and where do we think relative value is going to be on choosing structure over yield. So I don't -- long and short, I don't expect a tremendous impact on percentage rents going forward from the levels this year, which is at midpoint $8 million as a result of CPI further going up."
}