{
    "symbol": "EPR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 13:00:39",
    "content": " During the quarter our investment spending was $82 million, 100% of the spending was an experiential portfolio, and included the acquisition of a project for redevelopment and additional financing for an existing asset. As discussed on last quarter's call in Q3, we also closed on an additional approximately $26 million in financing for our premiere four-season Alyeska Resort in Girdwood, Alaska. Additionally, during the quarter, we collected $4.6 million of deferred rent and $0.8 million of deferred interest from cash basis customers that were recognized as revenue and receive and which were not included in our guidance. This was partially offset by higher percentage rents recognized from our Golf Entertainment tenant  G&A expense increased by $1.4 million versus prior year, primarily due to an increase in payroll and benefit costs, including stock amortization, as well as an increase in travel expenses and professional fees. As shown on the slide, revised guidance at the midpoint includes full rental payments for Regal leases of approximately $7.1 million per month for October, November and December. Accordingly for Q4 we ever included deferral payments of $1.5 million per month, received from Regal for October-November, and $0.5 million per month received from non-Regal tenants for October and November. As you can see on the slide the increase is due to including $0.12 of additional deferral collections for Q3 and Q4 from cash basis customers, all of which has been received today is not in prior guidance, plus $0.01 from an increase in expected percentage rents primarily from certain attraction properties, offset by nine cents for Regal September rent. Yeah, it's about $7.1 million in terms of regular rent, and the deferral payment previously was about $1.5 million per month. I believe there were a lot of investors when we spoke to them that they thought coverages were like below one at these levels, and we're showing that it's not, we don't have to necessarily get back to $11 billion to have a healthy portfolio because of the strength of our portfolio. So the upside to our guidance now, since we are kind of dealing with post quarter and deferral payments really becomes the Regal deferral for one month, which is $1.5 million for December and a $0.5 million for the non-Regal customers for the month of December."
}