{
    "symbol": "YSG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-25 12:00:24",
    "content": " Our non-GAAP net loss margin reached 20.8% in the second quarter, an increase of 9 percentage points compared with the prior year period, attributable to the higher operating cost ratios of our offline stores due to weak offline store sales as well as inventory loss and provisions for store closures. Net revenues from our skincare brands grew by 49.2% year-over-year, representing 33.4% of total net revenues for the second quarter compared with 14% for the prior year period. By far, the largest piece of our operating expenses was our selling and marketing expenses, totaling RMB602.5 million for the second quarter on a non-GAAP basis, which decreased by 35.7% year-over-year, the same rate as our revenue reduction. However, as a percentage of total net revenue, our non-GAAP selling and marketing expenses remain elevated at 53.3% for the second quarter compared with 51.4% for the prior year period, attributable to higher operating cost ratios of our offline stores, certain store closure-related expenses and the provision of RMB28.7 million for further store closures in the second half of 2022. Overall, our non-GAAP net loss margin of 21.8% reflects exceptionally challenging external environment in the second quarter as well as the numerous initiatives we took to adjust our business, with inventory loss and the store closure provisions totaling 7.6% of total net revenues. As a percentage of total net revenues, total operating expenses for the second quarter of 2022 were 92% as compared with 92.6% in the prior year period. As a percentage of total net revenue, fulfillment expenses for the second quarter of 2022 decreased to 7.3% from 7.7% in the prior year period. As a percentage of total net revenues, selling and marketing expenses for the second quarter of 2022 increased to 65.7% from 63.8% in the prior year period. As a percentage of total net revenue, general and administrative expenses for the second quarter of 2022 decreased to 15.5% from 18.8% in the prior year period. As a percentage of total net revenues, research and development expenses for the second quarter of 2022 increased to 3.4% from 2.3% in the prior year period. For the third quarter of 2022, the company expects its total net revenues to be deploying RMB738.4 million and RMB872.7 million, representing a year-over-year decline of approximately 35% to 45%, primarily due to the continued softness in market demand for our color cosmetics."
}