{
    "symbol": "YSG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-22 11:12:06",
    "content": " Our total net revenues for the third quarter of 2022 declined by 36.1% year-over-year to RMB857.9 million, meeting the high end of our revenue guidance. Net revenues from Skincare Brands increased by 33% year-over-year to RMB 269.4 million, as a highlight, total net revenues of our fast-growing clinic and the premium brands, DR.WU, Eve Lom, and GalÃ\u0083nic delivered solid growth of   year-over-year this quarter. In terms of revenue contribution, our Skincare Brands contributed 31.4% of total net revenues for the third quarter of 2022, which has exceeded 30% of total net revenues for two consecutive quarters, compared with   of total net revenues for the third quarter of 2021. Our Color Cosmetics Brands, on the other hand, saw a 48.8% decline year-over-year in total net revenues to  , reflecting the continued softness in market demand for our color cosmetics as well as intensified industry competition from both domestic and the international brands. Gross margin for the third quarter of 2022 increased by one percentage point to 58.9% from 57.9% for the third quarter of 2021, due to increased sales of higher growth margin products from our Skincare Brands, cost optimization, and stricter pricing and discount policies across all of our brand portfolios. Our net loss margin was 24.6% in the third quarter of 2022, representing an improvement of 3.2 percentage points from the second quarter of 2022, or 2.4 percentage points from the prior year period. Our non-GAAP net loss margin was 14.7% in the third quarter of 2022, representing an improvement of 7.1 percentage points from the second quarter of 2022 or 1.4 percentage points from the prior-year period. As a percentage of total net revenue, total operating expenses for the third quarter of 2022 were 99.9% as compared with 95.4% in the prior year period. As a percentage of total net revenues, fulfillment expenses for the third quarter of 2022 decreased to 7.4% from 7.5% in the prior year period. As a percentage of total net revenues, selling and marketing expenses for the third quarter of 2022 decreased to 65.8% from 67.9% in the prior year period. As a percentage of total net revenue, general and administrative expenses for the third quarter of 2022 increased to 22.7% from 17.4% in the prior year period. As a percentage of total net revenue, research and development expenses for the third quarter of 2022 increased to 3.9% from 2.7% in the prior year period. Looking at our business outlook for the fourth quarter of 2022, we expect our total net revenues to be between RMB916.7 million and RMB1.07 billion representing a year-over-year decline of approximately 30% to 40%."
}