{
    "symbol": "YSG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-24 13:29:10",
    "content": " Against this market backdrop, our potential net revenues in the first quarter declined by 38.3% year-over-year to RMB 891 million, in line with our previous guidance. The energy and excitement of these campaigns are matched by robust financial results for our skincare brands, with net revenues growing by 68.5% year-over-year to RMB 183 million in the first quarter, representing 20.5% of total net revenues, up from 7.5% in the prior year period. Accumulated effect of our various cost optimization initiatives is we achieved of non-GAAP net loss of RMB 156 million in the first quarter, a 38.3% reduction compared to the net loss of RMB 234.3 million in the prior year period. We recorded RMB 36 million in R&D expenses in the first quarter, representing 4% of total net revenues. Building on the previous quarter’s momentum, total net revenue from our Douyin channel grew by over 150% year-over-year in the first quarter of 2022, making it our third largest channel by revenues, behind Tmall and our offline source. As a percentage of total net revenues, total operating expenses for the first quarter of 2022 were 103.5%, as compared with 92.4% in the prior year period. Fulfillment expenses for the first quarter of 2022 were RMB 73.9 million, as compared with RMB 92.7 million in the prior year period. As a percentage of total net revenues, fulfillment expenses for the first quarter of 2022 increased to 8.3% from 6.4% in the prior year period. Selling and marketing expenses for the first quarter of 2022 were RMB 604.7 million, as compared with RMB 1.04 billion in the prior year period. As a percentage of total net revenues, selling and marketing expenses for the first quarter of 2022 decreased to 67.9% from 72.1% in the prior year period. General and administrative expenses for the first quarter of 2022 were RMB 208.1 million, as compared with RMB 172.3 million in the prior year period. As a percentage of total net revenues, general and administrative expenses for the first quarter of 2022 increased to 23.4% from 11.9% in the prior year period. Research and development expenses for the first quarter of 2022 were RMB 35.8 million, as compared with RMB 27.7 million in the prior year period. As a percentage of total net revenues, research and development expenses for the first quarter of 2022 increased to 4% from 1.9% in the prior year period. Net loss attributable to Yatsen’s ordinary shareholders per diluted ADS for the first quarter of 2022 was RMB 0.46, as compared with RMB 0.5 in the prior year period. Non-GAAP net loss attributable to Yatsen’s ordinary shareholders per diluted ADS for the first quarter of 2022 was RMB 0.25, as compared with RMB 0.37 in the prior year period. For the first quarter ended March 31, 2022, net cash used in operating activities was RMB 104.1 million, as compared with RMB 466.1 million in the prior year period. For the second quarter of 2022, the company expects its total net revenues to be between RMB 808.3 million and RMB 960.8 million, representing a year-over-year decline of approximately 37% to 47% primarily due to continued industry-wide softening of color cosmetics demand and the continued negative impact from COVID-19 on offline experience stores, online order fulfillment capabilities and supply chain."
}