{
    "symbol": "GASS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 20:23:03",
    "content": " Since the last announcement and up until now, we enter into agreements to sell three of our oldest vessels, 23 year old or more, the Gas Prodigy, the Gas Spirit and the Gas Galaxy, two already delivered last month and the third one is pending, earning us a total proceeds of about $12.5 million. Voyage revenues came in at a very strong $42.7 million compared to $36.1 million last year, an 18.3% increase in spite of the smaller fleet. Overall, for the full year, our revenues came in at $152.8 million, the highest revenue figure since 2018 compared to $150.2 million for the same period last year, a 1.7% increase year-on-year. We remain steadfast in managing prudently our liquidity, and so our total cash, including restricted cash and short-term investments, more than doubled to $95.7 million compared to $45.7 million at the end of last year. Net revenues came in at $36.2 million for the quarter and $130.5 million for the 12 months, a slight increase by 2% over the 12-month period despite the vessel sales and roughly an 18% reduction in the total fleet days. Depreciation is another item that saw a large decrease to $6.8 million for the quarter and $27.8 million for the 12-month period, a 25% decrease year-on-year, and that was also due to the decrease in the number of vessels. Even on a net income adjusted basis, that if we were to exclude the $40 million write-off from the tankers in 2021, StealthGas reported for the full year 2022, $36.8 million more than 2.6 times the previous years. Looking at our balance sheet in Slide 8, our liquidity, including restricted cash and short-term investments, that is basically time deposits was at the end of the year in the order of $95.7 million, doubling from the $45.7 million in Q4 2021. Our total cash doubled from $45.7 million at prior year end to $95.7 million at the end of '22, while our total assets were $821.5 million at the end of last year with only $303 million in total liabilities."
}