{
    "symbol": "FTCH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 21:45:03",
    "content": " First, to redesign our entire organization to support our mission of building the global platform for luxury and enable the incredible growth we have ahead of us, given our plan to hit $10 billion in GMV with a 10% to 13% adjusted EBITDA margin by 2025. These investments together represent over 100% of the expected SG&A growth in 2023, which will be partially offset by a minus 10% overall reduction in costs for the marketplace core business and supporting platforms. To begin, while 2022 was a challenging year, we were still able to grow active customers by 6%, whilst also driving a 7% reduction in demand generation spend, thanks to our ongoing focus on brand building and efficiency in acquiring customers through diversified channels, specifically the Farfetch app, which is our most profitable and fastest-growing channel and provides a direct means to reach consumers, which bodes well for long-term value, one of our key metrics for measuring customer value. And we're pleased to see the year is already off to a promising start with the collection of high jewelry pieces totaling over $600,000 purchased by a client in the U.S. We continue to maintain strong brand relationships as evidenced in part by the fact that overall stock value on the Farfetch Marketplace grew nearly 50% year-on-year to a record $5.9 billion, thanks in part to strategic initiatives with our largest partners to deepen our integrations to further expand our inventory and drive speed to market. Let's look at the full year 2022 results, which, despite the significant macro challenges we faced, we maintained group GMV of $4 billion, a slight 4% decrease year-on-year on a reported basis, but up 2% year-on-year on a constant currency basis. You can see on Slide 14 that the performance of the digital platform in the fourth quarter was driven by strong underlying growth within the marketplace characterized by positive year-on-year order growth, excluding Russia and China of 12%. First, continued strong third-party gross margin of 67.4%, up 5 basis points year-on-year, a significant improvement in demand generation expenditure down 25% year-on-year in absolute terms and down 500 basis points year-on-year to 16% of digital platform services revenue. Moving to the Brand Platform, where we saw softer performance year-on-year, down 3% on a constant currency basis, with reported GMV of $100 million, which is down 15% year-on-year and brand platform revenue of $98 million, down 16% year-on-year. The actions we have taken to reduce SG&A spend across 2022 and into 2023, means we will cut our operating cost base on an underlying basis by 10% year-on-year in 2023 versus the 2022 total delivering $85 million in savings and achieving a return to operating cost leverage across 2023 as a whole. And Farfetch is the leading global platform for luxury, a unique positioning, which I believe will see this business grow to $10 billion in GMV and 10% to 13% adjusted EBITDA profitability in the next 3 years."
}