{
    "symbol": "SYM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-01 20:42:04",
    "content": " As part of this journey, we are prepared to continue to innovate rapidly and scale our business against our over $11 billion revenue backlog and we're excited to work with our amazing customers and you, our public shareholders as we move forward, building this great company. Your line is open. Your line is open. Your line is open. So, we've got things like a full supplier Summit Day taking place in a couple of weeks down at one of our sites and it's a multi-day collaboration to orchestrate how we're going to continue to work together, how we're going to innovate, how we're going to compress the schedule, how we're going to introduce interesting installation and constructive techniques so that we really can get to a position where our system is very modular and becomes a plug and play at the site. Backlog is one of those really backlog was that more than doubling in the backlog to $11.3 from $5.2 billion, followed the great progress we've had in deployments, whereas Mike mentioned in his prepared remarks at the end of the third quarter, we now have 13 system in various stages of deployment, from early build to late and validation testing. Your line is open. Your line is open. Your line is open. One thing to keep in mind, as well as, as you think about modeling this forward, our expectation is we're going to be rapidly growing those number of systems and, looking at the team here around the room on this call, led by Rick and Michael, our goal is to grow that 13 as fast as we can to 26 and then double it yet again. That means that you're unlikely to see the recurring components becoming a strong percentage of revenue over the future timeframe, as long as you're growing fast, but that being said highly profitable stream and when you really break down the economics of our business, the actual gross profit contribution from these recurring businesses are in a similar order of magnitude today to our overall -- to our overall system revenue. Your line is open. Rob, I think we've got, a lot of investments not just in the key programs of Simat and breakpack, but, when you look at, really drives our entire system it is a software enabled system and whether we're looking at, things like the high speed robotics or intelligent vision and scanning systems, or just this fleet of autonomous vehicles that our software driven, AI really is a potential massive unlock for future potential. I think we're on a run rate of, north of a $100 million annually for R&D and that's really, what Rick founded this company on is just wild innovation and we're going to pivot towards speed and scale of the company. Your line is open. Michael, maybe you want to speak a little bit more, we're focused on our system being a Lego block, like installation, the same system that we deploy to customer A goes to customer B. I'll just add in Tom's comment, the model is about, doing many things simultaneously here, and in order to do that, we've got to have good process control. Your line is open."
}