{
    "symbol": "UNM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 12:21:04",
    "content": " Yesterday afternoon, Unum reported fourth quarter 2022 net income of $279.6 million or $1.39 per diluted common share, an increase from $159 million â\u0080\u0093 $159.7 million or $0.78 per diluted common share in the fourth quarter of 2021. Excluding these items, after-tax adjusted operating income in the fourth quarter of 2022 was $286.7 million or $1.43 per diluted common share, an increase from $182 million or $0.89 per diluted common share in the year ago quarter. And good morning, everyone. And good morning, everyone. Results for Unum US Group Life and AD&D declined modestly from last quarter, with adjusted operating income of $29.3 million for the fourth quarter of 2022 compared to $30.9 million in the third quarter. Adjusted operating earnings for the Unum U.S. supplemental and voluntary line in the fourth quarter were $84.8 million, a significant decrease from the result of $114.3 million in the third quarter. Growth in premium income in the fourth quarter was 4% on a year-over-year basis, adjusted for the change in estimate within the individual disability unearned premium reserve with particularly strong performance in the group disability business. In the Closed Block segment adjusted operating income excluding the amortization of cost of reinsurance related to the Closed Block individual disability reinsurance transaction was $40.4 million compared to $34.1 million in the third quarter, driven by favorable benefits experience in individual disability within our all other product line. So wrapping up my commentary on the quarter's financial results, the adjusted operating loss in the corporate segment was $37.5 million compared to $49.5 million in the third quarter, primarily driven by higher investment income on shorter duration corporate owned assets and lower interest and debt expense. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Yes, Tom, it's Steve. Yes, Tom, it's Steve. Your line is now open. Please go ahead, your line is now open. And so like Steve said, as these take hold and more and more of our transactional volumes are coming digitally and through self-serve, we would expect that OE ratio to start coming down in the second half of next year, and that's both because our expenses will be growing at a slower rate, and we see that acceleration back into that 4% to 7% long-term growth rate that we have for the top line. I would say if you take out the two onetime items that we had in the quarter that are nonrecurring, I think, it's around $105 million would have been the earnings. Please go ahead, your line is now open. Please go ahead, your line is now open. Please go ahead, your line is now open."
}