{
    "symbol": "GOCO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 22:17:21",
    "content": " You should not place undue reliance on any forward-looking statements, and the company undertakes no obligation to update or revise any of these statements whether due to new information, future events or otherwise. After the market closed today, we issued a press release containing our results for the second quarter of 2022. In the press release, we have listed a number of risk factors that you should consider in conjunction with our forward-looking statements. During this call, we will be discussing certain non-GAAP financial measures. Let me start by saying how proud I am of the team for supporting over 170,000 Medicare beneficiaries this quarter as they navigated a complex and often frustrating process of health plan enrollment. GoHealthâ\u0080\u0099s new CFO, Jason Schulz, will review our earnings results in greater detail. After joining, I have been pleasantly surprised by the work we are doing with carriers post-enrollment to drive customer experience through the Encompass platform. GoHealth plays an essential role in Medicare by establishing an independent marketplace, recruiting beneficiaries and matching them with the best plan to meet their needs. While considering the role, I felt there was a significant opportunity for this company to extend its differential position. I believe the platform here is second to none, and I see serious potential to drive growth and efficiency. Our priority is to ensure that beneficiaries are receiving the benefits they expected and are satisfied with their choices, leading to greater retention over time. In my time with health plans, providers and technology solutions, Iâ\u0080\u0099ve sought to develop the ability to support beneficiaries, as they make a very difficult and stressful decision around their health care. I focused my career on supporting beneficiaries to the complex Medicare decision process and doing it at scale, with the goal to drive greater freedom of choice and improve the overall experience. However, we have reached a natural inflection point as competitive dynamics amongst our carrier partners changed and the needs of our beneficiaries evolve. In my new role, Iâ\u0080\u0099m reflecting on what has worked well and what happened in order to best position us for the future as we shift from being enrollment focused to being more engagement oriented. Just to GoHealth has consistently proven to be the enrollment leader in the industry, Iâ\u0080\u0099m confident we will be able to utilize our unique platform inclusive of talent, technology and data to deliver incremental value to all the beneficiaries and carriers, the extended capabilities and efficiencies to win the engagement race. As we journey down this path, itâ\u0080\u0099s imperative that we are laser-focused on driving cash flow and maintaining high quality. Since I started, we have spent a significant amount of time identifying the key drivers that continue to challenge the performance of the company. To that end, we recently announced the restructuring of our organization to deliver the greatest efficiency with a lens towards value as opposed to revenue maximization. On the quality front, we have refined the size of our salesforce, reducing our headcount by just under 800 agents. In doing so, we gained higher performance metrics around conversion and effectuation that allow us to deploy our cash at a much more efficient level, thus minimizing our dependency on external lead sources. With this focus on quality, weâ\u0080\u0099re able to deploy our teams on programs that deliver a higher confidence year 1 cash profile for the business. The Encompass platform provides better predictability, transparency, and unit economics, while also driving more cash into the business. The commitment from all of our current and past team members has been so critical to get us to this point, where we can leverage our strong foundation to reposition this company for success within the new standards desired in this market. These monumental shifts in size and focus do come with some level of risk, but given our depth of experience and historical data, weâ\u0080\u0099re cautiously optimistic we will enter into 2023 with a leaner, more efficient operating model that can not only be scaled, but can also support innovation and growth. With this restructuring and refocus in mind, we feel itâ\u0080\u0099s most prudent at this time to suspend a quantitative guidance for the remainder of 2022 and instead provide you with some qualitative comments. As we sit here today, we believe that restructuring measures will impact our second half 2022 results in a few ways: first, our revenue will be slightly lower; second, our adjusted EBITDA, while still meaningful and positive will be significantly lower; third, our ability to achieve cash flow breakeven on a run rate basis will be strengthened materially. We expect to provide more color on full year 2022, when we announced our third quarter earnings later this fall. Iâ\u0080\u0099m excited for the changes to come for GoHealth as we reposition our unique services around differentiated digital tools and technology for not only volume leadership, but winning in customer engagement and experience. Thanks, Vijay, and thank you to everyone for joining our call today. Before I get into the financial results, I want to share some perspectives as to why I joined GoHealth in some early reflections. As we have deepened our understanding of the business, we determined it is important to take steps to improve how we communicate financial results. Our intention is to provide greater clarity around unit economics of the business, margin profiles of our products, key operational drivers and the associated cash flow impacts. For these reasons, and the other factors Vijay just covered, we are suspending guidance for 2022. Most importantly, we continue to be focused on transforming the business and materially improving cash flow from operations. As such, I am pleased to share our cash flow from operations is $6 million for the first half of 2022, an improvement of $38 million compared to the same period last year. With the transformative actions we are taking and the aggressive cost management discipline, we anticipate achieving the goal of breakeven cash flow from operations by mid-2023. Moving on to our financial results for the quarter, we recorded $159 million of revenue and posted a $32 million adjusted EBITDA loss for the quarter, a decline of $38 million and $45 million, respectively. Consistent with Q1 of this year, we kept the same blended 7% constraint reserve methodology for new policies sold in the current quarter. To partially explain the year-over-year change, it is important to normalize the impact of the $155 million LTV look-back adjustment we took in Q4 2021 that relates to the policies sold in Q2 of last year. Starting with our External Medicare segment, we posted revenue of $50 million, which is an $18 million improvement from Q2 2021, while profits declined to a loss of $6 million. The improvement in revenue was largely driven by 114% growth in carrier approved submissions, which was a result of increasing the number of downline agency partnerships as compared to the same period last year. Moving to our Internal Medicare segment, we recorded $104 million of revenue and a loss of $11 million. This is a $57 million and a $42 million decline versus Q2 2021, respectively. Beyond the LTV adjustments we already discussed, there were some timing impacts of certain partner marketing and enrollment revenues that were higher in Q2 of last year compared to this quarter. However, the most significant driver of our decline in revenue and profitability was a 24% decline in carrier approved submissions. Much of the slowdown in our Internal Medicare segment was intentional, as we spent $15 million less in marketing, while conserving cash has also resulted in fewer opportunities for our agents and an overall decrease of our policies sold. As such, we want to focus on the economic levers we have the most influence over, namely our customer acquisition costs and aligning to our highest margin and cash flow generating activities. We believe the actions taken last week drive stability for the company, while ensuring we are deploying our cash thoughtfully and strategically. Second, related to our current stock price and Nasdaqâ\u0080\u0099s minimum stock price listing requirements, if necessary, we anticipate holding a special shareholders meeting later in the fall to request shareholders to authorize a reverse stock split by our board. Before I hand it back to the operator to queue up your questions, I want to reiterate how pleased I am to have join GoHealth. Weâ\u0080\u0099re in the early stages here, but we have a good handle of the business, and we know what we need to do next. Your line is open. I guess, my first question, I just would like to hear, I know youâ\u0080\u0099ve obviously had a lot on your plate for the last sort of 6 weeks or so. Just sort of where we are in terms of AEP prep, I noticed you obviously said that you are expecting to go in with a more tenured salesforce. I appreciate you joining the call today, and thanks for the question. Just to be â\u0080\u0093 to reiterate the question more around where are we with AEP prep and anything that weâ\u0080\u0099re doing operation and otherwise to prepare for it; and in short, yes, thereâ\u0080\u0099s a lot going on. As you know, this is a very busy time of year, weâ\u0080\u0099ve just been out trying to learn about our major carriersâ\u0080\u0099 plans regarding benefits, and how theyâ\u0080\u0099re seeing their positioning within the marketplace. Weâ\u0080\u0099re then also factoring in those dynamics into how weâ\u0080\u0099re training our agents, even though we have refined our count of agents, we have been working extensively since that last AEP to enhance their quality, their conversion rates effectuation all across the board. And most importantly, as weâ\u0080\u0099ve alluded to in our prepared comments, is our progress on the Encompass platform. And right now weâ\u0080\u0099re in the final stages of testing those tools to make sure that we have all of our key agents prepared and ready to deploy against those so that we can have more of that active and ready to go during the AEP, both the Connect modules as well as the Engage modules at that time. But, I think, thatâ\u0080\u0099s â\u0080\u0093 those are the major parts for us at this point. Marketing is going to be unique in the way weâ\u0080\u0099ve refined our approach to what we want to do in the AEP period, as Jason alluded to making sure that weâ\u0080\u0099re focusing on those highest quality marketing avenues. And as such working with those partners to ensure that weâ\u0080\u0099re doing all of the quality verification on the front end as possible, so that we have the highest return on those investments. Yeah, itâ\u0080\u0099s obviously a good question probably on the minds of a lot of those listening right now. As we look at it, itâ\u0080\u0099s no surprise to anybody that the AEP period is one of the most dynamic periods and most important to look at the full year performance of anybody in our space. There are a lot of factors in play this year, and weâ\u0080\u0099ve got the changes in the way the carriers are looking at their benefit structures, some of which we have, some of which we donâ\u0080\u0099t understand yet, most of that wonâ\u0080\u0099t be fulsomely known until October of this year. Second, weâ\u0080\u0099ve got competitive dynamics that have changed amongst our peers as to their staffing, their marketing tactics, the downlines, how theyâ\u0080\u0099re all behaving is different. Marketing regulations changed this year, versus where we were in the past, and so weâ\u0080\u0099re all reacting to those. And then we also have the counter pieces of the inflationary environment, and how that may be changing the â\u0080\u0093 those who are going to be shoppers this year, and those who wonâ\u0080\u0099t be shoppers this year, versus prior periods. So all of that then compounded with the restructuring activities we did this past week, all led us to come to the conclusion that it made sense for a suspend guidance at this point. And obviously, as we indicated in our pre-recorded â\u0080\u0093 our prepared comments that we will consider the color of those and give you more thoughts around it as we get into the fall. Your line is open. Maybe if I can dive a little bit into the restructuring program, obviously, itâ\u0080\u0099s a big chunk of your workforce, not something that any company ever wants to do. As we think about the AEP period, and obviously going through the restructuring process, really staring at what mattered most as we go into this evolutionary period and transformational period for us as an organization. We focused on the agents who had been able to become those top-tier upper echelon quality performers, and really refine our workforce to reflect that those who were there and those who had the potential to get there, augmenting them with training and additional tools to do so. As we think about going into the AEP period, as I said before, we have some of the highest tenured and highest quality agents weâ\u0080\u0099ve ever had going into AEP. And what that allows us to do even with a smaller volume, it allows us to be more selective in the marketing sources and tactics we utilize, so that we can have the highest quality choices along those lines. And maybe just thinking ahead as well to AEP, obviously, last year, a number of the carrier that you work with, I know, Iâ\u0080\u0099ve made public comments about their desire to push and pull in terms of their own internal agent for salesforce versus external. No, itâ\u0080\u0099s a great question. And as we look at all the discussion, I would say that Iâ\u0080\u0099ve been very pleased to have interacted with all of our major carrier partners. Weâ\u0080\u0099ve had extensive conversations, what matters most to them, what problems theyâ\u0080\u0099re trying to solve, and how we can partner with them to do just that. It is actually the germination of how weâ\u0080\u0099ve gotten to getting the completed contracts in our Connect and our Engage platforms, their modules under the Encompass overall portfolio of products. These new products weâ\u0080\u0099re describing, weâ\u0080\u0099re doing them alongside of our carriers. Your line is open. First, Tobey, thanks for joining and appreciate the question. As hasnâ\u0080\u0099t been prior precedent, we havenâ\u0080\u0099t really put out numbers as to the number of agents that weâ\u0080\u0099ve got, and those that we have between so many different functions between our Internal Medicare, our downline partners in the in the External Medicare channel, not to mention all of the enterprise solutions and other areas within the organization, so not in a position to provide you those metrics at this time. But, again, as we did allude to just over 800 â\u0080\u0093 or just under 800 agents were impacted by the restructuring. I guess â\u0080\u0093 I know youâ\u0080\u0099ve pulled guidance, but as part of this sort of adjustment to the workforce and agent force, youâ\u0080\u0099ve got to have some sort of plan to keep them busy enough and fueled with enough marketing to yield the kind of living thatâ\u0080\u0099ll give you associated turnover and employee attrition that the business can live with. No, itâ\u0080\u0099s a great question. So as we went through that analysis, and looked at who was at what thresholds, we have definitely balanced then that weâ\u0080\u0099ve looked at our staffing levels, and also the compensation models and the ways we put incentive structures in place for our agents, and we feel good that we can satisfy and keep them engaged and motivated to drive high quality with a balance on volume and productivity. As I look at it right now, I think weâ\u0080\u0099re definitely believe, we can position ourselves to drive more value. And it times we need to refocus on the quality, and thatâ\u0080\u0099s exactly what weâ\u0080\u0099re doing. So when we think about the value going forward, itâ\u0080\u0099s really driving some of these new product segments that weâ\u0080\u0099ve described, and finding better ways to be partnering with our carriers to deliver those services. And we think that you can deliver cash through that, as well as drive growth year-over-year. And as we test some of these going to this upcoming AEP, weâ\u0080\u0099ll be able to provide you more color as we get further into the year. Keep in mind, I think the way weâ\u0080\u0099ve set up the target was on a trailing 12-month basis. And so the way to think about it, itâ\u0080\u0099s on a run rate basis of the way the business should operate going forward. Your line is open. As you guys kind of stepped into the roles, you obviously did the restructuring work. So, I think, weâ\u0080\u0099ve done a good review of the organization, focusing on the areas that seem to drive more on the quality side of the business, and ensuring that weâ\u0080\u0099re getting the best return on those maximizing our opportunity for cash, et cetera. So Iâ\u0080\u0099d say at this time, thereâ\u0080\u0099s no material areas of gap that we need to look at that are known areas to focus on the cost side of things, but that are glaring by any means. The staffing levels that we have right now, we feel fairly comfortable are a good baseline for us to operate off of for the long run. We have opportunities to grow, and we have a definite pipeline within the different products that we offer to be able to continue to nurture and develop the talent. If you look at the tenure of the agents that were coming into this AEP versus previous tenure, itâ\u0080\u0099s nearly 3 times the amount of tenure that weâ\u0080\u0099ve had in previous years. So at this point, we think this is the right staffing level to jump off of. To your specific question of the distribution between enterprise and also looking at the traditional model, at this point, I donâ\u0080\u0099t have anything directional to provide you, other than you should expect to see some more diversification as we go forward, both on the type of products and the payment profiles of those businesses. Just wanted to close, thank you all again for your time today and interest in our organization. Obviously, a lot of work to come and weâ\u0080\u0099re looking forward to providing you updates on our progress over the coming quarters, and we hope to talk to you all soon."
}