{
    "symbol": "SRDX",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-06 21:41:02",
    "content": " In the first quarter of fiscal 2023, we achieved total revenue of $24.9 million, representing 8% growth on a year-over-year basis. As a result, we have recently implemented a spending reduction plan, designed to reduce our planned use of cash by approximately $10 million to $11 million for the remainder of fiscal 2023, prior to the restructuring charges. The year-over-year increase in product revenue was primarily driven by medical device product revenue, which increased $1.6 million or 23% year-over-year due to strong sales of our performance coating reagent and medical devices, including contributions from sales of our Pounce arterial thrombectomy and Sublime radial platforms. We also saw contributions from growth in IVD product revenue, which increased $300,000 or 5% year-over-year, driven by growth across several IVD product lines, which more than offset some unfavorable order timing for distributed antigen products, which fluctuates quarter-to-quarter. Royalty revenue from our performance coatings increased $520,000 or 8% year-over-year compared to the first quarter of fiscal 2022, royalty revenue was less impacted by pressures and procedures volumes related to hospital capacity constraints and customer supply chain disruptions. R&D expense includes costs of clinical and regulatory activities, increased $1.1 million or 9% year-over-year to $12.7 million in the first quarter. SG&A expense increased $4 million or 44% year-over-year to $13.2 million in the first quarter of fiscal 2023, primary driven by a year-over-year in headcount related to the expansion of our direct sales force in fiscal 2022 and related investments to support the commercialization of our Pounce and Sublime products. Adjusted EBITDA loss in the first quarter of fiscal 2023 was $3.3 million compared to adjusted EBITDA of $650,000 in the prior year period. We now expect fiscal 2023 total revenue to range from $102 million to $106 million, representing an increase of 2% to 6% compared to the prior year. We expect our cash use for the full year fiscal 2023 to be approximately $26 million, which consists of the total change in cash, excluding the net proceeds from long-term debt in the first quarter of $19.3 million. This reflects the following items and assumptions, our updated revenue guidance and active management of working capital; our spending reduction plan, which as Gary discussed, is expected to reduce cash use by $10 million to $11 million, excluding severance costs."
}