{
    "symbol": "BRSP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 13:15:01",
    "content": " The company reported first quarter 2022 GAAP net income attributable to common stockholders of $27.7 million, or $0.21 per share, and distributable earnings of $28.8 million or $0.22 per share. During the first quarter, the company committed to $589 million in aggregate loan commitments across 17 newly originated loans, with an initial funding of 481 million. During the first quarter, we also funded 20 million of advances on existing loans and received $224 million in repayments across five loans. This resulted in approximately $275 million a positive net deployment in our loan portfolio, growing the loan portfolio to $3.8 billion and total assets to $5.2 billion. Currently, there are an additional six loans in execution with an aggregate commitment amount of approximately $203 million, resulting in 10 loans totaling $331 million of aggregate commitments that have either closed or in execution so far, during the second quarter of 2022. As of March 31 2022, excluding cash and net assets on the balance sheet, senior and mezzanine loans and preferred equity is comprised of 110 investments with an aggregate gross book value of $3.8 billion, and a net book value of $1 billion or 82% of the portfolio. During the first quarter, we grew our loan portfolio by approximately 8% from $3.5 billion to $3.8 billion. CRE Debt Securities, a segment which includes four remaining CMBS positions, all subject to risk retention provisions through June 2022 and one remaining private equity interest has a gross and net book value of $41 million or 3% of the portfolio. For the first quarter, our distributable earnings and adjusted distributable earnings were each $28.8 million or $0.22 per share. Additionally, for the first quarter, we reported total company GAAP net income attributable to common stockholders of $27.7 million or $0.21 per share. During the first quarter, total company GAAP net book value increased slightly by $0.04 to $11.26 from $11.22 per share, while undepreciated book value decreased by just $0.01 to $12.36 from $12.37 per share."
}