{
    "symbol": "BRSP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 12:27:04",
    "content": " The company reported third quarter 2022 GAAP net loss attributable to common stockholders of $20.5 million, or $0.16 per share, distributable loss of $24.7 million and adjusted distributable earnings of $32.3 million, or $0.25 per share. During the third quarter, we closed three loans for a total commitment amount of $91 million. During the third quarter, we received $40 million in repayments across two loans and two partial paydowns. Subsequent to quarter end, five additional loans have paid off in full, and we have received one partial paydown for a combined total of $114 million. As of September 30, 2022 excluding cash and net assets on the balance sheet, the loan portfolio is comprised of 111 investments with an aggregate gross book value of $3.9 billion and a net book value of $945 million or 84% of the portfolio. Third quarter distributable loss, which includes $57.2 million of specific loan reserves on the Long Island City loans was $24.7 million or $0.19 per share. As for the remainder of the year, due to the rapid pace and level of deployment in 2021 and the first quarter of 2022, combined with the recent slowdown in loan repayments, we are well-positioned all things being equal to maintain higher levels of cash, while continuing to reduce adjusted distributable earnings that support $0.20 per share quarterly dividend. As noted earlier, we took asset-specific reserves on the two Long Island City loans totaling $57.2 million. And one of the things I'd point out is that roughly half of our -- less than half of our loans in office are pre-COVID, maybe -- I think it's like 11 loans for $0.5 billion that are pre-COVID loans, and the balance of the office loans, about 20-plus loans are roughly $600 million. But as I said in the prepared remarks, we really don't view that as a huge opportunity because of the ability to buy bonds there, you might have to buy -- to put out $100 million, you might have to buy seven, eight, 10 bonds, each one of them consisting of roughly 30 loans, you end up watching 300 loans on your balance sheet behind these securities to deploy what could be $25 million, $30 million of equity. That's why it's very important that we work with borrowers quarters in advance to make sure if they put the loan into a better coverage perspective, if they require a new rate cap and refunding of reserves, we want to make sure that we maintain the stability of the asset portfolio as rates are going up. As I said earlier Jade, we have 11 loans pre-COVID for about $0.5 billion that includes the two Long Island City assets."
}