{
    "symbol": "BRSP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 12:47:12",
    "content": " The company reported second quarter 2022 GAAP net income attributable to common stockholders of $34.3 million, or $0.26 per share, and adjusted distributable earnings of $31.48 million or $0.24 per share. During the second quarter, the company closed on $306 million in aggregate loan commitments across nine newly originated loans, with an initial loan funding of $279 million. Given the macroeconomic environment, we now anticipate loan repayments for the remainder of the year to be approximately $200 million per quarter, significantly less than the $400 million to $500 million we anticipated at the start of the year. In the beginning of the second quarter, we executed on the sale of an equity kicker related to a portfolio of industrial assets previously sold in 2019, generating a $22 million gain on sale. As of June 30th, 2022, excluding cash and net assets on the balance sheet, the loan portfolio was comprised of 110 investments with an aggregate gross book value of $3.8 billion, and the net book value of $946 million or 82% of the portfolio. For the second quarter, our distributable earnings and adjusted distributable earnings were each $31.4 million or $0.24 per share. Additionally, for the second quarter, we reported total company GAAP net income attributable to common stockholders of $34.3 million or $0.26 per share. Company second quarter GAAP net book value of $11.26 per share remained unchanged from the prior quarter, while undepreciated book value increased by $0.06 to $12.42 from $12.36 per share. As of the remainder of the year, the rapid pace and level of deployment over the last 18 months, combined with slower than expected repayments has us well-positioned to maintain higher levels of cash while continuing to produce adjusted distributable earnings that support the $0.20 per share quarterly dividend. We provide more data in our supplemental financial report, but in illustrative 150 basis point increase in the benchmark rates from the June 30th spot rates would add roughly $10.8 million to our annual earnings or about $0.08 per share. Given our adjusted distributable earnings performance in the second quarter, we declared a $0.20 per share versus a $0.19 in the first quarter."
}