{
    "symbol": "R",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 15:44:03",
    "content": " 54% of Ryderâ\u0080\u0099s 2022 revenue was from Supply Chain and Dedicated, up from 37% in 2015, reflecting secular trends in our initiatives to accelerate growth in these higher return businesses. Operating revenue was $2.4 billion in the fourth quarter up 14% from the prior year, reflecting revenue growth in all segments and supply chain acquisition. Comparable earnings per share from continuing operations were $3.89 in the fourth quarter, up from $3.52 in the prior year, driven by higher earnings and dedicated rental and supply chain, partially offset by lower used vehicle sales. 2022 free cash flows decreased to $921 million from $1.1 billion in the prior year, reflecting higher planned capital expenditures, partially offset by higher used vehicle sales process. Operating revenue versus the prior year increased 44%, primarily reflecting the Whiplash acquisition and organic revenue growth of 22%, driven by higher pricing, new business and higher volumes. Supply chain EBT as a percent of operating revenue was 4% in the quarter, up from the prior year, but below the segment's high single digit target range. Turning to slide 11, the trajectory of our cash flow continues to improve over time, reflecting growth in our contractual supply chain Dedicated and Lease businesses, which comprise approximately 85% of Ryderâ\u0080\u0099s operating revenue. Proceeds from the sale of used vehicles are expected to be flat year-over-year, reflecting higher volumes of units to be sold due to increased replacement activity in 2023, offset by lower pricing. In terms of financial forecast for 2023, operating revenue is expected to grow approximately 4% as strong supply chain and dedicated growth is partially offset by the impact of our UK exit, OEM delays and normalizing rental conditions. Comparable EPS is expected to remain strong and be between $11.05 and $12.05 in 2023, reflecting higher result in supply chain and dedicated and normalizing conditions in used vehicle sales and rental. FMS EBT as a percent of operating revenue is expected to be in the segment's low double digit target range, reflecting benefits from our multiyear lease pricing and maintenance cost savings initiatives, as well as normalizing conditions in used vehicle sales and rental. Supply chain operating revenue growth is expected to be in the segment's low double digit target range, driven by secular trends in our initiatives. Supply chain EBT percent is expected to approach the low end of the segmentâ\u0080\u0099s high single digit target range, as growth and pricing actions are partially offset by amortization of intangibles from recent acquisitions and dedicated operating revenue growth in EBT as a percent of operating revenue are expected to be at the target, reflecting new contract wins and pricing actions."
}