{
    "symbol": "R",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 14:40:24",
    "content": " Operating revenue of $2.3 billion in the third quarter increased 18% from the prior year, reflecting revenue growth in all segments and the supply chain acquisitions. Year-to-date free cash flow increased to $887 million from $829 million in the prior year, reflecting higher used vehicle sales proceeds, partially offset by higher planned capital expenditures. In North America, we continue to expect the lease fleet to be up by approximately 2,000 vehicles by year-end, and we're pleased to see the lease fleet return to growth in the third quarter, up by 300 vehicles versus prior year. Our full year 2022 rental CapEx forecast remains at $500 million, below the prior year with our ending fleet expected to grow by 2% or 700 vehicles. Used vehicle pricing would also need to -- would be to decline 35% from Q3 '22 levels in order to get $75 million of annualized gains and 42% to get zero annualized gains, all else constant. We're also providing a fourth quarter comparable EPS forecast of $3.18 to $3.38, below the prior year of $3.52, reflecting an expected decline in used vehicle pricing. So if you think about our target lease fleet growth levels, we're going to be probably at or above the high end of that next year just because we've had such a delay in getting those lease vehicles. Then you're going to have growth in lease, growth in Supply Chain and growth in Dedicated, which are all going to contribute to higher core earnings next year. But there's also things that we've done internally around process, around how we keep our rental trucks on the road and having fewer of them out of service that we have really made some changes over the last couple of years, which we think are going to help us keep it higher. I guess what I'm not really following is -- so you had like $100 million of gains in the quarter, and so -- or to go from -- if used pricing drops 35%, we go from like an annual of $400 million to $75 million."
}