{
    "symbol": "R",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 15:38:06",
    "content": " I'm very pleased with our performance this quarter, and I'm excited to share the significant progress that we're making on our strategy to create long-term shareholder value through increased returns in Fleet Management and accelerating growth in our higher return Supply Chain and Dedicated businesses. We generated record ROE of 25% for the trailing 12-month period, reflecting strong demand in pricing in our used vehicle sales and rental as well as benefits from our multiyear lease pricing and maintenance cost savings initiatives. We're on track to return to our high single-digit target in EBT as a percent of operating revenue in Supply Chain and Dedicated in the second half of the year, reflecting pricing adjustments to recover higher labor costs as well as growth. We increased our full year 2022 free cash flow forecast to $550 million to $650 million, primarily to reflect $300 million in expected proceeds from U.K. asset sales related to our previously announced exit from our U.K. FMS business. Operating revenue of $2.2 billion in the first quarter increased 22% from the prior year, reflecting revenue growth in all three business segments. First quarter free cash flow declined to $108 million from $241 million in the prior year, reflecting higher planned capital expenditures partially offset by higher used vehicle sales proceeds. First quarter rental capital spending of $180 million increased modestly year-over-year, reflecting higher investment in light- and medium-duty truck classes, which are structurally more in demand. We continue to expect Supply Chain and Dedicated margins to return to their high single-digit target range for EBT, as a percent of operating revenue in the second half of the year, reflecting price increases to address higher labor costs. So the growth we're expecting to see in lease, the growth in earnings we're expecting to see in our Supply Chain and Dedicated businesses, which will certainly offset and raise that $9 over time. I think one of the things that may be different going into this cycle as well is the growth we're seeing in Supply Chain and Dedicated, and we can use those rental assets to move into Supply Chain and Dedicated to support their growth needs as opposed to purchasing new equipment. We've got some 10-year contracts that have come through for us, which is -- we haven't seen that over the last four or five years, but typically a 3- to 5-year deal is what we're signing across both Dedicated and Supply Chain. That is primarily driven by FMS initially, and I would say lease and all the maintenance -- it's not just lease, it's the maintenance cost initiatives that we put in place over the last number of years that have produced $100 million in savings, a lower annual cost, if you will. So that's what we're estimating that -- if you just think of -- if you just look at pricing where used truck pricing can go, even when you get to the trough levels, we still think we're pretty close -- or near the trough levels, we're still pretty close to that $75 million to $100 million."
}