{
    "symbol": "SMR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 19:40:20",
    "content": "  Operator: Good afternoon, and welcome to NuScale's Fourth Quarter and Full Year 2022 Earnings Results Conference Call. A telephone replay will also be available for 7 days through a registration link, also accessible on NuScale's website. On today's call, NuScale will provide an update on its business and discuss financial results. As reflected in the safe harbor on Slide 2, the information set forth in the presentation discussed during the course of our rooms and the subsequent Q&A session includes forward-looking statements which reflect our current views of existing trends and are subject to a variety of risks and uncertainties. I'll now turn the call over to John Hopkins, NuScale's President and Chief Executive Officer. 2022 was a year of increasing momentum at NuScale as we made important progress toward our mission of helping power the clean energy transition through the development of our safe, innovative and cost-competitive VOYGR SMR power plants. This momentum was evident in the fourth quarter as we delivered on our remaining 3 goals for the year, enabling us to accomplish all 5 of our 2022 milestones, as you can see on Slide 4 of our presentation. With this progress, we have the ability to deliver NuScale power modules in 2028 to the customer order. In December, we secured our second committed customer, Romania's Road Power, with a signing of a contract for Phase I of front-end engineering and design or FEED work. Activities completed during the first phase of the FEED work will define the major site and specific inputs for our VOYGR 6 SMR power plant, which will be deployed at the Doicesti power station in Romania, formerly the site of a coal-fired power plant. As you may recall, President Biden touted our relationship with RoPower in his remarks at the G7 launch of the Partnership for Global Infrastructure and Investment, where the President committed to help raise $600 billion by 2027 for strategic investments critical to sustainable development and our shared global stability. President Biden noted that NuScale's first-of-its-kind SMR plant will help bring online zero emission energy to Europe faster, more cheaply and more efficiently. At NuScale, we believe that our agreement with RoPower illustrates our VOYGR technology presents a safe, economic and scalable solution, not just for Romania, but as the President mentioned, the broader European region and beyond as countries seek to diversify their energy portfolios and meet climate goals. We're also pleased to have completed the standard plan design, which I'll refer to as the SPD, ahead of schedule. This important step will help our customers save time, engineering resources and support licensing efforts providing them with a template VOYGR power plant design that will serve as a starting point for an APC contractor site specific designs. The completed SPD also advances our overall commercial readiness, preparing us for facility construction, equipment procurement and manufacturing of long-lead major engineered plant equipment for the NuScale balance of plant. And third, we submitted our second standard design approval application to the U.S. Nuclear Regulatory Commission, or NRC for our VOYGR 6 SMR power plant. The design of this new application features the same fundamental safety case of features approved by the NRC back in 2020, now with a power upgrade to a 77-megawatt module that will support the capacity needs for a wider range of customers as well as improved economics. The next step is for the NRC to accept the application for review, which I'll discuss in a moment as part of our plan for 2023. In addition to closing out our 5 goals for 2022 in the quarter, we made other steps already in the NuScale power module for deployment. As you'll see on Slide 7, we announced an agreement with Framatome, an international leader in nuclear energy to design fuel handling equipment and fuel storage racks for our VOYGR SMR power plants. We are proud to join the Ukraine clean fuel for SMRs pilot, a project we became part of alongside Special Presidential Envoy for Climate, John Kerry, and Ukraine Energy Minister, German Galushchenko. Our off-grid capability and site boundary, emergency planning zone or EPZ, which I'll discuss further, improves the ability to our technology in close proximity to an industrial facility that is an end user of hydrogen, therefore, eliminated transportation costs. The report is posted on our website and describes our nominal emission footprint, which is consistent with NuScale being a problem-solving technology company looking for a cleaner, brighter future. Now before I hand the call over to Chris to walk through our financials, I want to speak about 2023 and lay out 5 new objectives for this year, which are on Slide 8. Similar to last year's milestones, these initiatives reflect our laser focus on both growing our business and ensuring readiness to deliver on our customer commitments. First, we are focused on securing our next 3 committed customers, further diversifying our customer base and building on momentum with a sign-in RoPower and an ongoing work with a carbon-free power project or CFPP. In fact, already this year, we have made a part in strides with the project as participants recently reaffirmed their continued support for the project in a project's recent Class III cost estimate. As we advance on a path toward planned deployment in 2029, we begin the detailed work necessary to develop a Class II cost estimate for the project to be completed later this year. The Department of Energy, or DOE, has been an important, consistent supporter of NuScale in the CFPP. Going forward, sufficient funding for the CFPP DOE award in fiscal year 2024 will be critical to maintain proposed schedules, as Chris also will discuss. We expect the Inflation Reduction Act or IRA to accelerate these trends in the U.S. as utilities, local governments and industrial companies better understand the benefits the act provides in the time lines they need to fully take advantage of the tax credits available. We believe the potential expiration of some IRA benefits as early as 2032 will increase demand for NuScale SMRs throughout 2023, which projects likely need to begin moving forward in earnest by 2024 to ensure they can maximize their benefits under the IRA. NuScale's competitive positioning for new business drivers by IRA tax credits was bolstered in the fourth quarter when we received NRC approvals of our emergency planning zone methodology, enabling a significantly smaller site boundary zone in most locations. For example, our VOYGR SMR power plants can be installed at retired coal facilities near high population zones while other technologies may not. As I mentioned earlier, we are already seeing this benefit confirmed by RoPower who will site their first plant at a retired coal plant site. For our second milestone in 2023, we'll continue to make progress on advancing the design for key components of our SMR technology. Significant focus areas for this year include the reactor building crane mechanical design, reactive vessel internals, plant protection system in both in equipment integrated design. Our third goal for the year, as I mentioned earlier,  submitted our application for standard design approval for SDA to the NRC last year. We are undertaking this effort because NRC approval represents, in our view, a thorough validation of a design in commercial readiness and will, therefore, enhance the commercial prospects of the NuScale VOYGR SMR. As recently announced, we placed our first long lead material order with our partner Doosan and their ability to produce  in materials essential in the manufacturing of first NuScale power modules. Commencing the manufacturing of key component marks a significant transition from singing to the execution of our product delivery, further differentiating NuScale from the competition as we are one of a few select SMR providers to have advanced in the manufacturing space. And finally, our fifth 2023 goal is to secure long-lead material orders for 10 additional NuScale power modules. Our work to advance our design as well as expand our customer ecosystem, will be critical to ensuring we can meet these objectives. Taking a step back, these 5 goals for 2023 and the progress we have committed to making against them will demonstrate our continued advancement towards commercialization and meeting the needs of our customers. Stepping back and looking at the full year, NuScale's with strong foundation both to transition our business into commercialization phase. When we went public last year, the company raised an additional $342 million. Together, these actions strengthen NuScale's balance sheet and provided the business with considerable financial flexibility to support the advancement of our strategic and operational objectives in 2023 and beyond. On Slide 12, looking ahead, we provide insight on drivers for higher than previously anticipated cash use in 2023. Please keep in mind that the company with an asset-light model in the early stages of commercialization, like where NuScale is today, investment growth mainly through cost and expenses. Consistent with our DOE award agreement, we have requested an amount in the fiscal year 2024 appropriation to make up for the shortfall in fiscal year 2023 and support our continued participation in the CFPP. The second factor is a shifting out of payments to suppliers to fulfill our first customer order, refining the scope and payment terms with our suppliers and shipping out projected spending without impacting our first customer delivery schedule. Because we receive payments from customers for equipment and advance the current cost to procure equipment, we now anticipate a shift out in revenue, costs and associated margin to us on the CFPP. The third factor is an increase in R&D spending to catch up on more deferred from 2022 to 2023, an increase in the cost of planned work and the increased work added to mitigate future execution risk. For 2023, this equates to an anticipated negative cash flow from operations range of $102 million to $142 million. As referenced earlier in regard to  from a financial perspective, we are staying on top of cost estimate changes, communicating these to existing customers and incorporating them to discussions with prospects. NuScale is confident that our value equation will not be materially disrupted by inflationary forces, and that we will continue to see considerable demand for our modules. Overall, because of the capital we have raised and diligent stewardship of our financial position, we continue to be well positioned to navigate this dynamic environment, meet our near- and longer-term milestones and create value over time. So we presented a range for cash flow from operations of $102 million to $142 million to bracket the range that we would expect from the DOE, getting what we request or not getting what we request from them. And that's been a very typical sort of evolution through the last several years, where there isn't very much correlation between the President's budget request and what gets enacted. But right now, we're just working with what is the very first step in the process, which is the President's budget request. We haven't really forecasted out to 2024 at this point in time, but there's nothing for us to believe if we continue in the process we're on in terms of both the customers we have in hand and the customers we want to get in hand this year that, that objective could not be met. But that's something that will play out through the year, and we'll update it as we have a better understanding as to both how our markets are developing. One thing that hasn't been discussed that kind of came up with UAMPS latest cost estimate and competitive test was that there was a 80% subscription requirement, I believe, put into the agreement there. So my read on that is basically the project needs to go from, say, 25% subscribed today to 80% by February of 2024 or you could be responsible for reimbursing UAMPS for the cost. In terms of our confidence of gain at that point, we are working with UAMPS in the carbon-free power project to bring in that additional subscription. The news is that as you saw with them coming forward with 26 or 27 members voting to move forward with the project earlier this year at the $89 per megawatt hour price, that's very much indicative of a market that's changing and tightening in that area. And depending upon those factors going forward, we think that will continue in the Western region, particularly as coal plants continue to retire at a faster pace than expected, as we see people looking to get benefit from the Inflation Reduction Act we're making investments now as opposed to later on. We're also seeing interest from investor-owned utilities and increasingly, folks that have large energy needs and they need reliability are also interested in it, particularly data centers and the like moving forward. I'll hand the call back to NuScale CEO, John Hopkins, for any additional or closing remarks."
}