{
    "symbol": "ASO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 13:54:04",
    "content": " In terms of profitability, fourth quarter adjusted net income grew 12.5% to $163.5 million or $2.04 of adjusted diluted earnings per share, led by gross margin expansion from lower freight costs, a sales mix shift towards soft goods and efficiently managing our SG&A expenses. The main growth priorities for Academy in 2023 are: expanding the store base in existing and new markets with the opening of 13 to 15 new stores, continuing to build a more powerful omnichannel business, driving growth from our existing stores by improving service and productivity, strengthening our merchandising assortment, and attracting and engaging customers and leveraging and scaling our supply chain to support our future growth. In the fourth quarter, gross margin was $572.5 million with a rate of 32.8%, a 50 basis point improvement over Q4 of last year. Breaking Q4 now by division, we saw continued sales momentum in the soft goods half of the business, the footwear up 2.2% for last year and apparel running a 1.8% increase versus '21. We expect to achieve this growth by opening a significant number of new stores over the next several years continuing to expand our omnichannel business, elevating the performance of the existing store base and leveraging and scaling our supply chain. That said, we believe that people still are excited about having the experience that they can have with sports and outdoors and we believe that while transactions may be challenged some in the coming year that the assortment that we have, what we've done with pricing, what we're doing with our in-stocks will help us continue to grow and develop the business even though the consumer is challenged. This business generates a lot of cash, our ability to return over $600 million to shareholders in a year where we ran down and invested the most capital back into the business that we've invested since 2017 sets us up well for the future. After that, I think we've got a lot of runway to do a number of different things, and we'll continue to take that portfolio approach with buybacks, which over the past few years, buying back over $900 million of ASO stock at average price around $40."
}