{
    "symbol": "ASO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-07 15:13:10",
    "content": " Going forward we believe we will continue to gain share based on the following factors: Our position as the market leader in many of the fastest growing markets in the United States; increasing customer visits and conversion rates through more targeted and personalized marketing campaigns; driving greater adoption and use of our academy credit card; improving customer service through more team member training; optimizing schedules and faster checkout times; our continued commitment to the outdoors customer while other retailers have deemphasized the category; and lastly, our strengthening partnerships with major sports apparel and footwear brands. These priorities are: creating a consistent and meaningful omnichannel business that delivers a true omnichannel experience for our customers, growing our store base to strengthen existing markets and enter new markets successfully, starting with at least eight stores this year with a goal of opening 80 to 100 stores over the next five years, providing a great customer experience across all of our points of contact that drives loyalty and long-term growth, and we will support our continued growth by maintaining and scaling our IT capabilities, strengthening the efficiency and effectiveness of our supply chain and developing and maintaining an industry-leading retail team. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Hey, good morning guys. Please proceed with your questions. Please proceed with your questions. I think pools is a great example of that and I think grills are a great example of that, where they were softer in Q1 than they were the past two years where we've seen the shape of that business kind of revert back to where it was historically and it's showing there's opportunity probably in those businesses in Q2. Yes it's important, we're not going back to Galveston where maybe some of these are heading to Talos, but while some of those businesses have leveled off below where they were last year, but well, above 2019, we also have some businesses that are picking up because they were lower at that time. Please proceed with your questions. Please proceed with your questions. Hey, good morning guys. I mean, I think, that's one of the things we're demonstrating is that inventory levels, at least from a unit perspective that we used to run two or three years ago, we don't need to run to drive increases. Please proceed with your questions."
}