{
    "symbol": "ASO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-07 14:15:05",
    "content": " While each of our four merchandise divisions sports and recreation, footwear, apparel, and outdoors saw a decrease in their year-over-year sales when compared to the second quarter of 2019, each merchandise division grew by at least 20% with outdoors and sports and recreation, each increasing by more than 45% over 2019. In the second quarter, comparable sales declined 6%, an improvement over the first quarter, while earnings per share increased by 12% compared to last year. We ended the second quarter of inventory up 17% versus last year, only up 8% versus 2019 in terms of dollars and down 12% units. Please proceed with your questions. I would also say you asked around kind of the shape of the quarter, one of the things certainly as we go through quarter by quarter, month by month, you see a little bit of variance, one month maybe is a little better than that 36% average, another month maybe a little bit below that, but it keeps returning back to that roughly 36% increase versus 2019 and that's really kind of how we forecast the business as we look forward. Please proceed with your questions. Please proceed with your questions. We are getting smarter about the marketing that we do and because of the way we're opening stores, our marketing is going to vary and it's one of the reasons why we mentioned we opened a store in Shore Bank, which -- I mean short pump, which is an area where we had not been in before to understand how we go into a new area versus an area like Atlanta where we had a presence and people knew what Academy was. I'd say the second piece is, if you go back our marketing spend and our focus three or four years ago was broadened, blasted, broadcast, newsprint and we're a heck of a lot more efficient in our targeted marketing and seating the market would look like customers. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. I've said many times, we're different companies than we were four years ago and that how we operate the business, all of the systems and things that we've done to improve that, the merchandise we offers as Steve said earlier about good, better, best and making sure that we keep that consumer with us. Please proceed with your questions. Please proceed with your questions."
}