{
    "symbol": "CGNT",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-28 14:48:02",
    "content": " I'm Dean Ridlon, Cognyte's Head of Investor Relations. I'm here with Elad Sharon, Cognyte's CEO, and David Abadi, Cognyte's CFO. Before getting started, I would like to mention that accompanying our call today is a presentation. If you would like to view these slides in real-time during the call, please visit the Investors section of our website at cognyte.com, click on the Investors tab, click on the webcast link and select today's conference call. The forward-looking statements are made as of the date of this call and, except as required by law, Cognyte assumes no obligation to update or revise them. For a more detailed discussion of how these and other risks and uncertainties could cause Cognyte's actual results to differ materially from those indicated in these forward-looking statements, please see our annual report on Form 20-F for the fiscal year ended January 31, 2022 and other filings we make with the SEC. Please see today's presentation slides, our earnings release and the Investors section of our website at cognyte.com for a reconciliation of non-GAAP financial measures to GAAP measures. Non-GAAP financial information should not be considered in isolation from, as a substitute for, or superior to GAAP financial information, but is included because management believes it provides meaningful information about the financial performance of our business and is useful to investors for informational and comparative purposes. We are clearly disappointed in our result, but we believe the challenges we're facing are temporary in nature and are taking steps to navigate the current environment, improve our execution and cost structure, and emerge stronger once conditions improve. Our Q1 non-GAAP revenue came in at $87 million, a significant decline year-over-year. Later on, David will provide further details on our revenue and the impact it created on gross margin and the overall profitability. Today, I would like to provide an update on what we saw in the market during Q1 and how we're responding. In Q1, we continue to win large deals from existing customers that demonstrate the need for technology, the strength of our customer relationships, and how customers look to us to help them address evolving security threats. Our customer is dealing with an increase in data volume, which is why they turn to us to expand the platform. In terms of the overall Q1 bookings activity, I believe it is useful to look at the sequential trends in our revenue performance obligations, or RPO, from Q4 to Q1. Just to remind you, RPO represents contracted revenue that has not yet been recognized. Regarding backlog, as you know, we usually enter the quarter with a majority of our expected revenue already booked and included in RPO. However, in Q1, supply chain challenges presented uncertainties to our ability to deliver on our quarterly expectations. In this case, our customer ordered software from Cognyte and separately ordered hardware from another vendor to run our software. During Q1, this customer informed us that their hardware delivery was delayed. In addition to supply chain that continued to cause delays, I would like to provide more details on the other issues we discussed last quarter, the slow conversion for our pipeline to actual orders. As we discussed on our last call, five months ago, we hired a new CRO to improve our internal execution. Some of the actions we've already taken include focusing our sales teams on territories where we see the highest potential, identifying the most pressing customer pain points, and using a more consultative sales approach, and increasing the frequency of pipeline inspection, coupled with stronger collaboration between our sales and product teams. Over the last few months, our CRO and his team has met many individual customers to better understand the reasons behind the slow pipeline conversion. While it's too early to reach conclusions from his customer interviews, I would like to share some anecdotal examples, which I hope you will find useful. The first example is a government agency, which told us that their agency's budget for the year has decreased, and as a result, they have begun a process to adjust their operating plans. Second example is another government agency, with which we completed the sales process in Q4 last year for a multi-million dollar order. In this case, we expected the order to be pledged during Q1, but the order has not landed yet. But based on discussions with the customer, we continue to expect the order. First, we believe we have not lost key deals due to competition, and that we maintained our differentiated product position. Second, we believe our relationships with our customers remain strong and that this slow pipeline conversion was not caused by customer dissatisfaction with Cognyte solutions or services. Given the supply chain and slow pipeline conversion, our ability to focus this year with sufficient position is still limited. We are encouraged that the Q1 bookings activity resulted in maintaining total RPO north of $500 million, but we are still facing a broad range of potential outcomes going forward and are unable to provide guidance at this time. We believe the issues that we and our customers are facing are temporary in nature, and we will continue to monitor the environment and resume guidance as soon as practical. Given the disappointing Q1 results, we have taken specific steps to reduce our cost structure. Our current headcount is around 1,900, approximately 5% lower than our headcount at the beginning of the year. First, security threats are pervasive and governments continue to seek innovative solutions to address these threats. And third, we have developed deep relationships with our customers around the world and have a strong track record and reputation in the security market. A reconciliation between our GAAP and non-GAAP financial measures is available, as Dean mentioned, in our earnings release and in the Investors section of our website. As Elad said, we're not happy with our Q1 results. Revenue for Q1 came in at $86.4 million, a significant decline from last year. Our revenue mix includes three streams â\u0080\u0093 software, software services and professional services and other. In Q1, we experienced a mix change relative to Q1 last year as follows. Software revenue was $24.9 million, a sharp decline year-over-year due to customer deployment delays and slow pipeline conversion. Let me start with the customer deployment delays, as Elad mentioned, with customers that had their own supply chain issue, which impacted our revenue for the quarter. With regards to slow pipeline conversion, we continued to experience delay in converting our pipeline to orders, which then impacted our book-to-ship revenue. Regarding software service revenue, it came in at $45.8 million, down by $4.9 million year-over-year, primarily due to federal customer reducing support and subscription spends. Our non-GAAP gross margin and gross profit was 60.8% and $52.7 million, respectively. Our Q1 non-GAAP operating expense was $74.8 million, similar to Q4 level. This is the result of our non-GAAP tax methodology that is based on expected cash tax rate for the year, consistent with previous year's practice. As Elad mentioned, earlier in Q2, we took steps to reduce our cost structure. Turning to the balance sheet, we ended the quarter with $107 million of cash, cash equivalents and short-term investments. To remind you, during Q4, we drew down our $100 million credit facility and, during Q1, we paid back $50 million. Overall, cash used in operation in Q1 was $8.7 million, mainly due to our loss. Regarding inventory, given the supply chain environment, we took steps to increase our level of inventory by a few million dollars to allow better flexibility to address market demands for our solution. Our balance sheet also reflects a $6.2 million accrual related to an alleged infringement of an  patent claim, which was settled and paid in Q2. We believe the issue we're facing are temporary in nature, and we're taking specific steps that will enable us to emerge stronger over time. Cognyte has more than two decades of delivering innovative solutions, strong customer relationships, profitable growth and managing through periods of volatility. With that, I would like to hand the call over to operator to open the line for questions. The first question I had, I know that we're now essentially done with the second month in the second fiscal quarter, right, two months under our belt here. During the call, I shared examples of multi-million dollar orders slipped out of the quarter that were expected for the quarter. And for that reason, there is still broad range of potential outcomes and the uncertainty is it's a level that we cannot give guidance at this point of time. I was going to say, on the RPO, I know that you guys had mentioned that we saw a sequential increase by a few million dollars, I think is what you guys had called out. And what I mean by that, I know that there's a certain amount of RPO, which can be recognized over the next 12 months versus RPO that can be recognized thereafter. Usually, we enter the deal with an RPO â\u0080\u0093 and two-thirds of the RPO is for the year and one-third is for the years after. So, usually, that's the range. Last question before I turn it over to my colleagues, but on the inventories, I know that you guys have cited the increases you're seeing in inventory, which is reflected on the balance sheet, as providing you guys increased flexibility. Just to warn everyone, about 20% of our business is related to software that is installed on embedded product. At this point of time, we increased the inventory level to a level that is sufficient for us. Obviously, if you look at growth and sales are really funnel metrics. I went to RSA a couple of weeks ago and it seems like security spending across the board, corporate and federal, seems pretty healthy. I know you called on the prepared remarks, but maybe talk about just the competitive landscape. Our customer is telling us that they face growing challenges, growing security challenges, they need more analytics, their security challenges are becoming more complex, and they need more investigative tools. So, this is no change and customers do need our technology. As you remember, we are many years in this business, more than 25 years. So, when we talk to customers, we do not see any or hear anything that is related to change in the competitive landscape. It's not about the size of the pipeline, but it's about the low conversion rate of the pipeline. And we also see the changes in the environment, the macroeconomic and the geopolitical environment that might be really related to what we are facing in the market. So, let's start with the CRO. First of all, I must say that I'm really excited having him joining the company. His main focus, of course, is accelerating pipeline conversion. Obviously, now, when the borders are open, he and his team are meeting with customers extensively. As I mentioned earlier in the call, there are many interviews we're doing with the customers. We try to understand where they focus, where there remain challenges and to try and help them solve it. So, I'm pleased with the progress he's making. It was not related to one specific area, but it was across functions and total about 5%, including R&D. Given the cuts, and you said â\u0080\u0093 across the board, I believe you said, roughly 5% cuts. As we mentioned during the call, we did the cost saving across the organization. And actually, when weâ\u0080\u0099re looking at Q3, we expect our non-GAAP operating expense to be around $70 million. Obviously, given the fact that we are not providing any guidance, we also will not refer to the cash. But if we look at the overall, we believe that the current situation  $107 million of cash should there be enough to capitalize our operation. If you remember, we drew the credit facility back on December last year. And given that we had $107 million of cash by the end of Q1, we decided to repay $50 million. And given that the pipeline is healthy and we believe that it's temporary in nature, we think that this is the appropriate level of cost reduction that we had to make. So, for now, we believe this is the level of cost structure that we need to run the business given the current environment. I think that the COVID now, when it's behind us, it's easier for us to meet customers face to face, and we do it extensively. Like, close to â\u0080\u0093 more than 75% of our revenue coming from perpetual when we look at the software revenue. As Elad mentioned, like, we have two type of source of revenue in any given quarter. Revenue that's coming from the backlog that is planned to deliver through the quarter and is the revenue that's coming from, what it's called, like book to ship orders that we get within the quarter and are planned to be shipped in the same quarter. At any given quarter, the change between the months can be different. Usually, like any other software company, the last month of the quarter, and obviously, also the last two weeks of the quarter are highly important. There was a comment I think in the prepared remarks that several customers were reducing their support and subscriptions with Cognyte, which impacted your software services during the quarter. First of all, it's important to say that the customer is still with us and those are active customers. For whatever reason, they have they decided to reduce spend in some areas related to support and subscription and to free some budget to other purposes. The $70 million of OpEx, just to clarify, that's for 3Q. Obviously, we don't â\u0080\u0093 when we do the cost reduction, it takes some time until everything is effective. So for Q3, we are expecting non-GAAP operating expenses of $70 million. On the maintenance question, I know you talked about the historical precedent that it happens from time to time where people cut back. No, but it might be sometimes the customers decide to move, shift budgets from relatively old solutions to new solutions and update and upgrade their more new and modernized solution. Now, Iâ\u0080\u0099d like to turn the call back over to Dean Ridlon for closing remarks. Should you have any additional questions, please feel free to reach out to me and we look forward to speaking with you again next quarter."
}