{
    "symbol": "MGNX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 23:22:06",
    "content": " During the Phase 2 portion of his study, approximately 150 patients will be randomized 1 to 1 to 1 to receive either 2 mgs per kg or 2.7 mgs per kg of MGC018 every 4 weeks in the experimental groups or physicians’ choice of an ARAT agent not previously received in the control group. Following completion of the Phase 2 portion of the study, an analysis of the data will be performed to further inform the Phase 3 portion in which we plan to randomize additional patients one to one to receive either MGC018 at the recommended dose or an ARAT agent for the control group. To determine these lower doses and longer dosing interval, we performed modeling and simulation of patient pharmacokinetic and safety data from the Phase 1/2 study to evaluate the relationship between MGC018 exposure and dose modification, including dose reductions and dose delays and key indices of tolerability. The doses of 2 versus 2.7 mgs per kg every 4 weeks, we plan to evaluate in the Phase 2 portion of the study, compare with a starting dose of 3 mgs per kg every 3 weeks with any subsequent reductions evaluated in the Phase 1 dose expansion study. Regarding our ongoing Phase 1/2 dose expansion study of MGC018, we are encouraged by initial clinical activity observed in patients with melanoma and plan to recruit 20 additional melanoma patients evaluating a dose of 2.7 mgs per kg administered every 4 weeks. In addition, we recently dosed the first patient in the dose escalation study of MGC018 in combination with lorigerlimab, our PD-1 by CTLA-4 bispecific in patients with advanced solid tumors, including renal cell carcinoma, pancreatic cancer, ovarian cancer, hepatocellular carcinoma, MCRPC and melanoma. We are recruiting patients in Phase 2 study of an enoblituzumab in frontline patients with squamous cell carcinoma of the head and neck in which PD-L1 positive patients receive combination therapy with retifanlimab, an anti-PD-1 antibody and PD-L1 negative patients receive combination therapy with tebotelimab, our PD-1 x LAG-3 DART molecule. We are also evaluating lorigerlimab in a Phase 1/2 dose expansion study in patients with microsatellite stable colorectal cancer, mCRPC, melanoma and checkpoint-naive non-small cell lung cancer in a dose of 6 mgs per kg. Your line is now open. Your line is now open. Your line is open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is open. Your line is open. Your line is now open. Your line is open. Your line is open. Now that you are enrolling patients at 2.7 milligrams in melanoma and potentially also non-small cell lung cancer and your other expression cohorts, is there any way that in that scenario having those patients already in that Phase 1/2 or Phase 2 dose expansion that you could skip the Phase 2/3 of a pivotal trial and just go into Phase 3 following that or convert the dose expansion into a pivotal trial by enrolling more patients?"
}