{
    "symbol": "MGNX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 23:05:04",
    "content": " Finally, in terms of our cash runway, we anticipate that our cash, cash equivalents, and marketable securities balance as of June 30, 2022 was $34.5 million in payments subsequently received from collaboration partners, projected and anticipated payments from partners, product revenues, plus anticipated savings from our corporate restructuring plan announced today which Scott will walk through momentarily should extend our cash runway into 2024. This updated cash runway guidance now reflects anticipated expenditures related to the planned Phase 2 MGC018 Phase 2/3 study in metastatic castration resistant prostate cancer, as well as MacroGenics other ongoing studies. As a reminder, during the Phase 2 portion of the study, approximately 150 patients will be randomized one-to-one-to-one to receive either 2 mg per kg or 2.7 mgs per kg of MGC018 every four weeks in the experimental groups are physicians choice of an antigen receptor access target or ARAT agent, such as abiraterone, enzalutamide, not previously received in the controlled group. Following completion of the Phase 2 portion the study and interim analysis of the data will be performed to further inform the Phase 3 portion in which we plan to randomize additional patients one-to-one to receive either MGC018 at the recommended dose, or ARAT agent for the controlled group. We continue to dose patients in the Phase 1 dose escalation combination study of MGC018 with lorigerlimab in patients with advanced solid tumors included including renal cell carcinoma, pancreatic cancer, ovarian cancer, hepatocellular carcinoma, metastatic castration resistant prostate cancer, and melanoma. During the second quarter, we completed enrollment in a Phase 1/2 dose expansion study with large lorigerlimab as monotherapy and cohorts of patients with microsatellite stable colorectal cancer, mCRPC, melanoma, and checkpoint-naive non-small cell lung cancer. In July, we issued a press release, announcing the closure of the Phase 2 study evaluating the investigational regimen of enoblituzumab in combination with retifanlimab, an anti-PD-1 monoclonal antibody or tebotelimab, our PD-1 x LAG-3 bispecific DART molecule in the first line treatment of patients with recurrent or metastatic squamous cell carcinoma of the head and neck. At ASCO in June, investigators from Johns Hopkins presented a poster with encouraging clinical activity from an ongoing Phase 2 study of enoblituzumab in patients with localized prostate cancer in the neoadjuvant setting."
}