{
    "symbol": "EFX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 16:35:02",
    "content": " We expect to offset just under half of the mortgage revenue declined with stronger core revenue growth that will now exceed 17% from stronger workforce solutions performance and NPI rollouts, which is an increase of about 150 basis points or $175 million for the year. As I mentioned, at these levels, we still deliver solid '22 revenue growth of 6% and adjusted EPS growth of 7% despite a significant mortgage market decline impacting our revenue by almost 10.5 points, or over $500 million. Our ability to deliver 17% core revenue growth reflects the underlying breadth, depth and strength of the Equifax business model, and is well above our new long-term growth framework of 8% to 12%. In total, Workforce Solutions and USIS generated $1.08 billion in revenue, almost 80% of Equifax total revenue, with 14% total and 7.5% organic revenue growth, again, despite the 24.5% decline in the U.S mortgage market inquiries. Adjusted EPS at $2.22 a share was up a strong 13% from last year and above the guidance of $2.08 to $2.18 we provided in February, driven by strong revenue growth and progress in realizing the benefits of our cloud technology transformation. In the first quarter, Equifax core revenue growth, the green sections of the bars, grew very strong 21% which was above our expectations and substantially above our long-term framework -- financial framework of 8% to 12%. With our strong 21% core growth in the first quarter, and accelerating NPI rollouts, we now expect 2022 core revenue growth of over 17%, which is up about 150 basis points from our February guidance and 250 basis points from our original 2022 framework. As detailed on Slide 6, core mortgage revenue growth in first quarter was up a very strong 17%, driven by Workforce Solutions with their core mortgage revenue growth of 27% and 2% of USIS. Due to the strong core revenue growth, our first quarter mortgage revenue was down only 7% despite the 24.5% decline in overall U.S mortgage market. Core mortgage growth of 27% at Workforce Solutions was consistent with our guidance in February and driven by twin record additions, new products, increased system-to-system integrations and increased penetration. Workforce Solutions continues to deliver outstanding core revenue growth, delivering over 40% growth for the fourth time in the last five quarters. Second, EWS's increasing penetration in their key verticals of mortgage, talent, government and consumer finance, with all four verticals having significant opportunity for continued expansion by leveraging our expanded data hub strategy for the fast-growing talent and government markets driving over 80% core growth in these verticals. Rudy Ploder and EWS team delivered another outstanding quarter with 33% revenue growth, well above their 13% to 15% long-term framework and are positioned to deliver a very strong '22 and continue above market growth in the future. Verification Services revenue was over $500 million for the first time, with strong growth driven by non-mortgage verticals that represent almost 50% of Verifier revenue and delivered 90% total and 50% organic growth. Talent and Government Solutions, which now represent 30% and almost 40% of Verifier non-mortgage, respectively, both had outstanding quarters and combined were up a very strong 100% total and over 55% organic growth. As mentioned earlier, mortgage revenue for Workforce Solutions was up 3% versus last year, 27 points stronger than the overall U.S mortgage market decline and consistent with our expectations that EWS would outperform the mortgage market by approaching 30 points in 2022. Employer Services non-UC and ERC businesses had revenue of $86 million, up over 55% versus last year with strong organic growth of over 15%. Our combined Health e(fx) business, which is the combination of Equifax workforce analytics and our Health e(fx) acquisition that we acquired in the third quarter last year represented about 45% of Employer Services non-UC and ERC revenue in the quarter and delivered total growth of just under 70% with organic growth of about 1% as expected. Importantly, USIS delivered their fifth consecutive quarter of growth in B2B non-mortgage revenue at $242 million, which represents over 55% of total USIS revenue, and was up 4% with organic revenue growth of 2%. Financial Marketing Services, our B2B offline business had revenue of $46 million, down 14% from last year's 12% growth. EWS is expected to deliver revenue growth of about 15%, as stronger non-mortgage growth is expected to be over 35% partially offsets the impact of the weaker mortgage market. Looking at business units in the second quarter, Workforce Solutions revenue growth is expected to be up almost 20% year-to-year with mortgage down mid-single digits and very strong non-mortgage growth continuing. In 2022, over 50% of Equifax revenue is expected to be outside our traditional consumer and commercial Credit Bureau Market segments, principally in Workforce Solutions and our identity and fraud businesses. As shown on Slide 23, very strong 17% core revenue growth in '22 and 22% growth -- core growth last year is driven by our outperformance in higher growth vertical markets. And even more powerful are the businesses delivering over 20% growth in fast growing markets, including Workforce Solutions, which is up 30% -- 33% in the first quarter, with their talent businesses approaching 150%; their government business up about 90%; their consumer lending business up 40%; and I9 anywhere over 50%. Wrapping up on Slide 24, Equifax delivered another strong and broad base quarter with 12% overall growth and 21% core growth, more than offsetting the 25% decline in the mortgage market with broad based performance which was above your and our expectations. Our updated outlook deliver 6% growth offsetting more than $500 million over 10% of mortgage market decline, with strong core revenue growth of 17% in 2022, which is up 150 basis points from our February guide, and over 250 basis points from the framework we shared with you at our Investor Day in November. Looking back at the '08, '09 global financial crisis, which is the last time we saw a macro event like this impacting the mortgage market, Equifax revenue was down 6% versus the 6% growth we will deliver in our 2022 framework. Your line is now live. Your line is now live. Your line is now live. Your line is now live. And I think you got a sense that taking up our guidance, really for the second time this year, around core growth, with most of that being driven by non-mortgage core growth, shows our confidence in the underlying strength of the company, which is our ability to bring new solutions to market, executing on our cloud transformation and really driving into some of these new markets, like identity and fraud, like talent, like government that have higher underlying growth rates than traditional FI credit bureau kind of markets. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}