{
    "symbol": "AUR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 21:06:04",
    "content": " These include statements related to the achievement of certain milestones around the development and commercialization of Aurora Driver and Aurora Horizon on our anticipated timeframe the expected performance of our business, and potential opportunities with partners and pilot customers, expected cash runway and overall future prospects. Fourth quarter marked our first full year as a public company and in that time we made remarkable progress building Aurora Driver, our self-driving system and toward commercialization of Aurora Horizon, our autonomous trucking subscription service. We furthered these goals in the fourth quarter with our Aurora Driver Beta 5.0 release, which we believe puts us on track to achieve our critical feature complete milestone by the end of the first quarter of 2023. The Beta 5.0 release continues our work at building on our previous updates and advancing Aurora towards the feature-complete milestone, which we expect to achieve at the end of the first quarter of 2023. In the fourth quarter, we worked in collaboration with PACCAR to build an important prototype of their truck platform designed specifically for autonomous commercial scalability and we were proud to have our joint development of a Peterbilt 579 equipped with the Aurora Driver showcased by PACCAR at their booth at the 2023 Consumer Electronics Show in January. In the fourth quarter, Volvo Autonomous Solutions and Uber Freight announced a strategic partnership that involves the planned deployment of Volvo's autonomous transport solution on Uber Freight's network, which is made possible by the joint work we're doing with VAS to develop and scale autonomous transportation solutions with the Aurora Driver. At this time, I think in regards to the roadmap, we still believe we're on track to achieve feature complete and further to achieve Aurora Driver ready at the end of this year and are looking to hit the commercial launch milestone that we've set out for next year as well."
}