{
    "symbol": "TCOM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-28 00:16:02",
    "content": " Following these countriesâ\u0080\u0099 decisions to largely remove travel restrictions, we have been strengthening trends of business performance across our global platforms, with air bookings achieving triple-digit year-over-year growth and hotel bookings significantly improved in especially the Trans-Atlantic and Asia markets. In January and February, our domestic business sustained after the industry performance, with domestic hotel bookings increased above 20% year-over-year and will close to fully recover to 2019 level. In overseas market, domestic air ticket bookings on Trip.com have surpassed the 2019 level with growth more than 150% and have outpaced the industry average across all of our key markets. Overall, hotel bookings on our global platforms have also increased by more than 25% above 2019 level in the first quarter. Domestic hotel bookings in non-China markets on Trip.com increased over 200% when compared to the same period in 2019, especially in the markets such as Hong Kong, South Korea, Singapore, Malaysia, USA, UK, UAE, etcetera. For the first quarter of 2022, Trip.com Group reported net revenue of RMB4.1 billion, which was flattish compared to â\u0080\u0093 compared with the same period last year and decreased by 12% quarter-over-quarter, primarily due to continued disruption to the travel industry from the recent wave of pandemic outbreak. Transportation ticketing revenue for the first quarter of 2022 was RMB1.7 billion, representing a 10% increase year-over-year and 10% increase quarter-over-quarter, recovering to 50% of the 2019 level, among which China domestic recovery momentum was largely disrupted by resurgence of COVID since March, while air reservations on our international platforms saw a significant increase mainly contributed by the recovery in Europe and Asia as a result of relaxation of travel restrictions. Corporate travel revenue for the first quarter of 2022 was RMB222 million, representing a 12% decrease year-over-year and 40% decrease quarter-over-quarter, recovering to 93% of the 2019 level, primarily due to the impact of pandemic-related static management in March."
}