{
    "symbol": "TCOM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 23:41:13",
    "content": " Our same-city staycation hotel bookings in this quarter, grew by 10% above 2019 pre-COVID level and was 40% higher than the pre-pandemic level for the full year of 2022. Demand for outbound travel continued to surge in the first two quarters â\u0080\u0093 2 months of 2023, with outbound travel bookings increased by more than 300% compared to the same period in 2022. For hotel business, overall hotel bookings on our global platform hit a record high, and it was above pre COVID level for four consecutive quarters with domestic hotel bookings in non-China market increased by 140% versus 2019. While we conclude our year with the strong growth, International hotel and air ticket to business, our overseas activity business has also delivered great performance with GMV increased by over 130% year-over-year, we will continue to source for unique offerings and localize our campaigns to gain trajectory for local demands, while improving our competitiveness and a service capability to win over the local mindset. For the first quarter of 2022 Trip.com Group recorded a net revenue of RMB5 billion representing a 7% increase from the same period last year and a 27% decrease from the previous quarter, primarily due to viral resurgence and strict pandemic control in the China domestic market during the first 2 months of the quarter. Accommodation reservation revenue for the fourth quarter of 2022 was RMB1.7 billion, representing a 12% decrease year-over-year, and a 42% decrease quarter over quarter recovering to 57% of the 2019 level. Transportation ticketing revenue for the fourth quarter of 2022 was RMB2.2 billion, representing a 45% increase year-over-year and a 16% decrease quarter-over-quarter recovering to 64% of the 2019 level. Packaged tour revenue for the fourth quarter of 2022 was RMB164 million, representing a 7% decrease year-over-year and a 58% decrease quarter-over-quarter recovering to 21% of the 2019 level. Since the lifting of COVID related travel restrictions, China domestic travel market has seen very strong release of pent-up demand in the first 2 months of 2023, with industry level air passenger volumes recovered to around 80% of 2019 level and hotel RevPAR fully recovered in recent weeks. Second, our outbound travel bookings have grown by more than 300% compared to the same period last year and our hotel and air ticketing bookings on our global platforms continues to grow by triple-digits year-over-year. Please ask your question. Thank you for the questions. Thank you for the questions. Please ask your question. Thank you for the questions. Please ask your question. Please ask your question. Thank you for the questions. Please ask your question. Thank you for the questions. Please ask your question. Thank you for the questions. Thank you for the questions. Thank you for the questions. Thank you for the questions."
}