{
    "symbol": "TCOM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-14 22:49:05",
    "content": " In the third quarter, we are delighted to see strong performance in overseas markets and improvements in China domestic market, driven by robust travel summer demand and the relaxation for restrictions. Despite the impact of COVIDâ\u0080\u0099s resurgence since late August to which overshadowed the China domestic market, in the second half of the quarter, Trip.com Group continues to deliver better than market performance with our domestic hotel and air ticket revenues, both seeing positive year-over-year growth. First, overall performance on China market, in the third quarter of 2022, China domestic travel industry saw robust recovery following the easing of pandemic situation in June and was driven by the strong travel demand in the summer. Despite pandemic resurgence since late August, our overall domestic hotel bookings still managed to recover to the 2019 level and domestic hotel revenue increased by 25% year-over-year, while the same-city staycation hotel bookings in this quarter grew around 60% versus 2019, we will also see long-haul hotel bookings rapidly picking up as a result of the easing of COVID rules. For hotel, overall hotel bookings on our global platform has increased by over 45% above 2019 level in the third quarter with domestic hotel bookings in non-China market increased by 300% versus 2019. Following the robust recovery of global travel and tourism, our overseas activity business continued to thrive in Q3 with a record high quarterly GMV increasing by 150% year-over-year. For the third quarter of 2022, Trip.com Group reported net revenue of RMB6.9 billion, representing a 29% increase from the same period last year and a 72% increase from the previous quarter, primarily due to recovery in China domestic market and strong performance in our overseas market. Corporate travel revenue for the third quarter of 2022 was RMB317 million, representing a 9% increase year-over-year and a 76% increase quarter-over-quarter, 10% higher than the 2019 level, primarily due to the easing of relaxation of travel restrictions in July and August. Thank you for the questions. In terms of the performance by our different products, as we shared in the prepared remarks, the overall air ticketing bookings on our global platform has increased over 100% year-over-year and recovered to 80% to 90% of 2019 level in the third quarter. Thank you for the questions. Thank you for the questions. Thank you for the questions. Thank you for the questions. Thank you for the questions. Thank you for the questions."
}