{
    "symbol": "TCOM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-22 02:25:07",
    "content": " In Q2, our revenues in Europe and US markets have already surpassed of 2019 level and that in our Asia Pacific markets are also rapidly growing, while pace of growth in the European market has moderated due to headwinds such as airline capacity shortage and labor strikes, our air reservations in Europe has been approaching the 2019 level and our hotel reservation in the same region increased by about 400% year-over-year. Overall hotel bookings on global platforms have increased by more than 50% above the 2019 level in the second quarter with domestic hotel bookings in non-China market, Trip.com increased by 300% versus 2019. For the second quarter of 2022 Trip.com Group reported net revenue of RMB 4 billion, representing a 32% decrease from the same period last year, and a 2% decrease quarter-over-quarter, primarily due to continued disruption from pandemics resurgences to the China's domestic travel industry. Accommodation reservation revenue for the second quarter of 2022 was RMB 1.4 billion, representing a 45% decrease year-over-year and a 6% decrease quarter-over-quarter recovering to 40% of the 2019 level. Transportation ticketing revenue for the second quarter of 2022 was RMB 1.8 billion, representing a 15% decrease year-over-year and a 6% increase quarter-over-quarter recovering to 52% of the 2019 level. Packaged tour revenue for the second quarter of 2022 was RMB 122 million, representing a 67% decrease year-over-year and a 2% decrease quarter-over-quarter recovering to 12% of the 2019 levels. Corporate travel revenue for the second quarter of 2022 was RMB 210 million, representing a 46% decrease year-over-year and a 5% decrease quarter-over-quarter recovering to 68% of the 2019 level, primarily due to the impact of pandemic related drastic management in April and May. Overall, our domestic China hotel reservations on our platform quickly rebounded and surpassed the pre-COVID level from late June, such trajectory continued with the authorities adopted by wider and more precise control measures, and the total domestic hotel bookings was around 20% higher than 2019 level in July. The long haul travels was significantly impacted and number of total domestic air passengers was down by 70% to 80% versus the 2019 level in the recent weeks, and hotel business was relatively less affected with the support of staycation demand. In the second quarter, domestic hotel bookings in non- China markets on Trip.com increased by 300% versus the 2019 level. In terms of the financial contribution, driven by the growth of -- growing travel demand following relaxing travel restrictions and improving hotel ADR and air ticketing prices, revenues generated from our key international brands grew more than 200% year-over-year, and contributed 20% to 30% of our total revenue in Q2. Now, short haul and local travel activities has become a key contributor to our domestic recovery, especially in Q2 despite the severe pandemic influence, especially on the long haul travel, our local hotel reservation increased -- our local hotel reservations still increased by more than 30% compared with the 2019 level, such growth momentum continued to gain steam and gained a lot of the local hotel reservations increased by more than 60% compared with the 2019 level in July and August, while the long haul travel also saw significant recovery during the same period. So in the Q2, our overall hotel reservation through our key international brands grew more than 40% compared with 2019 level, which are, which also more than doubled of our 2021 level, which was benefit from -- it was benefited from both the strong demand of the domestic travel as well as the cross-selling for our recovery international air reservation."
}