{
    "symbol": "SLRC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 14:49:16",
    "content": " At September 30, 2022, SLRC's net asset value per share was $18.37, a slight decline from the second quarter, largely driven by unrealized losses from mark-to-market changes in our specialty finance subsidiaries resulting from lower comp company valuations. SLR Investment Corp.'s net asset value at September 30, 2022, was $1.01 billion or $18.37 per share compared to $1.02 billion or $18.53 per share at June 30, 2022. At September 30, 2022, SRLC's on-balance sheet investment portfolio had a fair market value of approximately $2.2 billion in 135 portfolio companies across 44 industries compared to a fair market value of $2.0 billion in 127 portfolio companies across 40 industries at June 30. Accordingly, the company's net investment income for the 3 months ended September 30, 2022 totaled $20.1 million or $0.37 per average share compared to $20.3 million or $0.37 per average share for the 3 months ended June 30. Ultimately, the company had a net increase in net assets resulting from operations of $13.5 million or $0.25 per average share for the 3 months ended September 30. At quarter end, on a fair value basis, the comprehensive portfolio consisted of approximately $2.9 billion of senior secured loans to approximately 780 distinct borrowers across over 100 industries with an average exposure of $3.7 million. Our specialty finance investments account for approximately 76% of the fair value of the portfolio, with the remaining 24% in senior secured cash flow loans to upper mid-market sponsor-backed companies. At quarter end, our sponsored cash flow portfolio was just over $700 million, equaling 24% of our combined portfolio and was invested across 45 companies. At quarter end, the combined senior secured asset-based loan portfolio totaled over $965 million, representing 33% of our total portfolio and was invested in over 170 borrowers. At quarter end, the combined equipment finance portfolio totaled just over $900 million, representing 31% of our total portfolio and was invested across 500 borrowers. Separately, if interest rates were to move another 100 basis points higher, we would expect the portfolio at September 30, 2022, to generate incremental net investment income of $0.12 per share on an annualized basis."
}