{
    "symbol": "SLRC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 15:33:06",
    "content": " At December 31, 2022, SLRC's on-balance sheet investment portfolio had a fair market value of approximately $2.1 billion in 139 portfolio companies across 45 industries compared to a fair market value of $2.2 billion in 135 portfolio companies across 44 industries at September 30, 2022. Accordingly, the company's net investment income for the 3 months ended December 31, 2022, totaled $22.5 million or $0.41 per average share compared to $20.1 million or $0.37 per average share for the 3 months ended September 30, 2022. Ultimately, the company had a net increase and net assets resulting from operations of $19 million or $0.30 per average share for the 3 months ended December 31, 2022. At year-end, on a fair value basis, the combined comprehensive portfolio consisted of approximately $2.9 billion of senior secured loans to approximately 800 distinct borrowers, across over 120 industries, with an average investment exposure of $3.7 million. At quarter end, measured at fair value, 99.8% of the comprehensive portfolio consisted of senior secured loans, with 98.6% in first lien loans, including investment in the SSLP attributable to SLRC, and only 0.2% invested in second lien cash flow loans with the remaining 1.2% invested and second lien asset-based loans, with full borrowing base governors. Our specialty finance investments account for approximately 78% of the comprehensive portfolio, with the remaining 22% invested in senior secured cash flow loans to upper mid-market sponsor-owned companies. At year-end, our sponsor finance portfolio was $643 million, including senior secured loans in the SSLP attributable to us, or just under 22% of our total portfolio, and this was invested across 44 companies. The weighted average yield on our cash flow portfolio was 11.2%, up from 9.6% in the prior quarter, with approximately 99% of our cash flow loan portfolio invested in first lien loans and a weighted interest coverage ratio above 2.3x. At year-end, the equipment finance portfolio totaled $900 million, representing approximately 32% of our total portfolio, and it was invested across 500 borrowers. And as we look at those investments, because, Mickey, we're in high free cash flow in companies, defensive sectors and large companies, we mentioned the average EBITDA being up above $110 million, we just find bigger is safer in environments like this and obviously first lien."
}