{
    "symbol": "SLRC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 16:01:07",
    "content": " Combined with the $50 million of 2.95% seniors to unsecured notes issued in Q3 2021, we have lowered the company’s long-term average unsecured financing rate. As of March 31, the combined company would’ve had just under $2.7 billion of comprehensive portfolio assets, and $1.1 billion of net assets. Based on SLRC’s balance sheet at March 31, the pro forma net leverage for the acquisitions of SUNS would’ve been 0.9 times opening up additional capacity to fund portfolio growth over the remainder of 2022. SLR Investment Corp’s net asset value at March 31, 2022 was $826.4 million or $19.56 per share compared to $842.3 million or $19.93 per share at December 31, 2021. At March 31, 2022, SLRC’s on balance sheet investment portfolio had a fair market value of $1.63 billion in 101 portfolio companies across 33 industries compared to a fair market value of $1.67 billion in 106 portfolio companies across 34 industries at December 31, 2021. At March 31, the company had $815 million of debt outstanding with leverage of 0.98 times net debt-to-equity, when considering available capacity from the company’s credit facilities together with available capital from the non-recourse credit facilities at SLR Credit Solutions, SLR Equipment Finance and Kingsbridge. Included in this quarter’s expenses were $1.52 million of one-time cost associated with the merger with SLR Senior Investment Corp. Across the fourth quarter of 2021 and the first quarter of 2022, SLRC recognized the total of $2.4 million of merger expenses, which includes additional reserves, which we currently expect will cover all remaining merger related expenses. Back to the P&L, accordingly the company’s net of investment income for the three months ended March 31, 2022, totaled $13.5 million or $0.32 per average share compared to $14.9 million or $0.35 per average share for the three months ended December 31, 2021. Ultimately the company had a net increase and net assets resulting from operations of $1.5 million or $0.04 per average share for the three months ended March 31, 2022. At quarter end, SLRC’s comprehensive portfolio was approximately $2 billion and remained highly diversified encompassing 600 different borrowers across 80 industries with average exposure of $3.3 million or 0.2% of the total portfolio. At quarter end, their highly diversified portfolio of leases, spans across three majors equipment sectors, including technology, industrial borrowers and healthcare, and total approximately $573 million with an average exposure of $1.3 million per borrowing. In Q1 comprehensive investment income, from the entire Equipment Finance business totaled $3.3 million to rebound in economic activity that started in the fourth quarter of 2020 and continued through last year has been supportive of the performance of our Equipment Finance portfolio. Focusing our new origination activity on first lien, cash flow loans to portfolio companies in defensive sectors in the upper mid-market increasing our investments in specialty finance assets, where we generally get tighter structures and more attractive risk adjusted returns and growing our investments alongside portfolio companies by committing to unfunded acquisition lines, which will be funded over the future quarters. The keys to driving, an increase in net investment income per share the remainder of this year will be a combination of capturing anticipated cost synergies  from the merger, growing our balance sheet and specialty finance portfolios, continuing to take advantage of our scale and employing a $50 million share repurchase program. Yes, I would just echo Michael’s comment, I think the diversity to your point, Melissa of the platform, the ability to do anything from a $100,000 factoring line to $250 million life science investment, is very compelling, the aggregation of these niches adds up to a nice overall diversified platform that serves us well throughout, economic and credit cycles. And so we’re really excited to have it together, and be able to think a little bit more simpler and broader with, and take advantage of the scale of the platform, not only at the BDC, but we, as you know have continued to partner with private capital alongside the BDC that allows the BDC to act as it is an $8 billion fund rather than a $2.6 billion fund pro forma the SUNS merger."
}