{
    "symbol": "VEDL",
    "quarter": 1,
    "year": 2022,
    "date": "2021-07-26 15:25:39",
    "content": " Starting with the business in charge for the quarter at INR2,124 crores, it is higher by 23% Y-o-Y primarily due to capitalization of major projects, especially at oil and gas and higher ore volumes and capitalization at zinc and aluminum businesses. Finance costs for Q1 was INR1,182 crores, down 6% Y-o-Y and down 11% quarter-on-quarter, due to lower average borrowings, partly offset by higher interest costs. Ladies and gentlemen, thank you for patiently waiting. Net debt as of June 30 stands at INR20,261 crores shown a decrease in  -- showing a decrease of net debt by INR4,152 crores sequentially and deleveraging versus last year is almost INR7,000 crores, almost 26%. The decrease in net debt is attributable to positive free cash flows post CapEx almost INR30,800 crores as a result of strong operational performance; and secondly, also a receipt of almost INR5,000 crores on account of intercorporate loans that we got repaid from Vedanta Resources Limited. And by making and adding the capacity, which is 100%, almost 100% value-added product, I think we can come to the first decile of the cost curve with our structural measures around securing our bauxite security, raising the capacity from to 2 million ton to 5 million ton with a potential to go to 6 million ton. And with this expansion with the 100% value-added capacity, I think the aluminum business is on par to 3 million tons, contributing $3 billion EBITDA to our kt. One is, what's your plan for net debt position of company ex Hindustan Zinc because in this quarter also, if you see that ex Hindustan Zinc, our net debt has declined both by 2,000 crores and out of that 1,500 crore -- the fully 500 crore decline on our EBITDA of around 6,400 crore. Sir, the oil segment EBITDA were at INR1,064 crores is actually lower on a Q-on-Q basis, Q1 versus Q4, even as the oil realization is $67, is around $7 higher versus the fourth quarter, oil production is flat. Ladies and gentlemen, thank you for patiently waiting."
}