{
    "symbol": "CARG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 23:55:03",
    "content": " During the call, we will make statements regarding our business that may be considered forward-looking within applicable securities laws, including statements concerning our outlook for the fourth quarter and full year 2022, managementâ\u0080\u0099s expectations for our future financial and operational performance, our business and growth strategies, our expectations for our CarOffer business and acquisition synergies, the value proposition of our current product offerings and other product opportunities, the impact of the semiconductor chip shortage and other macro-level industry issues and other statements regarding our plans, prospects and expectations. These market volume and unit price declines resulted in two disappointing trends, compressed wholesale transaction volumes and sell-through rates within our dealer-to-dealer and Instant Max Cash Offer businesses, as well as higher arbitration rates during the third quarter. Despite the wholesale challenges faced this quarter, we are proud of our foundational Listings business, and importantly, our Digital Retail offering, as they continue to demonstrate their resiliency and performed above third quarter revenue and operating income expectations, highlighting the strength of our platform. Gross merchandise sales or GMS was approximately $1.12 billion for the third quarter, up 27% from the previous year and declining 41% quarter-over-quarter due to a reduction in total transactions and declining average selling prices. Total third quarter wholesale and product revenue, inclusive of our dealer-to-dealer and Instant Max Cash Offer businesses was $261.1 million in Q3, an increase of 314% year-over-year, but down 25% quarter-over-quarter. Dealer-to-dealer revenue for the third quarter was $70.7 million, up 23% year-over-year, but down 27% quarter-over-quarter. Instant Max Cash Offer generated $190.4 million in revenue for the third quarter, growing 3,450% from a standing start year-over-year, but decreasing 24% quarter-over-quarter. In spite of the contributing macroeconomic factors and operational obstacles impacting our business, we continue to believe that the combination of our innovative Digital Retail offerings, our resilient foundational Listings business and our differentiated Digital Wholesale business will enable us to persevere through these transitory headwinds and march towards fulfilling our vision of creating the only platform where dealers can source, market and sell and consumers can shop, finance, buy and sell. Total third quarter revenue was $426.5 million, up 91% year-over-year and down 17% compared to the previous quarter. Marketplace revenue was $165.3 million for the third quarter, up 3% from $159.9 million in the prior year and up 1% compared to the prior quarter. The increase in marketplace revenue compared to both the prior year and quarter was primarily due to the increase in our high margin foundational subscription Listings revenue, driven by the increase in U.S. paying dealers in the platform and increased adoption of our add-on products. Wholesale revenue was $47 million for the third quarter of 2022, up 4% from $45.2 million in the prior year. The decrease in wholesale revenue compared to the prior quarter is mostly due to the continued market softening we began to see in the second quarter, which resulted in decreased transaction volumes for our dealer-to-dealer business. Lastly, product revenue was $214.1 million for the third quarter, up 1,105% from $17.8 million in the prior year and down 21% from the previous quarter. Quarter-over-quarter, however, we saw a decrease in revenue due to decreased transaction volumes and declining average selling prices associated with Instant Max Cash Offer, which generated $190.4 million in revenue, roughly $35 million behind our most recent guidance range. With a decrease in average selling prices, we saw an increase in transactions that were unwound during the quarter, resulting in higher than expected arbitration losses in our Digital Wholesale business, more so than the previous quarter. As we mentioned earlier in the call, both our dealer-to-dealer and Instant Max Cash Offer businesses experienced decreased transaction volumes and average selling prices, which coupled with increased transportation and arbitration costs compressed margins below expectations for the quarter. Our third quarter non-GAAP product, technology and development expenses grew 24% versus the year ago period to $26 million. While we expect the next few quarters will continue to be challenging for our Digital Wholesale business, we believe our foundational Listings business will continue to achieve growth, deliver positive results and our Digital Retail business, which is in its infancy, will set the stage for significant evolution to retail transactions and the associated long-term revenue and earnings growth."
}