{
    "symbol": "A",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-21 20:22:04",
    "content": " Europe also exceeded expectations by delivering double-digit growth in the quarter, coming in 14% higher than a year ago, with broad strength across our markets, highlighted by low 20s growth in pharma. On a geographic basis, China led the way with phenomenal 44% growth in Q4, driven by underlying demand across multiple end markets and our continued ability to quickly recover deferred revenue from Q2. So -- and I'll have Jacob jump on this as well, I think their businesses with the ability to invest and they have a lot of deferred investments over the years, but also a lot of new money going into renewable and green energy initiatives as well. We continue to see the small molecule being -- while it's still the largest part of our business, of course, we see biopharma as a great opportunity, but we take the small molecule business very seriously and continue to build full workflow solutions for that, particularly for the LC and LC/MS space, and that's where the growth is coming from. But I also think it's kind of also recognize we've been in kind of an unprecedented environment here for a number of quarters in a row where we've seen instrument growth rates in 20s plus, 30 plus. So we're thinking though, as we set up the guide for '23, we should assume some return to more normalized replacement rates in certain end markets but there's going to be growth there, but perhaps not at the same rate we've seen. I think just to kind of reinforce our ability to hit that mid-single or low to mid-single-digit growth rates, we also see continued strength in the U.S., for example, where our cannabis testing business is part of what we reported, so, right Jacob? I will close by saying that we had some very big wins in the enterprise service business, and that's where we really look about productivity of labs and how we help customers with their outcomes, and we're seeing that increase as we go through the quarter and through the year. I mean we ended this year touching on roughly $300 million for that business, and we've talked about this Train B being $150 million plus of capacity when Mike says we're going to be at capacity at that run rate by the end of the fiscal year."
}