{
    "symbol": "A",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-22 21:24:02",
    "content": " Diagnostics and Clinical grew 11% on top of 9% growth last year, with all three business groups again expanding revenues nicely during the quarter. In addition, we have increased our EPS guidance for the full year to $4.80 per share to $4.90 per share, up from the previous range of $4.76 per share to $4.86 per share and representing 11% to 13% growth versus fiscal year 2021. Again, the Agilent team performed extremely well in Q1 and with the solid growth we are seeing in orders and the team’s willingness and ability to take on every challenge that comes their way, I am confident that Q2 and our full year results will also be strong. I think, as we look at those, certainly, both of them performed better than we expected in Q1 and our expectation is that, those will continue to be the driver of growth for the full year, with Pharma probably at a roughly double-digit growth and Chemical and Energy about that high single-digit, double-digit growth as well, and then, followed very closely by Diagnostics in -- at high single-digits. You are very welcome. You are very welcome. You are very welcome. So, again, we feel really confident about the state of the China business, because we don’t have the order book we have, but also these other areas of recurring revenue are really growing, growing well for us and we continue to invest for our customers in China, as I mentioned in my call script. Patrick, just one other thing, we -- while we grew 3% as we mentioned, if we add back in kind of the Lunar New Year estimate, it was high-single digits, which was in our -- in line with what we had expected and our expectation is that, that’s going to be for the full year as well. You are very welcome. But there’s a consistent theme across where we deploy capital, which is high growth end markets, which will drive increase to the overall core growth of the company in places where we can leverage the scale and the capabilities we have in the company to really make those businesses even more successful. So that would continue to be our thesis and our approach, as well as staying focused in the private sector, which we think there’s -- really fits well the Agilent model and often the potential acquired companies and leadership teams really find the Agilent culture, a good place to be and they also see how well we have done with previous acquisitions. You are very welcome."
}