{
    "symbol": "RIO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 09:53:01",
    "content": "  Menno Sanderse: Good morning, and good afternoon, everybody. As usual, you'll hear today from Jakob and Peter, and this time hopefully from Bold as well, followed by a Q&A session. For those of you on the phone, on the web, you'll receive instructions as per usual from the operator. Having said that, please take some time to read the cautionary statements on Slide 2. I'm really pleased to be here with you in London, and thank you for those of you joining virtually. Peter is with me, and I'm very excited that we have Bold joining us from 1.3 kilometers underground from the Oyu Tolgoi mine in the Gobi Desert of Mongolia in a moment. Before I start, I'd like to acknowledge and pay my respect to all traditional owners and First Nations people that host our operations around the world. For me, 2022 was about building an even stronger Rio Tinto by investing in the health of our business and shaping our portfolio for the future while also delivering during the year. We achieved strong financial results with underlying earnings of $13.3 billion, free cash flow of $9 billion and a return on capital employed of 25%. We will return $8 billion to our shareholders in line with our policy, and representing the second largest ordinary dividend in our 150 years history. Since 2020, we have achieved $47 billion in earnings, paying $29 billion of taxes and royalties, investing $20 billion in the business and returning $33 billion to our shareholders. Our consistently strong financial results highlights the underlying strength of the business, our world-class assets, and most of all, our great people in meeting various challenges. As we look to build an even stronger future, it's clearly about more than today's financials. It's also about having the right values of care, courage and curiosity and transforming our culture. 2022 was another fatality-free year, building on the prior 3 years. Much of the success is the result of work implemented through our safety maturity model, which provides a roadmap for our leaders. I recently visited many sites, and what I'm seeing gives me confidence that we are on the right track to restoring our DNA of being the best operator. The teams are working together, are having open and transparent conversations and are finding better ways to address irritants and improve efficiency. This is translating into operational performance, higher level of employee engagement and improved safety performance. This is a significant step forward, but we know it will be a long journey to rebuild trust. In addition, we have signed new agreements with the Yindjibarndi and the Yinhawangka people in Australia and the Pekuakamiulnuatsh First Nation in Canada. In short, the health of our assets, our culture and our social license improved in 2022. Coupled with the acquisition of TRQ, we are able to work much closer together to ensure all stakeholders benefit from Oyu Tolgoi. At Simandou, we incorporated the infrastructure joint venture with our various partners and the government of Guinea. This was an important milestone, and we are now working on finalizing the shareholder agreements, cost estimates and regulatory approvals necessary to progress the co-development of rail and port facilities. As we strive to become a more outward-looking company, we are engaging broadly. I have met with customers, suppliers, governments, communities and other stakeholders in Canada, Japan, the U.S., to name a few, and I will be visiting China in the coming weeks. In particular, from the conversations I'm having with governments and customers, they're increasingly aware of the importance of mining to achieve the energy transition and strengthening supply chain security. While it is early days in a long journey with the progress to date, I'm confident that we have a pathway to achieve our 2030 and 2050 targets. In 2023, we will continue to invest in moving from ambitions to solutions. Good morning and good evening, everyone. Once again, we've announced a solid set of results. And of course, this is set against the context of record prices and financials in 2021. The business remained resilient and we entered 2023 with good operational momentum, especially in Pilbara iron ore, which I'll come back to later. However, lower prices and accelerating cost inflation throughout the year led to margin compression with underlying EBITDA down 30% to $26 billion. In aggregate, the ATO settlement in respect of 12 historical years, the final payment on Australian taxes for 2021 profits and hedging losses on U.S. dollar dividend payments reduced operating cash flow by just under $2 billion. Free cash flow of $9 billion was after $6.8 billion of capital expenditure and a modest working capital outflow, reflecting elevated prices for raw materials in aluminum inventory. Following $11.7 billion of dividends paid and $3.8 billion of acquisitions, we ended the year with net debt of $4.2 billion. With a 25% return on capital and underlying earnings of $13.3 billion, we have declared an $8 billion full year ordinary dividend, a 60% payout. 2022 was a volatile year for commodity prices with declines in the first half, albeit from record highs, accelerating in the second. Realized iron ore prices dropped 22%; copper, 19%; and for aluminum, it really was a year of 2 halves with a significant pricing momentum we enjoyed in the first half tailing off sharply in the second, down 25%. Following 3 years of growth to an all-time high in 2021, global iron ore demand contracted. In China, the property market worsened while COVID restrictions impacted steel demand, exerting downward pressure on prices. This is clearly reflected in the graph on the left, but I would just highlight that our average realized pricing relative to Platts markedly improved in the second half. In aluminum, expectations of a stronger demand outlook and Russian supply cuts did not eventuate, leading to prices falling to a low point in the second half as fears of a global economic slowdown set in. Overall, I should stress that it was a solid result with $26.3 billion of EBITDA, still at very attractive levels, 10% above 2020. As ever, commodity prices were the biggest driver of the 2021 variance, lowering EBITDA by $8.1 billion in aggregate. This is partly offset by aluminum and a recovery from minerals, in particular titanium dioxide feedstocks and borates. I would like to highlight that this is an industry-wide phenomenon and therefore, supportive of higher prices as cost curves shift upwards. This, together with rising energy costs, mostly diesel but also higher market-linked prices for raw materials especially in aluminum, lowered EBITDA by $3.5 billion. If we look at the right of the chart, you can see that the other factors were reasonably well contained despite the tightness in some of our key labor markets, which raised costs above the general level of inflation. This was mostly attributable to increased iron ore sales from China port side, along with some favorable value-added product premiums for aluminum. We are proactively incurring new costs as we build up teams to successfully deliver on our strategy to protect heritage, drive value-accretive growth and derisk the business as we decarbonize in the years to come. So overall, I'm reasonably comfortable with our cost performance. As supply contracts renewed and collective bargaining agreements come up for negotiation, we will see some inflation continuing to flow through to the cost base in 2023. Clearly, the financials were not as strong as 2021 when we enjoyed unsustainably high prices, but we did set a number of second half records in our Pilbara system and year-end inventories were healthy. Aluminum was more challenged both operationally and in terms of markets, which led to the significant squeeze I mentioned earlier with EBITDA margins compressed from 41% in the first half to just 15% in the second when we felt the full impact of cyclical downturn. However, markets have since recovered somewhat, and the longer-term outlook for the industry remains positive. With its superior hydro power position, our business has clear competitive advantages and is very well placed for the next cycle. Although lower gold volumes, as planned, were also a driver pushing up net unit costs. The success of the TRQ acquisition will see our copper production rise to between 650,000 and 710,000 tonnes this year on a consolidated basis, increasing to around 1 million tonnes once Oyu Tolgoi reaches full capacity. And lastly, minerals, where iron and titanium and borates posted strong recoveries, somewhat masked by lower prices at the iron ore company of Canada. Looking ahead, there is much uncertainty with high inflation and tight monetary policy carried into 2023 and the global economy expected to slow down further. This could provide some support, especially in infrastructure and real estate. However, we should expect further volatility with constraints for skilled labor and increases still to come in contracted costs, which are often lagged to an index. The rate of cost inflation in the Pilbara is moderating with 2023 unit cost guidance of $21 to $22.50 per tonne, a modest increase on last year. Western Ranger is a great case in point, our first co-designed mine. The systematic approach of our Safe Production System, or SPS, is yielding results with full deployments last year at Tom Price and Brockman 4. We are targeting a 5 million tonne uplift -- production uplift across the system this year, as mentioned at our investor seminar last November. Following the success of SPS and the Pilbara, our productivity drive is gathering momentum globally. We met our 2022 target with 30 deployments across 16 sites, and we are already seeing improved performance at many locations. For example, at IOC and Kennecott, we focused on the concentrators; and at Amrun, on the fixed plant. Rollouts are ongoing to continuously improve safety, strengthen employee engagement and sustainably lift operational performance. And we will build on that in 2023, rolling out to new sites, and going deeper at existing ones, replicating the learnings from last year. We will also seek to identify key Kaizens for high-priority improvements, replicate these across the organization and upskill our people through training initiatives. We will continue to invest throughout the cycle, balancing near-term returns to shareholders with reinvestment for growth and derisking future cash flows. It includes sustaining capital to ensure the integrity of our assets, high returning replacement projects and decarbonization investment. In 2022, investment in essential capital dipped slightly to $6.2 billion, and we finished the year with total CapEx of $6.8 billion. We successfully completed all sustaining and critical path replacement projects with the lower spend driven by a weaker Australian dollar, timing of growth CapEx and phasing on decarbonization. Over the past few years, we've supplemented the ordinary dividend with specials given our strong earnings and cash flows. We're now seeing a modest shift towards compelling growth as we unlock opportunities with $5.3 billion allocated in 2022, including our first forays into M&A for over a decade. The largest component of our investment in growth were the $825 million acquisition of Rincon and the $3 billion purchase of noncontrolling interests in TRQ, doubling our holding in Oyu Tolgoi to 66%. This is, of course, our largest growth project, where we invested a further $500 million in 2022 with first sustainable production now expected in the first quarter. We now expect our share of capital to be about $8 billion in 2023, including $2 billion for growth. Importantly, we're absorbing inflationary pressures within our total guidance. For each of '24 and '25, we expect this to rise to between $9 billion and $10 billion, including $3 billion of growth each year. And -- but as we said at our seminar, Simandou comprises around 45% of the forward-looking growth CapEx over the next 3 years. But as I've mentioned before, investment in growth is highly dependent on the timing of commitments. If we cannot develop value-accretive options, we will follow our capital allocation framework. It's included in our capital guidance but we first need to reach agreement with our JV partners, the Government of Guinea and WCS on the infrastructure pathway. We maintained our financial strength, ending the year with net debt of $4.2 billion compared with net cash of $1.6 billion at the end of 2021. The movement reflected, in part, our acquisitions of TRQ and Rincon. Going forward, we will continue to review whether additional returns are appropriate in line with our policy of supplementing the ordinary dividend in periods of strong earnings and cash generation. We have remained very consistent with our shareholder returns policy, which has now been in place for 7 years. The dividend remains a core part of our equity story, which we see as paramount for maintaining discipline. Our financial strength means that we can accelerate our decarbonization, reinvest for growth and continue to pay attractive dividends through the cycle. And with that, let me hand over to Bold in Mongolia. I'm currently the Mongolia with our team celebrating Tsagaan Sar, Mongolian Lunar New Year. During this holiday, we Mongolians celebrated by visiting and paying respect to our elders, sharing our achievements of the past year with pride and talking about our plans and dreams for the future. Today, I'm talking to you live 1,300 meters below the surface next to drawbell 18 of this world-class underground development. In January last year, we achieved a mutual understanding and agreement with the government of Mongolia on a number of issues that have caused friction for many years. As a result, Jakob and Prime Minister, Oyun-Erdene stood side-by-side and together initiated the start of our underground caving operations. In June '22, we completed construction of the first drawbell, and since then, we have completed 27, bringing forward first sustainable production to the first quarter of this year. It will take time for the underground mine to reach its full potential, but it is a huge milestone for investors, employees, our partners and my home country. In December '22, we completed the acquisition of Turquoise Hill Resources, which doubles our attributable volumes of copper and gold from Oyu Tolgoi going forward. But just as importantly, it gives us a direct shareholding in the business to work more closely with our partner, . Block caving always has risk in terms of footprint stability and how the cave propagates, whether it goes too fast or too slow or stalls. But our platforms give us an integrated view of the cave, offering early insights into potential problems and allow us to respond more quickly. And at times, we had to reduce our site population by more than 50%, where the average miner spent over 3 months out of the year in quarantine. Nevertheless, we responded with resilience and continued our progress. The remaining panels of the underground mine, Panels 1 and 2, are continuing with their design optimization and development based on data and learnings gathered from Panel 0. Shaft #4 passed 500 meters in depth and Shaft #3 400 meters underway to approximately 1,100 meters to support future production volumes. We'll continue to work with the government, and there is a commitment from both sides to work through any past, current or future issues with patience and respect. Mongolia has a lot to offer as an investment destination, and we look forward to welcome you investors during the year to visit the underground and to celebrate our achievement of commencement of underground production. Our talented workforce is 97% Mongolian, and we have over 850 local suppliers, of which 100 are from the Gobi. In the coming years, you will see a significant wave of Mongolians taking their place as part of the global mining expert community. We now have almost 100 Mongolian employees working across our product groups in other jurisdictions from the United States, to Madagascar and Australia. It has been a seminal year for our history in Mongolia, but 2023 will be an even bigger one. Ten years after the open pit first exported product to customers, we are perfectly positioned to begin to realize the true value of Oyu Tolgoi through an aligned partnership with our government partners. We have an ambition to double annual copper out by end of the decade and have an interest in 2 of top 5 copper assets globally by 2030, according to Wood Mac. With the energy transition in the U.S. and the U.S. being short on copper cathode, we are well placed to provide U.S. domestic supply. We continue to work with the indigenous people, the U.S. Forest Service and local and federal governments. Nuton has the potential to deliver copper recoveries of around 80% from traditionally hard-to-mine and process primary sulfides such as chalcopyrite, providing access to the green and brownfield ore bodies around the world. It promises to deliver strong ESG credentials, has a lower footprint, uses less water and energy and has a very low capital intensity producing 99.9% copper cathode. We have set our course in 2022 and '23 will require patience and execution discipline as we ramp up our world-class OT underground operation, a most immediate source of growth tonnes. Well, thank you, Bold. When I became Chief Executive, I introduced 4 objectives: to become the best operator, to strive for impeccable ESG, to excel in development and to strengthen our social license. The objectives, coupled with our values of care, courage and curiosity are the foundation of our culture and guide our people day in and day out. In 2021, we launched our strategy with climate at its heart, which sets out the long-term pathway for Rio, supported by the objectives. To provide the materials the world's needs connects our contribution to everyday life, our customers, the communities where we operate and society at large. There's always more to be done, but we are on the right track. In 2023, we will continue to focus on lasting chains to make our workplace a safer, more inclusive environment. Implementing the recommendations of the Everyday Respect report is absolutely crucial to driving this change, but it goes broader and deeper. Recently, I went to Tom Price, Paraburdoo and Marandoo in the Pilbara, and I was so encouraged by the honest and open conversation we had and proud of how the teams are working together to each make a difference every day. We will spend time listening and learning from our people, communities and partners as we continue to build better relationships by finding new and better ways to work together, for example, through co-management of country in Australia. I also visited the Western Range project, where we have commenced early works at our first codesigned iron ore mine. The approach we are taking with this project deepens our relationships with the traditional owners, the Yinhawangka people and with our long-term partner and customer, Baowu. In 2023, we will continue to empower and unleash the quality of our people through the deployment of our Safe Production System and by building a positive culture. And as Bold just shared, we will reach sustainable production at our Oyu Tolgoi before the end of this quarter. We will focus the pathways we have mapped to decarbonize our business, working with a range of partners to innovate and develop solutions. And as we mark 150 years of Rio Tinto, we reflect on our past the role it has played in making us who we are today and helping us achieve our purpose in the future. And looking to the future, the demand will only grow driven by ongoing urbanization and the energy transition. That is why our strategy is about growing in the materials needed such as copper, lithium, aluminum and high-quality iron ore. A key task for our industry will be to find better ways to provide for those needs at pace, reliably and with a low carbon footprint. This will be challenging, but we're up for it. We know we can't solve all these challenges alone so we are partnering with others, ramping up our technical skills and building capabilities for some of the bigger challenges we face. As I've noted before, it is a multi-decade journey. As we look ahead, the materials we provide are crucial to the world and the long-term outlook is attractive. In summary, 2022 was all about building an even stronger Rio Tinto by investing in the health of our business and shaping our portfolio for the future while also delivering during the year. We are uniquely positioned to accelerate the decarbonization of our portfolio, to invest and grow in the commodities needed for the transition and to continue to pay attractive dividends. Thank you, Jakob, Peter and Bold. And clearly, the financial market is spending too much time on conspiracy theories. This is 1.3 kilometers below ground, about 10,000 miles away from London. This is how more than this mine is, and we hope to take you there during this year. I'm struck by three of your future options revolve around science, if I think about Nuton, if I think about Rincon, if I think about ELYSIS. We are -- the things that we are sharing here is, of course, the ones that we really believe in. And I think a couple of things are really interesting to see is, first of all, we have a search facility outside Melbourne, Bundoora and that was inaugurated, I think, in 1992. And now it really, really starts delivering. Just to remind you of the time it takes, I hope you saw our capital market update, I did make a point out of inviting our Chief Scientist, Nigel Steward, to come and talk to you. And talk about what we are doing because 1 of the things I certainly observe is, we are probably one of the companies that has most research and development people, and we've had that for a long time. We appointed one, and we are really strengthening the development so that we will continue to see those new things coming. The other things, the things that we're talking about here, I do think that they will work. But I will say one area that you didn't talk too much of what ELYSIS is in a way, but the whole decarbonization actually requires an awful lot of technology development. Some of the things are easy, just renewable plug-in if it's electricity needs, but some of the processing fundamentally needs new processing. But it's in a country which is sandwiched between 2 other countries where, to be frank, the relationship with the West is distinctly worse than it was in 2016. Bold, you obviously have a lot of passion for that question. No, look, I'm very biased, of course. And I think you would find that we are an island of democracy, obviously, with very 2 powerful neighbors. And our government's policy is supporting actively the third neighbor policy, which is vital for our strategic geopolitical independence and the position in the region. Now I think the risk is everywhere -- when you look at the risk in many parts of Western world and countries, and I don't think Mongolia is any different. And I would ask you, is U.K. or U.S. any different than Mongolia from a political risk at the moment? But I would say one thing, Jason, if I may add one thing. And one little piece of evidence is that it's less than 10 days ago that we did get the reprofiling of the project financing now going well beyond our, what do you call it, completion guarantee. So a whole raft of banks, including the IFC, EBRD, et cetera, have signed off new credits into Mongolia. Just a follow-up, if I could. The -- in terms of the asset once upon a time, Friedland used to talk about this as a string of copper pearls across the desert. Yes, definitely not looking to discover the next OT because we have our hands full with this one. Operator, please, first question from the line. I have a question for Bold, just to make sure the communications work okay in the new mine. Bold, just considering you're in Panel 0 now, I just wanted to perhaps see how the ground conditions are progressing. That was a key issue in the past, especially looking at Panel 1 and 2. We're obviously at the moment in drawbell 27 of Panel 0, so very early days. So the learnings, obviously, from Panel 0 have been definitely incorporated into the learnings around geotech on Panel 1 and 2. And it's a foundry that is the single version of the truth that gives our decision-makers, the real-time data and within 15 minutes, they exactly know where the pressure points are and et cetera, and where we could see some movements. So the follow-up, staying with copper. Look, I think Kennecott is one of those ever expanding brownfield expansions because there's always ore around the walls and you could always create optionality in terms of the open pit expansion. But we're definitely looking much deeper into the underground and the integrated scans project, which we got a CapEx approval for. We're going underground and touching the ore body and obviously, that is a much higher grade than the open pit. So we're pretty excited about that, but it's still early days. I think the lesson from OT is you want to get underground, you want to touch the rock, you want to see what the ground conditions are before we can give any definitive views around the ore body development. Bold, I'm just looking at the time frame that you've outlined, I think it's Slide 20 for OT. And I've noticed that the conveyor to surface will be completed before the vent shafts, Shaft 3 and 4. And look, we're not going to be able to ramp up to fully the 95,000 tonne capacity per day. It will take 2, 3, 4 years potentially to reach that its full potential. But I think I don't want to jinx it, Paul. But at the moment, for this year's production guidance, we're very comfortable with the ramp-up schedule. I was thinking 5-year ramp-up, so I'll take 2, 3 or 4. Next question, maybe switching to Peter and on the cost front. And just focusing, Peter, on the aluminum costs. I mean, you're seeing the same pressures as your peers in the industry. But the alumina assets actually made, I think, $200 million of EBITDA and costs were $430 a tonne. Paul, no, thanks, and you're absolutely right. I mean, it was price, the price of alumina following the metal price down. Some of that lags when it comes through the system, into our costs. They didn't perform, I think, as we would want them to do. But Paul, there wasn't anything else other than that. And as you say, a bit of a gas price come through. But other than that, coal and gas, caustic and the market price were the key factors. But let me -- allow me to tell you that, Paul, we're still optimistic about our aluminum business because you've got to look at how hard it is for competition as well and think about the world, and the Western world needs a lot of aluminum and that needs to be produced. We are still uniquely placed, particularly with a very low carbon footprint we have from most of our aluminum assets. Just, Danielle, and don't worry, we'll get through everybody. No, look, I think the #1, I guess, objective for us is to work with the government of Guinea and the people of Guinea. It's their resource, they work on their timetable, they have to get comfortable. We signed a term sheet in December, now in the final stages of definitive documentation. So we'll progress it as fast as we can provided, obviously, the Guinean Government is comfortable with. And it goes without saying, all of you would love to have cost and schedule. Just one follow-up in iron ore, that's slightly different asset. So in the Pilbara, obviously, you saw significant recovery through the year. Last year, ended up at a great run rate. No, look, I went there, as I said here, I've just been visiting a number of mines and spent 2 weeks in Western Australia. We came into the year in a very good -- in a very good shape, really on all fronts, the assets were in a better shape than at the beginning of the year, the projects we finalized last year are working. We're still ramping up on Gudai-Darri, but it's working well. It's -- Q1 is always unpredictable, and I can't tell you exactly how the weather is going to be in the rest of Q1. So Peter, I think you mentioned a modest shift in the dividend distribution in 2022. So I mean, Dom, we paid out exactly in line with our policy. In fact, we paid out at the top of that 60% of our policy. Now when we do that, then we go around and look at compelling growth, we look at the balance sheet and we look at additional returns. And I think this year, we certainly put money into what we see as compelling growth. I mean, the acquisition of the minorities of TRQ, Rincon, we're keeping, investing in the OT underground. The -- actually, we paid out $8 billion, second half's dividend, and that was on free cash flow of $9 billion. And this year, we applied it absolutely at top of our range. Operator, please question from the line. I had a couple of questions for Bold, and just complements on the Wi-Fi, by the way, very impressive. So on Oyu Tolgoi, I just wanted to ask on the project schedule, it would be helpful to get an update on how far behind schedule Shaft 3 and 4 are. Last time you mentioned, they are around 15 months behind relative to the 2020 technical report. Look, I think Shaft 3 and 4 are progressing really, really well. I think the one thing I would say, though, is that when we provided the schedule estimate at the time, it had estimated the shaft sinking to commence around June of '21. I mean, reality is we had 9 months of delay. And oftentimes, we forget COVID. And at the time, there were restrictions on shaft sinkers to be actually to be able to travel. And so Mongolia did not allow inbound travel until, I think, April of '22. So that's roughly -- I think in terms of the productivity, I'm actually very pleased. Look, I think there they're about 400 or 500 meters, 1,100 meters. We're working through, obviously, looking at what else to do in terms of mine planning and sequencing, primary crusher 2 and other things. So I just want to be really realistic that this is a year for learning for us, and we'll build confidence as the year goes on. I just wanted to talk about Slide 22, where you're talking about doubling copper production. And I guess specifically, can you talk about whether a plant expansion at OT is considered in all of that. Look, if you look at the '21 and '22 production volume, they only had the 1/3 of OT in the numbers. So when you look at the future over 1 million tonnes of production for Rio Tinto, that obviously assumes the ramp-up of OT to 500,000-plus copper production. And to go from that '21 low base, to over 1 million, 80% obviously, is OT. There is a growth coming from Kennecott potentially, but that is natural coming from the kit expansions. And potentially, we're looking at the underground, but we don't have at the moment the precise numbers to give you on the underground because we need to finish the feasibility study on that. As far as the next expansions, what it does not have, it doesn't have Resolution, it doesn't have Winu, it doesn't have Nuton and any potential Escondida expansions. So together with BHP, we'll be obviously looking at that. The point I'm making is we have some of the best ore bodies in the world with Resolution, OT, Escondida. I thought it said in the footnote, OT was adjusted for 100% there, but maybe we can take that off-line. It does look as though the January run rates have held strong, which is great to see. I mean, it's early days in the year, but just considering where the business is at the moment, I mean, it does look as though the top end has got to be achieved. This is -- this is very helpful because sometimes the pressure from the market is not helpful because if you're a little bit behind all the time and you're only thinking about tomorrow and how do I get the last tonnes, you're not doing the right thing. And what I would love to see this company getting more into is underpromise and overdeliver, which we have not done too much of in recent years. Maybe we'll stick on iron ore, saying it's 70% of your EBITDA still. It seems like from what you've said and what you wrote in the report, you seem to be a lot more constructive on China, maybe Q2. First of all, you saw already the recovery happening in November. And if you are carefully following the stocks in -- the stock levels in China, they have been historically very, very low. So that already gives you some confidence about the needs for restocking, et cetera, plus, of course, that consumption were happening already in Q4. Secondly, when you really dive deep into the property market, there has been a number of indicators that has demonstrated a lot of disruption, but that only covers part of the property market. And when you look at the total property market, it's probably somewhat more robust than those indicators are showing you. And yes, you can read it in the news as well I spoke to our biggest customer, Baowu, about last week. And certainly, from them, there is a positive way of looking at the economy is going and there's a need for steel. It's not going to be kind of wild swings, but the market has already set itself for good demand from China, and that's what we are seeing happening. And maybe just as a follow-up, just if you could share some thoughts on the China Buyers Group. Look, the engagement has been very positive. Obviously, we know the Chairman very well because the Chairman used to be Chairman of Chinalco, our biggest shareholder. So -- and so far, what we have been exploring is areas of win-wins. And -- and yes, we have -- we are welcoming it with the agenda that they have shown us. Two questions, 1 on lithium and then 1 on Simandou. And then on Simandou, just interested in kind of what is actually taking place on the ground at the moment in terms of work. Look, there is an enormous need particularly in Europe for having more lithium for the massive automaker industry. But ultimately, it's a societal choice. And therefore, the only thing we can do is offering the best and most compelling proposition to the government of Serbia and see -- and then see whether they want to develop it. Look, Charles Zimmerman, who runs our projects has been there a few weeks ago. But obviously, we're not going to do anything ahead until the finalization of the agreement, as Jakob and Peter had alluded to. So a lot of activity, but a lot of it is preparatory phases for a rapid construction period. I know it's a question, but in terms of your views from right here. And then I guess within that context, we've seen sustaining CapEx rise every year. And then on the growth CapEx side, we're probably going to see higher cost than maybe what we were thought 2 years ago. That's very, very good. In terms of inflation, I think you -- in that waterfall, we show some of those market-driven factors. I mean, clearly, there is that inflation there that we sort of -- general inflation that flows through. But I have to say, I think what we see is pretty much that felt, as I said, right across the cost curve. In terms of the capital side, and as I said, I think we're absorbing that inflation within our sustaining capital guidance. Every year, our assets come out at the end and better health than they go in. So I think at the moment, we are comfortable with the capital guidance and just fully absorbing any inflation within that. One question is on the -- throughout your presentation, you have given a little reference to inorganic growth. Look, first of all, I probably much more believe in smaller M&A than big M&A. And I hope you can see with the things we are doing, they're all individual are very different but they all make industrial sense because that's where you actually get value out of M&A, in my view. We are trying to build -- shape the portfolio so it's relevant for our customers, for the future. But now you're saying looking inwards, looking outwards. May I mention Resolution, Simandou, Rhodes Ridge, et cetera. But at the end of the day, we don't want to grow lithium for the sake of growing lithium. We want to be convinced that we can actually create value if we're doing it, buying an asset. So back on the Pilbara, not to bore you. But in the short run, new steelmaking technologies are not going to be around. There's going to be some years before we develop sort of green steel, et cetera. And that means high-grade feedstocks, potentially DRI, even more scrapped BOS. Obviously, you're doing Simandou, which is high grade. But what longer term, what do you think is -- what will be the changes in the Pilbara with higher ore grades. Paul, you were slightly hard to hear so let me quickly repeat it for Jakob and Peter. Higher grading the ore streams into that, how do you -- we're doing Simandou, which is higher ore grade. So let's just -- first of all, we, as Rio Tinto, are uniquely placed because we will soon be extracting iron ore on 3 continents. And you forgot to mention IOC, which is very, very high quality. And we have Pilbara, which is high quality, but you're right, not as high grade as the 2 others. Having said that, look at the expansions we're doing, Western Range is attractive. And then on top of that, there is a lot of R&D happening. But having said that, the world is not going to change away from blast furnace from 1 year to another. So this is -- I think I've said in my speech earlier, it's a multi-decade development. Just 1 question on, I suppose, the Pilbara. In the Investor Day and also today, there was a discussion around being a best operator as the goal. However, if we look across the Pilbara, Rio has higher relative unit cost and sustaining CapEx despite being larger scale. I think there are different perspectives around what is best operators because, first of all, what we needed to do was to stabilize operations and stabilize our production as -- well, that's pretty evident. But we have done much, much more in terms of a period of time now investing more in sustaining CapEx, seeing that those money are being spent well, improving maintenance. And I have to tell you, this Safe Production System, Peter spoke a lot about it, is I'm super, super excited about it. Actually, you have to go from mine to mine and meet the teams and find out how you're actually working things here, how are you addressing things. It is kicking in, but you just have to be a little bit patient. If certainly I become too impatient, we will not get the full value out of it. They're super people, they all want to achieve. And obviously, right now, there's enormous inflationary pressure. But the more successful we are in terms of removing idle work, irritants, et cetera, being more productive, the less requirements we have to people and there are very few people available there. But I would say to you, it was a bit of a bet when I, 2 years ago stated this about being best operator. But particularly here in the fourth quarter and early this year, where at my site visits, I think I see the data points that gives me confidence that we are on the right track on the journey. And I think I said in the presentation today, we have the best ahead of us. Next one here in the room, Robert -- Richard, sorry. First question, Slide 20, your production guidance is based on 2020 technical report. And also comfort around fiscal terms, say -- sorry, not fiscal terms, comfort around the intercompany lane. So the intercompany lane must be sitting about $9 million, $9.5 billion, LIBOR plus 6.5%, so compounding at about $1 billion a year. So Bold, I have the same questions for you. Now, look, I think I could be as comfortable in predicting the future with certainty. And yes, I mean, I think at the moment, we have a great relationship with the government. And I think we just have to be absolutely honest about that because I think we need to look at and how we have the best technological data sensors and, et cetera, but it's going to be an evolution. And certainly, we have the best team and capabilities looking at it, but we'll be transparent with you as things develop. And at the moment, we're very comfortable with partnering with the government and, obviously, our stakeholders here. Look, it's a very good question. It's a very difficult question. We had a setback in 2019, as you will recall. I'm absolutely convinced that we learned big time from it, and I am very impressed with the teams that are working on it. There are real risks here, but I feel that they're really on top of it. And the better we perform in the mine, the better we can also find good solutions with the government. Obviously, the last thing we want to do is to disappoint the government. Sorry, Richard, just one second. I mean, it's obviously crept up a little bit, $4 billion. I mean, I think the policy has been well set. I mean I think last year, when you look at it, it was still a very strong year for us financially. So when you look at the EBITDA and what we produce and $9 billion free cash flow, we're actually paying out 8 of that in the dividend. So I think that's reflective of the overall approach we're really adopting here is by looking in and around at all the metrics, looking at the market and taking that sort of broad view. So we're very, very comfortable that 60% was the right payout on this year's results. I think when it comes to net debt, I mean, again, having a strong balance sheet gives you so much flexibility. When you think of the cyclicality of this industry, it allows you just to keep investing through it and to keep giving returns to shareholders and to take opportunistically -- take opportunities when they come up. And that's why having that strong balance sheet really makes, I think, such good sense to us. We're very comfortable having a bit of cash on the balance sheet when markets were so, so strong, very comfortable at the 4.2%. I think at the moment, I think we're very comfortable what the track record we've got, but you don't know what the future looks like. It's a very difficult question. That actually, take the guidance of this year, is indicating that it will be growing. And so far, it looks very encouraging. But on the other hand, just paying extra dividend cannot be an end in itself. It's an amazing company, and we have opportunities to get it to grow in the right order, and we should do so because that is actually in the interest of the shareholders. Sorry, boring question on CO2 emissions, Scope 1, 2 has reduced. Scope 3 has increased, I think, as from 553 million to 583 million tonnes. Look, Scope 3 is only going to be more and more important, and I would say we can still do much, much more. It's not that enormous for us, but we need to manage our suppliers very well. Another area that's quite significant, 8 million tonnes of CO2, is our logistics. And even though Scope 3, I feel that we can influence that and we must do more and do a better job on that front. And then the real big thing, of course, is the downstream, and that's kind of an influencing role. But frankly, the steel industry is just asking to join up with us and trying together to find solutions. So I would not be surprised if you see -- the only point is, of course, many of these things will have an impact 5 or 10 years from now. But it's actually happening now with the technology development, et cetera. But I do think that when we stand here next year, we need to be much more tangible on Scope 3. Thank you, everybody, so much for joining here. Thank you, everybody in Australia for staying up somewhat later in the office. Clearly, Bold is looking forward to welcoming some of you on-site during this year. If you don't join us there, then we'll see you at the half year."
}