{
    "symbol": "TNC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 18:12:04",
    "content": " But we are mobilizing resources accordingly and remain focused on what we can control, including: first, stabilizing our supply chain to unlock production, reduce product lead times and address backlog to improve our customer experience; and second, executing on pricing strategies to offset inflation while maintaining strict cost discipline to preserve profitability. Your line is open. Your line is open. We're monitoring it closely, and we'll obviously take advantage of any improvement that we're able to realize either from the broader market or from the many actions we've executed to secure inventory, and better plan with our suppliers, set up duplicate suppliers for some constrained components and localize our supply chain to better serve our local production plant. And when we talk to customers in EMEA, what they tell us is there's a broad-based concern for security and outlook for security in the region -- concerns about inflation, notably around energy prices that have risen dramatically, which has -- and energy prices have both a direct effect in operating their businesses and running their fleets and also an indirect effect as petroleum is a key component in other products and in our business that affects resin prices, for example. Absolutely, and if supply chain -- it's painful to look at a $280 million backlog, $200 million of which is current and think about the kind of year we could be delivering, if we were able to secure the parts to increase production. Your line is open. And on the supply chain components front, I was wondering if you could kind of elaborate on, are you doing assemblies and then having to revisit the production because you're getting to, let's say, 80% to 90% assembled, you're missing one or two components and have to go back to finish the product. It's obviously a less productive way to run the plant, but we've convinced ourselves based on the analysis we've done that not only does it preserve the leverage we get on the productivity we get, on keeping the assembly lines running but also, over time, we're able to put more product out than we would otherwise be able to running the plant in a more normal fashion. So we're really proud of the team's agility to be able to capture that order, deploy the inventory scanning towers and get Sam's Club up and running remains to be seen, whether Sam's Club can realize the return on the investment in terms of the improvement -- their operational improvements that they're targeting, and we're partnering with them to make sure that we can deliver the up time on the equipment to keep the scanning data flowing the way they need to. Your line is open. I know, it sounds like a very short answer, but that's the  we would pull out all the stops, meaning production, we would get it done and fill that customer order because that backlog -- backlog is a positive and negative, and it's painful to have that many customers that want our product and we're unable to deliver to them."
}