{
    "symbol": "MTSI",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-02 13:42:08",
    "content": " I will now turn the call to Mr. Steve Ferranti, MACOMâ\u0080\u0099s Vice President of Strategic Initiatives and Investor Relations. Good morning, and welcome to our call to discuss MACOMâ\u0080\u0099s financial results for the first fiscal quarter of 2023. I would like to remind everyone that our discussion today will contain forward-looking statements, which are subject to certain risks and uncertainties as defined in the Safe Harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. For a more detailed discussion of the risks and uncertainties that could result in those differences, we refer you to MACOMâ\u0080\u0099s filings with the SEC. A reconciliation of GAAP to adjusted non-GAAP results are provided in the companyâ\u0080\u0099s press release and related Form 8-K, which was filed with the SEC today. After that, Jack Kober, our Chief Financial Officer will provide a more in-depth review of our financial results for the first quarter of fiscal 2023. When Jack is finished, I will provide revenue and earnings guidance for our second fiscal quarter, and then we will be happy to take some questions. Our financial performance translated to strong cash flow from operations of $38 million, and we ended the quarter with $595 million in cash and short-term investments on our balance sheet. Overall, our sales team executed well in Q1, albeit in a challenging market environment. On our last earnings call, we highlighted that demand was weakening in our three end markets. Today, I can report that the business environment has not improved. Generally speaking, our major customers in these markets are slowing orders, and they are focused on reducing inventory levels. Beyond our main customers, broadly speaking, demand is also weak. However, one bright spot is that our Industrial and Defense end market continues to perform well, and demand for our products is strong. Additionally, our backlog entering fiscal Q2 remains at historically high levels despite the current softness in bookings. MACOM is positioned to capitalize on a number of secular trends across our end markets related to growing bandwidth needs and increasing data rates, which in turn drive the need for higher power levels and higher frequency transmission signals. We view the diversity of our technologies, products and end markets as an inherent strength of our company, helping to provide financial stability. And finally, the quality of competitiveness of our products released to the market over the past few years is outstanding, and it continues to improve. Industrial and Defense revenue was $77.2 million, down 1.8% sequentially, Telecom was $61.5 million, down 0.8% sequentially and Data Center was $41.5 million up 10.2% sequentially. The sequential growth in Data Center was driven by a combination of increased shipments of our Crosspoint switches and networking products, both of which had been supply constrained during much of FY2022, along with a modest increase in our high performance analog portfolio. While we see softness in current large production programs, we remain engaged in a wide range of exciting new opportunities, which we believe will drive MACOMâ\u0080\u0099s future success. Our diode team continues to be a leader in the market for discrete control products in diode circuits, including high power switching and high power limiters. Our high performance analog, or HPA team, continues to diversify their revenue and has successfully penetrated a Tier 1 U.S. defense OEM with custom IC design wins. Specifically, our MMIC team has won close to $10 million in development contracts across a wide range of customers, functions and solutions. Our metro long haul design team is supporting data center customers that are designing next-generation coherent light or ZR light systems, and we have won an 8x 200G driver in TIA socket to support a major U.S. Internet service provider with production ramping this fiscal year. Most of these wins are coming from new products, and we believe a portion of our future growth will come from our most recently introduced products, which everyone knows takes time to ramp up. As an example, we are excited to be sampling our new 10G XGS PON laser and customers have confirmed the product meets their system requirements. And while today, we have no laser sales in the 10G XGS PON, we expect that to change over the next 12 months. In addition, our Lightwave team continues to successfully engage with customers on 25G DFB design wins. More and more of our customers are completing their requisite 5,000-hour module HTL  qualifications, which is required by the ISP or network end users. First, our engineers, sales and applications team will be attending the Optical Fiber Conference, or OFC, in March, where we will be highlighting our latest products to our customers in hosting eight live product demonstrations at our booth, including we will demonstrate a 200G per lane solution to support 1.6 terabit OSFP module designs. Our innovative chipset has been designed to support broad dynamic ranges, linear equalization and low noise amplification to enable direct connection to switch and server ASICs. This solution represents industry-leading low power, low latency solutions for 100G per lane optical communications. As previously announced, approximately two years ago, we established a company priority to transfer a 0.14 micron GaN on silicon carbide MMIC process from the Air Force Research Labs to our wafer fab in Massachusetts with the goal to commercialize the technology and make products for our aerospace, defense and commercial customers. In parallel with the transfer activities, our IC design engineers have been designing products on the process and we will begin introducing these products later this month. Our flagship mimic product from this process, which is available for sampling in sale today is the MAPCMP003, a Ka-band power amplifier designed for satellite uplink applications. This MMIC amplifier provides 10 watts of output power and delivers power-added efficiency or PAE performance, which is comparable with the best products in the market today. This process will support MMICs that operate up to about 40 gigahertz including power amplifiers, low noise amplifiers, high-power switches and transmit receive ICs as well as beam-forming ICs. As you may have seen in a press release issued earlier today, I am pleased to announce MACOM has entered into a definitive agreement to acquire the assets and operations of OMMIC SAS, a semiconductor manufacturer located near Paris, France. OMMIC has a 40-plus-year heritage in three, five materials and specializes in gallium arsenide and gallium nitride, epitaxy, wafer processing and integrated circuit design. The OMMIC team comprises of approximately 100 employees, including process engineers, skilled IC designers and technicians and wafer production staff. Today, the company has a small portfolio of differentiated products and compelling compound semiconductor processes suitable for microwave and millimeter wave applications in telecommunications, aerospace and defense. First, OMMICâ\u0080\u0099s high-frequency processes and products expand and strengthen MACOMâ\u0080\u0099s portfolio so we can better address our target markets. OMMICâ\u0080\u0099s team have spent years developing and refining their proprietary 100-nanometer and 16-nanometer MMIC processes, and we plan to build upon their expertise. Today, they offer very high-frequency products including true time delay, radar core chips, high-power amplifiers as well as low-noise amplifiers that have industry-leading performance. Simply put, OMMIC produces products that typically operate at higher frequencies than MACOMâ\u0080\u0099s. Second, OMMICs material and epitaxial growth expertise is world-class, and we believe strengthening our material science expertise in epi growth knowledge and manufacturing capabilities is strategic, increasing our in-sourcing of epi growth across our entire business has the potential to simplify our supply chain, increase our gross margins on certain products and improve our productsâ\u0080\u0099 performance all of which improve our competitive advantage. Third, OMMIC represents a significant revenue growth opportunity. Historically, OMMIC has serviced a small customer base, many of whom were foundry customers. Fourth, we see an opportunity to fully utilize their idle 6-inch wafer manufacturing capability to improve gross margins and profitability on both OMMIC and MACOM products. Today, OMMIC runs all production on their 3-inch line and notably, MACOMâ\u0080\u0099s Massachusetts fab is a 4-inch fab. And finally, this acquisition significantly expands MACOMâ\u0080\u0099s European presence, which will enable us to better serve European-based customers, which is a strategic focus for us. Having an engineering and manufacturing operation inside the EU will enable us to better access a wide range of customers in aerospace, telecommunications, industrial and automotive markets. The purchase includes OMMICâ\u0080\u0099s existing business operations, intellectual property, real estate and facilities. However, I would like to highlight that the transaction is subject to regulatory approvals and customary closing conditions. Revenue for the first quarter was $180.1 million, up 1% quarter-over-quarter. On a geographic basis, sales to domestic U.S. customers represented approximately 49% of our fiscal Q1 results compared to 50% in the fourth fiscal quarter of 2022. And as Steve highlighted, focusing on growing revenue in this region is a strategic priority for us. Adjusted gross profit was $112.7 million, or 62.6% of revenue flat sequentially. As weâ\u0080\u0099ve discussed in the past, MACOM utilizes a flexible manufacturing model leveraging our Lowell and Ann Arbor fabs, as well as third-party foundries. Total operating expenses were down sequentially by $600,000 from fiscal Q4 2022 due to slightly lower R&D expenses. Adjusted operating income in fiscal Q1 was $58.8 million, up from $56.9 million in fiscal Q4. Over the longer term, we see leverage in our operating model as we introduce new products and they contribute to future revenue growth. Trailing 12 months, adjusted EBITDA was $244.7 million as compared to $234.8 million in Q4 fiscal 2022. Adjusted net interest income for fiscal Q1 was $1 million, up from $40,000 in fiscal Q4. Our cash tax payments were $300,000 for the first quarter, down slightly from fiscal Q4 2022. Adjusted earnings per fully diluted share was $0.81, utilizing a share count of 71.4 million shares compared to $0.77 of adjusted earnings per share in fiscal Q4. Our Q1 accounts receivable balance was $112 million, up from $101.6 million in fiscal Q4. Inventories were $121.3 million at quarter end, up by $6.4 million sequentially. Inventory turns were 2.2 times in Q1, down slightly on a sequential basis from 2.3 times in the prior quarter. The quality of our inventory remained strong and based on lower customer orders and shortening lead times, we expect to reduce our net inventory balance as we progress through fiscal year 2023. As weâ\u0080\u0099ve noted on our prior call, we experienced a sizable increase in cash flow from operations during our September quarter due to the timing of working capital items and our current fiscal Q1 figure represents a moderated operating cash flow level. Capital expenditures totaled $9.6 million for fiscal Q1, up from $7.7 million in the prior quarter. As weâ\u0080\u0099ve done in the past, we will continue to carefully manage our capital spending, balancing investments in new technologies, process development capabilities and efficiency programs with the overall profitability of the business. In addition to pursuing CHIPS Act funding, I would also like to highlight that we expect the CHIPS Act to provide an advanced manufacturing investment tax credit of 25% for certain of our capital expenditures placed into service after January 1, 2023. This tax credit will apply to certain qualifying capital items, and we do not expect the associated cash from these credits to be received until fiscal year 2024. And as such, we do not anticipate this tax credit to have a material impact on our financials for fiscal year 2023. Cash, cash equivalents and short-term investments for the fiscal first quarter were $594.7 million, up from $586.5 million in fiscal Q4 2022. Our first quarter gross leverage is down to less than 2.5, and our net debt is now less than $10 million. I would also like to highlight that during the quarter, the MACOM team has engaged in our annual stockholder outreach to better understand and discuss governance items with our top stockholders as we approach our annual meeting on March 2, 2023. First, our Q2 guidance includes plans to manage our discretionary spending down by approximately 10%, including reduced variable compensation, outside service fees and supplies expense to name a few. Through these efforts, we expect to support healthy margins and remain cash flow positive over the course of these business cycles. Second, MACOM is excited to acquire OMMICâ\u0080\u0099s valuable European-based operation. Itâ\u0080\u0099s new and differentiated technology, as well as a dedicated and talented workforce at what we believe to be a favorable valuation. In the short term from a financial perspective, OMMIC should not have a meaningful impact on our revenue or EPS. However, longer term as we invest in the business, we expect that it will provide growth and profitability opportunities, which will drive additional stockholder value. I look forward to 2023 and the continued investments MACOM plans to make in our people, plant and processes, and also to welcome the OMMIC team to MACOM. MACOM expects revenue in fiscal Q2 ending March 31, 2023 to be in the range of $166 million to $170 million. In Q2, we expect our sequential Industrial and Defense and Data Center revenues to be down slightly in the balance coming from weakness in our Telecommunications business. Our product portfolio is stronger than it was one year ago, and we are confident we can meet or exceed our targets. Your line is open. I guess as we look into the first part of 2023, obviously, youâ\u0080\u0099re guiding down for March on weakness and demand and some inventory correction. We believe I&D, Industrial and Defense, will continue to grow during the course of the year. As everybody knows, we had a very, very strong FY 2022 with 30% growth. As I mentioned on my prepared remarks, 5G and the broadband markets are weak at the moment, and itâ\u0080\u0099s difficult for us to understand when those might turn. And the other point Iâ\u0080\u0099ll make is generally speaking, there is a macro overhang on many of the â\u0080\u0093 our markets. And then I guess, either for Steve or Jack, I guess as you look at the OMMIC acquisition, it sounds like they maintained manufacturing operations with the fixed expense of operating the three-inch fab plus having an idle six-inch fab. And so our plan is as we talked about to not only build out the product line, market the product line globally, but also begin to migrate their products to the six-inch line. And in doing all of that, we think that the business has tremendous potential for growth. This is the first acquisition that the MACOM, new management team has done. So thatâ\u0080\u0099s â\u0080\u0093 they are further along in developing and producing those products, which would take MACOM years to do. These products will have high margins, high ASPs, and will be targeting medium to â\u0080\u0093 small to medium niches. And when we look at the market opportunity, we size that to be about a $100 million SAM. So our goal is to take this business today that arguably is hovering just below breakeven, and we want to drive it to be a growing profitable part of our business. That will take time, but we think when weâ\u0080\u0099re successful, we will be in a leadership position at the millimeter wave frequencies. Your line is open. Thanks for taking my question. So, when I look out into the year, youâ\u0080\u0099re talking about relative strength in the Industrial and Defense business. And then secondly, as you look into the out quarter, clear, thereâ\u0080\u0099s a big reduction in OpEx to kind of get to the midpoint of your guide. So Iâ\u0080\u0099ll take the first part of that question, then Jack can handle the second piece. As you know, last year for MACOM, Industrial and Defense was a record year. And I believe Q4 may have even been Q4 FY 2022 was a record quarter, and weâ\u0080\u0099re seeing continued opportunities to grow. Most of this is coming from gaining market share not only in Defense, but also Industrial. And weâ\u0080\u0099ve talked over the last year or two that we believed over the long term, I&D would continue to be a strong end market for us. In terms of the industrial ordering pattern, I think there are pockets of weakness for sure. As we mentioned in the script, we focus very much on short-term financial performance as well as long-term financial performance. And the team here at MACOM has done a super jaw dealing with that day when Huawei went on the entity list, when we had to deal with COVID shutdowns. Yes, and I guess just to build upon that, and then to address your question spending, Tom, itâ\u0080\u0099s really maintaining that continuous improvement and maintaining the profitability of the business. I touched upon a couple of things in my prepared remarks, including outside services and variable compensation and things like supplies. But thereâ\u0080\u0099s a number of different things that weâ\u0080\u0099re doing across the organization obviously, with our top line coming down a bit. And I think one other thing is weâ\u0080\u0099ve looked at the business, weâ\u0080\u0099re continually looking to assess the way the organization comes together. Your line is open. Thanks for taking my question. With regard to the China revenues, I think we had mentioned that China represented 23% of our total revenue compared to 26% back in Q4 and for our full fiscal year. We see a lot of growth opportunities, not only with our high performance analog products, our laser and light wave products but also a lot of the RF and microwave components that we sell into the industrial markets there. And then since you brought up the issue of geography, I just wanted to sort of highlight again that we believe that thereâ\u0080\u0099s tremendous growth opportunities in Europe in setting up a manufacturing facility and a wafer fab in the backyard of some major OEMs inside of the European Union will help us take our European-based revenue, which is about 6% up into the double digits. On past calls, I believe you mentioned a $1 billion revenue target. Well, weâ\u0080\u0099re not changing the target of $1 billion. And so I would suspect in the July and August time frame when we complete that cycle, weâ\u0080\u0099ll be evaluating where we think weâ\u0080\u0099ll be in fiscal 2025 and fiscal 2026. But itâ\u0080\u0099s fair to â\u0080\u0093 I think, to your point, itâ\u0080\u0099s fair to assume that the environments are providing a headwind, which one would conclude would push that out in time. Your line is open. They were steadily going up for a while and now for the last couple of quarters, youâ\u0080\u0099ve been kind of stuck in the 62%, 62.5% kind of range. Examples would be the entire OMMIC portfolio where these are the highest frequency products in the market, leading cutting-edge performance. Second, our 140-nanometer GaN process that we just announced, as we talked about, thatâ\u0080\u0099s a $300 million SAM that weâ\u0080\u0099ll be addressing. And just to add to that, Harsh, in terms of our gross margins as we work before, weâ\u0080\u0099ve been pleased with some of the progress weâ\u0080\u0099ve made over the past number of quarters. I think if you look back over, I think, itâ\u0080\u0099s seven or eight quarters, weâ\u0080\u0099ve been above that 60% number and have made sequential improvements. And with our flexible manufacturing model that we have with certain of our products being fab internally and certain of them also going out to third parties, that provides us with some protection over the varying different business cycles that allows us to ramp as well. From a gross margin point of view, from as we look at our operations and all the contributions that the teams have been making over the past couple of years, we feel like weâ\u0080\u0099re in a much stronger place and those improvements that weâ\u0080\u0099ve made will continue as we go forward. So I wanted to understand if maybe itâ\u0080\u0099s a function of the growth you had last year or youâ\u0080\u0099re actually starting to see some issues with one or two customers or if itâ\u0080\u0099s broader based than that, where maybe we should put our blinders on and start focusing on that area as something of interest, but just curious if you could provide some more color around that. And I think it really comes down to MACOM specific industrial business, which may be different than some of the bellwethers that service that industry with microcontrollers or large ASICs. So I would say that those markets have been performing well for MACOM, and we expect that to continue. Your line is open. I wanted to ask, maybe first just kind of about China and some of the demand, and there was a question on this earlier, but thinking more about the demand environment as we head into the second quarter, maybe into the back half of the year, it feels like the freedom of movement there. And once we kind of get through some of this COVID impact, that feels like a market that could rebound fairly quickly. But with that said, we are taking probably a little bit more of a conservative view just coming off of Chinese New Year. We have been monitoring the inventory levels within the channel in China, and weâ\u0080\u0099re seeing some positive trends there. But quite frankly, we think itâ\u0080\u0099s way too early to call which way China is going to go over the next three months to six months. But also when China really starts to open up and we can send more and more of our staff into China to engage with customers, we think that will be the activity that really ignites better growth and stronger revenue for MACOM. Today, MACOM has about just under 100 employees in China. These are typically sales and application centers that are visiting customers, and theyâ\u0080\u0099ve been doing a great job keeping MACOM in front of customers, but we also feel like we need to rotate our business development folks and application engineers and to drive that growth. So if that happens towards the middle of the calendar year, we think good things will fall from that. So weâ\u0080\u0099re just kind of color there would be helpful, I think. Outside of that, I would say, generally speaking, the short-reach, NRZ platforms that weâ\u0080\u0099re on, whether itâ\u0080\u0099s AOCs, like SR4 AOCs or CWDM4, these markets or these applications have been relatively weak. So for example, weâ\u0080\u0099re seeing reasonable growth in DR1 and SR4 for PAM4 applications. It really depends on the customer, where weâ\u0080\u0099re positioned at that customer. For example, we had a very large platform we were in last year, a DR4 application that we know that revenue wonâ\u0080\u0099t be in our forecast of this year. And then the last thing Iâ\u0080\u0099ll point out is that we do feel like, in general, there is a significant amount of inventory at our customers and at our customersâ\u0080\u0099 customers. And so this will also provide a bit of a headwind for a lot of our electronic devices, CDRs, drivers, TIAs, things of that nature. Your line is open. Steve, I was hoping you could talk a little bit more about OMMIC and where the revenues are today. So I just want to be a little careful about talking too specifically about their business, given we havenâ\u0080\u0099t closed the deal yet. And what youâ\u0080\u0099ll see based on that public information is really a blend of satellite manufacturers, some North American and European defense OEMs. So because theyâ\u0080\u0099ve been operating on a 3-inch line, they have typically been targeting satellites, satellite manufacturers as well as defense applications. And so as we think about the business in the future, we want to bring them into the high-volume commercial worlds, including many different markets that MACOM today is already in, but not at the higher frequencies. Generally speaking, theyâ\u0080\u0099re in satellite and defense applications today. Last quarter, I believe it was 10% â\u0080\u0093 or the quarter before Q1. We think this is coming from the fact that lead times are coming down, cycle times are coming down. Many customers are now waiting and buying, knowing that suppliers like MACOM have inventory. So weâ\u0080\u0099re on the other side of that curve where people are not placing long lead orders, theyâ\u0080\u0099re actually returning to, letâ\u0080\u0099s say, a more normal dynamic in performance. I would say that weâ\u0080\u0099re following the same methodology that we have in the past in terms of looking at our backlog, making assumptions on what we think will book and ship within the quarter. So â\u0080\u0093 but we are seeing that trend of book-to-bill increase, and we think thatâ\u0080\u0099s a good thing. And Iâ\u0080\u0099ll just highlight that one â\u0080\u0093 I think an important point here, which is we had a tremendous booking performance last fiscal year. And everybody knows in Q4, we had a book-to-bill of 1 and then last quarter, 0.9. Our top 10 is about 30% of our total revenue and no big 10% customers, and no one product is more than 2% of our revenue. Your line is open. But if you could just maybe scale initial expectations in terms of time to revenue and then sort of ramp into that opportunity, that would be helpful. So that $300 million SAM that weâ\u0080\u0099re identifying is primarily defense-related, aerospace and defense, as well as maybe the second key market we want to address is satellite communications, whether itâ\u0080\u0099s uplink, downlink or satellite to satellite. As I think about this year and we do some modeling so weâ\u0080\u0099re just announcing today, weâ\u0080\u0099re starting to sample this month. And in terms of what those numbers might be, I think itâ\u0080\u0099s way too early to tell. It sounds like 2023 is going to be a difficult year, but one of your peers had commented that the GaN transition in RF power specifically was maybe accelerating and gaining more traction over LDMOS. If thatâ\u0080\u0099s true, then that would certainly support MACOM strategy, we, today do not sell LDMOS. So to the extent that different market segments are focusing on again, I would consider that a good thing for MACOM. I would also highlight that when we look at the overall GaN opportunity, you have the commercial and communications sector and you have industrial and defense. And we believe that those markets are about equal in size, but the profit is on the defense side of the line, and we are very focused on that. Your line is open. So the manufacturing cycle, the test time, the back end time, all of these are very different across the portfolio and our customers know that. So depending on where weâ\u0080\u0099re selling our products, our customers have very different ordering patterns. And so when we think about normalized â\u0080\u0093 a normalized environment, I just think itâ\u0080\u0099s hard to parse that here. So weâ\u0080\u0099re making assumptions based on a bottoms-up sales forecast where we identify customers and programs and part numbers and in speaking with customers, getting an understanding of their future demands. And so when we talk about the fiscal year, we â\u0080\u0093 thatâ\u0080\u0099s the data weâ\u0080\u0099re looking at, not specifically in only our backlog. And so as you go out in time, as you can imagine, thereâ\u0080\u0099s more risk, and thatâ\u0080\u0099s one of the reasons why we generally donâ\u0080\u0099t give full year guidance. Clearly, in this environment, I think it would be even more difficult to give full year guidance. Your line is open. Maybe one digging into the telecom side of the business, Steve, Iâ\u0080\u0099m checking my notes, and hopefully, I got them correctly here, calling out the areas of weakness here with 5G and broadband. And then within those two weaker segments, 5G and broadband, are you seeing different dynamics here either by differences in customer activity levels of inventory or expectations of when those businesses return to more normal patterns. And then when we look at the weakness in 5G and broadband, there are very different dynamics there, very different markets, particularly in broadband, we have large CATV customers that we believe have a significant amount of inventory, and thatâ\u0080\u0099s really the back story with broadband. And then on 5G, we think thereâ\u0080\u0099s inventory burn down from our major customers primarily on the RF side, so front end â\u0080\u0093 things like front end modules or amplifiers. And then following up on the topic of OpEx, I may have missed the kind of team here, but you talked about some reductions here going into the March quarter here. There is some of that in there in our guide going into Q1, but itâ\u0080\u0099s more on the discretionary side as you look to what weâ\u0080\u0099re doing from an OpEx standpoint. But amongst all the things that we do here, we want to make sure weâ\u0080\u0099re maintaining an appropriate level of profitability. In closing, I would like to thank our employees for their contributions this past quarter."
}