{
    "symbol": "NSSC",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-07 15:42:09",
    "content": " These forward-looking statements include, without limitation, statements relating to growth drivers of the company's business, such as school security products and recurring revenue services, potential market opportunities, the benefits of our recurring revenue products to customers and dealers, our ability to control expenses and costs and expected annual run rate for SaaS recurring monthly revenue. Recurring monthly revenue continued its strong growth increasing 35% in Q1 to $13.8 million, compared to $10.2 million for the same period last year. Gross profit for the three months ended September 30, 2022, increased 35% to $18.2 million with a gross margin of 46%, as compared to $13.5 million with a gross margin of 43% for the same period a year ago. Another key factor in the increases in gross profit and gross margins is the 200 basis point increase in gross margin on service revenues, now 88%, which was primarily due to the continued increase in service revenues relating to the company's fire radios, which have higher monthly selling prices than the company's intrusion radios. So, we're going to be showing our Air Access, which is our product, which will get us recurring revenue from the Access division of our company, as well as the locking division, and we expect to have â\u0080\u0093 the show is going to have thousands of dealers coming from all over the Northeast to the show and we've gotten the most requests to come to the seminar ever in our history of our company. So, we have a great engineering team here and we have a lot of very exciting products on tap to create more volume for us and more recurring revenue, but they're taking a little bit of a back seat right now because of the fact that we're having the engineering departments keeping the lines going with the rejiggering of the circuit boards and the housings and things like that, so we can keep a steady flow of finished goods. Pricing is very important, but in our business just make top quality that the dealers can put in and continue to get their recurring revenue and their â\u0080\u0093 and have no maintenance or things have no maintenance per se to talk about makes a big difference to the dealers and that's why they are utilizing of products and that's what we're picking up the share."
}