{
    "symbol": "RGTI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 22:50:21",
    "content": " Today, we are seeing growing interest in demand for partnerships and engagements centered on our cloud services business model, typically coming with a degree of auxiliary services around pursuing quantum advantage, identifying use cases with those customers and partners, and working jointly with them over quarters or years to drive towards quantum advantage and getting those use cases into production. And on that new system that -- the 84 qubit single chip, that's impressive result, just kind of given where you are they got the multi-chip for the 80, and you've got an 84 bit single system and then of course, you're going to put forward those together for the next system. When we combine that with our core architecture of emphasizing hybrid quantum classical computing, in all aspects of the technology as well as our cloud services business model, that lends our platform and our approach to specific advantages, we believe in the area of quantum machine learning. As we work towards that, you're going to see quantum advantage merge on an application-by-application basis, it's not going to happen all at once, within a single industry or within -- it's not going to happen at the same time, necessarily, but quantum machine learning is a key area where we are advancing our focus. And as we drive towards the interim milestones discussed on the call here, the 84 qubit single chip next year, and then the 336 qubit single chip, we're going to continue to build out the production what we refer to as the production QBUs or production QBU infrastructure to best meet the demands of our customers in the market as the cloud services business matures. We anticipate in our targeting substantial improvements in fidelity and connectivity on that platform, and being able to put all those pieces together with our scaling technology and the 336 qubit system later in 2023 is we believe they're going to represent a really substantial step forward for the technology in a good way to track progress towards the longer term goals of 1,000 to 4,000 Q."
}