{
    "symbol": "V",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-27 20:39:02",
    "content": " In constant dollars, Global Payments volume was up 20% year-over-year and 26% versus 2019, each accelerating 3 to 5 points versus the last quarter, led by continued strength in debit as well as improving credit spending. Excluding China, total payments volume growth was 22% or 31% higher than 2019 and a 4 to 5-point acceleration from the fourth quarter. International constant dollar payments volume, excluding China, grew 22% and was 29% about 2019, improving 7 points from the fourth quarter. A few regional highlights: Latin America was up 44% year-over-year and 66% about 2019, accelerating 8 points from the fourth quarter with robust performance across the region, fueled by cash digitization and client wins. Global process transactions were up 21% year-over-year and 26% over 2019, 2 points better than the fourth quarter, accelerating less than overall volume growth due to higher ticket sizes. Constant dollar cross-border volume, excluding transactions within Europe, was up 51% year-over-year and was 1% above 2019 volumes, a 15-point improvement from the fourth quarter. Cross-border card-not-present volume growth, excluding travel, continued to strengthen, up 26% year-over-year and 50% above 2019, 7 points higher than the fourth quarter as consumer engagement continues to grow. Cross-border travel-related spending, excluding intra-Europe, grew 102% year-over-year and was 72% of 2019 levels, improving an extraordinary 14 points from the fourth quarter to the first quarter. Service revenues grew 19%, slightly better than the 18% nominal growth in Q4 payments volume, helped by increased utilization of card benefits and small pricing modifications. Processed transactions grew 17% year-over-year, up 37% versus 2019, lagging volume growth due to larger ticket sizes. Incentives should grow at a similar rate as the first quarter, which as a percent of gross revenues will likely be in the 25.5% to 26.5% range based on volumes, renewal activity and cross-border performance. First, an acceleration away from cash and check for merchant payments both domestic and cross-border as digitization becomes pervasive across consumers and businesses globally; second, acceleration of cash, check and wire transfer displacement as our new flows initiatives penetrate a broad range of new use cases with very large total addressable markets; third, sustainable high-teens growth across our value-added services, both from existing services and new offerings. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}