{
    "symbol": "FOUR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 16:05:19",
    "content": " Consistent with our commentary from last quarter, we're not breaking out volumes or spreads between our new verticals, including our strategic enterprise relationship and our high-growth core due to confidentiality and competitive sensitivity with certain strategic customers. In the fourth quarter, we delivered record results and ended the year exceeding the top end of our previously provided guidance ranges for volume, gross revenue less network fees, and adjusted EBITDA, and we also meaningfully exceeded our adjusted free cash flow guidance. When you think about The Giving Block, I mean, right now, the overwhelming majority of the revenue that we take in from non-profits is coming from major non-profit brands like St. Jude and others that are giving us traditional card payment volume and many of which we were able to solicit from the 2,200 or so existing Giving Block customers with respect to the European PSP, we bought that asset to put volumes that we knew we had already with respect to some of our strategic customers into the European market. But actually, it also kind of matches off of the Investor Day we had in November of 2021, where we basically told our investors that we're moving -- we're diversifying from outside of just restaurants and hotels into all these exciting new verticals, gaming, non-profit, sports entertainment, they were all e-commerce, international, they were all anchored off of like a significant merchant that was going to give us more than a foot in the door within those specific verticals. And when I look at Shift4 and kind of the history of Shift4, I think there was some discipline but the opportunity here without really cutting into any kind of muscle or really, I would say we're just at like a very first layer of fat level and just really putting better process in place that will generate a lot of that margin expansion from here forward that you're looking at."
}