{
    "symbol": "FOUR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 13:06:07",
    "content": " As mentioned, our results benefited from continued strength in our high growth core, as well as a more meaningful contribution from new verticals, which includes Sports & Entertainment, Gaming and Sexy Tech. As a reminder, our previously provided guidance â\u0080\u0093 volume guidance for this year assumed a modest recovery in international and business travel, and 3 billion of contribution from the new verticals such as non-profits, gaming, and our strategic merchant relationship, as well as sports & and entertainment venues. Next, I mean, you've seen new vertical growth each quarter, but for sure, I mean, this was a quarter with a big contribution from our new verticals kicking in, which is great because that is, as I mentioned in our prepared remarks, it's moderating what would otherwise be a seasonal low kicking in from your restaurant hospitality customers. So, high growth core, I mean, we're really lucky it is rather easy to continue to add and refresh new software integrations within high growth because I mean, we have a lot of share of the verticals we serve within high growth core. So, declaring a year ago at our Analyst Day, hey, we want to move into non-profits because there's a $450 billion payment opportunity there and it's â\u0080\u0093 they use tons of different software that doesn't talk to each other and this is like, kind of what we do really well within the hospitality vertical. So, I'd say, like, in general, integrated payments is hard, and we are fortunate to be advantaged within our high growth core and we're making awesome progress, thanks to some signature wins, anchored customers, and new verticals that's helping us grow. And we haven't broken that down on a volume basis just because it's pretty idiosyncratic with regard to the contribution of enterprise relationships in the volume versus SMB, but all of it is on our list and we've had conversations with a portion, and I think it will feed kind of the growth whether it's end-to-end volume revenue and or both for years ahead as Jared mentioned."
}