{
    "symbol": "FOUR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 13:44:17",
    "content": " We believe that the Gateway Sunset strategy and early indicators for SkyTab and new verticals warrant a modest increase in our gross revenue less network fee outlook and are increasing our guidance range to $690 million to $710 million, up from $675 million to $705 million previously. The lift from -- the gross profit lift from that gateway customer moving to end to end is what's going to enable us to grow even if certain economic circumstances were to change this year, which is completely consistent with how we were able to grow during the pandemic when every one of our end markets was incredibly depressed and we still grew end to end payment volume by double digits. So I guess I'm saying -- in terms of that $3 million -- $3 billion bridge in new verticals and certainly whenever they represent going into 2023, Allegiant is a nice part of it so as everything else, like they're all really beginning to fire. Andrew, your line is now open. Thanks\n I'm just going to beat the same drum which is that, we continue to grow into larger and larger merchants and so this is something that the degradation of blended spread is something that our investors should continue to expect a little bit delayed in part because I think we were slower in the new verticals than we'd hope to be in the first half of the year. We've started to get RFPs for surprising customers and it's surprising that I don't think a year or two years ago that I ever would have imagine we'd be able to compete for some of those brands, also not surprising in that without us in the mi they really only had two companies or so to send it to. Andrew, your line is now open. So recognizing that we didn't bet on a refresh cycle and stadiums that eventually they're going to -- stadiums are going to move from a micro system or an agility system this into Shift4, it was no, we've got to get in there with a mobile application that's going to do all of this and like really pivot away from kind of a prior generation of tech."
}