{
    "symbol": "TDG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-10 21:22:16",
    "content": " In our business, we saw another quarter of sequential improvement in our total commercial aftermarket revenues and bookings with both up approximately 10% over Q1 of fiscal 2022. We continue to expect COVID-19 to have an adverse impact on our financial results, compared to pre-pandemic levels throughout the remainder of fiscal 2022 under the assumption that both our commercial OEM and aftermarket customer demand will remain depressed due to lower worldwide air travel, although recent positive trends in commercial air traffic could impact us favorably. We expect to continue running free cash flow positive for the balance of our 2022 fiscal year barring any additional capital markets activities such as dividends or share repurchase, our net debt-to-EBITDA ratio will keep ticking down as the year progresses. Yes, I think we don't want to get into given quarterly guidance on defense revenue outlooks, but generally as Jorge mentioned, there were such strengths in the booking and as we look out over the next two quarters that we feel pretty confident that we're going to be able to hold a low single digit range for the year. I don't think we want to get on the quarterly the expectations…\n But with defense bookings up 30%, clearly that's why we're still sticking with what we communicated at the beginning of the year. Mike, I want, maybe just a clarification on the working capital comment you made, the 200 million to 275 million kind of going back in the networking capital, you're saying kind of attracts to commercial markets, so we've seen a big recovery for you. I mean, do you guys think you're outperforming due to having better pricing practices than your peers and there's been some chatter out there I guess from some of your customers that you guys are considering a mid-year price hike, do you think if that's the case, do you think you're seeing some ordering ahead of that price hike, and I don't know if it's called restocking, but maybe airlines customers just trying to trying to get in under that."
}