{
    "symbol": "TDG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-08 14:57:05",
    "content": " After the speakers’ presentation, there will be a question-and-answer session. As a reminder, today's program may be recorded. And now I'd like to introduce your host for today's program, Jaimie Stemen, Director of Investor Relations. Presenting on the call this morning are TransDigm's President and Chief Executive Officer, Kevin Stein; Chief Operating Officer, Jorge Valladares; and Chief Financial Officer, Mike Lisman. Before we begin, the company would like to remind you that the statements made during this call, which are not historical in fact are forward-looking statements. For further information about important factors that would cause actual results to differ materially from those expressed or implied in the forward-looking statements, please refer to the company's latest filings with the SEC available through the Investors section of our website or at sec.gov. The company would also like to advise you that during the course of the call, we will be referring to EBITDA, specifically EBITDA as defined, adjusted net income and adjusted earnings per share, all of which are non-GAAP financial measures. First, I'll start off with the usual quick overview of our strategy and then a few comments about the quarter and a discussion of our fiscal 2022 outlook. To reiterate, we are unique in the industry in both the consistency of our strategy in good and bad times as well as our steady focus on intrinsic shareholder value creation through all phases of the aerospace cycle. About 90% of our net sales are generated by proprietary products and over three quarters of our net sales come from products, which we believe we are the sole source provider. Most of our EBITDA comes from aftermarket revenues, which generally have significantly higher margins and over any extended period have typically provided relative stability in the downturns. Specifically, we own and operate proprietary aerospace businesses with significant aftermarket content. We utilize a simple, well proven, value-based operating methodology. We have a decentralized organization structure and a unique compensation system, closely aligned with shareholders. Next, we acquire businesses that fit this strategy where we see a clear path to PE like returns. And finally, our capital structure and allocation are a key part of our value creation methodology. To do this, we stay focused on both the details of value creation as well as careful allocation of our capital. As you saw from our earnings release, we had a good quarter, considering the market environment. Our Q1 fiscal results show positive growth in comparison to the same period in fiscal 2021 as we are lapping the first quarter of 2021, which was heavily impacted by the pandemic and prior to the widespread availability of vaccines. Although our results have improved, they continue to be unfavorably affected in comparison to pre-pandemic levels as the demand for air travel remains depressed. However, the continued improvement in global air traffic despite emergence of a new COVID-19 variant in late-2021 is encouraging. To date, the recovery has remained primarily driven by domestic leisure travel. Even the travel restrictions reimposed by certain governments during the months of December due to the Omicron variant are now starting to ease, which is again an encouraging sign. In our business, we saw another quarter of sequential improvement in our commercial markets, with total commercial aftermarket revenues up 10% over Q4 of fiscal 2021 and bookings up more than 15% compared to Q4. I am also very pleased that despite the challenging commercial environment, our EBITDA as defined margin was 47.3% in the quarter. Additionally, we continued to generate significant cash in Q1. Next, an update on our capital allocation activities and priorities. We are now at a decision point with regard to our sizable cash balance, which is now approaching $5 billion. When we have a significant amount of cash available, we aim to give that back to the shareholders in one form or another. At this time, we're still in the process of evaluating our capital allocation options with regard to any significant acquisitions, share buybacks and dividends. All three options are on the table each individually, but then also potentially in some combination over the next 12 months. Any significant M&A, share buyback and or dividend activity will still leave the company with substantial liquidity and the financial flexibility to deal with any currently anticipated capital requirements or other opportunities in the readily foreseeable future. Both the M&A and capital markets are always difficult to predict, but especially so in these times. Regarding the current M&A pipeline, we are still actively looking for M&A opportunities that fit our model. We continue to see a pickup in acquisition opportunity activity, but it's still slower than pre-COVID. We have a decent pipeline of possibilities as usual, mostly in the small midsize range. I cannot predict or comment on possible closings, we remain confident that there is a long runway for acquisitions that fit our portfolio. We continue to expect COVID-19 to have an adverse impact on our financial results compared to pre-pandemic levels throughout the remainder of fiscal 2022 under the assumption that both our commercial OEM and aftermarket customer demand will remain depressed due to lower worldwide air travel. To reiterate what we said on the Q4 earnings call, our teams are still planning for our commercial aftermarket revenue to grow in the 20% to 30% range. We expect our commercial OEM revenue to grow significantly as well, but at a rate slightly less than the commercial aftermarket. As you know, we aim to be conservative and would be happy to have both of these end markets rebound more strongly. To reiterate, these are planning assumptions for organizational purposes and not guidance. As for the defense market, we still expect defense revenue growth in the low-single digit percent range from fiscal 2022 versus prior year despite the slow start to the year. Please note that our Q1 EBITDA margin was stronger than anticipated, and we may see less year-over-year margin improvement for Q2 and expect margins to move up throughout the second half of the fiscal year. As a final note, this margin guidance includes the unfavorable headwind of our Cobham acquisition of about 0.5%. As usual, we'll closely watch the aerospace and capital markets as they develop and will react accordingly. I'd like to touch on our DoD IG audit report, which was released in mid-December. As we expected and communicated, the audit scope and results were similar to prior audits. We also disagree with the use of arbitrary standards and analysis, which render many areas of the report inaccurate and misleading. Additionally, at the request of the House Oversight and Reform Committee, we participated in a hearing on January 19 to discuss the results of the audit. Going forward, we will continue to work with the IG, the DLA and any other relevant parties to evaluate the results of this audit. At this time, we are engaged directly with the DLA and do not have any further update on whether or not we expect to pay all or a portion of the $21 million voluntary refund request. Finally, I wanted to announce the retirement of our Vice Chairman, Bob Henderson. He served in a range of roles over his years with TransDigm, including as President of several operating units, Executive Vice President, COO of TransDigm's Airframe Business Group and most recently, Vice Chairman, where he oversaw the integration of the operating units acquired as part of the Esterline transaction. As always, we remain focused on executing our operating strategy and managing our cost structure as we continue on this journey to a full recovery of the commercial aerospace industry. For the remainder of the call, I'll provide color commentary on a pro forma basis compared to the prior year period in 2021. In the commercial market, which typically makes up close to 65% of our revenue, we will split our discussion into OEM and aftermarket. Sequentially, the bookings improved almost 20% compared to Q4. Although we expect demand for our commercial OEM products to continue to be reduced in the short term, we are encouraged by build rates gradually progressing at the commercial OEMs. Growth in commercial aftermarket revenue was primarily driven by increased demand in our passenger submarket, although all of our commercial aftermarket submarkets were up significantly compared to prior year Q1. Sequentially, total commercial aftermarket revenues grew approximately 10% and bookings grew more than 15%. To touch on a few key points of consideration, global revenue passenger miles remained low but continued to modestly improve throughout our Q1. Despite the impact of the Omicron variant, December global revenue passenger miles still improved month-on-month, which demonstrates the strong underlying demand and the willingness of passengers to travel. Domestic air traffic for calendar 2021 was only down 28% compared to pre-pandemic versus international, which was still down 75%. As the commercial aerospace recovery has progressed, the U.S. and Europe have shown strong demand for domestic travel. China has been more volatile due to its Zero COVID policies, which lead to localized lockdowns and rapid drop offs in air travel. Though the pace of the international air traffic recovery has been slow, we are hopeful for improvement in international travel in 2022 as vaccination rates continue to improve globally and many of the government travel restrictions are softening. Commentary from business jet OEMs and operators have been encouraging and these higher levels of business jet activity may be here to stay, though time will tell. Now let me speak about our defense market, which traditionally is at or below 35% of our total revenue. The defense market revenue, which includes both OEM and aftermarket revenues, decreased by approximately 12% in Q1 when compared with the prior year period. As we have said many times, defense sales and bookings can be lumpy. This quarter, Cobham was lapping a very tough prior year comparison as Cobham's defense sales accelerated in fiscal Q1 2021, which was the last quarter prior to TransDigm's ownership. As Kevin mentioned earlier, we continue to expect low single-digit percent range growth in fiscal 2022 for our defense market revenues. Lastly, I'd like to wrap up by stating how pleased I am by our operational performance in this first quarter of fiscal 2022, despite the continued impact of the pandemic. With that, I'd like to turn it over to our Chief Financial Officer, Mike Lisman. First, in regard to profitability for the quarter, EBITDA as defined of about $565 million for Q1 was up 19% versus our prior Q1. Sequentially, EBITDA as defined margin declined slightly by about 200 basis points during Q1 versus Q4 of last fiscal year. As you know, this is typically the case for us given the higher volume levels in Q4 and lower number of working days in our fiscal Q1. Organic growth was 9%, driven by the rebound in our commercial OEM and aftermarket end markets. On taxes, the slightly lower than expected GAAP rate for the quarter was driven by significant tax benefits arising from equity compensation deductions. Barring some deviations in the rates for this first quarter, our tax rate guidance for the full year is unchanged from what we provided on our last earnings call. Free cash flow, which we traditionally defined at TransDigm as EBITDA less cash interest payments, CapEx and cash taxes was roughly $250 million. During Q1, we also paid down our $200 million revolver balance, which was drawn at the onset of COVID in March of 2020 out of an abundance of caution. And barring any additional capital markets activities, this ratio would keep coming down as we proceed through our fiscal '22. From an overall cash liquidity and balance sheet standpoint, we remain in good position and well prepared to withstand the currently depressed but now rebounding commercial environment for quite some time. With that, I'll turn it back to the operator to kick off the Q&A. Myles, sorry, we can't hear you. And I know, Mike, you said that the TransDigm defense business was including Cobham on your organic calculation down year-on-year. I think you'll see that some of the details in the (inaudible), it was down about 5%, 6% ballpark. One, can you talk to the trends you're seeing in stocking and destocking. I think as most of you know, we don't have insight into the specific inventory levels at our airline customers. That being said, we're hopeful, we're cautiously optimistic. And on the second part of your question, the specifics of what drove the remaining 6% decline in the base TransDigm defense business. It's a mixed bag of both supply chain issues, but then also our planning too has been down this first quarter. But I don't think we want to get into specifics of exactly what drove it, but it was a combo of the two. Or are you ---\n In defense, we still feel good about the low-single digit growth target for the year. Yes, I don't -- we've seen. This is Kevin, we've seen some inflationary pressures. We've seen some supply chain issues, I think, in electronic components and castings. But it's not across the whole industry yet, but it's something we're watching closely. We would suspect that we’ll probably still have a couple of quarters of activities related to supply chain issues, but they’re engaged in mitigating as best as they can. I think you noted, Jorge noted the strongest part of the aftermarket was passenger. But as I noted, we saw strength across the board in all the submarkets within the commercial aftermarket. Mike, you obviously have a decent amount of floating rate debt. When you factor in the current caps and swaps, we're about 84% fixed going out for the next 2 or 3 years. We do factor in the latest LIBOR curve when we give you guys the interest rate guidance, the consensus market curve. Even if interest rates were to surge by quite a bit, there's not too much pain to be felt at least during the period of those hedges before they run out. Mike, I wanted to first ask on cash flow. I mean, good cash generation in the quarter. And with all the cost actions, could that framework be perhaps a little higher than you've talked about it in the past. Overtime, as we rebound out of COVID, we expect to get back close to that kind of 45% to 50% ballpark of EBITDA that we've operated at historically. Right now, we're a little bit lower just given the fixed nature of the interest charge and the fact that the EBITDA is still depressed. But once we rebound and come out of this, we expect to go back to that same ballpark. And if I could, just on the aftermarket. I know in the past, you've talked about a fairly significant percent of your business that's book and shipped there. I think as we look across the balance of the fiscal year, we would expect a gradual ramp-up in the commercial aftermarket. As Kevin noted, we're a little bit conservative here just with the different variants of COVID-19, potentially providing a temporary disruption. So we hope we're on the conservative side, but we thought 10% sequential growth was a good start, and we'd anticipate that to carry throughout the balance of the year. I mean typically, and as you know, we're market weighted in terms of the fleet. From an aftermarket perspective, supporting the widebodies is not an issue. Yeah, maybe a little bit. I don't have any indication that people are front-loading maintenance work or buying spares ahead, that's usually not the way the industry operates. And then, Kevin, on the M&A front, you said things are a bit slow at the moment. With the defense surging over the last couple of years, we saw a lot more defense opportunities in the M&A space. With the commercial market being so depressed right now, I think there hasn't been as many commercial opportunities that have come along on the M&A front, but that's starting to change. We frequently are looking at businesses and don't get to the point of closing for some reason, but we're optimistic right now. Good morning, everyone -- Kevin, Jorge, Mike. Kevin or Jorge, just on the defense, your confidence around the low single-digit growth just given the slower start to the year, but just also how you factored in. I think as I mentioned, the largest single driver in the defense market for this quarter was some of the lumpiness related to the Cobham acquisition. Quote volumes in general, continue to remain strong at the teams. And just, Kevin, I just wanted to circle back to your comments about -- and you made some comments on the fourth quarter call about you thought the supply chain disruptions might get a little worse on the electronic component side. I think they did, in some places, get worse. But right now, I think, limited to electronics and casting. Well, I think it's OE build rates. Our largest customer still haven't given guidance, still haven't given us a forecast. This matters to us because, as Jorge alluded to, all of our hiring and staffing is really related to OEM build rates. Aftermarket, we also feel very optimistic that it's moving in the right direction. We're seeing more takeoff and landings, revenue passenger miles by any metric, it continues to improve, but it is lumpy around the world. We saw Omicron come out of nowhere in Q1 in our first quarter, largely out of nowhere and saw it really impact. Again, we're touching base with the teams. As we've mentioned in prior calls, we continue to be directly engaged with the DoD and the DLA. And can you parse that growth, I mean, presumably utilization still running pretty light. And as wide-bodies start to fly more and are utilized more, certainly will have to up gauge our manufacturing there, but I don't think we see it as a concern for us right now. You talked dividends, you talked buyback, M&A, obviously. And I know you're hedged and you just mentioned the 84%, but I mean we really don't know how this is going to shake out. Secondarily is M&A, next comes capital allocation back out to our shareholders. It may happen one day, but it's certainly not yet. And if you look at just the cost -- from a cost of equity versus cost of debt standpoint, the debt even at forecasted interest rates is still a much better way to finance your business. But just noticed from the slides, the significant increase in stock comp this year. So first, on the stock comp add back. What drove the increase, and I think it was about -- last year, we had $129 million of stock comp expense. This year, we're stepping up to a midpoint of $145 million, rough justice of the target we gave you. The driver of that increase is that we changed the best criteria back from the temporary criteria we had during COVID, which was an EBITDA margin and dollar target. And we flipped it back to the metric that we've always had since TransDigm was founded, which is the 17.5% growth target on the intrinsic equity value per share. But going forward, we're going to adhere to the same methodology we've always had. And again, no increase in the number of options that are being handed out to executives or anything as part of our incentive plans. On the proxy filing, you probably saw that we filed the 10-Ka last week, which included a lot of the content of the usual proxy. We wouldn't expect the proxy to come for a couple of months, probably May or June time frame. Just to get to that kind of low-single digit growth for the defense business, that implies that we should be seeing a kind of return to sort of mid-single digit growth for the remainder of the year. Well, on the margin side, we don't want to give quarterly guidance. We just aren't issuing guidance, and we had a very strong Q1. This will be more of a of a stretch for us for the year, but we still feel confident enough to leave it there. As the business generally recovers, as Cobham starts to grow, I think this will rectify itself. And as you guys know, the defense is always lumpy, too. But all is equal, it's a tough acquisition environment, as you said. Or sometimes there are surprise acquisitions that come up, how could you deal with them. Given that we're starting to recover in the commercial markets, and we're starting to see more commercial opportunities. This is all in our thought process right now as we're evaluating what we should do over the next 12 months to get this excess cash out, as I said, some combination of M&A, share buybacks and dividends will be utilized as we always have. You can go back and look at our previous history, we did buybacks. There is -- yeah, there's not a lot of them when the commercial market is so depressed. I think if things match our criteria, if a business matches our criteria, we would look very strongly at it. And so for us, it is staying disciplined in our M&A process. I mean you guys are -- were at 8.2% net debt to EBITDA, just as you said last year, and you were quite comfortable there, and there's no special trough. Practically, Kristine, I don't think it will change very much from where we've operated historically. If you looked at the three years pre-COVID for TransDigm, the net debt to EBITDA was averaged about 6 times almost exactly, and it kind of oscillates between like 5.5% or so up to 6.5% and then maybe you do an acquisition or dividend or something that drives it towards the top end of the range. To Kevin's earlier comments, we always want to leave some capacity there to do a big acquisition if something comes along that you weren't expecting. And practically, for a company like us, even though we've proven through COVID that we can probably withstand more debt than the 6 times we run at, the markets are only willing to give you so much. So I think we'll likely stay around the 6 times, and we feel really comfortable operating at that kind of level. And as long as we keep the maturities out to the right, I don't see any big obstacle or issue that could come from the leverage level. And maybe on the DoD IG audit, I mean you've had a few of these now, and they've all resulted in voluntary refunds. Or is this just kind of a continual thing, we'll see every few years at $20 million. I think it's probably an artifact of doing business with the U.S. government, the DoD. I think this is part of the nature of doing business, and we have to get used to it. I think that the work that Jorge has done with the working groups with the DLA, DoD will certainly help this. It's a communication gap, I think. And we will continue to work this issue and improve it, I think, as we go forward. If upside comes, remember, aftermarket is more -- is less labor dependent than is the OEM side. I think in general, we're less worried about the aftermarket curve ramp-up than we are about the OEM side. It's why it's difficult, again, for us to give guidance without that OEM knowledge plan. Did the margin in the quarter have sort of stranded costs related to the decline in defense revenues because at least the supply chain part of that is maybe a surprise you can't react to compared to the aerospace revenues, maybe having a clean incremental margin to them. No, I don't think so. We make less money on the OEM side, at the aftermarket where we make our dollars on commercial aftermarket. And I know you don't want to -- you say you don't want to guide the quarters and not sensible, but just for sort of calibration purposes and a month into fiscal 2Q here. We're looking at it for the year, and we're comfortable with low-single digits in defense and we'll see how it plays out. Just one for me, a little bit of a follow-on. Kevin, in your opening remarks, you talked about some of the restrictions in global air travel starting to come in. It seems like over the last month or so, that's kind of accelerated and they're really starting to come down. Yeah, I can't comment on this quarter. Maybe if you could talk about inflation, how you're seeing right across your business, both from a pricing perspective. In general, we saw a little bit of an increase in inflation in Q1, primarily on electronic components. Not so much on labor, although we would anticipate, obviously, given the macro indications that labor will feel that inflationary pressure throughout the year. Ultimately, with the higher inflation, we've got to pass on some of that to the customer base, and that's done at the operating unit level and the teams are doing their best job to get in front of that, knowing that the inflationary pressures will likely continue to increase throughout the balance of the year. And then maybe on the aftermarket, if you could comment some more, 49% was really strong. And you noted, obviously, the variant came in December 1. Really, we look at it across the quarter. The aftermarket recovery can be lumpy in nature as well, and we saw good sequential improvement quarter-over-quarter. Thank you, ladies and gentlemen, for your participation in today's conference."
}