{
    "symbol": "CERT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 19:30:28",
    "content": " We reported second quarter revenue of $82.8 million growing 18% year-over-year on a reported basis and 21% on a constant currency basis including Pinnacle 21. Reported software revenue was $28.7 million, growing 48% year-over-year on a constant currency basis, with a 92% aggregate renewal rate. We delivered revenue of $54 million, representing a 10% growth on a constant currency basis compared with the second quarter of last year. With our revised outlook, regulatory services and the negative impact from foreign exchange rates, we are adjusting our revenue guidance for the full year to $325 million to $335 million, reflecting an approximate $10 million reduction due to foreign exchange and $15 million related to the performance in regulatory services. Total reported revenue for the three months ended June 30, 2022 was $82.8 million, representing year-over-year growth of 21% on a constant currency basis and 18% on a reported basis. We remain well positioned with trailing 12 months bookings coming in at $393.5 million, up approximately 25% year-over-year on a reported basis and excluding Pinnacle 21 up 17%. Reported software revenue was $28.7 million in the second quarter, which increased 48% over the prior year period on a constant currency basis and 43% on a reported basis. Software bookings were $30.5 million in the second quarter, which increased 57% from the prior year period. Reported services revenue was $54 million in the second quarter, which increased 10% over the prior year period on a constant currency basis and 8% on a reported basis. Technology driven services bookings in the second quarter were $69.7 million, which increased 25% from the prior year period. Total cost of revenue for the second quarter of 2022 was $35.2 million, an increase from $27.5 million in the second quarter of 2021, primarily due to a $4.2 million increase in employee-related costs due to billable headcount growth, $1.7 million increase in intangible asset amortization, a $1.2 million increase in stock-based compensation expense and a $0.5 million increase in cost of licenses. Total operating expenses for the second quarter of 2022 were $43.4 million, an increase from $37.3 million in the second quarter of 2021. R&D expenses were $7.7 million, compared to $4.6 million for the second quarter of 2021. G&A expenses were $17.8 million, compared to $18 million for the second quarter of 2021. Intangible asset amortization was $10.4 million compared to $9.5 million in the second quarter of 2021, increasing due to amortization costs from acquired intangible assets. Interest expense was $3.9 million, compared to $6.3 million for the second quarter of 2021 due to slightly higher interest expense offset by the reclassification of our interest rate swap to an effective hedge. Miscellaneous income was $2.5 million, compared to a loss of $0.3 million in the second quarter of 2021 due to foreign currency gains of $2.7 million. Reported adjusted EBITDA for the second quarter of 2022 was $28 million, compared to $25.5 million for the second quarter of 2021, representing 9% growth. Reported adjusted net income for the second quarter of 2022 was $14.6 million, compared to $11.8 million for the second quarter of 2021. We are lowering our revenue forecast by approximately $10 million, due to foreign exchange headwinds and $15 million, due to the performance and outlook of the regulatory services business. Revenue in the range of $325 million to $335 million, adjusted EBITDA in the range of $112 million to $117 million, adjusted EPS in the range of $0.43 to $0.48 per share, fully diluted shares in the range of $159 million to $161 million, a GAAP tax rate in the range of 40% to 45% and cash tax rate in the range of 20% to 25%. So we did about $13 million year-to-date $7 million in the second quarter, 95% SaaS and we've seen some uptake on the new product launch there."
}