{
    "symbol": "CERT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 04:12:05",
    "content": " We reported strong first quarter revenue of $81.6 million, growing 22% year-over-year, including Pinnacle 21. Software revenue was $29.2 million, growing 33% year-over-year with a 92% renewal rate, driven by double-digit growth in our core Simcyp and Phoenix licenses and the impact from Pinnacle 21. Technology-driven services revenue was $52.4 million, representing 17% growth compared with the first quarter of last year. Total revenue for the three months ended March 31, 2022, was $81.6 million, representing year-over-year growth of 22%, which included approximately 100 basis points of negative FX impact. We remain well-positioned with trailing 12 months bookings coming in at $368.3 million, up 19% year-over-year on a reported basis and up approximately 14%, excluding Pinnacle 21. Software revenue was $29.2 million in the first quarter, which increased 33% over the prior-year period. Excluding $5.6 million in Pinnacle 21 software revenue contribution, year-over-year growth was 8%. Software bookings were $29.4 million in the first quarter, which increased 34% from the prior-year period. Trailing 12-month software bookings were $101.9 million, up 32% year-over-year and up 13% excluding Pinnacle 21. Services revenue was $52.4 million in the first quarter, which increased 17% over the prior-year period. Technology-driven services bookings in the first quarter were $79.1 million, which increased 32% from the prior-year period. Moving further down the P&L for first quarter results, total cost of revenue for the first quarter of 2022 was $32.8 million, an increase from $26 million in the first quarter of 2021, primarily due to a $4.5 million increase in employee-related costs resulting from billable headcount growth and a $1.7 million increase intangible asset amortization from acquired software. Total operating expenses for the first quarter of 2022 were $42.6 million, an increase from $35.1 million in the first quarter of 2021. The components of operating expenses are as follows: Sales and marketing expenses were $6.1 million, compared to $3.8 million for the first quarter of 2021. R&D expenses were $7.5 million, compared to $4.7 million for the first quarter of 2021. G&A expenses were $18.3 million, compared to $16.6 million for the first quarter of 2021. Intangible asset amortization was $10.1 million, compared to $9.5 million in the first quarter of 2021, increasing due to amortization costs from acquired assets. Interest expense was $3.2 million, compared to $3.9 million for the first quarter of 2021 due to lower interest rates on the term loan and interest swap. Net income for the first quarter of 2022 was $2.2 million, compared to a net income of $1.1 million in the first quarter of 2021. Adjusted EBITDA for the first quarter of 2022 was $27.7 million, compared to $23.9 million for the first quarter of 2021, representing 16% growth. Adjusted net income for the first quarter of 2022 was $16.9 million, compared to $14.4 million for the first quarter of 2021. Revenues in the range of $350 million to $360 million, adjusted EBITDA in the range of $127 million to $131 million, adjusted EPS in the range of $0.48 to $0.53 per share, fully diluted shares in the range of $159 million to $161 million, a GAAP tax rate in the range of 40% to 45% and a cash tax rate in the range of 20% to 25%. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}