{
    "symbol": "CERT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 19:49:06",
    "content": " We reported third quarter revenue of $84.7 million, growing 15% year-over-year on a reported basis and 18% on a constant currency basis. Reported software revenue was $28.4 million, growing 54% year-over-year on a constant currency basis with a 93% aggregate renewal rate. We delivered revenue of $56.3 million, representing 6% growth on a constant currency basis compared with the third quarter of last year. Total reported revenue for the 3 months ended September 30, 2022, was $84.7 million, representing year-over-year growth of 18% on a constant currency basis and 15% on a reported basis. We remain well positioned with trailing 12 month bookings coming in at $401 million, up 28% year-over-year on a reported basis and excluding Pinnacle 21, up 17%. Reported software revenue was $28.4 million in the third quarter, which increased 54% over the prior year period on a constant currency basis and 47% on a reported basis. Excluding $7.3 million in Pinnacle 21 software revenue contribution, year-over-year growth was 16% on a constant currency basis. Software bookings were $25.4 million in the third quarter, which increased 22% from the prior year period. Trailing 12-month software bookings were $117.6 million, up 41% year-over-year and up 6% excluding Pinnacle 21. Reported services revenue was $56.3 million in the third quarter, which increased 6% over the prior year period on a constant currency basis and 3% on a reported basis. Technology-driven services bookings in the third quarter were $54.4 million, which increased 6% from the prior year period. Total cost of revenue for the third quarter of 2022 was $32.8 million, an increase from $28.8 million in the third quarter of 2021, primarily due to a $1.6 million increase in intangible asset amortization, $1 million increase in stock-based compensation, $0.4 million increase in employee-related costs and a $0.9 million increase in other cost of revenues such as equipment, travel and software licenses. Total operating expenses for the third quarter of 2022 were $41 million, a decrease from $45.9 million in the third quarter of 2021. 2 million for the third quarter of 2021. Intangible asset amortization was $10.6 million compared to $9.6 million in the third quarter of 2021, increasing due to amortization costs from acquired intangible assets relating to Pinnacle 21. Miscellaneous income was $2.8 million compared to $0.7 million for the third quarter of 2021, due primarily to a $2 million increase in remeasuring gains related to the fluctuation in foreign currency exchange rates. Reported adjusted EBITDA for the third quarter of 2022 was $32.7 million compared to $26.1 million for the third quarter of 2021, representing 25% growth. 2 million for the third quarter of 2021. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}