{
    "symbol": "CWEN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 18:00:28",
    "content": " Clearway's long-term steady growth outlook is more transparent than ever with the latest offers from Clearway Energy Group for 1.4 gigawatts of assets, utilizing anticipated $410 million of capital at an approximate 9.5% CAFD yield. As a result of our sponsor's continued development efforts, we also have visibility into additional drop-down offers anticipating in the first half of 2023, leading to the deployment of an approximate additional $220 million of Clearway Energy, Inc.'s corporate capital. Because our pro forma CAFD outlook is based on 5-year average CAFD profiles for new investments, 2023 expectations reflect $10 million less in CAFD than our pro forma CAFD outlook due to the timing of when projects reach operations and the shape of project cash flows, consistent with what we have disclosed previously. However, due to our significant cash balances currently, Clearway believes there is no need to suffer negative arbitrage given limited currently forecasted cash needs for fairway between now and the end of 2023, and therefore, looks to refinance Capistrano at the year end of 2023, leading to a $10 million CAFD outlook. Based on forward power markets and internal analysis, Clearway currently expects the three facilities to generate energy margin for merchant power markets to be cleaning approximately $20 million of upside in 2023, relative to the long-term merchant energy assumption that underpins our pro forma CAFD outlook. To close out the guidance and pro forma outlook discussion, it's important to note that the merchant energy margin estimate the conventional segment on a pro forma basis represents only approximately 5% of Clearway's asset-level CAFD. In total, these assets represent a significant investment of $410 million in C1 corporate capital at a strong estimated CAFD yield of 9.5% on the portfolio, which solves the majority of its output under agreements that have an average duration of 17 years. Starting on our $390 million pro forma outlook that we discussed previously, we add in the latest offers from our sponsor, which assuming binding agreements are achieved, we'll deploy $410 million of capital at a 9.5% CAFD yield as well as our current view around additional and pending offer from our sponsor in the first half of 2023 for $220 million of capital deployment, also at anticipated 9.5% CAFD yield. Your line is now open. Your line is now open. Your line is now open. Your line is now open. For the most recent set of drop-down offers that were made to those solar projects will elect the PTC, and that's part of what allows us to convey these assets at a higher CAFD yield, and also with more investable cash flow for the YieldCo. Your line is now open. Your line is now open. Your line is now open. And in general, what we've been looking to do as we finalize revenue contracts on assets is to put in place interest rate protection so that any debt financing we plan to put on either for the construction period or the term already anticipates the cost of debt on a long-term fixed basis and supports a CAFD yield that's accretive for the YieldCo. Your line is now open."
}