{
    "symbol": "ATRC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 22:47:06",
    "content": " Your line is open. On top of that, I think we underestimated the impact of coming out of COVID and the staffing effect of when you're trying to coordinate two different groups like that, getting people to kind of get their attention and get the staffing to work where you get their attention upfront because we had a lot of activity even during COVID to get sites up and running and training, but then to get them to do the hard work of actually working through the logistics and working through how we're going to move that patient through the process, that's the part that's taken us longer than expected. So when you think about the open ablation franchise, I think the beginning part of this year, we're going to continue to see really good strength off the open as we kind of lap that one year from rolling out EnCompass. Your line is open. We saw good activity within the overall number of accounts, but I think the challenge that we're seeing within accounts of -- being able to do procedures repeatedly on a kind of a mass scale, meaning reaching a bigger number of patients throughout the quarter and the year has definitely been a challenge, and that's the logistics and the workflow within program development that Mike referred to earlier. One moment for our next question. Your line is open. So, there's the -- when we build our guidance for the year, and I think that's the most important thing to really think about is that we build -- that 15% to 17%, we're assuming that our hybrid business is well below that. And part of that is, we feel like we're entering the year with really good investments kind of globally within the sales team, but we'll be selective about adding -- Mike touched on a couple of areas within our Cryo Nerve Block team and then our international teams will continue to add and then a little bit more on the case support within cardiac as well. One moment for our next question. Your line is open. And so, EnCompass, which has been in development for over four years and is now on the market, was really targeted towards that audience to kind of do a very robust ablation for those patients and make it much easier for them to do it and get behind the heart by going through the oblique and transverse sinus and then combine that with making it a little bit quicker, and we've seen all of those benefits. One moment for our next question. Your line is open. One moment for our next question. Your line is open. You combine that with other data that's out there about kind of heart failure patients and their stroke rates relative to after cardiac surgery, we've been able to kind of come to a really good rate to basically enhance that and look at the patient population that is at a high risk of having basically a weak atrium, whether caused by atrial fibrillation because they're likely to actually get Afib or caused by heart failure. Your line is open."
}