{
    "symbol": "FAT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 07:42:46",
    "content": " Our legacy FAT Brands portfolio of brands owned for all of 2021, like Fatburger, Johnny Rockets, Hurricane Grill & Wings saw an increase in system-wide sales of 15.8% over the first quarter of 2021. For the first quarter of 2022, same-store sales which only includes those brands owned for all of fiscal 2021 increased 16.8% over Q1 2021, driven by an increase of 40.1% at Johnny Rockets and 9.1% at Hurricane Grill & Wings. Diving in a bit on the synergies, we see significant opportunities to generate savings for our franchise partners given our substantial purchasing power of more than $600 million per year in food, beverage and paper costs, as well as cross-selling opportunities between our now 17 brand portfolio. With $15.1 million of adjusted EBITDA in Q1, a big jump from our adjusted EBITDA of $10.4 million in the fourth quarter of 2021, we are well on our way to the $22 million to $25 million quarterly run rate we expect to achieve by the end of this year. Total revenue during the first quarter increased 1,365% to $97.4 million, reflecting revenue from Global Franchise Group, Twin Peaks, Fazoli's and Native Grill & Wings, all of which were acquired during 2021. Lastly, advertising expense increased $9.1 million, reflecting advertising expenses from Global Franchise Group, Twin Peaks and Fazoli's and an increase in customer activity as the COVID recovery continues. And of course, the new unit openings are a massive delevering effect for us by increasing our EBITDA from this $90 million to $95 million run rate we hope to hit by the end of the year by another $50 million with just organic growth dramatically delevers the company over the next few years simply by just opening more stores. But we're going to hit well over 100 new stores this year and we just have this huge pent-up demand and pipeline of -- I mean, it's a 33% unit count growth. Thank you, everyone, for joining today's call. Thank you, everyone, for joining today's call."
}