{
    "symbol": "FAT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-31 10:25:45",
    "content": " Cost of restaurant and factory revenues increased to $49.8 million in the second quarter compared to $0.2 million in the prior year period, primarily related to the 2021 acquisitions, including the operations of the acquired company-owned restaurant locations and the Atlanta-based manufacturing facility. But very, very strong, and you know weâ\u0080\u0099re going to hit that north of 100, probably up to 120 new store openings in this calendar year and â\u0080\u0093 and probably as many if not more in 2023. We decided to look at putting the FAT 2021 deal, which is really our burger restaurants into the GFG deal, which are the Round Table Pizza, cookies and ice cream, hot dogs, pretzel business and do sort of one larger deal and â\u0080\u0093 and have you know trying to spread the cost across that one larger deal. And so originally, when we had planned to you know try to come back to market at the end of Q1 or sometime in Q2 of this year, we thought that you know some of the agencies would be back with whole business securitization ratings programs, and one of them, in particular, was not and â\u0080\u0093 and doesnâ\u0080\u0099t expect to be until the end of you know Q3 or sometime in Q4. But remember that, weâ\u0080\u0099re adding $10 million a year going forward of new store openings just drops to the bottom line and you know very little closures that have any material effect you know and usually stores that close are very low revenue stores. We â\u0080\u0093 weâ\u0080\u0099ve allocated a certain amount of capital at the Twin Peaks level to build additional company-owned stores, but just a few of them every year, and theyâ\u0080\u0099re â\u0080\u0093 theyâ\u0080\u0099re really using kind of a hub and spoke model to you know seed to markets, get them up and running and then bring in franchise developers to run from there and use our corporate stores to support the franchisees. Can you give us an idea of which concepts are really provided in the openings as well as â\u0080\u0093 you mentioned Twin Peaks is doing very well in terms of â\u0080\u0093 give us a little more idea of which are the strongest, obvious â\u0080\u0093 of the â\u0080\u0093 what I consider the six largest Hurricane, Fatburger, Johnny Rockets, Round Table, Twin Peaks and Fazoliâ\u0080\u0099s, obviously you know where they share large deal, the most material concepts."
}