{
    "symbol": "BOWL",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-16 20:39:05",
    "content": " In the first quarter of fiscal year 2023, Bowlero generated record q1 revenues of $230 million and record Q1 adjusted EBITDA of $65 million compared to the prior year's Q1 revenue grew $49 million or 27% and adjusted EBITDA expanded by $6 million, or 11%. Compared to pre-pandemic performance revenue was higher by $82 million, or 55% and adjusted EBIT da expanded by $40 million, or 162%. In the first 18 weeks of fiscal year '23, which takes you through November 6, revenue has remained extremely robust growing 56% versus pre-pandemic levels with same store revenue increasing 36% on the same basis. Adjusted EBITDA margin in the quarter was 28.4%, which grew 1,158 basis points versus the corresponding pre-pandemic quarter and reflects our relentless pursuit of a world class operational performance that lies at the core of our company culture. Adjusted EBITDA was $65 million in the quarter, which represents an increase of $6 million, or 11% year-over-year, and an increase of $40 million, or 162% relative to pre-pandemic performance. Adjusted EBITDA margin was 28.4%, which surged almost 1,200 basis points above the comparable pre-pandemic metric driven by revenue growth, our proprietary technology based solutions that allow us to continually optimize performance and the operating leverage of our business. We believe the pre-pandemic revenue curve remains the most indicative view of typical seasonality trends in our business with Q2 and Q3, historically serving as the largest quarters, accounting for 55% to 60% of annual revenue, and 65% to 70% of annual adjusted EBITDA. As highlighted on Page 8, center level revenue increased $50 million, or 20% over the comparable prior year period with positive momentum across each of our guests segments walk in retail group events and leagues and tournaments. Center level EBITDA grew 20% year-over-year, and an astounding 95% over the pre-pandemic period reaching $86 million. The company generated $36 million in cash from operations during Q1 FY'23, growing almost 13% versus the prior year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. So I think what's important to keep in mind is that the quarter we just got out of is our lowest grossing quarter, even though it was very, very good quarter $230 million in revenue in the quarter that it's not surprising that if you're going to have margin compression in any quarter, it would be this one on a year-over-year basis, because you're going from a quarter where you had abnormally low input costs to one where they're more normalized, and it's not a huge revenue quarter."
}