{
    "symbol": "TNET",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 19:55:20",
    "content": " 03:46 In the first quarter, our GAAP EPS grew 46% year-over-year to $2.21, and our adjusted net income per share grew 54% to $2.55. The outperformance in total revenues for the first quarter was driven by WSEs outperforming our forecast as we once again benefited from strong hiring within our installed base and rate growth, benefiting both professional services and insurance revenues. In the quarter, Professional Service revenues grew 27% year-over-year to $194 million, benefiting directly by 5% from the Zenefits acquisition. In spite of the increased transaction-related expenses, let me point out that we grew first quarter GAAP net income per diluted share by 46% year-over-year to $2.21 or $0.18 higher than our original guidance. 24:24 Now let's turn to our second quarter and revised full year outlook, which now reflects our first quarter performance, the acquisition of Zenefits and the share repurchase executed through March. 26:42 Turning to specific second-quarter 2022 guidance, including TriNet-Zenefits we expect total revenue growth to be in a range of 8% to 9% year-over-year and Professional Service revenue growth to be in a range of 14% to 15% year-over-year. Our second quarter estimate of GAAP net income per diluted share is in the range of $0.69 to $0.80 per share, reflecting the cost impact from the Zenefits acquisition and integration activities that are underway. Given the integration expenses related to the Zenefits transaction offset in part by the benefit from the tender offer, we are revising our full year GAAP net income per diluted share guidance to $3.28 to $3.91. 29:29 We are raising our full year adjusted net income per diluted share guidance by $0.15 at the midpoint to $4.70 to $5.35, reflecting the benefit from our tender and the strong first quarter financial performance. So when we take into account increased volume and better hiring in the first quarter while we're being cautious for the rest of the year on hiring, that's the net difference other than the difference between Zenefits and the share repurchase."
}