{
    "symbol": "TNET",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 21:12:08",
    "content": " The performance in total revenues for the fourth quarter and the full year was driven by growth in rate as we had continued high benefit participation by our WSEs, we also saw continued growth from mix as we added customers in our white-collared verticals, and our customers bought more of our products and services. In the fourth quarter, as discussed on our October earnings call, we contributed $50 million to our 2022 credit program, which lowered total revenue growth by 4 points. For the full year, our insurance cost ratio was approximately 84%, also lower than our latest guidance range for the year of 85% to 86%, the lower insurance cost ratio for the quarter and year was largely driven by lower overall health utilization than forecast as well as a mix shift by our customers to lower cost regions. Regarding operating expenses in the quarter, the year-over-year growth of 25% was substantially driven by our acquisition of Zenefits midway through the first quarter of 2022. Fourth quarter net income per diluted share exceeded the top end of our guidance by $0.71 to $0.78, down 24% year-over-year. Fourth quarter adjusted net income per diluted share also exceeded guidance by $0.61 to $1.11, down 2% year-over-year. This brought full year adjusted net income per share to $7.07 up 25% versus 2021, outperforming the top end of guidance by $0.67. In the first quarter of 2023, we expect total revenue growth to be in the range of 1% to 2% year-over-year and professional service revenue growth to be in the range of 4% to 6% year-over-year. Our revenue growth guidance remains muted and reflects our expectation that the fourth quarter trend we saw in customer hiring or CIE, will persist into the first half of 2023. Regarding our full year 2023 guidance, we are forecasting our year-over-year total revenue to be in a range of down 2% to up 2%, with our professional service revenue expected to grow between 1% and 5% year-over-year. Part of it is the ability to generate qualified leads, brand recognitions, penetration by vertical, leadership and sales in the field, ability to quote properly upfront and probably five other things that Iâ\u0080\u0099m not mentioning â\u0080\u0093 by the end of the year, it became clear that sales productivity was at a level, that if January was successful, we could start to turn on the spigot for net new reps and believe that we had a model, which would provide them with a strong territory and opportunity."
}