{
    "symbol": "WTRG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 16:05:27",
    "content": " Now as part of the company's ongoing commitment to the renewal of critical infrastructure, we invested approximately $424 million -- $424.6 million to be exact, throughout our water, wastewater and natural gas systems in the first half of the year. We were the first and the only multistate utility to set its own company-wide PFAS standard, and I think we're uniquely positioned to address PFAS because of our experience and our capabilities with analytical testing and building and operating treatment systems, spending nearly $40 million to meet the company-wide standard of 13 parts per trillion. O&M expenses increased to $135 million for the quarter, up from $127.5 million in the second quarter of last year, recently added acquisitions, increased maintenance expenses and higher water production costs primarily as a result of inflationary pressures were the main drivers for the quarter. Net income was up 1.7% year-over-year from $80.9 million to $82.3 million and GAAP earnings per share decreased to $0.31 from $0.32 for the quarter, given the increase in shares due to the August 2021 settlement of our 6.7 million share forward sale that we did in 2020. Similar to the first quarter of the year, you'll notice the primary driver was the recovery of higher purchased gas costs of $30.2 million due to the significant increase in natural gas commodity prices. Rates and surcharges, organic and acquisition growth and increased volumes from both our regulated water segment and our regulated natural gas segment provided an additional $23.7 million towards the revenue increase, which was then offset slightly by other. Looking at the operations and maintenance waterfall, expenses for the second quarter increased to $135 million compared to $127.5 million for the same period in 2021. Growth, which reflects the O&M costs of acquired systems in Pennsylvania, Illinois and Texas contributed $2.2 million, and increased production costs in our regulated water segment added an additional $1.5 million. We remain confident that our 3-year earnings per share growth will be 5% to 7% through 2024, and our capital plans remain on track as we anticipate investing approximately $1 billion a year to rehabilitate and strengthen water, wastewater and natural gas systems through 2024. So if we're at -- gas it's $2 more per year this year, you think about it as the annual bill being maybe $200 more in 2022, 2023 heating season than we saw last year."
}