{
    "symbol": "PCRX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 12:32:04",
    "content": " Despite ongoing headwinds, including labor shortages, COVID intrusions, reduced hospital services decreased hours at ambulatory surgery centers and the impact of inflation on certain elective procedures, EXPAREL continues to outpace the elective surgery market recovery with expanded utilization across all target market in sites of care. To date, we have not seen any impact from new market entrants on our EXPAREL base business or our ability to generate new business, which is not surprising given the ability of EXPAREL to help facilitate the market's ongoing shift to regional analgesia and outpatient sites of care. While we are currently not providing 2022 revenue or gross margin guidance, given the continued uncertainty around labor shortages, other COVID-related disruptions, impacts from the recent worsening economic and inflationary trends and the pace of recovery for the elective surgery market we remain committed to the transparency of reporting preliminary monthly product sales to share inter-quarter trends with you. Despite ongoing headwinds, including labor shortages, continued COVID intrusions, reduced hospital services decreased hours at ambulatory centers and the impact of inflation on certain elective procedures, we continue to deliver impressive financial results and remain bullish in our 5-year plan for year-over-year top line growth in the mid- to high teens in 2023 and beyond. What we see in the marketplace actually is that the high acuity pain procedures, largely orthopedics, specifically total joints, shoulder and spine are continuing to be done and they are continuing to be done largely in ambulatory surgery centers because these are high acuity profitable procedures and especially in environments where the surgeons own part of the ambulatory surgery center, those procedures are getting done on a relatively routine basis. While it wasn't a specific win CMS asking for comments on -- with both data and discussion points in the marketplace around HOPD and the need for reimbursement in the HOPD, we think, in many ways, goes back to the question that Chris just asked that non-opioid alternatives in the HOPD would be really important to lower socioeconomic populations and the fact that many of these places do not have any access to opioid-free opportunities at all. And we see that in these -- in this faith-based opportunity that we discussed and it's not only a revenue opportunity, Balaji, but it's an opportunity for us to be able to work with these folks and to let patients in their -- in the states where they operate, understand that there are opioid-free opportunities remembering that there are 20 million Americans in recovery and we hear literally daily from patients who are interested in an opioid-free opportunity and are searching for a place where those kinds of opportunities to have an opioid presurgery are available. So we're watching it closely, Greg, neither high inflation or a recession are going to be good for us in terms of the rebound in procedures, but we also think that there is a strong motivation from these high acuity procedures that are continuing to be done, and we don't see any change there or very little change there and the increased opportunities to be able to do soft tissue procedures at a cost that's appropriate for the hospitals. Most folks who have used EXPAREL and understand the benefits of EXPAREL, find it interesting that their society would try to limit the use of a product that is really the only product that's available that allows them to do regional anesthesia and provide better patient care and allow them to move patients to an outpatient environment. And we are trying to move forward with the ASA, and -- but it hasn't had much of an impact on anything that we've done in terms of how we're working with the anesthesiologists who are in the trenches and who use EXPAREL every day for regional pain management for new blocks and field blocks."
}