{
    "symbol": "CRVL",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-07 16:59:08",
    "content": " CorVel refers you to the documents that the company files from time to time with the Securities and Exchange Commission, specifically the company's last Form 10-K and 10-Q filed for the most recent fiscal year and quarter. Revenues for the quarter ended June 30, 2021, were $153 million. Earnings per share for the quarter were $0.92, increasing 102% from $0.46 per share in the same quarter of the prior year. The quarter ending cash balance was $139 million, up $45 million from June 30, 2020. The record revenue in the quarter ended June 30, 2021, is largely due to implementing and building on new business sold in 2020 and the first 2 quarters of this year as well as an increase in transaction volumes as the year progressed. Prior to the June quarter, we experienced consecutive quarters of increased profit margins on relatively static revenues. In addition to increased investment in technology, we've expanded and enhanced our digital marketing strategy and engagement with various digital and print mediums. After taking time during the past 4 earnings calls to discuss the pandemic and its impact on business, it's refreshing to talk about things settling into a new normal. With new accounts added, the resumption of medical procedures increased claims and billed volume and demand for managed care, service lines are meeting or exceeding pre-pandemic levels. With our robust foundation and proven results, we're well positioned to address this increased need in the markets we serve. Consistent with CorVel's designation as a Great Place to Work, we have an established history of being a company where people can grow, advance and build a career, something of which we're tremendously proud. The culture we've built and fostered is as important today as at any point in the company's history, and we'll continue to invest in our associates and the environment at CorVel. In the most recent quarters, efforts have been focused upon building our telehealth operations, strengthening and expanding the ability to integrate information across the various constituencies in an episode of care and adding sophisticated analytics tools to understand how best to improve outcomes. Within our proprietary business systems, managing claims, managing cases, bill adjudication and ancillary services, millions of transactions occur each month. This is an effort that's iterative and ongoing as we continue to make investments in existing foundational systems, the results will be increased capacity, quality and consistency with fewer exceptions. Natural language processing is allowing us to zero in on and distill critical information from volumes of medical data, machine learning, speech analytics and data mining are increasingly being used to identify claims that require additional attention and oversight. At CorVel, we've been building such services for several years, and the receptivity created by the pandemic gave our efforts a nice boost. Data from peripheral and wearable devices, when combined with pharmacy, medical claim and psychosocial data, will continue to improve machine learning capabilities and the corresponding outcomes in workers' compensation. We've also implemented a system, which builds increasingly real-time interfaces to improve the patient experience during an episode of care, supporting internal operations as well as our managed care partners. SYMBEO, our revenue cycle management arm delivered an updated machine learning AI-assisted digital capture solution that provides a 75% reduction in overall processing time. SYMBEO's products and services remove the need, in many cases, for customers to maintain mail rooms and reduces the overall effort our partners have historically spent on the individual stages in revenue cycle processing. Revenues for the June quarter were a record $153 million, up 18% from the same quarter of the prior year. Earnings per share were a record $0.92, an increase of 102% from the $0.46 per share in the same quarter of the prior year. These results were made possible by the ongoing return of pre-pandemic market conditions for our existing customers, plus the realized impact of robust new customer sales throughout the pandemic. The impact of new sales on revenue includes a healthy mix of services, ranging from existing customers, expanding the breadth and depth of their services to establishing entirely new customer relationships. Revenue for patient management, including third-party administration, TPA services and traditional case management for the June quarter was a record $100 million, an annual increase of 18%. Our third-party administration services hit record levels, leveraging increased market recognition and engagement of CorVel's enterprise comp. Revenue for Network Solutions sold in the wholesale market for the quarter was $52 million, up 18% from the same quarter of the prior year. The average size of the medical bill review increased, providing additional opportunities for our medical cost containment services to be applied. During the quarter, the company repurchased 118,893 shares at a total cost of $14.2 million. The quarterly cash flow speaks to the strength of our service model, including increased levels of automation with resulting efficiencies plus improvements to operations that have been accomplished in the changing environment during the pandemic."
}