{
    "symbol": "CRVL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-11-01 15:37:06",
    "content": " During the course of this webcast, CorVel Corporation may make projections or other forward-looking statements regarding future events or the future financial performances of the company. CorVel refers you to the documents that company files from time to time with the Securities and Exchange Commission, specifically the company's last Form 10-K and 10-Q files for the most recent fiscal year and quarter. I will be reviewing business performance, the current environment, market trends and progress achieved with systems development. The September quarter revenues were $177 million, 12% over the $158 million of revenue for the September 2021 quarter. Earnings per share for the quarter were $0.83, decreasing 5.6% from $0.88 per share in the same quarter of the prior year. In prior earnings discussions, we've referred to the growing importance of CERiS, which serves the commercial healthcare market on our financial results. However, fluctuations in transaction volume which requires a collaborative effort with providers and payers occurred early in the September quarter. EPS for the quarter was impacted by this temporary impedance in CERiS transaction flow, increased investment in CERiS and elevated staffing levels in our property and casualty business. As CERiS has gained traction with the current payment integrity suite of services, we've increased investment in the CERiS team, the SaaS platform, research and development and the implementation of new services. With the challenges presented by the pandemic and Great Resignation, the company has prioritized the quality of engagement, results and outcomes generated for our partners. While the objective was to remain near neutral with overall staffing to transaction volume ratios, recruiting efforts have exceeded attrition and the implementation of new business. With the addition of indirect costs, included training and lost productivity due to learning curves and replacement employees, related over time and administrative costs for supervisors, the amount increases to over $45 billion. However, there remains some ambiguity about who is advocating for the utilization of these solutions as they are not yet originating from treating physicians and workers with injuries may be slow to accept the new treatment approaches. At CorVel, we're effectively minimizing medical spend in the musculoskeletal space through our networks and ancillary service programs, using CAREIQ physical therapy which has proven to reduce average therapy visits per claim below industry standards. We're exploring multiple solutions and partnerships, specific to musculoskeletal injuries to achieve the optimal results for our partners. As such, preemptive notification of large incoming expenditures and maximized savings on medical bills before payment are even more vital, CERiS has been successful in prepayment adjudication, medical record retrieval and itemized bill review, all of which are foundational to prepayment processing. In addition, the services provided are consistently defensible, meet prompt pay guidelines and adhere to state specific policies, making CERiS the partner of choice with best-in-class solutions that create maximum sustained savings. In the September quarter, efforts to build and implement in new workflow management system were completed. The enhanced design provides increased scalability, configurability and reduces impedance in the process, resulting in efficiency gains of up to 15% in overall labor costs. While that is slowing, the talent gap created by boomers leaving the adjusting workforce will continue for many years as well as mentoring and training, we believe a continued focus on system automation will significantly impact new and existing team members. Ensuring our claims system is intuitive, streamlining workflows and removing mundane and repetitive objective tasks will optimize the teams' effectiveness and enhance the overall outcomes for our partners. In claims, case management and our ancillary benefits management program Care IQ, we are expanding the use of text messaging to enhance the efficacy of communication with all stakeholders, including the workers with injuries. We also continue to enhance system dashboards and interactive interfaces in collaboration with partners feedback during regular business and intentional forms like our partnership meeting, which I'll discuss later. Each year, we bring partners to share innovative enhancements we've implemented and a preview of new products and services we're developing. Additional opportunities to meet with our partners in the employer, broker and carrier markets were provided during the national workers compensation and disability conference last month. It was rewarding to hear positive feedback, but one, in particular stood out, a carrier partner with whom we have won over a dozen accounts in the past year shared their annual internal TPA scorecard, which show the results of the programs we handle versus competitors. Based on the carrier scorecard, not only are CorVel's services producing higher savings and better results, but the conversion process to move to CorVel is more straightforward and our system interface much preferred. Furthermore, we received the 2022 Risk Management Team of the Year from Business Insurance's US Insurance Awards with our partner Bass Pro Shops. A dedicated team of CorVel nurses and coordinators works closely with adjusters, providers and the workers with injuries to ensure an effective and timely return to work with maximum medical improvement. As a result, Bass Pro has seen decreased our products usage, reduced number of employees on temporary total disability and lowered overall medical costs in their program. As Michael indicated at the top of the call, revenue for the September quarter was $177 million, up 12% from the same quarter of the prior year. Earnings per share were $0.83, a 5.6% decrease from the $0.88 per share in the same quarter of the prior year. The revenue for patient management, including third-party administration, TPA services and traditional case management for the September quarter was $119 million, an annual increase of 14%. Gross profit decreased 9% from the September quarter of 2021, primarily due to the increased staffing costs influenced by our commitment to maintaining service quality while addressing the headwind pressures of the Great Resignation. Advancements in AI assisted solutions rolling out internally over the next three months and beyond provide stronger operational efficiencies, adding relief to the increasing cost pressures, while delivering more timely service outcomes. The revenue for network solutions sold in the wholesale market during the September quarter was $58 million, a 9% increase from the same quarter of the prior year. Throughout the company, CorVel is embracing the hybrid work model, allowing employees to work from home, but also to come into the office for team collaboration. By 2025, we plan to realize a 40% decrease in total leased office space from our prior 2020 levels, providing ongoing cost structure efficiencies. During the quarter, the company repurchased 164,500 shares at a total cost of $26 million."
}