{
    "symbol": "NNN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 13:36:05",
    "content": " Although we continue to maintain our traditional discipline in our underwriting, we acquired 59 new properties in the quarter for approximately 210 million at an initial cap rate of 6.2, and with an average lease duration of 17 years, almost all of our acquisition of this past quarter were sale leaseback transactions and that is a result of the in depth calling effort of our NNN acquisition department. With that, now on to -- the headline from this morning's press release  quarterly core FFO results of $0.77 per share for the first quarter of 2022. We did footnote first quarter AFFO included $1.8 million of deferred rent repayment in our accrued rental income adjustment for the first quarter, without which would have produced an AFFO of $0.78 per share, as we've noted there. Excluding the deferred rent repayments I mentioned earlier, our AFFO dividend payout ratio for the first quarter of 2022 was 68% and that's fairly consistent with historical levels. We ended the quarter with $732 million of annual base rent in place for all leases as of March 31, 2022, which we think is a good starting point for folks thinking about projections going forward. And similarly, we increased the AFFO guidance to a range of $3.08 to $3.15 per share, which reflects the scheduled slowdown and the deferral repayments in 2022 that we noted on page 13 of today's press release. We continue to assume a 1% rent loss assumption in our guidance, which is what we've normally assumed in our guidance for a number of years, despite the fact that we typically run at about half of that rent loss level normally, and that's where we’re operating today as well. Well, we always try to get what we can, and sometimes we get 2%, but, I think, it's too early to say that the environment of today is going to notably impact the rent increase numbers, market rate for that -- and in the near-term anyway."
}