{
    "symbol": "NNN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 14:09:04",
    "content": " With regard to acquisitions, during the quarter, we invested just north of $150 million, 43 new properties at an initial cap rate of 6.2%, with an average lease duration of over 19 years, which 14 of the 16 deals were from relationship tenants, with which we do repeat programmatic business. The first half of the year, we invested over $350 million in 102 new properties with the initial cap rate of 6.2%, with an average of lease duration of 16.7. Based on our pipeline and dialogue with our partners, we remain comfortable with our ability to meet and hopefully exceed our '22 increased acquisition guidance of $600 million to $700 million, primarily via direct sale-leaseback deals with our company's long-duration, triple-net lease form, which is more landlord-friendly than a 1031 market deal. And likewise, the first half of 2022, AFFO included $3.5 million of deferred rent repayments in our accrued rental income adjustment for the first half, without which would have produced AFFO of $1.58 per share for the first half of 2022, which will on the same basis compares to $1.43 per share for the first half of 2021, and that represents a 10.5% increase year-over-year. And as we've discussed with investors, we burdened this \"free cash flow at a cost of 8% for purposes of making capital allocation decisions and new properties.â\u0080\u009d So there's nothing free about it in our mind, but it is a significant part of the equity need for, say, $600 million of acquisitions, especially if you couple it with $100 million of proceeds from dispositions. And since -- the last years, in the past in the history, I can talk a little bit about what we assumed last year and what we actually did last year and our initial -- before the beginning of 2021, we assume we'd issued 5 million shares of equity, and we've issued no debt. And I guess I'm curious, the backdrop doesn't seem to have changed that much, why there's still such a -- an appetite or so much positivity on the acquisition front, just kind of still given some of these headwinds on the capital market side, some concern about credit, cap rates not moving and things of that ilk. And so -- but the way I think -- the way we think about it here is we think of our property expense exposure as the tenant reimbursement minus our property expenses, it was about $1.8 million, I believe, for the second quarter, and that's detailed on Page 6, near the bottom of Page 6 of the press release."
}