{
    "symbol": "AZPN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-26 19:38:05",
    "content": " 05:21 The performance of our refining customers in the first half of the fiscal year gives us confidence that this vertical will support the MSC business returning to consistent double-digit annual spend growth, assuming a stronger budget and spending in calendar 2022. 09:00 Following are references to a few of the customer transactions closed in the quarter: First, our U.S. Headquarter engineering firm, a customer for close to 15 years increased its spend with Aspen Tech now that its business outlook is improving after having reviews, its software license entitlement at renewal at the beginning of the pandemic. 13:00 After a detailed analysis of the value capture opportunity, which was determined to be greater than $75 million per year and the estimation of the expected reduction in emissions, the customer committed to a site license for the Aspen DMC3 multivariable control technology and the Aspen GDOT multi-unit optimization technology in the MSC suite. 23:47 Turning to non-GAAP results, excluding the impact of stock based compensation expense, amortization of intangibles associated with acquisitions and integration planning related fees, we reported non-GAAP operating income for the second quarter of $92.2 million, representing a 53.8% non-GAAP operating margin, compared to a non-GAAP operating income margin of $162.2 million, and 69.4% respectively in the year ago period. Your line is open. Your line is open. Especially in MSC, when it comes to technologies like APC and optimization, we're now seeing and this is a third of those agreements in about a year, a year's time actually going back to Q4 of last year, were customers with very clear intentions to capture emissions are focusing on a total rollout of our APC advanced control technologies to capture the emissions and the value. Your line is open. Your line is open. Your line is open. Your line is open."
}