{
    "symbol": "AZPN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-08 18:52:08",
    "content": " Annual spend for the full-year for the heritage AspenTech business was $674 million, up 2.8% in the quarter and 8.5% year-over-year, which was above the high-end of our guidance range and free cash flow for the full-year for the heritage AspenTech business was approximately $286 million. Putting all these together, our current expectation is for ACV growth in fiscal year 2023 to be 10.5% to 13.5% for new AspenTech. And the low-end of the range assumes the macro outlook gets materially worse, due to economic conditions, COVID developments and/or geopolitical considerations, resulting in reduced customer spend for the heritage AspenTech suites with owner operators, supporting a growth outcome for those suites similar to fiscal year 2022 was the DGM and SSC product portfolios delivered a performance as projected in our guidance. Let me start with our reported GAAP financial results for the fourth quarter and the full-year fiscal 2022, which are not comparable to the guidance heritage AspenTech provided on its fiscal third quarter earnings call in April, due to the completion of the Emerson transaction and the associated accounting. As a result, you will see that the year-end results shown in our financial tables are for the nine-month period of October 1, 2021 to June 30, 2022 and includes the nine-month fiscal period of DGM and SSC financials and 45 days of Heritage AspenTech. ACV, which is a snapshot in time and unaffected by the timing of the Emerson transaction, was $791 million at the end of the fourth quarter, up 7.8% year-over-year, breaking that down further, Engineering ACV was $373 million, up 5.5%, MSC ACV was 275 million, up 11.5%, APM ACV was 30 million, up 14%, SSC ACV was 70 million, down 1% and DGM ACV was 43 million, up 19%. Note that we do continue expected improvement in heritage â\u0080\u0093 we do expect continued improvement in heritage AspenTech Nutrition trends in fiscal year 2023, and estimate approximately 3 points to 4 points of attrition. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. So, our expectation is that the real impact from tokenization will be felt in fiscal 2024 and beyond, but in the meantime, we were taking those products to market as term products, meaning we're trying to sell them on a term basis product-by-product and eventually we'll also compare those customers to full token customers, but our focus right now is on getting everything ready so that late this year, fiscal year and into fiscal 2024, we're in full mode of selling token licenses and really having a business where we've already de-bundled services and license with OSI and we're now already with a lot of momentum in the transformation of these two businesses."
}