{
    "symbol": "TUYA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 01:13:05",
    "content": " These measures span from product offerings to operating procedures to efficiency improvements, enabling us to sustain the 43% gross margin, while narrowing the non-GAAP net loss by 29% year-over-year from $109 million in 2021 to $77 million in 2022. Additionally, our Q4 non-GAAP net loss narrowed by 83% year-over-year to $5 million from $31 million, net cash used in operating activities was about $140,000 in Q4 and the $70 million in full year 2022, which was down 44% compared to the $126 million in 2021. For the full year and fourth quarter of 2022, our total revenue was $208.2 million and $45.2 million, down 31.1% and 39.6% respectively. SaaS and others revenue in the full year of 2022 increased by 6.6% to $29.8 million from $18.6 million in 2021, sustaining a strong growth momentum. Our IoT PaaS gross margin slightly decreased from 42.4% in 2021 to 41.1% in 2022, including an active 2.4 percent points impact caused by a $3.7 million accrued inventory allowance for certain slow-moving IoT chips and the raw materials during the year. In the full year of 2022, non-GAAP total operating expenses decreased by 23.1% to $188.6 million from $245.3 million in 2021. For the fourth quarter of 2022, non-GAAP total operating expenses were $33.5 million, down 46.4% year-over-year from $66.3 million in the same period of 2021. Our net cash used in operating activities for the year 2022 decreased by 44% to $70.7 million from $126.1 million in 2021 and by about 99.7% to $138,000 for the fourth quarter of 2022 from $53.2 million in the same period a year ago, thanks to significant reductions in operating expenses. As of December 31, 2022, cash, cash equivalents and short-term investments that were mainly in time deposits totaled $954.3 million, up $8.4 million quarter-over-quarter and down $111.8 million compared to the end of 2021. primarily due to operating cash outflows and $48.7 million in payments for share repurchase during the year."
}