{
    "symbol": "SPFI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-22 15:57:08",
    "content": " On todayâ\u0080\u0099s call, I will review the main drivers to our strong second quarter results, highlighted by robust organic loan growth, combined with stabilizing Mortgage Banking revenues, which taken together have increased the earnings power of South Plains as we look to the second half of the year. We delivered net income of $15.9 million or $0.88 per diluted common share for the second quarter of 2022, which compares to net income of $14.3 million or $0.78 per diluted common share in the first quarter of 2022 and $13.7 million or $0.74 per diluted common share in the year ago second quarter. Our second quarter 2022 results benefited from $0.25 per share of income received related to four loan credits for the recovery of interest income on previously charged off credits, purchase discount, principal recovery, and prepayment penalties. As a reminder, our first quarter 2022 earnings included $0.28 per shared net of tax of a positive fair value adjustment to our mortgage servicing rights and a negative provision for loan losses. The strong earnings growth that we experienced in the second quarter was primarily driven by the 20.8% annualized increase in our loan portfolio compared to the first quarter of 2022, as we continue to benefit from our newly hired commercial lenders who are building their loan portfolios more quickly than anticipated combined with our existing teams continued focus on organic growth. Additionally, we believe that we have ample liquidity to fund our growth, given our comfort, running the bank at a loan-to-deposit ratio in the mid to upper 80% range as compared to our 75.3% at the end of the second quarter. Looking to the second half of the year, we expect the financial benefits of our strong second quarter loan growth to continue to flow through to the bottom line as our mortgage revenues stabilize combined with our plans to continue to redeploy our excess liquidity. While we expect activity to slow in the light of the continued uncertainty about future economic conditions due to the rising interest rate environment and persistent high inflation levels, we remain cautiously optimistic on the second half of the year, as our loan pipelines remain healthy and our new lenders continue to have success in bringing quality credits to the bank. As Curtis touched on, loans held for investment increased by $126.9 million or 20.8% annualized compared to the first quarter of 2022 as outlined on slide five. In the second quarter, our Houston team grew their loan portfolio approximately a 122% compared to the end of the first quarter of 2022, which was primarily in commercial real estate. Overall, we grew total loans 28% in our major markets of Dallas, Houston and El Paso during the second quarter combined is -- can be seen on slide seven. During the second quarter of 2022, we recognized $898,000 in PPP fee income as an adjustment to interest income, which included accelerated income on PPP loans forgiven by the SBA. Excluding the $4.4 million of large loan recoveries and prepayment penalties that we recognized in the second quarter, our net interest margin was 3.54%, up 21 basis points as compared to the first quarter. During the second quarter, we did not record a provision for loan loss as we continue to experience improving credit metrics in our loan portfolio as non-performing assets to total assets declined to 20 basis points in the second quarter from 30 basis points in the first quarter of 2022. To conclude, our second quarter results represent an inflection point in our business, as our lending team is driving strong organic loan growth, while our mortgage business has declined from historic highs to more traditional levels."
}