{
    "symbol": "SPFI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 21:06:02",
    "content": " Second, our major metropolitan markets experienced 13.9% annualized loan growth to $879 million, which now represents 32% of our total loan portfolio at year end as our new lenders continued to successfully grow their portfolios. Turning to our results in more detail on Slide 4 of our earnings presentation, we delivered net income of $12.6 million, or $0.71 per diluted common share for the fourth quarter of 2022. This compares to net income of $15.5 million, or $0.86 per diluted common share, in the third quarter of 2022, and $14.6 million, or $0.79 per diluted common share, in the year ago fourth quarter. As we discussed on last quarter's earnings call, our third quarter 2022 results benefited from $0.10 per share of legal settlements, net of increased legal expense, and a negative provision for loan loss net of tax. We recorded a provision for loan losses of $248,000 in the fourth quarter of 2022 as compared to a negative provision of $782,000 in the third quarter of 2022 and no provision in the year ago fourth quarter. While we expect economic growth to slow in Texas as the Federal Reserve continues to raise their target benchmark interest rate, loan demand remains strong through our seasonally slower fourth quarter as we grew our loan portfolio 8.6% annualized from the third quarter of 2022. This strong loan growth contributed to net interest income growth of 13.7% to $138.5 million as compared to 2021, and which help to offset the 47.5% decline in mortgage banking income that we experienced through 2022. As Curtis touched on, long held for investment increased during the fourth quarter of 2022 by $57.7 million or 8.6% annualized compared to the third quarter of 2022 is outlined on Slide 5. As outlined on Slide 7, we grew loans in our metropolitan markets by $29.5 million in the fourth quarter of 2022, representing 13.9% annualized growth as compared to the third quarter of 2022. Year-to-date, weâ\u0080\u0099ve grown our loan portfolio by 19.2% to $879 million in our major metro markets, which have strongly contributed to the banks 12.7% total loan growth for the full year of 2022. Mortgage loan origination has decreased 17.7% to $125 million in the fourth quarter of 2022 as compared to the third quarter of 2022, as a result of rising market interest rates combined with normal seasonality. Starting on Slide 13, net interest income was $36.3 million for the fourth quarter of 2022 as compared to $35.1 million for the third quarter of 2022. Skipping ahead to Slide 17, our non-interest expense was $32.7 million in the fourth quarter of 2022 as compared to $37.4 million in the third quarter of 2022."
}