{
    "symbol": "FFWM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 14:39:08",
    "content": " We funded $482 million in C&I loans, which represents a 90% increase in C&I loans compared to the first quarter of last year. 49% of our C&I loans in the quarter were adjustable commercial revolving lines of credit, which continued to be a focus of ours over the past few years, and shifting the balance sheet to more rate neutral. On the deposit side, I would say that if you recall, I think last quarter, we talked about the fact that we had been -- when interest rates were zero and we had a loans-to-deposit ratio that was in the low 80s and then overhang was hurting them and we actually had to constrain some of our larger clients either by saying we can't take more deposit or we were tearing their relationships. But there's -- given where our platform is and given our strategic relationship with our core provider, there's significant opportunities not only on the deposit side, but additional fee income side that we continue to explore with them that is heavily focused on providing services to fintechs that are out there that are really looking for strategic bank partnerships. I mean, last quarter, I believe very close to it on average, we had about a billion two of excess deposits, which was a lot that they needed to put the work and we're going to wind up putting it to work, but it's one of those things that at the same time where you've got the Fed increasing rates and all those things going on. However, having no real wholesale exposure unlike years passed and having solidified our presence in the commercial deposit side of the business over the last several years has really put us in a position for large-scale growth in the deposit side that we can -- as Scott had mentioned, we can moderate and temper as needed. And then recently in the start of this quarter, there has been a downdraft again, but that being said, we're still adding a fair amount of new business, but we're also wanting to make sure stuff's not going out the back door either."
}