{
    "symbol": "FFWM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 16:22:11",
    "content": " Credit metrics remain strong in all our loan portfolios, the allowance for credit losses for loans increased by $339,000 in the quarter to $33.2 million, primarily as a result of increased loan balances, offset by the release of specific reserves related to purchase credit deteriorated loans from prior acquisitions. As Scott mentioned, we originated a record amount of loans with loan originations totaling $2.2 million for the quarter, which is a 96% increase from the first quarter and a 98% increase year-over-year. Contributing to loan originations during the quarter, our commercial business division funded a record $1.2 billion of new commercial loans during the second quarter of 2022, which is a 30% - with 30% of those being adjustable commercial revolving lines of credit. Deposit growth during the second quarter of 2022 compared to the first quarter of 2022 was primarily driven by an increase of $291 million or 8.8% in non-interest-bearing demand deposits largely attributed to our Commercial Deposit Services division and an increase in money market and savings accounts of $277 million or 10.7%, largely attributed to our retail branch and digital bank channel. The other benefit we're seeing on rate yields movement is certainly in our commercial book, a lot of that is either Prime, Libor, SOFR  and those we expect to see also still settling in, in the mid- to upper 4s depending on the business line and in some cases, in 5% to 6%. I mean, obviously, this quarter, you were able to really use the liquidity on the balance sheet to fund the immense  loan growth you had even at a slower pace of net growth, let's say, in the third quarter, although it sounds certainly - so its going to be a good quarter, you would need to effectively double the pace of deposit growth versus what it was in the second quarter to kind of fund that dollar for dollar and keep that loan deposit ratio in the ballpark where it is. Beyond that, it could be that we have to have some reliance of our - on something last core, provided that our loan growth continues at the forward pace that its beenâ\u0080¦\n I think what's Scott alluding to is, typically in the fourth quarter we have some seasonality around some of our commercial deposits that tend to have run down during tax."
}