{
    "symbol": "OFIX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 01:55:06",
    "content": " Some factors that could cause actual results to be materially different from the forward-looking statements made by us on the call include the risk factors disclosed under the heading Risk Factors in our Form 10-K for the year ended December 31, 2021 and Form 10-Q for the quarter ended June 30, 2022, filed this morning, August 5, 2022, as well as additional SEC filings we make in the future. In particular, we continue to see slower-than-expected rebound in elective complex procedure volumes due to ongoing staffing â\u0080\u0093 hospital staffing issues as well as patient reluctance to seek elective procedures in select areas, which impacted our BGT, Spinal Implants, and Biologics businesses. Starting with Bone Growth Therapies, or BGT, sales for the quarter were $48 million, down 4% on a reported basis and constant currency basis compared to second quarter of 2021. Starting with revenue, as Jon noted earlier, total net sales in the quarter were $118.1 million or flat at constant currency as expected when compared to the second quarter of 2021. GAAP gross margin in the second quarter of 2022 was 73% compared to 77% in the prior year period, due primarily to changes in our sales mix as well as increased inventory reserve expenses related to set builds for an expanding sales force and increased safety stock requirements driven by the risk of global supply chain disruption. Adjusted EBITDA margin in the second quarter decreased to 10% of net sales compared to 15% in the second quarter of 2021, driven by increased costs as well as investments in sales management, direct sales reps and the launch of AccelStim. The GAAP acquisition-related measurement expense year-over-year decrease of $9.6 million, primarily reflects a second quarter 2022 noncash credit related to the change in the fair value of the Spinal Kinetics contingent revenue milestone payment liability. For the full year of 2022, we now expect reported revenue to be in the range of $455 million to $465 million, which utilizing current FX rates represents flat to 2% growth at constant currency. Reflecting on our quarterly revenue cadence in the back half of this year, we anticipate that our third quarter revenue will reflect typical seasonality with a 3% to 5% decrease in procedure volumes sequentially versus the second quarter of 2022 as well as the increased FX headwinds from the strength in U.S. dollar versus the second quarter of 2022. As a result of the French reimbursement decision and the Lima partnership we mentioned earlier, we expect to see marginal increase in FITBONE revenue growth in the second half of 2022 and continued growth during 2023 and with the planned U.S. launch of the FITBONE Trochanteric nail as well."
}