{
    "symbol": "OFIX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 19:10:02",
    "content": " SeaSpine's revenue for the fourth quarter was $63.4 million, representing 14% growth over the prior year. U.S. Spinal Implants and Orthobiologics revenue grew 23% and 20% respectively in the fourth quarter over the prior year, primarily for new products and expanded distribution as a result of our efforts in recent years to partner with larger, more focused distributors. As Keith noted earlier, SeaSpine's total revenue for the fourth quarter of 2022 was $63.4 million, a 14% increase over the prior year. Products launched or enhanced via line extensions within the past five years continue to grow revenue and accounted for 82% of U.S. spinal implant revenue in the fourth quarter of 2022. International spinal implant sales were down 57% in the fourth quarter, due to our recent exit from the European spinal implant market in the third quarter of 2020. Our U.S. spinal implant surgery volumes increased 23%, compared to the fourth quarter of 2021, while revenue per case increased 4%, compared to the prior year. As for additional detail on the full-year revenue results that Keith mentioned earlier, 2022 revenue was $238 million, a 24% increase over 2021. International revenue increased by 66%, and was driven primarily by the final stocking orders to distributors in connection with SeaSpine's exit from the European Spinal Implants market in the third quarter 2022, and from significant revenue growth from the Enabling Technologies franchise. Turning to the performance of each of our product categories, starting with Bone Growth Therapies or BGT, sales for the quarter were $51 million, up 3% on both a reported and constant currency basis, compared to the fourth quarter of 2021. Moving to Spinal Implants, which includes both Spinal Fixation and motion preservation, revenue was down approximately 7% on both a reported and constant currency basis, compared to the fourth quarter 2021. Starting with revenue, as   noted earlier, total net sales in the quarter were $122.2 million, reflecting flat sales at constant currency when compared to the fourth quarter of 2021. International total net sales were $26.6 million, or 22% of total revenue, up 6% in constant currency over the fourth quarter of 2021 as a result of strong growth from strategic investments in the commercial channel and momentum coming from new product introductions. We reported GAAP income tax expense of $75,000 or 1% of the loss before income taxes in the quarter as compared to the prior year expense of $23.2 million or 242% loss before income taxes in the same period of 2021. Our free cash flow burn was $34.7 million for the full-year 2022 and included strategic investments in inventory and spinal implant set builds, and over $5 million in actual milestone payments related to our partnerships with , CGBio, , and MTF to accelerate new product innovation to support revenue growth, as well as merger and integration costs and $23 million in CapEx for spine implant set builds and leasehold improvements to our Lewisville, Texas headquarters building. In terms of financial guidance, at this point, we are providing a revenue range for the full-year 2023 between $743 million to $753 million, which represents 7% to 9% year-over-year constant currency growth, compared to the approximately $701 million of pro forma combined company revenue for full-year 2022 after giving effect to anticipated reclassifications to conform SeaSpine's revenue reporting to that of Orthofix. Additionally, we expect first quarter 2023 revenues in the range of $166 million to $170 million, which represents 7% to 10% year-over-year constant currency growth compared to the approximately $158 million of pro forma combined company revenue for the first quarter 2022."
}