{
    "symbol": "OFIX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 22:42:26",
    "content": " Starting with Bone Growth Therapies, or BGT, sales for the quarter were $46.5 million, up 3% on both a reported and constant currency basis compared to third quarter of 2021. However, Motion Preservation exited the quarter with year-over-year growth in September in the U.S. Lastly, in our Global Orthopaedics business, revenue for the third quarter was up 6% on a reported basis and 19% on a constant currency basis over 2021. The combined company will be a leading global Spine and Orthopedics company with highly complemented portfolios of Biologics, Innovative Spinal Hardware, Bone Growth Therapies, Specialized Orthopedic Solutions and a leading surgical navigation system with products that will be distributed in 68 countries worldwide, a global R&D and manufacturing footprint and revenues of nearly $700 million we are positioned to become the sixth largest global spine business. As John noted earlier, total net sales in the quarter were $114 million, reflecting 5% growth at constant currency when compared to the third quarter of 2021. The primary drivers were growth coming from the BGT new product introduction of AccelStim, Biologics new product introductions of FiberFuse last year and Virtuos in the second quarter; and finally, investments in the commercial sales channel within U.S. Orthopedics. In the near term, we will continue to advance several of our growth drivers, including the launch of key spine fixation products, continued focus on our fracture channel and BGT with the AccelStim launch, increasing our channel expansion, product launches to expand our leading platforms in orthopedics with Fitbone and TrueLok, expanding Biologics portfolio and the continued focus and expanded adoption of M6-C our artificial cervical disc, I'd like to provide a quick update on each of these growth drivers. What it comes down to the -- we see the expanded breadth of the portfolio for distributor conversions as well and assisting in that, whether it be international or in the U.S. And we also have this whole area of complementary revenue that we -- whether it be Motion Preservation or 7D or BGT that creates great pull-through opportunities in the U.S., and we're looking for that opportunity outside the U.S. BGT has a very specific, both direct and indirect channel, but they take opportunities to have partnerships with other distributors that basically work in that in the Spine and Orthopedic space."
}