{
    "symbol": "CAMP",
    "quarter": 4,
    "year": 2022,
    "date": "2022-04-28 22:50:03",
    "content": " We ended our 2022 fiscal year, with software and subscription services revenue of $41.2 million in the fourth quarter, representing a record 60% of our total consolidated revenue of $68.4 million. Highlighting the quarter was our software and subscription services business, with revenue increasing 19% year-over-year and 13% sequentially to $41.2 million, representing a record 60% of consolidated revenue. And so fair to say, with all these transitions, we’ve been successful to date 100% in converting our customers over to the new service and we have an ambitious schedule in the next quarter and as I mentioned on the call, expect to fully complete this with very little customer loss throughout the fiscal year 2023. And all that aside, Orin, I would say that when I look at our quarter and where we stand today, and Kurt mentioned in his script that we have $285 million of backlog plus RPO outstanding and that should give investors a clear view that we are doing a really nice job driving our customers to committing to revenue going forward. Yeah, well, that’s the or the benefit of the subscription model, we do have not only future looking commitments from our customers to these MSA arrangements to activate additional device-enabled solutions, but the install base in and of itself provides an added layer of revenue, so you would expect that installed base to help build for revenue growth as well as to help in enhancing our overall gross margin. With that in mind, and given the success we’re experiencing with converting our base of customers, we do believe that reaching a target of somewhere between 1.2 million and 1.5 million subscribers is very reasonable and obviously, that will help us to drive that revenue, not only in the upcoming fiscal year, but obviously into the future, because most of these contracts are 36-month contracts with renewal provisions that extended out close to 60 months. And maybe one last one, assuming a three year payback for a subscription versus the one-time sale that we’ve seen for MRM historically, that ratio would suggest about $25 million of lower MRM sales once the conversion is complete."
}