{
    "symbol": "EXR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 18:10:28",
    "content": "  Operator: Good day, and thank you for standing by. Welcome to the Q2 2022 Extra Space Storage, Inc. Earnings Conference Call. And I would now like to hand the conference over to your speaker today, Mr. Jeff Norman. In addition to our press release, we have furnished unaudited supplemental financial information on our website. Forward-looking statements represent management's estimates as of today, August 3, 2022. And with that, I'd now like to it over -- time over to Joe Margolis, Chief Executive Officer. Thanks, Jeff, and thank you, everyone, for joining today's call. Before I report on our performance, I am happy to announce that we recently published our Annual Sustainability Report. We are proud to be a sector leader, not only operationally, but also in sustainability. I encourage you to review our report, which is posted on our Investor Relations website. Year-over-year same-store revenue growth in the quarter was 21.7%, matching our first quarter growth rate. Despite expense pressure on several line items, NOI growth remained very strong at 26%. This was achieved primarily through year-over-year rental rate growth, partially offset by a modest decrease in year-over-year occupancy due to elevated vacate activity. With manageable new supply and durable customer demand, we continue to operate at high occupancy with strong rates. Despite inflation and the potential effects of recession, we believe we are well positioned to continue to produce strong results due to our resilient need-based asset class, diversified portfolio, strong balance sheet and best-in-class team and platform. During the quarter, we invested $289 million in property acquisitions and we invested an additional $92 million in July, bringing year-to-date totals to $610 million. We have continued to focus on acquiring nonstabilized properties and, as we outlined last quarter, have started closing more transactions in joint venture structures. We started to see the market shift late in the quarter with increasing interest rates, reducing the number of bidders at the table and the bid-ask spread widening between buyers and sellers. We are being selective with our acquisitions, and we are focused on transactions and structures that will be accretive for our shareholders. In the quarter, we closed $70 million in bridge loans, and we added 40 additional stores gross to our management platform. We also made a creative storage investment, purchasing an existing storage company named Bargold Storage solutions. It is focused on leasing space and apartment buildings, primarily in New York and subleasing storage spaces to residential tenants. The acquisition of Bargold added over 17,000 units to our portfolio with an occupancy rate over 97%. Due to the unique nature of its operations, we have retained their team and are keeping the entity running as a separate organization. Our strong property NOI, plus our external growth efforts, resulted in core FFO growth of 29.9%. It has been another great quarter, and we are well on our way to another strong year. While we expect our rate of growth to moderate in the back half of the year due to very difficult comps, we expect it to remain well over historical averages, with modeled year-over-year revenue growth remaining in the double digits through 2022. Thanks, Joe, and hello, everyone. We had a strong second quarter, ahead of our own internal projections. Our outperformance was driven primarily by strong property performance, which benefited the same-store pool, joint ventures and management fees. As Joe mentioned, we were active on the external growth front. We issued $22 million in operating partnership units as part of the Bargold transaction, bringing year-to-date issuance of equity to approximately $60 million. In the second quarter, we repurchased approximately $63 million of shares -- in shares at an average price of $165 per share. Due to the wide spreads in the investment-grade bond market, we've been active with our banking relationships. Last week, we completed an accordion transaction in our credit facility, adding $600 million of unsecured debt within the facility across 2 tranches. Our plan to term out debt using the investment-grade bond market has not changed, and we expect to utilize this market again once conditions normalize. Our leverage remains low, with net debt to EBITDA of 4.4x, and our unencumbered pool is over $13 billion. We continue to have access to many types of capital, and we have significant debt capacity to support future growth and maturities, albeit at higher interest rates. Due to our year-to-date outperformance and improved outlook for the second half of the year, we updated our 2022 full year guidance. We've increased our same-store revenue guidance to 16% to 18%, driven primarily by rental rate growth. We strive to be efficient with expenses, and we believe our continued investment in our people and our properties are contributing to our top line growth. Consequently, we experienced same-store expense increases across several line items, and we have increased our expense guidance to 7.5% to 9% for the full year. As a result, our same-store NOI growth range increased to 18.5% to 21.5%, the highest NOI growth guidance in our history. Given our total investment activity year-to-date of $790 million, we have increased our acquisition investment guidance to $1.2 billion, only $250 million of which is unidentified. As a result, we have increased our interest income guidance by approximately $3 million. Due to the increase in interest rates as well as our higher acquisition volume, we've increased our interest expense guidance by $13 million at the midpoint. The sum of these adjustments result in an increase in core FFO, which is now estimated to be between $8.30 and $8.50 per share. We anticipate $0.20 of dilution from value-add acquisitions and C of O stores, in line with last quarter's estimate. we're having a great year, and we are positioned for continued steady growth. And with that, operator, let's open it up for questions. The first -- I had a couple of questions, I guess, on the Bargold acquisition. Sure, Todd, and thanks for your clever title to know, we all got to chuckle out of that. And just underwriting what exists today, the first year yields in the low 4s and it grows to the mid- to upper 5s. So kind of similar to urban property investments, I would say. And then our hope is, of course, we're going to first try to institutionalize the business, introduce things that they haven't done. In terms of technology, they don't charge administration fees, they don't offer insurance. And that's kind of the first step of the plan is to institutionalize it and bring some Extra Space's, expertise and procedures, processes to it. And if that works, then we'll take it outside of New York City. And can you speak to some of the -- I mean, you characterized it as a creative investment. So the business is leasing space in apartment buildings, and it's primarily basements and garages, building those spaces out. So if you walked into them, they would look exactly like the interior of one of our modern self-storage facilities and then leasing that only to tenants in the apartment buildings. So because of that, your customer acquisition and marketing costs are almost nothing. It's a -- your incremental cost to grow the business is very, very small because you're not buying any real estate. So we bought the business, we bought the platform, and now it's capital light going forward. They operate at occupancy of over 97%, and they have over 1,000 people on the waiting list. The rate increases are limited in some instances and coordinated with the landlord because the landlord doesn't want a tenant to be unhappy or be using money he could for increased apartment rent, for increased storage rent. And then one last question, if I could just switch over towards -- to the leasing environment and rental activity. Occupancy is at a very healthy level, but rentals were up pretty big year-over-year. And I wouldn't have thought that there'd be significant incremental demand, I guess, from some of the pandemic drivers that we saw earlier during the latter part of '20 and 2021. And it seems to be fairly strong, perhaps stronger than expected. Yes, Todd, if you look at kind of our surveys and the questionnaires we give our customers, it's come back to pre-COVID answers. It's largely coming from people moving, lack of space obviously is needed, but not what it was in COVID. Our vacates are elevated slightly now, partly due to the existing customer rate increases that have gone through over the last year as we move people quickly to street rates because these state of emergencies have been removed. So while vacates have been elevated slightly, rental activity has been really good. This company has historically operated at, what we would consider, very, very high occupancy levels. And then maybe just one more, just on the leasing front. I mean, yes, leasing has been strong and demand has been strong, but we haven't seen it diminish to the extent we could say it's leasing from a future period that's been pulled forward. No, that kind of answers the question, right, exactly. If you guys aren't seeing a deceleration -- that's material, then that kind of answers the question. We've recently attended a conference, in which there was anecdotes in which, some market participants have been seeing such deceleration. So the fact that you guys have not, answers my question, like you said. Juan, this is Scott. And we do anticipate moderation, as Scott said in his remarks. But if you look at our guidance, we'll end the year in low teens positive revenue growth, which is just a fantastic number. It sets us up really, really well ahead into 2023. Normally, the point of contention, and the point of stress is taxes, but that's actually a bright spot relative to some of the other increases. I mean, taxes, we are seeing things get reassessed in that 5% to 7% higher. We have been the beneficiary of some appeals, which has offset some of that increase. So overall, we're seeing increases, but the appeals are clearly benefiting us. In terms of payroll, we continue to see wage pressure. So last year, we had negative expense growth in the first half of the year. So as we resume more to normal hours, as more normal staffing, that is an increase year-over-year that we would not expect to go into next year. We would expect some wage pressure, but not the hour adjustment. In terms of other things, we also continue to see pressure -- inflationary pressure on utilities, on repairs and maintenance. And as your revenues grow, your credit card fees grow. So while inflation does impact your expenses, you also have some opportunities on the revenue front with month-to-month leases and that shorter-term lease really is a benefit to us. And next, we have Jeff Spector of Bank of America. Joe, I just -- I think I heard you comment quickly on -- looks like a good set up for '23. And interestingly, that's kind of been the a key debate I've had today with some incoming calls, again, strong results. So if we end the year at low teens revenue growth and knowing how increases and decreases take time to roll through the rent roll in storage, it takes a while for any weakness if we see that, if you're looking for a downside scenario to roll into results. I'm just doing math, above long-term historical averages in revenue growth. And expenses, we'll continue to try to manage as well as we can. But we're going to have -- we have really hard comps this year, we're going to have fairly easy comps next year. And moving out of the store arena, everything else is growing really rapidly. As the transaction market gets tougher, people tend to seek other solutions and sale, which are both -- which could be Bridge Loans. Some of our other things that we do or seem to be shaping up and hopefully, we'll talk more about that later. July continued from June rates were reasonably flat, June to July. Last year, like I mentioned, the rates really peaked in June, July of last year. So as last year's rate comp becomes easier, we hope that August continues to go well. But 2 days into August, it's all looking good still. It seems like you're very comfortable continuing to push rate on the customer, the customer is taking it. So when we talk about the health of the customer, we get a lot of questions about this. We look at things like bad debt, your accounts receivable, you look at rates where they are today versus where they were. In terms of accounts receivable, they're pretty consistent with where they were last year with the historical norms. In terms of rate, we compared to 2019, our in-place rents are up 26%, 27%. So while year-over-year looks really big, like a really big jump. When you go back a few years, it's more affordable and maybe it doesn't -- not as extreme as people would think on the surface. Jeff, I would add, we have stronger markets and we have markets that are less strong. And we have the tools to address individual areas or stores or markets of weakness, and we feel lucky to have a really broadly diversified portfolio. And next, we have Keegan Carl of Berenberg Capital Markets. I know this is addressed a bit early on in the call, but acquisition guidance is obviously raised again. Just curious if you could give us a little bit more color on how much competition you're truly seeing for these assets, that's over the last quarter? Folks who rely on leverage really heavily, have -- many of them have gone through the sidelines, but there's still bidders. And cap rates is always a hard thing to tell, right, because it's -- the data lags and each transaction is kind of unique, its own. I'm not sure if I understood your question correctly, but... So, I misunderstood the question. Because last year, we were so constricted by government regulations where we couldn't -- even if we wanted to, we couldn't send rate increase notices. What I would say is that pre-COVID, we had a pretty formulaic approach in terms of cadence and amount of rate increase we sent to customers. And during COVID -- during the period of time we voluntarily didn't send out rate increase notices, and then when the governments of the various states told us we couldn't, we kind of kicked off with that formulaic approach. Keegan, about 63% of our tenants today are below street rate. So obviously, they're eligible. And next, we have Smedes Rose of Citi. But I would say before the interest rate increases happen, pricing was so strong -- well, first, let's back up a little bit. 2021, you had strong pricing, you had fear of capital gains, tax increase. Getting into 2022, you had strong pricing and low interest rates. Scott, just curious on the New York MSA. I'm looking at the numbers, I think revenue growth even accelerated meaningfully kind of in the second quarter. I'm trying to figure out if it's sort of -- because the New York MSA will include New Jersey, maybe there's some restrictions being lifted on the rent side. So when we break it out between the boroughs in New Jersey, our Northern New Jersey stores are performing better than our boroughs. Now we don't have a huge number of stores in the boroughs, so it might not be a great comparable. But both markets are performing below the average of the portfolio, but New Jersey is definitely performing better than New York. Pretty similar, very similar to what we talked about last quarter. There's certainly headwinds in terms of interest rates, cost, entitlements but it's not going to 0. There's still is new supply being delivered, and there's still an awful lot of interest in people wanting to build new self-storage. But I guess on the topic of rent increases, would you be able to share what the average magnitude of rent increases you're currently pushing in your portfolio and how that's changed compared to the first quarter? Because we have this weird situation, a unique situation, excuse me, of folks whose rent was artificially suppressed by government regulation at a time when street rate was increasing. So we had some larger the normal gaps between what people are paying a street rates, and we were trying to catch up. So there's a wide variation in the amount of rent increase customers are getting, and I'm not sure an average is meaningful because of that. I think you saw some that were larger than the average as rate restrictions were lifted, and we moved them quickly to the current market rates. And that benefit as you move throughout this year, obviously, decreases because you were doing many of those late last year and early this year. So towards the end of last year, we were more appropriately staffed and second quarter was -- and into the third quarter was kind of the low point in terms of staffing hours and being understaffed due to turnover. I think in your prepared remarks, you talked a little bit about potentially cross-selling between Bargold users and your current Extra Space units. Well, the first thing we're going to do is absorb the existing business. One of the ideas, you're right, is they have such a long waiting list is could we provide some option for the Bargold tenants on the waiting lists to store their stuff in Extra Space units and then maybe give them a priority to get into a Bargold unit would that -- would not help Extra Space. And yes, we -- once we digest Bargold, and we feel we have it rhyme the way we want, absolutely, we're going to try to expand it first in Manhattan and other parts of New York and possibly then afterwards to other major cities in the country. Just going back to some of the breadcrumbs on the same-store growth, talking about the exit rate for 2023 or for 2022 and thinking about that as a starting point for 2023. I think the earlier comments you -- was suggested that it could be in sort of the double digits for second half of this year, therefore, 2023 double digits on the table. So I think last quarter, we said we expected lifting of the California state emergencies to add 50 basis points to the same-store portfolio. We thought that when we increased rates to street rates, we would push more people out the door. But in fact, we've been conservative in that assumption. And then my last one is just on Bargold, if I could sneak it in. The -- because these are leases and the rent is just a percentage of revenue, there's no fixed rent in these leases. We -- our systems are better than theirs, and I'm not saying anything negative about the company. It's a very successful, well-run family company, it was, but we have more capabilities than them. And next, we have Joab Dempsey of Truist. So the average number of units in the building is 25, but there's a pretty wide range of that. I think the largest building is 800 units, which is kind of similar to a store, but there's also buildings that just have a handful of units. The reason kind of boards or call-up boards building owners would do this, and so they don't have to handle it. So Bargold, now Extra Space handles getting the -- through in the unit, dealing with payments, dealing with nonpayments and auctioning the units. Out of their 17,000 -- over 17,000 units, they auctioned about 20 a month last year. So the rate is very, very small. It works just the -- laws are the same, and it works just like storage. It does get tricky looking at these kind of statistics because you have such a tough comp from last year, and it's not like everyone moves in. Let me clarify one thing first, Ki Bin. So the month of July, we were about 5% to 7% negative in our achieved rate growth and that's year-over-year. So if you compare to where tenants were moving in last year versus this year, we were slightly negative. In terms of the roll down, our in-place leases today -- our achieved rates are about 7% below where they were where our achieved rate is today -- I'm sorry, they're above. And normally, at this time of the year, they're flat. Last year, they peaked in June and July, and they came down in August. So depending on what happens in August with our current rates, those could be flat again at the end of August. Just on Ki Bin's question on the in-place -- or sorry, the achieved rates, I apologize. Quarter, I know you get the July figures. So April, May, they were slightly positive. June, down about 6%. July, you were down that 5% to 7% range again. And again, last year, you were pushing rates in June and July pretty hard. I mean, the list of properties in what markets are outperforming, Atlantic continues to be a standout market for us. Most of the Sunbelt continues to be strong with South Florida, Miami being exceptionally strong in the Sunbelt, Miami and Atlanta. It's a small market, but Charleston is one that has kind of jumped up and was -- had a bunch of supply and wasn't on our list earlier. And then one last quick one, an incoming question. I don't have that number, Scott. Joe, so 2 topics. And you had a really nice slide at NAREIT, which broke out length of stay between those greater than 12 months and those greater than 24 months. And that showed you know the data, but -- so that you're up to 66% greater than 12 months and up to 48% for greater than 24%, up from about 60% and 40%, respectively, pre-COVID. And that has caused a very slight moderation or dip in those numbers that you referenced in terms of long-term stay, but they're still very high and elevated from any historical period. Does it reflect, Joe, do you think all those where you had a significant number of new customers that came to storage, I think over COVID, it was like 50% of the customers were new. So I guess in reverse order, we don't see anything on a regional basis. And our theory, which I think you're referencing here, theory, that the customers who came to us in COVID for lack of space because they were doing a home office or whatever. They don't all stay forever, but many of them are sticky. I mean there's always anecdotes, but I don't think I would be comfortable saying that we see a trend or a movement or anything like that. You said the average lease length that Bargold has, it was 10 to 15 years. So on lease end, there are several options very, very rare does the building owner ask for this deal to be removed. A portion at the end of the lease term, they automatically convert to month-to-month leases. And do you sort of see, Joe, this business as being -- it's hard to probably compare, but do you want to put this into more owned like co-op condo buildings or you sort of see this more as a rental building product? It could also provide you lower customer acquisition costs, too. We will tend to take a very data-oriented approach to that, probably more so than the prior quarter. So a lot of the questions that you have are the questions that we have, and we're going to learn about it. On the best case where we can grow this thing, gigantic scale and it's lots of apartment buildings, then that does become a competitor for traditional urban self-storage. But if that's the case, I want to be the one to be the first mover in that. Next, we have Jeff Spector of Bank of America. Promise, just one follow-up. I appreciate taking the follow-up, hopefully, quick here also. And then on that 63% of customers, though, that are currently paying a rate below street rate today. You said that, that is higher than it has been historically. I actually don't have this right -- we don't have it in front of us, Todd, just more of the recent numbers. I would now like to turn the conference back to the CEO, Joe Margolis for closing remarks. Thank you, everyone, for your time and interest in Extra Space. The growth front, as we talked about, is really strong. Our scores are up very, very much this year. So it's just a great time for us at Extra Space, and we appreciate everyone's support. You may now disconnect, and have a pleasant day."
}