{
    "symbol": "EXR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 15:55:05",
    "content": " I will now turn it over to Jeff Norman, Senior Vice President of Capital Markets. These forward-looking statements are qualified by the cautionary statements contained in the companyâ\u0080\u0099s latest filings with the SEC, which we encourage our listeners to review. Forward-looking statements represent managementâ\u0080\u0099s estimates as of today, November 2, 2022. With that, Iâ\u0080\u0099d like to now turn it over to Joe Margolis, Chief Executive Officer. Thanks, Jeff and thank you everyone for joining todayâ\u0080\u0099s call. We had another strong quarter with same-store revenue growth of 15.5%, driven by strong rental rate growth, partially offset by lower year-over-year occupancy. We felt expense pressure across many line items, resulting in total same-store expense growth of 12.6% and same-store NOI growth of 16.4%. We continue to be busy on the external growth front, adding 40 stores gross to our third-party management platform, closing over $100 million in bridge loans in closing a number of acquisitions, most notably the purchase of Storage Express. We view Storage Express as a strategic opportunity to acquire not only an attractive portfolio with operational upside, but a remote storage platform. In September, we started to experience a return of seasonality, putting some pressure on occupancy and new customer rates, which were both modestly lower than our third quarter forecast. As we evaluate our standard metrics to measure demand, we see the moderation we have typically expected in the fall that did not occur in 2021. While traffic is lower year-over-year, demand is in line with pre-COVID levels. Fundamentals remain strong, just not as off the chart strong as they have been in the last six quarters. As a result, we have tightened our same-store revenue, NOI and core FFO guidance ranges, eliminating scenarios that assumed only minor seasonality on the top end of the range as well as more bare scenarios, which we do not believe will materialize. We never liked the idea of having to reduce our outlook, but we are also careful to maintain perspective. And this is on the back of 2021, which was our second highest revenue growth year. As we contemplate future potential economic landscapes, including additional inflation and/or recession, we are well-positioned to continue to produce solid results due to our resilient need-based asset class, diversified portfolio and best-in-class team and platform. We had a strong third quarter, $0.01 ahead of our own internal FFO projections. While same-store revenue was generally in line with our expectations for the quarter, we did have higher than expected bad debt expense. In other words, our customersâ\u0080\u0099 ability to pay for storage doesnâ\u0080\u0099t appear to have changed as much as an auction buyerâ\u0080\u0099s willingness to pay for auctioned goods. In the third quarter of 2021, we had same-store payroll expense of negative 9% and property tax growth of negative 4.5%, which drove total Q3 2021 expense growth of negative 4%. If we evaluate our third quarter expenses on a 2-year stack, average payroll expense growth was approximately 5.2%, average property tax expense growth was 3.1%, and total â\u0080\u0093 and average total annual same-store expense grew 4.2% a year. Turning to the balance sheet, during the quarter, we completed an accordion transaction in our credit facility, adding $600 million of unsecured debt across two tranches. We capitalized the Storage Express transaction with $125 million in OP units at an average price per share of $201.84, with the remainder drawn on the revolving credit facility. Subsequent to the end of the quarter, we swapped $200 million of our variable rate debt to reduce our floating interest rate exposure to approximately 35%. Additionally, our bridge loan balances provide a hedge against increases in variable rate debt effectively reducing the percentage to approximately 31% of total debt. As Joe mentioned, we tightened our 2022 guidance. Given the outsized growth and unique customer trends we have experienced over the past 2 years, we have had a wider-than-normal guidance range throughout the year to capture all of the different scenarios that we believe were possible. However, it was also not as severe on the low end, resulting in the tighter range. Interest expense estimates have increased due to debt associated with Storage Express, other acquisitions, additional bridge loans and an increase in benchmark rates. Given our total investment activity year-to-date, we have increased our acquisition investment guidance to $1.65 billion, all of which is closed or under contract. After these adjustments, we have tightened our core FFO range, which is now estimated to be between $8.30 and $8.40 per share and implied increase of approximately 21% year-over-year. With that, operator, letâ\u0080\u0099s open it up for questions. Jeff, your line is open. I guess, Joe, can you provide any other stats or any other details to give investors comfort that again this is just normal seasonality, especially given you are right, your team normally forecast really well. We have no history of data about how customers react, coming out of a pandemic and therefore, we gave wider-than-normal ranges, because we had less confidence in our ability to exactly predict how customers would perform. What we see on fundamentals though, we do see slowing in demand in rates, in other metrics compared to the last six quarters or so. But if you look at pre-pandemic numbers, things look very strong and we are very comfortable with the state of the business. Maybe just to clarify one point, the slowing in demand is year-over-year. So what we have in October, maybe just to give a bit of an update for October. Our October numbers, our occupancy is down about 30 bps from September, so not significantly different from the end of September and our rates have been steady through the month of October. No, I think if you look at our guidance range that will give you an indication of the range of where we believe we will end 2022. Michael, your line is open. From our work, your exercise of web asking rates or street rates, have been down year-over-year through the quarter. At the same time, your occupancy rate maybe hasnâ\u0080\u0099t had as much pressure as others. So clearly, the goal here is that youâ\u0080\u0099re looking to maximize revenue. Weâ\u0080\u0099re trying to maximize revenue by using all the tools available, whether thatâ\u0080\u0099s occupancy rate, discount, marketing expense, days to reserve, all the different levers we can do and itâ\u0080\u0099s done on a unit size in each store basis, not on a portfolio basis or a market basis. When you roll all of that up together onto a portfolio basis, we are certainly now favoring occupancy at the expense of rate. And by creating long-term revenue growth, you mean bring people in, get them into the system and get them on the ECRI program. Certainly, ECRI is a very important factor there, and itâ\u0080\u0099s also trying to attract as many longer-term customers who have a longer lifetime value than a customer whoâ\u0080\u0099s going to come in maybe at a higher rate, but spin out after 2 or 3 months. And then as my follow-up question, housing turnover has been under pressure for a number of different reasons. Overall, a strong housing market is beneficial to self storage, and we would prefer a strong housing market than a weak housing market. That being said, there is lots of different drivers of demand for storage, and we see solid demand in good and bad housing markets. And the best example of that is during the great financial crisis where the housing market was arguably in much worse shape than it is now, and we didnâ\u0080\u0099t see any drop in demand because we had demand from other types of transitions, other movements that made up for the slowdown in housing transitions. Todd, your line is open. First, I just wanted to follow-up on the outlook and the reforecast here for the balance of the year. Can you talk about the occupancy decrease, it sounded like that fell short in the third quarter relative to what you had budgeted previously. It looked like average occupancy increased from 2Q to 3Q, which I think a typical seasonally. Certainly, post Labor Day, July and August were good for us of our forecast. Post Labor Day, I think what changed is I think you saw that seasonal occupancy go back more to the norm than what weâ\u0080\u0099ve seen in the last 2 years. I think it came a little quicker than we were expecting when it did come, and as a result, it impacted rates. So, not necessarily occupancy but much more new customer rate coming in and seeing a little bit of deceleration there in terms of our rate. So our promotions year-over-year were actually down slightly in the third quarter, and weâ\u0080\u0099re not using promotions right now. Whatâ\u0080\u0099s in the near-term, I think, is internal growth by getting them or getting Storage Express, I shouldnâ\u0080\u0099t say them onto the Extra Space, pricing ECRI, customer acquisition platform, and we think we can improve the existing assets performance. Until we can do that, get them on our platforms, we wonâ\u0080\u0099t aggressively pursue external growth. Your line is open, Juan. Maybe just following up on Toddâ\u0080\u0099s question on Storage Express, it definitely seems like youâ\u0080\u0099ve talked to you in your opening remarks about the strategic opportunity to widen the opportunity set and maybe acquire assets that you otherwise wouldnâ\u0080\u0099t have. So, weaker demographic than our existing portfolio, we wouldnâ\u0080\u0099t expect to have similar demographics in more secondary or tertiary markets. We wouldnâ\u0080\u0099t expect to have the same rate growth, but we wouldnâ\u0080\u0099t expect to pay the same amount on a price per pound for the asset. So, itâ\u0080\u0099s all about proper underwriting, getting compensated for the risk youâ\u0080\u0099re taking and understanding. We look at our portfolio, which is about 10% in tertiary markets now. We look at the performance of primary, secondary, tertiary market, how their CAGRs compare over rolling 10-year periods every year. And we understand that tertiary markets can be more volatile, but they also can provide very good returns. So I think itâ\u0080\u0099s about investing at the right basis making sure youâ\u0080\u0099re underwriting each deal properly, understanding that in many of those markets, youâ\u0080\u0099re the only REIT that â\u0080\u0093 we could be the only REIT that operates, which gives you somewhat of an advantage. Juan, the other thing I would emphasize is some of these remote assets will be in our core markets. And then just â\u0080\u0093 any comments on supply, I mean I would assume that youâ\u0080\u0099ve seen delivery delays this year and maybe the â\u0080\u0093 whatâ\u0080\u0099s coming on next year may be coming down as well. But just a view, again, going back to Storage Express between what the pipeline looks like in some of these secondary or tertiary markets that have been arguably some of the hottest housing markets in some cases and maybe getting outsized attention relative to history? So the first part of the question, overall, we donâ\u0080\u0099t have any new information or data or view is still that storage deliveries are moderating, not going to zero, not dropping off the cliff, but they are moderating that there are continuing headwinds in terms of costs and interest rates and entitlement issues and the availability of debt, and thatâ\u0080\u0099s going to be good for the industry. When weâ\u0080\u0099re ready to start growing this platform, we will find the right markets. We will have our guys do all the research they always do, and we will make sure we understand all the dynamics of the market before we put our investorsâ\u0080\u0099 dollars into that market. So, in July, we saw rates down about 7% â\u0080\u0093 or achieved rates. They were down about 7%, 8% in August and then low double digits in September. So, we averaged about negative â\u0080\u0093 just about 10% negative in the third quarter. So, you mentioned that demand is roughly in line with pre-COVID levels. But given that work from home or the de-cluttering cohort is a relatively new demand driver for the sector, this would seem to imply that the other more traditional demand drivers are contributing less than average. So, the kind of work-from-home de-cluttering demand, that was more of a 2020 â\u0080\u0093 December 2020 into 2021, maybe experience. We are back to more â\u0080\u0093 today, we are back to more traditional demand drivers for new demand. For new demand, correct, yes. But I am just thinking, so as we â\u0080\u0093 because I am just looking at occupancy right across the sector, and we are starting to see occupancy return closer to the historic average that we have seen within the REIT portfolios for some time. So, I understand that it might not be contributing to new demand. But as we think about where occupancy is trending, there is arguably a new user base, right, within your portfolio. So, I think you are only partially right. But I think there is a cohort of them that continues to use storage, and you can see that in our length-of-stay statistics, where during COVID, we had a real sharp increase in customers in our stores who have been with us for more than a year, more than 2 years. Lately, we have seen that decline a little bit, but we are still at above historic averages. So, that is telling us that some of those customers just like some of every customer that comes in some small percentage of them become that kind of permanent or quasi-permanent customer. No, thatâ\u0080\u0099s what I am saying, I guess. What I am saying is I think we are saying the same thing, so that a portion of that new customer base, right, work-from-home is staying, which I think most of us would agree that thatâ\u0080\u0099s the case. So, I think we can operate our stores or whatever occupancy we want, right. Please standby for the next question. I just wanted to ask you a little more, and I am sorry, maybe I misunderstood this, but in your core FFO, where you added back I think $0.05 or $0.06 associated primarily with Hurricane Ian and the uptick in tenant reinsurance or the claims. So, $3 million of that is losses from tenant reinsurance. So, those are claims made by our customers that we will be paying out. The other piece of the loss, the $3.2 million, that is for property loss and our loss number is actually higher than that because that is net of the estimated â\u0080\u0093 the property insurance proceeds that we think we will receive. We viewed it as non-recurring, much more one-time is the way we viewed it. And then you talked about leverage being like a little skewed just because you have capitalized the Storage Express transaction, but we donâ\u0080\u0099t have the earnings from it. We felt like it was stabilized around a $6 million and the first year, obviously, lower than that, but stabilizing around $6 million. And itâ\u0080\u0099s an interesting one conceptually for me to try to understand yield, right. Because what we are doing is taking the cost for an entire business platform, software, people, trucks and office buildings, etcetera, etcetera, and saying the existing stores produce a return on all of that. I wouldnâ\u0080\u0099t compare it to the acquisition of a building that produces a yield because we are really buying more than just 106, 107 buildings. Please standby for the next question. If you look at our tenants in our properties today, you are 35-ish â\u0080\u0093 34 months, 35 months in terms of customers that are in there today. If you look at the tenants that have been in our properties over 2 years, that number continues to grow. So, the transaction market has certainly changed. Cap rates are expanding as interest rates rise, which is natural. We see lots and lots of deals that are not getting closed, including us. I donâ\u0080\u0099t think there is really any way to say with any precision what new cap rates are, how much cap rates have expanded. You talked about sort of the pricing that achieved pricing in 3Q and so forth, which was helpful. So, COVID and the restrictions the states put on our ability to increase rents, coupled with the rise in Street rates created that unusual situation of an extra large gap between what Street rates were and what people were paying. So, we will not see â\u0080\u0093 well, we still will see attractive ECRI going forward. And then going back â\u0080\u0093 Sorry, did I get you all. Going back to the guidance, I think your opening comments, I think you talked about sort of the ranges, bull case off the table. And I think Scott referenced earlier that after Labor Day, we saw somewhat of a change in customer behavior and a return to seasonality. And our kind of wider-than-normal guidance at the top end, at the bottom end, had different assumptions about where that will occur. And now that we have seen it begin to occur, we can narrow that guidance with more comfort that we know how customers are behaving. At this time, I would now like to turn it back to Joe Margolis, CEO, for closing remarks. If I could leave you with a couple of thoughts, itâ\u0080\u0099s that 2022 is going to be another exceptional year. Even with slowing growth in rates and very difficult comps, revenue growth is very strong, and we expect it to be solid in 2023 as well. Storage is better positioned than most, if not all asset classes to endure future inflation or test or whatever type of economic slowdown we face."
}