{
    "symbol": "ETSY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 20:31:08",
    "content": " In spite of these headwinds, we're encouraged by the tens of millions of shoppers that return to Etsy spending only slightly less with us in the second quarter of 2022 than they did a year ago, when choices were far fewer and economic conditions were a lot different. Kruti will hit the ground running at Depop in September where sheâ\u0080\u0099ll be focused on incorporating our product development culture to increase product velocity with goals that will sound a lot like what sheâ\u0080\u0099s accomplished for the Etsy Marketplace, highlighting sellerâ\u0080\u0099s unique inventory, improving search and discovery, elevating the human connections on the Marketplace and making Depop more relevant to more of its target audience and building trust in the brand and of course, driving ROI focused marketing investments that deliver results. On a consolidated basis our second quarter GMS was basically flat year-over-year at $3 billion, while revenue increased 10.6% year-over-year to $585 million and adjusted EBITDA was $163 million with a 28% margin. The Etsy marketplace transaction fee increase and growth in Etsy ads drove strong revenue performance, and we delivered adjusted EBITDA margins ahead of our expectations due to disciplined marketing spend and solid profit flow through. The second quarter featured challenging comparisons as our consolidated GMS increased 13% year-over-year in the second quarter of 2021 on top of a 146% expansion in the second quarter of 2020, fueled by the initial broad-based pandemic lockdowns. Moving to product development, in the second quarter, consolidated product development spend was $102 million up 65% year-over-year, largely driven by headcount growth, including the Depop and Elo7 acquisitions. Our brand marketing spend increase 4% year-over-year in the second quarter, as Etsy was on air in our top three core markets with spending somewhat elevated versus the same time last year. As a reminder in the third quarter of 2021, Etsy reported consolidated GMS growth of 18% on a year-over-year basis. Recall that in the fourth quarter of 2021, Etsy reported consolidated GMS growth of 17% on a year-over-year basis."
}