{
    "symbol": "NOMD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 15:10:59",
    "content": " So we -- when you compare, let's say, the minus 3.2% that we are -- we have, excluding the Adriatics for the existing business in terms of sales, we would do a pro forma of Q2 for the Adriatics -- and we would include it obviously in the full -- in the business, we would be just short of plus 1% for the full business. Maybe just what I would just add, I mean, to Stefanâ\u0080\u0099s point is the fact that effectively, this year, we have seen as well an acceleration of the business driven by the fact that the tourism has caught up as well which effectively has pushed the impulse category probably even further. And there is a secure balance of things that's beyond from a mix standpoint and there is as well, let's say, an increased support, I mean, driven by the promotion that we need to put in place in order to drive the business over which effectively equates to the low single-digit growth for the base business. But as I said, for all the reasons I mentioned, like going to other species which are not Russian, what's more southern hemisphere which is more going to Pangasius which is also about plant protein, we see that it's starting to go down and it will go down and down over the next quarters and years. And I would say, if I again, I could see, looking forward, it's going to be really a combination of whitefish between the U.S., Russia or Chinese Russia but also, let's say, the farm fish, mostly coming from Vietnam at the right level will be very important for us. What we've done on energy is we have taken a hedging approach, I mean, to that -- so that we started since the beginning of the year that has enabled us to level off the cost this year and be well ahead if you answer throughout, let's say, the middle, 3/4 of the next year. And we see tourism going back and combined with a very hot summer, we see a effective combination of, let's say, the  line and the business is doing very well this year compared to the prior year."
}