{
    "symbol": "REE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 11:28:13",
    "content": " I would now like to turn the call over to Kamal Hamid, Vice President of Investor Relations. Thank you, operator and thank you all for joining our fourth quarter 2022 conference call. Any statements describing our beliefs, goals, plans, strategies, expectations, projections, forecasts and assumptions are forward-looking statements. Please note that the companyâ\u0080\u0099s actual results maybe different from other anticipated by such forward-looking statements for a variety of reasons, many of which are beyond our control. Please refer to the companyâ\u0080\u0099s Form 20-F filed on March 28, 2022 with the Securities Exchange Commission, which identifies principal risks and uncertainties that could affect our business, prospects and future results. We assume no obligation to publicly update any forward-looking statements, except as required by law. In addition, we will be discussing or providing certain non-GAAP financial measures today, including non-GAAP net loss and non-GAAP operating expenses. Joining me today is our Co-Founder and CEO, Daniel Barel; Tali Miller, our Chief Business Officer; Josh Tech, our Chief Operating Officer; and Yaron Zaltsman, our Incoming CFO, who will join the Q&A session. At this point, I would like to turn the call over to Daniel. As we look to 2023 and beyond, we have further important milestones to achieve, including the completion of certification activities, the deliveries of initial vehicles and the successful completion of the test fleet phase, which we expect will lead to receipt of additional orders. Since November 2022, we quadrupled our customer base from 2 to 8 in different industries, such as vehicle rental and leasing, shipping and logistics and dealers. In addition to their initial orders, we believe those customers have the potential to order significant volumes of vehicles. We achieved key development milestones in 2022, with total GAAP operating expenses of $127 million and non-GAAP operating expenses of $101 million on-time and in line with budget. In addition, we delivered two different prototypes to a leading OEM for testing and validation. One of those vehicles is our P7-B, which is undergoing testing and customer evaluation and the other is related to a long-term project. I would like to thank Tali, our Chief Business Officer and her team for their tireless efforts to build our order book and expand our go-to-market channel. With that, I would like to hand over the call to Tali. Interest in our EV solutions continues to be robust that fits both large and small, seek to lower their carbon footprint, and increase efficiency. We continue to conduct additional customer evaluations with prospective fleets, delivery, logistics and e-commerce companies as well as dealers in North America and other major markets around the world. Subsequent to the end of the fourth quarter of 2022, we started establishing a dealership network across the U.S. We have initially entered into an agreement with 5 authorized dealers: Pritchard EV, Tomâ\u0080\u0099s Truck Center, Industrial Power & Truck Equipment, New England Truck Solutions and FMI Truck Sales & Services. Orders for the P7-B are for chassis configurations, while orders for Proxima Powered by REE are for strip chassis and a full vehicle via our partnership with body app feature, JB Poindexter & Co. Both the P7-B and Proxima Powered by REE leverage our P7 platform, which features full x-by-wire architecture supporting all-wheel steer and drive adaptive regenerative braking and torque vectoring as standard as well as over-the-air updates. Our vehicles set a new standard in commercial EVs offering the greatest interior space on a given footprint, optimize driver ergonomics and ease of maneuverability. As we seek to further expand our dealer network in the U.S., we can now offer financing solutions to our dealers through an agreement with Mitsubishi Hitachi Capital America, to provide financing solutions to dealers in the REE network. We expect to continue to deliver test fleets in 2024 as well as to start converting these test fleets into scale orders in 2024 onwards, subject to successful testing and certification. By bolstering direct sales activities to large fleet owners while also growing our network of dealers, REE now covers the channels through which medium-duty commercial vehicles are acquired. Having reached a production-intent level, much of the intensive R&D and engineering spending is now complete, in part contributing to the significant decrease in planned cash spending from 2022 to 2023. Additionally, we are accumulating durability and validation miles according to plan to support this certification, which is expected to be completed in the second half of 2023. As we continue our validation and verification protocols, we have ordered components for 25 P7 vehicles and submitted production forecasts with our suppliers for our main components through 2024. During the fourth quarter of 2022, we commenced the build of the first batch of P7 production intent vehicles, which were completed subsequent to the quarter. As previously reported, we finalized the build-out of our integration center in the third quarter of 2022. All major equipment is in place and we have established a production capacity for 10,000 vehicle sets annually. During the fourth quarter of 2022, we validated the assembly process and drive cycle our modular production line comprised of 13 highly automated manufacturing cells. Also, our supply chain is now built out, including the recent announcement of Microvast as our battery supplier. In order to achieve that, we are working with our suppliers to optimize production tooling and bill of materials to further reduce the production cost required. With that, let me hand the call back to Daniel who will take you through the financial and commercial outlook. We achieved key development milestone in 2022 on time and in line with budget with total non-GAAP operating expenses of $101 million, total GAAP operating expenses of $127 million. The decrease in GAAP net loss compared to the third quarter of 2022 is mainly driven by lower operating expenses, including transaction costs. The decrease in non-GAAP net loss versus the third quarter of 2022 is mainly attributed to the decreased operating expenses, including transaction costs. As of December 31, 2022, the company had $153.6 million of liquidity, comprised of cash, cash equivalents and short-term investments and no debt. Before we open the call up for questions, Iâ\u0080\u0099d like to thank David Goldberg for his contribution in helping building out our finance team, and to Hans Thomas for his dedication, support and belief in our mission. I want to extend a very warm welcome to our Yaron Zaltsman, who we are all excited to work with and to our two new Board members,  who will bring vast industry experience to REE. Operator, please open up the call for questions. Your line is open. Hi, good morning, and thanks for taking my question. I guess I expect a dealer ought to be ordering in the hundreds, if not thousands of vehicles, based on what other EVs have been getting from their initial dealer orders business. Just to â\u0080\u0093 kind of clarity on whatâ\u0080\u0099s going on, what are some of the ins and outs of the order book, whether itâ\u0080\u0099s yours or from the dealers directly. So right, as we said, we â\u0080\u0093 since November 2022, we grew our order book from 3 to 35 firm per orders. Thereâ\u0080\u0099s a much bigger and more important message here, where each of those carefully chosen fleet, logistics and dealers customers has potential to are very large numbers of units for many years. So assuming we receive certification and our platform perform to spec, which we believe it will, then it isnâ\u0080\u0099t a leap to see that how these customers can contribute to very robust order book in the near future. And thatâ\u0080\u0099s, of course, as we expect to sign even more customers. I just Iâ\u0080\u0099m curious whether the orders youâ\u0080\u0099ve received, that you mentioned, the 35, are reflective of your volume expectations for the full year. So â\u0080\u0093 no, thatâ\u0080\u0099s a good question. What weâ\u0080\u0099re doing now is weâ\u0080\u0099re very, very carefully selecting our customer base. Weâ\u0080\u0099re doing this on the basis of their market potential and of course their readiness to electrify, if they are fleets, the readiness to accept electric vehicles and if they are dealers, their ability and readiness to sell this to their customers. Because weâ\u0080\u0099re ramping up on production, itâ\u0080\u0099s very important for us to prioritize how many orders and to which weâ\u0080\u0099re delivering first batches. So listen, we had $154 million on the balance sheet at the end of 2022, and we have no debt. So once we begin SOP, we believe that the vast majority of capital-intensive cash burn is over for the foreseeable future. So therefore, as for additional capital, we carefully watch the market condition explore the option for raising debt or equity capital in the right phone and time. And maybe last one for me, we had the NTEA Show last week, booth looked great, looked pretty crowded in the booth. It has been â\u0080\u0093 the thing quite a show, it will be very busy, as you just mentioned. We have seen a lot of interest in EV in general, and in our products in particular. We see interest from large fleets, logistic companies and e-commerce as well as from dealers and also OEMs. So at â\u0080\u0093 in the risk of repeating myself, I would say that it is extremely important for us to deliver those first deliveries spot on, right, and to make sure that our deliveries are successful on-time, on-target, on-TCO, to those customers and prioritizing those who ordered and are waiting for the vehicles as we grow our ordering book more and more. Your line is open. So, $154 million funded through or into commercialization. I am wondering, how are you thinking about your capital needs following that, right, particularly as you begin to ramp up orders and ramp up production. Again, so like you said, there is $154 million on the balance sheet at the end of 2022, and we donâ\u0080\u0099t have debt. So, yes, we think we have sufficient liquidity to take the P7 platform into commercialization and continue to advance the other commercial projects. We would be looking, I mean in the market, and we would be exploring opportunities and options for raising debt and equity capital. And thatâ\u0080\u0099s, again, we are going to base this on the business cycle and needs. And maybe as a follow-up, was just wondering, this is a bit more of a macro question. In fact, itâ\u0080\u0099s possible that if the macro was different, REE and basically the whole EV system would have seen a much faster, steeper growth. And that being said, based on our conversation with large customers, for example, we see obviously nothing that will derail the electrification of global delivery fleets. Luckily for us, our capital-light strategy and modular approach will allow us to flex our production quickly as adoption accelerates. And importantly, I mean we believe our modest cash burn compared to some of our other competitors will allow us to be one of the beneficiaries of this huge multi-decade trend. On the supply side, as we said, we have a steady supply chain where we are monitoring the disturbance within the supply chain, we are having multiple suppliers where it makes sense to make sure that we have ample supply to what we need. I mean in the end, we are starting to build the first delivery vehicles, and we said we have ordered 25, set to 25 for this year, right. Obviously, those are small numbers in the grand scheme of things, so and as we ramp through the hundreds and thousands. So, we â\u0080\u0093 in the near future, we see no issues at all with the supply. I mean â\u0080\u0093 and hopefully, as we ramp through the thousands that the concerns alleviate even more from the industry. Your line is open. I think Josh, do you want to take this, maybe and I will complete. As we said, we are looking to build our winter test vehicles and ship them up immediately, thatâ\u0080\u0099s happening soon, and then complete first our x-by-wire validation, and then completed by the rest of the vehicle. So, thatâ\u0080\u0099s slated for the second half of the year. Well, the â\u0080\u0093 if you think about it, the x-by-wire, itâ\u0080\u0099s the same system, so we will do those concurrently. And then the comment, Josh, that you made about the 25 unit order for the parts and components for the second half of the year. I mean if you think about it, those orders are going to cover the vehicles we need for homologation and testing for both the Proxima and the P7 platform, the P7-B and then of course, the first vehicles to be delivered. So, the planned supply chain, as there is no issue with what we are planning versus the build plan at the moment. And if I could just squeeze in two more, if Tali had to pick one variable thatâ\u0080\u0099s leading to the demand, in your pitch, you highlighted 10 to 15 different reasons why you think your solution is better than the incumbent. I think the most important element that customers are looking for is the TCO, if I need to pick one, total cost of ownership. As we said before, we have partnered with Hitachi America on that to provide, among others, charging infrastructure for our partners, those who need some. But you are touching on the right point, right, because in order to transition the fleet to an EV, there is a lot of infrastructure thatâ\u0080\u0099s needed. And itâ\u0080\u0099s not only, by the way, itâ\u0080\u0099s just the charging, itâ\u0080\u0099s also if you have enough power, that you can draw in terms of the need of the fleet. So, I want to thank the REE team for doing a really good job in 2022 in accomplishing a lot of things that are very difficult to do."
}