{
    "symbol": "REE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 13:58:08",
    "content": "  Operator: Greetings, and welcome to the REE Automotive Second Quarter 2022 Earnings Conference Call. I would now like to turn the call over to Limor Gruber, Vice President of Investor Relations. Thank you, operator, and thank you all for joining our second quarter 2022 conference call. Any statements describing our beliefs, goals, plans, strategies, expectations, projections, forecasts and assumptions are forward-looking statements. Please note that the company's actual results may be different from other anticipated by such forward-looking statements for a variety of reasons, many of which are beyond our control. Please refer to the company's Form 20-F filed on March 28, 2022, with the Securities and Exchange Commission, which identifies the principal risks and uncertainties that could affect our business, prospects and future results. We assume no obligation to update publicly any forward-looking statements, except as required by law. In addition, we will be discussing or providing certain non-GAAP financial measures today, including adjusted EBITDA, non-GAAP net loss and non-GAAP EPS. Joining me today is our Co-Founder and CEO, Daniel Barel, who will provide an overview of our business; Josh Tech, our COO, will then provide you with an operations update; our CFO, David Goldberg, will continue with a discussion on our financial results and outlook. At this point, I will turn the call over to Daniel. Good morning, and welcome to our Second Quarter 2022 Earnings Call. As customer evaluation progress, we are seeing strong interest in electric vehicle powered by REE, and we expect to receive firm orders in the next few months and to start delivering test fleet to our customers. Commercial owners and operators are highly sensitive to vehicle uptime, durability and efficiency. In addition to pounding the ground and deploying test fleet Powered by REE, regulatory tailwinds such as the recent Inflation Reduction Act are supporting the shift of major commercial fleets to electric vehicles. As Josh will describe shortly, as we progress towards initial capacity of 10,000 vehicle sets this year, the launch of our second integration center is also progressing. When complete, this facility will double our production capacity to 20,000 vehicle sets annually. As you may recall, our P7 platform, which we revealed at the beginning of this year, is a modular platform designed to accommodate commercial vehicles from Class 3 to 5. Since that reveal, we have debuted 2 full vehicles, both powered by our P7 platform. As many of our listeners today are aware, we hosted an investor event 2 weeks ago, during which we showcased the Proxima Powered by REE, a classified walking band and the industry's first fully by wire commercial vehicle. This event followed a series of evaluations by prospective fleet customers with leading positions across delivery, logistics and retail segments. In addition, we have been testing and showcasing the P7-B, a Class 3 box truck, at our U.K. engineering center for several months now. For those of you who might have missed it, recent announcement and the investor event, I'll take a moment to describe some of those 2 EVs benefits. On Slide 6, Proxima, Powered by REE is the most advanced working van in existence. The body is designed by EAVX and built by Morgan Olson, both subsidiaries of JB Poindexter, a company with significant market share and a multi-decade track record in upfitting commercial vehicles. REE, the manufacturer of record, provides the backbone of the vehicle. The technical benefits of our chassis coupled with the commercial domain expertise and state-of-the-art body by Morgan Olson, deliver what customers and their drivers are looking for efficient and durable electrified vehicle that can be optimized for specific use cases resulting in attractive economies. During evaluations, we heard from potential customers that they appreciate this game-changing advantage that include enhancement of mobility and safety with all-wheel steer and all-wheel drive, low stepping high for efficient delivery cycle times and agronomics that reduce driver distraction, providing fleet efficiencies and driver wins. Proxima Powered by REE has many other amazing features, and I encourage you to watch the replay of the investor event on our website if you have not done so. On the back of the customer evaluation of Proxima Powered by REE, we expect to receive firm orders for test fleet from multiple customers and we look forward to sharing more with you soon. We believe orders for test fleets will mark the beginning of multiple long-term relationships, and that REE will receive larger orders after customers collect validating data and positive driver feedback. But we believe our product is the best-in-class, and that our go-to-market partnership for the Proxima body and the P7 chassis is a real competitive advantage. Proxima powered by REE went from concept to product design from the ground up in just 1 year, a very short time by industry vehicle development started. The second vehicle we unveiled, the P7-B has undergone month of positive and encouraging customer evaluation at our engineering center in the U.K. and is on track for 2023 production. The P7 is built on a Class 3 P7 chassis, the same platform underlying Proxima Powered by REE. That means it delivers many of the same fleet and driver benefits, which we believe will deliver lower TCO, total cost of ownership. The on-track testing of the P7-B, an extensive potential customer evaluation, is a crucial step on the road to commercialization. Feedback from prospective customers has been that this is the truck they have been looking for, one that drives like a sedan, that is built to deliver under the harshest commercial duty cycle. As we have demonstrated, because of its modularity, we are able to quickly deploy our technology for a variety of applications. This allows us to access distinct go-to-market channels, including designing and building our own vehicles for direct sales to fleet customers as in the case of the P7-B and through partnerships with upfitters. As we shared before, REE is the manufacturer of record for Proxima and P7-B, making us responsible for the homologation and certification of the electric platform. Additionally, core control systems, software and functionality, safety development, key elements of the development of mission-specific variation enabled by REEcorners are progressing according to plan. While our main focus is commercialization of P7, we have other projects in various stages of development, and we will share updates about this as appropriate. With this, I would like to pass it on to Josh for an update on our operational progress. While I met many of you at our recent IR event, this is my first earnings call at REE. Operationally, our core U.K. engineering team is now substantially built out. Our engineering test fleet in the U.K. is accumulating durability miles, progressing through verification and validation activities in preparation for production of design intent builds later in the fourth quarter. Our first assembly line will soon be installed in our Coventry, U.K. integration center, which is our launch factory and blueprint for all future integration centers. It is expected to have a capacity of 10,000 vehicle sets by the end of this year. The Austin, Texas integration center is also underway with the shell of being stood up and complete. I would add that our first integration center is nearly complete, and we have the ability to accelerate the development of our second integration center, if needed, by replicating the template of the first integration center. Now I would like to give you more color on our integration centers, which will use robotic assembly cells, underline electrical tests and auto boxing stations. First, it provides the ability to validate all assembly cells quickly by testing and optimizing 1 cell and then implementing those best practices across all others, which will reduce the time to design and develop additional assembly lines. Second, the module production line is also highly automated and flexible, meaning that we can scale for dam depending on future variance and demand. Finally, assembly cells and production lines can be officially lifted and installed at future integration centers as well as we apply one global standard using the plug-and-play format. This allows us to use cloud-based solutions, giving us complete visibility into all production operations and enabling us to scale manufacturing, both locally and globally across all integration centers. These integration centers will be linked to our control center, where we can achieve an overarching view and build perspective along with full traceability of our REE solutions. With that, I'll hand over to David Goldberg, REE's CFO, to discuss our financial results. Before opening the call to Q&A, I'd like to discuss the company's results for the second quarter, then reiterate our expectations for 2022. The increase is mainly related to lower income from warrants remeasurement, partially offset by lower operating expenses. The non-GAAP net loss of $21.3 million in the second quarter of 2022 decreased compared to $28.3 million in the first quarter of 2022, primarily due to the timing of expense recognition related to development and production capacity costs. We remain on track to meet our guidance for cash spending in 2022 at a range of $130 million to $150 million, inclusive of both capital and operating expenses. Accordingly, expenses are dependent in part on the timing and achievement of certain milestones related to the company's commercial programs and projects and may not be linear throughout the year. As of June 30, we had approximately $207 million of liquidity comprised of cash and short-term investments and no debt. We continue to have sufficient funding to execute the programs that Daniel described, and to advance other commercial activities. As you may have seen earlier today, the company filed a shelf registration statement. As a reminder, we have a CapEx-light business model. Because of this model, each of our integration centers require capital and tens of millions of dollars, significantly less than the hundreds of millions or billions of dollars required to build a large factory typical of other OEMs. While we believe a significant opportunity exists beyond P7, the vast majority of our budget has been allocated towards execution and commercialization of this platform in the U.S. and Europe. The cadence of our spending will be indicative of our progress, and we will continue to update our shareholders on budget expectations as the year unfolds. With that, we would like to open the call for questions. However, the approach is dependent on the structure of the market in different classes. So when you look at Class 5 and when you look at walk-in van, it is customary for the chassis to be purchased separately from the body and of course, for the upfitters and the chassis builders to work together to supply a full vehicle to the fleet. But -- sorry, not about that but this is the way it works traditionally. And this is how we work with EAVX and Morgan Olson, which is -- which are a great, great partners with a great track record. However, when you look at, for example, Class 3s and you look at cab chassis and box truck, it is customary that the manufacturer of record in that example as to manufacture the entire cab chassis and sell it directly to the fleets on which they will later on put on a box, which they will purchase from any box manufacturer as such, for example, Morgan and others. So there's not been any change in our strategy, just different vehicle categories. Sorry, when you say -- I mean, on margin, I think the margin profile or at least the economics are going to be similar across both vehicles. The event that we've had with the Proxima, of course, it was really exciting and we have really strong feedback from. But to many of those customers and leading fleets that attended, it was not entirely new because they were part of that development cycle and they were part of that design. But in general, I think that we are very, very encouraged by the feedback that we've got and by the level of acceptance we've seen from those fleets. So naturally, since we are little in the midst of negotiating with quite a few fleets. But having said that, I think we have a very appealing offering and very competitive market positioning on the â\u0080\u0093 on both vehicles, actually. And one of the reasons that weâ\u0080\u0099re able to be that attractive is because of the CapEx side model that helps us to reduce significant costs that are inherent in traditional OEM other than us, of course. David, maybe one for you. So really, the shelf and the ATM is good housekeeping. As we said in the release or in the script, no intention to use the ATM today. And I'll remind you that from a P7 perspective, we're fully funded. And maybe as a follow-up, with the integration centers becoming operational, first in the U.K. and then the one in the U.S. next year, are there any risks to the 10,000 platforms per year capacity just given the continued supply chain disruptions? We are on track with everything coming online, and we don't expect any hiccups to get to 10,000 vehicle sets by the end of the year and double that next year. So we have this two-pronged approach, right, where we're supplying the chassis to Morgan Olson, and then we have the P7, which is our own integrated vehicle. In general, we're targeting the 2 largest segments in commercial vehicles, right, Class 3 and Class 5. The difference in those vehicles is quite major because they're not only bill differently, they serve different needs. And some of our customers might have a mix of them, but they're using it differently. And some of them, as some of you saw, actually shared publicly what they think about those trials and the relationships. Now as I mentioned earlier, some of those fleets and other companies and owners have been part of the development and design stages, which is very important when you create a brand-new vehicle, taking their needs and voice of the customer. Now the next phase in bringing products to the market, in most cases, after that demos is deploying test fleets. And since we're working with literally the largest fleets in North America and Europe, the timing of the testing phase is customer dependent. However, once testing phase is complete, we will become an approved supplier and participate in the electrification of their fleet and benefit from significant recurring revenue. Now if you look at Class 3 and Class 5, we see around 750,000 commercial trucks in Class 3 and 5 that are relevant for P7, and they all need to electrify. And although we're not the only ones in this race, from speaking to customers, there is a lot of white space. So I think the path that we're laying towards getting those, both Proxima Powered by REE and P7-B, to market and to customers is really, I mean, detailed and straightforward. And Daniel, just one follow-up. As we think about the integration centers coming online, I know you said in the past, it's kind of a template model once one is up and running and you work out the kinks. Yes, itâ\u0080\u0099s a good question. So realistically, we say sub 12 months, 10 to 12 months, we can do it. The real advantage is not only because the robotic cells that we have done are constantly being updated and changed from lessons learned basically, it becomes for us almost an off-the-shelf product because we validated it, and we just order more and scale those accordingly. But the more important part is because we have the CapEx-light model, the equipment itself in terms of its industrialized equipment, of course, robots and all the safety guarding and things like that, but itâ\u0080\u0099s not large equipment like presses and things like that where we have to do custom infrastructure. For example, we donâ\u0080\u0099t have to do pits or things like that on the floor. So itâ\u0080\u0099s like as you can see, weâ\u0080\u0099re doing in Austin, the building is already complete. So that whole advantage of keeping it CapEx light, not only helps with the entire supply chain, but it also helps with the ability to bring up the infrastructure extremely quickly, if we need to. We will now take the next question, and it comes from the line of Jeff Osborne from Cowen & Company. Daniel, a couple of questions on my end. We are currently running a fleet of P7-Bs, and we intend to deploy test fleet, I think in the next few months for our multiple customers. And this is -- and the reason is that the idea is not to only test the vehicle itself, but actually how vehicles Powered by REE fit into the fleet itself, fit into the infrastructure. What's the feedback from drivers on day-to-day routines, et cetera, and the size of those fleets is mainly customer dependent. The goal for each of those fleets, however, is the same, which is proving the advantages and capabilities of those vehicles in order to allow for scale adaptation at all. Keep in mind that it's not just -- the reason I'm saying is it's not just the vehicle that matters, right, somebody needs to put in substractor to charge it, to maintain it, et cetera. It's more than just providing the vehicles and then having the seat idle without use, which, of course, is the sense of doing so. And then for David, I just wanted to -- maybe a multipart question on the cash. It sort of gets back to the question I was trying to ask Daniel if you're going to see a bunch of capital in the developing 40, 50, 100 vehicles to be tested without revenue. So a, right, we remain disciplined. And so when you think about the guidance that we gave to the market earlier this year, we're still very much on track in that regard, and that includes the testing activities that Daniel mentioned. I think this -- I mean, again, I think we're just really on track for that total number for the end of the year. So the full year guidance, I think, it's $130 million to $150 million. I believe you're trending below that, I think it's like $55 million year-to-date. So there would be -- I mean, it does -- yes, the math does imply a bit of a step up. But again, I think I want to stress that we're very much on track. So it's going to be -- again, we're not giving specific guidance within the range, but I would say, closer to the midpoint. And then, yes, like if you think about it, we've already started some of the spending to build the test fleets that hasn't hit the P&L, but some of the cash has already gone out the door. And then also remember that as we're engaging with customers, some of those test people will actually generate revenue as well. You just demoed the vehicles, so you should get in the next 3 months or so orders for prototypes for test fleets. And then in 6 months, we would get like firm orders. I mean roughly, it sounds reasonable that -- it's -- the idea is this, right, there's been very positive reactions. Having said that, I think what's important to emphasize, and I think I said it on the Investor Day and also and we reiterate that on the PR, we intend to announce only firm orders. So basically, orders that we intend to manufacture in the foreseen or short future, immediate future and not general concrete -- or general plans that might not be firm. We negotiate terms, we deploy test fleets, those fleets test those vehicles for different durations of time depends on who they are. Some test them for a few weeks, some test them for a few months. And then we move on to adaptation, right, and become an approved supplier and general recurring revenue from recurring purchase holders. And you mentioned you need -- it's not only buying the vans, it's also you need to actually set up the infrastructure. Yes, that's a really good question. Unfortunately, it depends on the customer. So for some of the customers, we provide a full turnkey solution. Also, we have partners for financing for that charging infrastructure and so on and so forth. And of course, vehicles and nationwide service locations and so on so forth. For other fleets or other customers, they like to do everything in-house themselves. So they have their own suppliers for charging infrastructure maintenance, where we will give them the training and, of course, corners at spare part, but they will do the maintenance for themselves. So we are able to provide both, and we've seen a mix -- a healthy mix of some at one way and some that one down this. Lastly, I would like to take this opportunity and thank team REE for dedication and focused execution, which allows us to keep meeting our targets even in the current volatile macro environment as we advance forward and more sustainable carbon-neutral world, including a fully electric vehicle future."
}