{
    "symbol": "NRXP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 22:10:12",
    "content": " We've reinstituted our clinical trials for NRX-101 for patients with suicidal treatment resistant bipolar depression, we've continued to align with FDA on a path to approve NRX-101, and this week we announced encouraging findings from the first evaluation of unblinded data by our independent data, safety, and monitoring board. As the first potential oral NMDA antagonist target bipolar depression with suicidality, NRX-101's proof-of-concept data from the Phase 2 STABIL-B trial has shown a highly differentiated therapeutic profile compared to the other commercial therapies and investigative drugs under development. In January 2023, we initiated a Phase 3 registrational clinical trial of NRX-101 for the treatment of severe bipolar depression with acute suicidal ideation and behavior and contracted the first study site. Based on the DSMB's finding together with the recent completion of Phase 3 anticipated commercial stage manufacture of NRX-101, the company has upgraded the ongoing trial to a Phase 2b/3 trial, whose results may be used in a future registrational filing should the primary endpoint commit. Based on the comments and guidance from the FDA in its recent Type B meeting regarding the registrational Acute Suicidality trial and a potentially broader indication, as well as the guidance we received from the DSMB regarding our currently enrolling Phase 2b/C -- I'm sorry, 2b/3 clinical study of NRX-101, the company is evaluating changes to its registrational program for NRX-101 and will speak to consolidate the current clinical trials. And in order to continue to support the clinical development of these programs, we announced the close of the $2.9 million registered direct offering to support our pipeline efforts and more specifically, the initiation of an expanded access protocol and safety database for NRX-101 studying treatment-resistant bipolar depression with risk of self-harm. We believe that NRX-101 is a potentially life-saving medicine that could change the treatment paradigm for individuals with bipolar depression who are experiencing suicidality, which is the driving force behind our mission of meeting the needs of underserved patients with serious CNS disorders. And you've seen us talk about how we're going to start building that safety database not only through our clinical trials, which take a while to enroll and are expensive to enroll, but also through an expanded access program that would allow doctors who have patients with bipolar depression and have exhausted approved medications for the treatment of bipolar depression to gain access to NRX-101. And the exact words, if you're able to prove that you improve depression in this population of patients who have suicidality, who have been excluded from previous trials, where there is no antidepressant that's indicated for use, no oral antidepressant because there's been some encouraging data with Johnson & Johnson does ketamine product, but there's no oral antidepressant thatâ\u0080\u0099s indicated for use in these patients with suicidality, that's great."
}