{
    "symbol": "GMDA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 13:54:11",
    "content": " During this call, we may make Forward-Looking Statements about our future expectations and plans including in respect to the timing of initiation and progress of, and data reported from the pre-clinical and clinical trials of our product candidates, regulatory filings, including the review of the BLA for Omidubicel by the FDA, commercialization planning efforts, the potentially life-saving or curative therapeutic and commercial potential of Gamida Cellâ\u0080\u0099s product candidate, including GDA-201 and Omidubicel, and our expectations regarding our projected cash, cash equivalent, and investment to be used for operating activities. This was an extraordinary quarter for Gamida Cell as we continue our momentum into the second half of 2022, focused on delivering on multiple milestones and accomplishments for all our stakeholders, although we have accomplished this quarter continues to lay the groundwork for even larger inflection points, advancing towards the potential commercialization of our first NAM enabled cell therapy candidate or maneuver cell. Developing our expanding pipeline of genetically modified NAM enabled NK cell therapy candidates, supported by robust preclinical data, and exploring future opportunities that leverage our proprietary NAM technology across a broad range of innate and adaptive immune cells. If approved, Omidubicel cell has the potential to achieve 20% to 25% of the addressable market at peak market share by improving outcomes for patients based on our encouraging clinical data and increasing access, especially for patients who are eligible for transplant but cannot find a match. Beyond Omidubicel, we also announced the dosing of our first patient in our company sponsored Phase I/II clinical study evaluating a cryopreserved readily available formulation of GDA-2-1 our lead program and our expanding NAM enabled NK pipeline for the treatment of follicular and diffuse large B-cell lymphomas. Recall that our submission was based on a successful global Phase III randomized study comprised of 125 patients aged 12 to 65 with high risk hematologic malignancies that were in need of allergen stem cell transplant, but has no readily available matched donor. There are two key opportunities that we focus on that Omidubicel may address for these patients upon FDA approval, first potentially improving outcomes as compared to other donor sources based on transplant or feedback, and also potentially increasing access to therapy. This opportunity is due to the strength of our clinical data, the ability to provide patients with a predefined number of cells, and the ability to provide Omidubicel within approximately one month as compared to unrelated donors that may take on average two to three months to align the donor and the patient. For the rest of 2022, there is no higher priority than to enable the successful commercialization of our first NAM enabled stem cell therapy, Omidubicel to benefit the 1000s of cancer patients here in the U.S. who need a curative approach that allogeneic stem cell therapy may offer. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}