{
    "symbol": "SU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 13:30:33",
    "content": "  Operator: Good day, ladies and gentlemen, and thank you for standing by, and welcome to the Suncor Energy Third Quarter 2022 Results Conference Call. Actual results may differ materially from the expected results, because of various risk factors and assumptions that are described in our third quarter earnings release as well as in our current annual information form, both of which are available on SEDAR, EDGAR and our website, suncor.com. We will start with comments from Kris Smith Interim President and Chief Executive Officer; followed by Alister Cowan, Suncor's Chief Financial Officer. Also on the call are three of our senior operating leaders; Peter Zebedee, Executive Vice President, Mining and Upgrading, Shelley Powell, Senior Vice President, In Situ and E&P; and Arnel Santos, Senior Vice President, Refining and Logistics. On our last call, I discussed that achieving best-in-class safety and operational performance at Suncor's core focus and that my goal every day is to execute on our plans to drive that performance. We're doing something a bit different than past calls our three senior operating leaders, Peter, Shelly and Arnel are with Alister me today to demonstrate our increased focus on this and to answer any questions you may have on operations. We generated $4.5 billion in adjusted funds flow from operations, which included a FIFO loss in the downstream of $585 million. And as it's designed to do, our physical integration between upstream and downstream mitigated the impact of wider heavy crude differentials, delivering strong margins. In the downstream, we have strong Q3 margins on the back of a 100% utilization rate and the third best crude refining throughput in our history. Downstream margin capture was 85%, reflecting higher-than-normal levels of processing of sweet crude in our refineries primarily due to a planned outage in the Edmonton sulfur recovery unit in the quarter. During the quarter, we distributed $1.7 billion to shareholders in the form of dividends and share buybacks. Also, we successfully completed an upsized bond repurchase tender that resulted in buying back our debt below face value, and lowering our structural breakeven by nearly $1 per barrel on a WTI basis. These actions keep us on track with our capital allocation framework and move us toward our goal of reducing our net debt and depending on commodity pricing, increasing capital allocation to share buybacks to 75% by the end of Q1 2023. Instead, the focus in my opening remarks will be on recent actions that we've taken on improving safety and optimizing our asset portfolio. My priority has been to remove distractions from the organization and to focus our employees on safe, reliable operations and our biggest opportunities. First, I've initiated a thorough review of the makeup of our frontline workforce with a view to reduce our exposure hours, enable robust workforce planning, which will allow safe work execution and improve efficiency and competitiveness. As part of this, we are following through on an objective to reduce our contractor workforce in our mining and upgrading business by 20%. As of today, more than half of this objective has already been completed, and we are on track to safely achieve and sustain the full reduction by the first half of 2023. In addition to streamlining our contractor workforce, I'm also taking action to enhance our contractor management processes to ensure consistency and simplification and how we assure state work practices in the field, and we will continue to work together with our contractors to embed industry best practices and strengthen safety culture. Second, as previously mentioned, we are installing industry-leading technologies for collision awareness on over 1,000 pieces of mobile mine equipment across our operating assets to mitigate a key risk in our mining operations. I'm pleased to say this initiative is progressing well, and two-thirds of Syncrude, Aurora mine equipment will be outfitted by year end, and installations on the remaining equipment at Aurora are expected to be completed by January 2023, nearly two months ahead of schedule. Deployment schedules for the remaining mines are on plan with Syncrude, Mildred Lake Mine in Fort Hills going live in mid-23 and Suncor Stage 9 being complete by the end of next year. As well, our fatigue management system installation, as discussed in previous calls, will be completed across all mines by early 2023 and is already fully installed and functioning at Syncrudeâ\u0080\u0099s, Mildred Lake and Aurora mines. Third, and crucial to our long-term success, we are partnering with industry-leading subject matter experts to better equip our leaders across all our operations with practical skills to lead and sustain safe behaviors on the front line in our organization. By enhancing our leadership coaching and competency programs to ensure sustainment of visible felt leadership, our approach leverages human organizational performance principles consistent with other industry leaders to strengthen our safety culture, while ensuring we have a strong focus on our material risks and assurance of our critical controls. These are a few key examples of how we're driving focus and improving safe, reliable operations going forward. As you know, we've initiated a robust process to divest from non-core assets to increase and focus in our portfolio. This additional interest in Fort Hills demonstrates our confidence in the long-term value of the asset, which is backed up by a detailed assessment by our new and highly experienced mining leadership. Last week, in our Fort Hills announcement, I discuss our multiyear performance improvement plan for Fort Hills, which will have a short-term impact to both production and costs over the next three years and set up the asset for long-term success. Although there is no change to our 2022 Suncor guidance as we begin to expertise this plan, we do expect volumes to be reduced in the fourth quarter as well as into Q1 2023. When combined with other factors such as extended turnarounds in our oil sands business and at non-operated E&P assets, we expect overall company production to come in towards the lower end of our 2022 guidance. We continue to manage through the Fort Hills plan, and I look very forward to providing a more fulsome update on our Investor Presentation on November 29th. As well, a core part of our long-term success will also be on continuing to advance our plans to decarbonize our assets, a big piece of which is collaborating with our oil sands industry peers and the Pathways Alliance to reach net-zero by 2050. I'm pleased to see the government of Alberta select the Pathways Alliance for pore space in the Cold Lake area, and this is an important milestone in Pathways plans to develop a world-scale carbon capture system for the oil sands industry. Year-to-date, Q3, we have returned $6.3 billion in total to shareholders, comprising $1.9 billion in dividends plus $4.4 billion in share buybacks, and that's roughly 7% of our outstanding shares. We've also reduced net debt by $2.5 billion, excluding approximately $1 billion of foreign exchange translation loss due to the significantly strong good US dollar this year. Depending on commodity prices, we expect to increase our allocation to share buybacks to 75% by the end of Q1 2023, and this will complement our 4% dividend yield. Next, during the quarter, we recorded a $2.6 billion after tax impairment related to Fort Hills. Please go ahead and ask your question. I want to ask about Fort Hills, but maybe just before I do that, when I look at your downstream business going into fourth quarter, two big advantages, obviously, cracks and the other one is just high utilization. And yes, to your point, we're certainly seeing a really strong cracking margin environment. As I look back in the third quarter, when the overall utilization was 100%, we did have to account for the planned outage of the Edmonton sulfur recovery unit. And so we've got a strong -- I think we're setting up for a strong end to the year, Greg, is the way I would say on the downstream side. And I'd expect as we go into 2023, the macro environment for refining is going to continue to be quite strong for us. So, let's come back maybe to Fort Hills exactly. So with the remediation plan, stuff I wanted to dig into and I recognize you're going to talk more about this at the Investor Open House. As we said, we have this improvement plan related to the asset to deal with a lot of the issues that you're just raising your question. I have Peter here beside me, Peter Zebedee, who's our Executive Vice President of Mining and Upgrading, has been working extremely closely with his team. And firstly, I think it's important to note that our fixed plant facility really is world class. Some of the issues that we're seeing are related to 2021 events and really around physical constraints in the pits, and this will require changes on how we mine and sequence the ore in the years to come. You're correct, Fort Hills asset has three mine pits, the south pit, which we're currently completing mining in transitioning to the central pit in the early part of 2022. And while the new plan is not without risks, we believe we have a good handle on what's to come that we've got appropriate mitigations in place. That's exactly one of our key focus areas in all aspects of the business, upstream through downstream. As you heard a bit in Peter's comments, so I'm really pleased to see the progress we're making on it, and we're going to continue to move quickly in that direction to continue to improve on reliability. What we do, do is there's an opportunity that's going to provide compelling value to our shareholders, that's on strategy then we'll take a look at it. And the example of the transaction we just did at Tech is a clear example of that where we had an opportunity to do â\u0080\u0093 to take a partner interest in an asset that we operate, we know well. Please go ahead and ask your question. I think the question is maybe the answer, I just gave to the last question because it's the exact thing. We're not in the mode of looking to do M&A, and we really just -- those types of opportunities present themselves then we'll obviously take a close look at it. We're going through the portfolio very carefully on our capital plan, and we'll be in a position to share that with you then. I believe the plan is still to get to tune $2.15 billion by 2025, and it looks like you're targeting $875 for this year and $1.3 billion for next year. So, can you just give us a sense of how much of your tune $875 million target for 2022 has already been achieved, and how you're tracking on your $1.3 billion target for next year? And examples we've talked about them in the past, examples is the interconnected pipeline that we invested in and that we really started in 2022 really leveraging that asset, and we're seeing the benefit of that asset through the performance of the business. Now cost reduction, we're expecting more of that program to be playing out in 2023-2024. Obviously, we have inflation headwinds that we're going to need to work through. So, feel we're on track relative to the program, still much to do in the back half of it and a lot of focus by the teams deliver. And then my second question relates to turnarounds and utilization for 2023 and maybe this also falls into the wait till the end of the month bucket, but I'll throw it out there. On downstream, it's going to be a, what I'll call a regular turnaround kind of program through 2023. I would say for 2023, the biggest events are indeed U2, as you mentioned, Kris, and then a Syncrude turnaround also next year. I do want to highlight, though, maybe just building on what you said, Kris, what is different for us compared to historical performance really is this interconnect pipeline between Syncrude and the base plant. With the use of the interconnect pipeline, we've decoupled that and we can really prioritize bitumen-producing assets to start exporting bitumen as the cokers arenâ\u0080\u0099t ready or on the other side, export our crude as the cokers are online and the hydrogen is still down. So, it just gives us a bunch more operating flexibility, and that's really changed the game for us. Please go ahead and ask your question. A couple of your peers have been using buybacks and in addition, going to special or variable dividends more recently. No, thanks for the question, John and we're very focused on being disciplined against our capital allocation framework. John, I mean, essentially, we set out a capital allocation we're 50-50 between buybacks and the debt reduction, we expect to move to 75-25 pretty quickly in the next few months as I laid out. Variable dividends at this point given the enhanced value in our stock are not part equation, but I've never ruled them out longer term as being part of the capital allocation as we go forward. So, when I look at the value of our stock, it's significantly undervalued and our focus is definitely on buying stock back. I think if you -- we have commodity price is in line with where we're at today, I think no problem in meeting the end of Q1 next year. â\u0080¦doubling up here, and I was on another call earlier, but I did want to -- Kris, first of all, I did want to say -- I don't know if it's been called out yet, but the strong operating performance again this quarter ahead of the Analyst Day, I'm sure everybody is happy to see that. I might be getting ahead of the Analyst Day here, but the $2.15 billion target is now us thinking characterized as offsetting headwinds, obviously, inflation amongst other things. Should we think of that is signaling that the $2.15 billion is no longer in absolute, but -- or sorry, is no longer a net and maybe an absolutely some offsets. Yeah, I mean, obviously, we still and as Kris mentioned earlier moving through and achieving the specific items we had in that 2.15 revenue margin and some cost reductions with a big focus on cost reductions coming in 2023 and then obviously, in 2024, 2025, we have the addition of the margin and revenue from co-gen. If I look at what was here in that assumption was that we would look to our sort of regular inflation rate 2% to 3%, we're obviously not in that environment. So while we are targeting and asking our operations to find additional offsets, it's certainly going to be difficult to offset inflation across our business to the extent that we're seeing it today. In preparation for that, the leadership team and I are complete a deep review of the portfolio towards providing a robust company guidance for 2023, and I'm looking forward to the conversation with everyone on that day."
}