{
    "symbol": "CMTL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-29 21:48:05",
    "content": " Given his decades of experience in satellite communications, mobile networking, cybersecurity and aerospace and defense technologies, as well as his demonstrated ability to transform businesses and drive market-leading growth, he was the right guy at the right time to become our CEO. Our two new segments, Satellite and Space Communications and Terrestrial and Wireless Networks better represent who we are as a company and where our future is headed, based on evolving industry trends and how Ken intends to manage the business at this time. When you look closely at the businesses we at Comtech are successful in, it is because - and this is not an exaggeration, we help our customers solve some of the most difficult and challenging communications problems on the planet, and whether those problems relate to our customers' terrestrial networks, on the ground or their satellite assets deployed in the space. It is absolutely clear to both myself and each person on my senior leadership team, what we need to do operationally to ensure that the internal machinery of Comtech's business, everything from supply chain management, risk mitigation, utilization of common enterprise-wide processes, increased project management discipline, and even our passion for customer fulfillment, is significantly improved, so that can comfortably support a business that is much, much larger and much more capable than the one we have today. And in this new position, he'll be working across our organization to provide our customers with unprecedented insights and creative technology-enabled solutions based on Comtech's best-in-class Satellite and Terrestrial Network Communications technologies. We believe that Comtech's people and technologies are uniquely positioned in this market today, to navigate, facilitate and exploit the blending of these terrestrial wireless and satellite network infrastructures on a global scale, delivering the technology-enabled capabilities to meet these customer-driven hybrid connectivity objectives, and significantly benefit from the convergence of these terrestrial and satellite communications domains, leveraging this emerging market inflection point by helping to make hybridized connectivity a global reality. The strategic committee is valuable to me as our markets evolve, and as we launch these new strategies, and develop the business thesis that will enable us to operate the business that we've always had more effectively, but potentially take advantage of the market convergence that we spoke about, with the terrestrial wireless market blending together with the satellite market, and how we might prosecute those opportunities that are rightly suited and rightly timed for us, so that we can unlock that shareholder value in a more comprehensive way at a higher level in the food chain."
}