{
    "symbol": "DRVN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 06:52:02",
    "content": " Take 5 Oil Change, our differentiated 10-minute stay-in-your-car quick lube model, continues to drive customer acquisitions and best-in-category same-store sales, which further accelerated in the fourth quarter to over 25%, driven by both ticket and traffic, continuing to outpace the competition. Now looking across Driven Brands, our robust development pipeline has continued to grow to over 1,600 locations which are approximately 35% site secured or better, giving us strong visibility into sustainable, predictable unit growth over the next few years. Underpinned by one of the most robust databases in the category with more than 30 million unique customers, which has grown by 25% year-over-year, we are driving tangible results today through direct-to-consumer marketing, which contributed over $80 million in revenue, which equates to 4% of total revenue or 8% of consumer revenue in 2022. And above shop, SG&A as a percentage of revenue was 21% for the quarter, increasing 172 basis points from the prior year driven by two items: first, a $15 million true-up related to the tax receivable agreement that we entered into at the IPO as a result of filing our 2021 tax returns; second, $7 million of incremental equity-based compensation expense based on outperformance on the earlier grants and layering in another annual grant. This $12 million increase versus the prior year was primarily attributable to increased debt levels as we lean into opportunities across our Quick Lube, Car Wash and Glass businesses, and the adjustment in mid-December of our floating rate term loan debt from an initial 12-month LIBOR of 50 basis points, plus a 300-basis point spread to a three-month LIBOR of 474 basis points plus a 300-basis point spread. In 2023, we expect to deliver revenue of approximately $2.35 billion, driven by 5% to 7% same-store sales growth and net store growth of approximately 365 units. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. What I would tell you is our model that we shared in November of 2021 shows that over five years, you should model $250 million of acquired EBITDA on any individual year that we acquire EBITDA, it will then sort of roll into the sort of the legacy or the organic growing business and then convert at sort of a 10% growth rate after year one of acquisition. Your line is open. Your line is open. Your line is open. Your line is open."
}