{
    "symbol": "NEON",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 13:29:03",
    "content": " After Fredrik has done that, I will come back and talk about overall strategies, customer activities and other operational topics. Forward-looking statements include information about current expectations, strategy, plans, potential financial performance or future events. They also may include statements about market opportunity, sales growth, financial results, use of cash, product development and launch, regulatory matters and sales efforts. Forward-looking statements are based on assumptions, expectations, information available to the company and its management, and involve a number of known and unknown risks, uncertainties and other factors that may cause the companyâ\u0080\u0099s actual results, levels of activity, performance or achievements to be materially different from any expressed or implied by these forward-looking statements. Revenues for the third quarter was $1.2 million, that is an increase of 26%, compared to the same quarter last year. We saw a recovery in license revenues for the third quarter, mainly due to that our license customers within the printer and automotive market, has had more volumes. We also saw in products, a slight recovery to $155,000, an increase of 14%, compared to the same quarter last year. For the fourth quarter, we think that the product or the gross margin for products will increase again, thanks to favorable product mix from customer -- current customer orders. Operating expenses for the third quarter 2022 was $2.1 million, that is a decrease of 22%, compared to the same quarter last year. We are very cost conscious and that is one-off effects that it goes down, but we are also helped by the weak Swedish currency. So our net loss for Q3 2022 was $0.8 million, compared to $1.7 million for last -- for record last -- compared to the same quarter last year. The first half of 2022, we purchased components to secure the production of TSMs and that affected our cash flow heavily. Cash and accounts receivable decreased with $1.2 million for Q3 2022, as compared with $2.7 million for Q2 and 2.4% for Q1. And for those of you that haven't followed us in the last year or so, I just wanted to underline and explain our overall business strategy to combine technology licensing and product sales. We licensed two technology platforms, one we call zForce, which is based on infrared technology and suitable for different types of applications, as I explain shortly; and multi-sensing which is camera-based scene analysis technology. The business model we apply here is to combine sales of engineering services, NRE, non-recurring engineering services and technology licensing or software licensing. In the other part of our business that we internally refer to as our products business, we sell products that we call touch sensor modules or TSMs for short. Here, we mainly today target elevator customers and customers within the interactive kiosk segment. There's also some opportunity to sell adaptation services or NRE in this case, which we have used in the last couple of years, and we hope that we can expand on going forward. Regarding zForce to understand what this platform is and what it can be used for, we have just included one simple slide today. This is a very proven and battle harden technology platform featured in close to 90 million products from leading printer manufacturers, automotive suppliers and also other customers. It can be used for a touch on both displays and other surfaces, gesture sensing, mid-air, contactless touch or object detection. Today, we are trying to revive this business and we mainly target a high-volume automotive market with this technology platform. And the two application areas where we focus the most today is head-up display object detection, illustrated on this background picture here. Head-up displays are becoming more and more common in especially premium vehicles, and we will see more of them also in normal vehicles going forward. The other area where we focus is interior controls both on displays, but also on other surfaces, plastic glass or other interior panels. MultiSensing is a flexible and scalable platform, itâ\u0080\u0099s hardware agnostic, has minimal hardware footprint and works with also low-cost cameras, which gives us an edge over most competitors today, also since it's scalable and prepared to support lifetime updates in the vehicles using over-the-air updates or by other means. We produce them in our own factory in the West of Sweden, and we ship to distributors, to value-added resellers and customers worldwide today. Today, we are at a state where I can say, and I will show examples that we have established beachheads in the elevator and interactive kiosk segments for our TSM products and in particular, when it comes to contactless touch applications. In other cases, we are still working really to secure a stable beachhead, so the status today for our licensing business is more that we are still working here to establish a solid beachhead whereas in the products business, we are actually already since some time working to scale this business. So in the products business, you can look in the center pillar here under bullet number two that today and going forward, we are trying to scale this business aggressively, but doing this in selected key markets and also narrowing down and focusing also efforts on key subsegments in the interactive kiosk industry and also elevators. For our licensing business, the second step is to simply add more customer projects to the first ones that we are working on today. As you know, you that have followed us the last couple of years, we follow a strategy where we combine direct sales with indirect sales through distributors and value-added resellers and also other partners. To scale up and accelerate our growth, we still believe it's a good method to combine direct sales with indirect sales through these partners. And also, as explained before, in earlier earnings calls and in other presentations as a Western company based in Sweden and U.S. and working in many Asian markets like Japan, Korea, China, and so on. We also have a clear site where we want to go once we are up to speed and so on, and this is simply to expand to more segments and more geographical markets. But today, what we are doing is really focusing on the step one and two and trying to be very, very focused. While at the same time, we believe very much in the potential, we are conscious about the cost and the cash flow, and we are trying to balance this today and the key is focus. From elevator, I want today to focus on MAD elevator, our customer partner in Canada. Today, two of the leading top 10 elevator OEMs use MAD elevators control panels in their standard offerings, both for aftermarket and new equipment. In addition, MAD elevator is also offering their solutions on the North American aftermarket and have -- what I see they are building momentum in this aftermarket business. And besides MAD elevator, we are working with similar companies, one in the U.K. called Dewhurst and in South Korea, our partner Finetek is playing a similar game there with both OEM relationships and aftermarket sales. And like shown here in this picture, still for blind people, you preserve the rail text, which is a legal requirement in many markets. And you can retrofit this and you can also install it in new elevators, the same type of solutions. So both retrofit and new equipment sales and it's a very, very nice solution. Further, with elevators, we have several companies, especially in the Asian countries, Japan, Korea and China that have developed different hall call and elevated control panel solutions based on holographic displays. And this example shows a typical hall call module where you, at the entrance floor, maybe or any floor, you will call on the elevator and you -- in this case, you enter the floor number that you want to go to, and then you simply step into the elevator. Similar solutions, of course, are applied inside the elevator cars, and we have many examples of other companies doing this, as mentioned, both in Japan, Korea and China. We have some companies in Canada and also in Europe, offering similar solutions based on holographic or other technologies. This is both for new equipment, new elevators and new installations, but also retrofit, and many elevators live 50, if not, more years and they are, on a regular basis, upgraded and refurbished and refitted. And every time an elevator or building is refurbished and so on, there's an opportunity for us and our partners to step in with a retrofit. And the good thing with elevators is that, that retrofit module that you typically install the same module you can use in the new elevators. Today, we have four of the top 10 elevator OEMs working with our technology and offering this to new equipment customers and aftermarket customers. We also have some mid-sized OEM customers, and we have several say, control panel and button companies offering modules with our technology integrated. Regarding interactive kiosks, retail and self-checkout stations like this one, project with 7-Eleven Japan that I reported about in the earlier earnings call, that project is progressing. And just recently, we have established contacts to companies here in Europe also working with 7-Eleven, but tech companies. And the solution here is a holographic display combined then with barcode reader and payment terminals, so that the interaction is very intuitive, very quick, simple, I tried it myself when I was in Japan in June, works just perfectly. So for every reason, this is what we believe is one cool new feature in convenience stores and other stores for self-checkout and also other applications. Just to illustrate, we took this from Holo Industries web page, and they have recently released a press release that they are developing together with ASKA, which also is a partner of Neonode, that they are developing a holographic point-of-sales payment system for Mastercard using our TSM products. Already two years ago, we presented in another earnings call, a similar solution developed by a Japanese company called Nidec Sankyo, and we also have further companies working on this type of POS solutions for retail and other users. Regarding general kiosk application, I wanted to show today this very nice product from our German partner, HY-LINE, which is a virtual keyless keyboard. And obviously, you can use this also for kiosk application. Indeed, when we have presented previously about contactless touch for kiosk using the parallel plane approach is this approach. You can have a display, a normal display behind this or like they have done here like a plate or any surface and project or print symbols that represent icons. And obviously, we are glad to help them to promote this also worldwide to ship this to customers outside Europe. So speaking a lot about holographic displays and this parallel plane approach for contactless touch, I still want to return to our origin and that we are still taking new orders from customers using our TSMs for touch applications. We are very, very proud because they have developed a range of kiosks that are very slim and take minimal space still can offer a lot of value for our customers at airports and shopping malls and similar. Here, they use our TSM basically to -- as a retrofit to their display solution offer now interaction using touch on that display, so very flexible. So together with Elix, we have developed a retrofit solution to their original display that was previously passive, now it's interactive. And both -- this shows that both are very much viable in the medical area, and this is a future growth potential, although we haven't really focused on it 100% so far, but I'm just saying that this is an area where we think we have unused potential, and we will also increase our focus on this going forward. It's a little bit unusual, because the previous two years been basically impossible to trait meet people face-to-face. In closing, I would like to highlight this one is an upcoming event called Japan Build Expo in Tokyo in the beginning of December. We also have invited and got strong support from our tech partners, ASKA 3D and the  innovation. Also joining us in our booth and separately is eight different Japanese and international companies, including large corporations like Maxell, Toppan, JDI and medium-sized companies next to them. In total, we are showing here with our customers and partners in Japan, 15 different products, most of them are holographic display products, but we also have some other showing how to use our TSMs for contactless touch interaction on, for instance, building entry systems. As I mentioned before, POS systems, sell of checkout system, information kiosks and elevator control panels. And of course, around this in Japan and internationally, both we and these customers and our partners are trying to spin this and use this as a showcase. Going forward, we will do more events like this in Japan, Korea and China, but also some in Europe and U.S. Follow us on social media and on through our website for regular updates on shows and other campaigns and advertisements we do, because I think you will enjoy it and they also contain a lot of information. The summary is that sales revenues and net results are much improved, compared to the same quarter last year, it's due to increased sales, but also cost control. Actually, we have purchased during the first and second quarter, a lot of components stocked up, and that's by necessity, because some of these component suppliers require us to place big orders, so the minimum order quantity we can order is actually quite large. But also, we see effects of our cost control and currency that really improved cash flow this quarter. Although we see light in the tunnel, we see that we have a clear break in the sort of boring trend that we saw from third quarter last year until the second quarter this year, so the third quarter, we have seen much higher activity level even in China where we have some significant headwinds due to lockdowns. But during the third quarter, we got spontaneous calls from previous and new customers and partners in China. Volvo Cars is one of our end customers, and they have reported problems and they will stop production. Of course, that type of issues hurt our sales, because if they produce less vehicles, our customers who are supplying these infotainment systems for Volvo, they can sell less of their products. Also, we are a little bit surprised, but we are now learning how to adapt to this, buy both in the licensing business, where we knew that we will have long sales cycles and long development and launch samples. One of these leading elevator OEMs that have now launched products that they have developed in-house, they are launching this now and scaling up that business, they actually presented a fully working and nice-looking prototype in spring or mid-2020. This is a fact, and there's nothing we can do to change that because this is a multi -- it's like a Fortune 200 company. But that clearly is affecting us, and it's holding us back a little bit. We feel that in the products business, we have created strong beachheads in elevators and kiosks. And in the licensing business, it's more like securing the solid beachheads and then scale up. And we have promising first customers that are very positive to our technology offerings that we work very, very closely to finalize evaluation projects and other development projects that in some time, we'll start to generate new royalty revenues. So overall, I'm quite optimistic, even though I can understand that some of you investors feel as it's frustrating that our development has been slower than expected. I will admit, I'm also at times a little bit frustrated, but I'm also still very, very motivated and think that we are on the right track and that we are starting to see now shift in the trend here in the third quarter. So I mean let's start with your, I mean, kind of optimistic and ending words that it seems like, okay, it's been very slow for quite a while, but now things are starting to happen. We have had some orders from these customers, but maybe just for evaluation or maybe just small ramp-up orders and then some actually stopped during the preceding 12-months, and then they came back now, so it's a mix. But we have to realize that when you work with, for instance, one of the top 10 elevator companies, we talk about companies with hundreds thousands, if not more employees, billions of U.S. dollars in turnover. But what we can say now during the third quarter, we have confirmation that also, say, the water lilly effect, so one of these top -- actually, top five elevator OEMs came back now. They have evaluated technology, they have also offered it before but a little bit passively. But I agree it has taken a little bit longer than I expected, but I strongly think we are on the right track here and that this is now the base is to scale now seriously in the coming couple of years. Yes because -- I mean, as you mentioned previously, you have -- in the first half of 2020, you built up quite an inventory of $4.3 million. So some of these minimum order quantities I referred to before, they are like $10 million or $50 million of a single component. And we can also -- when I mentioned that in the future, we are looking to have a second source production partner we can, of course, share some of our components with that production partner as part of the commercial agreement. It's like we have it, it cost cash flow in the first and second quarter this year, but now we have it, and we will consume it in the coming, say, 18, 24 months. And then also, I mean, you went into some of the elevator OEMs as customers and their progress. So elevator, I would say, we are solidly in a beachhead situation, we are scaling, and this is looking quite good, both in Japan, Korea, China and Europe and so there's a lot of things going on there. So many of the players, they are regional or national, and their products are also sort of fragmentized. And they can look even if it's a big -- one of the big companies, global companies, they will have one product in Japan, another one in France and the third one in Canada, and it's still branded in the same way. But we have explained before that we always see this market as a pyramid, where at the bottom, we have many small customers there can be big corporations, but one program can be fairly small, but we need to add more of these. If I can highlight a couple of examples, one I can mention is with our partner, MZ Technology in France, they are working with a company called ION Group, they are a leading provider of kiosks for passport controls, identity controls and similar. Similar to this 7-Eleven project in Japan several such projects, both in Asia and Europe and some in U.S. Also this Mastercard project could pan out. And I think what we have is the case is that it will not be just one silver bullet like one customer steps up and at one time orders, 2 million TSMs, it's going to be slowly, but steadily even from these large corporations, because today, everyone works just in time. Well, cost conscious is a piece of it, but also we have had a development in currency that is favorable for us. So of course, a lot of it is currency effect, but it is still also that we are cost conscious and we save costs and do things with purpose."
}