{
    "symbol": "APLD",
    "quarter": 3,
    "year": 2023,
    "date": "2023-04-06 21:22:05",
    "content": " Adjusted gross profit, a non-GAAP measure that excludes depreciation embedded in the cost of revenues and one-time, electricity charges was $4.4 million or 31% of revenue for the fiscal third quarter of 2023. Adjusted net loss attributable to Applied Digital, a non-GAAP measure for the fiscal third quarter of 2023 was a loss of $1.4 million, or a loss of $0.01 per basic and diluted share, based on a weighted average share count during the quarter of approximately $94.1 million. During the third fiscal quarter of 2023, we received $11.7 million in net customer deposits and $32.3 million in net deferred revenue, which collectively amounted to a $44 million net cash inflow due to the structure of our commercial arrangements with our customers that incorporate upfront deposits and prepayments. Please proceed with your question. But if we own the GPUs in the entire facility and we booked those out and weâ\u0080\u0099d only do that if we had the right style of customer to do that and a very large solid counterparty to do that, that building would generate well north of $100 million of revenue and upwards of $50 million or $60 million of EBITDA. Please proceed with your question. Please proceed with your question. Please proceed with your question. I can repeat that if you want me to, but just to kind of frame where we think HPC is as far as revenue versus the Bitcoin mining, the green lights, we've kind of - we're definitely â\u0080\u0093 it maybe like we've moved from red to yellow already. But the conversations weâ\u0080\u0099re having right now, what we're seeing demand of people wanting individual demand of 10 or 20 megawatts and some 50 and 100 megawatts of HPC build, which is a very large amount given, like I said, with the numbers were that I gave you earlier in the call about the revenue comparison for HPC versus Bitcoin mining. Please proceed with your question. Once contracted with customers, I think it's going to be significantly easier even in a much more difficult financing environment that we're seeing right now, just because of the customer profile for those types of co-location â\u0080\u0093 co- location buildings."
}