{
    "symbol": "APLD",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-09 22:47:05",
    "content": " Our topline results exceeded expectations with revenue of $12.3 million in the quarter above the $12 million we discussed on last quarterâ\u0080\u0099s call that represents the steady state capabilities of our 100 megawatt Jamestown facility, which continues to perform as expected. We will remain a premier provider of digital infrastructure for cryptocurrency miners, but it's important for us as a company to distinguish that our next-generation data centers support many other HPC applications as we look to capitalize on the rapid, rapidly growing high performance computing market which is set to reach $65 billion globally by 2030. During the second fiscal quarter of 2023, we received $10.6 million in net customer deposits, and $10.2 million in net deferred revenue, which collected collectively amounted to $20.8 million in net cash inflow, due to the structure of our commercial arrangements with customers that incorporate upfront deposits and pre payments. Please proceed with your question. And we were shuffling one of our customers down to Garden City and not I guess, again, it's not any of the 90 megawatts that we've contracted with Marathon, we're moving some of their capacity or some of their miners to Garden City, and we're putting Marathon in place in Jamestown, and that will happen this month mostly. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And, and the further along we get and the type of conversations we're having the customers that we're talking to our potential customers we're talking to on the HPC front, I just it's getting harder and harder for me to justify more money going towards, towards Bitcoin mining versus, versus the opportunities that we're seeing on HPC, specifically in machine learning and AI. Please proceed with your question. Please proceed with your question. So if you're, if you're a significantly lower cost, truly green computing and provide performance that's on par with anything else they can they can sign up for, for the applicant for these specific Apple applications, I think we're in a really good position to compete and the kind of the conversations we're having tells me that we're on the right track here. Please proceed with your question."
}