{
    "symbol": "APLD",
    "quarter": 1,
    "year": 2023,
    "date": "2022-10-11 19:25:25",
    "content": " Before this call, Applied Blockchain issued its financial results for the first quarter of fiscal 2023 ended August 31, 2022 in a press release, a copy of which will be furnished in a report on Form 10-Q filed with the SEC and will be available in the Investor Relations section of the company's website. Also, I want to remind everyone that when evaluating our first fiscal quarter results, it is important to keep in mind that our 100 megawatt Jamestown, North Dakota data center operated at only 50% capacity during most of July and August due to the previously disclosed unexpected equipment failure at the substation powering the facility. Cost of revenues in the fiscal first quarter were $6.1 million, consisting of $4.9 million of energy costs to generate our hosting revenues, $800,000 of depreciation and amortization expense, and $400,000 of personnel expenses for the employees directly working at our Jamestown hosting facility. During the first fiscal quarter of 2023, we received $4.6 million in net customer deposits and $15.3 million in net deferred revenue, which collectively amounted to almost $20 million in cash inflow due to the structure of our commercially arrangements with our customers that incorporate upfront deposits and prepayments. Please proceed with your question. We've a lot of the others with plaguing a lot of the public miners is really especially equipment financing, which has a lot of very fast amortizations at this time last year didn't look like it would be a problem given the Bitcoin price, but it's turned into a massive problem I think all over the industry. Please proceed with your question. And then we'll expand that if it goes well later this year and then maybe be in a position this is and I think this one application is an extremely large market, but be in a position to scale that in 23% and 24% I wouldn't say the sky is the limit, but it's definitely a really attractive potential for us. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}