{
    "symbol": "AVDL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 17:44:05",
    "content": " The active pursuit of additional legal and regulatory strategies to accelerate a final FDA decision for LUMRYZ prior to June of 2023 or when the REMS patent we certified on will expire and the continued execution of our commercial preparations with a focus on shortening the time between final approval and launch, while we took the necessary actions to ensure as required, we have the liquidity to carry us to the potential outer date of a final FDA approval decision. By granting tentative approval, the FDA has validated the clinical and safety profile of LUMRYZ and confirms that LUMRYZ is approvable as a one at bedtime therapy for eligible patients living with narcolepsy, which we believe is a meaningful derisking regulatory event for the company. Further, and perhaps most importantly, receiving tentative approval confirms that the potential latest date we could receive a final approval decision for LUMRYZ is after expiry of the REMS patent, which is June 17, 2023, or just 10 months and 8 days from today. Despite a longer-than-anticipated time for the final approval of LUMRYZ, one thing that has not changed is the fundamental belief in the potential for this drug candidate to help patients manage their excessive daytime sleepiness or cataplexy, while also providing them with an opportunity for a more natural sleep like cycle. And with the tentative approval now granted and as we progress towards a final approval decision that could occur by June 2023 or earlier, we will seek opportunities to strengthen the balance sheet and ensure we have the capital resources available to prepare for the launch of LUMRYZ into what we believe is a greater than $3 billion market opportunity. With tentative approval in hand, we are committed to keep moving forward to unlock LUMRYZ's clear and intuitive value proposition with a once a bedtime treatment that could be transformative for people with narcolepsy by providing the potential of an uninterrupted night sleep while also managing daytime symptoms of narcolepsy. And depending on the timing of those decisions, whenever that occurs, that will set the time frame for us to then file the necessary documentation with the FDA to convert the tentative approval to final approval, which, again, per FDA guidance, generally speaking, in that situation, is recommended anywhere from 2 months to 6 months. Again, as we've shared in the past, this is a topic we had engagement with - during the pendency of the review with FDA and fundamentally believe that the orphan exclusivity review was, by and large, complete, although not decided upon formally because technically until there's a basis for a timing for a final decision, the FDA just isn't going to make that final decision, that formal decision until the time is right. If we're heading towards the situation where June 17 is the expiry of the patent and that's the last remaining item for us to move to from attentive approval to a final approval decision, we would begin the process in notifying the FDA and filing all of our related documentation well in advance of that for FDA guidance such that upon that expiry or shortly thereafter, we would expect a final decision to be made on LUMRYZ. So I think the short answer to the question is you know, not speaking directly for how long after June '17 that will occur, but we will take the necessary steps to file the necessary documentation and request the FDA to begin the process to make whatever final decision need to be made to convert from a tentative approval to final approval in advance of that, such that when that patent expires, the FDA should be in a position to do so."
}