{
    "symbol": "AVDL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 13:54:09",
    "content": " Very recent comprehensive market research that Richard will highlight shortly, continues to confirm the significant interest in LUMRYZ across all patient and physician segments, all of which is supported further by what we see in the real-world data coming from our RESTORE study, where 94% of twice-nightly switch patients prefer the once-at-bedtime dosing of LUMRYZ. The combination of the real-world data of RESTORE, along with our extensive market research and data analytics confirms our belief that LUMRYZ is well positioned to capture a meaningful share of the projected $3 billion-plus once-at-bedtime oxybate market. Receiving tentative approval for LUMRYZ is a significant derisking element to our mission and our overall value proposition as a company, which is further supported by all of our customer insights and stakeholder feedback, which continue to demonstrate the significant opportunity for LUMRYZ to command a meaningful share of the $3 billion plus once-at-bedtime oxybate market. Your line is open. Your line is open. And what was really interesting for us to sort of see in this latest wave of market research is, for current narcolepsy prescribers who don't use oxybate, almost half of them said, they would want to prescribe LUMRYZ when it becomes available as well. The only thing I would add to Richard's comment, Ami, is that these 30,000 to 35,000 patients that we've described in these three segments, they really predominantly fall within that highly concentrated source of business, the 1,600 physicians that make up 80% of that volume. Your line is open. Your line is open. Your line is open. Your line is open. And as we think about where the market will expand, what we've learned from this market research that we did most recently is, there's still quite a few patients that are viewed to be oxybate eligible who are not receiving oxybate, probably greatest within low oxybate users currently and non oxybate users, clearly. What we sort of see from our research is - from this latest round is that the market should grow by at least 50% with the introduction of LUMRYZ in the marketplace with once again, the largest percentage growth coming from lower users who probably have really struggled with the proposition of twice-nightly oxybate in the past. Your line is open. And with the fact that we've now compressed the time from a final approval potential decision in June, to a 3Q launch, our goal is to bring on a lot of our field force before that approval timeline as well, because we want to make sure that they are familiar with the territory, with their customers and everything as well. Your line is open."
}