{
    "symbol": "AVDL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 21:25:09",
    "content": " We have already executed on a number of significant milestones, including the recent completion of multiple, strategic financings that pave the way for growth and value creation as we enter the final stages to bring LUMRYZ, our investigational, once-at-bedtime, oxybate therapy, for the treatment of cataplexy or excessive daytime sleepiness in adults with narcolepsy to the market. Within oxybate, eligible patient community of 30,000 to 35,000 strong and the opportunity to address the most important unmet need, which requires patients to forcibly awaken in the middle of the night during a precise 90-minute window, LUMRYZ offers the potential to provide oxybate patients the opportunity to have an uninterrupted night sleep while commanding a meaningful share of the estimated $3 billion to $3.5 billion once-at-bedtime oxybate market. As announced yesterday, significant progress has been made in strengthening the companyâ\u0080\u0099s balance sheet, providing us with the financial flexibility and a clean 10-K ahead of the potential launch of LUMRYZ to the execution of a series of strategic financings, which in total provides the company with approximately $200 million of committed capital to support a potential LUMRYZ launch and a new April, 2027 maturity date for $96.2 million of our convertible notes. The significant milestones we have recently achieved including submitting our amendment to the LUMRYZ NDA along with executing multiple strategic financings are critical steps toward our mission, built on the foundation of a clear value proposition of LUMRYZ, which has been recognized by our key stakeholders, including patients, sleep specialists and shareholders. So, yes, as far as our pricing is concerned, I mean, our overall strategy based on the value proposition of LUMRYZ has been â\u0080\u0093 weâ\u0080\u0099re going to win with patients, win with providers and in essence, really a draw with payers really more from a parity perspective. So weâ\u0080\u0099ve really invested a lot of time and energy because first we believe that the LUMRYZ value proposition will generate a lot of excitement with prescribers and patients, but weâ\u0080\u0099ve got to make sure that weâ\u0080\u0099ve had, and weâ\u0080\u0099ve spent the time to build the resources to make sure that we can get the fulfillment taken care of as well."
}