{
    "symbol": "SKY",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-03 13:34:18",
    "content": " Backlog at the end of June was down $264 million to $1.4 billion, compared to the March quarter, while the year-over-year increase in backlog was the result of home orders at higher pricing levels. During the first quarter, net sales increased by 42% to $726 million, compared to the same quarter last year. We saw revenue growth of $204 million in the U.S. factory built housing segment during the quarter, which was driven by an increase in the number of homes sold and an increase in average selling price. The sequential volume growth during the quarter was driven by an increase in production levels and as Mark mentioned earlier in the call, would have been higher had we seen more favorable timing of shipments as our finished goods inventory increased by $54 million. Canadian revenue increased 19% to $45 million, compared to the first quarter of last year, driven by a 30% increase in the average home selling price, partially offset by a 9% decline in the number of homes sold. Consolidated gross profit increased to 229 million in the first quarter, up 106% versus the prior year quarter due to higher volumes in average selling prices, while also benefiting from the higher priced FEMA units and lower lumber costs. The improved operating efficiencies and higher prices on FEMA unit sales helped to increase gross margin this quarter in addition to strong demand and pricing and continued product standardization, which all led to increased production and leverage of fixed cost. SG&A in the first quarter increased to $72 million from $54 million in the same period last year, primarily due to higher variable compensation driven by higher revenue and profitability. So, yes, we've got roughly rounding $100 million, I would say $97 million, if we want to be specific; millions of revenue that's been produced, but needs to â\u0080\u0093 that will â\u0080\u0093 once accepted by FEMA will be recognized into revenue at that point in time, which we expect a majority of that by the September quarter. So, I think you've got to take into account in your backlog math, the thought process that our sales plus the production of FEMA, which we have not recognized into revenue, was really somewhere around $830 million, $840 million in rough math of produced units during the quarter."
}