{
    "symbol": "SKY",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-07 18:10:06",
    "content": " The average selling price per U.S. homes sold increased by 14% to $94,200 due to product mix and year-over-year price increases on our core products to offset higher input costs. A decline of 21% in the number of homes sold and a 9% decline in average selling price per home is primarily a result of completing the FEMA order in the prior quarter, which drove higher ASPs versus our core products. As mentioned earlier, some markets are experiencing softening demand because of retailer destocking, resulting in reduced production levels, which caused our capacity utilization to decrease to 66% during the quarter compared to 72% in the prior quarter. Canadian revenue decreased 15% to $31 million compared to the third quarter last year, driven by a 19% decline in the number of homes sold, partially offset by an increase in the average selling price per home. Consolidated gross profit increased 11% to $174 million in the third quarter, while gross margins improved 50 basis points versus the prior year quarter, primarily due to higher average selling prices. Our U.S. housing segment gross margins were 29.9% of segment net sales, up 30 basis points from the third quarter last year, primarily due to the increase in retail sales as a percentage of the total U.S. housing segment, resulting from our expansion of our captive retail operations. SG&A in the third quarter increased to $72 million from $66 million in the same period last year, primarily due to the acquisition of 12 Factory Expo retail locations earlier this year and investments made to enhance our online customer experience and supporting systems, both of which were partially offset by lower incentive compensation. Adjusted EBITDA for the quarter was $109 million, an increase of 13% over the same period a year ago, the adjusted EBITDA margin expanded by 60 basis points to 18.7% due to gross margin improvement. And I think are going to continue more strongly in the fourth quarter, and that would be the elimination of or reduction of our material surcharges in the units that are finally coming through production and then also the shifting of the product mix to smaller units with less features and options in order for the consumer to hit that monthly payment that they need with the higher interest rates. Sequentially, I would expect ASPs to come down a bit versus the third quarter, primarily because of the things I talked about before, the elimination of more of the material surcharges as well as the shift mix more broadly across retail and manufacturing to smaller, less optioned homes."
}