{
    "symbol": "PTEN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 13:03:02",
    "content": " During the fourth quarter, our average rig count in the U.S. rose by 3 rigs to 131 rigs, and average revenue per day increased by $3,160. This growth was driven by successful contract renewals at more favorable pricing than projected, which resulted in a $3,160 increase in average revenue per day in the U.S. On a year-over-year basis, in the U.S., average rig revenue per day increased $9,800 or 44% from the fourth quarter of 2021 to the fourth quarter of 2022. At December 31, 2022, we had term contracts for drilling rigs in the U.S., providing for approximately $830 million of future dayrate drilling revenue, up from approximately $710 million at the end of the third quarter. For the first quarter, we are experiencing more weather disruptions than normal, and therefore, expect pressure pumping revenues to be approximately $280 million, with an adjusted gross margin of $72 million. Throughout the year, I expect the overall U.S. rig count for the industry will continue to increase, especially for super-spec rigs, driven by increases in the oil basins, and acknowledging that there may be near-term softness in gas basins outside the Northeast. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. And thatâ\u0080\u0099s why I see that â\u0080\u0093 I think thatâ\u0080\u0099s the underappreciated part of the story is our ability, even if we werenâ\u0080\u0099t putting out any more rigs, even if I said our rig count was going to be flat, which is not, what weâ\u0080\u0099re projecting, weâ\u0080\u0099re still going to grow margin and grow free cash flow because of the repricing. Your line is open. But the AC high-spec, super-spec rigs, primarily working on term contracts and getting repriced right now, weâ\u0080\u0099re seeing that market to be tight near 100% utilization today. Your line is open. So I think itâ\u0080\u0099s going to affect the overall rig count because itâ\u0080\u0099s about quarter of the overall rig count, but it doesnâ\u0080\u0099t affect drilling contractors that are running AC high-spec, super-spec rigs. Your line is open. Your line is open."
}