{
    "symbol": "BRO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 14:02:14",
    "content": " As a result of our strong top line growth, adjusted EBITDAC grew by 42.1% over the prior year, and the margin increased by 430 basis points to 44.4% due to the leveraging of our expense base in relation to the growth in revenue, as well as the timing of prior year revenues and expenses associated with the onboarding of new customers in our lender-placed business. Regarding the second half of the year, we're expecting good growth, but not at the levels we recognized in the second quarter due to seasonally fewer property placements and the revenue associated with the onboarding of new customers in our lender placed business becoming more comparable to the prior year. Number two, there's a flow of business back towards Citizens, which anticipates there are a number of - policies could be somewhere in the range of $1.2 million or up to as high as $2 million by year-end if everything went to hell in a hand basket, technical term. But if you think about just the overall, you know, from a commercial property space and where rates are going, generally, it's a positive for us, Greg, when you look across programs and all the wind programs that we run in the wholesale business, as well as on the retail from the placement component of in - inside of there. We had good retention, and we're seeing some exposure unit expansion in addition, and we've talked about this for a few different quarters, starting last year was the on-boarding of some new customers in our lender placed business. I just don't know exactly what it's going to look like in the back end of the year, but we feel really good with how all our leaders are managing their expenses and investing in the business. That's what I'm saying, and that was just trying to have an underlying support for the pressure on - the upward pressure on rates, albeit they could be going down slightly, but they're moderating at a slower pace or just slowly moderating."
}