{
    "symbol": "REKR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-27 21:01:01",
    "content": " Another example of where our acquisitions have brought significant advantages and synergies is with STS's 30 years of traffic, engineering, and data collection expertise coupled with the deep relationships they have forged across multiple state departments of transportation and commercial entities. In the second half of 2022, we successfully integrated STS's traffic and data collection expertise with Rekor's next-generation AI and machine-learning technologies and IoT edge devices always-on, always connected, always learning forming a connected digital infrastructure and a new operating system for the roadways. Seamless opportunity emerging in the fall of 2022, we pre-announced our new AI-based Edge Max and Edge Flex roadway data collection systems, designed to help our customers capture high-resolution roadway data using AI and transform it into holistic traffic insights for vehicle classification, counts and speed according to the exacting standards of the Federal Highway Administration and U.S Department of Transportation. Tapping into the new infrastructure bill funding with Missouri, we are combining our traffic management expertise, integration of multiple datasets across multiple ecosystem players, as well as bringing our deep expertise in marrying our Rekor edge IoT devices to connect the dots across software, data and hardware systems providing the most comprehensive and complete view of Missouri's highways for the state's traffic management center. In addition to our partnership with Oregon and Cintra, we also expanded our solutions in other departments of transportation across the U.S. in 2022 including California's Metropolitan Transportation Commission, as well as Colorado, Kansas and Alabama State all representing new multi-year contracts to Rekor. And speaking of international growth, I'm pleased to also highlight that one of the largest states in Mexico has selected and is now deploying our vehicle recognition software and hardware across 1,800 locations across the region representing the largest vehicle recognition and roadway intelligence deployment in Mexico's history as they aim to improve the public safety and security of millions of Mexican citizens. Got it, that's helpful. Got it, that's helpful. The concept of what we're doing is disrupting something that's been done for 60, 70 years if not more of the same way using technology that has not changed, okay, and that's the point and they are mandated to do this and we can now do this with the technology that Rekor has that we've been developing for several years, right, which is the proficiency of edge processing, roadside machine vision and so forth and it starts with vehicle ID and vehicle recognition."
}