{
    "symbol": "REKR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 20:36:30",
    "content": " Today, we'll discuss Rekor's results for the 3 and 6 months ended June 30, 2022, and provide you with an update on key business topics. Revenue for the 6 months ended June 30, 2022, was $7.9 million compared to $8.5 million in the same period last year, a decrease of 6%. Recurring revenue for the 3 and 6 months ended June 30, 2022, increased to $1.2 million and $2 million, respectively, compared to the same period last year. This increase represents growth in recurring revenue of 133% and 115% for the 3- and 6-month period ended June 30, 2022, compared to the same period last year. The percentage of recurring revenue reflected in total revenue was 48% for the 3 and 6 months ended June 30, 2022, compared to 21% for the 3 and 6 months as of June 30, 2021. Total operating expenses for the 6 months ended June 30, 2022, were $28.2 million compared to $10 million during the same period in 2021. Adjusted EBITDA for the 3 and 6 months ended June 30, 2022 and 2021 decreased to a loss of $11.2 million from a loss of $2.9 million and a loss of $20.5 million from a loss of $6 million, respectively. As noted in our financial highlights, our recurring revenue for the 3 and 6 months ended June 30, 2022, increased to -- by 133% and 115% compared to the same period 2021. Putting 30 years of traffic engineering and data collection expertise from STS together with Rekor's next-generation artificial intelligence, machine learning technologies, has positioned us to become the leader provider of data services for the agencies in the U.S. that are working right now to plan intelligent infrastructure of the future. I think what's happening at this point is we're comfortable in saying that we can start to drop away from all of those other businesses and put less focus on those things and put all of our effort in what we started out to do, which is to be a data services company building an operating system for the roadways. And I think that's going to reflect in both the performance obligation, as you've seen here, just with a couple of weeks of STS being part of Rekor as well as the annual recurring revenue."
}