{
    "symbol": "RES",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 11:50:22",
    "content": " Fourth quarter revenues increased by 4.9% to $482 million from $459.6 million in the prior quarter due to improved pricing in most of our service lines and higher equipment utilization, supported by a full quarter of operations for our most recently reactivated pressure pumping fleet. We currently estimate full year 2023 capital expenditures to be approximately $250 million to $300 million, including a new Tier 4 dual fuel fleet we plan to place into service during the second quarter, at which time we expect to take down an existing fleet for refurbishment. If it can generate adequate returns and provide a quality service, we donâ\u0080\u0099t want to take it out of service too quickly, but then we have the long lead times for new equipment, so getting the timing right between when an existing fleet will be ready to retire or lay down, right, thatâ\u0080\u0099s tricky, and thatâ\u0080\u0099s not something weâ\u0080\u0099re trying to necessarily say those are going to happen on precisely the same date. So our--and return, you asked about our returns and the way we think about that, the return profile or what one would reasonably expect 12 or 14 months ago versus where we are today, obviously itâ\u0080\u0099s completely different, right, so we donâ\u0080\u0099t all of a sudden wake up and say, well, today or last month or last quarter, the return indications are unbelievable so we should ramp our spend or our investment. Weâ\u0080\u0099re trying to--we expect to remain disciplined, we want to go at an appropriate pace, having a longer term plan and try to execute against that plan, and allow us to take advantage of the opportunities, be there to provide services to our customers, maintain our existing capacity more or less, selectively grow but maintain our capacity, and focus on that continuing to return excess cash to shareholders. When the brand new fleet comes in around the same time, weâ\u0080\u0099ll take down one of our older fleets that weâ\u0080\u0099ll spend some money and upgrade it, and once itâ\u0080\u0099s upgraded, we expect that will be--there are other fleets that need to be either refurbed or otherwise dealt with, so as we indicated, weâ\u0080\u0099re expecting still to have 10 horizontal fleets working--more or less 10 horizontal fleets working throughout 2023, with the gives and the takes of ones going down for refurb and that sort of thing. Now there is--as I indicated earlier, there is a lot of spending going on, there is a lot of new equipment orders amongst our peers, but thereâ\u0080\u0099s a lot of discussion about the fact that they too are not going to--theyâ\u0080\u0099re not striving for net additions to their fleet, so thatâ\u0080\u0099s implying that they plan to take some of that equipment out of service. I think the transition, just like other transitions of technology like this, will take a period of time, so thereâ\u0080\u0099s going to continue to be, I think, plenty of demand and strong demand for traditional diesel equipment more so--you know, the DGB, and so weâ\u0080\u0099re moving in that direction."
}