{
    "symbol": "NOC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 13:59:08",
    "content": " To help calibrate you to this slide, we've highlighted the 2023 pension estimates provided in January which were based on expected 2022 asset returns of 7.5% and a year-end discount rate of roughly 3%. Given the year-to-date asset returns and discount rates at the end of Q3, we would expect significantly lower net FAS pension income in 2023, currently in the range of over $900 million less than our previous projection. As Kathy described, we continue to expect our sales growth to accelerate next year, building on the momentum we've driven in 2022. And this year, I would point to our 2022 original guidance which was our expectations with either minimal or no supply chain disruption, because when we put that plan together late last year, we were not anticipating the level of supply chain disruption nor the duration of supply chain disruption that we've experienced. So our -- plans for capital deployment are still aligned with what we've been saying all year, a balanced approach to capital deployment, still investing in supporting the growth of the business that we've experienced which as we said, has been even more robust we anticipated coming into this year, not just because demand is higher but we have been quite successful in competitive wins. I think the way we look at it is, the really strong head count growth that we've had over the last quarter, in particular but the last 6 months broadly, adding approximately 4% to our overall employee count or over 3,500 employees really shores up the labor visibility for labor-driven sales for 2022 and sets us off on a good track for '23. In Space, we think the volume of new development work they've continued to add and the pressure that's put on their margin this year is again a good reflector of what you'd be likely to see next year in Space. But we think today, the appropriate outlook is about 20 basis points lower margin rate next year with continuation of -- kind of the second half trends we're seeing this year in net EACs. Kathy and Dave, I know you are just in the early stages of 2023, so sorry to bring up 2024 but you guys have talked about cash flow target for that year and also segment margin, I think, in the 12% range. But again, critically, the sales growth expansion we see next year, the acceleration of the 4% to 5% range, multiyear free cash flow guidance remaining intact, I think, is indicative of the kind of economic value we're delivering even in this environment. We feel that we are in a good position with backlog in each of the businesses going into 2023, supporting the accelerated growth that we've laid out in our outlook for next year."
}