{
    "symbol": "NOC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 13:58:02",
    "content": " However, we're pleased with the progress our team continues to make in addressing these challenges and hiring trends improved as we progressed through the second quarter, laying the foundation for sales growth in the second half of the year. While these new business metrics position us for growth going forward, our Q2 sales of $8.8 billion and first half sales in total came in slightly below our expectations as we continue to manage through global supply chain and labor market challenges. I think that's well characterized, Kathy, at a program level, in addition to being confident in our ability to deliver more in the second half, the timing of demand is also more weighted toward the second half of this year as opposed to last year when the demand timing at a program level happened to be a bit more weighted toward the first half of the year. We're -- as you mentioned, we're incredibly pleased with the backlog growth, the award volume that we've had in space programs like both the transport and tracking layers of the FDA architecture are great examples there of work we're doing, really at multiple layers with multiple products supporting multiple mission areas in the national security and civilian space markets. In terms of how that backlog then breaks down in terms of award volume over time -- or sales volume over time, it's been our fastest-growing business and we anticipate that it will continue to be our fastest-growing business and not just any 1 program, GBSD is obviously a large contributor to its growth last year and this year. I think in recent years, within Europe, there's been a sense that we're working toward a longer-term threat horizon and perhaps the pacing of national and defense security spending would have been appropriate in that environment but the fact that the threat is more imminent is addressed in what you're seeing is planned or committed increases in defense spending across most of the European nations. So this includes managing supply chain affordability, looking at second suppliers where we feel suppliers are not addressing affordability, reducing costs in our own areas of overhead costs, including the real estate footprint as we noted earlier today, so while inflation is something that we are managing on a daily basis, I would say we haven't seen a material impact to our financials so far this year but we have to continue to be diligent to make sure that it doesn't become an impact."
}