{
    "symbol": "MTN",
    "quarter": 2,
    "year": 2023,
    "date": "2023-03-09 21:42:05",
    "content": " Improved conditions at our Colorado, Utah and Tahoe resorts enabled select early resort openings and drove strong early season local visitation, and the easing of travel restrictions in Canada contributed to a strong rebound in destination visitation at Whistler Blackcomb relative to the prior year period. Across our 26 Midwest, Mid-Atlantic and Northeast resorts, collectively referred to as our Eastern U.S. resorts, results for the quarter were negatively impacted by abnormal weather conditions, which significantly reduced operating days, terrain availability and activity offerings across the region which impacted demand and increased operating costs, including snowmaking, grooming and related labor costs. In particular, results at our Eastern U.S. resorts were significantly below expectations in the post-holiday period, as conditions did not return to normal after the holidays as was incorporated in our guidance, with January having only 50% to 60% of lifts and terrain open during that period. The recent significant investment in our employees helped drive increased staffing levels relative to the prior year, enabling our mountain resorts to deliver normal operations of important guest experiences such as our restaurants, lodging, ski and ride school, and rental and retail locations, which helped drive a return of ancillary spending. Resort reported EBITDA decreased approximately 1% from the prior year, as profitability was impacted by the investment in our employee and guest experience, early openings and expanded terrain at our Western resorts, as well as increased operating costs from the abnormal weather conditions at our Eastern U.S. resorts. For the second quarter of fiscal 2023, net income attributable to Vail Resorts was $208.7 million, or $5.16 per diluted share, compared to the prior year of $223.4 million, or $5.47 per diluted share. Across our Eastern U.S. resorts, over 25% of planned operating days for the 2022/2023 ski season were negatively impacted by extreme weather events, including many days with full or partial resort closures. Our ancillary businesses continued to see strong growth over the prior year period, driven by increased staffing levels that enabled our mountain resorts to deliver normal operations of important guest experiences such as our restaurants, lodging, ski and ride school, and rental and retail locations, which helped drive a return of ancillary spending. While we continue to expect strong demand from our destination guests at our western North American resorts for the remainder of the season, we are lowering our guidance for fiscal 2023, primarily due to the significant weather disruptions at our Eastern U.S. resorts throughout the season-to-date period, as well as continued significant snowstorm disruptions at our Tahoe resorts. For fiscal 2023, we expect contribution margin from our 26 Eastern U.S. resorts, excluding an allocated portion of pass product revenue, to underperform initial expectations provided in September 2022 by approximately $43 million, with the majority of the underperformance occurring after the peak holiday period. Our Eastern U.S. resorts have a significantly lower proportion of skier visits in advance commitment products relative to our western destination resorts, and the financial results this year further strengthen our resolve to continue to drive guests into an advance commitment product, particularly in our northeast markets. The company is planning to introduce new technology for the 2023/2024 ski season at its U.S. resorts that will allow guests to store their pass product or lift ticket directly on their phone and scan at lifts hands-free, eliminating the need for carrying plastic cards, visiting the ticket window or waiting to receive a pass or lift ticket in the mail. In addition to these investments, we are planning to invest approximately $10 million at Andermatt-Sedrun in high-impact growth capital projects as an initial step in a multi-year strategic growth investment plan to enhance the guest experience on the mountain, which will be funded by the CHF110 million capital that was invested as part of the purchase of our majority stake in Andermatt-Sedrun. Including $1 million of one-time investments related to integration activities, $10 million of deferred capital associated with the Keystone and Park City projects, $5 million of reimbursable investments associated with insurance recoveries, and $10 million of growth capital investments at Andermatt-Sedrun, our total capital plan for calendar year 2023 is expected to be approximately $206 million to $211 million. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}