{
    "symbol": "AA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-20 18:48:05",
    "content": " For the second quarter based on today's prices, we expect both alumina and aluminum realized third party prices to be higher than the first quarter, with part of that benefit offset by approximately $115 million of higher energy and raw material costs. Looking at the segments, excluding index sales prices or currency impacts for the second quarter, in bauxite we expect EBITDA to be approximately $10 million as one-time benefits in the first quarter do not recur and we slowed production rates in Juruti in response to ceasing supply to Russian businesses. In the Aluminum segment, we expect alumina cost to increase approximately $35 million and expect improved shipment volumes to provide a $50 million benefit, more than offsetting $30 million of high raw materials prices and energy impacts as well as maintenance costs of $10 million. So overall, it's important for you to understand that while we are seeing some higher raw material and energy costs, we're guiding to a strong second quarter. Given the capital -- the working capital increase that we saw in the quarter and the fact that cash balance did decline a little bit in the first quarter, we think that, that $75 million was the right level of buybacks in the first quarter. So, look a little bit forward and on this question on Russia, how do you think -- you've done it -- it sounds like you're getting to a more -- I won't say comfortable is right word, but you're getting -- you're working through the issues because of the disruptions over the last six weeks from the invasion. When I look forward, and this gets up to 2050 where we have a net zero commitment already in place, the answer becomes a little bit more simple, because we need to find a way essentially to have zero carbon production -- zero carbon emissions production of aluminum and alumina, which is why we're doing all these different projects. We're also starting to see that there's a little bit more friendliness to operations that use coal as an energy source here in the short-term, because as you see some of those COVID issues, the supply chain issues and the start of a slowdown -- a bit slower growth in that economy that they want to make sure that the economy is moving faster. We made the decision -- we've been talking about the Alumar restart now for probably a couple of years, looking for that energy contract and then making sure that we can staff the facility in a place where there's probably lots of good, knowledgeable operators that had worked at that facility before, but it's hard to get people to work. And I think Roy alluded to the fact that when Nikolaev went down, alumina prices spiked quickly because of the fact that 1.7 million metric tons was being taken out of the aluminum market, and there's simply not a lot of inventory in alumina."
}