{
    "symbol": "AA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-20 20:37:04",
    "content": " Lower metal prices, which included approximately $40 million to set inventories to net realizable value combined with higher costs as well as lower aluminum and alumina premiums to more than offset those benefits. Looking to the third quarter compared to the second quarter, in bauxite we expect adjusted EBITDA to improve approximately $10 million on higher internal demand with higher intercompany prices, offsetting increased production costs. Those factors should also advantage today's low carbon emitting producers like Alcoa as demand continues to grow for low carbon aluminum, particularly in markets like Europe and North America. If we look at the 2.5 million tons to 2.6 million tons of capacity now, if say for whatever reason prices continue to go down another 10% and another 20% for example where â\u0080\u0093 and costs all kind of stay where they are, about how much of that 2.5 million tons to 2.6 million tons of capacity would be at risk of closure in a sort of a six month to one year weak pricing environment? And I think that's not just aluminum that's across the board, and so what we've seen is more and more interest over these last two to three years of how can you guarantee not just the quality and the price, but also the fact that you're going to have that material when you need it, because we don't have the material, you're not going to be able to produce and therefore you're losing demand or losing it to other competitors. And so for us it's an advantage for Alcoa because a lot of our capacity and a lot of our customers happen to sit in North America and Europe, which is where we have also the strongest premium environments where we offer our value added products and where we can â\u0080\u0093 where we can actually create more value because we have cast houses that we can invest in and where we have good capacities inside of our value-add to make those connections with customers."
}