{
    "symbol": "POOL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 15:26:08",
    "content": " This morning, we proudly reported another record quarter with net sales coming in at $2.1 billion, an increase of 15% marking our first ever $2 plus billion quarter and beating last year's very strong second quarter where we saw sales increase by 40%. Second, following two years of very favorable weather in the second quarter, we experienced a cooler and wetter start this year in our seasonal markets that delayed many projects impacted the demand and timing of sales of many products from packaged pools and equipment to chemicals. After a tremendous 2021, Europe is facing a difficult 2022, driven by very unfavorable weather uncertainty on the continent because of the war in Ukraine and a slowing economy that is wrapping with surging energy and food costs, we saw sales declined 18% in the quarter. As expected, second quarter 2022 continued with robust 15% sales growth over 2021, pumping last year's phenomenal growth in our seasonally significant quarter, which is a tremendous accomplishment. Receivables increased 29%, reflecting higher sales growth in June than the full quarter, additional amounts due from vendor programs as a result of higher sales year-to-date and 5% from acquisitions. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. If I look at the new construction business, I would tell you that new construction could swing one way or the other based on a variety of factors, some economic, weather is always going to be a big factor in how many pools get built and labor, which the labor environment, given the current unemployment statistics that we all see every month, wouldn't lead any of us to believe that there's going to be a bunch more capacity brought into the industry for new pool construction. Please go ahead with your question."
}