{
    "symbol": "POOL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 17:48:08",
    "content": " The Horizon team continued to perform well as we posted base business revenue growth of 12% in the quarter, bringing the year-to-date sales growth to 17%. At the same time, however, the non-discretionary maintenance and increasing content on the replacement items as well as the structural inflation on the growing installed base have allowed us to grow this year despite the fact that new pool construction activity may be down from the previous year by as much as 15%. In comparing the quarterly growth of 14% to the full-year expectations of 17% to 19%, we saw third quarter growth of approximately 10% on pricing, 4% on acquisitions, and net overall domestic volume growth. Base business operating expenses as a percentage of net sales decreased from 14.5% in prior year to 14.2%, as our capacity creation efforts continue delivering operating margin leverage, as we manage through the inflationary cost impacts of our business. As we look out for the balance of the year with just the fourth quarter remaining, we still expect our sales growth to range from 17% to 19%, reflecting a 5% contribution from acquisitions and 10% from inflation. So if you look across the -- our customer base, I think there is an adequate backlog as it as high as it was last year, no, but I think given the state of the economy I think that there is plenty of work out there, exactly how many again we're -- we still have a almost a quarter to go, so we're estimating the minus 10, the minus 15. So really, we're certainly not forecasting to this, but let's say new pool construction fell another 20% next year. But when I look at it in terms of the impact in total, I mean, you're talking about a business that is, less than 10% of our total, I think we've been moving more and more of that business focused to the maintenance and repair piece, which should mitigate a cooling off in new construction, number one. But the revenue ladder, if you will, 60% maintenance discretionary new, whether it's down 10%, 25%, it doesn't seem to be that's the issue in terms of what is in investors' mind so much as much as perhaps the -- and I know you guys went over this at your -- at the Analyst Day, Melanie, you talked about to gross margin just recently at 30% drop. Look, if new pool construction is flat next year or up a couple or up 10% or minus 10% or minus 15%, again, we kind of -- or even minus 20%, we kind of outlined what that means for the business."
}