{
    "symbol": "POOL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 16:38:09",
    "content": " As I previously mentioned, total sales for the year came in at $6.2 billion, which represents a 17% increase over 2021, where we saw sales grow an incredible 35%. From a base business perspective, fourth quarter revenue grew by 7% in our year round markets and fell by 6% in the seasonal markets. Pinch A Penny retail sales, unlike our shipments to dealers and contractor customers, represent through to the end customer saw sales increased 17% for the quarter and year. Base business chemical sales for the quarter were up 19% and 32% for the year, reflecting share gains, installed base growth and inflation. For the quarter, we recorded $107 million in operating income, a 16% decline, most of which is driven by the seasonality of our business and magnified by the relative size of the quarter. As new construction levels will likely decline in 2023, the wholesale value of the pools built should, in fact, be at least 4% higher on a per unit basis driven by inflation alone. During the quarter, we recorded an additional $13 million in cost of sales resulting in 120 basis point decrease in gross margin for fourth quarter and 20 basis points for the full year. Without the impact of the increase in duties, gross margins would have been 30%, which is 110 basis points less than prior year and slightly better than the decrease of 150 basis points, we were expecting at the end of second quarter as benefits from inventory investments remain strong. Operating expenses grew 7% to $208 million and as a percentage of sales, were roughly comparable with prior year fourth quarter. Revenue growth has expanded since 2019 by 93% driven by approximately 30% to 35% from inflation, 17% from acquisitions, 9% from new pool construction, 7% from the growth in the installed base of pools and 25% to 30% from market share and new product growth. With the new pool construction expected to be approximately 98,000 new pools, down 16% from prior year, we estimate that our 2022 domestic pool distribution revenue was comprised of slightly more than 60% from maintenance. During 2022, we repurchased 1.2 million shares for a total of $461 million and increased our quarterly dividend per share by 25%, returning $611 million or almost 82% of net income to shareholders. In view of the potential for flat to slightly lower sales, gross margin compression and inflationary pressures on expenses, we would anticipate operating margin to decline as much as 100 basis points to 150 basis points compared to 2022 full year results. Coming off of a 26% base business increase, for 2022, we would expect that tough comp to kind of in line with our overall guidance for the year that we could see some negatives to that tough comparable. So as it relates to the incentive compensation, we did see a $13 million decrease in the 2022 results, and that was primarily driven when we looked at kind of our earlier guidance throughout the year, we were expecting a 17% to 19% top line growth. So in a quarter where new pool construction -- it was the slowest quarter of the year for new pool construction, where building material sales to be flat in that quarter implies that the renovation market, which is the one of the only two places that building materials are used, it implies that the renovation market is actually holding up pretty well."
}