{
    "symbol": "KRKR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-07 13:20:27",
    "content": " Our verticals sub-media outlets or youth also continue to gain brand influence boosting this commercialization potential by connecting content format from various channels including tax graphics or lab training or use consumer feed the varied needs of our diverse customer base as for commercialization multiple well-known companies including iQiyi, Huawei, Jingdong and Zhihu became repeat customers in the third quarter and we established new cooperations with Bon Way, STEPVR and other New Economy brands. During the quarter we expand our customer base with additional government agency customers in Beijing, Chengdu, Shenzhen, Hangzhou and Chongqing, as well as renowned enterprises, including Lenovo, Baidu, ByteDance and P&G, elevating this business commercialization as for our contentâ\u0080\u0099s operation agency services, we continue to explore content services, mobilization standardization of our app to enhance our service efficiency and quality. According to northeast accretive data, the digital economy has become a key driver of China's economic development, accounting for 40% of China's GDP and rising representing our second growth engine and commercialization break through, the enterprise service review platform is dedicated to empowering the thriving sub industry. In the third quarter, our enterprise service review platform reported exceptional performance across multiple operating metrics, as well as creating -- as well as great progress in functionality improvements, user acquisition, innovation and commercialization. Share-based compensation expenses recognized in cost of revenues, sales and marketing expenses, research and development expenses, as well as G&A expenses totaled RMB 2.6 million in third quarter of 2022 compared to RMB 4.9 million in same period last year. So in terms of commercialization, we established cooperation with Lenovo in the third quarter to empower customer acquisition and brand management, marking an important value in our enterprise service review platform commercialization costs."
}