{
    "symbol": "CLB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 17:15:28",
    "content": " For the third quarter of 2022, Core Lab achieved sequential improvement in revenue, operating income, operating margins, free cash flow, EPS and EBIT margins. Following Q2's strong 43% sequential incremental EBIT margins, even after accounting for currency devaluations of the euro and the British pound, full company sequential incremental EBIT margins for Q3 grew to over 55%, once again reinforcing the operational leverage available to Core Lab, as global activity improves. Revenue from continuing operations was $126 million in the third quarter, up over 4% from $120.9 million in the prior quarter and up almost 7% year-over-year. Of this revenue, service revenue which is more international was $87.9 million for the quarter, up 3% sequentially from $85.4 million last quarter. Using a constant US dollar, international service revenue would have been translated into an additional $1.5 million, when compared to last quarter and an additional $4.3 million when compared to Q3 of last year. Product sales, which are more equally tied to US and international activity were $38.1 million for the quarter, up over 7% sequentially and up 15% from last year. EBIT, ex-items for the quarter was $13.3 million, up from $9.6 million last quarter, yielding an EBIT margin of 11% and up over 260 basis points sequentially. Income from continuing operations ex-items for the quarter was $8.3 million, up $2.8 million or over 50% from the last quarter. As a result, for the fourth quarter of 2022 Core's Reservoir Description segment revenue is projected to be flat to up slightly, while momentum in international activity continues to build near-term growth may be affected by two factors: volatility associated with the Russia-Ukraine geopolitical conflict and client-driven project delays. Core projects fourth quarter revenue to range from $126 million to $131 million and operating income of $13 million to $15 million, yielding operating margins of approximately 11%. In other developments, Core Lab is pleased to announce that during the third quarter of 2022, Quantum Energy Partners and Trace Midstream Management joined Core's Carbon Capture and Sequestration Consortium, bringing total membership to eight participants. During the third quarter of 2022, Core Lab continued to build on the success of its proprietary Plug & Abandonment Perforating System called PAC which is used for oil and gas well abandonment programs. Over on the service side of Production Enhancement, operators continue to leverage Core's expertise in completion diagnostics for offshore wells during the third quarter of 2022. And then we put together this consortium, in collaboration with the University of Houston to really focus on where Core Lab has its applicable expertise and that is an understanding, what happens when we -- when people try to put for 30, 40, 50 years or longer try to put large volumes of CO2 in the ground, it's going to react with the poor fluids, it's going to react with the rocks."
}