{
    "symbol": "CYRX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 23:16:05",
    "content": " Before we begin today, I would like to remind everyone that this conference call contains certain forward-looking statements. All statements that address our operating performance, events or developments that we expect or anticipate occurring in the future are forward-looking statements. However, you should not place undue reliance on any such forward-looking statements, because such statements speak only as of the date when made. We do not undertake any obligation to publicly update or revise any forward-looking statements, whether as a result of new information or future events or otherwise, except as required by law. In addition, forward-looking statements are subject to certain risks and uncertainties that could cause actual results, events and developments to differ materially from our historical experience and our present expectations or projections. These risks and uncertainties include, but are not limited to, those described in Item 1A, Risk Factors and elsewhere in our annual report on Form 10-K filed with the Securities and Exchange Commission and those described from time-to-time in the other reports, which we file with the Securities and Exchange Commission. It is now my pleasure to turn the call over to Mr. Jerrell Shelton, Chief Executive Officer of Cryoport. With us this afternoon is our Chief Financial Officer, Mr. Robert Stefanovich; our Chief Scientific Officer, Dr. Mark Sawicki; and our Vice President of Corporate Development and Investor Relations, Thomas Heinzen. As a reminder, we have uploaded our first quarter 2022 and review document to our website. Our financial results reflected continued growth and strong performance that was partially offset by the adverse impact of the fire at our New Prague, Minnesota manufacturing plant of approximately $9.4 million. We believe the impact from the fire is isolated to the first quarter, and we intend to recapture the revenue throughout the remainder of 2022. During the quarter, our pipeline of potential commercial customers and return to medicine continue to grow with the total number of clinical trials supported by Cryoport reaching a record 609 trials at the end of the first quarter 2022, an increase of 12% over the first quarter of 2021 and 30% higher than the first quarter 2020. It is worth noting that a record 81 of these trials are now in Phase 3, up from 69 at the same time last year. To meet the industry demand, we will be expanding capacities in all business units as well as growing our global footprint. One, next month, we will have the grand openings of two Global Supply Chain Centers, one in Houston, Texas; the other in Morris Plains, New Jersey. These new Global Supply Chain Centers are the beginning of a Global Supply Chain Center Network, which is complemented by our acquisition of Cell&Co, which is located in Clermont-Ferrand, France and we'll be expanding to Paris. Two, we will continue making acquisitions to expand our first choice courier network for biopharma. Three, our world-class biostorage platform will be expanded from Houston into San Antonio and Philadelphia. And four, we will continue to increase our cryogenic systems manufacturing capacities, both incrementally and through plant expansions. These expansions will be augmented with the launch of multiple new services, products across -- new services and products across our company such as expansion of consulting services, the introduction of fully validated Cryosphere and a new model of the fusion cryogenic freezer. Through these and other initiatives, our vision of becoming the most comprehensive and compelling supply chain provider serving the life sciences industry is coming to fruition. And while we are not totally immune to global macro conditions, we continue to see strong demand for our products, systems and services. Through April 30th, we repurchased approximately $23 million in shares and remain in the market. We see opportunities to continue executing our strategy of building the most comprehensive and compelling supply chain provider serving the life sciences industry through organic growth, acquisitions and partnerships. Despite the current turmoil in the capital markets, we are well positioned to continue our track record of strong growth and market share gains for the foreseeable future. Now, we'll be happy to entertain your questions. So, operator, if you'll please open the lines for questions. John, that's a good question. I'm going to turn that to Robert, Robert Stefanovich. So, for the full year guidance, we have $260 million to $265 million. One, that does include the revenue that we expect to achieve for the full year. Also, if you look at the next nine months or the next three quarters, we're looking at about a 23% to 26% growth based on that annual guidance. So obviously, we are quite bullish about the prospects for the full year 2022. Yes, John, that's -- I mean, we won't have a financial impact because -- on the bottom-line because the insurance will take care of that. But our manufacturing team is committed to make up that $9.4 million, $9.5 million loss that we had in the first quarter over the rest of the year. And then, I guess, just lastly, public market biotech funding has been a little light year-to-date coming off of record years the last two years. Let me start the answer, and then I'll turn it to Mark Sawicki. As you know, the number we report every quarter is a net number. So, the net number is what we report every quarter. And as you -- as I mentioned earlier, we ended up with 81 of our 609 trials in Phase 3. So if we actually take a look at our core competency as it relates to clinical support, we focus on the cell and gene space. And in fact, the activity level there has been very strong, if not actually increasing a little bit. So we feel very, very bullish about the environment as evidenced by, obviously, our continued progress in the space and the progress overall. Jerry, maybe just starting with the guidance issuance. Yes, it's a good question, Brandon, because we, up to this point, have not given guidance on revenue. And we think, first of all, it's -- we're right at the prefaces of expectations of guidance. I mean, we are going to be achieving $260 million to $265 million in revenue. As far as MVE goes, we don't give guidance on units. So I don't -- I can't talk about that except to say that the backlogs are strong at MVE, and there's been no diminution of demand. In fact, it's continued to be very, very strong and has been strong for a good while. Maybe just what you already said, and obviously, we're confident. You may recall, Brandon, in the past, we did talk about the business units really to reflect the acquisition of CRYOPDP and MVE and to look at organic growth versus the acquisitions. Now, this is really one operating platform with the businesses. So, we don't specifically talk about revenue guidance for MVE Biological Solutions or CRYOPDP, but have both expected to grow meaningfully and contribute to the overall results. And then as you would expect, Cryoport Systems in terms of growth rates is expected to lead the pack. Yes, Robert, if you don't mind, I'm going to add one more. Brandon, I want to just comment on your commercial question here. So as you're aware, we were just talking about it, we focus on a portfolio approach to the clinical and commercial space. That's obviously demonstrating success, and we expect that commercial growth to continue for four primary reasons. One, we're going to see a continued number of approved therapies that expand out on a global basis, which we're seeing evidence of already with additional approvals of folks like Novartis and others. The Kite -- Gilead/Kite product has moved to second-line BMS, will be filing for second line, for example, which substantially increases the addressable patient population. And these approved therapies continue to expand indications, right, as well as new therapy launches. So, the four of those obviously bode very well from a commercial standpoint for us for the foreseeable future. Got it, that's helpful. And then a follow-up on MVE, you mentioned supply constraints. And then secondly, you talked about in the packet expanding capacity in the U.S. Can you just be more specific about the timeline for that new capacity coming on board? I mean, the capacity expansion is taking place as we speak on an incremental basis. I mean, we've added shifts. So that's incremental, but we also are planning an actual plant expansion, and that will take a year or so. Jerry, you got $600 million cash on the balance sheet, not burning that much unlike a lot of other smaller companies. Well, the acquisition pipeline is made up of those areas that we've talked about in the past. And of course, we're filling in gaps. And we do intend, as I mentioned in my remarks, to be the most compelling, most comprehensive supply chain support system for the life sciences in the world. And so if you look at our acquisitions, strategic acquisitions take a much longer time, and they're rare. Tactical acquisitions, you've seen us make several of those, and you will see us continue to make tactical acquisitions. We're looking at a lot of opportunities in the space, and we're eager to announce them as they come along. There's a strong position, but that's about as far as I can go in commenting on how we will be using that capital other than the purchase we -- the repurchase we made on the stock. My first one is about a recent proposal, policy proposal from CMS. We saw suggesting like a 3% decline to CAR-T reimbursement, which continues to be lower than hospital costs. So, I'm going to start -- answer a couple of things, and then turn it to Dr. Sawicki because he's closer to this. But look, this is a nascent industry. I mean, it's taken a long time for us to get to this point. But we still aren't -- to use the baseball metaphor, we still aren't out of the first inning. So, from that, I'm going to let Mark talk about his views and what he's seeing in the marketplace. No, I think that Jerry is absolutely correct. The biggest limitation on the space right now isn't reimbursement, it's honestly manufacturing capacity overall. Our -- a lot of our commercial clients are very candid about, obviously, the impact and shortage of either drug product manufacturing capacity or viral vector manufacturing capacity. So, from our perspective, that's the biggest impact on scalability is bringing that capacity online. The earlier that they bring them online, and obviously, there's a cost justification that they can use as it relates to the overall spend against the patient demographic component. So, from our perspective, that's a nonissue. And I know last quarter, you said you're thinking 2023 is when they'll actually start meaningfully contributing to revenue. Again, I'm going to start the answer and then turn it to Dr. Sawicki. But these -- so when you think about Bioservices, I want you to think about Global Supply Chain Centers because that's what these are. It is a revolutionary service, although some folks don't like to look at it exactly that way. But Bioservices comes in as a part of the supply chain center, which will -- so what that means is we'll have world-class logistics services combined with Bioservices, which includes biostorage, secondary labeling, kitting, fulfillment. Remember, about a third of our trials are allogeneic. So, it's married there and it will provide a lot of services, and that's the core though. And these supply chain centers, which include Bioservices, these first two are in Houston and Morris Plains are just the beginning, of course. It's already a biostorage operation, and it will be converted to that system. But you'll see us opening up more supply chain centers and creating that global supply chain network, and the network is really important. So my guess is that eventually, we'll have 18 to 25 Global Supply Chain Centers around the world forming that network. And there's a lot of power in having a network because you have redundancy, you have backup, you have more surety, you have less risk by having a network. So, I'll let Mark take it from there. Yes, the only thing I'll add, and Jerry is absolutely right. However, there's already robust client activity related to bringing product and activity into both locations. Obviously, the timing and the reason that we were saying that you'll see a more material impact in 2023 is the validation and onboarding processes of moving clinical activity or commercial activity into a new space takes some time. And we stand by the fact that these will be very, very actively and heavily used as these organizations complete their validation processes. You guys have talked about in the past 55% gross margin, 30% EBITDA margin. 2025, you guys were talking about an ambitious target of $650 million to $750 million. Well, I'll start and then turn it to Robert. The -- our target of $650 million to $750 million remains in place by 2025, but we have no reason to back off of that target. It will be a tactical acquisition, strategic acquisitions if we're lucky and then -- and partnerships and alliances to move us forward. And Robert, you may want to comment on margins and other metrics. And you're absolutely right, the target gross margin is 55%. Again, you have to step back and look at where we are right now. Early stages of the cell and gene therapy market, we are the leader in this space, and we're constantly expanding our solutions and with that, our revenue capture and then market share on a global basis. So with us supporting 609 clinical trials, the maturing of that clinical trial base with now 81 trials in Phase 3, I mean, this is a significant number. So we believe that the result in commercial revenue that we can support will one, lead to expansion of margins, increase economies of scale and drive the adjusted EBITDA bottom-line. Right now, we're still in that building phase. So, you'll continue to see us build out the Global Supply Chain Centers that Jerry was talking about. And in spite of that, we still keep a positive adjusted EBITDA for the quarter. So, we do think it's the aspirational target set about year and a half ago is achievable, and then we're working hard to make that happen. I mean, the Cryogene, there's a few things to say on Cryogene. One, the expansion that already happened in terms of the footprint in Houston. And then second, as we talked about the expansion into other geographies, which includes two additional sites in Philadelphia and in Austin. So that will further, obviously, bring revenue capture. They have a very kind of winning approach to the market in the Houston market, and we'll replicate that in those two additional locations. So, you should expect to see as those are put in place, there will be further revenue growth, profitable revenue growth from the Cryogene side. So, outside of the kind of one-time impact of the fire damage that impacted the MVE revenue, but revenues were very strong for Q1. Well, I think you're right. I mean, we do have a very disciplined approach in terms of the acquisitions overall. So, you look at the cell and gene acquisition -- the Cell&Co acquisition, in particular, I think it was attractive, but it's really more the strategic element that Jerry was referring to related to Cell&Co that really will bring value, much more significant value to Cryoport and the Cryoport family of companies. So, it's really just the approach we're taking. We're looking for strong leadership and entrepreneurial spirit, which the Cell&Co management team certainly brings to the table. So, it allows us to enter into the European market probably two years sooner than we otherwise could have through an organic buildup, and that's probably a conservative view. So Paul, I'd just add a couple -- Paul, I'll just add a couple of things there. And number two, reinforcing what Robert said about the strategic elements. In addition to meeting all the strategic elements that we wanted and accelerating us by a couple of years in EMEA, it met all of the -- our financial hurdles, our ROIC and return on investment criteria. So, it's an excellent acquisition and fantastic people. And just also the acquisition was $6 million, $6.7 million. And $2.7 million, that is earn-out on reaching specific milestones. You're talking about the non-commercial, yes. Can you maybe just talk a bit about the impact of inflation that you're seeing on the business, specifically freight. And then also steel and then also any sort of technology components like semiconductors, in particular. David, let me comment on -- in the beginning. Look, inflation is my number one worry. And because if it's not properly controlled internally, then we get margin squeezes and that sort of thing. We -- it hits us in all of the areas, just like it does everyone else because we're not immune to it. I mean, stainless steel, aluminum, semiconductors or all our materials as well as freight. On the others, we do pass that through also in terms of price increases. We have early warning systems within our company -- within our companies to let finance know immediately when a price increase is sufficient, not when the order is placed, not when the purchase order is written, not when the invoice comes in, but when they -- suspicion, a price increase. And so we work hard to have, like we do on every other situation, we work hard to have control over these situations because they exist. No, just to state a few more items and emphasize one that Jerry already mentioned is the transportation piece, that is covered. But if you look at maybe a different angle, if you look at our gross margins, we do believe gross margins have stabilized. As Jerry mentioned, if you look at MVE, they've improved slightly sequentially, but they're still experiencing increased costs of raw materials and inventory. And like Jerry said, very, very careful and analyzing any increases that we see in the market for the products and systems that we develop. And then there was a clinical trial element to your question that Mark can answer, I think, David. Yes, I think the only thing I'll add to that is that we kind of addressed this earlier. So, the activity in like Shanghai and China, that's not having an impact on your business. We don't -- on a global basis, you can see, I mean, all three geographies continue to grow the total number of trials and trial count. Now, we have not seen an impact from a geographic standpoint based on any macro environmental conditions at this point in time. Pipeline growth is good, and you're adding capacity. David, that's certainly a -- in the future that we will look at that. But right now, I'm focused on asset utilization. So when you have a plant that's running one shift, you can run two. And then if you can go back in and reengineer the plant, sometimes you can add on to the plants and that we do have that underway at both plants. Then when you do add on, sometimes you can put in automation and other labor-saving processes. So, we're looking at all of those things. The first order of business is to improve our asset utilization, and we haven't maxed out there yet. So, that's our focus. With the $9 million in, I guess, delayed revenue, I would imagine some of your competition would be looking at that and trying to get in there and take some of that revenue. MVE has spent 60 years becoming the preeminent supplier of cryo systems, cryogenic freezers and doers  in the world. It occupies a lotted position for the highest quality, the fairest dealings of any supplier in the world. Now, it's called some pain for some of them because we go through a robust distribution network globally. Now, I'm sure that the competition has benefited to some degree from the backlogs that we have, but we have those backlogs because of the loyalty of our customers. And those customers are loyal because they know they're going to be dealt with fairly, and they're going to get the highest quality product. If you can talk about the existing customers and the potential customers that you guys can cover for those two centers, that will be great. And he said, that's where the money is. Well, the corollary to that is we're located in these places because in Morris Plains and in Houston because that's where the customers are. And of course, the major campuses of all the major -- roughly all the major players in the pharmaceutical industry are right there around the Morris Plains area, and that's important for us to be in those locations. And then we already have the Cryogene facility in Houston, so we can create a campus effect in the Houston area. As far as the services from these centers, they'll be exactly the same. This is the network effect I was talking about earlier, where we provide redundancy and decrease risk. And we also then want to create -- we also with that network effect, then we have that redundancy where if there's a catastrophic situation in one place, the other -- another node can take over and never miss anything. And now it's treated exactly the same, same SOPs and all the facilities making up the supply chain -- the global supply chain network. No, I think you articulated it really well. The only other thing that I would add is as we continue to build out this network, it provides organizations the ability to truncate supply chains and to shorten them to be able to get product into the hands of the patient that much more quickly. And some of these products have a very time-sensitive aspect to them, in particular, some of the newer allogeneic portfolio that's coming through, where ours may make the difference between a successful or a non-successful outcome for things that are related to spinal cord or cardio and other aspects. So, having a network of facilities that are able to store and distribute these types of product lines will have a substantial beneficial impact for our client base over time. And another question I have is in the last two quarters, the quarter-over-quarter growth of cell and gene product sales were single digits. And recently, Novartis has mentioned that they have seen lower demand for their products. So, I'll start, and then I'll turn it to Mark. Remember, we are the gold standard in terms of clinical trials and support of the industry. And I've mentioned, too, that this is a nascent industry. It's at the very beginning, and nothing is a straight line in the development of the industry. So, there's nothing concerning there to us. But it's still in these very early formative stages, and it's running short of manufacturing capacity. So if you take a look at Gilead/Kite and Bristol-Myers, for example, both of those folks have substantial additional manufacturing capacity coming online and have intimated that capacity constraints are restricting their ability to provide product for the addressable patient populations that they're going after on their product lines. Novartis has seen some loss in product revenue due to competitive factors, which they acknowledge. And they've also, obviously, launched -- looking at launching this new T-Charge platform, which they believe will reach substantial reduced manufacturing time, which will reduce cost but also provide a much larger volume of addressable product for patients potentially over time. And then ideally, some of them are also starting to target moving from second line to first line, which will also have a significant impact on the addressable patient population. In terms of pressure from supply chains, I've seen you guys have a better gross margin in this quarter compared to last quarter. We're not -- I would say the world is not out of its supply chain issues yet, but I will tell you this. The biggest issue right now in supply chain is containers, as you know, container availability. And like every other problem, we address it, of course, rightly and work through it. So, I guess the bottom-line is, I think it is getting better, but we're not through it yet. One bigger picture question, then I have a modeling follow-up. And as I think about those, I kind of think about the allogeneic opportunity. And obviously you made two shipments with autologous, but -- and only one with allogeneic. Jacob, I want Mark to sort of educate you on a couple of things there because I think on the surface, I think you're exactly right in terms of what you might think on the surface about autologous versus allogeneic. And so it's a lot more work, a lot more things going on with allogeneic. In autologous, there's duplicate doses made. I'll just turn it over to Mark because he knows a lot more of the detail, and we'll let you take it, Mark. The bottom-line is that an allogeneic therapy can have as many SKUs on dose, but it could have as many as a dozen doses depending on the indication and therapy class that's being addressed. So, you may have as few as one shipment. But allogeneic also requires bulk storage, fulfillment, secondary labeling considerations, which provide, obviously, the supply chain centers have the capacity to support each and every one of those components from a drug product distribution basis. So, you have to go through a drug product release process, and that can only occur in a controlled environment. So one of the drivers for buying the Cell&Co, for example, acquisition is the fact that we have QPs on staffing to do drug product release for assets that are being manufactured in the U.S. and released in Europe and could also support secondary labeling considerations for in-country labeling and language-related considerations. So, there's a lot of different factors that go into drug product distribution in this space. However, allogeneic does, in general, have a higher demand need for a supply chain center based on long-term storage and other fulfillment-related activities in general. And then just for Robert, just the insurance recoveries around the MVE fire. Insurance--\n Yes, insurance related to the MVE fire like the business disruption. Yes, I mean, that's an ongoing process, and it covers inventory fixed assets, the business interruption. We've already received, I think, around $8 million from the insurance so far. So, that's going to happen over the next quarters. But most of the work should be done within the second quarter, I think. In closing, first quarter 2022 was yet another quarter demonstrating our leadership position in temperature control supply chain solutions for the life sciences industry, supporting our markets of biopharma, animal health and reproductive medicine and especially life-saving cell and gene therapies across the clinical and commercial spectrum. Due to our comprehensive brand portfolio, growth initiatives, global reach and talented employees located in 15 nations who flawlessly execute on our winning strategy daily, we believe 2022 will be another year of results reflecting outstanding growth."
}