{
    "symbol": "GVP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 21:35:10",
    "content": " We were able to improve our order flow, and I do want to highlight that during the third quarter, gross orders were at $12.2 million and offset by roughly $2 million in order reversals for unused backlog unleaded projects. Revenue during the third quarter of '22 was $11.9 million, a decrease of 19% compared to the $14.7 million in the third quarter of 2021, and 6.6% lower when compared to the $12.7 million in the second quarter of 2022. Orders for this division were higher in the third quarter to $7.2 million when compared to the second quarter of 2022, which was $3.8 million, but lower when compared to the third quarter of 2021 when it was $11.2 million. Revenue in the quarter was $3.8 million, compared to $7.3 million in the third quarter of 2021 and compared to $4.8 million in the second quarter of 2022. Operating expenses, which excludes restructuring and depreciation and amortization expenses, in the third quarter of 2022 were $4.5 million compared to $3.4 million in the third quarter of '21 and $4.6 million in the second quarter of 2022. Net loss in the third quarter of 2022 was $9 million or $0.42 per basic and diluted share compared to net income of $11.4 million or $0.55 per basic and diluted share in Q3 of '21, and compared to a net loss of $1.4 million or $0.07 per basic and diluted share in Q2 of '22. The net loss reported in the third quarter included a noncash loss for an impairment of $7.5 million, which is incurred due to the business slowdown in the Workforce Solutions division, which, as a result, caused us to lower the carrying value of the division. Backlog at the end of the third quarter was $32.3 million, compared to $34 million at the end of the second quarter and $37.5 million at the end of the third quarter of 2021. Performance Engineering segment backlog was $26.7 million, and Workforce Solutions division was $5.6 million at the end of the third quarter and compares to $27.5 million and $5.6 million, respectively, at the end of the second quarter."
}