{
    "symbol": "GVP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 21:37:02",
    "content": " Revenue was $3.3 million for the fourth quarter and $17.8 million for the year, both lower on a year-over-year basis. So to summarize, we've made good progress during the fourth quarter and fiscal year, continued strong license revenue accompanied by recent improved orders and bookings are the result of getting out in front of customers and being aggressive to win the business that is available to us, while setting the stage to capture more business as industry spend recovers. Revenue during the fourth quarter of '22 was $10.8 million, a decrease of 22% compared with $13.9 million in the fourth quarter of 2021 and 9% lower when compared to the $11.9 million in the third quarter of 2022. Revenues from the company's Performance Engineering were improved during the fourth quarter, rising 10% year-over-year but slightly lower sequentially from the third quarter of 2022. Our Performance Engineering division continued to perform well for the company with revenues of $7.5 million for the fourth quarter of 2022, this compared to $8.1 million in the third quarter of 2022 and compared to $6.8 million in the fourth quarter of 2021. Orders for this division were lower in the fourth quarter down to $4.6 million when compared to the third quarter of 2022, which was $7.2 million, and lower when compared to the fourth quarter of 2021 when it was $7.4 million. Orders were significantly higher in the quarter on a sequential basis at $6.8 million, up 127% from the $3 million in the third quarter of 2022, but still lower from the fourth quarter a year ago when they were $10.5 million. While revenues were lower at Workforce Solutions, the margin were 16.2% in the fourth quarter, roughly flat compared to the year-ago period and slightly up from the third quarter's 15.7%, but delivering at the higher part of that range that this division typically yields and showing the higher quality of orders coming through. Operating expenses, which excludes restructured depreciation and amortization expense, in the fourth quarter of 2022 were $3.9 million compared to $4.5 million in the third quarter of 2022 and $4.6 million in the fourth quarter of 2021. Adjusted EBITDA showed some improvement with a loss of $407,000 in the fourth quarter compared to a loss of $1.1 million in Q4 of 2021 and a loss of $690,000 reported in the third quarter of 2022. The backlog at the end of the fourth quarter was $32.9 million, a slight improvement when compared to the $32.3 million at the end of the third quarter of 2022, as the company was able to secure additional new orders during December. The Performance Engineering segment backlog was $23.8 million, and Workforce Solutions division was $9.1 million at the end of the fourth quarter and compares to $26.7 million and $5.6 million, respectively, at the end of the third quarter."
}