{
    "symbol": "MRO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 12:43:19",
    "content": " Fully consistent with our disciplined capital allocation framework, our 2023 budget prioritizes significant free cash flow generation and return of capital to shareholders. At reference commodity prices of $80 WTI $3 Henry Hub and $20 TTF we expect to generate $2.6 billion of adjusted free cash flow and we expect to return a minimum of $1.8 billion to our shareholders, providing clear visibility to a double digit shareholder distribution yield. With regard to shareholder returns, our 40% return on capital commitment in 2023 provides visibility to $1.8 billion of minimum shareholder distributions at our reference price deck as a double digit return of capital yield, one of the highest in our peer space. As expected, consistent with our disciplined capital allocation framework and our more S&P less E&P mandate, we expect to deliver strong free cash flow and significant return capital to our shareholders across a wide band of commodity prices as the graphics on the right of the slide show. At our reference price deck, we expect our $1.9 billion to $2 billion capital budget to deliver $2.6 billion adjusted free cash flow at just over a 40% reinvestment paid. While our headline Permian wells sales guidance looks similar to last year, the strong well productivity and competitive drilling and completion performance that we've delivered is getting back to work over the second half of 2022 supports a higher level of capital allocation. In summary, for years now, I've reiterated my view that for our company and for our sector to attract increased investor sponsorship, we must deliver financial performance competitive with other investment alternatives in the market, as measured by corporate returns, free cash flow generation and the return of capital. Our first question, maybe just starting with the '23 outlook for Lee or Mike, one of the things that really stood out to us in the outlook was actually the number of Eagle Ford wells to sales in the plan, which was decently below our forecast, and it's about, I think, 20% lower year-on-year on an adjusted basis, if you just assume maintenance mode and then you add the 40 Ensign wells to the number of wells you did last year. I think we're particularly encouraged with the performance of the first 9 wells from the 2 pads that we brought online in the condensate window, very strong productivity, top decile and oil, really fully consistent with our belief that this is some of the highest capital efficiency inventory in the Eagle Ford. One, as I stated, we're firmly committed to our  (ph) capital framework, a minimum of 40% of operating cash flow to shareholders as long as WTI is about $60 and obviously, we're well above that right now. With respect to how do we pay back acquisition debt in the context of that return framework, I think we really have the capacity to do both, even at today's commodity price, as I look at this, I see the capability to not only meet and exceed our shareholder return goals but to start to meaningfully chip away at the acquisition debt and get that interest expense and just that gross debt out of the system. So that's how we think about the dividend, share repurchases, obviously, organic lion's share of our return of capital program, and I would expect that to continue as long as our free cash flow yield is indicative of a really efficient way to buy back stock."
}