{
    "symbol": "ATO",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-08 12:02:05",
    "content": " Yesterday, we reported fiscal 2023 first quarter net income of $272 million or $1.91 per diluted share, and we reaffirmed our fiscal 2023 earnings per share guidance in the range of $5.90 to $6.10. Residential customer growth and increased industrial load increased operating income by an additional $5.5 million, and we saw a $5 million increase in APTâ\u0080\u0099s  system business due to water spreads driven by maintenance and some of the key takeaway pipelines in the Permian during the quarter. During the quarter, we completed over $1 billion of long term debt and equity financing, highlighted by the $800 million long term debt financing we completed in October 2022 and $200 million of settled equity forward agreements. As of December 31st, we have approximately $755 million of net proceeds available under existing forward sales arrangements that will fully satisfy our anticipated fiscal '23 equity needs and a significant portion of our anticipated fiscal '24 needs. Finally to mitigate interest rate risk associated with our anticipated long term debt financing needs beyond fiscal '23, we currently have about $1.35 billion in forward starting interest rate swaps to effectively set a portion of treasury component of our total cost of financing at rates ranging from 1.8% to 2.2%. All of this gives us a clear line of sight into our anticipated financing costs of fiscal '23 and a portion of our costs beyond fiscal '23 Our equity capitalization as of December 31st, excluding the $2.2 billion of winter storm financing was 60%. In Kansas, we received our financing order from the Kansas Corporation Commission in October 2022, and we are progressing well to securitize the approximately $90 million in gas and other costs incurred during winter storm Uri. The execution of our operational, financial and regulatory plans in the first fiscal quarter positions us well to achieve our fiscal '23 earnings per share guidance in the range of $5.90 to $6.10."
}