{
    "symbol": "BAC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-13 13:50:25",
    "content": " We added $20 billion of loans in this business since Q4 of â\u0080\u009821, growing 10% and marking the 51st consecutive quarter of average loan growth in the business despite securities-based lending reductions related to the current market environment. And you can see the business earned $2.5 billion in the fourth quarter on record revenues of $6.4 billion, pretty remarkable given the decline in investment banking fees during this year. Well, I mean, I canâ\u0080\u0099t say definitively, but youâ\u0080\u0099ve seen -- thatâ\u0080\u0099s what we showed you on those pages where we show the stable -- the account balances are relatively stable in wealth management in the fourth quarter, $300-odd billion -- $300-odd billion. But, the big shift in that was, frankly, in the second quarter of â\u0080\u009822 when I think we had $50 billion-odd numbers of tax payments, which was lot higher than in past years due to -- if you think about the â\u0080\u009821 dynamic and capital gains and other things that went through. You picked up it going to the point -- we will have growth in NII year-over-year in the range you talked about, if you take the $14.4 billion, as Alistair said, we expect it to sort of be less variability and annualize that, compare that to â\u0080\u009822 of 9% as you said. And so, I -- we just feel good about the overall franchise, more customers, more of each customer, and then that provides a big stable base, which is rate increases slow down, the marginal impact of it will slow down until we see the good core loan and deposit growth, which you saw after rate -- the last rate rising increase stopped and produced the 20 quarters of operating leverage or -- and things like that. Whatâ\u0080\u0099s different this time, frankly, and thatâ\u0080\u0099s what weâ\u0080\u0099re talking about the consumer data is even with a strong rise in interest rates, you have a less tight labor market, and inflation and what people are being told to worry about, youâ\u0080\u0099re actually seeing consumer spending consistent with a good 2% growth environment, a low inflation environment, which is good because the consumer is being appropriately conservative right now."
}