{
    "symbol": "BAC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-18 10:24:04",
    "content": " We produced good returns again this quarter with an ROTCE of nearly 16%, and we delivered $4.4 billion of capital back to shareholders, driving average shares lower by 6% year-over-year. Looking at linked-quarter growth from Q4 and combining Consumer and Wealth Management customer balances, our retail deposits grew $53 billion in just the past 90 days. So assuming rising rates as reflected in today's forward curve and if we see continued loans growth, I would just reiterate what we said last quarter that we expect to see robust NII growth in 2022 compared to 2021. I do, however, want to provide a near-term expectation and say that if loans grow and rates in the forward curve materialize, we would expect to see NII in Q2 increase by more than $650 million over the Q1 level and then grow again significantly on a sequential basis in each of the following two quarters. Wealth Management produced strong results earning $1.1 billion, and that represented 28% year-over-year growth, driven by strong revenue improvement, good expense management and low credit costs. Not only did we see strong investment flows of more than $70 billion, but deposits grew $59 billion, up 18%, and we added $22 billion in loans over the same period, marking our 48th consecutive quarter of average loans growth in the business, just consistent and sustained performance from the team. While the company's overall investment banking fees of $1.5 billion declined 35% year-over-year, we gained market share in some important areas and recorded a number three ranking in overall fees. Provision expense reflected a reserve build of $177 million compared to a $1.2 billion release in the year-ago period, and this quarter's provision includes reserves taken for Russia exposure and other considerations for loans growth, offset by continued improvement in asset quality metrics. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Obviously, we always have such a huge Wealth Management business, which 27% pre-tax margin which is industry-leading, it was up 30% last quarter, will impact that because it's a bigger part of our business than others, but you'll see relentless progress, but I can't give the exact quarter. Your line is open. Your line is open. We're always hoping to get a better sense of given that RWA growth has actually been the biggest source of capital consumption over the last couple of quarters, it's up about 9% year-on-year. Your line is open. Your line is open. Your line is open. It's as we do all the work we do in the core franchise to grow the number of customers, 10% or 15% since pre-pandemic, and core consumer checking customers, to grow the commercial customer base, small business base, et cetera, that results in us having a balance sheet that is positioned to benefit in rising rates because we have so much zero cost deposits. Your line is open. And so when you look at that $1.4 billion of growth, and now we're telling you, you should expect NII growth from here successively in each quarter, that's what protects us."
}