{
    "symbol": "BAC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-17 14:59:05",
    "content": " Let's move to the balance sheet and we'll look at Slide 7, where you can see during the quarter, the balance sheet declined $38 billion to $3.07 trillion. Focusing on more near-term growth versus the second quarter of '22, our average total loans grew 8% on an annualized basis, led by 12% annualized commercial loan growth and 21% annualized credit card growth, while other consumer loans were relatively flat linked quarter. Focusing on FTE, net interest income increased $2.7 billion from Q3 '21 or 24%, and that's driven by benefits from higher interest rates, including lower premium amortization and from loan growth. Year-over-year now, average short-term interest rates have increased 200-plus basis points, driving up the interest earned on our variable rate assets while we've maintained discipline on our deposit pricing, and that has driven nearly $1 billion of improvement. And Brian shared earlier, we've got organic growth across the checking accounts, the card accounts and investments picking up this quarter, not necessarily because of anything we're doing differently in the past 90 days, but as a result of many years of retooling and continuously investing in the business. We added $24 billion of loans since Q3 of '21, growing 12% and this marked our 50th consecutive quarter of average loans growth in the business, consistent and sustained performance. On Slide 17, you'll see our Global Banking results, where we earned $2 billion in Q3 on strong revenue growth as higher NII more than offset lower noninterest income. While the company's overall investment banking fees declined $1 billion year-over-year in a continued tough market, investment banking fees did improve modestly from Q2 and the teams did a nice job of holding on to our number three ranking in overall fees in a tough environment. And so we don't -- I think if you think about just this year's third quarter '22 versus third quarter '21, if you take out the litigation, there's about $600 million increase in expenses year-over-year, $100 million of that is marketing. But interesting enough, what's driving the near-term growth in employees has -- there's obviously financial advisor growth, you saw the $400 million this quarter that's investing in the training programs and hiring some people into the office, especially outside our footprint to get them grow. The simple way to think about it is I think we're -- the trough the P&L provision cost with flat reserve build pre-pandemic was basically $1 billion a quarter, we're running around that number now."
}