{
    "symbol": "BAC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-18 12:11:04",
    "content": " This gain is illustrated by the increase in pretax pre-provision income, which includes these 2 -- which would exclude those 2 impacts, and that was $7.4 billion this quarter, improving 15% in PPNR improvement from the second quarter of 2021. Across our entire Wealth platform, Merrill, the Private Bank; and our consumer investments team, Merrill Edge, client balances, including deposit investments and loans, totals $3.8 trillion at 6/ 30/2022, aided by nearly $150 billion of client inflows over the last year into those businesses. Second, rates also drove a $2 billion decline in AOCI from derivatives that does not impact CET1, and that reflects cash flow hedges mostly put in place last year against some of our variable rate loans, and that provided some NII growth and also protected CET1 at the same time. We have $172 billion of CET1 and a 10.5% CET1 ratio, which increased from the first quarter and remains well above our second quarter 9.5% minimum requirement. And as we've done in the past, in the appendix on Slide 32, we've provided that daily ending loan chart that shows trends through the quarter, and you can see both commercial and consumer loans balances are now back to pre-pandemic periods with really only credit cards still remaining 15% to 20% below that period. Within the consumer balances, I'd just like to point out that small business deposits of $177 billion grew 14% year-over-year, and that reflects continued reopening of small businesses across America and the consumer spending supporting their growth. Focusing on FTE, NII increased $2.2 billion from the second quarter of last year or 21%, and that's driven by benefits from higher interest rates, including lower premium amortization and loans growth. Our expenses were $15.3 billion, up a couple of hundred million or 1.5% from the year-ago period and down modestly compared to the first quarter. We added $25 billion of loans over the last year, growing 13% and marking 49 consecutive quarters of loans growth in the business, and that is consistent and sustained performance. You'll see the business earned $1.5 billion in the second quarter, down $918 million year-over-year and driven the absence of a large prior period reserve release and lower investment banking revenue. And while we acknowledge that's a big drop, we just want to remind you that before the pandemic, our quarterly average for investment banking fees was in the range of $1.3 billion to $1.5 billion compared to the $1.1 billion we put up in the second quarter. I mean as much as it's a strong projection going forward, we captured like $2 billion last year second quarter, this year second quarter. And as I'm just thinking about the rate sensitivity and the forward curve in your comments about loans and deposits and deposit repricing, obviously, you're alluding to $13.5 billion by third quarter."
}