{
    "symbol": "PLAB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-25 11:07:02",
    "content": " As use of semiconductors continues to proliferate and demand growth continues beyond the capacity to supply it, it creates a change in pricing environment primarily in trailing edge masks but also in the high end business that is helping us to further expand margins, which I’ll discuss in more detail later. As Frank said, we’re on track to deliver the best year in the company’s history with strong end market demand, strategic capacity expansions, higher profitability, and a strong balance sheet to support further growth initiatives. I call it the business environment, but it provides us a lot of opportunity for pricing that we haven’t--we’ve never had before, and we’ve got--as Frank mentioned, we have long term purchase agreements with many customers, some of which we’ve kind of renegotiated, and there were others coming up for renewal, some are one year, some are longer than one year, and as they come up for renewal, the prices--you know, the opportunity is still there to continue the price increases. But we’ve also had opportunity to increase our high end pricing as well for similar reasons and because of our technology leadership, so without talking about specific amounts or percentages, the environment is there and we’re able to take advantage of it, and we expect it to continue going forward. Our photo mask equipment delivery time has become very, very long, so the demand increased a lot, however on the supply side it will take time to provide some capacity to the customer, to the market, so we believe the price increase, there’s a very high possibility it will continue into next year. Okay, so our guidance for next quarter, and one can assume--we don’t give full year guidance, so we’ll have to draw an assumption about fourth quarter, and into next year is based on the additions to capacity that we’ve already incorporated into our capex budget for this year, so as those tools, those new tools come online, we’ve incorporated the revenue, the incremental revenue from those tools into our guidance expectation and into our target model. I might want to point out that I mentioned it my comments, but our long term target model is based only on the capex that’s in this year’s budget, and some of which will be delivered in next year, but there is no additional capex that we would plan for next year in addition to what’s already ordered from this year or 2024, so one can expect the capacity to increase for those capex additions, but again those are not incorporated into our target model. Yes, the price increase actually started last year in the mainstream market; however, the capacity shortage situation started to migrate into high end IC area also, so in this year, we started negotiations with a key high end IC customer and the new price started to become effective at the beginning of Q2."
}