{
    "symbol": "PLAB",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-13 11:40:01",
    "content": " I would now like to hand the conference over to your host, Richelle Burr, Executive Vice President, Chief Administrative Officer and General Counsel. It remains clear that our broad technology portfolio, operation effects and close customer relationships have met us the market leader. Q4 revenue was less than third quarter revenue, with demand slowing in high-end large lastly. However, we believe that factor causing this slower demand with the transit, and we maintain our positive view on the long-term demand trend. Factors such as high interest rates, rising inflation and slowing GDP are already having a negative impact on some sectors of the electronic product supply chain and could potentially impact photomask demand. Moreover, adding to uncertainties is that U.S. government's new export restriction imports from China on certain semiconductor technologies that may further impact the Chinese IC industry. So far, these actions have had minimal impact on Photronics' business or operations. At the same time, we will ensure our compliance with all regulations while taking necessary actions to mitigate the impact on our supply chain and business. Although the near term deal is uncertain, we are confident that IC design and manufacture continue to play a central and expanding role in the global economy. Our customer relationships are beyond trust, supported by our technology, service, quality and global production capacity. We have invested in tool sets for a broad array of technologies and nodes, enabling us to support our customers' technology road map across both high-end and mainstream. As a result, fourth quarter revenue of $210 million was down only 4% sequentially despite the declines in high-end product revenue. Our conversion teams have done a great job of working with customers to identify opportunities, and our operations teams were effective in supporting this demand with on-time execution, delivering the highest quality products that enable our customers' success. Midstream revenue improved on continued strong demand, especially in Asia. Based on our outlook and the continued focus on cost reductions, we expect to continue to deliver margin improvement as our revenue moves into the targeted zones with price increases holding stable in 2023, while the outlook for continuation of premiums may be the certain. Operating expenses decreased compared with the third quarter as we balance the need to maintain margins while also investing in  resources to support revenue growth, positioning us to continue to grow both revenue and profit. Diluted EPS for Q4 was $0.60, an 18% increase over Q3 and 82% increase over the $0.33 of last year's fourth quarter. Diluted EPS for the whole year of 2022 was $1.94, an increase of 118% over 2021, demonstrating the achievement of the entire Photronics' team during a challenging and changing year. Full year CapEx was $109 million, net of nearly $4 million in government subsidies. For 2023, regional CapEx to be approximately $130 million as we continue to invest in growth, primarily for high-end and mainstream IC capacity. We also continued to reduce debt during the quarter, bringing total year-end total long-term debt to $42 million, a reduction of $69 million since last year-end. If we improve short-term investments of $39 million, net cash and short-term investments at the end of the quarter was $316 million. Our balance sheet is strong and flexible, and we're able to pursue growth investments, both organic and inorganic also being prepared to weather potential future economic challenges and uncertainty. Before I provide guidance, I'll remind you that our visibility is always limited as our backlog is typically only one to three weeks and demand for some of our products is inherently uneven and difficult to predict. And as this segment of the business grows a relatively low number, high-end orders can have a significant impact on our quarterly revenue and earnings. Given those caveats, we expect first quarter revenue to be in the range of $203 million to $213 million as we expect positive demand trends with less than typical seasonality. Based on those revenue expectations and our current operating model, we estimate earnings per share for the first quarter to be in the range of $0.40 to $0.48 per diluted share. We grew revenues 24% posting our fifth consecutive year of record revenue, expanded margins, which places us into the bottom end of the range in our target model and strengthened our balance sheet, generating cash, reducing debt and investment in growth. Looking forward, we believe positive long-term market trends and our leadership position together with financial flexibility positions us to continue our profitable growth and achieve even greater success for our customers, our employees and our shareholders. Your line is open. So first, so it seems like you have a pretty good gross margin for the quarter. The pricing environment has been very good, so our pricing is stronger than it has been historically. We've seen even as demand is still strong, but not quite what it has been. The pricing holds up, we have pricing agreements across the Board in Asia, they've held, as I mentioned, as demand is not quite as strong. Those premiums are less predictable, but through the fourth quarter, both pricing and premiums have held up. So a combination of change in mix with some of our operations taking up business and improving their margins and with sustained pricing strength, we think we will stay within the margin ranges that we've been experiencing. And then next question, just I know you mentioned the recent impact from China, the restriction that minimized our business. So those restrictions to some extent, have affected us, but we've been able to essentially figure them all to understand and work with them. So, the restrictions have affected us very over the past three years since they started imposing them. I think that if they stay in the leading-edge technologies, we're going to remain unaffected but we spend a lot of effort to understand the restrictions as they're imposed and to make sure that we reach today with them a lot. And as restrictions continue to get issued, we'll continue to assess how they affect our business and work within new restrictions. Hopefully, we'll continue to experience the same minimum effect that we had because they're directly primarily at leading-edge technologies where we're not engaged. I might add one thing to that on the -- if there is a positive side to this since the leading edge has been kind of restricted in China, a lot of that capacity can deploy to midrange and mainstream. So -- and those are sweet spot nodes for us, particularly how we're tooled up there. But fortunately, that's kind of a positive knockout effect for our local business. Your line is open. Basically, we don't see a major change in the business model,  since their spin-off they have made major capital investment even announced some projects in Texas, but nothing materialized. So at this moment, from customer side, from our side, we haven't seen a real difference. Actually, in the past 15 months, the equipment data in photomask is also very long, same as in semiconductor business. So the tools are coming in is, main progress of this tool is to serve the mainstream business expansion and also we don't have some tools which are going to the end of life. However, the tool to be repressed our old tool, so the new tool has a better performance, higher throughput. So, we expect not only just a replacement, we will see some new capacity added to our overall production capacity. Can you put that in context of lead times, lead times have stretched quite a bit from days to, I think, weeks or months. The soften demand actually stated two, three months ago, particularly in the high-end side. But of course, this time to customer has been reduced because the VAT level is lower. However, there are certain signs -- the demand for the high-end is coming back. At this moment, we -- it's a little bit too early to be very precise in terms of green recovery. But from our input from sales and customer, we do see the high-end level start to come back."
}