{
    "symbol": "MTZ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 15:01:04",
    "content": " Going forward, as we think about our C&I segment, our Renewable and Civil business, coupled with the expected acquisition of IEA and the improvements in both projects and contract structures going forward in the industrial market, gives us great confidence in being able to achieve the performance in our Clean Energy and Infrastructure segment, that we previously discussed and hope that our target of $5 billion in revenue for 2023 at mid to high single-digit EBITDA margins, proves to be conservative in light of the new potential energy legislation. In our Power Delivery segment, revenue was $647 million and our performance was driven by both INTREN and Henkels & McCoy, who exceeded internal expectations, that was somewhat offset by legacy MasTec business, which was down about $50 million in revenues in the quarter, due to project and material delays impacting our absorption of costs. In our Oil and Gas segment, margins were better than expected at 18.8% of EBITDA, despite revenues being down from $621 million in the second quarter of 2021 to $341 million this year. Revenue for the year is expected to be down over $1 billion from 2021, but we're excited to announce that post quarter end, we signed our largest pipeline contract in over three years, a 300-mile 42-inch pipeline that starts construction in 2023. Second quarter revenue grew approximately $300 million, a 17% year-over-year increase comprised of approximately $600 million in revenue growth in our non-oil and gas segments, namely our communications, power delivery, and clean energy and infrastructure or clean energy segments. To put the significance of this shift in perspective, full year 2022, we expect to generate slightly over $8 million of revenue from our non-oil and gas segments representing almost 90% of our annual $9.2 billion revenue estimate. Second quarter Communications revenue was $822 million, a 30% increase when compared to the same period last year and, a 24% sequential increase when compared to the first quarter reflecting expanded wireless/wireline services, as telecommunications partners begin to accelerate the deployment of spectrum and fiber for transformational 5G network enhancement. We expect second half 2022 revenue levels to accelerate, from first half levels and approximate $1.7 billion, with third quarter revenue approaching $900 million. Second quarter Communications segment adjusted EBITDA margin rate was 10.4%, a 420 basis point improvement over first quarter levels, primarily due to overhead leverage from increased revenue levels, coupled with sequentially lower levels of new RDOF wireline market start-up costs. That said, second quarter Communications segment adjusted EBITDA margin rate was still impacted by some new RDOF market start-up costs, as well as inflationary cost pressures on labor, fuel and materials. We expect second half 2022 adjusted EBITDA margin rate will range between 11.5% to 12% of revenue, with this improvement due to additional overhead leverage from higher second half revenue levels and the elimination of new RDOF market start-up costs, as operations ramp. Our annual 2022 Communications segment revenue expectation continues, at approximately $3.2 billion, a 25-plus percent annual growth rate with annual 2022 adjusted EBITDA margin rate in the low to mid-10% range. Second quarter Clean Energy segment revenue was $494 million, a 3% increase when compared to the same period last year. As Jose already discussed, our second quarter Clean Energy segment adjusted EBITDA was negatively impacted by lower overhead absorption, due to solar renewable power generation revenue disruptions, inflationary cost pressures on existing projects and the impact of two select industrial projects where we incurred project losses, as we move towards project closeout. As we look forward, we expect second half Clean Energy segment revenue levels to accelerate from first half levels and approximate $1.2 billion. We expect second half Clean Energy segment adjusted EBITDA margin rate, will improve and approximate 6% to 6.5% with fourth quarter adjusted EBITDA margin rate slightly higher, than third quarter levels. This equates to annual 2022 Clean Energy segment revenue expectation, of approximately $2.1 billion, a 13-plus percent year-over-year growth rate and adjusted annual EBITDA margin rate approximating 4%. Second quarter Power Delivery segment revenue, was $647 million and adjusted EBITDA margin rate was 7.5%. Within the Power Delivery segment, our electrical and gas distribution services, including the operations of INTREN and Henkels & McCoy, performed well, while our legacy transmission operation underperformed our expectation due to project start-up delays with this activity pushing to the third quarter and a $5 million project closeout charge. Looking forward, we expect second half Power Delivery segment revenue will approximate $1.4 billion, with second half adjusted EBITDA margin rate approximating 9.5%. While we expected lower levels of revenue during the quarter, second quarter adjusted EBITDA margin rate exceeded our expectation, primarily due to project efficiencies and closeouts during the quarter. As we look forward, we expect second half Oil and Gas segment revenue will approximate $750 million, with adjusted EBITDA margin rate approaching 13%. While our annual 2022 Oil and Gas segment expectation reflects a significant decline when compared to 2021, as Jose mentioned, we expect increased levels of revenue and adjusted EBITDA in 2023, as we are seeing increased demand and bidding activity. Importantly, this represented record second quarter backlog levels across Communications, Clean Energy and Power Delivery segments, demonstrating the end market revenue shift that is occurring within our operations. During the second quarter, the combination of working capital associated with $300 million in sequential revenue growth, coupled with the acceleration of our 2022 capital expenditures inventory and material purchases to address supply chain and inflationary concerns led to a temporary increase in our net debt of approximately $400 million to $2.1 billion. For the third quarter we expect revenue of $2.55 billion, with adjusted EBITDA of $245 million or 9.6% of revenue and adjusted diluted earnings per share of $1.29."
}