{
    "symbol": "SAP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 12:00:05",
    "content": " This leads to a powerful flywheel effect from the SAP Business Technology Platform, which now has a run rate exceeding â\u0082¬1.5 billion, contributing to overall past cloud revenue growth of 44% in Q3. But for both elements we see actually, of course, for the cloud a much better pipeline, but with that, Scott, maybe you can also share some more details around how is the pipeline looking in both businesses actually for the quarter. But of course when we see wide spots where customers are telling us this is high value, this should come integrated and in a very strong way, it should come out of the blocks with SAP also leading on the go-to-market, I would never rule out also the acquisition, but the good piece is also there's not an urgent need now to buy revenue. What we are focused on is continuing to drive a very healthy, high renewal, low-churn recurring revenue business with support revenues, which are very resilient with cloud which has been very resilient with the services business that is doing very well has actually increased its margins year-over-year, despite the fact that it's probably already the highest margin services business that you can find in our industry, so we will continue to be focused on that. So first S/4HANA in the cloud, extremely high retention rates and you are not shifting around ERPs, it's a very sticky business, especially then when you are building side-by-side new extensions on the platform, it becomes also an extremely sticky business together with the business technology platform. So in addition to what we're seeing in terms of the overall sentiment that Christian described, we're also seeing many large customers with multiple public and private deployments as they look at scaling their business they've got â\u0080\u0093 they've got assets around the world and companies that they want the agility and the flexibility of the public cloud."
}