{
    "symbol": "SPNE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 23:23:24",
    "content": " The tremendous momentum combined with our innovative product offerings in orthobiologics, spinal implants and enabling technologies continue to attract larger more exclusive distributors and fuel our growth as we finish 2022 and look forward to consummating our planned merger with Orthofix, which we expect to close early next year. In the U.S., where we generate approximately 90% of our total revenue, we saw revenue increase 24%, reaching $51.1 million, and international revenue grew 207% to $16 million, largely as a result of the spinal implants stocking orders, we shipped to our European distribution partners ahead of our planned exit from the spinal implants market there. The combined distribution network will have access to greater than $200 million base of complementary revenue with immediate pull-through opportunity via the motion preservation, 7D enabling technologies and bone growth therapies portfolios. The decrease in GAAP and adjusted gross margin was primarily due to the lower gross margin associated with the $10 million increase in spinal implants revenue to European distributors in the third quarter of 2022 compared to the prior year period, which was partially offset by lower excess and obsolete inventory charges. It's obviously driven by U.S. revenue with 90% of our revenue coming in the U.S. and spinal implants and orthobiologics are both coming off great quarters, and we're getting deepening penetration with the capital sales team from 7D. And really, it's just continuing to see the benefits of those larger transformative distributors we brought on board, most meaningfully in the past year or even six months, and we've got a pipeline of additional distributors we want to bring in that exclusive capacity and think we'll be able to capitalize on some of those opportunities in the fourth quarter. So we're not going to give color on the different capital sales opportunities or results, but we're going to instead stay focused on talking about units, because the more units we're placing in the field, whether it's capital sale or earn-out, we're seeing the uptick in spinal implants revenue. So I think the merger only increases the opportunity of what we've been able to take advantage of an earn-outs and capital sales and drive pull-through whether it's contractual revenue pull-through on an earn-out with a broader revenue base to now include motion preservation in addition to our spinal implants and biologics, but also the non-contractual pull-through that we're seeing when a unit is placed in an account."
}