{
    "symbol": "SPNE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 23:28:04",
    "content": " In the second quarter, we grew total revenue 19% over the prior year period to $56.3 million. We generated $2.2 million of enabling technology revenue in the second quarter of 2022, with the placement of six units all via capital sale, and further increased our pipeline for earn-out opportunities in the US to the highest levels we've seen so far. As Keith noted earlier, total revenue for the second quarter of 2022 was $56.3 million, a 19% increase over the prior year. US spinal implant and enabling technologies revenue in the second quarter increased 17% to $25 million, with the 7D FLASH Navigation platform contributing $1.1 million of revenue. International revenue in the second quarter of 2022 totaled $6.8 million, a 39% increase compared to the prior year and included $1.1 million of enabling technologies capital sales revenue. The increase in operating expenses was driven primarily by $7.6 million in higher selling and marketing expenses, the substantial majority of which related to the 7D Surgical sales and marketing organization and increased commissions on higher sales; $800,000 in higher research and development expenses, which was entirely attributable to 7D Surgical, and $2.2 million in higher general and administrative expenses, which was attributable to higher headcount-related expenses, and an increase in information technology costs associated with the implementation of a new inventory management system earlier this year. As Keith noted earlier, we now expect full-year 2022 revenue to be in the range of USD234 million to USD236 million, which includes USD10.5 million to USD11 million of total anticipated revenue based on current FX rates from the final European spinal implants stocking orders and for US spinal implants growth to exceed 20%. Moving down the P&L and notwithstanding the temporary impact on the third quarter of the relatively low gross margin European final stocking orders, we still anticipate generating 150 basis points to 200 basis points of adjusted gross margin expansion for the full-year 2022 compared to the 63.5% we reported for 2021 and to reduce our adjusted EBITDA loss by 15% to 20% compared to the $22.9 million we reported in 2021. So, we will see a dip in the third quarter gross margin solely because of the impact of that low gross margin final stocking orders, and then we expect it to pick back up in the fourth quarter when we don't have that low gross margin burden from European spinal implants revenue. Kyle Rose, your line is open. And the $2 million of annualized commitments we have, the units we've got in the pipeline that we expect to go to an earn-out in the third quarter and the fourth quarter is kind of what gives us the confidence to say we expect spinal implants revenue growth in the US to be above 20% for the year because, one, we're taking market share, right? Those are getting deployed now and should have a meaningful impact on revenue in the second half of the year, because they kind of -- tie that in with the distributors we are onboarding, in a lot of cases, those distributors are not going to utilize the sets we park in their territory very efficiently for the first month or two as they're ramping up. $10 million more to go to support further product launches like the rest of the WaveForm footprint, but that's going to generate revenue growth in the first half of next year because a lot of those sets will get deployed in the back half of this year and be in a position to be utilized much more efficiently next year and move the needle for revenue. Kyle Rose, your line is open. But I think we're past the greatest point of risk as it relates to new product launches, and we continue to see efficiencies slow but steady at the Irvine manufacturing facility and with volumes going up and being able to grow our orthobiologics revenue more than 10%, 15%, 16% this quarter. A lot of what we spent in the first half of the year, $30 million of that $40 million investment was to support full commercial launches and also some additional sets we're deploying."
}