{
    "symbol": "GEF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-06-09 11:11:04",
    "content": " Finally, second quarter adjusted free cash flow was roughly 12 million lower year-over-year, primarily due to the continued impact of inflation on working capital as well as strategic stocking of inventory in certain markets most affected by supply chain constraints. Your line is open. Your line is open. Your line is open. Yeah, I mean, you know, you look at on the GIP side and obviously maintaining the margin that we had last year and overcoming the loss of that $100 million tailwind, is it pretty substantial accomplishment on behalf of our teams, and we are expecting to relatively maintain and that's combination of the investments we made in some expansion of our IBC and Plastics business and then the rest of it is really just working very diligently on these other price increases. Your line is open. I mean, frankly, you look at our cash production for the rest of the year where we'll be on debt paydown, we could do some type of pretty substantial return to capital to shareholders and still not have that risk even with a pretty significant downturn, but we'll go through that analysis before we would do anything down at Q1   to get the cash production for the rest of the year to pay down that debt further and I mean our EBITDA would have to come down pretty  put us back above   even if we did do something substantial in return to shareholders. Your line is open. Your line is open. coming at us and we explained then, you know, you have to be a buyer when somebody is a seller and we're very pleased with what we've been able to accomplish with Caraustar and we told everybody at the time that we had analyzed the downside in the recessionary analysis and that even if we saw one, that it would maybe only push back our – getting back to our target debt ratio by half a year. Your line is open. The midpoint of your guidance implies, I think a $140 million increase for the full-year, compared to the $20 million decline in the first half, so, obviously expecting a pretty big jump in cash flow in the second half relative to a year ago, even with all these, the inflation, the inventory issues, etcetera, the higher cash taxes."
}