{
    "symbol": "GEF",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-08 10:39:01",
    "content": " The combination of these factors, along with unanticipated currency impacts resulted in a year-over-year decrease in adjusted EBITDA for the fourth quarter of approximately $25 million or $17 million, excluding the $8 million contribution from our divested FPS business in Q4 '21. Despite a lower fourth quarter, our GIP team again put up record adjusted EBITDA performance for the full fiscal 2022 on a very difficult 2021 compare and I'm proud of the team and their contribution to Greif's results this year. Despite declining demand and continued raw material cost inflation, favorable price cost led to an approximately $33 million increase in adjusted EBITDA in our PPS business, capping off a strong year of record operating performance for this business. While our above the line results came on the lower side of our expectations due to demand deterioration, it was that plus the combination of higher other expense from $4 million of negative currency impacts and higher than anticipated tax expense resulting from an unfavorable mix of jurisdictional income and tax return examination adjustments that drove our earnings per share below the low end of our range. We closed out 2022 having crushed the midpoints of our original 2022 commitments made at our Investor Day in June of 2019 by nearly $60 million on EBITDA and over $75 million on free cash flow of the commitments we made at our Investor Day was that we would achieve gross profit margins over 20%, SG&A below 10% and operating profit above 10%. With that context provided for fiscal 2023, we anticipate generating between $820 million and $906 million of adjusted EBITDA and between $410 million and $460 million of adjusted free cash flow for the full year, which includes the impact of higher planned CapEx. Your line is now open. So I know that's not all that helpful in terms of a midpoint analysis, but if I give you a little bit, I would say from an operation standpoint, we think the high end of things is a potential decrease of $12 million from this year's overall EBITDA to a potential decrease of $98 million on EBITDA across all of the operational factors. Your line is now open. And I go back and it's interesting, if I look across all of our analyst group a year ago, today, the consensus among everybody for EBITDA across the group was $807 million for '23. Your line is now open. Your line is now open. Your line is now open. I assume you think it's higher than what it used to be pre-pandemic of around $300 million a year, but I also assume you don't think it's $450 million either given the onetime benefits during the pandemic."
}