{
    "symbol": "SNDX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-03 15:44:05",
    "content": " On Revumenib, we made significant progress, enrolling patients in the AUGMENT-101 pivotal trials announced breakthrough therapy designation for patients with relapsed/refractory KMT2A rearranged acute leukemia and presented robust updated Phase I data that further supported Revumenib's best-in-class clinical profile in two oral sessions at the 2022 American Society of Hematology Annual Meeting. Starting with Revumenib, our highly selective Menin inhibitor, our pivotal Phase II AUGMENT-101 trial evaluating Revumenib in patients with relapsed/refractory NPM1 mutant or KMT2A rearranged acute leukemia is progressing well. These include initial top line data from AUGMENT-102 chemo combination trial in relapsed/refractory acute leukemia patients, safety data from the dose escalation phase of the BAML cooperative trial of Revumenib in combination with venetoclax/azacytidine, in newly diagnosed AML patients and initial top line data from the first solid tumor proof of concept trial in metastatic colorectal cancer. We remain on track to report top line data in mid-2023 from the pivotal Phase II AGAVE-201 trial, evaluating axatilumab in patients with chronic graft versus host disease or cGVHD, and plan to submit a BLA filing by the end of 2023. To maximize the value of the axatilimab program, we anticipate initiating additional trials in 2023, including a combination of axatilimab and ruxolitinib in frontline cGVHD that we expect Incyte to be in later this year as well as a Phase II trial of axatilimab in idiopathic pulmonary fibrosis, or IPF, that we anticipate kicking off in the first half of 2023. Thus, in collaboration with Incyte, we are enthusiastic about expanding the axatilimab program into frontline cGVHD in combination with ruxolitinib, and we expect a Phase I combination trial in patients with newly diagnosed cGVHD to begin later in 2023. Thanks for the question, Phil. Thanks for the question, Phil. And so that's the -- as Briggs pointed out, that's the reason why I think we're so excited about being able to combine it in the frontline setting and potentially reduce the use of steroids, which could really expand the use of this drug beyond what Rezurock has even shown in relapsed/refractory in the first year."
}