{
    "symbol": "GPMT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 18:59:03",
    "content": " Despite the market volatility, during the third quarter, we realized over $340 million of loan repayments. Additionally, so far in the fourth quarter, we have realized about $150 million of repayments, of which about 80% were office loans. During the third quarter, we closed on a new $100 million non-mark-to-market loan financing facility, further expanding our funding capacity for a wider range of assets while enhancing our liquidity management. We ended the third quarter with an aggregate committed balance of $3.9 billion and a principal balance of about $3.6 billion, including $313 million of future funding commitments, which accounts for less than 10% of our total commitments. Given our cautious stance due to the market environment, during the third quarter, we closed one new multifamily loans with a total commitment of $45 million and funded about $70 million of total loan principle, which included approximately $28 million on existing commitments. Despite the decline in commercial real estate transaction activity, our repayments and loan paydowns totaled approximately $347 million in the third quarter, which outpaced loan fundings and resulted in a $270 million decline in our portfolio balance over the quarter. During the quarter, we moved two of our office loans with total UPB of $123 million to a risk rating of 5, place them on nonaccrual status and established a $20 million CECL reserve for these two loans. As of September 30, we had four loans with risk ratings of 5, totaling $330 million in principal and CECL reserves of about $50 million. Our Q3 book value declined by about $0.77 per share to $15.24 and was mainly affected by the increase in CECL reserves, which at quarter end totaled $85.6 million or $1.63 per common share and represented about 218 basis points of our total loan commitments. Away from the credit reserve build, our third quarter results were also affected by a $3.6 million or $0.07 per basic share decline in net interest income, driven by two factors: one, our nonaccrual loans; and two, loans with high-rate floors that did not benefit from a full quarter of higher interest rates. At quarter end, the aggregate allowance allocated to these loans totaled about $50 million. To that point, during the third quarter, we closed on a new $100 million facility, providing us loan level financing on a non-mark-to-market basis, allowing for additional funding flexibility within our capital structure. It was $50 million at the end of the quarter of those four loans and one was resolved in October, the retail loan."
}