{
    "symbol": "GPMT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 23:56:06",
    "content": " We believe that our recent accomplishments in pursuing these priorities have the ability to meaningfully offset the earnings impact of rising short-term interest rates in the near term, and also position us well for the second half of the year, as our portfolio loan yields are expected to increase if short-term rates continue to rise. In late March, we sold our $54 million non-accrual senior loan on an office property located in Washington DC, which allowed us to redeploy capital into earning assets and repay expensive debt. With a portion of the capital release from the refinancing transactions, we recently fully repaid the $100 million of borrowings remaining under our senior secured term loan facilities, achieving yet another of our stated strategic goals. During the quarter, our weighted average risk rating improved from 2.6 at December 31 to 2.5 at March 31, driven by new loan originations, the resolution of a 5-rated non-accrual loan, and the upgrading of nine loans, which includes about $100 million of loans changed from a risk rating category of 4 to 3 to reflect the improved credit profile of those investments. Our GAAP earnings include a previously disclosed $5.8 million or $0.11 per basic share charge on early extinguishment of debt related to the $50 million partial repayment of the term loan from February and provision for credit losses of $3.7 million or $0.07 per basic share, of which about $0.04 were related to the sale of our non-accrual loan. Distributable earnings for the first quarter were $2.6 million or $0.05 per basic share, which include a previously disclosed realized loss on the loan sale of $10.1 million or $0.19 per basic share. Our total allowance declined by about $6.4 million or $0.12 per share quarter-over-quarter, mainly due to a write-off on the loan sale, which was partially offset by an increase in our general reserve of about $1.6 million or $0.03 per share as we employed a more conservative macroeconomic forecast and some changes in our portfolio mix. And I would first like to say that we’re really pleased to be able to report today that of our recent accomplishments and that when they are fully reflected in our financial results in the coming quarters, we’ll meaningfully see benefit from our run rate profitability, and positions us well for the second half of the year as rates rise and as these results continue."
}