{
    "symbol": "GPMT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 14:01:01",
    "content": " During the second half of the year, we closed on two new credit facilities with an aggregate borrowing capacity of up to $300 million, which are designed to fund performing, subperforming and nonperforming loans on a non-mark-to-market basis. These and other actions allowed us to strengthen our balance sheet while also redeeming the $144 million of convertible notes that matured in December with cash on hand without needing to access the funds in the capital markets, which were quite difficult at the time. We ended the quarter with an aggregate committed balance of $3.6 billion, and a principal balance of about $3.4 billion, including $230 million of future funding commitments, which accounts for approximately 6% of our total commitments down from a high of over $750 million in Q1 2020 and reflective of the light transitional nature of our loans. During the fourth quarter, we funded about $109 million of total principal consisting of approximately $31 million on existing commitments and a $77 million acquisition financing related to the resolution of the Pasadena retail loan. Our repayments continued throughout the year with about $362 million of loan repayments, paydowns and one loan sale in the fourth quarter, with approximately 47% of that being office loans. The repayments outpaced loan fundings in the fourth quarter, which resulted in a roughly $250 million decline in our portfolio balance. During the quarter, we moved one of our office loans with a UPB of $32 million to a risk ranking of 5 and place it on nonaccrual status. With the addition of this 5-rated loan in the fourth quarter, and the resolution of the Pasadena retail loan, at 12/31, we have four loans totaling $247 million, with a risk rating of 5 and associated CECL reserves of about $39 million which were all secured by office properties. Apart from these 5-rated loans, our office portfolio is very granular with 28 loans across over 20 markets with an average size of about $34 million. Yesterday afternoon, we reported a fourth quarter GAAP net loss of $9.9 million or $0.19 per basic share, which includes a provision for credit losses of $16.5 million or $0.32 per share and a loss on a loan sale of $1.7 million or $0.03 per share related to an opportunistic sale of a $22 million mixed-use office and retail loan. Distributable loss for the fourth quarter was $8.2 million or $0.16 per basic share and includes a $15.5 million realized loss related to the resolution of our retail loan in Pasadena, which we previously disclosed. For the full year, we reported GAAP net loss of $55.3 million or $1.04 per basic share which was mainly driven by a provision for credit losses of $69.3 million or $1.32 per basic share and loss on early extinguishment of debt of $18.8 million or $0.36 per basic share related to our repayment of the term loan borrowings earlier in the year. Adjusted for the realized losses, our full year 2022 distributable earnings were $42 million or $0.79 per basic share. At quarter end, our CECL reserve totaled $86.6 million or $1.65 per common share and represented about 2.4% of our total loan commitments. Turning to our capitalization and liquidity, our fourth quarter total debt-to-equity ratio decreased to 2.3x from 2.6x at the end of Q3, mainly due to the repayment of our $144 million convertible notes, which matured in December, and continued repayments within our loan portfolio. During the quarter, we added a new $100 million secured credit facility, providing us with loan level financing on a non-mark-to-market basis and allowing for additional funding flexibility, especially with respect to nonperforming loans, giving us more optionality within our capital structure as we continue to actively manage our balance sheet during this highly uncertain market environment."
}