{
    "symbol": "ACCD",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-30 23:18:02",
    "content": " Your line is open. Your line is open. We think, and as I mentioned in the script, we think that what weâ\u0080\u0099re beginning to understand is that those customers are interested in managing health care costs and seem to be very interested in continuing to pursue advocacy, care and expert medical opinion evaluations. Your line is open. Your line is open. Now that win rate has been delivered with pricing thatâ\u0080\u0099s been very consistent and so as you look ahead, the market first and foremost is a market thatâ\u0080\u0099s looking for in a market, particularly in a downturn or a potential recession like weâ\u0080\u0099re seeing right now, customers are looking for reduced healthcare costs, and what we see in the RFPs that weâ\u0080\u0099re responding to today, and I mentioned it a bit in my prepared remarks Mike, that the RFPs are very specific about the clinical outcomes they want to prescribe about the needs that they are expecting to be filled by the vendors that they are asking â\u0080\u0093 we are asking to respond to their RFP. Your line is open. Number one, as Raj mentioned earlier, the new sales volume is very encouraging, continuing to see not only stand-alone expert medical opinion wins, weâ\u0080\u0099re seeing knockouts of competitors and weâ\u0080\u0099re also seeing bundled deals sell, which as you know, very importantly to our model is that we believe strongly very much a strategic thesis around both acquisitions, is that when we can leverage the advocacy base and the relationship with a member to get that member to their needs, whether it be an expert medical opinion, one of our ecosystem partners or a virtual primary care relationship, weâ\u0080\u0099re starting to see that flywheel turn and starting to see strong utilization there. Your line is open. Your line is open. Your line is open. Your line is open. Finally, I think this idea around land and expand goes beyond growing the advocacy offering from core up to our traditional offering and it also includes the idea that weâ\u0080\u0099re doing well, taking advocacy customers and adding expert medical opinion and care to our offerings or to their suite of capabilities from Accolade. Your line is open. Your line is open. Your line is open."
}