{
    "symbol": "ACCD",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-06 22:39:03",
    "content": " No other company in our category can point to integrated offerings in advocacy, expert medical opinion, and primary care and behavioral health, with third party validated savings across a variety of customers. One other note on the growth drivers in our Primary Care business, we've been able to drive this membership growth without seeing a material increase in customer acquisition costs, reflecting both the efficacy of our demand generation efforts, as well as what we see as the notable difference between our virtual primary care platform and traditional telehealth and standalone mental health offerings. And I think specifically, the data point, Iâ\u0080\u0099d call out that we that we talked to in our prepared remarks, is the idea that customers when buying advocacy are a majority of them today are buying not just advocacy, but also buying our primary care service and our expert medical opinion service, which indicates to us a validation of the personalized health care suite that we released last year. Again, going back to the point that we answered in Mike's question, one of the things we love is the diversification of the revenue streams and in the context of this answer, speaking to that across product line, we're signing customers with for primary care and behavioral health, extra medical opinion and for advocacy. That changes a bit now that we've got expert medical opinion customers, and advocacy customers who might go live or excuse me, care customers who might go live after January 1, given that they don't necessarily have to see the carve out from their plans that the advocacy business has traditionally been known for. The second part of your question in terms of perhaps extrapolating the question a bit, and speaking to our growth rate versus the growth rate of other players in the space, not knowing their businesses exceptionally well, what we can say is this, we are unique and differentiated because we're a primary care player with behavioral health embedded in that primary care different than the urgent care offerings that most of our competitors are talking to. First, when you look at advocacy, primary care and expert medical opinion, in expert medical opinion in primary care, because we drive such high utilization, we're quite happy whether a customer wants to pay us a PEPM basis or on a case rate or utilization basis. But you're right in terms of the splits of the business, that the advocacy portion of business runs in the range of low 60s percent of the total revenues, with the balance being made up of expert medical opinion, and virtual primary care. I think what we're seeing Cindy across the board is that customers are interested in the in all of the offerings, knowing that they need an Advocacy Foundation or a personalized healthcare platform foundation, by which we can drive not only utilization for primary care, behavioral health, and expert medical opinion, but also the rest of their digital healthcare solutions. In terms of annual recurring revenue contribution, I think it's fair to say that more than a plurality of those deals are coming from multi-platform deals where they're buying advocacy, expert medical opinion and care in aggregate. Increasingly, customers looking at those three themes that I've talked about in the past are looking and saying -- where perhaps in years past, they might be just buying digital point solutions for a particular carve-out categories are beginning to grasp perhaps more so this year than in years past that those things by themselves will not drive the trend line improvement that they might otherwise be seeking. What we're seeing this year, which we're really excited about is the preponderance of customers who are buying from us are buying our three core offerings, advocacy, expert medical opinion and virtual primary care and behavioral health at the first shop when they're contracting with us. What's great about what's happened over the last several years is not just that the channel has expanded in terms of number of partners, but that they are also now beginning to look at all of our solutions, not just expert medical opinion, not just advocacy, but also, as in the case of Priority Health, where we're actually seeing our virtual primary care and behavioral health solutions being used to power a virtual-first plan design for Priority Health."
}