{
    "symbol": "HUIZ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 00:10:21",
    "content": " During the quarter, we continued to make progress on implementing our strategic road map to build an omnichannel digital insurance service ecosystem that integrates agents, businesses and customers or ABC, and further refines our competitive age in customer insights, product innovation, and professional insurance services. In the third quarter, the total first year premiums or FYP facilitated on our platform increased by 34% year-over-year to RMB685 million, of which the FYP of savings products amounted to RMB509 million, a 49.3% year-over-year increase. Meanwhile, thanks to the snowball effect and the high user stickiness generated by our strategic focus on long-term insurance products, our renewal premiums increased by 24.1% year-over-year to RMB564 million, providing us with a valuable source of stable cash inflow in this challenging macro environment. As of the end of third quarter, we have cooperated with 106 insurer partners to co-develop a wide range of cost-effective and high-quality customer products to stimulate market demand in areas, including critical illness, medical, pension and accident insurance. The FYP facilitated by our 2A business increased by 53.3% sequentially to RMB65 million in the third quarter and reached a total of RMB120 million in the first 9 months, becoming a key driver of our future business growth. And on a sequential basis, FYP in third quarter grew by 41.3%, which was contributed by the continued momentum in our long-term savings insurance products segment. business plan will enable us to build and scale an omni-channel digital insurance service ecosystem, which will place us firmly in the top tier of insurance intermediaries in China, becoming a digital partner of choice for our upstream and insurer partners as we move into an age of insurance distribution for new generation consumers, which demands innovative solutions on the product side as well as the seamless digital experience and professional customer service."
}