{
    "symbol": "HUIZ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-23 12:36:06",
    "content": " In the second quarter, total growth written premiums or GWP facilitated on our platform increased by 30.5% year-over-year to RMB 872 million, and our total operating revenue also increased by 30.5% year-over-year to RMB 248 million. In the second quarter, the first-year premiums, or FYP of savings products facilitated on our platform amounted to RMB 282 million, up by 100 employees we present every year-over-year. In terms of FYP, the average ticket size of long-term insurance products and long-term savings products in the second quarter were approximately RMB 3,481 and RMB 44,000 respectively. In the second quarter, total GWP increased by a solid 3.5% year-over-year to RMB 872 million, which is mainly driven by the strong growth in first year premiums or FYP of 59.9% year-over-year to RMB 485 million. During the quarter, and together with other quality of our products such as the retirement annuity product with Sun Life Everbright as well as other savings product, the long-term savings insurance product category, we call it a very strong FYP group of 1.4x year-over-year. The recovery in our other important long-term health insurance category has also been strong during the second quarter as we launched new iterations of a highly successful Darwin Critical Care series, as well as the long-term medical insurance product named  with CBIC. As Mr. Ma mentioned in his opening remarks, we will continue to build and scale an omnichannel digital instruments service ecosystem that integrates A) agents, B) businesses and C) customers over the next three years, which would take us firmly in the top-tier of insurance intermediaries in China, becoming a partner of choice for  partners, as we move into an age of insurance distribution for new generation consumers, which demands innovative solutions on the product side, as well as a seamless digital user experience. For the second question, I think that the takeaways and commission rates for the various products on the platform, I think that essentially the FYP commission's for online products is 60%, 60% for the health products, the long-term health products that we  series, will be   year commissions by 60%."
}