{
    "symbol": "BR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-12 12:21:37",
    "content": " For the full year, recurring revenues rose 16%, driving higher margins and after accounting for higher interest expense, adjusted EPS growth of 14%. Wealth and investment management revenues rose 5% in fiscal '22, powered by new sales both the U.S. and Canada, which helped offset the impact of lower trading volumes as we lap the peak of the mean stock phenomenon over the second half of last year. In Q4, ICS recurring revenues grew 14%, all organic, to $807 million, including double-digit growth across all four product lines. Data-driven fund solutions revenue grew 11% to $103 million, driven by strong growth in our data and analytics solutions and our mutual fund trade processing unit. Finally, our customer communications business had a very strong quarter, growing by 15% to $155 million, driven by a surge in volumes from onboarding new clients and double-digit growth in our higher-margin digital offerings. Recurring revenues grew by 18% in Q4 to $382 million, driven by continued strong performance from Itiviti, higher capital markets fixed income trading volumes and an increase in wealth management license revenue. Itiviti, now BTCS, contributed 7 points of growth to Broadridge's recurring revenue, right on track with the expectation that we set when giving fiscal year '22 guidance and ahead of our profit expectations. Wealth and investment management revenues grew by 4% to $142 million, driven by growth from new sales and license revenue, partially offset by the impact of lower trading volumes at our wealth management clients. Low to no margin distribution revenue increased by 12% and contributed 3 points to total revenue growth, driven by a combination of higher volumes in our customer communications business and higher postage rates. Looking ahead to fiscal '23, we are not forecasting any major mutual fund proxy events and we expect event-driven revenues to be in the $240 million to $260 million range in line with recent years. Adjusted operating income margin for Q4 was 25.3%, a 250 basis points improvement over Q4 '21, driven by strong recurring revenue growth and lapping the increased investment in our digital and technology platforms. For the full year, Broadridge delivered 60 basis points of margin expansion, exceeding our objective of 50 basis points despite elevated growth in low to no margin distribution revenue, which diluted our reported full year adjusted operating income margin by 70 basis points. Our guidance calls for mid- to high single-digit recurring revenue growth, continued margin expansion, solid adjusted EPS growth and another year of strong closed sales. We expect fiscal year '23 recurring revenue growth of 6% to 9%, all organic, with balanced growth across both ICS and GTO. Embedded in our adjusted EPS outlook is the impact of higher interest rates, which will drive a $35 million to $40 million increase in interest expense and the impact of the stronger dollar, which will lower our adjusted earnings growth by just over 1%. So to sum up, our fiscal '23 guidance emphasizes the strength and resilience of our financial model and our ability to drive sustainable recurring revenue growth through any economic environment, fund growth investments while expanding margins and delivering steady and consistent adjusted EPS growth, all while maintaining an investment-grade balance sheet and a balanced capital allocation policy. Our guidance for fiscal '23 has Broadridge well positioned to deliver above the three-year growth objectives for organic recurring revenue and recurring revenue, in line or ahead of our margin objectives and with adjusted EPS growth at the higher end of our three-year growth objective range."
}