{
    "symbol": "GMAB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 18:08:05",
    "content": " And potentially the biggest I think, potential impacts HexaBody-CD38 could make is in solid cancers because there’s still very strong data, Wimal, in the effect of anti-CD38 antibodies and actually stimulating the immune system to attack cancer in animal models, that has not yet led to convincing data in the clinic with daratumumab and also not with Sarclisa from Sanofi. So what I said publicly before is that we could potentially have a scenario that you see limited data from both of these programs this year, and then full blown data at a prestigious medical conference next year, but that you will hear from us and BioNTech that we have already used the data which we have collected in-house to accelerate the program and move it to the next stage of clinical development. It's a bit premature to discuss about the timeline for potential approval for either one of these programs, because a lot depends on where we will see the responses and in what line of treatment we will see the responses but now with the new so called FDA FrontRunner program, where the FDA is actually stimulating companies to move to frontline earlier on. This is a program from the FDA, but the FDA basically says well, we really don't want to use accelerated approvals in the future so much for like really unstaged patients with diseases like cancer, which have no other treatment options anymore, but we think it's actually more valuable and more impactful for patients to move to front line treatment of these patients. And Genmab right now has the financial robustness Asthika, that with good early data on the ongoing studies we could actually potentially engage with the regulator, like the FDA and move to another FrontRunner program, if they would allow us to front line patients, which of course, where the market is much, much bigger and where we can be much more impactful to the lives of patients. So we are actually super excited and we are thinking of that in the context of 1042, 1046, but also of course epcoritamab, because we have started later than Roche in some of the areas and this could be an excellent molecule also to move on under the FrontRunner program to actually penetrate front line settings much more quickly. And there's of course, the other program, which I spoken about at the full year results in February, the Optimus program, which is requiring more dosing iterations, which is certainly going to be asked from Genmab, as well as from all other companies in the oncology area, under the rationale that perhaps in some combinations, one could use a lower dose of the other therapeutic candidates than what is used in monotherapy, Asthika. And I can tell you very soon we start speaking about our 2030 vision, where we hope to actually make an even more impactful impact on the lives of patients, cancer patients and perhaps even patients outside of cancer because some of our products are being used now like TEPEZZA in thyroid eye disease and, of course Kesimpta in relapsing MS. And I think we're gearing up towards the 2030 patients, 2025 we’re well on track."
}