{
    "symbol": "TTD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 12:12:15",
    "content": " Our client relationships are stronger than ever, because they are based on shared values and goals, a strong buy-side roadmap and Internet where relative value and objective measurement can thrive with data-driven empowerment for brands and advertisers rather than a tech company who is just asking the brand or agency to outsource media buying to them and send their first-party data down a one-way street. JBPs represent strong alignment with brands that only come as a result of not owning media, whether itâ\u0080\u0099s decision CTV, new approaches to identity, unleashing first-party data, advanced data and retail marketplaces, our clients are working with us to pioneer the future of digital advertising. I have said previously that the U.S. and Australia are leading the way on CTV and that markets like the UK and France are following fast, but that pace is picking up in all corners of the world, especially as advertisers look for more relevance and precision in their biggest campaign category. We continue to demonstrate our ability to drive both profitable growth and achieve significant share gains with large growth drivers, including the secular shift to CTV, attracting more shopper marketing budgets, scaling our international operations to be ready when the macro environment improves, innovating the data marketplace, the U.S. midterm election cycle as well as elevated pressure on walled gardens, we remain optimistic for the remainder of Q4 and into 2023. But when you turn our attention to 2023, and you start to look at all the new inventory thatâ\u0080\u0099s going to come into CTV, whether thatâ\u0080\u0099s from Disney+ or digital inventory from Peacock or HBO or Netflix or Paramount Plus or Fox or ESPN or Hulu or the fact that we reported in earnings that this year, 11 markets outside the United States outperformed in the United States in premium video or connected television. But also as you look across the open Internet, and whether thatâ\u0080\u0099s inside of display or native or audio or any other channel because CTV is leading the way in forging the future of identity, CTV is not just leading in our business and not just the most interesting thing happening in programmatic, but itâ\u0080\u0099s the most interesting thing happening in ad-funded media. So, I appreciate the question. So, I appreciate the question."
}