{
    "symbol": "TTD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 20:18:05",
    "content": " We are focused on the buy side and our goals are clear to be the objective open Internet alternative to walled gardens, to pioneer a new approach to decision TV ad buying, to help build the new identity fabric of the Internet and to create a better open Internet for everyone, including us to enable brands to safely and easily deploy their first party data and to add more value by creating a more efficient supply chain. Your line is live. Your line is live. So thatâ\u0080\u0099s why I would argue that we have outperformed everybody else is that unique position and that unique strategy that weâ\u0080\u0099ve deployed as it relates to scatter versus spot and there, I know in this earning season, there has been some discussion about scatter, let me just break it down really simply, scatter is a reference to linear or traditional television where you buy things in upfront, those things that either donâ\u0080\u0099t work out as planned or need to be adjusted to you create this middle market, where youâ\u0080\u0099re buying traditional television with traditional budgets in not very sophisticated, quickly adapt market. Your line is live. Your line is live. Your line is live. And so I think itâ\u0080\u0099s one of the surest ways that we will spin our own flywheel is to continue to enable an open internet where thereâ\u0080\u0099s lots of competition and where marketers that sell goods inside of stores, brick-and-mortar stores continue to get the data driven benefits that historically have been reserved for online retailers like Amazon. And I do think it is true that the discussion about the demise of cookies has made that faster, even though itâ\u0080\u0099s a totally different aspect of measurement, but it is improved and accelerated the move to better measurement, which I donâ\u0080\u0099t know that thereâ\u0080\u0099s any place thatâ\u0080\u0099s better off in those places where weâ\u0080\u0099re doing end-to-end measurement and shopper marketing,\n And then to follow up sort to on your other questions, I think, on the shopper marketing component, we donâ\u0080\u0099t break out that level of detail in our shopper marketing business."
}