{
    "symbol": "AIN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 12:57:04",
    "content": " For the full year 2022, net sales were up nearly 2% on a constant currency basis, making up $10 million in revenue loss from our Russian market exit. The Engineered Composites segment grew full year net sales 37%, nearly 40% on a constant currency basis with significant contributions from both new work on the Sikorsky CH-53K helicopter and recovering commercial aviation production on the LEAP program, driven by the ramp in narrow body aircraft production of the Boeing 737 MAX and Airbus A320neo aircraft. You'll notice that throughout the pandemic, we invested nearly $40 million per year on average in research and development in our business, about 4% of net sales over the past three years. For the fourth quarter, total company net sales were $268.8 million, an increase of 12% compared to the $239.9 million delivered in the same quarter last year. During the quarter, CH-53K generated revenues of over $35 million, up from $13 million in the same quarter last year, while the ASC LEAP program generated revenue of about $41 million, compared to $27 million last year. Fourth quarter gross profit for the company was $97.1 million, an increase of 1.1% from the comparable period last year. Within Engineered Composites, the gross margin increased from 16.9% to 18.8% of net sales caused primarily by improved absorption from higher revenues and the reversal of $1.4 million of previously established reserves, partially offset by losses recognized on the startup program and by a less favorable net change in the profitability of long-term contracts. Fourth quarter selling, technical, general, and research expenses increased from $53.2 million in the prior year quarter to $59.3 million in the current quarter and were essentially flat at about 22% of net sales. Other income and expense in the quarter netted to an expense of $3.8 million, compared to income of $1.2 million in the same period last year. Net income attributable to the company for the quarter was $18.1 million, compared to $28.6 million last year caused by lower operating income, unfavorable other income and expense and the higher tax rate. After adjusting for the impact of foreign currency revaluation gains and losses, restructuring expenses, expenses associated with the CirComp acquisition and integration, and the exclusion of the gain from the sale of IP addresses this quarter, adjusted earnings per share was $0.75 this quarter, compared to $0.86 last year. In 2023, we may have some tough year-over-year adjusted EBITDA margin comparisons in Machine Clothing, particularly in the first three quarters of the year, as we compare ourselves to periods prior to recognition of the full impact of inflation in our financial results. Revenue of between $1.0 billion and $1.05 billion, effective income tax rate of 28% to 30%, depreciation and amortization between $70 million and $75 million, capital expenditures in the range of $90 million to $100 million, GAAP and adjusted earnings per share of between $3.10 and $3.60, and adjusted EBITDA of between $225 million and $255 million. Hey, good morning guys. Hey, good morning guys."
}