{
    "symbol": "VNTR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 14:40:21",
    "content": " After today’s presentation, there will be an opportunity to ask questions. I’m Kate Robertson, Investor Relations for Venator Materials. You should review our Annual Report on Form 20-F for the year ended December 31st 2021 and from 6-K for the quarter ended March 31st 2022, and our other filings with the SEC for more information regarding the factors that could cause actual results to differ materially from these projections or expectations. TiO2 segment adjusted EBITDA in the first quarter of 2022 was 49 million, compared to 35 million in the fourth quarter of 2021 and $40 million in the prior year quarter. We increased production from our manufacturing facilities during the first quarter; however, as a result of the continued strong demand for our products, our inventory volumes are below historical seasonal norms. In the first quarter, we increase our average selling prices 12% sequentially and 29% compared to the prior year period in local currency, enabling us to mitigate inflationary cost pressures and maintain our prior year adjusted EBITDA down margin. Turning to the outlook for TiO2, as I mentioned earlier, we continue to operate with historically low inventory levels and we have seen little evidence of restocking throughout the supply chain. In the meantime, we have moderated the facility by one-third of its capacity, which we estimate will have a net EBITDA impact of less than a million dollars compared to our second quarter forecast. Our Performance Additives segment consists of three distinct businesses; functional additive, which supplies products to enhance coatings and plastics products; our color pigments business, which produces colored inorganic pigments for the construction, coatings, plastics, and specialty markets; and finally our North American timber treatment business, which manufactures wood preservation chemicals. Our Performance Additives segment delivered 20 million of adjusted EBITDA in the first quarter of 2022 compared with 19 million in the prior quarter, and 22 million in the prior year period. Average selling prices increased 9% sequentially and 20% compared to the prior year period, in local currency, as a result of actions implemented to mitigate the impact of cost inflation. We continue to see cost inflation in the near term, which we expect to recover through our customer tailored monthly pricing initiative, which commenced in March. Adjusted EBITDA for the first quarter increased 8 million compared to the prior year period, primarily due to increased selling prices implemented to mitigate the impact of increased cost inflation. Our first quarter free cash flow was negative 103 million, including a working capital used of 87 million. During 2022, we expect the following cash uses; capital expenditures of 85 million to 95 million, which includes modest investments to support future growth; working capital to be a cash use of more than 20 million due to higher selling prices and cost inflation; restructuring to be a cash use of approximately 25 million, as we pay for our successfully completed Business Improvement Program; and other cash uses including pension, which are expected to be approximately 25 million to 35 million, which is 10 million lower than our 2021 number, primarily as a result of lower pension contributions. Over the next two and a half years, we expect to see a substantial reduction in our annual cash uses of approximately 70 million. The reduction will be attributable to lower restructuring costs of 25 million, completion of the quarry site closure and corresponding reduction of approximately 25 million, and, finally, a reduction in our pension and other cash uses of around 20 million. Turning to slide eight, I’m very pleased with our first quarter results and I’m proud of the Venator team who continue to navigate the unprecedented challenges we are facing. As Kurt mentioned, we expect our cash uses to reduce by approximately 70 million within the next few years, which will be a big step forward toward improving our financial profile. Thanks for taking my question. Just curious, looking at your quarter-on-quarter bridge for price mix and the COGS, they’re pretty close to offsetting each other. Yeah, I mean, look, we think that we’ve done a good nice job in the first quarter of mitigating these inflationary pressures with some pretty significant price outcomes. Of course, as we’ve said many times before, no customer likes price increases. The one thing that is very clear is we’ve given ourselves more flexibility by moving to more monthly based reviews, by the use of surcharges in selected cases as well. But of course one of the issues that we observed in March particularly was the spikes in energy and we are through April now in the second quarter, but we don’t know how stable or volatile these energy prices to which we are exposed in some parts of our contract where we’re not fixed, will play through. So it is a tough question to answer, my expectation is that we would, at least managed to sort of hold on to what we’ve got, while these headwinds are blowing hard, and, hopefully, we will be able to expand as we go into the second quarter. We’ve sort of made reference to this for a considerable length of time, through our findings, and the like. And, of course, over time, those facilities, quarries, and landfills and so forth fill up, so we’ve been in negotiation about the next way that we manage that with the authorities. In the very near term, we have elected to take one of our three streams off of roughly a third of the capacity in this quarter and that will have a sort of singular millions impact, if you like, through the quarter. And that’s, I think, a fair representation of where we are with the dynamic. Good morning, Simon and Kurt. You guys talked about increased production and obviously higher demand in 2022, just wanted to sort of dig a bit deeper into that. I mean, I’m just trying to get a sense of what that TiO2 market demand growth looks like. I think, potentially slightly higher, because you’re right about underlying GDP growth and recovery, and that would be our general assumption about growth. But of course if you look at some of the noise in the fourth quarter, we had some maintenance, moderation, and the like, so we had a pretty top end outcome in volumes in the first quarter of 15%. And I think we said that we would expect to increase capacity and production through 2022 over 2021, by between 5% to 10%. That’s what we’d be looking for and there are some factors out there that will determine whether that’s towards the lower or the higher end, but I think, thinking about it from that point of view, that’s how we see 2022. And Hassan, let me just add to that there’s no capital investment necessary in order to access that excess latent capacity that we have. So yeah, as you know, as we came out of the pandemic, we were really ramping up the assets in 2021 and so we’re getting into a more normalized run right here in 2022, so that capacity is there for us to access and we’re just tuning up the facilities in order to access it. I think one thing I would like that Hassan is we don’t -- we think -- although it’s a careful navigation on supply chain, we think we get through these first six months without production interruptions due to lack of inputs, i.e. We think we get fully shipped, of course, it’s quite challenging, but we think we get fully shipped to be able to make our production and we won’t be constrained. Of course, as you know, we’re coming up incredibly low inventories. Yeah, I think on the first question with the feedstock, we made the point that we buy a full range of feedstocks and we have quite a diversification, because of our technology platform between ilmenite flags , high grade chloride flags and  and the like, synthetic and natural. We’re not overly dependent on one, although, of course, there are some big supply points for us. I think beyond that it’s hard to tell, depends how demand comes back. There’s been many times in this past 5, 10 years plus, that predicted minerals shortages will have a heavy impact on the industry and of course, at some point, that will be right. But I’m quite optimistic over these coming years that it doesn’t provide a meaningful bottleneck; once there won’t be pinch points, but I think, yeah, availability is less. I think turning to your second point, it’s a very interesting point about cost curve and industry dynamics, because we made the point that all through these last period, extra supply and capacity is not coming online and demand continues to steadily creep up, underlying demand. So from a fundamental standpoint, I think that’s good. And therefore, if you look at the total cost structures on each and every site, the proportion of that cost structure that’s taken up by direct costs, rather than an indirect cost or variable cost rather than fixed costs, depending on your preference and terminology, it means that that tends to, by definition, flatten the curve; of course, there still will be a curve, but it does tend to somewhat reduce the advantage of a sort of low fixed cost per ton on the site, and it doesn’t clearly eliminate it, but it tends to reduce it. The other factor, of course, is in China, as we’ve seen these last three or four years, a lot of the factors that go into Chinese small units production have been blowing against Chinese manufacturers. And so we’ve seen that, in the broader Asia region, that the Chinese pricing postures look, sort of, like very similar to ours, in many cases and that wasn’t always the case. Thanks for taking my question. Yeah, I mean, I think there’s a few comments that apply on your question, Will. I mean, first and foremost, as we settle out, I’d like to reiterate that the preponderance of our price increases are through underlying direct negotiation, and the minority of the increases are through surcharges. So, that’s an important point, because when it comes to reviewing what we do about surcharges, let’s be clear, is that sort of the smaller part of the price adjustment. I think we would -- from today’s vantage point, we expect to continue these sort of monthly price reviews, at least through 2022. That will be our best sort of assumption, as we sit here today, could change but that’s how we see it. We like the fact that with the volatile sort of markets, and volatility in general that we’re seeing in the world, that a more sort of regular opportunity to at least review price is welcome. So I think, of course, no one likes increased prices and sustained increases in prices but I think our large scale customers looking at their private and public pronouncements around their margins, implies that they’ve got a good way of managing that themselves. And I would see as, when the time does come, if indeed, it does come to manage back to more normalized pricing structures, then we would find a way with each of our customers on a tailored basis to negotiate and discuss how that’s best achieved. We don’t have anything planned right now but it’s something that we have shown that we’ve been able to successfully take cost out of the business, as needed, and we’ll continue to evaluate that, as we go forward. Yeah, maybe I’d like to just add one or two comments, if I may. So, the way I think about it now is we are turning to the future and our focus will be more on productivity improvement, getting more tons out of the base we’ve got, we like the asset footprint and basically have, we want to get the most out of that. And of course, we’re going to continue to place a heavy emphasis on specialty and differentiated products and services for our customers. And those are the predominant ways we’re looking at improving our earnings profile, while at the same time, of course, taking out the 70 million that we spoke about in the call of cash usage and working at the free cash flow from both sides of the curve. And then when we look at revenue exposure, it’s primarily a Euro and US dollar. When we look at our cost structure, we have an exposure to the pound sterling, as you would imagine, with a headquarters in the UK, so we’re short of pound sterling. So we have had very minimal net FX exposure on the EBITDA line recognizing that if you’re only looking at revenue or COGS, there’s a bit of variability there, but net EBITDA, it’s been minimal. And expect, I don’t how explain to me or answer this. But -- so for 2Q, right, we’re hearing a pretty wide range of price increases and it’s probably because everybody is going into different customers with different numbers, but something like 100 euros, 300 euros, etc. Yeah, so I think if we look at the first quarter, there were a range of sort of local price outcomes that we’ve observed, from public results and the like, in our segment. I think, often, we see those fairly bunch, but there’s quite a spread. In our own case, I have to say that there’s a couple of factors we should point to, number one, we were beneficiaries of some good mix dynamics in our 12% local currency uplift in the first quarter. And as we said on the prior call, we moved to monthly reviews, because we needed that nimbleness, and I think it’s shown in the results that it was the right thing for us to do. Now, as we go into the second quarter, we are going to need a pretty reasonable price increase to keep pace with that, what we see as our forecast cost inflation in the second quarter and, frankly, we continue to believe there’ll be further inflation in the second half of the year and further price increases. No, we won’t, but it’s still going to be a pretty significant move forward, I think, overall. I know it wasn’t an easy question to answer, so thanks. Good morning, Simon and Kurt. Yeah, look, I mean, I think that there’s no doubt about it. If we look at the overall export figures, the most recent export figures, one could conclude that the Chinese export amounts are at their sort of highest level that we’ve sort of ever seen. The patterns that we see and have seen for several years, I might say, remain fairly similar, of course, with the Chinese sort of like trade war issues of a couple of years, but it’s true that exports to the US did dropped somewhat. But if we look at the exports into Europe, they are higher than they have been in the last three or four years, no doubt, and that’s driven by no question, the softness in the internal domestic Chinese market. So yes, they’re high, yes, they’ve gone up. They’ve had challenges in recent years over labor inflation and CapEx requirements and environmental requirements, and of course, the whole shipping congestion and freight rate pieces also have it. So yes, it’s true, those exports have gone up, but they are clearly needed in the market because I think several companies are somewhat constrained with these low inventory levels and supplying the customer’s needs. So I’d represent to you that this is a highly manageable dynamic, and that Chinese producers have become quite sort of focused on ensuring they get fair prices for the products that they ship out of the region. And, let’s be clear, the majority of those exports still find their way into Asian, Latin American, and Middle Eastern markets compared to the Western European or North American markets. Yeah, I mean, I think that’s our underlying expectation. I mean, it would stay in Performance Additives, that it’s a little bit more choppy, although the feedstock stock prices in TiO2 are quite significant, they sort of manage the way that their pricing plays through. In the Performance Additives business, particularly in our colors business, you’ve got iron oxides and iron particles and Asian supply and we’ve noticed more volatility. So you will see some choppiness between quarters, I think, in Performance Additives, but we still think we’re looking down the barrel of a pretty solid quarter, in the second quarter for our Performance Additives business to go with these past two quarters, in fact. Thanks for taking my question. Well, I mean, I think we’ve covered the FX point, so it’s not really a factor for us. But, I think if we really got to look at our bridges and the charts, whether you’re looking in the QonQ or the year-on-year, I mean, some of these COGS movements are pretty high scale. But, of course the major spend items are feedstock and energy, those are the two big ones but I must represent that the other chemicals we use, sulfuric acid, caustic, coke and the like, plus of course shipping and freight, there is also meaningful -- very meaningful exposure. So, I think near term, you’re better off to look at the bridges to give you a sort of guide on the type of quantification of these dynamics, yeah. There’s a greater impact from supply demand, you cited high inventory levels from China. Yeah, I mean, look, there’s a number of sort of factors in that question. Let’s first and foremost, say that we do actually expect that aggregate demand to continue throughout the year. We don’t -- at the moment, although there’s much talk about what sort of comes next, we prefer to look at the evidence to hand and the evidence to hand is very clear, it’s pretty strong, it’s in all markets, and all sectors, pretty much most applications where we are more exposed, whether it be specialty, or more functional products, whether it be additives, or TiO2. We don’t, like anyone else, know what the future truly holds. But I think we’re in good shape, we’re doing the right things to maximize the value of the business, making the most of what we’ve got, being very attentive to our cost, procurement, and pricing strategies, and working closely with our customers and that’s an important point. I mean, the customers here have really seen the value of being closely connected to us in these times where it’s very challenging, and I think there’s been some greater understanding created between ourselves and customers over this period. So I’m quite optimistic and answer your question, pretty high level answer I know, but I feel pretty positive as we go through the rest of the year and beyond. Because, as I said, where’s the incremental supply coming from has not being built during this period, our plants continue to get older, and we’ve seen failures in supply chain with maintenance and reliability and all of that means that supply balance has remained tighter rather than loose. Yeah, I mean, look, it’s pretty high. Everything we’re doing here to get when I spoke about 5% to 10% more than last year, that’s not like 5% to 10% brand new capacity on top of what we have, it’s our effective operating capacity, because last year, some of our assets were either reduced or had some outages and the like. But certainly, if you look at where we are right now, we’re fully sold and we’re running everything we can flat out. Now, we all know these paths need maintenance, so depending on your definition of utilization and the like, but I would see that -- I would see us greater than the 90% mark quite clearly, right now. And two when it comes to working capital, if you expect be carrying higher inventories, I mean, through the end of the year, just given some of the supply constraints you’ve seen, and just to make sure that you can meet customer demand. Yeah, Dan, let’s talk about maintenance CapEx first and so we generally think about the business needs for maintenance of roughly 75 million a year. Now, depending on the year that can be a little bit above that, or a little bit below that, I think that this year, it is going to be a little bit higher than that, hence, the guidance that we’ve given that not only includes a slightly elevated maintenance CapEx, but also some discretionary CapEx within that range of 85 to 95 that allows for additional support of organic growth within the business as well. Just about inventories and working capital, if they’re going to be elevated through the end of the year, just to make sure you have supply for your customers. But as we look at it from a volumetric standpoint, we’re servicing our customers with everything we produce on a real time basis. So I don’t -- right now, we don’t foresee building much inventory, as we go through 2022, because the demand is so insatiable right now that we want to continue to provide our customers with the product as we are producing it. But the good news for us is that we’ve managed to procure all the raw materials and services we need to make our products in the first months of these -- first four months of the year and we think of the first half and that has been quite challenging, but we’ve achieved it. And we have stepped up our production, it was a good production quarter for us and we’re going to continue to try and do that through the second quarter and the rest of the year. So I think largely, we’re shipping on time if you allow us the latitude of negotiated delivery times rather than absolute preferred. Thanks for taking my question. I guess, should we be thinking about the rest of the year where it’s the traditional first half is a big user of capital or working capital and the second half, you get it all back sometimes, and then some -- maybe sometimes it’s a little bit less than getting it all back? Yeah, John, I think that you’ve got it right. First let’s just remind ourselves that elevated accounts receivable is good, because it’s going to be unwinding into cash here as we progress through 2022. And you’re right, I think that there will be an offset here in accounts payable as we go through the year. We think that nets out to a total use of more than 20 million, as I indicated, but the seasonal pattern between the two halves of the year will be precisely that, a use in the first half followed by a source of cash in the second half. Yeah, I think it’s still too early to say how the interest line will be impacted. As we indicated in our prepared remarks, we’re actively engaged with several banks to explore recapitalizing a portion of our debt structure. I’d like to thank everybody who participated on the call today, our first quarter 2022 earnings call."
}