{
    "symbol": "JCI",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-01 13:21:02",
    "content": " And so weâ\u0080\u0099ve got â\u0080\u0093 you see that not only in our shorter cycle business with our global products and the strength that weâ\u0080\u0099re having in margins thatâ\u0080\u0099s combined not only the value proposition, but now also the additional productivity thatâ\u0080\u0099s playing through and the leverage that weâ\u0080\u0099re getting on that. And so as we project the current year, weâ\u0080\u0099re going to continue, going to see momentum in margins, because the longer cycle business, weâ\u0080\u0099ve got strong margins and backlog. Regarding the margin, we expect global product margin to remain strong for the rest of the year and we expect the field margin to turn positive in Q2, probably about 51 to 100 basis points at the segment EBITDA level and increase day after significantly with a strong increase as we end the year, Nigel, in the field business. So as we keep converting the backlog as we â\u0080\u0093 which is at a higher margin, as we keep delivering our productivity initiatives, as we keep increasing the mix of our service business in our companies, which was very strong in Q1, we expect this momentum to continue in Q2, you will see the field margin business to increase, I would say, materially between Q1 and Q4, Joe. On the distribution side, weâ\u0080\u0099ve worked with our distributors in making sure that now as we have continued to improve our supply chain through the quarter that weâ\u0080\u0099re going to be positioned to be able to deliver on their expectations from a demand standpoint as we now go through the rest of the year. And so for us, itâ\u0080\u0099s â\u0080\u0093 and then when you look at our mix of our businesses, with the demand for our core applied business, when we look at our chillers, when you look at industrial refrigeration, you look at our data center offerings, across our supply â\u0080\u0093 across that portfolio, weâ\u0080\u0099re seeing incredible demand. When you look at the turn, so what weâ\u0080\u0099ve booked over the last â\u0080\u0093 itâ\u0080\u0099s really been the last year, 15 months, whatâ\u0080\u0099s been turning some of the longer cycle projects that are turning now and you look at whatâ\u0080\u0099s going to turn second, third and fourth quarter, a much higher mix, Julian, relative to the margin that we booked into the backlog. And so I think from that standpoint, when you look at our applied product business, weâ\u0080\u0099re up â\u0080\u0093 itâ\u0080\u0099s up double-digit with the applied products flowing into our channel, which ultimately is helping us create a bigger installed base."
}