{
    "symbol": "OPFI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-25 10:52:05",
    "content": " One, some highlights from our Q4 and full year 2022 financial performance; two, an update on strategic business initiatives for 2023; three, our macroeconomic outlook and quarter to date business trends; and four, our long-term growth strategy. The key highlights for the full year compared to the previous year included 27% growth in net originations to $758 million, 19% growth in ending receivables to $403 million, 29% growth in total revenue to $453 million, net income of $3.3 million and adjusted net income of $5 million. We also successfully improved our marketing and operating cost efficiencies in 2022 as demonstrated by the 20% decrease in marketing cost per new funded loan and a 13% improvement in operating expenses as a percentage of total revenue, excluding interest expense, add-backs, and one-times. Our improved efficiency trends continued in the fourth quarter with a 25% decrease in marketing cost per new funded loan and a 23% improvement in operating expenses as a percentage of total revenue, excluding interest expense, add-backs, and one-times. In addition, we exceeded all of our full year 2022 guidance metrics that we reiterated in our third quarter earnings release: total revenue, operating expenses as a percentage of total revenue, excluding interest expense, add-backs and one-time items; and adjusted profitability. Total revenue increased 29% to $453 million, while net originations were up 27% year over year to $758 million, driving a 19% increase in ending receivables to $403 million. For the fourth quarter, total revenue increased 25.1% to $120 million, despite our net originations of $187 million, which was the same as the year ago period. Our annualized net charge-off rate as percentage of average receivables was 71% for the fourth quarter of 2022, compared to 53.2% for the prior year quarter. Turning to expenses, operating expenses for the fourth quarter, excluding interest expense, add-backs, and one-time items, totaled $42.2 million or 35.1% of total revenue, compared to $43.9 million or 45.8% of revenue for the fourth quarter of 2021. Adjusted EBITDA totaled $9.9 million for the fourth quarter, compared to $20.4 million in the prior year quarter, as higher revenues and relatively lower expenses were more than offset by increased net charge-offs. Interest expense for the fourth quarter totaled $10.7 million or 8.9% of total revenue, compared to $6.9 million or 7.1% of total revenue in the same period a year ago. Adjusted net loss was $2.8 million for the fourth quarter, compared to adjusted net income of $11.4 million for the comparable period last year. For full year 2023, we are providing guidance for total revenue of $500 million to $520 million, which implies growth of 10% to 15% year over year."
}