{
    "symbol": "NEWR",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-08 21:17:08",
    "content": " The sales team is focused on three key priorities: number one, nurturing value realization with our customers against their committed spend through increasing platform adoption and usage; number two, helping customers align their contract commitments with their increasing usage; and number three, opportunistically landing new large enterprise customers. This quarter, we saw customers increase their consumption run rate in aggregate by net $50 million, a record one quarter increase and driven by increase in both users and data. For example this quarter an online travel company transitioned from our legacy business, where they had a $1 million annual spend to a new platform agreement for three years and more than eight-figure commitments. Your line is now open. Your line is now open. Your line is now open. To give you a little bit more color on that, if you measure just the increases, those who ended the quarter with a higher rate of consumption, we actually -- they actually added $100 million in consumption run rate. Your line is now open. I did want to just circle up on some of the guidance questions that we're having and really just to get a little bit more color if I could, but when we look at the full year guidance reduction that we're talking about, maybe you can parse that with the commentary that you guys have had as far as the $18 million that were renewed early in 2Q. Your line is now open. Your line is now open. Your line is now open. Your line is now open. In terms of customer churn -- customer count churn I mentioned earlier we have 800 new paid platform customers that came into the business this last quarter, but around 500 or so of our legacy APM very small customers that put a credit card on file and continue to allow us to charge it but that are churning out, offsetting that customer count growth. So it varies widely, but it's a very strong high efficient high-volume motion that now we're focusing on helping move those customers into contracted consumption and into our sales-led model where they can get even more support from New Relic to expand their consumption. Your line is now open. So, I think almost in line with the question earlier, the reason we focus on commitments and expansions, is actually just to continue what customers are doing whether it's in tool consolidation or continuing to support their cloud strategy or digital transformation, that they have plenty of contract to work with."
}