{
    "symbol": "THS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 10:48:04",
    "content": " At this time, I would like to turn the call over to TreeHouse Foods for the reading of the Safe Harbor Statement. Before we begin, we'd like to advise you that all forward-looking statements made on today's call are intended to fall within the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. As we continue our strategic journey to drive growth and create value, the work we've done over the last several years to optimize the business, focus on commercial and operational excellence, and align our structure with how our customers think has enabled us to execute throughout this dynamic environment. But before I get further into the first quarter numbers let me start as I usually do, by framing the macro environment. While we see improvements in our business, labor markets remain tight across the country and they're going take some time to normalize. The supply chain continues to be disrupted particularly across the ingredients and materials complex, often reflected in longer delivery lead times and allocated availability. Against the backdrop of these macro headwinds, private label demand has continued to strengthen with strong growth in both measured and unmeasured channels. On Slide 6 on the left you can see that the price gap between branded and private label for our TreeHouse categories as widened, a key data point supporting our value proposition to the consumer. Today given the absolute price point inflation, the dollar value savings of a basket of private label goods is simply more substantial. As a result, consumer shopping patterns are beginning to shift and we're seeing it in the data. Slide 7 tracks buying patterns for households earning above and below $100,000 a year. We again invested in service for our customers, and our teams continued to collaborate with them to successfully implement pricing to recover inflation. We have also slowly been able to improve service in certain categories, particularly in snacking and beverages. Given the supply chain constraints and the broad macro factors I highlighted earlier, this was a solid start to the year. Adjusted EBITDA margin of 5% declined 460 basis points driven by inflation, labor, and supply chain disruption and the timing lag as we implement our pricing. In fact, in the first quarter in 8 of our 10 largest categories, we're outperforming the broader private label market which has returned to pre-pandemic unit market share levels. While inflation continues, our teams are on top of it and we're working with our customers. As we look to drive savings across the network, cost control and continuous improvement are also important areas of focus. Our solutions span securing backup ingredient suppliers to in certain cases, collaborating with our customers to reformulate where necessary. I'll close by stressing that through all of this, we continue to be intently focused on the customer. In the near-term, that means additional investment, but we believe investing in the customer is the right long-term decision and will strengthen our relationships and our business. Starting with Slide 9, first quarter revenue grew 7.9% versus last year. Pricing contributed 11.7%, very much in line with the expectations we communicated back in February, the low double-digit pricing as we entered the year. Netted against the pricing, volume and mix declined 3.7%. We continue to address supply chain constraints and availability of materials and ingredients across the network so that we can improve production and in turn, service. Our Meal Prep division net sales grew 7.3%, driven by 13.3 points of pricing, which is largely reflective of the escalation in oils, durum, and oats. Our Snacking & Beverages division delivered first quarter revenue of 9%, of which 8.8% was pricing and 0.2% was volume and mix. And in a number of categories, we've been able to capture incremental private label demand coming our way. While Snacking & Beverages does have several categories that are still constrained, such as cookies and crackers, we are working diligently to improve production and restore service to target levels. Similar to prior quarters, revenue in unmeasured channels was better, posting growth of 6%. As private label demand had strengthened, we are doing all that we can to capture that volume. Moving to the right, total PNOC, pricing net of commodities, contributed negative $0.55 versus last year, which, in large part, reflects the higher cost of inventory produced in the fourth quarter that was sold in Q1, partially offset by pricing. In the quarter, operations contributed negative $0.13 versus last year as we continue to address supply chain challenges. Finally, interest expense favorability contributed $0.09 in the quarter versus last year due to our successful refinancing early in 2021. As I noted last quarter, we successfully amended our credit facility in February to increase our debt-coveted leverage ratio and provide additional flexibility in 2022. Our debt covenant leverage in the first quarter was 4.4 times, well below our higher amended covenant ratio of 5.5 times. I'd like to point out that we've added our cash flow statement to the press release today, which I think many of you will appreciate. Turning to guidance, today, we are reaffirming our full year 2022 guidance as seen on Slide 12. We expect revenue in 2022 to grow at least 11%, driven primarily by pricing, which came in this quarter at almost 12% and will build throughout the year as we take additional pricing actions to recover the further escalation in commodities. Pricing in the first half of the year is being offset in part by lower volumes, driven by constraints and service challenges due to labor and supply chain disruption. But as you saw in our first quarter results, increased private label demand, coupled with our work through store service levels, are positively impacting our performance. We expect this to continue, strengthening both the top line and profitability as the year goes on. Adjusted EBITDA in 2022 is expected to be between $385 million to $415 million, weighted primarily towards the back half of the year. Specific to the second quarter, we are anticipating flattish to slight sequential improvement in adjusted EBITDA margin from the 5% level we reported in the first quarter. We continue to believe adjusted EBITDA margins will improve as the year continues and approach pre-pandemic levels in the second half, which, on average, were in the 11% to 12% range. As Steve noted earlier, this continues to be a dynamic environment, and macro factors will continue to play a role in how the year unfolds as seen on Slide 13. Our teams are doing a great job navigating through, and we believe we have the building blocks in place to capture demand, recover inflation, and mitigate disruption. Importantly, private label demand is robust and strengthening. We also have important tools that we are leveraging to recover inflation, such as lean and continuous improvement as well as hedging and buying forward commodities, where possible. On the labor and supply chain front, it is critical that we position ourselves to our seasonal peak in the back half of the year and that we mitigate disruption and improve production. We expect to continue to make progress and by doing so, we believe that we can restore the business to historic levels of profitability. In my opening remarks, I spoke at length about the macroeconomic environment and the evolving consumer purchasing behavior in recent months, which is translating into unit share gains for private label. For those of you who've covered TreeHouse and private label for some time, you'll recall that historically, there have been three main factors that support private label growth; the economy, demographics, and retailer support. But regardless of whether they are value retailers, traditional grocers, club stores, experiential retailers, or pure-play e-commerce businesses, the bottom line is that TreeHouse is a key partner for retailers as they look to drive loyalty, traffic, consumer experience, and ultimately higher profit margin. As you can also see, some of the latest retailer quotes here is evident that our customers are focused on private label growth as a key part of their strategy. When combined with the economic environment, the underlying fundamentals for private label growth are healthy and very much intact. I have no doubt that our customer relationships are stronger today as a result of our investments to drive commercial excellence, as we have transformed our business over the last several years. We believe that our work around lean and continuous improvement, coupled with our actions to mitigate the ongoing disruption, will enable us to improve service and produce more what our customers need as we head into our seasonal peak later this year. With our building blocks in place, I'm confident that our first quarter results position us well to be on track to achieve our full year guidance. Your line is now open. The first one would just be in terms of incremental pricing coming through now in the third quarter, is it a meaningful step up in pricing that you're expecting and I guess, to the degree to which you're seeing the elasticity, it seems like a lot of your volume at this point has been constrained by supply constraints more than elasticity necessarily but I just want to get a sense of what you're seeing there at that level of pricing in Q3, like how much incremental is coming through and then what that could do to volume? The pricing that we've communicated in the market is essentially all communicated, all hit in Q3. It's hard to say what's meaningful these days, but it covers our commodity inflation that we've seen thus far. And to your point, it'll flow through the P&L in Q3 and we think we'll be set, unless there's additional inflation coming through. I think, Chris, first of all, you're right, our supply chain limits have really been the inhibitor for us, not the demand piece. And so as that slowly improves, we think the absolute volume and units are going to improve. I think as the consumer having elasticity, we're starting to see private label share from a unit standpoint, pick up. I think the consumer as we talked about in the prepared remarks, is under a lot of pressure and the conversations we're having with the customers suggest they're trying to be sure they have a value offering. But the customer is really focused on having value offerings in the store, and we think that bodes well for the back half. And just a bit of a follow-on but if you just look at the PNOC that you put on that -- on your EPS bridge, just looking at it over four quarters, you're talking almost $2 per share. So I just wanted to get a sense of the recoveries piece of that, meaning that by the third quarter you'll have pricing in place that offsets the inflation you know and I guess it's on the backside of that, that you can start to earn back some of that lost PNOC. And so we think we'll recover those dollars in the back half and for the full year, we should be okay there. Your line is now open. So the service levels are not where you want them, but it sounds like they're improving and you expect them to improve further. In terms of the impact on volume for the quarter, for the full year we thought we'd be in a flattish position on price and volume with the more significant decline in the first quarter. We think service will return to normalized levels, building in the back half and as we exit Q4, we'll be back to our normal rates, and we continue to focus on that significant area. So -- and I think service levels, I think we said in the prepared comments that they're in the low 90s, right. We -- I think we as an industry, have a long way to go to get the customer back to where we need to get the customer. At the same time, we're trying to recover this inflation. The biggest dynamic we've seen was in the back end of the quarter was the consumer dynamic, and that's their shift to value, right. I think we've talked strategically, right, about getting our portfolio right. Your line is now open. In the past, when you've had unexpected cost inflation in the first quarter, you've had to guide to a pricing lag in the year that would hurt your EBITDA. But this time, you're saying, hey, we've already announced the pricing and we're going to keep our guidance unchanged. As we've gone through the year, inflation is a bit more than we thought, and we priced a bit more. So we think that the -- it's going the way we thought it may unfold, and we're on track. And so as long as we have the right things that are hedgeable hedged and the right things that aren't, we have visibility to those, I think we can -- we've been more diligent this year and guiding to that. And pricing -- our timing of our pricing lives within that three dimensions, right. Well, just so that we can kind of keep track of it a bit, like Ukraine war, that's the new news. It's definitely going to be a couple of points higher than that, but still within the high teens. So here's the follow-up, I think other people have tried to ask this. And I suspect that, that's volume that you committed to with customers and that you just weren't able to satisfy. Hi Rob, let me start with the first part of the question, and I can't really, really quantify it. We know that our service levels, at around and the 90% that we talked about, our target is higher than that, right, 98.5%. So we think we could have, again, service much more demand how we hit our levels from that perspective. We do know that orders and volume cases are coming in much higher, but you have to sort through what could be double ordering and all those pieces. The private label tailwinds are strong as we go throughout the year and then actually, we'll give you more visibility how to expect about that. And then obviously, you've got to account for all that pricing that is coming through. We are in unchartered waters given the magnitude of the pricing and we don't anticipate elasticity, but we'll have to account for that as well as we go through the year. Your line is now open. I'm just trying to understand, this has been an issue, especially going back to the two years ago, start of the pandemic. And I guess part of the problem was private label, in general, wasn't getting. Bill, I think you probably heard a number of our branded or other peers talk about the supply chain challenges. I would say we've made great progress on the people front of this, but there still is supply chain in the materials and ingredients complex, packaging, those kinds of things. We're working with our customers to give them much more visibility to exactly what we need, so we can get it there on time. And I think that's our biggest…\n No, that helps. And then on the pricing front, just trying to understand because a lot of, I guess, the branded peers seem like they've already done pricing. And I think I'm right in saying that we will, as a consumer, see a whole lot of change in your pricing on the shelf in third quarter, the retailers go ahead and take that pricing. I think we're encouraged by the price gaps because it tells us that with the pricing we have in the market, we're providing value to that retailer. I would tell you, private label naturally will take probably more frequent, lower price increases, right, because our margins are lower. But the encouraging thing for us is we don't see a problem with the price gap, and the umbrella that we're operating under is providing. Your line is now open. If you think about just kind of how we manage the margin piece and the commodities going forward, obviously, inflation is up, as I said, mid-teens to high teens. We have pricing out there to cover our inflation, and we'll keep managing through that as we have all year. So with all that coming together, we think we'll be very close to the midpoint of our guidance given the inflation that we're seeing. As we get to the second half of the year in Q4, we build cash nicely, and we'll look to continue to delever from that perspective as things normalize."
}