{
    "symbol": "THS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 12:19:05",
    "content": " At this time, I would like to turn the call over to TreeHouse Foods for the reading of the Safe Harbor statements. Good morning, and thanks for joining us today. This morning, we issued our earnings release, which is available, along with the slide deck, in the Investor Relations section of our website at treehousefoods.com. Before we begin, we would like to advise you that all forward-looking statements made on today's call are intended to fall within the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. In addition, we will be discussing operating and financial results on an adjusted basis. I'd now like to turn the call over to our CEO and President, Mr. Steve Oakland. I'm joined by Pat O'Donnell, our Interim CFO and Chief Accounting Officer. As we announced previously, Pat stepped into that role upon Bill Kelly's departure. We appreciate Bill's contributions, and we wish him well. We are fortunate to have a strong, deep bench of talent here at TreeHouse, and Pat has quickly transitioned into the role and responsibilities of the interim CFO. We are pleased with our second quarter results as our strategy to drive operational and commercial excellence, optimize our portfolio and support our people and talent continues to pay dividends. Our top line performance reflects the impact of our pricing to recover inflation and our ability to capture incremental volume, specifically in our Snacking & Beverage businesses. More broadly, private label consumer demand continues to accelerate, posting 22 straight weeks of share gains in the categories that we operate in. As the underlying fundamentals of private label have strengthened, increased demand demonstrates that the value proposition is resonating with consumers. Input cost inflation continued in the second quarter, particularly in inputs like eggs, wheat and oats. In response, we have communicated and are implementing additional pricing that will be reflected late in the third quarter. While the labor and supply chain environment continues to present challenges, our operating teams are demonstrating great agility as we remain focused on servicing our customers. We are also taking steps to make our manufacturing work environments more appealing, everything from facility upgrades to designing more effective and attractive work schedules so that TreeHouse can be viewed as the employer of choice in each local market. Taking all of these factors into account, we are raising our top line guidance for the full year and reiterating our outlook for adjusted EBITDA. As I noted a few moments ago, private label is gaining momentum. Inflation is driving shelf prices higher, which you see on the left-hand side of Slide 4, making the private label value proposition even more compelling to consumers. Price gaps, noted on the right, continue to be in the low 30s. While price gaps will vary, at these levels, the private label value proposition is very attractive. This is translating into a shift in consumer purchasing behavior toward private label, which you can see on Slide 5. You can see that the pandemic-related trends in the past 2 years actually began to reverse early this year, and that private label share gains have been accelerating since March. For those of you looking for more of these macro data points, you'll note that we've included a few additional slides in the appendix. Overall, I'm encouraged with our progress and I believe that we are very much on track to continue to improve service and profitability throughout the year as we begin to enter our seasonal peak. We are effectively managing inflation with pricing, collaborating with our customers and executing on our efforts to drive cost savings across the network. Before I turn it over to Pat, let me say that we continue to work very diligently to reshape the TreeHouse portfolio through a divestment of a significant portion of our Meal Prep business so that we can build leadership and depth around a focused group of categories in our higher-growth Snacking & Beverage businesses. With that, let me turn it over to Pat to take you through the details of the quarter. Having been intimately involved in our strategic evolution and also having led several of our transformation projects over the last 5 years, it's an honor to be taking this interim role at such a pivotal time for TreeHouse. With that, I'll cover our second quarter results on Slides 6 and 7. We posted strong revenue growth, up 19.4% to $1.2 billion. Pricing drove 17.7% of the growth, while volume rose 2.1%, offset by 48 basis points of FX. As Steve mentioned, our teams continue to do an excellent job working with our customers, providing transparency around commodities and implementing pricing to recover inflation. Our ability to capture growing incremental volume across several categories within Snacking & Beverages, in particular, has been encouraging, and I'll review the division results in a minute. Although margin declined 360 basis points versus the prior year, we were very pleased with the 60 basis point sequential improvement, which was in line with our expectations. On a divisional basis, on Slide 7, Meal Prep sales grew 18.3%, driven by pricing of 20.5%, reflecting recovery of input cost inflation, primarily in oils, durum and oats. Although we continue to be constrained across several Meal Prep categories, we're encouraged by the progress we're making sequentially and we expect to continue to build on that through the balance of the year. Snacking & Beverages grew 21.4% in the quarter, of which 12.7% was pricing and 9% volume and mix. Strong category trends, coupled with improving service, enabled Snacking & Beverages to capture incremental demand during the quarter. On Slide 8, you can see that we delivered growth across all channels in the quarter, with healthy gains in both measured and unmeasured channels. Volume and mix, including absorption, contributed $10 million in the quarter as we captured some incremental private label demand, particularly across Snacking & Beverage. Total pricing net of commodities was down $1 million versus last year, which captures the continued escalation in commodities year-over-year netted with our pricing to recover inflation. As you think about the back half of the year, we will have further pricing actions to be reflected in our P&L. So sequentially, assuming that inflation aligns with our expectations, its impact will continue to improve as pricing catches up. Here, we continue to be burdened by our efforts to mitigate labor and supply chain disruption, especially as it relates to material availability. As Steve noted earlier, we are also investing heavily in training, retention and engagement to address the labor challenges and enable us to improve operational efficiency. Finally, other, which contributed negative $2 million year-over-year, primarily reflects foreign currency impacts. On the balance sheet, our revolver remains largely undrawn and we have liquidity of close to $1 billion. We finished the second quarter with debt covenant leverage of 4.5 times, below the amended higher covenant ratio of 5.5 times. We are raising our full year revenue guidance to mid- to high-teens growth, driven primarily by pricing that will continue to build into the back half of the year as we approach our peak season. The macro environment remains challenging and dynamic and, as a result, we are maintaining our adjusted EBITDA guidance of between $385 million to $415 million. We are making good progress, but our work to mitigate disruption and improve profitability is ongoing. With regard to the third quarter, we anticipate adjusted EBITDA margin improvement of 50 basis points to 100 basis points from the 5.6% level we reported in Q2. But as I mentioned earlier, we are taking further pricing actions. That pricing will be reflected late in the third quarter, so as we get into the fourth quarter and our seasonal peak, we anticipate pricing to more fully offset inflation. Importantly, over the full cycle, we expect to be able to recover the entirety of the inflationary headwinds. Before we open up to your questions, I'd like to close with a few comments on how our value proposition is truly resonating with consumers. On Slide 11, we've included survey results from June, showing that consumers are making changes to reduce their spending, which include embracing store brands and the value that they represent. And that once they begin to try these brands, the vast majority of survey respondents are highly satisfied with the quality that they offer and, importantly, they intend to keep purchasing store brands. History would tell you that during periods of economic downturn, private label gains trial, new consumers and, as a result, share increases. Historically, these periods have been step changes for private label. Today, private label is positioned significantly better than in past periods of economic downturn. First, the quality and assortment of private label has improved dramatically. And second, the retail landscape has also changed dramatically. Today, there are also retailers whose private label programs not only drive traffic but play a key role in their store image. And finally, retailers are more committed than ever to their private label strategies and are making meaningful investments to support their store brands. When you combine the focus our commercial teams have placed on the customer, the operational improvements we've made over the last several years and the investment and effort we are putting towards labor and supply chain disruption, we are in an excellent position to continue our top line momentum in the second half of the year. I'm excited every day by the contributions I see across our organization, and I'm excited about the opportunity we have in front of us to drive long-term sustainable growth. With that, let's open the call up to your questions. Steve, in the press release, there's a bunch of discussion about the pickup in sort of increasing private label demand and your ability to sort of get after some of those opportunities, particularly in Snacks & Beverages. And so the demand is across the private label segment, and I think we commented in the scripted remarks about the growth in private label across the categories we participate in. And so with the economy in a more normal and the consumer in a more normal away-from-home standpoint, those businesses are doing well. So the demand is incredibly strong in Snacking & Beverages, it's strong across all of them, but we are a bit more disrupted in Meal Prep. And then I guess turning just back of the envelope, it seems like fourth quarter EBITDA margins would need to be sort of in a more like the 13% range or so. And that's not out of line, I guess, with what the company posted even in the fourth quarter of '19. And I appreciate there's incremental pricing coming through, but maybe you can take us through like a little bit more of a bridge and kind of how you get there in the fourth quarter and sort of what your visibility is, more importantly, to those key bridge items. The other is our seasonal peak, as you normally see, we typically have an increase in profit in that process. And then we are starting to see gradual improvement in our supply chain, as you saw in this quarter, and we expect to continue to see some of that as we think about labor and comp material constraints fizzling. So getting those right people, keeping those right people, training and turning them is really expensive and very disruptive. So on the labor side, I feel good about it, and we're making slow steady progress. We don't think it will be perfect, but we do think it's going to get dramatically better. And then on input costs, I mean, certainly, there's been some relief in the market over the past month or 2. Should I look at that -- I imagine especially some of your seasonal items and with the packing and what have you, a lot of your costs, you're probably locked in for the remainder of the year. And again, I understand the overall cost basket is still higher, I'm just talking more about actual inputs. Maybe I'll touch on it, and Pat can follow up. You're right, we have to own that stuff, and we have to have it in production to get that ready. So most of that impact, I think, will happen later in the year. There may be a tiny bit of it in the fourth quarter, but we do have to own it. I'm sure there'll be some little nonhedgeable stuff that hits us, but we have that in our forecast. We're seeing, obviously, very strong pricing coming through from your business. I think the gaps, as we spoke to in the prepared remarks, are solid, which tells me we have a little bit more room and the retailer has a little bit more room to move. And so that's why I feel so good about not just the fourth quarter, but as we roll into next year. But again, Chris, I would say it's all over the map in our category, some were ahead of us and some were behind us. There should be, I guess, some weight, if you will, mathematically on the margin from pricing. But with PNOC being flat, I was surprised the margin was still down year-over-year. It shows you how tough the operating environment is, and that's why I think we feel so good that if we'd start to make progress there, which we're seeing, that's the key to the margins returning. Steve and Pat, a follow-up on the PNOC question. But the objective of the pricing, I guess, is to get to level. So I guess then the follow-up there is, edible oil prices on the commodity markets are down. As you know, what we own isn't always aligned exactly where the commodity markets you would see are. And I think we had a question earlier, we have to build a lot of that inventory, Rob. And so, yes, there are mechanisms to get a little bit of savings. But can we help the customer a little bit, maybe. But most of that's going to come in next year, the lower priced product or lower cost raw materials. Yes, Rob, that's right. I mean as we've talked about in the past, we have to demonstrate to our customers a level of cost in order to go justify that pricing. And so as we catch up in Q4 relative to commodities that we've bought, that's what we would expect to see. But for the fourth quarter, we expect that number to be positive. I think -- it's hard to say this, but I think the last real economic recession we had was 2008, 2009. With the way we're positioned today, I would think that will be better. And I'm wondering how you're thinking of if that will happen again this year, whether you have kind of a range that you could talk about for free cash for the year and capital allocation going forward, how you expect to allocate that and what your priorities are. We didn't guide cash flow this year, but I think directionally, your statement is right, as you think about cash generation being highest in Q4 as we move through the back half of the year and we have our seasonal peak. As we think about kind of capital allocation, I think it's going to be consistent with how we thought about this before as we continue to strengthen our balance sheet, think about leveraging our debt or deleveraging our debt and then moving forward. And we still feel really good about our cash flow even though inventory is going to be a little more expensive, as you know. I think -- well, first of all, I'll jump back to you. I mean we -- as you know, we have, I think, 6 more years on those. So that looks really, really attractive today. So we're proud of those, we'll hang on to them. But with regard to M&A, there's some small stuff out there, I think. Quite frankly, with the leverage loan market so tight, I think most of the sponsor-led stuff is on pause. And I would just like to thank you all for being with us today, and we look forward to the opportunity to see you in person soon."
}