{
    "symbol": "MTH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 16:56:05",
    "content": " With homebuyers on a  about when to get back into the market, our fourth quarter sales orders declined 46% year-over-year driven by a cancellation rate of 39%. As we had a net order absorption pace of 2.2 per month in Q4, we have taken additional actions to get back on our target, including lowering prices and utilizing a full range of incentives such as mortgage rate locks, rate buydowns until we find the market clearing point to move our inventory and get back to our target sales pace. While we certainly don't have a crystal ball regarding what cancellations rates will do in 2023, we are comfortable that the buyers who purchased homes in earlier March 2022 under a different market and economic environment represent a smaller portion of today's backlog compared to a greater portion coming from buyers that have a more fulsome understanding of the current market conditions, their monthly payment expectations and the relative advantage of their rates and pricing incentives. Our fourth quarter 2022 sales orders of 1,808 homes were comprised of 89% entry-level homes, up from 82% in the fourth quarter last year. Our fourth 2022 average absorption pace was 2.2 per month which was down from 4.5 per month in the fourth quarter of 2021 but gross sales pace was 3.6 per month at our 3 to 4 monthly target, affirming the underlying consumer demand is indeed present. We ended the period with nearly 4,900 spec homes in inventory or an average of 18 per community as compared to approximately 3,200 specs or an average of 12.3% in the fourth quarter of 2021. The 380 bps deterioration grew 29.8% a year ago was the result of greater incentives and higher direct costs as well as several nonrecurring items, including $10.9 million and warranty adjustment related to 2 specific cases and $4.2 million in write-offs for option deposits and due diligence costs for terminated land yields which were partially offset by $5.4 million in retroactive vendor rebates. We However, with our sales ASP down 10% to $389,000 this quarter when compared to last year, we've already taken material pricing action, demonstrating our commitment to elevating our sales pace. We still believe that long term, our normalized gross margin will benefit from better operating leverage from our increased volume and our streamlined operations and will end up at or above 200 bps from our historical average of 20%, although the next several quarters are likely to be bumpy. Overall, higher claim closing volume, combined with the lower outstanding share count in the current quarter, led to a 13% year-over-year increase in fourth quarter 2022 diluted EPS to $7.09. I'm wondering if there's anything that would kind of perhaps even offset that, if you're thinking about trying to hit a 21%, 22%, it could even still be above that, given some of the lower construction costs."
}