{
    "symbol": "CEIX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 17:40:18",
    "content": " The Pennsylvania Mining Complex shipped 6.2 million tons in Q2 of '22, and for the second consecutive quarter, achieved the highest quarterly average coal revenue per ton sold since CEIX became an independent public company in 2017. Financially, CEIX achieved a Q2 '22 adjusted EBITDA of $216 million and generated $160 million in free cash flow. Coal production at the Pennsylvania Mining Complex came in at 6.2 million tons in Q2 of '22, only slightly below our Q1 '22 performance despite multiple longwall moves in the second quarter compared to zero in the first quarter. As such, we sold 6.2 million tons of PAMC coal at an average realized revenue per ton sold of $72.18 in Q2 of '22 compared to 5.9 million tons at $44.02 in the year ago period. Third, we maintain full access to our current $400 million revolver through its current maturity at the end of March 2023, which allows us to rebuild liquidity, while continuing to aggressively reduce debt and initiate a shareholder return program sooner. We will continue down the path of significant debt reduction towards achieving our goal of approximately $300 million of aggregate growth stat  Additionally, in the quarter, our unrestricted cash balance increased by nearly $40 million, despite our significant debt reductions, bringing our total unrestricted cash to $262 million at the end of June 2022. Additionally, for the PAMC, we are improving our 2022 sales volume guidance range to 24 million to 25 million tons, as the operations ran very well in the first half of 2022, and the transportation bottlenecks have gradually improved since the end of 2021. In order to kick off the program, we are also pleased to announce that the Board of Directors has elected to pay a special dividend of $1 per share on August 24 to all shareholders of record as of August 16 based on our Q2 '22 results and excess free cash flow generation. We also announced this morning that in conjunction with the initiation of the shareholder return program, our Board of Directors has increased its previously authorized repurchase program to an aggregate amount of up to $600 million and extended the duration of the program by two years to December 31, 2024. And then although we haven't announced guidance, I think it would be safe to assume that we will expect a year-over-year improvement in terms of our production sales longs  which would give us, let's just call it, six-plus million tons of our production left to sell, which I will tell you, we have the majority of that earmarked for the export markets."
}