{
    "symbol": "LSI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 15:10:04",
    "content": " Additionally, our focus on revenue optimization resulted in same store achieved rate growth of 20% over last year, with occupancy accelerating through the second quarter to end with an average of 94%. As a result of these strong operating fundamentals, we achieved core funds from operations of $1.65 per share for the quarter, which is a 37.5% increase over last year. Including joint ventures, our third-party management portfolio totaled 385 stores at the end of the second quarter, growing 13% over last year, and it continues to be a source of off-market acquisition opportunities. Last night, we reported quarterly core funds from operations of $1.65 per share for the second quarter, an increase of 37.5% over the same quarter last year and well above the high end of our guidance. Same store realized rents per square foot were up 20% year-over-year in the second quarter, representing the continuation of double-digit rate growth for the last four quarters. Same store operating expenses grew only 4.3% for the quarter versus last year's same quarter and were primarily driven by credit card fees, repairs and maintenance and utilities expense. The net effect of that same store revenue and expense performance was a 370 basis point expansion in quarterly same store net operating income margin to 73%, resulting in year-over-year growth in same store NOI of 25.4% for the second quarter. I think if -- when you look at where we're going to end the year, it's stronger than we thought three months ago. Would be below last year's record but still above our historical typically, at the end of the year would be about 90%. But street rates during the quarter on average were 7 point -- almost 8% higher than they were a year ago, subsequent to the quarter end, slightly negative in July compared to last July, but very high from a historical level. And I think you've seen the sector, given the strong pricing power and demand and high occupancy that the sector is able to push through more rate increases, and you're seeing move outs start to pick up, and that's across the sector."
}