{
    "symbol": "LSI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 14:58:15",
    "content": " As a result of the strong operating fundamentals, we achieved adjusted funds from operations of $1.73 per share for the quarter, which is 26.3% increase over last year. These joint ventures enabled us to participate in top markets and quality properties that provide future upside with a moderate capital investment Including joint ventures, our third-party management portfolio surpassed 400 stores at the end of the third quarter, growing more than 12% over last year with the addition of 25 stores this quarter. Now turning back to the quarter, last night we reported quarterly adjusted funds from operations of $1.73 per share for the quarter, an increase of 26.3% over the same quarter last year, and well above the high-end of our guidance. Third quarter same-store revenue increased 14.9% over the third quarter of 2021, primarily driven by increasing rental rates, although we are seeing a return to more normal seasonal trends, we remain highly occupied, especially when compared to pre-pandemic levels, same-store occupancy averages 93.1% during the quarter. We continue to benefit from strong rate growth in the quarter, primarily driven by our in-place rate increased strategies that led to a significant increase of 17.1% in our achieved same store rates per square foot over the same quarter from one year-ago. The net effect of that same-store revenue and expense performance was a 214 basis point expansion in our quarterly same store net operating income margin to 72.8%, resulting in year-over-year growth in same-store NOI of 18.4% for the third quarter. We continue to have no significant debt maturities until April of 2024, when $175 million becomes due, our pro-forma average debt maturity is 5.8 years and our weighted average interest rate is 3.4% at quarter end. I mean, we're probably on the wholly owned side going to probably not be too active for the remainder of the year, unless we start seeing cap rates continue to move higher, which I don't think will happen. I think the 5%, 5.5% range is probably the highest that a seller will be willing to trade, but we have the leverage to work with our JV partners, and we've been very active this year, close to $0.5 billion in deals with our JV partners, and we'll continue to use that option if we don't feel comfortable doing wholly-owned deals. And your same-store revenue growth has, I mean, it's outstanding, but it is decelerating, which is not a surprise, it's probably decelerating about four points over the past couple of quarters each quarter and your fourth quarter implied guidance calls for about 10%."
}