{
    "symbol": "HQY",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-07 23:55:35",
    "content": " I don’t know what deals will be concluded in the second quarter, third quarter, or fourth quarter, but we do even after this current transaction, we’ve -- transactions we have a little bit of powder left for those kinds of things and for those kinds of portfolio type things, and we won’t hesitate to go forward if we think they’re strong return for shareholders, so that’s kind of where I am at right now. There just is a lot better focus and people are making choices and we want to win them all, but sometimes leaders will say it’s better almost to get it know we’re going in a different direction, then put this on hold for another year, because it kind of resets the clock and we’re pretty confident that when people even if they don’t choose HealthEquity, they’re going to choose us at some point and I think we’ve just seen a lot more of this positive intent to make choices move ahead, continue to offer health savings accounts and other CDBs to their membership base. But if you really think about the whole the whole aspect of our custodial and service revenue line items, it’s almost starting to feel, when I think about deals of signing off on as a blend of it, because I’m thinking -- to that particular customer and that’s even more so true when you think about bundling sales together and finding opportunities to have more profit there essentially being able to get better pricing on certain things in the service fee area to increase the amount of margin that we’re able to take off of those. So I think you’ll continue to see that a little bit and to the extent that, like, Jon said, over the long-term, we can get rates to rebound that creates a huge opportunity for us and I think it’s not going to be anything that’s going to be an extreme amount of the decrease relative to that service revenue line item."
}