{
    "symbol": "HQY",
    "quarter": 2,
    "year": 2022,
    "date": "2021-09-08 22:47:06",
    "content": " And so I think, I feel good about where we ended up for the first half of this year in that regard, we'll see what others have to say you know, Devon year and others as they print, but certainly relative to the prints you've seen that that feels like it's the case. And we did take a little bit off the table for the second half of the year and thinking about this just cause like, we don't know what's going to happen, but overall we're kind of, as I think this was said a couple of times in the prepared remarks, and then we kind of feel like we've, we've plateaued at this level. I think sequentially, you know, you're in, you're specifically stating that there's, I mean, I would be pretty consistent when you think about, you know other things like commuter interchange, obviously interchange, we call it out as more stabilized commuters, you know, pretty flat sequentially, if you will, other than maybe the card swipes, starting the app and with the users that are already in there, but that's pretty small. However you want to think about and apropos Ted's last answer, looking more specifically at this period this year know, basically look at the first half you've got if you just divide services like total account you've, you're down 5% year over year. I could, and I'm sure you'd like it, but what I, I think here, here's the way I'd look at it is if you look at the first half of the year, we opened 295,000 HSHS and, you know, grew CDB business by about 3%. And you know, that's a great implication, but we have to deliver on it and delivery on it involves, I think in practice three factors, the first is, is you know, kind of running through the finish line in terms of sales, particularly with, you know, our health plan partners that, that get the sales later in the year with smaller customers and so forth. And one of the things that's, I think, remarkable and you know, we will, as I, as iconic that entitle average on a little bit in the call or in the prepared remarks, I should say you know, we, we, we the I'm going to focus on fifth, third per second, fifth, third will be closed pretty shortly here. I'm wondering if you can talk a little bit about what you're seeing in terms of the competitive environment on the whole you know, there's obviously one large competitor out there that some people focus on, but on the flip side, there's, it's a fragmented market and there's a lot of players that probably aren't being super aggressive."
}