{
    "symbol": "HQY",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-06 23:31:05",
    "content": " Adjusted EBITDA of $61.1 million was flat year-over-year, 13.3 million total accounts at quarter's end, we're plus 6% versus a year ago, and as in recent periods total accounts exclude commuter accounts in suspense. HSA members at quarter's end reached 6.2 million, up 14% from a year ago, including 11% organic growth plus new HSA members from the transition of Fifth Third 's portfolio just before the end of the quarter and HSA assets at quarter's end reached $16.4 billion, up 32% from a year ago, including 28% organic growth and approximately $490 million in Fifth Third assets transition. Investing HSA members at quarter's end, we're up a remarkable 43% with 74% growth in investors -- invested assets from a year ago. Your line is now open. Your line is now open. And it's for those reasons that we think we're in a better position from what the terms of our placements are going to be going into -- both going into fiscal '23 and then at the end of fiscal '23 into '24, that we're feeling quite a bit more sure - footed and optimistic, that we can meet the promises that we have more or less made to you over the course of time, with regard to the likely shape of these yields. Your line is now open. Your line is now open. Your line is now open. And I think it's this topic for sure, but it's also all of the various ways that you can, as an employee of one of our clients, optimize your benefits, and we're investing heavily in getting you to do that, educating you in multichannel ways, both with marketing in the actual product itself and then in member services when you call, just sharing with you what's the next best thing for you to be doing. Is that when you look at and you can see this even in the further -- I'm sorry, HSA administrators business that's been very focused on individual investors and these very small groups of folks who were totally onto this, where you see your average total balance of 15 to 20 grand, of which give or take 3 quarters is invested and 1 quarter is cash with -- and so I think that's where you would expect it to end up. Your line is now open. And so a lot of energy, I think it's been pretty well illustrated in our numbers we reported that the HSAs are growing and there's some mixed results on the CDBs, largely because some are rolling off, but I can tell you every time that we bring on an employer and they have a bundle full of CDBs, then we start to do our education and really start to bring people over to the light of a retained value account that doesn't go away when they change employment. And so I think that's one of the reasons why you're seeing some of the FSA s and things like that going down but I would -- a lot of energy, Scott, is the way I would classify that. I was just going to say, as I commented before, and I'll say it again, I think it's really important, is that when I think about where we replaced -- we're placing things a year ago versus now because we do have assets come forward and our Cordell goes in place with them, so we know the rates. It's still a long-term view on those rates coming up on assets, helps from not only next year being will be lower still because we placed at higher rates, two or three years ago, but again, you're starting to turn that corner and as John said too, we're not going to be below those all-time lows that saw as part of the last recession, but it takes multiple years to turn that around, based on the way that we ladder, it helps going down. Your line is now open. The other one that's really there too, I guess, you're making you think of some other things, and these are I know, Allen, we've talked about these things before, but you think about the custodial revenue and the margin generated by that, and the 36 basis points of decline of that yield year-on-year. Your line is now open. Well, I think there's -- no, when you think about CDBs, and of course we talked about some of the things you're turning, but it's really just that Commuter segment. Your line is now open. Wondering with regards to the rate discussion, as we think about next year, Jon when you were you were answering Peter's question, you mentioned the 152 bps and the low I'm wondering, how do we think about that relative to the enhanced rate program because it sounds like one way of interpreting things would be, \"Hey, we're going to stay steady in terms of the effective yield for '23. \""
}