{
    "symbol": "DARE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 23:16:05",
    "content": " Our plan today is to review our full year results, discuss development since our last call in November and use the time to review our business strategy, including why we believe investment in women's health is efficient and disproportionately impactful and to highlight some important objectives and milestones anticipated in 2023. We announced that we completed enrollment in our Sildenafil Cream female sexual arousal disorder Phase IIb study and we announced 2 positive Phase I/II study top line readouts, one for our hormone-free vaginal atrophy treatment candidate, DARE-VVA1; and one for our 28-day vaginal ring hormone therapy candidate for the vasomotor symptoms in menopause, DARE-HRT1. Thus, given those statistics, with 12 development stage candidates in our portfolio, we like our odds of generating value for our shareholders and the disproportionately impactful investment, a women's health product candidate can potentially represent particularly given that a number of our candidates are in the contraceptive, menopause and sexual health categories, all of which have seen over $1 billion and even over $2 billion individual brand, including the potential of our sexual health program, Sildenafil Cream, since there is yet to be an FDA-approved product for arousal disorder in women, the most analogous condition in women to erectile dysfunction in men. With more than 5 milestone events anticipated in 2023 that we will discuss shortly, 3 candidates in or nearing Phase III development, 2 potentially transformative transformational collaborations with leaders in women's health product commercialization, Bayer and Organon and 1 FDA-approved product XACIATO. Following clinical development, we intend to leverage the existing safety and efficacy data on the active ingredients in DARE-HRT1, estradiol and pedestrone specifically to utilize the FDA's 505(b)(2) pathway to obtain marketing approval of DAIR-A2T1 in the U.S., that pathway that 505(b)(2), that's the same pathway we use for XACIATO. Based on pre-IND communications with the FDA and the top line pharmacokinetic or PK data from the DARE-HRT1 Phase I/II study, we believe FDA approval of DAER-HRT1 for that indication is achievable via that 505(b) pathway supported by a single placebo-controlled Phase III clinical trial of DARE-HRT1 and a scientifically justified PK bridge basically via relative bioavailability trial between DARE-HRT1 and the selected listed estradiol and progesterone drugs. Following clinical development, we intend to similarly leverage the existing safety and efficacy data on the active ingredient in DARE-VVA1 tamoxifen and again, to utilize the FDA's 505(b)(2) pathway to obtain marketing approval of DARE-VVA1 in the U.S. As we continue to engage with the FDA on the IND process this year, we'll provide additional updates on the time line to Phase II. So first of all, as we've said before and John highlighted just today, right, we look at each of our products on an individual basis and further with 12 development stage candidates in our portfolio, we certainly have a lot of flexibility in terms of how we think about go-to-market strategy because we have such a broad portfolio in women's health, all the same call point that there comes a time where it's not a single product going to market, it's multiple products on market at the same time, potentially, right, as you think about the portfolio as it advances. And ideally, because these hormones are not efficiently metabolized through the oral route to -- and therefore, you have to give really higher doses, right, when you're dosing orally and non-oral route can have benefits but you really want both hormones So we're excited about HRT1 because there's not been a product yet that does that in this convenient once a month, both hormones together, vaginal form, you're delivering them in that route administration. And I'm looking at the time and thank everyone for your time this afternoon to hear about our recent updates and our ongoing commitment to driving value for all of our stakeholders, the women, the health care providers, our shareholders, with our diversed portfolio, we really seek to bring to market differentiated prescription therapies that prioritize women's health and wellbeing, expand those treatment options were not exist enhance the outcomes where current standard of care has meaningful sure comings and improve ease of use for women where a more compelling form factor can drive adoption. -- and our focused efforts to deliver differentiated innovation in women's health, as we talked about, it resulted in our 12 development stage programs across 9 distinct indications, the more than 5 milestones anticipated for this year 2023, the 3 candidates and are nearing Phase III development, our 2 potentially transformational collaborations with the leaders in women's health product commercialization Organon and our first FDA-approved product, XACIATO. So we're talking a lot about this Sildenafil Cream, Phase III RESPONSE study top line results, the U.S. launch is XACIATO by Organon, the initiation of our pivotal study of Ovaprene, the IND-related activities that we were talking about for DARE-HRT1 and DARE-VVA1 and importantly, the Phase III and Phase II, respectively, clinical study initiation plans and DARE-PDM1 Phase I study top line data that we're looking forward to this year as well."
}