{
    "symbol": "BNGO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 20:16:05",
    "content": " I would like to remind everyone that certain statements made during this conference call may be forward-looking, including statements about Bionano's revenue outlook, strategic and commercialization plans, anticipated benefits or improvements to Bionano's products, including the Saphyr system and NxClinical software, anticipated milestones for 2022 and the advantages of the Saphyr system over current technologies and Bionano's expectations regarding study results and anticipated benefits of these studies in driving adoption of OGM. We counted some 42 publications on optical genome mapping, or OGM, in the quarter, and we announced publication of the first readout of our ongoing clinical study in postnatal genetic diseases, which reported strong data that we believe will allow completion of the study this year. And if we are able to continue penetrating these segments and growing our installed base, we believe that we'll validate optical genome as a method that's gaining widespread traction in the field, which can play an important role in influencing the various agencies that evaluate, for example, applications for reimbursement of OGM-based tests or consideration of OGM in various guidelines set by medical societies. Another important component of validation that comes with increasing the installed base would be if OGM users develop their own assays and validate them as laboratory developed tests, or LDTs, or similar types of assays outside the U.S. And those agencies include ones like the American Medical Association, Centers for Medicare and Medicaid Services, World Health Organization and others with the evidence that there is an established need in the field that optical genome mapping could impact. Now once NxClinical 7.0 is available, with the integration of optical genome mapping, we believe this capability will drive more adoption of OGM solutions that we've already had data presented from Augusta University that shows the importance of combining sequencing and OGM analysis in this way, especially in hematologic malignancies."
}