{
    "symbol": "PRU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 14:53:03",
    "content": " Businesses; Scott Sleyster, Head of International Businesses; Ken Tanji, Chief Financial Officer; and Rob Axel, Controller and Principal Accounting Officer. In addition, this presentation may include references to non-GAAP measures. Businesses; Scott Sleyster, Head of International Businesses; Ken Tanji, Chief Financial Officer; and Rob Axel, Controller and Principal Accounting Officer. In addition, this presentation may include references to non-GAAP measures. Our robust financial position includes: a high-quality, well-diversified investment portfolio; a capital position that supports a AA financial strength rating; and $3.6 billion in highly liquid assets at the end of the first quarter, as well as over $4 billion of additional proceeds from divestitures that we have already received in the second quarter. Results of our U.S. businesses increased 12% from the year ago quarter and reflected higher net investment spread, including benefits from variable investment income and rising interest rates, more favorable underwriting, primarily due to declining COVID-19-related mortality experience and lower expenses, primarily driven by our cost savings initiatives, partially offset by lower fee income resulting from the runoff of our legacy variable annuities. PGIM experienced third-party net outflows of $4.3 billion in the quarter as institutional net inflows, driven by fixed income and real estate, were more than offset by retail outflows, driven by mutual fund investors rebalancing out of fixed income due to rising rates and inflation expectations. PGIM's asset management fees increased by 2% compared to the year ago quarter, reflecting positive third-party flows and a continued shift towards higher fee-yielding strategies, including the benefits from recent acquisitions over the past year, partially offset by the impact of rising rates. Notably, across PGIM's private platform, we deployed nearly $10 billion of capital, up 20% from the year ago quarter, reflecting the continued strong environment for both real estate and private credit. To get a sense of how our second quarter results might develop, we suggest adjustments for the following items: first, variable investment income outperformed expectations in the first quarter by $275 million; next, we adjust underwriting experience by a net $165 million. While we have provided this placeholder for COVID-19-related claims experience, the actual impact will depend on a variety of factors such as infection and fatality rates, geographic and demographic mix and the effectiveness of vaccines; and last, we expect other items to be $95 million lower in the second quarter, primarily as a result of completing the sales of both our full service retirement business and a block of legacy variable annuities. Your line is now live. Your line is now live. Ken, a question on the holdco cash and just overall capital generation in the quarter, if I look at the -- it looks like you issued $1 billion of junior debt in the quarter, so that would be an inflow, and you got $300 million of cash from the dispositions, and I guess, $4 billion-plus is still closed after the quarter, but that's $1.3 billion. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}