{
    "symbol": "PRU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 12:32:02",
    "content": " Our third quarter financial results reflect the impact of market conditions, including the variability in alternative investment returns and lower fee income, as well as an elevated level of COVID-19 hospitalization claims in Japan, partially offset by underlying business growth, including the benefit from rising interest rates. In addition to the investments in our businesses that I previously mentioned, we also returned over $800 million to shareholders during the third quarter through dividends and share repurchases and for a total of $7 billion since the beginning of 2021. Pre-tax adjusted operating income was $1 billion or $2.13 per share on an after-tax basis and reflected lower variable investment income driven by market conditions and an elevated level of Japan COVID-19 hospitalization claims, partially offset by underlying business growth, including a benefit from rising interest rates. Results of our US businesses were lower than the year-ago quarter, reflecting lower spread income due to less favorable variable investment income and lower fee income resulting from the sale of a portion of the legacy variable annuities business, the decline in equity markets and net outflows, partially offset by more favorable underwriting as COVID-19 transitions to an endemic level in the US. Our cash and liquid assets were $5 billion at the high end of our liquidity target range after investing in our businesses to support long-term growth, including the capital to support our IBM pension risk transfer transaction. Your line is now live. Hey, Tom, it's Charlie. Your line is now live. I'm wondering, given your progress to-date and thinking about market opportunities, do you feel like you need to elongate the three-year timetable of reallocating $5 billion to $10 billion of capital to higher growth less market-sensitive business. For instance, in the third quarter, our Retirement Strategies business did nearly $15 billion of sales, including a significant PRT transaction that demonstrate our leadership position in this market where we believe there's just tremendous growth potential going forward. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. But we had -- at the time of the second quarter, we had -- we're well-positioned to absorb that capital requirement within PICA, including the -- using the cash flow and statutory surplus that's being generated by our businesses. Your line is now live. Your line is now live. Your line is now live. Hey, Tom, it's Charlie."
}