{
    "symbol": "PRU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 12:45:16",
    "content": " Our GAAP net loss was $1.4 billion lower than our after-tax adjusted operating income, primarily driven by the mark-to-market impact from higher interest rates on derivatives that are used for asset liability management, partially offset by a gain on the full -- on the sale of our full service business. Results of our US businesses were lower than the year ago quarter, reflecting lower spread income due to less favorable variable investment income and lower fee income resulting from the decline in equity markets, partially offset by more favorable underwriting. The decrease in earnings in our International Businesses primarily reflected lower earnings from joint venture investments, lower net investment results driven by less favorable variable investment income and less favorable underwriting results, partially offset by business growth. PGIM benefited from its diversified business mix, as strong institutional net inflows of $8.1 billion, primarily driven by fixed income, offset retail outflows as investors repositioned their portfolios in a rising rate environment. This adjustment includes a placeholder for COVID-19 claims experience in the third quarter of $5 0 million for our International Businesses, primarily due to hospitalization benefits for policyholders recovering from COVID-19 at home in accordance with the special regulatory provision in Japan that is currently in effect. I'll note that if you exclude items specific to the third quarter, earnings per share would be $2.75, a modest decline primarily due to lower fee income as a result of market depreciation, lower underwriting income due to the updated actuarial assumptions, and continued COVID-19 mortality that is now reflected in our US Businesses expected results. Our cash and liquid assets were $7 billion and above our $3 billion to $5 billion liquidity target range, due to the receipt of proceeds from the sales of our full service retirement business and a block of legacy Variable Annuities and other sources of funds include free cash flow from our businesses as well as contingent capital facilities. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}