{
    "symbol": "D",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 12:44:03",
    "content": "  Operator: Good day, everyone, and welcome to the Dominion Energy Fourth Quarter 2022 Earnings Conference Call. I would now like to turn the call over to David McFarland, Vice President, Investor Relations. Earnings materials, including todayâ\u0080\u0099s prepared remarks, contain forward-looking statements and estimates that are subject to various risks and uncertainties. Please refer to our SEC filings, including our most recent annual reports on Form 10-K and our quarterly reports on Form 10-Q for a discussion of factors that may cause results to differ from managementâ\u0080\u0099s estimates and expectations. Joining todayâ\u0080\u0099s call are Bob Blue, Chair, President and Chief Executive Officer; Steven Ridge, Senior Vice President, Chief Financial Officer; and Diane Leopold, Executive Vice President, Chief Operating Officer. During 2022, we delivered earnings and dividend growth in line with our guidance, provided safe, reliable and affordable energy while demonstrating careful environmental stewardship, served our customers and invested in our communities, and made meaningful progress on our regulated investment programs focused on decarbonization and resiliency. As shown on slide 3, our employee OSHA injury recordable rate continues to compare favorably with the Companyâ\u0080\u0099s long-term historical results as well as national industry and regional electric utility averages. Next, on reliability, which our customers consistently indicate is their highest priority. In the past year, customers in our electric service areas in Virginia, South Carolina and North Carolina had power 99.9% of the time, excluding major storms. As they do time and time again, our colleagues rose to the challenge and kept our system delivering without major or extended interruption during these demanding load conditions. The scale of our team and resiliency of our system were never more evident than during the December winter storm, when we also did not experience any major or extended service disruptions. As we discuss later, weâ\u0080\u0099re very focused on ensuring that our customers are not priced out of the significant long-term benefits that will result from our decarbonization and resiliency investment programs. On that same theme, 2022 was a significant year in terms of advancing our regulated decarbonization and resiliency strategy. In Virginia, the State Corporation Commission approved several rider-eligible investment programs, including our offshore wind project, subsequent license renewals of our four nuclear units, our second clean energy filing of new solar and energy storage projects and Phase 2 of our grid transformation program. Additional rider-eligible investments currently under SCC review include new solar and energy storage projects and our third annual clean energy filing, and high-voltage electric transmission necessary to continue to serve growing customer demand and data center load. In South Carolina, we achieved our second best year ever for service reliability. In December, Moodyâ\u0080\u0099s upgraded Dominion Energy South Carolinaâ\u0080\u0099s credit rating, citing evidence of the Companyâ\u0080\u0099s â\u0080\u009cimproved regulatory and stakeholder relationshipsâ\u0080\u009d. In our Gas Distribution segment, we invested over $300 million, modernizing infrastructure that is safer, more reliable and better for the environment. We completed our LNG peaking supply facility in Utah, and we increased the number of our renewable natural gas projects in operation or under construction to â\u0080\u009821. Our fleetâ\u0080\u0099s performance continues to be exemplary, especially in periods of extreme weather, during which our stations provide vital stabilizing support to the grid and price stability in their respective regions. In summary, the regulated decarbonization and resiliency investment opportunity that weâ\u0080\u0099ve outlined on previous earnings calls will continue to play a key role in driving the long-term growth of the Company for years to come. Before transitioning to comments on the business review, let me also highlight progress around our sustainability goals. Iâ\u0080\u0099m pleased to report that through 2021, weâ\u0080\u0099ve reduced Scope 1 carbon emissions from our electric operations by 46% since 2005 and Scope 1 methane emissions from our gas operations by 38% since 2010. Notwithstanding the strong performance, we recognize the need to look holistically at our companyâ\u0080\u0099s footprint, which is why during 2022, we expanded our net zero commitment to include all Scope 2 emissions and the material categories of Scope 3 emissions. Finally, we increased the diversity of our workforce to 37%, an increase of nearly 4 percentage points since 2019, while also increasing our procurement spend with diverse suppliers to over $1.3 billion, representing 17% of our supplier spend, an increase of 4 percentage points since 2019. Now, let me turn to the top-to-bottom business review. When we announced the review in November, I indicated that we would be guided by the following principles as shown on slide 5. And as a result, weâ\u0080\u0099re able to provide additional commentary on how we believe we should optimally position Dominion Energy at the conclusion of the review, to create maximum long-term value for our shareholders. First, a focus on delivering durable, high-quality and predictable long-term earnings growth profile. Second, we believe it is critical to position our regulated utilities to earn a fair and competitive return on investment. Third, we know it is our responsibility to constantly look for ways to optimize the efficiency of our operations without losing sight of the absolute necessity of meeting high customer service standards. In recent years, weâ\u0080\u0099ve driven down cost through improved processes, innovative use of technology and other best practice initiatives. As part of the review, we are evaluating what we can additionally do on costs within the context of the significant operational and cost efficiency we have achieved over the years. As part of the review, weâ\u0080\u0099re analyzing the most efficient sources of capital to fund our growth programs while seeking to minimize any amount of ongoing external equity financing need. Iâ\u0080\u0099ll note here our announcement this morning that the 2023 dividend, subject to Board approval, will be equal to the 2022 dividend. We believe that it is important to achieve potentially over time and without reducing the dividend, a payout ratio consistent with our current 65% ratio. Since the announcement, weâ\u0080\u0099ve spoken with hundreds of equity and fixed income investors and received valuable and direct feedback, much of which has affirmed our focus on these priorities. Given that the review is still underway, we have and will continue to refrain from providing that guidance until the review is complete. In addition, there is legislation that would, subject to commission approval, provide for a passive equity partner in our offshore wind project. In terms of timing, as shown on slide 6, the Virginia General Assembly is scheduled to adjourn on February 25th. In the case that the Governor amends or vetos a bill, the legislation returns to the general assembly for what is typically a one-day reconvened session on April 12th. At that time, the general assembly may vote to override a veto or accept or reject amendments proposed by the Governor. Therefore, legislation timing will influence the cadence at which weâ\u0080\u0099re able to share more details about the business review in the future. Let me reiterate my confidence that weâ\u0080\u0099re executing a thorough, expeditious and comprehensive review with the goal of ensuring that Dominion Energy is best positioned to create significant long-term value for our shareholders, our customers and our employees. With that, Iâ\u0080\u0099ll turn it over to Stephen to address financial matters before I provide further business updates on the execution of our plan. Our fourth quarter 2022 operating earnings, as shown on slide 7, were $1.06 per share, which for this quarter represented normal weather in our utility service areas. Positive factors as compared to last year were weather, normal course regulated growth, the absence of the Millstone planned outage, absence of last yearâ\u0080\u0099s COVID deferred O&M and tax timing. Full year 2022 operating earnings per share were $4.11 per share, slightly above the midpoint of our guidance range for the year. Here, Iâ\u0080\u0099d highlight one adjustment, which is described in Schedule 2 of the earnings release kit. In connection with the business review, management has reviewed the unregulated solar portfolio that reports to our contracted assets segment. These approximately 30 solar facilities, representing around 1,000 megawatts operate primarily under long-term power purchase agreements with third parties. Consistent with prior commentary, the Company no longer intends to invest in unregulated solar projects for purposes of generating investment tax credits or ITCs. As a result, the Company impaired the portfolio in the fourth quarter and recognized a noncash charge of $1.5 billion. Given the pending business review, we are not providing full year 2023 earnings guidance nor are we refreshing our long-term capital investment plans at this time. For the first quarter 2023, we expect operating earnings to be between $0.97 and $1.12 per share. Positive year-over-year changes include growth in regulated investment, higher sales and higher Millstone margins. Negative changes include higher interest expense as a result of higher rates, as I will touch on more in a moment; lower DEV margins for certain utility customer contracts with market-based rates; a hurt from pension and OPEB as a result of 2022 asset performance; higher depreciation; the absence of solar investment tax credits; and O&M and tax timing. And just briefly as it relates to pension, Iâ\u0080\u0099d note that our pension funded status at year-end was 108%. Turning to slide 9, let me address electric sales trends. Components of this growth include a slight decline for residential, as you would expect, with continued back to the office trend and higher growth for the commercial segment driven by data center customers in Virginia. For 2023, we expect to remain above our long-term demand growth assumption of 1% to 1.5% per year, as Bob will touch on more in a moment. Since our last call, weâ\u0080\u0099ve bolstered our liquidity at DEI with an opportunistic long-term debt issuance of $850 million late last year and a 364-day term loan facility of $2.5 billion, which we closed last month. These financings provide incremental flexibility, including to address first quarter maturities, which are described in the appendix of todayâ\u0080\u0099s materials. We maintain a level of floating rate, typically short-term debt at our holding company and operating segments, primarily to fund working capital as well as more permanent capital needs between long-term fixed rate issuances. Since this time a year ago, weâ\u0080\u0099ve seen our borrowing costs on this part of our capital structure increased by about 400 basis points. We will provide an update on rate assumptions, interest expense, hedging strategies and other mitigants when we conclude our business review. In aggregate, as of December 31st, we have an under-collected balance of approximately $2.5 billion in fuel costs across the Company. As weâ\u0080\u0099ve discussed previously, we donâ\u0080\u0099t want our customers to miss out on the significant long-term benefits of our decarbonization and resiliency investment programs as a result of temporary cost pressures such as fuel. Turning now to credit, which Bob highlighted as one of our business review priorities. Over the last several years, we have taken steps to position Dominion Energy as an increasingly pure-play, state-regulated utility with a differentiated clean energy transition profile. And as a result, weâ\u0080\u0099ve improved our business risk profile. Despite this meaningful qualitative improvement, our Moodyâ\u0080\u0099s published CFO pre-working capital to debt, one of the primary quantitative metrics used to determine our credit rating, has underperformed our downgrade threshold for the last several periods. Moodyâ\u0080\u0099s has indicated publicly that under the status quo, they expect that underperformance to persist. As Bob mentioned, we want to emerge from the review with the ability over time to consistently meet and exceed our downgrade threshold even during temporary periods of cost or regulatory pressure. Finally, as shown on slide 10, we intend to provide a business review update this spring with final timing to consider the status of the Virginia legislative process. As Iâ\u0080\u0099ve discussed in previous earnings calls, the strength of our Virginia service area economy supports our robust capital investment programs at DEV. The Dominion Zone continues to be the highest growth rate among all zones within PJM, covering 13 states in the District of Columbia. This growth, primarily driven by data center loads, which have been increasing at an unprecedented rate, will require significant new capital investment. Second, last month, Amazon announced its plans to invest $35 billion by 2040 to establish multiple data center campuses across Virginia. These new campuses will combine expandable capacity to position Amazon for long-term growth in Virginia and create an estimated 1,000 jobs. Data centers currently represent about 20% of our total sales in Virginia and have provided strong sales growth to date, a trend supported by these two announcements we certainly expect to continue. For example, we filed for a new 500 kV transmission line with the SCC with an expected in-service date of late 2025. In December, the SCC approved the cost sharing settlement agreement developed in collaboration with key stakeholders, including the Office of the Attorney General and other parties. In particular, we received the draft environmental impact statement, which started the 36-day public comment period that will close later this month. Project costs, excluding contingency, are currently 80% fixed and we continue to expect about 90% of the project costs, excluding contingency, will be fixed by the end of the first quarter. We expect the EIS record of decision in late October of this year, slightly later than expected because of the DEIS timing, but still in support of our current project schedule. Next, our Jones Act-compliant turbine installation vessel is currently 65% complete. As part of our ongoing resource planning, Dominion Energy South Carolina is replacing several of our older generation peaking turbines with modern, more efficient units. These peaking units which often operate seasonally during certain times of day when the demand for energy is at its highest, play an important role in our generation fleet with their ability to go from idle to producing energy quickly. Modernizing this equipment will lower fuel cost to customers, improve environmental performance and provide reliability and efficiency benefits. Next, at our gas distribution business, we continue to see strong support for timely recovery on prudently incurred investment that provides safe, reliable, affordable and increasingly sustainable service including pipeline replacement efforts and expansion of service to rural communities. For example, in December, the Public Service Commission of Utah approved a general rate increase of $48 million, and an allowed ROE of 9.6%. In this constructive outcome, they also approved the continuation of the infrastructure replacement tracker programs and the costs related to our natural gas storage project in Utah, Magna LNG, which was placed in service at the end of last year and will be used to meet system reliability for customersâ\u0080\u0099 gas supply in the Salt Lake City area. When we launched this business, we did so on the strength of the underlying project economics, and the very robust decarbonization benefit of agricultural renewable natural gas. If the projects are deemed eligible for tax incentives, we would expect to capture that value on behalf of our shareholders. Our offshore wind cost sharing settlement agreement was approved, which allows the project to continue moving forward on schedule and on budget. So just starting, Bob, with the business review priorities you kind of discussed in the prepared remarks and you kind of laid out on slide 5, specifically kind of on the dividend comment. I mean, obviously, we understand that you guys are holding the dividend at the current level for obvious reasons and thatâ\u0080\u0099s obviously consistent with your support for the dividend. But I guess, what is the language around quote unquote potentially over time mean as we think about the payout ratio bounds in the near term. So, any sort of visibility you could provide would probably be a reprieve. Our current payout ratio of 65%, to the extent that that were to go up, our expectation and plan would be to return to 65% without cutting the dividend. But if it is above 65%, our expectation is to get it back to 65%, without cutting the dividend. The first was to develop expertise in developing solar so we could employ that expertise credibly across our regulated footprint, which is what weâ\u0080\u0099re doing right now. We believe given the attractiveness of our decarbonization and resiliency capital investment opportunity, the capital weâ\u0080\u0099ve used in the past to generate those ITCs can be employed elsewhere to greater long-term shareholder benefit. That led to a subsequent impairment test, where we looked at the carrying value or book value and we compared it to a series of discounted and non-discounted cash flows consistent with accounting guidance and ultimately determined that the fair market value was lower than the carrying value, and that led to the impairment. Itâ\u0080\u0099s way too early to predict what the timing of the Virginia General Assembly and any action on any particular bill, including ones that relate to us, may be. If he chooses to propose an amendment or veto a bill, then the general assembly, as you noted, comes back for a one-day reconvened session, and then they address those gubernatorial actions. So, I canâ\u0080\u0099t give you any more clarity because we donâ\u0080\u0099t know what the time frame on the general assembly may be. Could you -- you say youâ\u0080\u0099re kind of both targeting high-BBB, but then also seem to imply kind of targeting above current thresholds, which I think your ratings are mid-BBB at the parent. So, on an issuer rating, weâ\u0080\u0099re actually high-BBB at two of the three rating agencies. Our objective is to maintain those targeted rating categories, and the downgrade thresholds, at least at Moodyâ\u0080\u0099s associated with that is 14% on the down and 17% on the up. As we mentioned in the call script, we intend to meet and exceed that downgrade threshold even in times of temporary pressures from cost like fuel costs and regulatory adjustments. And the appropriate downgrade threshold, at least from the Moodyâ\u0080\u0099s perspective, is 14%. So youâ\u0080\u0099re basically targeting the ratings youâ\u0080\u0099re currently at, not a higher rate in your current...\n Thatâ\u0080\u0099s right. And then just on the payout comment, just to maybe clarify that a little better, which I know at this point in the process is purposely probably -- purposely vague. But what weâ\u0080\u0099re saying is, to the extent that the payout ratio changes as a result of the review that if theyâ\u0080\u0099re -- an obvious point, if our EPS changes as a result of the review and the dividend remains constant as we have said it will, that changes the payout ratio. And what weâ\u0080\u0099re indicating is if there is a change in the payout ratio, weâ\u0080\u0099re going to get back to it, but without reducing the dividend. And as we have indicated in prior calls and this call as well, we donâ\u0080\u0099t yet know what the outcome of that business review will be. Again, we canâ\u0080\u0099t set that until weâ\u0080\u0099re finished with the review. I just want to pivot a little bit, if I could, towards Millstone here, interesting backdrop here. As weâ\u0080\u0099ve talked about before, we believe Millstone is a great asset, and we believe the policymakers in New England are recognizing increasingly its value for them to meet reliability and any chance to meet the kinds of decarbonization targets that they may have. As we noted in our opening comments, the existing Millstone contract has been very good for customers in Connecticut in recent months and over the last year. But as it relates to potential asset sales, was just wondering, does the solar impairment kind of a tip that you might look to sell this asset as part of the business review. And I guess, weâ\u0080\u0099re at with news out of Black Hills this morning with regards to their thoughts on LDC sales. Jeremy, I would say that as part of the review, weâ\u0080\u0099re looking at each and every one of our assets and Consistent with the priorities and principles that weâ\u0080\u0099ve laid out on todayâ\u0080\u0099s call and supplement to what we provided on the third quarter call. Thatâ\u0080\u0099s what will inform our ultimate steps as it relates to the business review to the extent that there is changes to business mix, which is, again, something weâ\u0080\u0099re evaluating as part of review, but no decisions have been made. So, weâ\u0080\u0099ll look at everything dispassionately to position the Company to provide the greatest long-term value to shareholders. Let me do it from the reverse perspective, which is the Investor Day, we intend to provide a comprehensive business and financial update. The spring update, which is going to coincide with timing around the Virginia legislative session, will give us an opportunity to comment on what, if any, changes occurred during the session that would impact Virginia, what our perspective is on that, and how that informs the appropriate next steps of the business review. So, I know like that could impact your future earnings if you decide not to invest, I guess, thatâ\u0080\u0099s what youâ\u0080\u0099re suggesting. But when I look at the Q1 â\u0080\u009823 to Q1 2022 bridge on slide 8, there is a down arrow because of solar ITC. The impairment does have a slight impact on the depreciable life, because -- or the depreciation rather than the depreciable life, because the carrying value is now lower than previously assumed. The bridge, when we refer to that ITC, solar ITC, itâ\u0080\u0099s effectively the lack of solar ITCs, consistent with the comments weâ\u0080\u0099ve made on this call and previously with regard to pivoting that capital allocation elsewhere in our business. So, itâ\u0080\u0099s effectively simply saying that a year ago, we would have had some solar ITC in earnings this quarter this year, we do not have that. And then, sort of a bigger picture question following on to Jeremyâ\u0080\u0099s question, and I appreciate the fact that youâ\u0080\u0099re in a strategic review at the moment. But just maybe even anecdotally, Bob, as you look at this, you -- I think Steve made some comments around the need for significant balance sheet repair, if weâ\u0080\u0099re going to get above that 14% -- meaningfully above that 14% FFO to debt ratio. The best priority I could give you is that our objective, as we have already described is to strengthen the balance sheet, with the goal of using the most efficient sources of capital without -- with the ability to minimize external equity needs. Beyond that, Ross, weâ\u0080\u0099re doing a review of every line of business. And once weâ\u0080\u0099re finished with that, weâ\u0080\u0099ll be able to outline the ways that we will go about addressing the balance sheet. And then 2023 guidance, I think your comments were that youâ\u0080\u0099re just -- youâ\u0080\u0099re not going to provide it sort of for the full year given the strategic review. Ross, I anticipate weâ\u0080\u0099ll be providing quarterly guidance as we go through the year. With regard to using our first quarter guidance as a guide, I would just say thereâ\u0080\u0099s a couple of things. On our third quarter call, we provided a pathway to our 6.5% growth in 2023, much of thatâ\u0080\u0099s not changed. The other major change -- really the only other big change besides a little bit of tax timing in the first quarter that we wouldnâ\u0080\u0099t -- weâ\u0080\u0099d expect to balance out through the remainder of the year is interest rates, which effectively in the guide we gave on the third quarter call, suggested that interest rates up 2% to 3%. Those rates have now gone about 4%, which takes that sort of 15-ish midpoint to more like $0.30. I would note that over time, we expect that interest rate headwind to ameliorate as I think most people do, unsure exactly what the timing of that will be."
}