{
    "symbol": "TSP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 11:00:27",
    "content": " Later, we will conduct a question-and-answer session and instructions will follow at that time. Keep in mind, that this call is being recorded and there will be a replay available at ir.tusimple.com following this call. I would now like to turn the conference over to Ryan Amerman, Head of Investor Relations for TuSimple. We appreciate your flexibility especially during earnings, while we would have preferred to host the call yesterday, logistically it just wasnâ\u0080\u0099t possible. With us today are TuSimple's Interim Chief Executive Officer, Ersin Yumer; the Interim Chief Financial Officer, Eric Tapia; and the Chairman of TuSimple's Board of Director, Brad Buss. As a reminder, TuSimple shareholder letter and a replay of this call will be available on the Investor Relations page of our website. This call is being recorded, if you object in anyway please disconnect now. Please note that TuSimple's shareholder letter, press releases, and this call contain forward-looking statements that are subject to risks and uncertainties. We will also discuss non-GAAP financial measures, which are not prepared in accordance with generally accepted accounting principles. Please refer to the Safe Harbor disclaimer and non-GAAP financial measures presented in our shareholder letter for more details, including a reconciliation of the non-GAAP measures to the comparable GAAP measures. My name is Brad Buss, and Iâ\u0080\u0099m the new Chairman of TuSimple's Board of Directors. Before becoming Chairman of the Board, I served as the Lead Independent Director as well as the Chairman of the Audit Committee. Before we go much further, I want to provide a brief update in changes in the company. Accordingly, the Board removed Xiaodi Hou from his positions as Chief Executive Officer, President and Chief Technology Officer of the company as well as being replaced his Chairman as the Board of Directors. This necessary departure became effective Sunday October 30, 2022. We also appointed Ersin Yumer, who has been our Executive Vice President of Operations as Interim CEO and President, while we conduct a search for a permanent CEO. I want to be very clear that safety, transparency and accountability are critical values to our company, and we take these values extremely seriously. Based on the ongoing investigation, the company also believes that during 2022, in conjunction with the company's evaluation of Hydron as potential OEM partner. Furthermore, as of the time of this call, the company believes that based on information obtained in connection with an ongoing investigation by the Audit Committee, during 2021 certain employees of the company spent 8 hours working on matters for Hydron without disclosing this to the Audit Committee as required by company policy. The company believes that such paid hours had an estimated value of less than 300,000 that they are above the value required for an SEC disclosure. Both of these matters are detailed in our Form 8-K filed with the SEC yesterday, October 31. The decision to terminate the CEO is independent of the Wall Street Journal article, and was made in connection with an ongoing internal investigation launched by the Audit Committee in July. Furthermore, we lost trust and confidence in Xiaodi's judgment, decision making and ability to lead as the company CEO. We would like to make it crystal clear he is doing this as an individual, not as a Board member. He is not authorized to make any statements on behalf of the company, and we are disappointed in his lack of judgment in decision making and making these unauthorized statements. Again, I want to be very clear the Board and the management team take the responsibilities of this company under our CFIUS agreement extremely seriously. That includes protecting the data that is at the heart of this company, and there will be accountability for anyone who breaches this trust. But we also know that the technology developed at TuSimple's works, we have proven it through the world's first driver out autonomous free test runs, and we are on the path to commercialization. And due to the nature of this situation, we will not be able to take any further questions related to this subject only during the Q&A. I will now hand it over to Ersin, who will discuss some highlights for the quarter and enhancements we're making to our AFN operations. Good morning, and welcome to our third quarter earnings call. Today, I'd like to start by acknowledging how difficult the past few days have been for all of our stakeholders, for our investors, employees and partners. I look forward to working closely with the Board and Management to continue on our mission to provide reliable, low-cost freight capacity, while setting a new standard for fuel efficiency and safety. Today, I'd like to highlight what we are doing to build transparency on safety with our stakeholders, discuss additions we have made to the AFN, provide an update on a key partnership. And finally, discuss key initiatives we have in place for the rest of this year and next, that will move us towards our goal of initial commercialization in 2023. Going forward, we will highlight the processes and initiatives we employ as we work to bring take autonomous technology to the market. Additionally, I'm pleased to announce we will be partnering with multiple independent auditors that are recognized within the industry to conduct audits verifying various aspects of our technology and operations from a safety perspective. These will include processes and procedures for our hiring, training, and on road testing. While this is not a requirement today, we believe we are leading the industry with these audits. Ultimately, through safe engineering, testing and development, we have the opportunity to save thousands of lives every year. Over the last few months, we have had some exciting additions to our AFN as we continue expanding our presence in Texas. Phase one of this terminal development is expected to be completed in the first quarter of 2023, and this terminal will play a key role in supporting our capacity plan in Texas. The location is route of I-45, a major interstate connecting Dallas to Houston. With the addition of these two properties, we have the assets we need to support our patients in the Texas triangle, then the safety case is validated. Adding to our track record of industry first, this past quarter, our partners  announced a fully autonomous run powered by TuSimple technology that transported commercial goods in regular traffic conditions between logistic costs. The truck travelled about 300 kilometers in Sweden, with the first and last mile being handled manually. Next, I'd like to provide you an update on our program with an U.S Class 1 railroad. Last quarter, we discussed unplanned road construction that caused us to have to rework a route in Arizona and adjust the destination point. After much consideration, both we and our partner has decided it makes the most sense to relocate this freight move from Arizona to Texas. And given the terminal additions to our AFN, we now have the capacity in place to support our plans for the foreseeable future. As we consistently stated, cost per mile reduction is a significant focus for us. First, a uniform fleet of trucks provides us flexibility in how we utilize the trucks for testing and revenue generating mile. More importantly, however, we expect the upgrade will result in a more recognized and reliable autonomous system, which is a key requirement in removing the support vehicles and providing substantial opportunity to reduce our cost per mile. With these upgrades, we are utilizing a greater percentage of hardware that is automotive or new automotive grade. And to ensure that our autonomous systems last for many years on the road, we have added testing capabilities for factors like heat, cold and migration that will help us validate the expected failure rates of certain components. Next, I'll discuss some exciting developments in our operations. Historically, our revenue fleet was run separately to work with our transportation partners and introduce them to our autonomous technology, while our test fleet was focused on advancing our technology and driver milestones in Arizona. Now that we have reached our initial driver-out milestone, I began the process of combining our revenue and test into one autonomous operations. This gives us the flexibility in how we utilize the fleet for servicing our customers, as well as for maturing the technology. For the next couple of years, we will continue working to reduce cost per mile. In the short-term, this has the potential to lead to a year-over-year decline in revenue mile. However, we believe it is the prudent decision as we expect to move down the cost curve, enabling our technology to become commercially viable more quickly. And now I will hand it over to Eric, to discuss the financials. This quarter, our reservation count held steady at 7,500 trucks. However, after the quarter closed, we did receive a 100 truck order from a new partner. We reported $2.7 million of revenue in the quarter, a 49% year-over-year increase and 4% sequentially. The potential performance, though, was primarily driven by better utilization of our brand new fleet. While we continue to perform in line with our full year revenue guidance, it's important to highlight Ersin's previous comments regarding revenue miles. That said, as we continue to upgrade the fleet and gradually shift to the Texas Triangle, we expect near-term revenue headwinds as a major focus on commercialization. We spent $86 million on total R&D this quarter, including $17 million of stock paid compensation for SBC. Excluding the impact of SBC, R&D increased 8% sequentially as we continue to invest in our technology, R&D assets and core tech talent. We will continue to invest in commercialization of our world-leading technology and key talent, while managing our R&D dollars as efficiently as possible. On the SG&A front, we spent $31 million during the period, including $6 million of SBC. Excluding the impact of SBC, SG&A was up 32% sequentially. As a reminder, in the second quarter of '22, we had favorable account true-up of $4.4 million. Excluding this item, SG&A was up 7% sequentially, primarily due to higher legal costs in the third quarter, partly offset by the impact of several cost reduction initiatives. Our loss from operations was $120 million in the third quarter of '22, up 3% versus the same period last year and up 8% sequentially. Our adjusted EBITDA loss in the third quarter of '22 was $94 million, up 16% versus the same period last year and up 13% sequentially. In the third quarter of '22, we had $4.8 million of CapEx, primarily related to truck-related equipment and hardware as well as facility investments in our AFN. We ended the third quarter of '22 with cash, cash equivalents and short-term investments totaling approximately $1.07 billion, down 8% sequentially. I expect that 2033 will be a big year for TuSimple, and I look forward to continuing to update you with our program. Your line is open. And this is more on kind of the business side, but I think it's important for shareholders to get a sense of your confidence in how you're all thinking about moving the company forward in the commercialization and strategy and time line. Thanks for the question. First of all, our commercialization plans in terms of our strategy in 2023 is not changing with the recent changes. Given that, we are feeling confident that we can hit our milestones that we have laid out, and we will be updating you on these milestones in a lot more details in the upcoming months. And just to echo, I think from the Board's perspective, we are really excited on the strategy. I mean the people, the technology, the commercialization plan, everyone is in sync, it isn't going to change. So I know you can sometimes see CEOs, oh my gosh, things are changing, but that is not going to happen. So we are currently upgrading, in fact, the first truck in the newest upgraded hardware series, and we haven't run that on the road yet. And just to add and rest assured that in the upcoming months, as we are getting ready and computing our 2023 financial plan, we'll share more -- a lot more details and time lines around what is the CapEx spend on the upgrade and when do we expect to have this truck in circulation because that will definitely be a key driver for our revenue target, which again, we will share out in a future date. Your line is open. Thanks for the question, Ravi. So, of course, we have been doing vendor selection for quite a while right now, and we have been working with our supply base to ensure that the supply is as much ready as possible for these upgrades starting these months and rolling into 2023. So currently, we do not see big hiccups in terms of our supply for these upgrades, both internal parts that we are producing as well as the external ones. And we took -- they started with a large number of supply strength  and then during these tests in the past couple of months, we have been reducing our supply base down and then putting the orders in. So like I mentioned, we do not really expect big hiccups. But if that happens in later days for unexpected reasons, we will of course update you. And just to connect it to the financial performance, so some of the uptick that you saw this quarter on CapEx is actually related to not only facility upgrades, but long lead supply chain items for our trucks. Again, just to address the need to offer this trucks and a lot of it will also spill into 2023. And maybe as a follow-up, again, I know you said you wouldn't take direct questions on this, but maybe there's a bit of an adjacency. I know it's early days yet, but just trying to get the plan. Of course, on some of these statements, Xiaodi's name is listed as an inventor, but the patent rights are belonging to the company. Your line is open. Or maybe just talk about that, please. So just to address the flat headcount part for this quarter, this was actually us making sure that we are very careful with our spending and financials. On the other hand, the talent retention side, this has been a very significant focus for me in the past couple of months. I have been trying to be very connected and high touch with our employee base in our three main locations, San Diego, Tucson and Dallas. We will keep doing this, and we will get some help from our Board as well. But of course, our people are our biggest asset, and we will make necessary investments to keep that employee base with us. So at this point, we are not ready to share more details until the fourth quarter call. But again, we will share more details as we -- once we share fourth quarter results, and when we talk about '23 plans in the next coming months. Your line is open. And then specifically for Ersin, the incident in April was classified as a human error on the last call. Thanks for the question. As you know, we have been very engaged in the last couple of months with our stakeholders in terms of opening up and making them understand our processes from a safety perspective as well as the technology. What we would like to achieve is to, both for ourselves as well as for our stakeholders, get an independent assessment on different processes, procedures as well as our -- different aspects of our technology. Now using multiple -- potentially multiple auditors, as you mentioned, it is because different aspects of the technology or operations might require different expertise. On the April 6 event, we actually mentioned this in our interactions with the federal NHTSA and FMCSA as well that it's not only a human error, but there is also software and system-related failures that had happened at the same time. So we have provided an update to the software to prevent these failure as well as the future  just to close this, we actually never mentioned that it's just a human error from our perspective. And then, Brad, I know you don't want to take direct questions on this, but wanted to see if you could at least give us some context as to why the Board lost confidence in trust in Xiaodi and the firing was determined based on the 8-K to be without cause, even though there's an ongoing investigation, so a little hard to square those two. Yes, I mean there's not really a lot I can add there. I mean for cause, there's fairly high standards on materiality levels that generally go with that. And then I think the confidence point is it's just a lot of little things that have came up, and we will just go on from there. The key is I think we made a good decisive decision, and we are moving forward and nothing is changing with our strategy. I mean from my end, there's been nothing significant. I mean we've been pretty focused on the earnings and obviously, we are not pleased with the stock market reaction, but we are committed to moving the company quickly forward. Your line is open. No, and certainly there's -- all our key partners are very important to our trajectory. And again, we believe we can  our vision and what we are going to do as a company, and we convey that to our customers and our partners. So we are letting them know that very clearly, hey, it's literally just a CEO change, not a strategy change. And quite honestly, they work directly with everyone below the CEO level very, very closely. And then, I guess, Brad, you've been involved in some boards that had to gone through some tough situations. Obviously, you're going to find the right person as the new CEO, go through a whole process on the CFO as well and gets this right. Your line is open. Could you give us some more detail around the ramp of the self-driving projects, specifically the time line for the removal of the support vehicle you had talked about kind of second half '23. And then on the call, you were talking about the hardware upgrades that are ongoing. The removal of the support vehicles is something we are actively working on in parallel with the current hardware as well because as you might imagine, there are technology-related parts of this that are not necessarily only the hardware. On -- at the same time, the hardware upgrades are continuing in parallel as well. I mean off the top of my head, it just makes me think that you're just focusing more on Texas instead of kind of expanding geographies. So because of this commercialization goal, we did want to move the target into Texas so that we can move towards commercialization while hitting this goal with the partner. With advanced lanes, we will be able to really scale maintenance operations, really scale other technicals that really support the AFN, right, versus one-off , right. So for us, we think that, that density, that depth in the infrastructure and depth with customer could allow us to reach our commercialization goals a lot faster. Your line is open. So our process is progressing, but we have no material updates to share at this point. The change is not going to impact any of the decisions, just to be clear, that we have a process. And then just, I guess, one quick point -- like the release yesterday indicated all the guidance was reiterated. And maybe if we could sort of just -- to give a little bit of a peak into '23, you're burning about $100 million a quarter. So high level, we stand by our revised guidance that we showed in Q2, as we said in the letter. In terms of expectation for '23, as I mentioned earlier, we were not -- based on our status of  plan, we are not ready to share more until we share fourth quarter results. I would say same trajectory that you've seen over the last quarters, right, where we are focusing on deploying capital with the most important milestones and keeping discretionary cost at bay. But you can expect that same thing, disciplined  but we will share numbers in the next couple of months . Your line is open. No, this is not driven by any customer driver. Again, it's more about what I mentioned earlier. And so I just wanted to understand, it seems like you're adding fewer trucks next year as you're trying to minimize cash burn. One of them is, of course, we mentioned the hardware upgrades. What we are really focusing on is to bring our cost per mile down, and cost per mile is something that we have introduced in the Analyst Day back in May. And you might remember us talking in detail there, but we are going to keep updating you on this. And therefore, we are changing how we operate during this particular phase of going to the initial commercialization. And just to chime in, to answer your question about tech, we foresee no slowdowns on our tech. Again, as we are upgrading trucks, but we will still focus on running the trucks with the upgraded systems for current system. Yes, on the revenue potentially, but not on the testing capabilities. In addition, you mentioned 75 trucks, again, that's our expectation to this year. But again, we will share more on our '23 plans. As I stated earlier, we understand that the last few months have been challenging for all of our stakeholders. We are committed to ensuring that we hold ourselves to the highest standards, setting this company on a trajectory towards long-term stability and success and update you with our progress. Ladies and gentlemen, this concludes today's conference call."
}