{
    "symbol": "PRFT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 16:43:14",
    "content": " Services revenue, excluding reimbursed expenses were $228.8 million in the fourth quarter, a 9% increase over the prior year, and year-over-year organic services growth was 6%. Net interest expense for the fourth quarter decreased to $0.8 million from $3.9 million in the prior year, primarily as a result of adopting the new accounting standard for convertible debt in the first quarter. Net income increased to $26.5 million for the fourth quarter from $4.5 million in the prior year, primarily due to the loss from extinguishment of debt of $28.7 million in the prior year and improved operating performance. Services revenue, excluding reimbursable expenses were $893.1 million for the year ended December 31, 2022, a 19% increase over the prior year. SG&A expense for the year ended December 31, 2022 was $171.1 million compared to $152.4 million in the prior year. Adjusted EBITDA for the year ended December 31, 2022, was $205.8 million or 22.7% of revenues compared to $162.9 million or 21.4% of revenues in the prior year. The year ended December 31, 2022, included amortization of $24.5 million compared to $23.5 million in the prior year. Net interest expense for the year ended December 31, 2022, decreased to $3.2 million from $14.1 million in the prior year, again, primarily as a result of adopting the new accounting standard for convertible debt at the beginning of the year. Net income for the year ended December 31, 2022, was $104.4 million compared to $52.1 million in the prior year, primarily as a result of higher revenues, lower costs as a percent of revenues, lower interest expense and loss from extinguishment of debt of $29 million that was included in the prior year. So a lot of the growth that we're enjoying from offshore and near-shore is not only new relationships, clients, which almost always involve some level of offshore right on the gate, right at the beginning, but also actually in existing accounts, and relationships that we've had 10, 15 years, we've actually been able to take share away from some of the larger offshore competitors."
}