{
    "symbol": "PRFT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 13:40:06",
    "content": " Later, we will conduct a question-and-answer session, and   I would now like to turn the conference over to your host, Chairman and CEO, Jeff Davis. With me on the call today is Paul Martin, our CFO; and Tom Hogan, our President and COO. We got, as typical, about 10 to 15 minutes of prepared comments, after which we will open up the call for questions. Thanks, Jeff, and good morning, everyone. Actual results may materially differ from those discussed in these forward-looking statements, and we encourage you to refer to the additional information contained in our SEC filings concerning factors that could cause those results to be different than contemplated in today's discussions. At times during this call, we will refer to adjusted EPS and adjusted EBITDA. Our earnings press release, including a reconciliation of certain non-GAAP financial measures to the most directly comparable financial measures prepared in accordance with generally accepted accounting principles or GAAP, is posted on our website at www.perficient.com. We have also posted a slide deck, which includes a reconciliation of certain non-GAAP guidance to the most directly comparable financial measures prepared in accordance with GAAP on our website under Investor Relations. Revenue was up 31%, and adjusted earnings were up 38% during the period. Utilization was strong and on the heels of setting a quarterly large wind bookings record in Q4, we again set a record in Q1. In fact, just 2 weeks ago, a customer I had not previously interacted with much, reached out to me directly to share how wonderful our team is performing on behalf of our organization. We routinely received positive feedback through our client insights program, which solicits real-time feedback at various stages throughout the project life cycle. But when a CEO proactively reaches out directly to complement our team and offer to serve as a reference, that really underscores the value we're delivering. So as our brand grows and word spreads within accounts and between accounts and with end markets and between markets, current customers are offering us more opportunities and new clients are asking us to propose on more work than ever before. Organic offshore revenue grew 49% in the quarter, and offshore revenue overall grew 111%. In fact, it's that fully integrated global delivery model that is the primary catalyst behind our performance. You may recall a few years back, we began to articulate our intentions to transform Perficient into a truly global entity to bring the world's best technology talent to the strong client relationships we've forged via a longstanding and ubiquitous domestic presence. We've done just that, and it's paying real dividends. Our clients now benefit from a seamless, blended experience where skilled colleagues a world away, support them collaboratively with other proficient experts for just atmosphere. Offshore ABR gains were impressive as well, up 3% sequentially and 13% versus the prior year period. Remarkably, even in the midst of tremendous booking success, our pipeline continues to replenish. And in fact, right now, we're pursuing nearly 200 7-figure deals. Our talent acquisition function continues to shine, rapidly hiring talent into new roles to support our aggressive growth. And our scale, coupled with increasing ABR, is enabling us to offset wage increases despite the tight labor market. So on all fronts, a great quarter and a great start to 2022. Services revenue, excluding reimbursed expenses, were $219.5 million for the first quarter of '22, a 31.8% increase over the prior year. Services gross margin, excluding reimbursable expenses and stock compensation, remain constant at 38.9%. Adjusted EBITDA for the first quarter of 2022 was $47.2 million or 21.3% of revenues, compared to $34.6 million or 20.4% of revenues in the first quarter of 2021. Net interest expense for the first quarter of 2022 decreased to $0.9 million from $3.3 million in the prior year, primarily as a result of adopting the new accounting standard for convertible debt in the first quarter of 2022. Net income nearly doubled to $27.1 million for the first quarter of 2022 from $13.6 million in the first quarter of 2021, primarily as a result of the higher revenues and gross margin. Our ending billable headcount at March 31, 2022, was 5,833, including 5,420 billable consultants and 413 subcontractors. Our outstanding debt net of deferred issuance costs as of March 31, 2022, was $392.9 million. We also had $24.2 million in cash and cash equivalents as of March 31, and $199.8 million of availability on our credit facility. As Jeff mentioned, after a record-setting quarter bookings to close 2021, our large deal win volume grew again and substantially. We booked 124 deals greater than $500,000 during the first quarter of 2022, which compares to the prior record of 98 set in the fourth quarter of 2021 and 92 from the year ago period. As an example, this past quarter, we closed one of the largest deals in company history with a large private health insurance company. We've had a 12-year relationship with this client, and our team has demonstrated true partnership as we digitally transform their product offerings. This 2-year extension of services includes agile, rapid development, fully digital teams. Our U.S.-based industry leaders coupled with multi-shore engineering teams will support digital development, testing and support for the company's member experience and mobile applications. As you know, we're a proven digital partner within many industries, not just health care, obviously. As an example, we also recently secured a 3-year agreement to provide website and content support for an international holding company that operates as the owner of a leading brand of trucks and diesel engines. Through this agreement, our multi-shore delivery teams will support the company's 30 public-facing web properties and work closely with our digital marketing team to provide content updates across the organizations portfolio. We continue to remain well diversified from a customer, industry and platform perspective. We're always going to ensure we're providing the flexibility and work-life balance we all need, but it's really been invigorating to see our teams return, collaborate in person and see smiles replacing masks. I'm also excited that during the quarter, we launched 2 more of our Bright Paths programs in key markets. We've already fully trained and hired 67 colleagues to this innovative program, which is providing new futures for deserving and ambitious members of under-represented constituencies and communities. As we scale and continue to increase our influence and impact on behalf of the world's biggest enterprises, we also remain focused on growing the positive change we can make in the world around us. And with that, I'll turn things over to Jeff to discuss the second quarter and the remainder of 2022. Second quarter GAAP earnings per share is expected to be in the range of $0.71 to $0.74, and second quarter adjusted earnings per share is expected to be in the range of $1.04 to $1.07. Perficient is raising its full year 2022 revenue guidance to the range of $917 million to $942 million, raising 2022 GAAP earnings per share guidance to the range of $3.08 to $3.19 and raising 2022 adjusted earnings per share guidance to the range of $4.24 and to $4.36. Congrats, Jeff, on a strong start to 2022. And for the second quarter, the midpoint, I want to say, is around 17%. And then the same for the year, it's about 17% at the mid and just below 20% at the high. Actually, and I'm going to ask Tom to add some color to this, but the team has done a remarkable job, our talent acquisition team. In terms of kind of hedging, if you will, we're really focused on still Latin America as well as South Asia, primarily India. But given the uncertainty there right now, we're kind of holding on that. Mayank, we definitely have increased the capacity of our talent acquisition team globally, not just in the United States, but in Latin America. And in India, as Jeff mentioned, we're looking at additional cities. So we see a lot of organic growth potential in the year, as Jeff mentioned, we're relatively small in the big scheme of things in the India marketplace. So plenty of room for growth, and our team continues to differentiate ourselves in the marketplace and become the employer of choice. So it's been able to continue to meet demand and proactively hire along the way as well, which is really exciting. We have actually -- I mentioned that North American ABR is at an all-time record, and the increase reflects -- is actually higher, more than the wage increase. I mentioned a 13% increase offshore, that's certainly outpacing wage increases. And so we're pretty optimistic we're going to be able to maintain that again, as the market is contracted on the supply side, customers see that and our competitors see that. Can you talk about the 2 verticals we don't hear as much about, automotive and business services. While these aren't your largest verticals, they've enjoyed some of the strongest growth rates back-of-the-envelope on what you provide in the presentation. Automotive, we've got a couple of phenomenal anchor accounts there. And one is actually one of our largest, might be currently running is our largest account at the moment. It's a long-standing client that we've had for, gosh, I think it's been 20 years. And we're now one of, I want to say, 5 or 6 global suppliers there. But we have a lot of other clients beyond that within automotive manufacturing, similar story, big, big anchor account there, long-standing relationship is going very, very well and expanding. And then actually, we didn't -- we talked about this some, but it's worth mentioning again, really starting to see some great traction in tech within fin serv. We've always had a great strategy practice, business consulting practice. But I always have been really underrepresented on the tech side, and that's changed and the team has really worked hard on that, and we're seeing some real dividends there as well. And then maybe one to Paul, just to dig into the numbers. You have about 9% more work being delivered offshore, which obviously is fantastic. But generally, we think of those as higher margin delivery, and you talked about a 90-point improvement on the spreads for labor. So utilization is modestly lower year-over-year, but certainly in line with our expectations and see that strengthening in Q2. Yes, a couple of things, Brian, contribute there as well as we also, as I mentioned, the Bright Paths program. We had a big college program come on and all of those individuals start coming online here as we go into hiring hedge trading, building out the bottom of the pyramid, great utilization here in Q1 by also adding capacity for the second quarter and beyond. So essentially, just to make sure I understand, utilization is only down modestly but some of the people you've hired are not yet counting in utilization as you're preparing for growth. So maybe that's why the margin is flat despite other metrics, suggesting on the other one. Yes, they're mostly actually included annualization, that would be a very small differentiator. Yes, utilization is about 81% last year. And by the way, you might recall that Q1 and Q4 typically are kind of lower seasonally. So it's actually 81%, which was quite good. So on a year-over-year basis, it's down, as Paul mentioned, slightly. We still had a gross margin expansion of about 30 bps, I think. So of that 90, we're seeing about 30 of it. Oh, gosh, it's well into the hundreds. And actually, we have added -- you'll see in Q2, we've had kind of a surge here. Again, we're going to let that utilization rise. But then also, we've had a large influx from both Bright Paths as well as campus recruits that you'll see revealed in the numbers when we report Q2. But -- and actually, Tom might have a comment on that, but it's well into the high hundreds that we've done in the past, actually. So we're still very, very active. Actually, the -- what we're seeing is the opposite in terms of valuation, at least right now. But if anything, it's gone up, there's a lot of -- as I mentioned, there's a lot of competition out there at the moment and valuations remain pretty high. That's not really the issue with a couple of exceptions, by the way, that really just kind of got nutty from my perspective. And -- but directly on the valuation question, I would say we're not seeing it come down, to your point, like we've seen in the public market. It's difficult to do where clients are sort of entrenching existing relationships, and kind of trying your way in there is hard to do. We're getting really, really good success with that. Our win rates, it's interesting. Our win rates against our competition, the typical household names, have not gone down. It's still in the kind of mid-60s, around 60% to 65%. And we expect it, as we increase capacity in sales, that you would naturally expect that to come down as we got more at that. But the reality is, once we get our incredible talent out in front of clients and the sales process, the win rates stay high. So which again, is an encouraging sign about the sustainability of our current growth rates, if not acceleration. And then years ago, you used to kind of talk in the context of your solution area. And it's important, things like analytics consulting, custom product development, kind of those types of buckets. Far and away, custom app dev remains #1. Keep in mind that the vast majority of the time when we're delivering for a client, it's really a multitude of solutions. So when we're doing custom app development, in almost every engagement, there's analytics involved, there's integration involved. And those are -- we sort of measure those as separate services, but in reality, they all fit together. Custom app dev again continues to remain very, very strong. We are seeing more opportunities with some newer technologies, maybe what would have considered a little more niche in the past, and newer platforms. And like I said, the things around that are more complementary probably to that than anything, maybe someone standalone, but it all really fits together like a puzzle. So you talked about signing a lot of clients, 100-plus clients this quarter, then bookings are -- sorry, pipeline is strong. And obviously, we're aware of the macro environment and always nervous about that. But gosh, if you look at our metrics, when you look at our pipeline, it's -- there's no indication there. I mean, it's the best it's ever been and I'm talking about the year-over-year comp is probably the best it's ever been, both obviously in absolute dollars, but also as a percentage. So at the moment, we're not seeing that. Some clients, and I don't think it's a broad macro thing, I think it's more of, again, an individual client-by-client basis. But in a broad sense, knock on wood, we're not seeing that, at least not yet. No, that's good to hear. That's very good, actually. And then your subcontractor mix slowed on sequential basis a little bit, ending headcount was about the same as average headcount. We prefer to have full-time employees, and we leverage subcontractors and very valuable assets, but we leverage them when we have a unique skill set that we don't necessarily have a long-term need for or responsible capacity. So our preference would be to hire full-time employees and reduce the number of subcontractors, both absolutely on a relative basis. And as I mentioned earlier, what's not showing up in those numbers is the large groups that we're bringing in, in Q2, particularly the May graduates that we'll be bringing in. We're having really, really good success differentiating the business beyond compensation and benefits. We're attractive employer, employees like a deal, it's a good culture. Jeff, you had mentioned in your prepared remarks some large deals you're going after, and I missed the size. And also, I'm curious if the average deal size is increasing in your pipeline. It does it not like dramatic quarter-over-quarter, but we definitely add a few percent, if not maybe 10 plus to that number pretty much every quarter. And yes, what I said was that we have 200 deals, over 200 deals that are 7 figures plus, so $1 million plus. And I heard from some that due to burnout of employees, some health care providers are looking to minimize change. Yes, it's a good question. I actually think our health care business is really, really healthy. Now if you look at bookings in Q1, the bookings were substantially higher than revenue growth in Q1. But these folks, both provider and payer, are still so far behind the curve in terms of technology that I still think there's a kind of a must spend and maybe even more pressure on the provider side than on the payer. And we're seeing certainly, digital transformation is in most industries and health care is no exception as being a top priority. So even where they may be reducing budgets elsewhere, they're still spending on that. And in some cases, interesting, your observation about the employee burnout or employee health and middle health maybe. In terms of the margins, yes, the rates and associated costs are lower in India than in Latin America, but the margins are fairly consistent within 5%, 5 points, so maybe it's somewhere around the 50 to 55 range. We are seeing an increase in ABR, particularly standing out in some of the more recent acquisitions that we've done in Latin America, where we've been able to introduce different types of accounts there with different  and relationships, I would say, and have actually driven. So I would say, as Latin America is leading the way, they were probably a little bit underpricing when we did those acquisitions, and that's rapidly changing. And then I'm sorry, this has been mentioned like twice. It's over 200 7-figure plus, yes. You mentioned those are remaining strong around 60%, 65% overall. But when we do sales analysis, that's one of the metrics we look at. And a lot of our relationships, particularly those new ones that I was alluding to, where we're actually able to open up doors, a lot of them do start small. We talk about back during, I think it was 2020, we initiated with a client at around $25 million. I would say there's not -- I can't sit here and say, \"Gosh, a $750,000 deal closes 80% of the time,\" or our win rates are 80% versus 40% somewhere else. Well, that obviously concludes our call. As always, and as you could see, more momentum than ever. Really, really great quarter, a great start to the year. And super optimistic about not just the rest of this year, but the outlook behind that."
}