{
    "symbol": "PRFT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 09:36:04",
    "content": " Services revenue, excluding reimbursed expenses, were $224.9 million in the third quarter, an 18% increase over the prior year. Net interest expense for the third quarter decreased to $0.6 million from $3.5 million in the prior year, primarily as a result of adopting a new accounting standard for comfortable debt in the first quarter of 2022. Net income increased 32.3% to $23 million for the third quarter from $17.4 million in the prior year, primarily as a result of higher revenues, higher gross margins and lower SG&A as a percent of revenue. Services revenue, excluding reimbursable expenses, were $664.2 million for the 9 months ended September 30, 2022, a 24% increase over the prior year. Services gross margin, excluding reimbursed expenses and stock comp for the 9 months ended September 30, â\u0080\u009822, was 40.1% compared to 39.8% in the prior period. SG&A expense for the 9 months ended September 30, 2022, was $127.4 million compared to $110.7 million in the prior year. Adjusted EBITDA for the 9 months ended September 30, 2022, was $151.5 million or 22.5% of revenues compared to $115.1 million or 21.1% of revenues in the prior year. The 9 months ended September 30, 2022, included amortization of $18.1 million compared to $17.7 million in the prior year. Net interest expense for the 9 months ended September 30, 2022, decreased to $2.3 million from $10.1 million in the prior year, again, primarily as a result of adopting the new accounting standard for convertible debt in the first quarter of 2020. Our effective tax rate was 25.2% for the 9 months ended September 30, 2022, compared to 25.3% in the prior year. Net income for the 9 months ended September 30, 2022, was $77.9 million compared to $47.6 million in the prior year, increasing primarily as a result of higher revenues, gross margins and lower SG&A expense, as a percent of revenues. Diluted GAAP earnings per share increased to $2.17 for the 9 months ended September 30, 2022, compared to $1.39 in the prior period. Adjusted earnings per share increased to $3.14 for the 9 months ended September 30, â\u0080\u009822 from $2.49 in the prior year. Perficient is updating its full-year â\u0080\u009822 revenue guidance to a range of $905 million to $911 million, updating its â\u0080\u009822 GAAP earnings per share guidance to a range of $2.85 to $2.90 and narrowing its 22% adjusted earnings per share guidance to a range of $4.25 to $4.30."
}