{
    "symbol": "EDIT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 10:19:08",
    "content": " Using our proprietary engineered AsCas12a nuclease and fix technology, we have developed engineered NK cells that have potent antitumor activity and substantially increased persistence in preclinical models, which we believe could lead to lower frequency dosing an important potential advantage for patients compared to many existing NK cell approaches. Please proceed with your question. Please proceed with your question. Please proceed with your question. while CTX001 may actually be first to market, based on our experience and observation of recent gene therapeutics or so-called one-on-one therapy launches, we anticipate that the pull-through from that CTX001 approval will not actually lead to a large number of treated patients here a large number of untreated patients remain at the time of our launch and commercialization because of the challenges around site capacity, and again, this is what weâ\u0080\u0099ve seen with other gene or one-on-one therapies as well as the challenges around negotiating access and reimbursement. Please proceed with your question. Please proceed with your question. Please proceed with your question. We believe that it has value on its own right, we believe itâ\u0080\u0099s a differentiated product, but actually, very important, we believe that at the time that we both initiate or whether as we continue to recruit patients into our ongoing trials and when we look at the commercial space when we would launch, we believe that going to a number of the challenges Iâ\u0080\u0099ve outlined, the uptake and the number of treated patients will actually be relatively slow, certainly for that first approval because of challenges around access and reimbursement. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}