{
    "symbol": "EDIT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 12:43:05",
    "content": " The readout provided human proof-of-concept demonstrating that EDIT-301 could safely drive expression of fetal hemoglobin to clinically meaningful levels and correct anemia in sickle cell disease patients, and the study continues to progress. Second and third, by leveraging our unique and differentiated approach of 301, we are investing to develop milder forms of patient preconditioning as well as develop an in-vivo approach for editing hematopoietic stem cell cells or HSC, both of which should reduce the burden and improve the journey for patients who currently live with sickle cell diseases and TDT. Since, we shared our strategy update last month, we have completed review of the safety data from the Sentinel patients of the RUBY trial for sickle cell disease and have begun parallel dosing of additional patients. We remain on track to provide an update on the RUBY clinical data at mid-year and dose 20 total patients by year-end, an ambitious but certainly attainable goal. For the first two patients with a severe sickle cell disease, that data for the first patient who had a five-months of follow-up showed clinically significant improvement across all hematological parameters. These preliminary data suggests that Editas has a product candidate that can potentially give robust clinical benefit to patients with severe sickle cell disease, and has the potential for clinical differentiation in the long-term. After completing sequential dosing of the first two patients, we have commenced parallel patient dosing, means that we can now dosing multiple patients simultaneously and we remain on track to dose 22 sickle cell patients by year-end. On the development side, we plan to execute on the following in 2023, providing clinical updates from the EDIT-301 RUBY study in mid-2023 and the end of 2023, which will include longer term data from the initial two patients that were dosed last year, as well as data from additional patients from the ongoing RUBY trial. In addition, dosing 20 total patients in our EDIT-301 RUBY program by year-end, dosing the first patient in the EDIT-301 EDIT trial for TDT this quarter, and finally providing early data in the EDIT-301 EDITHAL trial for TDT by year-end. Thank you very much. And we are actually also looking for somebody who has significant important collaborative leadership capabilities for working with Baisong, our Chief Medical Officer with Bruce Eaton, our Chief Technology Officer, and the executive team to help us in driving the selection of future therapeutic targets and target tissues in which we will combine a number of elements, including the technology and the probability of technical success, as well as the probabilities of clinical regulatory and commercial success. Thank you very much. Thank you very much. Thanks very much, Baisong. Thanks very much, Baisong. Thank you very much."
}