{
    "symbol": "PEAR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 13:52:03",
    "content": " Our evidence suggests long term durable clinical outcomes for those with SUD and OUD treated with reSET and reSET-O respectively, while also reducing the need for many of the more costly consequences of addiction, we are eager to share cost savings data in the coming weeks, which suggests the payers who are not providing access to reSET and reSET-O are not only denying patients effective treatments, but are also failing to realize cost savings that are meaningful to their business and the communities they serve. Your line is now open. We will continue to collect data per unit commercial patient treated and that is data at the patient reported outcome level, its data at the clinician reported outcome level and it's data that rolls up to claims and health economic outcomes, really will continue to push this data and published this data in order to help us bring on additional covered lives and open up market access for additional patients. Your line is now open. I think agnostic of the type of access agreement, it is our goal to then pull through in these given access agreements and what that means is really very much something that resembles an enterprise software sale, where we're educating large health systems and large groups of providers in order to help them to understand the benefits of prescribing our PDTs, but also to understand the mechanics of prescribing our PDTs and I think as you rightfully point out, as we move forward, we'll continue to operate under a number of these different types of access agreements. As I mentioned, each patient who utilizes the products in the real world adds to our dossier of data, allows us to look at, particularly, efficacious and effective subsets of patients and ultimately continue to demonstrate our health economic value to payers. So I think the influence that you made is an apt one, where in many of these arrangements we have the opportunity to demonstrate not just what particular state that we're able to bend the cost curve and generate real world health economic outcomes, but those projects become demonstration projects, which really help us to then radiate more broadly into additional base. Your line is now open. Your line is now open. And as you heard, I think both Corey and Julia have mentioned, we do that through a number of mechanisms, the largest of which we tried to highlight on this call, which is this remarkable body of evidence we have with RCT data, plus real world clinical data, plus real world health economic data. Even though we want bigger deals that have the potential to drive down ASP, we're focused on continuing to generate additional real world health economic data, as well as enhancing our products, both of those things should help us to enhance pricing power, which of course would help push up ASP. Your line is now open. Your line is now open. Judah, thank you for the question. Judah, thank you for the question. Your line is now open."
}