{
    "symbol": "PEAR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 19:32:02",
    "content": " With me today, are Corey McCann, our President and CEO; Chris Guiffre, our Chief Financial Officer and Chief Operating Officer; Erin Brenner our Chief Product Development Officer; Yuri Maricich, our Chief Medical Officer; Ronan O'Brien, our General Counsel; and Julia Strandberg, our Chief Commercial Officer. This includes statements concerning our future business, operating results, management's intentions, beliefs and expectations about future results, events, strategies, operating plans and performance or financial conditions, and statements regarding proposed federal legislation regarding PTT, all of which are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 as amended. Except as required by law Pear assumes no obligation to update or revise these forward-looking statements, even if actual results or future expectations change materially. In the third quarter, we continue to drive revenue growth, reduce costs, and drive Pear towards sustainability. We focused our commercial and product development resources on the most mature segment of our business, specifically on the intersection of our addiction products and payment by states. We continue to main to maintain, what I'll call, option value in several other areas of our business, commercial payers, federal payers, Somryst, and our pipeline of product candidates as well as our dual platforms. We published additional real-world evidence reinforcing our triple thread value proposition of increased patient engagement, improved clinical outcomes and lower costs. We restructured our cost base, including today's reduction in force, such that we can accomplish all of this at lower cost and less cash burn. With that in mind, first I'll say a few words about revenue, then a few about operating expenses and a reduction in force we announced earlier this afternoon. Demand from patients and providers is strong with more than 11,400 prescriptions in the quarter. First, adding payers who provide access; and second, targeting regions with sufficient coverage density. We believe that our performance is indicative of strong fundamentals where payers save money by providing coverage, providers have a positive prescribing experience and patients see real world clinical benefit. To drive payment rate upward we temporarily prioritized the most mature payer channel of our business, which is selling reSET and reSET-O to states. In response, earmarked funds are being allocated to states to help them tackle the epidemic with more than $34 billion in federal support and settlement funding awarded in the last two years alone. Those include Alabama, Indiana, Kentucky, Massachusetts, Michigan, North Carolina, Ohio, Oklahoma, South Carolina, and Wisconsin. Within these 10 states, approximately four million people suffer from addiction. With a significant population of addiction patients covered by states and with robust unit economics, we believe Pear is well positioned to steadily grow near term revenue by selling our addiction products to states. As we broaden access within our existing ten states and expand to the additional 40 states, the opportunity to provide reSET and reSET-O to all states could become a very big business. Highmark, a large payer in Pennsylvania, Delaware, West Virginia, and New York is now providing coverage for all three of our commercial products. Excellus a Blueâ\u0080\u0099s plan with membership across Upstate New York is also providing coverage, bringing us to 16 Blueâ\u0080\u0099s plans that cover Pearâ\u0080\u0099s products. Additionally, a top three payer in Massachusetts, Tufts Health Plan in Massachusetts and Kaiser plan in Colorado added us to formulary. We have much work to do with commercial payers, but we see signs that momentum is building. Finally, our pipeline of product candidates continues to represent significant potential, long-term value. Leveraging our dual platforms, PearCreate and PearConnect, we have the opportunity to own the space we created, but we need to balance that opportunity with the current market landscape and with driving our business towards sustainability. Next year, our revenue guidance is double this year's guidance. The upside case could be significant as we continue to remove barriers to patient access, grow prescriber demand, and demonstrate strong patient outcomes. Then Yuri will discuss new real world data for our products, further demonstrating our value proposition. And finally, Chris will walk through financial and operating metrics, as well as additional steps we've taken to reduce our reliance on fundraising next year. We are laser-focused on meeting patients and providers where they are, while prioritizing areas of coverage density. We help more and more patients by welcoming new customers like Sparrow Health and expanding the use of our products in existing, satisfied customers like BrightView and Crossroads. Our products are delivering results for both providers and patients, as evidenced by our real world data, which Yuri will share in a few minutes and by the growing refill rate, which now exceeds 25%. I would like to highlight some of our progress across our three payer channels, states, commercial and federal. First, the first payer channel is state payers. First, the first payer channel is state payers. In Q3, we welcomed new states like Alabama and South Carolina and welcome back, repeat customers like Ohio. According to the National Institute on Drug Abuse, 85% of the U.S. prison population has an active substance use disorder or were incarcerated for crime involving illicit drugs. To accelerate our progress with states, Pear has finalized an agreement with COEUS HealthCare. COEUS and Magellan have a partnership to create a turnkey, value-based agreement solution for 26 state Medicaid programs. In addition, just this month, Pear was awarded the opportunity to implement California's groundbreaking program for the treatment of stimulant use disorder. California's Department of Healthcare Services in collaboration with the Centers for Medicare & Medicaid Services will work with Pear to serve up to 10,000 Californians who struggle with stimulant use disorder. Finally, there are a growing number of states with proposed or passed legislation supporting access to PDTs. We believe many states are moving towards access because of the importance to their residents and to their state budgets, both of which have been ravaged by the addiction crisis. In Q3, we expanded coverage with commercial payers like Highmark and Excellus, as well as individual plans run by a top three commercial payer and Kaiser. In Massachusetts, Oklahoma and North Carolina where states are providing access, we have seen commercial payers follow suits. If it becomes law, it would establish a new benefit category at CMS for an innovative class of medicine and it would require both coverage and payment for PDTs. Now I'll turn the call over to Yuri Maricich who will talk about new real world data that further supports the value of PDTs bring to payers, providers and patients. To illustrate Julia's comment about our products delivering results for patients, let's review some recent data. Second, two new analyses for reSET-O; the American Managed Care pharmacy known as AMCP held this conference in October and Pear presented data on rates of inpatient hospitalizations between reSET-O and control patients across a two-year time horizon. Also at a conference held by the American Society of Addiction Medicine known as ASAM and the National Committee on Quality Assurance known as NCQA, one of our provider partners BrightView presented data on their use of PDTs. Third, Somryst; At AMCP we also presented a new real world health economic data that compared outcomes for patients treated with Somryst versus pharmaceutical treatments for chronic insomnia. Here we found the patients treated with Somryst had an $8,202 reduction in per patient costs compared to controls in the 24 month after treatment. The continuum of evidence for our product grows and grows further demonstrating that our products work for patients, providers, and payers. Today, we reported third quarter revenue of $4.1 million, up 24% over the prior quarter and up 211% over the same quarter last year. Before I move from revenue to operating metrics, I'll remind you that at this stage of our growth revenue can be lumpy, so we caution against overreacting to positive or negative quarterly revenue results and we suggest that annual revenue results are a better way to measure our growth. Second, fulfillment rate; in Q3 we had a 60% fulfillment rate also in line with our expectations. We received payment for 49% of fulfilled prescriptions in Q3, slightly lower than expectations, but an improvement over last quarter. Once again, in line with our expectations, we believe our strong unit economics are reflective of the significant medical value provided by PDTs. Now two further financial results to note first, on September 30th we had, $83.6 million of cash, cash equivalence and short-term investments on the balance sheet also in line with our expectations. Second, our operating expenses in the third quarter were $30.7 million, down $5.4 million from Q2 and again also in line with our expectations. Second, we expect to further reduce our operating expenses by approximately $10.7 million in 2023. Third, we expect our non-GAAP operating expenses for 2023 to be less than $100 million. Specifically, we are talking about total GAAP expenses minus interest, taxes, depreciation, amortization, stock-based compensation, the change in the estimated fair value of the earn out liability and the change in the estimated fair value of the warrants. Fourth, we expect to incur approximately $2.6 million in cash expenses related to employee severance, benefits and related costs, and a stock based compensation charge of between $300,000 and $900,000 related to employees impacted by the reduction in force. And finally, we expect to extend runway into 2024 with a $40 million financing assumption and a revenue assumption in line with our 2023 guidance, which I'll discuss next. Today, we are confirming 2022 revenue guidance of $14 million to $16 million. Today we're also announcing 2023 revenue guidance, which is $27 million to $37 million. Put another way, we are focused on growth while remaining sustainable in a challenging capital markets environment. We expect to raise capital next year, but we have taken significant steps to minimize the amount we would need to raise. With that, Elizabeth, let's open the call for questions. Your line is now open. And while we restructured our business in July to focus more on near-term commercial opportunities and temporarily pause our pipeline and platform efforts, this reduction enforces does not change that in any way. It allows us to try to focus on those short-term commercial opportunities, which we talked about in the call, primarily selling reSET and reSET-O to States and try to do that with a lower cost base. We are already seeing that sort of thing happen in Massachusetts, in Oklahoma, and in North Carolina, and this strategy is really key to establishing large areas of coverage density and propelling the business forward. Your line is now open. So Eric, what I wanted to make sure we tried to provide clarity on is what we expected to be the neighborhood of the financing that would be necessary to get us to 2024. And the reduction enforce today $10.7 million, how does that layer in alongside the 25 employees in July? As we get close to the end of the year, we focused exclusively on providing guidance for how it would impact 2023. Your line is now open. That said, this company is singularly focused on bringing a new class of medicine to the world. With that in mind I believe that most people understand that it would've been irresponsible to this business and to our mission, not to take decisive steps to react to the current environment. I believe that our team will rally together as they always do, every time they face obstacles, and we will continue to bring our products to more and more patients, grow our revenue more and more quickly, and we'll do it with a lower cost base. I can't promise you that we'll have to see how the next few months shape up, but that's what I expect from this team based on the way that they've faced every challenge that they've seen in the five years that I've been a part of this company. A question here then on the state access agreements, congrats on those recent wins, Alabama, South Carolina, I know Wisconsin's in there as well. I think as we stated before, our goal is really to make sure that patients have access to our therapeutics. We want to meet payers where they are and in many states, addiction care is paid for by programs outside of Medicaid like SOR grants and we're really working to create broad based access that meets patients and payers where they are and to do it as quickly as we possibly can. Your line is now open. Number one, adding additional payers who provide access, and number two, targeting regions where that access exists. I think you have seen significant progress on the state front, you've also seen significant progress on the commercial front with large payers like Highmark, and I get the sense that there is some real momentum there. As I mentioned previously, bringing this all together into geographies that we can target like the work we're doing in Massachusetts, North Carolina and Oklahoma stands to benefit our payment rate. Your line is now open. I think one great example of standard formulary access is in the case of the state of Massachusetts, whereas we've previously disclosed MassHealth, the Medicaid organization in the state has put our reSET and reSET-O products on standard formulary as a pharmacy benefit for every Medicaid patient in the state. Your line is now open. I think it's early days and while we aren't prepared to speak specifically to metrics, you can imagine ways in which standard contracting would speed the process. So right now for instance, when we go to new states, we are drafting coverage contracting from whole cloth. Your line is now open. So the South Carolina pilot represents an opportunity for which our organization can expand into the correctional setting and a significant area within a state, as well as many states that we are engaging today. So our program with South Carolina to date is really allowing us to demonstrate with evidence to others on how it can be done and communicating post implementation, post value with the outcomes that we received with South Carolina. I think again, Highmark is a good example there where they added all three of our products to standard formulary. Second thing we're focused on with Somryst is continued generation of real world and health economic data and the numbers that Yuri mentioned in excess of $8,000 per treated patient when compared to pharmaceutical treatment, I believe are highly compelling and give us belief in the asset moving forward. So with all that said, we are allocating our resources toward reSET and reSET-O deeply as we've mentioned several times, but the opportunity with Somryst remains. We are meeting what the moment demands,  revenue by more than 20% each quarter this year."
}