{
    "symbol": "REVG",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-08 15:42:02",
    "content": " In regards to chassis, during the quarter, we experienced increased receipts which enabled several businesses within the F&E and Commercial segments to plan production into the third quarter, some with increased line rate assumptions. Now turning to our first quarter results on Slide 4, consolidated net sales of $584 million increased $47 million versus the first quarter of last year. Partially offsetting the increase in Commercial and Recreation segment sales was a decline in F&E segment sales, fewer shipments of fire apparatus was partially offset by increased shipments of higher content ambulance units. The decrease in EBITDA was primarily the result of lower shipments and an unfavorable mix of municipal transit buses, partially offset by higher shipments and improved profitability within school bus and terminal truck businesses. For the remainder of the year, we expect Commercial segment revenue to return to a run rate similar to the second half of fiscal 2022 as we complete lower-priced municipal transit buses and begin shipping higher content units, including battery electric and hydrogen fuel cell buses, we expect segment margins to recover from the current mid-single-digit range to high single-digits exiting the year. Yes, I still think we're into what we had said before, probably our exit rate will be lower than what we originally expected, given our Q1 results and then some of the impact of these units going into Q2, like we said, we will be profitable in Q2 and the ramp that we're seeing in Ambulance obviously will allow us to get to the pricing tiers quicker and it will be more of a drag from fire just getting through the WIP unit. So I think from an overall perspective, you would expect us to be more price cost positive, as we've talked about as we exit the year in those 3 businesses in Fire & Emergency and commercial and then recreation, we're still looking at how that market is going to play out with any necessary discounting as we move forward."
}