{
    "symbol": "AAL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 12:53:07",
    "content": " We're doubling down on our efforts to run a reliable operation in 2023, including investing in our team, our fleet and technology to support our operations and we're seeing this work pay off as our operation is off to a strong start just a few weeks into 2023, including the best on-time arrival performance of the nine largest U.S. carriers so far this year. In the fourth quarter, we took delivery of five 788s, and we expect to receive the remaining four in the first half of 2023. In the fourth quarter, we took delivery of five 788s, and we expect to receive the remaining four in the first half of 2023. But what is very important is that as we've talked about for some time, what's different about us is that we have used the last few years to really materially change our network, our partnerships and our fleet and that really bleeds through in our forecast for next year. Well, yes, look, in L.A. much like in New York, through our partnerships, we've been able to create something really cool for customers where -- if you think about it in the times past, we flew 50 seaters and small RJs in markets where we didn't really have a scheduled proposition for customers. Then as far as how layoffs are impacting things, look, what's really important to note about business travel is -- yes, it's 25% of our revenues, but those companies are intending to do the largest the biggest, largest ones tend to buy on a corporate contract. As we look out to this year, I don't think the timing of the deliveries as it sits today is too concerning with how we're going to finance the airplane -- more than anything, we just want to make sure the airplanes are delivered and in schedule so we can run a great operation and have really solid schedules for our customers. And so I think it's an opportunity that as we look to the future, that there are communities that haven't typically been places where we sourced pilots that we're going to look to in the future, we're showing great progress in hiring pilots of color and also female pilots."
}