{
    "symbol": "STAA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 00:22:04",
    "content": " STAAR achieved 30% net sales growth in the third quarter, which reflects strong EVO ICL unit growth in APAC and strong accelerating growth in the U.S. despite constant currency challenges and in Europe macroeconomic headwinds. However, due to tighter COVID restrictions in China, resulting in expected delayed demand in the fourth quarter, ongoing headwinds in Europe, weakness in the yen and euro, and lower other products sales, we now anticipate total net sales will be approximately $285 million for fiscal 2022, which represents $300 million adjusted for constant currency. As we look to fiscal 2023, despite the aforementioned challenges, we expect to achieve approximately 30% ICL sales growth year-over-year to approximately $355 million in total company net sales, which contemplates limited sales from other products. Total net sales for Q3 2022 were $76 million, up 30% as compared to $58.4 million of net sales in Q3 2021. The 30% year-over-year increase in Q3 2022 net sales is attributable to a 33% increase in ICL sales, which represented 95% of total company net sales in the quarter. Q3 2022 reported net sales includes an approximate $4 million negative currency impact as compared to the prior year quarter due to changes in constant currency, primarily the Japanese yen and the euro. In constant currency, net sales for Q3 2022 would have been approximately $80 million, up 37% year-over-year. For the 9 months ended September 30, 2022, reported net sales includes a $9 million negative impact from changes in constant currency as outlined in the constant currency table in todayâ\u0080\u0099s earnings release. We currently anticipate approximately $65 million in net sales for Q4 2022, which contemplates tighter COVID restrictions in certain cities in China, resulting in an expected delay demand in the fourth quarter of approximately $5 million, ongoing headwinds in Europe of approximately $2 million, weakness in the yen and euro since our August 10 Q2 earnings call of approximately $1.5 million, and lower other products sales of approximately $1.5 million. Turning back to Q3, gross profit was $60.5 million or 79.5% of net sales as compared to gross profit of $45.3 million or 77.6% of net sales for Q3 2021 and $63.9 million or 78.8% of net sales for Q2 2022. With regard to foreign exchange rate headwinds, when compared to our initial fiscal 2022 full year revenue guidance in January of this year, we now estimate an approximate $15 million negative impact on full year fiscal 2022 net sales, normalizing for these FX headwinds results in constant currency net sales of approximately $300 million. For fiscal 2023, as we complete our initial planning and budgeting, we currently believe we can achieve ICL net sales growth of approximately 30% year-over-year, which contemplates the continuing challenging macroeconomic environment in Europe, a lessening impact of COVID, no significant changes to foreign exchange rates, and little to no sales from our other product business, which is more than offset by a strong trajectory of growth in Asia and U.S. markets. And I think implied with the 100% unit growth, I am coming out to about $5.3 million for the U.S. in the fourth quarter and just hope, want to check my math on that and see if thatâ\u0080\u0099s what you are kind of expecting for the U.S. in fourth quarter."
}