{
    "symbol": "STAA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 23:13:06",
    "content": " In fiscal 2022, we increased cash on our balance sheet by over $25 million through internal generated funds, ending the year with over $225 million of cash and investments. The strong EVO commitments from our larger customers in China, the largest refractive market in the world and many of the 1,200-plus surgeons in China that implant our lenses bolsters our confidence at this time that we can meet our sales outlook for the full year fiscal 2023. Turning to the U.S. ICL unit growth exceeded the outlook we previously provided, up 55% year-over-year in fiscal 2022 and up 109% year-over-year in the fourth quarter. While we continue to train and certify surgeons in the U.S., our focus for 2023 is increasing surgeon comfort, confidence and commitment to EVO by surrounding our surgeon customers with sales, clinical and marketing support as they work to add EVO to their practices and/or transform their practices for more lens-based refractive standard. Total net sales for Q4 2022 were $64 million, consistent with our January 9 pre-announcement as compared to net sales of $59 million in Q4 2021. The $5 million year-over-year increase in Q4 2022 net sales is attributable to a 15% or $8.1 million increase in ICL sales, partially offset by a $3.1 million decline in other products which primarily consists of cataract IOLs. U.S. sales normalized for allowance for sales reserves were $4.5 million in Q4 2022, up 94% compared to Q4 2021 sales of $2.3 million. For Q4 2022, reported net sales included a $3.8 million negative impact from changes in constant currency, primarily the yen in Europe and the impact of the transient headwinds in China that Tom discussed earlier. For fiscal 2022 reported net sales of $284 million included a $12.9 million negative impact for changes in constant currency, as outlined in the constant currency table in today's earnings release. Our outlook for fiscal 2023 net sales is for ICL sales of approximately $340 million, representing 26% growth over fiscal 2022 ICL sales of approximately $270 million. Taking a closer look at the components of operating expenses, G&A expense for Q4 '22 was $14.8 million compared to $11.5 million for Q4 2021 and $14 million for Q3 2022. For fiscal 2023, we expect selling and marketing expenses will be approximately 38% of net sales as we make the important investments in EVO ICL patient awareness and our sales organization that Tom discussed earlier. In terms of calendarization, we expect selling and marketing expense will be approximately $30 million for Q1 2023 and $33 million each quarter thereafter. For fiscal 2023, we expect R&D expense will be approximately 13% for the full year which is approximately $11 million each quarter. For Q4 2022, net income was $5.9 million or $0.12 per diluted share compared to net income of $4.9 million or $0.10 per diluted share for Q4 2021. On a non-GAAP basis, adjusted net income for Q4 '22 was $6.8 million or $0.14 per diluted share compared to adjusted net income of $9.5 million or $0.19 per diluted share for Q4 2021. And I asked because it sounds like the guidance was directionally, at least come to directionally more bullish on China as you expected maybe headwinds in Q2 previously and you're seeing things ease now and then similarly on the U.S. with the $5 million to start the year. But I think, again, surrounding the customer with this team approach where clinically marketing-wise and sales-wise with common management, so decision-making as close to the customer is certainly a recipe that has proven successful and we're poised for a strong year in the U.S. Our next question comes from the line of Bill Plovanic with Canaccord."
}