{
    "symbol": "STAA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 19:17:14",
    "content": " Operating expenses for Q1 2022 were approximately $3.3 million lower than planned, primarily due to a shift in marketing expenses to Q2, Q3, and Q4 related to the timing of our U.S. EVO approval. 17:12 We now expect selling and marketing expenses as a percent of sales to represent approximately 32% to 34% per quarter for the balance of fiscal 2022 and to be at the higher end of this range in Q2 and Q3 to support sales during our busiest quarters and reflecting the timing of U.S. marketing investments following FDA approval of our EVO lenses in the U.S. 17:38 Research and development expense was $7.9 million in Q1 2022, compared to $8.3 million for Q1 2021 and $9.1 million for Q4 2021. 18:44 For fiscal year 2022, we continue to expect operating margin will be similar to the 14.5% of fiscal 2021 as anticipated leverage on G&A and R&D expenses is offset by higher sales and marketing investments targeted at building EVO awareness and market share globally. Your line is now open. Your line is now open. Your line is now open. Your line is now open. 36:37 So, in terms of the myope and what the surgeon will offer in terms of minus 3 and above and kind of where they're going to be part, I think it's going to be a surgeon by surgeon determination of where they'll start, but I'm very encouraged in that – the number of surgeons we talked to, many of them said, they were going to offer to all patients, which is what we found especially in other major markets around the world is, surgeons might start-off around maybe minus 7 to minus 10, but then as they get this phenomenal feedback of patient satisfaction and incredible complement in terms of the ability to have a patient satisfied almost from the first minutes after the procedure, they start to offer to everyone for all those benefits we talked about earlier and we'll continue to talk about. Your line is now open. Your line is now open. Maybe starting off with EVO in the U.S., I know it's early days, but any stories or color you can share about what you're seeing in terms of EVO driving volume growth in prior Visian practices, at least in that initial group of 100 Docs, and expectations on how much of the longer-term EVO growth is going to be driven by increasing penetration in current ICL practices versus broader adoption?"
}