{
    "symbol": "STAA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 21:34:05",
    "content": " The second quarter results we reported today represent a record level of quarterly sales for STARR and $81.1 million, which represents 30% year-over-year sales growth and considerable progress in advancing our EVO ICL family of lenses. In today's earnings release, we reaffirmed our previously provided outlook for fiscal 2022 net sales of approximately $295 million, which takes into account the significant currency headwinds and a continuation of the current level of COVID-19 related challenges in China and elsewhere, offset by stronger than expected global demand for our EVO lenses, which continued through the beginning of the third quarter. Total net sales for Q2 2022 were $81.1 million, up 30% as compared to $62.4 million of net sales in Q2 2021 and up 28% on a sequential basis from Q1 2022. Q2 2022 reported net sales include an approximate $3.1 million negative impact year-over-year from changes in currency, primarily to Japanese yen as well as the euro. In constant currency, net sales for Q2 2022 would have been $84.2 million, up over 35% year-over-year. Therefore, even in the face of significant currency headwinds, we are today able to reaffirm our previously provided outlook for fiscal 2022 net sales of approximately $295 million. So our expectation is that in the U.S., as Joe's campaign rolls out over the next, especially six weeks, culminating on September 7 with a full media day in New York City and a number of appearances on national television, as well followed up by Joe publishing and posting on Instagram, TikTok, Twitter and others, where he has over 30 million followers combined, you're going to see a lot of immediate interests. And so when you think that we've only been out there for a couple of months, now we believe with the number of surgeons who are trained over 400, actually it's 461 as of today, we'll have 600 very soon and more beyond that, we believe that with our influencer campaign, with all the local marketing we're doing with the surgeons, as well as more excited influencers who aren't maybe a household name, but we just signed a really exciting chef who is very, very popular and has multiple channels on the Internet."
}