{
    "symbol": "DAC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 11:21:05",
    "content": " This increase of $15.8 million in adjusted net income between the two periods is a result of $37.5 million increase in operating revenues, a $5.5 million improvement in net finance expenses, partially offset by a decrease of $16 million in ZIM dividends whose shares we have now sold and an $11 million increase in total operating expenses. More specifically, operating revenues increased, as I said, by $37.5 million to $252.5 million in the current quarter compared to $215 million in the fourth quarter of 2021. This increase is attributed to a $72.9 million increase in revenues as a result of higher charter rates partially offset by $1.6 million lower revenues due to the sale of 2 vessels during the fourth quarter of 2022 and a $7.9 million decrease in recognition of assumed charter liabilities, which is the amortization of recent vessel acquisitions. Vessel operating expenses increased by $2.8 million to $40 million in the current quarter from $37.2 million in the fourth quarter of 2021, mainly as a result of the increase in the average daily operating cost that increased to $6,417 per day for this quarter, up from $5,860 per day in the fourth quarter of 2021, mainly due to COVID-19 related increase in crude remuneration and increase in travel expenses as well as increased insurance premiums and general inflationary pressures. G&A expenses decreased by $3.7 million to $14.9 million in the current quarter compared to $18.6 million in the fourth quarter of 2021, mainly as a result of lower stock-based compensation between the two periods. Interest expense, excluding finance cost amortization, decreased by $3.2 million to $10.9 million in the current quarter compared to $14.1 million in the fourth quarter of 2021. And this is a combined result of a $1.7 million decrease in interest expense because of a decrease in our average indebtedness by approximately $590 million between the two periods, partially offset by an increase in cost of debt service by 238 basis points as a result of rise in floating interest rates."
}