{
    "symbol": "BBAI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 21:31:09",
    "content": " Good afternoon, everyone, and welcome to BigBear.ai's 2022 first quarter earnings conference call, I’m Josh Kinley, Chief Financial Officer and I'm here with our CEO, Dr. Reggie Brothers and other members of the BigBear.ai leadership team who will participate in the Q&A session afterwards. During the call today, we may make certain forward-looking statements. For more information about these risks and uncertainties, please refer to the forward-looking statements section of the earnings press release issued today and our SEC filings. Thank you, Josh, and thank you all for joining our first quarter 2022 earnings call. As I described in our last call, our mission in BigBear.ai is to guide our customers to realize their best possible future by delivering transformative technologies and expert actionable advice. For the first quarter of 2022, the BigBear.ai took several important steps in our journey from a steady and profitable services first company to high growth, high margin technology first company. We made good progress in our land and expand strategy in federal market, while establishing a strong foothold in the commercial side of our business through a strategic and accretive acquisition. We also continued to position the company for rapid scale, regarding outstanding talent to the team, and like any operational efficiencies through automation and reorganization. On the federal side, we're pleased to see the appropriations bill signed into law on March 15. Those of you unfamiliar with the federal contracting process, it takes some time for budget authority to flow down to individual agencies, and then to distinct projects. However, we anticipate the new bill, coupled with the conclusion of the continuing resolution will generate momentum for BigBear.ai throughout the rest of the year and into 2023. Notably, the 2022 defense budget includes $200 million, specifically earmarked for the adoption of AI, and the 2023 budget is projected to be considerably higher. For example, the Joint Artificial Intelligence Center, JAIC, which was established in 2018 to accelerate the department's adoption of AI. DoD requested 14.7 billion for science technology programs with fiscal year 2022, including 874 million with the development of AI compared with 841 million for fiscal year 2021. For about 20 years have been trusted adviser to the government, they will need an experienced partner like BigBear.ai to help them deploy these capabilities as quickly as possible. Now, I'd like to turn to our commercial business. First, our commercial revenue for the first quarter exceeded our commercial revenue for all of 2021. ProModel has industry leading modeling applications for the BigBear.ai portfolio, extending our reach into the Fortune 500 and giving us a foothold in manufacturing, healthcare, shipbuilding, in other vertical markets where logistics management capabilities are highly transferable. We know from our history of ProModel Government Solutions, products are complementary. The synergies between our technology, expertise and market focus enhance each company's ability to deliver scalable decision support solutions to our customers. For example, ProModel customers in the shipbuilding industry, such as Ingalls Shipbuilding and Newport News use a shipyard AI tool to streamline production scheduling and capacity planning. Using our rich data sources and pre-build analytics modules,  customers will be able to see and mitigate the impact of global supply chain factors, such as the pricing and availability of iron and steel, allowing them to decrease production risk, or achieving better business outcomes. In the healthcare field, ProModel serves dozens of hospitals across the country, including children's hospitals. ProModel’s FutureFlow Rz product provide the simulation platform for patient flow and hospital capacity, including scenario analysis for staffing, bed counts, arrival and discharge patterns and case mix. The hospital reported significant ROI in their deployment, which allowed them to optimize staffing levels and operations over the past years -- two years in COVID-19 and the BigBear.ai, Children's Hospital Colorado can benefit from augmented data, which is national and regional COVID infection rates, and real-time emergency calls and ambulance traffic,  and medical professionals are available to provide care for children who need a specific specialization expertise of the Children's Hospital. They're excited about working with us to incorporate external data and predictive insights to optimize their specific advance for, in their words, children only have a chance if they're at one of the Children's Specialty Hospitals. These are just a few of the many ways in which BigBear.ai data enrichment and AI capabilities have ProModel solutions to help our customers reach new levels of predictability, efficiency and profitability. As I mentioned in our last earnings call, channel partnerships will be important to our growth strategy. Additional ProModel, also bringing very strong co-marketing and distribution partnerships with industry leaders like Autodesk and Datech Solutions was the global reseller of Autodesk products. ProModel AutoCAD addition works seamlessly with the Autodesk product design and manufacturing collection, which includes AutoCAD, Inventor and Factory Design Utilities. To support our federal and commercial growth, we continue to bolster the BigBear.ai leadership team with top talent. Her unique expertise in artificial intelligence, intellectual property, business strategy will be critically important as we expand our portfolio and global reach. Key hires were also made in product, marketing, sales and sales operations. Giving us the commercial experience, we need to rapidly bring new products to market, fill the sales pipeline, and convert opportunities in the  assets. On the Federal side of our business, we appointed Tony Barrett as our new President of Cyber & Engineering, Tony will lead our Integrated Defense solutions, security efforts, and the creation of strategies that allow us to evolve services customers in a software company. With an eye toward more strategic acquisitions, our product team has been reorganized to ensure rapid integration, enhancement of acquired technology, while concurrently packaging our unique AI capabilities for the commercial SaaS market. We anticipate increasing our product, sales and marketing investments, future periods to help us achieve our commercial goals and drive sustainable growth. In summary, we made great progress in the first quarter of 2022 on our growth strategy despite the ongoing impact of government contracting delays. With the continuing resolution lifted and the new appropriations bill signed, we're in an excellent position, building a robust backbone of federal business although expanding into the commercial market. In the first quarter, we continued to execute on our growth strategy and are in a strong financial position to capture opportunities that will ramp up throughout the year. Revenue for the quarter was $36.4 million, compared to 35.6 million in the first quarter of 2021. About $19.1 million of revenue was from our analytics segment, compared to 17 million in the prior year period. The 2.1 million increase is largely attributable to our growing commercial analytics business, as Reggie mentioned, saw more revenue in Q1 of 2022 than the entirety of 2021. Approximately 17.3 million of our revenue came from our Cyber & Engineering or C&E business, compared to 18.6 million in the prior year period. The minor drop in revenue reflects the impact of the continuing resolution on certain programs that we are unable to execute funding, while the government was operating under a temporary budget. Overall, we were pleased with the quarterly revenue given we were operating under the continuing resolution. Now that the appropriations bill has been signed into law, we expect contracting activity to pick up at the end of the second quarter as funds flow down to individual government agencies, thus allowing them to award new contracts and allocate spending to individual programs and projects. As Reggie mentioned previously, the government has specifically earmarked spending for the purposes of AI and ML research and thought leadership. On the topic of backlog, we ended the quarter at $459 million, a small or roughly 1% decrease from the end of 2021. Given the federal government's inability to award new contracts during the period, we were very happy to report strong revenue for the quarter without seeing a meaningful change to overall backlog. For the first quarter, our gross margin was 27% on a GAAP basis. On a consolidated basis, the company's total adjusted gross margin was 35%, which is once again an improvement on where we ended the prior fiscal year. As we continue to see growth in our analytics business, especially with commercial customers, we'll see continued expansion of the margins, which is consistent with the strategy we've communicated in the past. While we're discussing revenue and gross margin, Reggie talked about how we closed the acquisition of ProModel Corporation early in the second quarter. We'll start to see this revenue in our Q2 report, and this will also contribute to our gross margin expansion. Operating expenses were 26.2 million in the first quarter, including interest expense of about $3.6 million, and SG&A expenses of approximately 22 million. The growth over the prior year period is primarily driven by equity-based compensation costs, as well as increased payroll, IT, recruiting expenses and public company requirements. For the first quarter, we had a net loss of $18.8 million primarily driven by non-cash equity-based compensation. This was in line with our expectations for Q1, as a considerable amount of our revenue growth was pending contract awards in the passage of the federal budget. Turning now to our balance sheet, we had cash and cash equivalents of approximately $60 million at the end of the quarter, $9 million less than our position at year-end. Also in the balance sheet, we had roughly $101 million of restricted cash at year-end that was used in Q1 to repurchase shares held under forward share purchase agreements with certain investors. Now turning to outlook, we expect to see increased government activity in the coming quarters as the spending appropriations make their way down to various agencies and projects, allowing them to fund existing programs and award new contracts. As Reggie mentioned, the current geopolitical environment is driving a renewed focus on AI ML tools and capabilities within the government, generating relevant new opportunities for the company. In light of these factors, we expect budget requests to be even higher in 2023 and expect to continue to build our growth pipeline in new and existing government customers. We remain on track to reach our previously announced revenue range between $175 million and $205 million for the full year 2022 and are confident we'll see the gross margin expansion from increased sales of our analytics products and solutions. Now to quickly discuss our recent M&A activity, the acquisition of ProModel corporation will add to our commercial analytics revenue for 2022 and further support gross margin on the analytic side of the business. More importantly, ProModel brings an entirely new customer set and market opportunity with regard to medical, manufacturing and overall supply chain management. Demand forecasting, cost controls, operational efficiency and margin expansion are critically important for participants throughout the global supply chain. And to reiterate our prior projection, we expect our commercial sales to approach 10% of our total revenue for the year, a tremendous jump from the prior year when it was just 1% of total revenues. In summary, BigBear is executing on all aspects of our 2022 growth strategy. And our pipeline of new opportunities continues to grow in both the federal and commercial markets, further cementing our long-term growth strategy. Now I'll turn it over to the operator for our Q&A, where Reggie and I will be joined by Brian Frutchey, Chief Technology Officer, Sam Gordy, Chief Operating Officer and President of Federal and Jeff Dyer, President of Commercial. Firstly, you talked about 11 contract wins on the federal side. But given that those the government customers were still operating under a continuing resolution, those 11 contracts, there weren't any large awards in there. And then, on the commercial side, you mentioned, your revenue in the quarter was higher than the entire past year. I think the best way to think about that is, you kind of see our year-end projections. We're not, at this time reporting specifically on commercial revenues for the quarter. But you can definitely think of as we build up to that mark, which year-end projections of, let's say, roughly 200 million, that leaves you with $20 million of projected revenue. So, I will discuss the revenue very quickly, and then I'll ask Brian to weigh in on the technical integration. So we're not disclosing their revenue to-date, we expect to be able to considerably capitalize on the opportunities they have and the existing customer sets. At this point, it's not a substantial amount or a substantial add to our projected commercial revenue. On the technical integration side, the discrete event simulation capabilities the ProModel offers will continue to exist as standalone tools and capabilities. We inherited six sellers, both direct and indirect from ProModel and we do expect that we will add on a ramp basis throughout the years, we continue to grow that pipeline, and further to Brian's point, integrate our product offerings to leverage the best of both companies technologies together. In terms of just I guess, just following up on the last question, if you'd include the six adds here, as well as the organic adds planned, how many new sales people or how fast will you grow the sales and marketing group this year relative to 2021 in total for commercial. A lot of focus right now on accelerating the demand plan, as I have planned to add sales headcount in each quarter as we ramped through the year and into 2023. I need to test that over the next quarter with obviously the demand cycle and lead generation, as it relates to the conversion ratios that we see now and what we anticipate we can do moving forward. Part of that is because some of the government or federal awards that we expect in Q4, but also between the ramp up of the commercial revenue, which isn't necessarily bound by the government, budgeting and contracting cycle. I think that that's something we'll continue to see in future years as well, that steady ramp up through the year and less dependence on the federal contracting cycle, if you will. On the last part of your question, with respect to win rate, I need to learn a bit more on that not just to best understand the win rate against the legacy pattern that we inherited with the acquisition, but to really understand that with the sales offensive that will put in place moving forward. But Reggie gave an example of a story in healthcare whereby the Children's Hospital Colorado, which is one of many of the children's hospitals that use ProModel today for optimizing hospital efficiency and their direct requests to incorporate AI and ML models to best understand how to care for the children that can only be impacted at a children's hospital different than a different medical facility. Anytime you sell to a hospital as an example, a six-figure type of offering even though there is value, there's a cycle that takes time. We need to best understand how we can leverage partners to accelerate certain buy cycles, but also get our own motions in place to accelerate what we think is a really exciting growth opportunity for us in the back half of the year certainly. In the next year, there is an incumbent pipeline around manufacturers, shipbuilders, hospitals, we're excited to help execute at a higher rate of conversion in the second half of the year, but certainly need to test some of our theories and establish those patterns for ourselves as we head into 2023. So the contracts you're talking about are OTAs, right, other transactional authority contracts within the U.S. government, which, require that they do invest on a prototype side of the house."
}