{
    "symbol": "HTLF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-25 23:43:03",
    "content": " In the second quarter, we delivered our best quarter ever for organic loan growth, increasing $552 million or 5% from the linked quarter, excluding PPP and again, significantly exceeding our guidance of $200 million. Deposit growth of $559 million from the linked quarter, our credit quality continues to be excellent with nonperforming assets holding at 34 basis points of total assets and delinquencies at historic lows. And total assets are a record $19.7 billion, an increase of $428 million or 2% from the linked quarter. In the second quarter, we added 322 new commercial relationships, representing $328 million in funded loans and $37 million of new deposits. In our consumer loan portfolio, we saw strong growth of $37 million or 9% from the linked quarter. Non-time deposits totaled $16.1 billion, an increase of $534 million or 3% from the linked quarter. Total deposits grew to a record $17.2 billion, an increase of $559 million from the linked quarter and our 13th consecutive quarter of total deposit growth. As Bruce outlined, this was another solid quarter for HTLF with earnings per share of $1.17, loan growth of $552 million, excluding PPP, strong revenue growth, improved expense levels and continued favorable credit trends. At quarter end, the allowance for lending-related credit losses which includes both the allowance for credit losses on loans and unfunded commitments, increased $2.5 million to $119.1 million or 1.12% of total loans. In addition, at quarter end, unamortized purchased loan valuations on the balance sheet totaled $13.2 million or 12 basis points of loans. Investment balances rose just over $80 million to end the quarter at $7.3 billion, representing 37% of assets with a tax equivalent yield of 2.46%, a modified duration between five and six years and producing monthly cash flows of $65 million to $70 million. Excluding restructuring, tax credit costs and asset gains and losses, our core expenses decreased $3 million to $106.8 million compared to $110 million last quarter and came in a little better than projected. The expected Fed increase of 75 basis points in July is projected to increase net interest income by $9 million to $10 million on an annualized basis, assuming our normal deposit ratio of about 40%. Core noninterest income, excluding gains and losses, is expected to normalize into the range of $32 million to $33 million per quarter with higher commercial deposits, swap and syndication fees helping to offset lower mortgage banking and wealth revenue as rates continue to rise. I think if I went back and looked what I would have said last quarter for a 75 basis point rate increase, it would have been a higher number than the $9 million to $10 million I said in my comments. In the second quarter, organic loan growth increased $552 million or 5%."
}