{
    "symbol": "HTLF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-30 20:12:04",
    "content": " Total revenue increased $10 million, or 5% from the linked quarter. In the fourth quarter, loans grew $505 million, an increase of 5% from the linked quarter and greatly exceeding our guidance for the quarter. This includes approximately $105 million in increased credit line utilization, primarily in Agribusiness and approximately $100 million of loan growth which we previously expected to close in the first quarter. From the linked quarter, commercial and industrial increased $185 million or 6%. Service charges and fees increased $2.1 million, or 14% for the year and 1% for the quarter, driven primarily by our growing credit card business. Our consumer loan portfolio saw significant growth in 2022, increasing $87 million or 21%. Consumer loans grew $11 million, or 2% from the linked quarter. Residential mortgage increased $24 million, or 3% for the year and was flat from the linked quarter. Non-time deposits decreased $448 million, or 3% from the linked quarter, mostly due to balanced declines that occurred in our commercial operational accounts for seasonal needs and year-end distribution and not as a result of account attrition. Time deposits increased $793 million, or 77% for the year and $694 million, or 62% from the linked quarter. Overall, total deposits grew to a record $17.5 billion, an increase of $1.1 billion, or 7% for the year and $245 million from the linked quarter. As Bruce just outlined, this was another strong quarter for HTLF with earnings per share of $1.37, loan growth of just over $500 million, revenue growth this quarter of over $10 million and stable clean credit performance. So I'll start my comments with the provision for credit losses, which totaled $3.4 million, that's up -- that's a $2.1 million decrease over last quarter. At quarter end, the allowance for related for lending-related credit losses, which includes both the allowance for credit losses on loans and unfunded commitments increased $5.1 million to $129.7 million or 1.13% of total loans. In addition, at quarter end, unamortized purchase loan valuations on the balance sheet totaled just over $10 million or 9 basis points of loans. And second, we took advantage of some mid-quarter market disruption and reinvested $115 million cash flow into a AAA rated security with a purchase yield of nearly 9% and a duration of less than a year. So in total, quarterly revenue grew $10 million or 5% and exceeded patients. Excluding restructuring, tax credit costs and asset gains and losses, the run rate of recurring operating expenses increased $3.1 million to $109.1 million compared to $106 million last quarter, and exceeded our forecast of $105 million to $106 million. HTLF expects to see continued success and improvement, highlighted by expected loan growth of 6% to 8% next year with $150 million to $200 million expected next quarter. Provision for credit losses are projected to range from $4 million to $6 million per quarter, given projected loan growth and assuming credit trends began to normalize from their current levels. Core non-interest income, that is excluding investment gains and losses is expected to be $28 million to $29 million next quarter, and is projected to raise 4% to 5% on a full year basis, as persistently weaker mortgage revenue is offset by growth in other income categories, primarily commercial fees. Recurring operating expenses are expected to be $108 million to $109 million next quarter, and show a 2% to 3% increase on a full year basis. Your line is open. Your line is open. Your line is open. Just wanted to the type of loans that were, I guess, resolved out of non-accrual in the quarter, I think it's $6 million net. Your line is open. Your line is open. And David, I was just going to mention on that commercial deposit growth, that will also help us on the treasury management fee side because those operating accounts of all those new relationships, we're able to provide them with our products that we have on the treasury management side as well as those C&I customers are using more of our capital markets products, whether they're swapping their floating rate loans, which this quarter, 79% of our loans were floating, which is an all-time high for us. In 2022, we delivered record total revenue of $726 million, a 5% increase, record loan growth of $1.6 billion or 17%, excluding PPP."
}