{
    "symbol": "HTLF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-25 22:28:02",
    "content": " HTLF had continued success and growth in the first quarter, reporting $47.9 million of net income and EPS of $1.12. In the first quarter, we delivered organic loan growth of $358 million or 4% from the linked quarter, excluding PPP and significantly exceeding our guidance of $200 million. Deposit growth of $249 million from the linked quarter, total revenue of $169 million in line with our expectations, and excellent credit quality with nonperforming assets decreasing to 32 basis points of total assets. From the linked quarter, commercial and industrial increased $174 million or 7%, owner-occupied real estate increased $26 million or 1%, non-owner occupied real estate increased $151 million or 8%, construction decreased $14 million or 2%, and our ag portfolio increased $13 million for 2%. In the first quarter, we added 322 new commercial relationships, representing $263 million in funded loans and $58 million of new deposits. In our consumer loan portfolio, we saw growth of $12 million or 3% from the linked quarter. Non-time deposits totaled $15.6 billion, an increase of $219 million or 1% from the linked quarter. Lastly in the first quarter, we reported net charge of $3 million or 12 basis points annualized of average loans. I'll begin today by referencing our earnings release, which details another solid quarter for HTLF with earnings per share reported at $1.12, loan growth of $358 million excluding PPP, and continued improvement in credit metrics. So I'll start my comments as I usually do with the provision for credit losses, which was a $5.7 million benefit this quarter, which is slightly better than the $5.3 million benefit last quarter as underlying credit trends remain very phased favorable, highlighted by nonperforming loans, which declined by $11 million and loan delinquencies that remain near historic lows at 10 basis points of total loans. As Bruce mentioned, net charge-offs were $3 million this quarter, due primarily to one Ag-related credit that's been in our workout group going through bankruptcy for several years. So at the end of the quarter, the total allowance for lending-related credit losses, which includes both the allowance for credit, losses on loans, and unfunded commitment, stood at $116.8 million or 1.15% of total loans. In addition, our quarter-end unamortized purchased loan valuations on the balance sheet totaled $16.3 million or 16 basis points of total loans. Moving to the income statement and starting with revenue, non-interest income - or net interest income totaled $134.7 million this quarter, which was $2.5 million lower than the prior quarter. And second, due to the first quarter having two fewer days than the prior quarter, net interest income was $3.1 million lower. Excluding security gains and losses, core non-interest income was $32 million, up almost $1 million from the prior quarter as strong commercial swaps and syndication fees more than offset some weakness in Wealth Management and Mortgage Banking revenues in relation to rising interest rates. Shifting then to expenses, non-interest expenses totaled $110.8 million this quarter, that's down $4.6 million from last quarter. Non-interest income, excluding investment gains and losses, in total, is expected to be flat at about $32 million per quarter with higher commercial deposits, swaps, and syndication fees offsetting lower Mortgage Banking and Wealth Management revenue. And I would tell you, based upon the results in the first quarter with new relationships and what our pipelines look like in my conversations with customers, we feel very confident that we can deliver the $250 million of organic loan growth in the second quarter and it has yet to really affect the banks. It's $75 million to $80 million a month, so it's $250 million a quarter and we're able to reposition that right now at about a 2% higher rate than what is coming off, and we'll continue to do that and look at opportunities going forward. They delivered almost $60 million of growth for us, funded growth during the quarter, and that really helped offset - the first quarter in the Ag world is normally down as they've sold off their inventory."
}