{
    "symbol": "HTLF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-31 21:52:06",
    "content": " HTLF had a strong, clean third quarter with $54.6 million of net income available to common shareholders and EPS of $1.28, once again exceeding expectations. In the third quarter, organic loan growth, excluding PPP, totaled $255 million or 2% from the linked quarter and exceeding our guidance of $250 million. From the linked quarter, commercial and industrial increased $219 million or 7%. We're driving business in fee-generating products such as our commercial card business, which generated $6.2 million in revenue, a 6% increase from the linked quarter. Our commercial pipeline remains strong at over $1.5 billion, and we expect to grow commercial loans by $225 million to $250 million in the fourth quarter. In our consumer loan portfolio, we saw solid growth of $31 million or 7% from the linked quarter and expect to grow consumer loans by $15 million in the fourth quarter. Non-time deposits were flat, while time deposits increased $44 million or 4% from the linked quarter. Overall, deposits grew to a record $17.3 billion, an increase of $42 million from the linked quarter, and our 14th consecutive quarter of deposit growth. As Bruce just outlined, this was another solid quarter for HTLF with earnings per share of $1.28, loan growth of $255 million, excluding PPP; strong revenue growth; improved core expense levels; and stable, clean credit trends. I'll start my comments, as I usually do with the provision for credit losses, which totaled $5.5 million, that's a $2.2 million increase over last quarter. At quarter-end, the allowance for lending related credit losses, which includes both the allowance for credit losses on loans and unfunded commitments, increased $5.5 million to $124.6 million or 1.14% of total loans. In addition, at quarter-end, unamortized purchase loan valuations on the balance sheet totaled $12 million or 11 basis points of total loans. Moving to investments, which declined $300 million to end the quarter at $7 billion, representing 35% of assets, with a tax equivalent yield of 2.92% and will generate cash flows exceeding $1 billion over the next 12 months. Second, we utilized some of our strong revenue growth to take the opportunity to sell $60 million of securities yielding 2.3% at a $1.1 million loss and used the proceeds to purchase new AAA rated securities yielding 5.8%. And lastly, we utilized $125 million of cash flow this quarter to fund loan growth. The main components of the reduction were a $3.1 million decrease in commercial swaps and syndication fees due to lower loan volumes this quarter compared to last quarter; weaker wealth management fees and mortgage banking revenue, which declined $500,000 and $1.1 million, respectively, due to the higher interest rate environment; and as you may recall, last quarter, there was a $1.9 million gain on the sale of Visa B shares. Excluding restructuring, tax credit costs and asset gains and losses, the run rate of recurring operating expenses decreased $600,000 to $106 million compared to $106.6 million last quarter and came in within our expected range of $105 million to $106 million. The next expected Fed increase of 75 basis points is projected to increase net interest income by $8 million to $9 million on an annualized basis, assuming a normal deposit beta for us of 40%. Provision for credit losses should remain in the range over the past few quarters of $3 million to $5 million, given projected loan growth and assuming net charge-offs and delinquencies remain near their current levels. Core non-interest income, excluding investment gains and losses, is expected to be in the $29 million to $30 million range per quarter with commercial deposits swap and syndication fees helping to offset lower mortgage banking and wealth revenue. In the third quarter, we delivered $185 million of revenue, a 5% increase from the linked quarter, $54.6 million of net income available to common shareholders, and EPS of $1.28."
}