{
    "symbol": "PII",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 16:20:30",
    "content": " And as I mentioned earlier, you get a combination of us getting back on pace with Ranger, knowing that the utility segment, at least for the past couple of quarters, has shown resilient demand and we anticipate that to continue for the factors that we outlined earlier and the new products that are going to come into the market, those are going to be enough, at least from a Polaris perspective to obviously drive retail that, as we said, could be flat to up, and that should create more stability in the industry. And even with a choppy macro, we think the opportunity is specific to Polaris relative to the utility segment, RANGER inventory levels as well as the new products coming on seen that gives us the opportunity for some growth. And as Bob indicated, now it's becoming a little bit better indicator around the demand where we don't have dealer inventory levels at the adequate level or we have product that's on hold and we've seen that playing out specifically around the high-end RZR as well as RANGER products right now. But -- that said, if you're seeing fewer whole goods move, typically, people are buying oil kits, maintaining the vehicles because we know people are still writing the same rates that they have historically as well as if they're going to hold on to a vehicle for another year or 2, they're likely to buy some accessories. They've done a spectacular job of improving profitability I mentioned it in my prepared remarks, everything from the Mighty G, which we're seeing tremendous pickup on the electric version of that boat, that's tapping into a whole new segment, both electric as well as consumers who are looking for a smaller, more maneuverable Pontoon all the way up to the Hurricane 2600, which is an absolutely stunning fiberglass boat. I think Mike and I have been really clear with everybody that we feel like the business was under invested in historically, is part of the reason we went back to a more focused portfolio, and we're putting our money into high-return operational investments that either improve quality, improve the product and drive better costs. Just to clarify, I shouldn't be sort of taking -- it sort of seems like the first half sets up really favorably because you've still got that $150 million that should sort of be an add-on to your sales but then the back half of the year kind of feels like a $600 million headwind you're telling me I shouldn't think about it that way."
}