{
    "symbol": "NSTG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 21:05:35",
    "content": " Retrospective analysis shows that our sales reps spend relatively less time in Q4 cultivating long-term GeoMx instrument opportunities, instead focusing their efforts on capturing orders for a record 70-plus spatial biology instruments. First, we are increasing support for the sales team as they adapt to their new roles and structure, providing frontline reps and recently promoted leaders additional training and intense coaching and taking additional steps to ensure customer accounts have been fully transitioned between reps.  Second, we're focused on balancing sales efforts across platforms and time horizons. For our spatial biology business, Q1 GeoMx revenue was $9.7 million, approximately flat year-over-year. Adjusted R&D expense was $15 million, an increase of 19% year-over-year, primarily driven by increased personnel and product development costs related to CosMx, and by investments in software and technology that will support data storage and analysis for customers across our Spatial Biology platforms. Adjusted SG&A expense was $29.4 million, an increase of 40% year-over-year, driven primarily by investments made in our Spatial Biology related commercial initiatives, including investments to expand our salesforce, service and customer support groups as well as cost related to licencing and implementing of new information technology solutions to support our virtual operations and finance functions. This range includes $11 million to $12 million of GeoMx revenue and $20 million to $21 million of nCounter in service revenue with the bottom end of the range, reflecting sales performance similar to Q1, and with the upper end, reflecting improvement in the aggregate performance of our sales team in the latter half of Q2. For GeoMx, we are updating our full year revenue guidance range to $60 million to $65 million, representing annual growth of 16% to 25% and an updated full year estimated pull-through range of $90,000 to $95,000. For nCounter and service, we are updating our full year 2022 revenue guidance range to $90 million to $95 million, reflecting annual revenue that is flat over the prior year at the midpoint of the range and pull-through that trend to the conservative end of our $50,000 to $55,000 full year estimated range. As I described in my prepared remarks, both GeoMx and instrument and consumable orders are moving through the quarter at a pace that's materially improved over both the prior year period and the way that the year started in Q1. Our instrument sales reps were frequently visiting and cultivating those customers who were due to purchase instruments during the fourth quarter, but they were not spending time with customers who are early in their evaluation of GeoMx and were due to purchase their instruments during 2022. We do actually -- when we look at our guidance imply a substantial step-up in the growth rate of GeoMx revenue in the second half, I believe if you take our Q2 guidance and our full year guidance, you can infer that our first half growth rate on GeoMx is relatively flat as implied by the guide."
}