{
    "symbol": "CVT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 23:08:05",
    "content": " In summary, we're very pleased with the financial results from our first-quarter, but we're even more excited about our future, with the business that's resilient to potential new COVID variants, and it's positioned well for what we believe is continued strong movement towards the return to in-person events. Deferred revenue at the -- at the end of the first quarter was $287.5 million, an increase of 18% compared to the first quarter of the prior year, due to year-over-year bookings growth driven by the adoption of the Attendee Hub and in-person events beginning to return. Turning to full-year adjusted EBITDA guidance, we're keeping our adjusted EBITDA margin guidance unchanged from our prior guidance of 16.5% to 17.2%, which results in a slight increase to our adjusted EBITDA our guidance in terms of dollars as a result of the increase to our revenue guidance, The $2.4 million first-quarter adjusted EBITDA be, does not fully flow through to the full-year because we're starting to feel an impact on our expenses from the macroeconomic factors that are currently in play, especially wage inflation. I'm curious as you're navigating from these macro uncertainties and your customers are doing the same, how you think the allocation between in-person events and virtual shifts given the lower cost nature of virtual events while still having somewhat of an impact to reach and engage with customers. So look, I think, what's going to happen with our competitors, is they're starting to struggle because they can't do the total event program as seamlessly, to do it again, in-person, virtual, hybrid. So I think in the end what you're seeing is, is that in-person events are certainly not up to the where they were in 20 -- I mean, in pre - COVID, but they are growing every week in month because of two reasons, people more comfortable traveling, I'm going to say three reasons, second of all, psychologically, people are getting more comfortable. That begin for in-person events sooner than what we'd originally thought started happening in late first quarter as opposed to second-quarter, so that the pulling forward obviously doesn't impact and full year, the bounce-back does obviously impact benefits Q1 and the full-year, but you don't see that sort of snowball effect and that's why you don't see the 3.9 turning into like a much larger raise the full year. Of the go-to-market hasn't changed tremendously to their go-to-market strategy has now been well over a year, I could say, or maybe not well over a year, but is the total event program and with a total event program, again, we know that you need some in-person virtual and don't forget what you're planning and in-person events, you're not planning at three or four months in advance. I'm assuming the pandemic will lessen and therefore I needed so mentally, people have been there in 2021, at least a lot of our customers, if you can get 2020 is all virtual, virtual, virtual, maybe the first quarter was all virtual, virtual, but you started getting into '21 later on they're thinking, my big conference in '22, which they're probably negotiating and contracting what they already have with a venue they're making that decision. And again, this year-round engagement with is an exciting thing where you can engage them again, not just during event, but in-person and virtual, so it's always going to be a critical part of events."
}