{
    "symbol": "SES",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 20:56:39",
    "content": " We have encountered complex problems, including poor pressed density of wide-format lithium-metal foils, powder arising from using lasers to cut our anodes that can lead to cells shorting, optimizing pressure distribution over a larger area and developing accurate health monitoring algorithms for large cells without any data initially, just to name a few. Our shareholder letter contains a table that summarizes the performances of our 4 amp-hour cells first published last year and recently updated, 50 amp-hour cells entirely new data and 100 amp-hour cells still ongoing. And then since then, gradually, we started controlling salt, the solvent, separator coating, cathode, cathode coating processing and then recently anode, even lithium foil itself and then lithium-metal cell design, cell engineering, equipment, manufacturing equipment, testing equipment and then the environment, the temperature, the pressure, the charge and discharge rate, how we test these cells. So supply chain for us in A sample is about degrees of freedom and then controlling every component, every material and every step of the entire process so that we can deliver a system, a cell that meets the OEM -- the full-blown OEM specs. And so having control over all these components and the process, and then that really allows us to develop new materials and then improve the performance of the cell much faster than if we just waited and relied on vendors to supply these materials because the cell is not really a bunch of LEGO pieces put together, and each LEGO is very established, and you can have the vendors make that. So the material spending to make large 50 and 100 amp-hour cells has reduced comparing to before because we initially had higher budget to make more cells, but now that we focus on quality, so we just make enough for us and our OEM partners for testing and then put our resources all onto solving the challenges that Qichao mentioned."
}