{
    "symbol": "HIMS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 20:12:06",
    "content": " We are pleased to report an exceptional finish to a record year, headlined by annual revenue of 527 million, more than 1 million subscribers and over 10 million cumulative medical visits since inception, and importantly, the transition to adjusted EBITDA profitability in the fourth quarter for the first time in our company's history. It's not as if we're going to see gross margins degrade overnight, but over time as we start to continue to optimize the customer experience, we're likely to see that start to normalize in the mid-70s and embed in our assumption in the 20% to 30% range factors that in. So, I think there's a balanced effort here of improving the customer experiences for those core categories that have, you know, really rapid scale and are continuing to grow pretty robustly, while also looking and getting excited about, you know, what else to plot form can serve and unlock. And so, really what we would look to do is look for again as Andrew mentioned, new ways to improve the overall customer experience, whether that comes in the form of more personalized products, new services evolving our overall offering, that's what we expect to drive more of the movement in gross margin that we expected as opposed to our evolving cost structure. And I think, as long as we continue to focus on those four pillars that I was talking about prior to investing in that trusted brand continuing to innovate on the leading technology, delivering truly innovative products and services and then reinforcing that whole thing with clinical excellence, those four pillars I think really are the bread and butter of what's working and what's delivering a holistic start to finish experience that is really unlike anything in market. Yes, it's a great question. Yes, that's a great question. But it's fairly representative of the growth we see under the hood today and I think also representative of the, really robust innovation pipeline that we have in the works, both for this year and next year on the proprietary product side across categories and new categories that we think are going to unlock quite a lot of new customer segments and also drive engagement and retention pretty powerfully. And again, I think this just really reinforces a lot of the investments we've been making across the stack to improve the customer experience in such a way where patients really can come to us and know that not only are they going to get the best clinical care, but they're also going to get products and services that are truly proprietary and unique to our platform and unavailable at other places in market. Yes, that's a great question. Yes, it's a great question. Yes, it's a great question."
}