{
    "symbol": "WLY",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-15 15:48:02",
    "content": " But while our university services and education publishing lines were slowed by this, we still delivered on our financial targets, thanks to strong organic growth across Research and in corporate talent development and Professional Learning. For the quarter, Wiley delivered revenue growth of 4% or 2% organic, with continued momentum in Research and corporate talent development. Adjusted EBITDA was flat to prior year and adjusted EPS was down 6%, mainly due to the revenue decline in Academic & Professional Learning, or APL and planned second half investments in key growth areas. For the year, Research continued to deliver consistent revenue and profit growth, with revenue up 9% or 5% organic and adjusted EBITDA up 10%. Finally, Research Solutions continues to see strong demand with platform revenues up 27% for the year or 8% organic and Corporate Solutions up 17%. In Education Services, we saw revenue growth of 14% for the year, driven by a 72% growth in talent development. As expected, our investments to win new corporate clients and scale operations and talent development resulted in continued strong momentum but also an adjusted EBITDA decline of 26%. For revenue, Wiley anticipates mid-single-digit growth at constant currency, driven by continued strong performance in Research and corporate talent development as well as $19 million of organic revenue from fiscal '22 acquisitions. Solid organic revenue growth will be partially offset by higher employee costs due to inflation and targeted investments in Research Publishing, Research Solutions and corporate talent development. First, we expect Wiley's solid revenue growth to continue, driven mainly by strong market fundamentals and the tight fit of our business with the core demand trends in Research and Education. We will continue to invest in both organic growth and seek strategic acquisitions but we'll narrowly direct capital allocation toward our proven opportunities in areas such as our Research Publishing, Research Solutions and corporate talent development lines."
}