{
    "symbol": "TFX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 11:36:13",
    "content": " For the first quarter, Teleflex generated 3.2% constant currency revenue growth year-over-year. When adjusting for the estimated 1% impact of one less selling day in the quarter, compared to the prior year period and the impact of our 2021 respiratory business divestiture, the underlying growth in the quarter was 5.8% year-over-year, despite some disruption from COVID in January and early February. 03:02 Adjusted earnings per share increased 0.3% year-over-year to $2.88, reflecting growth in the business offset by the impact of incremental inflation and investments for our growth drivers. 04:08 In the quarter, our high growth portfolio, which accounted for approximately 25% of revenues in 2021 and includes UroLift, MANTA, hemostatic products, EZ-IO, OnControl and PICCs performed well. 07:31 EMEA revenues of $136.9 million increased 3.4% year-over-year with Interventional, Vascular Access, and Anesthesia products leading the growth. 12:00 And finally, our other category, which incorporates sales of respiratory products not included in the divestiture to Medline, urology care and manufacturing and supply transition agreement revenues related to our respiratory business divestiture declined by 11.7% to $69.5 million year-over-year. 18:44 Adjusted operating margin was 25.7% in the first quarter, 180 basis point year-over-year decline as a result of the lower gross margin and planned investment in the business for our growth drivers, partially offset by disciplined expense management. 32:42 Well, I would first of all say that with respect to the EPS, we're really pleased with the first quarter results despite the challenging environment from COVID, constant currency revenue growth was at 5.8% after adjusting for the sales of the respiratory assets in one less shipping day. So really what we saw with, as I said earlier, in my commentary, we still expect UroLift in the first half of the year to grow low single-digit growth and then to accelerate in the back half and we're very confident on the 15% for the full-year."
}