{
    "symbol": "TFX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 12:36:18",
    "content": " For the fourth quarter, Teleflex revenues were $758 million, a year-over-year decline of 0.5% on a reported basis and an increase of 3.7% on a constant currency basis. Compared to the prior year period, revenue under the manufacturing and supply transition agreement associated with our prior divestiture of our Respiratory assets negatively impacted growth by 0.6% in the quarter, implying underlying constant currency growth of 4.3%. In reviewing the quarter, our fourth quarter constant currency revenue growth remained durable despite an unexpected subcomponent supply chain issue in our Surgical business that resulted in an approximately $3.5 million headwind during the quarter. When adjusting for the divestiture of the Respiratory assets and one less shipping day, constant currency revenue growth was 4.3% for 2022 as healthcare utilization improved through the year and demand for Teleflex products accelerated. Although UroLift constant currency revenue declined 5% year-over-year in 2022, the remainder of products in the high-growth portfolio continued to show healthy gains with approximately 14% constant currency growth for the year. In 2022, durable core revenue grew approximately 5% on a constant currency basis as compared to the prior year period, reflecting improvement in procedural volumes, strong global execution, new product introductions and positive price. Our other category which includes our Respiratory and drainage catheter business as well as revenue from the MSA, we entered into with midlines in connection with the sale of our respiratory business declined just under 10% year-over-year in 2022. In our Surgical business, revenue was $110.4 million representing another solid performance with 10.4% growth year-over-year, despite the aforementioned supply chain disruption due to a specific subcomponent supplier. For Interventional Urology revenue was $89.2 million, representing an increase of 13.1% sequentially and a decrease of 3.6% year-over-year. Third-party data indicates that overall patient business to urologists were down in the 3% to 4% range year-over-year in the fourth quarter, which marks a sequential improvement from the high single-digit year-over-year decline witnessed in the third quarter of 2022. For the quarter, adjusted gross margin totaled 60% a 120 basis point increase versus the prior year period. The 30 basis point year-over-year increase was the result of higher gross margin and disciplined expense management of non-revenue-generating expense, partly offset by deleverage across our expense base from lower revenue year-over-year; inflation in our expense base such as wages; and planned investment in the business for our growth drivers. At the bottom line, fourth quarter adjusted earnings per share was $3.52, a decrease of 2.2% versus prior year. Considering the foreign exchange headwind, we expect reported revenue growth of 4.25% to 5.75% for 2023, implying a dollar range of $2.91 billion to $2.952 billion. Our adjusted earnings per share guidance for 2023 is $13 to $13.60, which represents a 0.5 point year-over-year decrease at the low end and a 4.1% increase at the high end. Although, we do not provide quarterly guidance for your modeling purposes, we would expect a constant currency revenue growth range in the first quarter of approximately 5.5% to 6.5% when excluding the benefit from five extra shipping days of approximately 5%. For the high-growth portfolio, which represented a little more than 25% of revenues in 2022, we expect approximately 12% to 13% CAGR for the LRP. And as regards cadence within the year, you obviously heard in Tom's prepared comments, where the quarter one will be 5.5% to 6.5% with a midpoint of 6%, so therefore, obviously, seeing an improvement right out of the gate in core revenue. And I think overarching if you look at Teleflex as a company within that high-growth bucket in 2022, it's 25% of our company growing at 12% to 13% By 2025, it will be one-third of our company still growing at that 12%, 13%. One, if I'm just thinking about the math right the 5% -- I think the midpoint for revenue, it's about 5% organic this year in 2023, if I'm thinking about that right but 6% now for the LRP. So, Liam, as I think about UroLift and this new 8% to 9% CAGR through the LRP, I think that's about $90 million to $100 million of incremental revenue through that time frame by 2025."
}