{
    "symbol": "RPD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 23:10:05",
    "content": " As a result, during the second quarter, we continue to see robust customer demand for our best-in-class Insight platform, driving strong ARR growth in our security transformation solutions as customers look for a cloud-native approach to securing their shifting IT environment. However, despite ongoing momentum for our security transformation solutions during Q2, our total ARR was impacted by a growing macroeconomic uncertainty affecting customers internationally, particularly in Europe, where the majority of our international business is concentrated. As customers seek better efficacy of security outcomes and lower total cost of ownership, we're helping them automate their security programs while leveraging our Insight platform to minimize risk across their expanded attack surface and detect and respond to threats across traditional and cloud environments. However, as customers increasingly look to rationalize spend, we believe Rapid7 is incredibly well positioned to accelerate customers' path to consolidate security spend and increase their efficacy by utilizing our Insight platform to help solve their most urgent security needs at the highest ROI. We continue to see great traction with our Insight platform vision as customers prioritize areas like XDR and cloud security, which is reflected in our security transformation solutions now approaching 70% of our new ARR. A great example of how customers are leveraging our platform to consolidate around strategic spend focused areas was a $200,000 ARR deal with a hyper-growth retail company during the second quarter. As we lean into the consolidation of spend around extended detection response, cloud security and VM in a comprehensive way, we're continuing to meet customers' operational challenges in both traditional and cloud environments. When you look at our security transformation, which is technology that we've really delivered to the market in the last 5 years, that's over 50% of total ARR and approaching 70% of new ARR. I think customers, in the early discussion that we've actually had with customers about what they're actually looking for is, they are looking to actually figure out how to get the most leverage from security spend in this environment. The third thing that I will point to, I look at it as a long-term opportunity, and we're going to ramp into that opportunity, is that in an environment like this, security is going to be top -- every customer we talked to says, listen, security is a top priority."
}