{
    "symbol": "RPD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 20:05:22",
    "content": " Rapid7 kicked off the year with another strong quarter of results as we sustained year-over-year ARR growth of 38%, ending the period with $627 million in ARR, while delivering positive free cash flow to start the year. We expect this focus on securing our customers' digital experiences coupled with evolving industry dynamics will continue to support durable demand for our differentiated and best-in-suite Insight platform, which is reflected in our sustained strong full year growth acquisition. We're seeing strong growth in ARR per customer, as customers consolidate fragmented security tools on our platform, driving expanding customer usage and adoption of our solutions. In the first quarter over 50% of our new ARR came from existing customers, as security teams increasingly look to natively integrated solutions to mitigate the challenge in trying to integrate multiple disparate products. Rapid7 had an excellent start to the year, ending the first quarter with ARR of $627 million which represents 38% year-over-year growth. The compelling value proposition of our Insight platform, is driving robust cross-sell and upsell activity with first quarter ARR per customer growing 18% year-over-year to $60,000 a at the same time we continue to see a healthy balance of ARR growth from new customers as we ended the quarter with over 10,400 customers globally, which represents 16% growth from the prior year. This outperformance was driven by broad-based demand for both our security transformation and vulnerability management solutions, which drove product revenue of $149 million representing 36% year-over-year growth and acceleration over the prior quarter. For the second quarter of 2022, we expect revenue in the range of $163 million to $165 million, which represents growth of 29% to 31% over the prior year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}