{
    "symbol": "RPD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 21:48:05",
    "content": " As Corey shared, the three largest drivers of our ARR growth performance this year will be related to traction on executional improvement, both in terms of better sales enablement and success around consolidation offerings as well as how the broader macroeconomic environment impacts customer buying behavior. Specifically, as customers reconcile their spending plans, we anticipate a more muted net new ARR in Q1, driving ARR growth in the range of approximately 16% year-over-year, with the expectation that we will begin to see stabilization in our net new ARR performance in Q2 as customer budgets settle with steady improvement through the second half of the year as our execution improvements take hold. Your line is open. Your line is now open. Your line is open. Your line is now open. So as far as the pricing strategy, one, we are seeing sort of both larger deal sizes, I think I talked about sort of like for the 10% â\u0080\u0093 which was actually exceeded our expectations of the momentum that we saw in the â\u0080\u0093 over 10%, to be clear that we saw in the quarter of our consolidation offerings. Your line is open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And I think going into a little bit of Q1, one of the dominate themes that we hear from a lot of our customers, itâ\u0080\u0099s security â\u0080\u0093 especially in the midsize market, even a little bit in the enterprise, especially in the mid-market, is that security is a big priority, but theyâ\u0080\u0099re trying to figure out the overall health of their business, what their budgets are and whatâ\u0080\u0099s the shape of their budgets. We actually tackle both of those which is why we believe that we actually have lots of leverage over the mid and the long-term is from a core platform perspective, we built a broad platform, but we have the core capabilities that mostly we have a heavy automation focus thatâ\u0080\u0099s really focused on driving the productivity of our customers and security operations across vulnerability management, across cloud security and a cost detection and response. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is open. Your line is now open."
}