{
    "symbol": "RAD",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-21 12:12:02",
    "content": " Turning to our Pharmacy Services business in the third quarter, Elixir reported revenues of $1.7 billion compared to $1.9 billion for last year's third quarter. The key takeaway is that while we're seeing good script and front-end sales growth in our retail business and strong operational results at Elixir, we remain challenged by retail margin pressures because pride in the way we mobilize to continue to serve our communities during COVID. Revenues for the quarter were down $145.5 million or 2.3% from prior year's third quarter, driven by a decline in COVID testing and vaccine revenue, the impact of store closures and lower membership at Elixir. Retail Pharmacy segment revenue for the quarter was $4.4 billion, which was $20.3 million lower than last year's third quarter, driven by the decrease in COVID-related revenue and store closures partially offset by an increase in both maintenance and acute prescriptions. Retail Pharmacy segment adjusted EBITDA SG&A expense was $81.2 million or 173 basis points better as a percent of revenue than the prior year third quarter due to lower payroll, occupancy and other operating expenses, driven by store closures and our cost reduction initiatives. Shifting to our Pharmacy Services segment, Elixir, in the third quarter, Elixir saw revenues decreased $132 million or 7.1% to $1.73 billion due primarily to a planned decrease in Elixir insurance membership and a previously announced client loss, partially offset by increased utilization of higher-cost drugs. Your line is open. Your line is open. Your line is open. We have a big hill decline because of this loss of this one client and the Elixir Insurance business, which we had planned for that, but so SG&A is goal one is to get the SG&A right-sized at the same time so that we can impact next year, and then at the same time, really both maximizing our margin opportunities and our procurement economics alongside of really trying to get that sales season to beat this year's sales season on a sequential basis. Your line is open. Your line is open. Your line is open."
}