{
    "symbol": "RAD",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-29 11:23:05",
    "content": " Diving into our segment results starting with our retail pharmacy business, revenues decreased 1.1% over the prior year quarter driven by the expected reduction in COVID vaccine and testing revenue as well as planned store closures. And based on this momentum and additional planned reductions in payroll, store operations and corporate administrative expense in the back half of the year, we expect to achieve SG&A savings of 190 million in fiscal 2023. Revenues for the quarter were down $211.9 million or 3.5% from the prior year second quarter driven by a decline in COVID testing and vaccine revenue, the impact of closed stores, and lower membership at Elixir. Retail Pharmacy segment revenue for the quarter was $4.23 billion, which was $45.4 million lower than last year's second quarter driven by the expected decrease in COVID-related revenue and store closures, partially offset by an increase in both maintenance and acute non-COVID immunization prescriptions. Retail Pharmacy segment adjusted EBITDA SG&A expenses were $45 million or 80 basis points better as a percent of revenue than the prior year second quarter due to lower payroll, occupancy, and store operating expenses driven by store closures and our cost reduction initiatives. Based on this momentum and additional planned reductions in payroll, store operating, and corporate administrative expenses in the back half of the year, we now expect to achieve SG&A savings of $190 million in fiscal 2023 compared to the $170 million that we discussed in our year-end earnings call. Pharmacy gross profit is sensitive to fluctuations of demand in cough, cold, and flu prescriptions, which are typically highest in our first and fourth quarters and for demand for flu immunizations, which are highly profitable and administered almost exclusively in the back half of the fiscal year. For our second quarter, Elixir saw revenues decreased $171 million or 9% to 1.73 billion due primarily to a planned decrease in Elixir Insurance membership and a previously announced client loss, partially offset by increased utilization of higher-cost drugs. Our cash flow statement for the quarter shows the use of cash from operating activities of $199 million driven by the build of the CMS receivable which we expect to securitize later this year, increases in inventory due to seasonal build and inflation, and the timing of payments for interest and bonus expense. Based upon second quarter front-end results and anticipating pressures on front-end sales and supply chain and continued throughout the remainder of our fiscal year, we are lowering our retail segment adjusted EBITDA guidance for the year. As discussed earlier, there are several factors that drive a second half retail EBITDA performance that is higher than the first half, including the benefit from flu immunizations, the recent rollout of bivalent vaccines, the impact of cough, cold and flu in Q4 on both our front-end and pharmacy businesses, and continued management of markdowns to drive improved front-end margins. I think as we kind of started to first set our guidance for the beginning of the year, we had a pretty -- an ambitious supply private label rollout program that we're pretty excited about and that we are expecting to give us about a $15 million EBITDA -- gross profit/EBITDA benefit in the year."
}