{
    "symbol": "ACST",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-14 23:23:11",
    "content": " Forward-looking statements during this conference call may include but are not limited to the success and timing of regulatory submissions of the planned Phase 3 study for GTX-104 and Acasti's other preclinical and clinical trials, regulatory requirements or developments in the outcome of meetings with the FDA, changes to clinical trial designs and regulatory pathways, legislative, regulatory, political, and economic developments and costs associated with Acasti's clinical trials. Perhaps most important in today's environment is that we finished the second fiscal quarter ending September 30, 2022 with about $35 million in cash, cash equivalents and short term investments. We've submitted a letter to the FDA to request a Type C meeting to review and discuss the results of the PK bridging study and our proposed design for the Phase 3 safety study As we believe it's important to obtain the FDA's feedback and guidance before initiating the Phase 3 safety study, next year. As mentioned, the Phase 3 safety study is expected to be the final step required to seek regulatory approval before submitting a new drug application to the FDA for GTX-104 for the treatment of SAH patients. As I mentioned a moment ago, we initiated a Phase 1 PK bridging study in the third calendar quarter of 2022 to evaluate the comparative bioavailability pharmacokinetics and safety of our oral betamethasone spray, GTX-102 compared to an intramuscular injection of betamethasone, the reference drug and to an oral solution of betamethasone in 48 healthy subjects. And finally, it's important to note that we finished the second fiscal quarter ending September 30, 2022 with about $35 million in cash, cash equivalents and short term investments We continue to believe that this is sufficient capital to fund operations through at least March of 2024, allowing for the advancement of 104 well into Phase 3 and advancing GTX-102 and 101 to key value inflection points."
}