{
    "symbol": "ACST",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-11 15:55:54",
    "content": " Forward-looking statements during this conference call may include but are not limited to the success and timing of regulatory submissions of the planned Phase 3 study for GTX-104 and Acasti's other preclinical and clinical trials, regulatory requirements or developments in the outcome of meetings with the FDA, changes to clinical trial designs and regulatory pathways, legislative, regulatory, political, and economic developments and costs associated with Acasti's clinical trials. I'll remind everyone that while the major objective of our Phase 3 safety study is to show that the safety profile of our GTX-104 in SAH patients is similar to or no worse than oral nimodipine, we also want to collect additional pharmacoeconomic data compared to the oral for future publication and marketing purposes. As a reminder to everyone, the Phase 3 safety study is expected to be the final clinical step required to seek regulatory approval under the 505(b)(2) regulatory pathway, before submitting a new drug application to the FDA for GTX-104 to treat SAH patients. And on July 26th, we initiated our planned single-dose pharmacokinetic bridging study, to evaluate the relative bioavailability of our topical spray form of bupivacaine, GTX-101 compared to the reference listed intramuscular injectable form of the drug in 48 healthy subjects. The results will provide important information on the dose and dosing frequency for GTX-101, which will guide the design of our multiple ascending dose study to be conducted in healthy human volunteers next year, followed quickly by our planned Phase 2 study in PHN patients. As mentioned, we'll be requesting a Type C meeting with the FDA, before initiating the Phase 3 study to confirm the study design and final dosing regimen, based on our excellent PK results and also to obtain the agency's feedback on the additional pharmacoeconomic data that we would like to collect, which could help to support our marketing and commercialization efforts once the product is approved. Assuming the PK bridging study meets its primary endpoint and based on the FDA's guidance, we plan to conduct a Phase 3 safety and efficacy trial in 80 patients in the second half of calendar 2023. This study is expected to be completed as planned, by the end of calendar 2022 and it will provide important information on the dose and dosing frequency in humans that will guide the design of our multiple ascending dose study, in healthy human volunteers, as well as our Phase 2 study in PHN patients."
}