{
    "symbol": "NFLX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-18 20:54:04",
    "content": " And then, specifically with regard to ads, we modeled out essentially what we think the expected revenue is on a variety of different countries that we're launching in to make sure that in a combination of the subscription price that we're charging for basic with ads, plus that anticipated monetization, we'd be roughly call it unit economics-wise revenue positive to neutral. I think it's also worth noting though that we're very much in the walk -- a crawl-walk-run kind of model that we talked about before, we're sort of iteratively improving. I'm not going to comment on any specific pricing, but I would just say that I think we've got a very attractive offering and that's a combination of the audience that we have that we're delivering to that oftentimes it's hard to access in other ways, certainly harder to access in traditional TV in many cases. So, I'm actually excited about our ability to grow that capacity on the Microsoft side that I think they're going to do some hiring and building and we're going to do some hiring and building and then through that joint capacity growth be able to better serve more advertisers which we can't even â\u0080\u0093 we canâ\u0080\u0099t even - actually weâ\u0080\u0099re turning some folks away right now because we just don't have the go-to-market capacity to serve everyone. Everything the company is focused on, whether that's on the content side, on marketing, lowering prices to the ad supported, the paid sharing, the  approach we're doing there lines us up for a good next year. So, I think it's -- that cadence is something I do think we're getting better at as we get more and more mature in our creation of original content. And we've been working really hard to try and find essentially a balanced position and approach towards this one that supports customer choice, and frankly, a long history of customer centricity that we think is informed how we think about establishing our service, but balancing that with making sure that as a business we're sort of getting paid when we're delivering entertainment value to consumers. So, we're trying to come up with a range of options that supports customer choice balances those considerations but also ensures that we've got a sustainable business model that allows us to invest in more of that great entertainment that Ted's team has always focused on for all of our members. And to do that at scale something that's never been done before and we continue to kind of sharpen the tools to deliver on that every -- not just for the next 12, 24 months, but for the foreseeable future, but I think this time right now is just as important as it ever has been. And I'll -- I can add to Spencer's point, we're really in kind of that support role and in finance and operations across the company, so helping to really scale and mature the combination of creative excellence and operational excellence in our support roles and support our ability to become a truly an increasingly global company around the world with increasing kind of financial discipline to get more and more of that dollar of spend on to the screen for the enjoyment of our members. But behind the scenes, we're doing amazing stuff on improving the -- what we call the choosing experience, which is the content discovery and recommendations and all the things that essentially, I think takes all the work that Ted's teams do and tries to magnify the value of that for the users we have around the world. We're really happy with our levels of engagement, the number of hit series and films, that we're able to put to our members at prices that they think are a phenomenal value in these strained economic times and we're growing, even in those strained economic times and with the extraordinary levels of competition out there for streaming dollars and for hours of viewing."
}