{
    "symbol": "RETA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 16:02:02",
    "content": " The division also stated that in addition to the primary endpoint, it will be important to demonstrate that the treatment effect accrues over time to support a claim that bard slows the loss of kidney function in patients with ADPKD and it provided guidance on an exploratory eGFR slope analysis that would address the question. FA researchers have studied progression in a natural history study and progression over one year is clinically meaningful to patients, even though the magnitude of progression over this time is relatively small versus patient's entire disease course. The pre-specified primary analysis population or full analysis set included the 82 patients, who did not have severe manifestations of the foot deformity pes cavus and the primary endpoint was the change from baseline and mFARS scores at week 48. We used two covariates, clinical trial site and baseline mFARS and importantly all mFARS values at all time points, regardless of whether patients were receiving study drug were included in the analysis. Understanding the limitations in interpreting open label extension data, we see that patients originally randomized Omav have continued to show a persistent treatment benefit with minimal to no worsening of the mFARS after 3.5 years of total treatment. It appears on the graph on the left that the placebo to Omav patients may be losing their treatment effect at extension week 120, however, as can be seen in the figure on the right, this is an artifact of this subset of patients who on average have longer GAA1 repeat links, which is associated with a faster rate of progression. As you can see in the blue shaded region of the figure on the right, these patients progressed approximately four mFARS points over one year while they were receiving placebo from randomization until the day they entered the extension and started receiving Omav. This calculation of annualized slopes allows all available data through extension week 120 from all FAS patients to estimate the treatment effect over a period of approximately 2.5 years, a total of 257 mFARS assessments contributed to this analysis from 73 patients. The division also agreed with our plan to enroll pediatric patients from age 12 to 17 years, we are pleased that based on preliminary comments, the FDA confirmed that if the FALCON trial is positive, it could support registration of bardoxolone in the treatment of patients with ADPKD. Your line is now open. So the way I understand it is, obviously, in MOXIe Part 2, you saw a very nice drug effect, early drop for the Omav patients on mFARS and then plateau whereas there's a very transient placebo effect and then it shot up on the placebo, so that all looks very, very good. And from week 0 to week 48 of the extension, what was happening in the trial made perfect sense to me and that you started to see a treatment effect for the patients switched from placebo to Omav and you started to see convergence of the two cohorts, which, in my mind, is exactly what you want to see in the sense of a drug effect emerging in the patients switched from placebo to Omav. And an important differentiation between a symptomatic treatment and one that actually affects the underlying course of the disease is that if patients – if the drug has an effect on the underlying disease, you would expect that patients who have been receiving drug for a longer period of time would have a benefit that could not be basically captured by patients who start on that treatment a year later. And if you were simply to plot that out, 0.27 or 0.45 mFARS points per year, that's obviously a low rate of progression versus the two comparisons, which we have, which are how those same patients behave when they were placebos. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}