{
    "symbol": "RETA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 16:50:04",
    "content": " The primary evidence for omav in FA comes from the pivotal Part 2 MOXIe study, a double-blind, placebo-controlled, randomized international study, 103 patients were enrolled across a wide and representative range of age and disease severity. Beyond the primary evidence from the pivotal MOXIe Part 2 trial, we have provided additional lines of confirmatory evidence to the FDA supporting the efficacy of omav in patients with FA. To assess the treatment effect of omav, more formally in the MOXIe extension and to provide additional clinical evidence, we performed a post hoc propensity match analysis of the MOXIe extension data to the largest, most robust FA natural history study, FA-COMS. In this population, patients in the FA-COMS matched set progressed approximately 6.6 mFARS points by year three, whereas patients treated with omav in MOXIe Extension progressed only three points, representing a significant slowing in IO of 0.0001 HERE 01. The propensity match analysis includes 136 patients who have been treated with omav for up to three years to match FA-COMS patients, and all analysis populations demonstrated a significant slowing of progression for patients treated with omav with multiple subgroups in all Empire subsections favoring omav. These include mechanistic data showing how Omav directly affects the underlying pathophysiology of FA the post-hot propensity match analysis of patients in the MOXIe Extension compared to patients from FA-COMS, demonstrating a significant long in disease progression and results from the post-hoc delayed start analysis, which are consistent with omav having a disease-modifying profile and a persistent effect on the course of disease. Recall that MOXIe Part 2, the primary analysis population did not include Pes Cavus, severe Pes Cavus, yet we saw a treatment effect in patients with severe Pes Cavus, Importantly, in our propensity match analysis and reference the preprint that is available online with a pre-submission manuscript."
}