{
    "symbol": "PET",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 21:01:04",
    "content": " Good afternoon, everyone, and thank you for joining us to discuss our fourth quarter and full year 2022 performance and strategic priorities for 2023. 's first year as a public company, which was topped off with our best quarter to date. We're building a strong non discretionary consumer branded premium pet care platform that is transforming the pet industry by becoming an all inclusive, trusted partner for the premium pet parents. from a service business, to a premium platform for pet care needs. Our accomplishments this quarter and for the full year would not be possible without our passionate and hardworking team at Wag!, who have laid the building blocks for long-term success in 2023 and beyond. To frame the rest of our discussion today, we will review our 2022 financial results and cover our compelling growth strategy that positions us to deliver predictable and sustainable financial performance, while combining all corners of the pet market into our trusted platform. After another exceptional quarter, we are raising our 2023 guidance for both revenue and adjusted EBITDA. Before turning it over to Adam, President and Chief Product Officer, who will give an update on our strategy and key initiatives for the year, I will give a high level summary of our fourth quarter and full year 2022 performance. Then Alec, our Chief Financial Officer, will discuss our fourth quarter and full year 2022 results in more detail our capital allocation priorities and our guidance for 2023. In the fourth quarter, we continue to execute on our discipline strategy and achieve achieved record revenue of 17 million, up 110% year-over-year, driving full year revenue growth of over 173% to 54.9 million. Importantly, we continue to invest in our business focusing on our highest ROI assets while being disciplined, delivering fourth quarter adjusted EBITDA loss of approximately 400,000 and improvement from 2.5 million loss the year prior. Premium penetration remains strong in the fourth quarter at 54%, as we rolled out $14.99 pricing tests in key markets across the United States Resulting in Wag! As a reminder, Wag! Premium penetration is key to the platform resiliency, as it builds a deep and repeatable relationship with Pet Parents driving strong cross sell rates, and an increased LTV. As you mentioned last quarter, we continue to test like premium pricing and benefits to maintain our long-term premium penetration target and add value to premium. As well as strengthen our overnight services business led by great relationships between Pet Parents and Pet Caregivers, which drives long duration overnight stays and was accelerated by incremental weather and canceled flights throughout the U.S. which led to stronger than expected ALD. During the quarter, we lean into strategic partnerships, where we did not have to invest in traditional marketing channel, which resulted in an organic user acquisition rate of 70%. We know that dedicated Pet Caregivers who have chosen to provide their services to us have contributed to our success, which is why we are constantly collecting feedback to ensure that Pet Caregivers are equipped with the tools they need to not only have a successful service, but a prosperous book of business. By investing into the Pet Caregiver experience, and not only the Pet Parent experience, we are distinctly positioned to maintain a strong leadership position within the supply side of the market. The average price that Pet Caregivers are paying to join the platform was from around 41.50 in Q3 to around 53.30 in Q4 and even further from the 29.95 at the start of the year based on real time supply and demand equilibrium, but there's reason we have been able to maintain a negative supply side CAC. Before I passed the call over to Adam to discuss our growth initiatives, let me summarize why I'm so bullish about the future for our shareholders and positioned as a category leader in the pet care industry. Two, we have the capability to grow while sustaining impressive operating margins as a result of our performance driven culture, our exceptional talent, the inherent cross-out capabilities within our platform, as well as the cross markets within the pet industry and the continued humanization of pets paired with our customer-centric technology. is an accessible, multi-faceted platform that is consolidating the fastest growing secular growth areas within the pet industry. One, accelerate growth in existing markets; two, expand premium subscription offerings; three, platform expansion; four, opportunistic M&A; and five, operating scale. We made significant progress in 2022 accelerating growth in existing markets, capitalizing on the slow and steady return to office and post pandemic activities. At 50% return to office per the Kastle Back to Work barometer, we have significant room to run in 2023. Coming out of the pandemic, there is an influx of new pet parents who will also participate in the return to normal shift and will need to utilize our non-discretionary services. With the continued trend in the humanization of pets, we believe we are entering a secular trend in the pet health and wellness categories led by millennials and Gen Z many pet parents increasingly consider the needs of their pets, not just equally important to those of the rest of the family but more important. Approximately 70% of U.S. households, or about 91 million homes owned a pet as of 2022 and 70 million of those are dog households. Of those, we specifically target the premium pet parent or roughly 15% of households in the current market who have a proven propensity towards premiumization across pet categories. In 2022, we hit our long-term premium penetration target of 50% due to the success of our second growth driver expanding premium subscription offerings. We plan to continue testing premium pricing tiers, subscription tiers and product bundling throughout 2023 to grow revenue and drive additional value to the pet parent. As a result of our testing in Q4, we are raising prices for new premium pet parents to $14.99 per month. As a reminder, Wag! premium subscribers receive a 10% discount on all services, VIP customer support and unlimited 24x7 expert pet advice, which drives customer satisfaction and retention and their willingness to cross sell to our expanding set of products and services. Third, we continue to focus on platform expansion in diversifying the products and services within the platform, including new features such as Browse & Book refined search, which helps pet parents find the perfect match based on pet caregiver specialties, notes from pet caregivers, allowing them to make a more informed decision before requesting a service. And the launch of super and ultimate endorsements, which allow colleagues and existing pet parents to boost a pet caregiver at the beginning of their small business journey to show the pet parent community how great the pet caregiver is. 's partnerships add value not only to us, but our pet parents as well. In the fourth quarter, we acquired Pharmacy Inc, a concierge prescription and compounding service that delivers pet health directly to the pet parent store. entry into the pet food and treat category by successfully completing the acquisition of Dog Food Advisor in January, which helps busy pet parents decisions about dog food through the website dogfoodadvisor.com. We're laser focused on our unit economics and fixed costs operating leverage, which drove operating margin improvements across the board. In 2023, we continue to build our platform by investing in growth levers with a faster payback cycle, low fixed costs, and low OpEx. team as we grew the business through diversified revenue stream, launched new products and executed with operational excellence. Closing out, our outstanding year Q4 '22 was another record quarter for the highest quarterly revenue since inception, totaling 17 million, up approximately 110% from Q4 '21. Adjusted EBITDA loss for the quarter improved 2.4 million, compared to 2.5 million in Q4 '21. On a full year basis, full year '22 revenue increased 173% to 54.9 million, compared to 20.1 million in '21 while adjusted EBITDA loss improved to 3.9 million, compared to 9.9 million in '21. As expected, we saw a shift of pet parent needs from walking to sitting and voting in the fourth quarter in line with the usual seasonal demand mix to inclement weather across the country. We also experienced continued strong demand for wellness services, which contributed to 66% of revenue in Q4 '22, compared to 45% in Q4 '21. Our wellness suite of services include valuable offering, such as expert pet advice, wellness plan, pet insurance comparison options, and new in '22 pet prescription and compound medicines at their pharmacy. Turning to expenses during the fourth quarter, cost of revenue excluding depreciation and amortization was 1 million in Q4, '22, or 6% of revenue compared 2.8 million or 10% revenue in Q4, '21. For the full year, cost of revenue excluding depreciation and amortization, with 4 million, or 7% of revenue, compared to 2.8 million or 14% of revenue in '21. The dollar amount increase with a direct result of increased demand driving incremental payment processing fees and background check costs via increase in pet parent, pet activity and caregiver applicants. Platform operations and support expense was 2.8 million in Q4, '22, or 16% of revenue, compared to 2.6 million or 32% of revenue in Q4, '21. For the full year, platform operations and Support expenses 13.8 million or 25% of revenue compared to 10.3 million or 51% of revenue in '21. While there has been an increase in expense in dollar terms year-over-year, driven by personnel related compensation costs and stock compensation expense as we hire and retain talent, perform operations and support expense of more than half as a percentage of revenue as a result of operational scale. Sales and marketing expenses 10.5 million in Q4, '22, or 62% of revenue, compared to 65% of revenue in Q4, '21. For the full year, sales and marketing expenses 35.2 million or 64% of revenue versus 10.2 million or 51% of revenue in '21. G&A expenses 3.9 million in Q4, '22, or 23% of revenue, compared to 2 million or 25% of revenue in Q4, '21. For the full year, G&A expenses 32.4 million or 59% of revenue, compared to 7 million or 35% of revenue in '21. When excluded for like-for-like comparison, G&A expense represents 21% of revenue in '22, which is a decrease of 14 percentage points year-over-year. The dollar amount increase in G&A expense is driven by personnel related compensation costs and stock compensation expense as we hire and retain key talent, M&A related costs and public company complaints including expenses related to the compliance with the rules and regulations of the SEC, and NASDAQ via legal audit and consulting fees. This compares to an adjusted EBITDA loss of 2.5 million in Q4, '21. Turning to our balance sheet, we ended the fourth quarter with over 39 million in cash and cash equivalents. Our balance sheet remains strong in the context of our operating cash use and puts us in a strong position to comfortably fund our growth objectives, while also maintaining flexibility to pursue strategic M&A when we believe the opportunity aligns with our goals. Including all headcount counting platform operations and support, we reached 0.8 million revenue per employee based on a Q4 '22 run rate, well ahead of industry peers. We are building a team of best-in-class builders, doctors, designers, founders, engineers and pet lovers. In addition to building a great business, we are also passionate about building a great company and that can only be done by fostering a strong culture and dedication towards our customers and our community. We are measuring, managing, and reporting on some of our key diversity, equity, and inclusion metrics and priorities, which we look forward to sharing with you in our upcoming 10-K. Moving to our guidance for '23, as Garrett mentioned, we are very pleased with the strong performance we saw during the fourth quarter and the year. As a result, we are raising our full year '23 guidance that we previously included in our April '22 investor day. For the full year '23 we now expect total revenue in the range of 75 million to 77 million, an increase of 37% to 40% year over year, and a 7% improvement versus our prior forecast at the midpoint of the range. Adjusted EBITDA loss in the range of 0 to 2 million a 91% improvement versus our prior forecast at the midpoint of the range, this range contains multiple levers including sales and marketing spend, product development and expansion and pricing power. The accreted impact from the acquisition of Dog Food Advisor in January '23, which we expect will contribute 3 million of revenue and 1.5 million of positive adjusted EBITDA in â\u0080\u009923.Continued acceleration and wellness, including new ventures, expansion into additional markets, testing and bundling of Wag! In summary, as illustrated by our strong Q4 '22 and full year '22 results, we have been and are currently experiencing demand in the face of a very dynamic backdrop. Our ability to execute on that demand, achieve results above our previously announced plan, focus on operational excellence, and integrate and operate well thought out enterprises through M&A is a testament to our business strategy for '22 and for the future. Your line is now open. Premium Penetration, I think you've exceeded kind of that long-term target you first talked about. So, I would say the primary motivation at $14.99 price point is finding the  price point price, ultimately, the right price for the current bundle of Wag! That said, we're going to continue to test price and different bundling combinations that might be priced lower or higher $14.99 was just kind of the optimal given the current benefits. But curious how that's been performing, obviously, a lot of the earnings results we've heard from the OTAs and stuff suggest that consumer travel, that recovery has been very robust. But just curious, like how you guys think about overnight stays as kind of a compelling opportunity, maybe an opportunity for you guys to increase your share there. But I saw that Browse & Book feature, which would maybe seem to appeal to pet parents who are contemplating a longer stay, maybe just comment on kind of that opportunity around overnight today. So that means solving their needs, whether it's overnight care, and that's sitting in boarding drop-ins, which is reminder, we launched 20, 30 and 60 min drop-ins in totality across the U.S. in 2022, which are really great for cats, and kind of non dogs, or even sometimes senior pets pups. So, we're going to continue to build tools to enable great sitting in business and  to it in the last few minutes. It was certainly a healthy sitting on boarding time for the business as it usually is in Q4, particularly driven by incremental travel longer stays, unfortunately, due to a lot of just functional, like flight cancellations lever. So yes, it was just a great feat, I think we'll continue to lean in. And one moment for our next question. Your line is now open. Anything you saw in terms of churn as you raise price with the $14.99 to your, maybe if you could also just clarify when that was implemented and sort of how far along you are in terms of implementation on the tiered pricing? Usually, we expect to see some degree of we'll call seasonality in Q4, as a function of the services business transitioning from what we'll call high frequency services, things like daytime walking and drop ins to longer duration overnight stays or dropping at certainly what we saw in this quarter, and will probably, I mean, I don't know for sure, we'll see what the trend looks like this year, but I'm assuming that'll be a consistent trend in our business. And then I guess just in terms of the '23 outlook, wanted to see if you guys could clarify or help us understand services versus wellness in the outlook there, it was helpful to have Dog Food Advisor broken out. We're really excited about the wellness business, with great leadership. They're a phenomenal team in place, just generally incredible things happening there as you can see, in Q4. Again, we're leaning in to all parts of the business, what we're really trying to do is just maximize our ability to recycle capital efficiently and our tight times timescale, and so wellness has demonstrated that. First to really think about as like an optionality, something we're excited to test to get integrated. But again, that is a California specific pharmacy and compounding business that's working directly with vet clinics and pet parents. You'll probably continue to see us do that, but it's not a material part of the wellness is revenue today. And one moment for our next question. Your line is now open. But also wanted to get a sense for what you were seeing on your wellness platform and whether or not growth there is being driven more by engagement on the insurance marketplace or if that's coming a little bit, you know, more from the other portions of that segment. In terms of seasonality, again, I think we generally expect Q4 to be a unique time period for the business where our services platform participants specifically transition from high frequency daytime to more overnight. I would say that yes, the Kastle Back to Work barometer is a great indication we've mentioned that a few times in the past, about how services pet parents are thinking about their pets as people return to office. They think about their pet's wellbeing, talking to a vet, maybe buying insurance, maybe needing their pet's RX and things delivered instead of picking it up. So all those  and certainly, we think that Kastle and the go forward trend is a reason why we updated guidance frankly from our original forecast, and I think you're seeing it with Amazon and Disney and everyone else. We love that they can, you know, look through reviews for great pet insurance companies. And so, I wanted to get a sense for what we saw here in Q4, if that's kind of more of a new baseline. And look, I think that the way we think about the business, Jeremy at this point in 2023. It's just where do we -- are we going to be investing incremental dollars to maximize output for this, functionally our job, obviously. But really, it's headcount, sales, marketing, possibly M&A. But I think Q4 is a pretty good indication of G&A trends, that might be other opportunities, that would be surprising, and we'd share with you if that was more M&A, or things like that, but I don't expect that. And then last one, for me in terms of what you're seeing from, key competition, whether it's the kind of dollars being spent, to attract new customers, or whether it's competition for kind of the existing set. And so again, I think originally said was, well, I targeted three to one, we were six, seven to one, I think, the trend is really good in terms of LTV to CAC, or recycling these customers really quickly, and payments goes back really quickly and efficiently. I think generally last year, Jeremy, we said that we think this year, there'll be a huge opportunity to be really thoughtful about marketing, we thought this would be kind of a culling of D2C companies and brands, who will have to pull back pretty significantly as interest rates rose, as the network's functionally changed, whether that was Facebook or Apple. And we're seeing that, we're really good at marketing. Frankly, we're really good at partnerships, we're really good at really just building relationships with customers. If anything, we've seen it be a bit less, I wouldn't say competitive, but a bit less noise in the marketplace. And again, we're just going to be really disciplined with the dollars we allocate. Last one, we didn't talk as much on this call on your pet caregivers, and you've experimented in terms of the fee charged to join the platform. And one moment for our next question. Your line is now open. Now, that you've clearly shown to your point, you're good at marketing, you've got very nice leverage in the business of the past year. And I think we're getting to a point of real revenue scale, hopefully happen the back half of this year. So I don't think this business is in a position anytime soon to be just pumping out dollars functionally, there's too much opportunity ahead. We're really going to continue to lean in thoughtfully, but I don't think that's going to be at a significant cost basis to our shareholders. The second one in terms of geography, look, the Kastle Back to Work barometer is a great indication for kind of what you're seeing with pet parent trends generally. As you think about it, like I think we're at 50-ish percent earlier this month or in January, but like the biggest markets are lagging the average LA, SF, New York City, etc. So, we think there's kind of outside room to return to normal in the upside case, or only, we're certainly planning for that. And one moment for our next question. Your line is now open. So I guess to return to the subscription service, it's pretty impressive that you see pricing power in that monthly product. One thing I would remind us, Brian, is that we are significantly ahead of where we thought we'd be with premium penetration. And I think there's a couple reasons for that, one is we've added so much value to that subscription since we started that it's just we're really just catching up in terms of pricing. Premium pet parent, it's just a really delightful experience. But you saw, I think in the LTV graph we published in our deck last year kind of each cohort of pet parents outperforming the previous, that's generally our goal with operators and builders and engineers and product aficionados. So I don't think we would do this with, we thought it was going to be a drag coefficient, frankly, anyway we actually think it's going to be a tailwind. And then I guess turning over to Dog Food Advisor, it's great to see that accrete Q1. So first and foremost, if you think about pet parents, every single person who owns a pet has one thing in common. And so the idea that we now have Dog Food Advisor, which we believe is really the premium number one pet food recommendation engine on the web, we can tie that really, really nicely into our own ecosystem. We can get really intelligent offers in front of our own services pet parents, pet parents might be buying pet insurance at the right time. And then two, on the other side of things, when you're thinking about food and you're purchasing food, maybe for the first time there's a bunch of levers then to go back and upsell things like services or finding the perfect pet insurance plan. But we're very, very excited about having something that's so evergreen for the pet parent."
}