{
    "symbol": "MAR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 12:41:07",
    "content": " While signing activity has been picking up nicely 2022 gross room additions are expected to be impacted by the diminished construction starts the industry has experienced throughout the pandemic, particularly here in the U.S. With financing starting to ease a bit, the industry has seen a notable ramp up in new construction starts in the first quarter, but they are still well below 2019 levels. With the recent widespread easing of travel restrictions in many regions, employees returning to the office in greater numbers, increasingly positive travel sentiment, and our team's focus on ADR, we're even more optimistic than we were a quarter ago that we'll see meaningful additional global RevPAR recovery this year, assuming no major change in the global economic environment or the behavior of the virus. Hi, good morning, everyone. But on the credit card part, which is, as you know, you know, well over half of the total number of, for example, 170 in the first quarter, I think steady as she goes, not willing to give a particular growth percentage, but I think it is really both a combination of strength of the consumer, so we're assuming that there's not a big change in the macroeconomic picture, and then number two is the connection to Bonvoy and to our overall system. Hi, good morning, everyone. They were again, roughly 40% coming from the U.S. and Canada and frankly, that's only down so call that $40 million, that's only down from the high $50s millions in 2019, while RevPAR is obviously still down in the mid teens for those hotels in the U.S. But again, one of the points that that I made during my comments, we're really pleased to see the margins being similar to 2019 levels and we're hopeful that that will continue for the rest of the year that we're able to hold on to this kind of margin performance for the full year for these manageable service hotels in the U.S. and that will obviously get us more IMF."
}