{
    "symbol": "MAR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 13:07:07",
    "content": " By the last month of the quarter, RevPAR in all regions outside of Asia-Pacific had more than fully recovered to pre-pandemic levels, leading to June global RevPAR 1% above 2019. It has been very encouraging to see demand come back so powerfully in major cities like New York, where RevPAR increased 7% versus June 2019. Second quarter RevPAR was down 22% compared to 2019 given the lack of travelers from Greater China and the fact that rigorous travel restrictions remain in place in Japan, one of our largest markets in the region. On a worldwide basis compared to 2019, we could see RevPAR flat to up 3% in the third quarter and down 6% to down 3% for the full year. So when we look at the rest of this year, from whatâ\u0080\u0099s on the books currently, we are seeing low single digits for the rest of the year in terms of group revenue, while next year, weâ\u0080\u0099re still kind of in the 15% down, but I think you need to continue to think about this booking pattern, which is much closer to the actual event that has been filling in really nicely. So itâ\u0080\u0099s not that different for â\u0080\u009823 versus a quarter ago except from what weâ\u0080\u0099re seeing in the quarter for the quarter, and even in the back half of â\u0080\u009822, weâ\u0080\u0099re seeing some really great fill-in business that has got us pretty close to â\u0080\u009819 levels where we could end up actually exceeding â\u0080\u009819 levels in the back half of this year. And I think just to give some context to that, we still saw in the second quarter in the U.S. and Canada, luxury rate up 23% in the quarter versus â\u0080\u009819. So, letâ\u0080\u0099s talk super high level at first, which is that if pre-pandemic, we were in the, call it, 18% to 19% sort of cross-border travel around the world that, that number fell and was down in the â\u0080\u0093 a little bit north of 10% and then has clearly moved back up several hundred basis points, particularly as we got into Q2."
}