{
    "symbol": "YOU",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 10:45:07",
    "content": " We have with us today Ms. Caryn Seidman-Becker, Co-Founder, Chairman, and Chief Executive Officer; and Ken Cornick, Co-Founder, President, and Chief Financial Officer. As a reminder before we begin, today's discussion contains forward-looking statements about the company's future business and financial performance. At the same time, travel infrastructure proved to be far more fragile than anyone could have imagined. CLEAR's mission, platform, and products are a critical part of the solution to make travel safer and easier. On a sequential basis, we added 8.5% to our Ambassador Workforce across airports nationwide as we saw opportunities to enhance service and grow our member base. There is a new saying in travel, Every day is now the Wednesday before Thanksgiving. The Phoenix Airport, local TSA, and the Phoenix CLEAR team worked together seamlessly to process a record 84,000 passengers on the Monday following the big game. When we think about how we will securely scale friction-free travel experiences, we are excited about our alignment with our airline partners. In January, we renewed our multiyear partnership with United Airlines exemplifying the power of collaborative innovation. Together, we are focused on bringing new technology to enable friction-free travel experiences to United travelers. For example, the consumerization of healthcare is quickly becoming a reality with the implementation of the Cures Act empowering people to access and control their healthcare data. We have built an at-scale nationwide network in a regulated environment, which positions us well to play an important role in healthcare. As always, we remain focused on growing members, bookings and free cash flow. When evaluating new opportunities, we look at holistic comp including non-cash comp in our return on investment analysis. In 2022, we issued 1.47 million net new RSUs to employees representing less than 1% of beginning common shares outstanding. In 2023, we expect to grow free cash flow before and after employee and founder stock comp. While it is now in vogue to talk about rightsizing headcount, we have always been methodical about our cost structure and want to highlight CLEAR strong incremental margins. In Q4, OpEx excluding United warrant expense and other unusual items grew 23% year-over-year roughly 40% of our revenue growth rate. The United partnership renewal unlocked 534,000 warrants which vested and converted to Class A common stock in 2023. In Q4, we also recognized $6.1 million of non-cash equity expense related to 617,000 performance RSUs issued to employees prior to our IPO, now deemed probable to vest in 2024. Total cash and equivalents as of December 31 was $735 million and reflect the $38 million special dividend paid in December, as well as $5.4 million used for net settled RSUs. As we look to 2023, we are well positioned to grow members, bookings and revenue, while delivering operating leverage and free cash flow growth. Like last year, our bookings guidance implies a sequential decline from Q4 to Q1, consistent with pre-pandemic patterns. Because CLEAR Plus builds annually, our quarterly bookings trends are dependent on the renewal backlog entering the year. Please proceed with your question. When you think about the enrollments which came in, I believe, up 48% to $15.4 million, how are you thinking about enrollments going forward? If you look at coming out, we launched eight new airports last year. And since COVID -- or since we went public, I think we went public at 33 airports at the end of June 2021. So you'll see growth in airports that have been opened quite a long time, as we've talked about historically, growth in new airports and then new airport growth as well. And so I think, you'll see both of those trends continue in 2023. In terms of costs associated with that, I'll let Ken talk about that, and then I'll talk a little bit about the health care total addressable market. In terms of the unit economics of the business, actually, you'll see in the K, when we file that later today, our unit economics improved on a year-over-year basis. So we talk about LTV to CAC, and you'll see that, that has actually improved in '22 versus '21, partly a function of cost of acquisition going down year-over-year. And as Caryn mentioned, as we have added to our network, both on the airport side and on the platform side, the network effect really drives unit economics. And so, we don't see anything specifically in the horizon that would change the dynamics of the business. In terms of health care, Dana, both WellStar and Uhealth, our leading health systems in their region. And when you look at the TAM of systems just like that, we think that there is over 6,000 similarly situated health systems in the US. And I think you're seeing many signals in the marketplace that the consumerization of health care, which has been long talked about, is taking hold. And when you look at the Cures Act, which was passed several years ago, but only being implemented now, identity is foundational in order to make health information acceptable to patients. So we think that these are very early days and if you just look at UHealth and Wellstar, there's an enormous total addressable market out there. Please proceed with your question. So, in terms of investment, we are opportunistic when it comes to capital allocation, and that includes marketing spend. And so, the way we think about it is, we'll be opportunistic around the opportunity to grow our member base like we were in this past quarter. So, the launch of PreCheck, which we expect in 2023 and was not included in first quarter guidance is an opportunity to introduce people to different ways to experience airport security and both on a stand-alone and a bundled basis, we think there's opportunities there. The power of the network effect has shown itself over the past 13 years and our incredible ambassadors on the floor, which we wrote about, are also a different form of what people think of as historical marketing spend. As we add more partners to the platform, it adds more members and there's an opportunity right to upgrade people who have joined the CLEAR platform to right from B2B over to B2C. And it's not your â\u0080\u009chistoricalâ\u0080\u009d marketing spend, which really gives our platform and our team opportunities to flex creatively to drive growth in an economically efficient way. It was even stronger than what I would have expected here, you still talk about moderating to the upper 80% range. I mean, it's definitely happening slower than we would have expected. And so we think it settles in the upper 80s, but it is absolutely happening slower than we would have anticipated. And maybe I'll just sneak one more in on the current expense run rate versus your long-term model, it seems like G&A is one of the still well-above where the long-term model is. So G&A is -- we think we're going to get operating leverage really across the board I would say with the exception of cost of revenue share fee that should remain more stable than the other line items, but G&A certainly being the most leverageable line item. And beyond the typical things that you would expect in there such as rent and the regular overhead there are credit card fees, which are variable. Now obviously as platform becomes a larger percentage of the mix, credit card fees don't apply to the B2B business. So there are a few things that are variable, but it's largely more overhead type of things. And if you just look this quarter on a clean basis if you strip out some of the unusuals, you had probably around 2,000 basis points of operating leverage in Q4 last year to Q4 this year just on the G&A line item. Please proceed with your question. Very nice quarter to finish the year, very strong cash flow. And so, I do think, if you look at -- and it's public information sort of the top 100 airports in the US, we think that there is high applicability in the 70-ish range of those airports. So we now think of CLEAR more broadly, but we're talking specifically in this case about CLEAR Plus airports lanes. And then internationally, we do think that it's very exciting to be building the relationships, the dialogue and the experience leading with the reserve product and we're seeing success there. And so whether or not that hit this year, it's too soon to tell. But we do think when you look at the surge on travel and the challenges travel hard and getting harder, it is not just a US phenomenon but a global phenomenon. Just on the unit economics of the smaller airports, in terms of number of lanes, it completely depends on the configuration of the airport. So we're able to, basically get to breakeven well under a year on those airports. Are they overall higher and if you could expand on other kind of key target airlines credit card companies, travel vendors you're engaging with. Yes, the renewal rates are quite high for our AmEx Platinum as you would expect, above 95%. But if you look at the AmEx fourth quarter, they announced $3 million net new cards added. The one that you specifically asked about is on the curb, that's just as a marketing channel for us, which is successful but it's not material for us. And then in terms of your other questions in terms of new partnerships, we are talking to additional airlines. We do think the partner channel is our best avenue for growth and our most efficient avenue for growth, and it's been very successful for us. I'll talk a little bit about what we're seeing in the first two months, which is strength. January always slows down a little bit, but versus December from a sequential basis. But I would say that, you just see continued strength record days and people out there traveling and wanting better experiences as they travel. I think, we started talking about being thoughtful of the economic environment probably in our third quarter earnings. People want to travel, people love travel, and business travel has been coming back. And so I would say that, that is probably the new addition over the past few months, but you just see continued strength. And as far as trends versus pre-COVID levels we talked about a 32% CAGR for Q4, our guidance which excludes pre-check implies I think around a 30% CAGR from 2019 pre-COVID levels. Please proceed with your question. I guess Caryn going back to the conversation about sort of the airports that you're in, what you've been adding and the new lanes that you've added. Is there any useful way you can describe to us where you guys think you are I guess like heat map wise relative to what you would consider to be optimal penetration in the US, even if the anecdotal. Not exactly, when you say heat map wise do you mean MSAs and where people live or where they're going or what are hot new areas in the US. And again, when you look at the top 100 after the top 60, you see a deep decrease in enplanements. And so the economics not only of those smaller airports, but of the network are accretive and strong. We're building products for all travelers, whether you travel once a year with reserve free for the consumer or once a week with CLEAR Plus. And so I don't have an exact answer except to say, we build strong partnerships. That's a very exact and an appealing answer, I'm sure. It's just travel is so strong and there are so many opportunities to transform the passenger experience from the parking and the rental car piece to bags, to security, to concessions and then, all the way back on the other side. We are excited by the robust growth in CLEAR Network, I just said and welcome Kansas City, 51st Airport in the CLEAR Plus network, which launched yesterday. On the B2B side, we continue to believe powered by CLEAR is a significant opportunity for growth. At CLEAR, we're focused on innovation to ensure a scalable and friction-free passenger experience for all travelers, whether you travel once a year or once a week."
}