{
    "symbol": "CPF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 15:10:27",
    "content": " I'd like to turn the call over to Mr. David Morimoto, Senior Executive Vice President, Chief Financial Officer. Thank you, Hannah and thank you all for joining us as we review the financial results for the fourth quarter of 2022 for Central Pacific Financial Corp. With me this morning, our Arnold Martines, our new President and Chief Executive Officer, and Anna Hu, Executive Vice President and Chief Credit Officer. During the course of today's call, management may make forward-looking statements. As we normally do, I'll start with an update on the Hawaii market and a summary of our strong fourth quarter results. Then I'll turn it over to the team to provide additional detail and insights on our financial and credit metrics, as well as other key updates. Visitors from Japan are about 20% of pre-pandemic levels, and we are optimistic that the Japan counts will continue to trend up as a country is now fully reopened and the yen value has improved recently. The Japan government also upgraded its 2023 growth projections in December based on expectations for higher business expenditure, substantial wage hikes, and robust domestic demand. Japan may avoid the global growth slowdown, which will translate to greater visitors to Hawaii, helping offset a potential slowdown in domestic visitors. Hawaii visitors spending is strong, totaling 1.5 billion in November, an increase of 13.7% compared to the same month in 2019. Hotels in Hawaii continue to perform well with total statewide hotel occupancy at 71% and an average daily rate of $440 in December, up 4% from a year ago. Our statewide seasonally adjusted unemployment rate was at 3.3% in November, 2022, and is forecasted by the University of Hawaii Economic Research Organization to be fairly stable in 2023. Housing prices in Hawaii remains very strong with a total Oahu median single family home price at 1.1 million in 2022, which is up 11.6% from the previous year. This combined with the fact that tourism is expected to remain strong and the Hawaii economy is also supported in a big way by a huge and growing military presence, it is our strong belief that Hawaii is less likely to experience a material downturn compared to most other U.S. markets. Overall, we remain optimistic about the Hawaii market and believe CPF will continue to be successful as we remain focused on our strategic pillars, including home ownership, small business, digital adoption, and Japan market development. We ended 2022 with solid loan and deposit growth, an increase in net interest income, and strong expense management, which resulted in an improved bottom line. For the full year 2022, the loan portfolio grew by $454 million or 8.9%. We have a healthy loan pipeline and anticipate continued strong loan growth in 2023 in all loan categories except Mainland, unsecured consumer. In Q4, we began to let our Mainland unsecured consumer loan portfolio runoff until the national economic outlook improves. With that said, we expect runoff in our unsecured consumer book will moderate overall loan growth in 2023, which we expect to be in the mid single digit percent range. During the fourth quarter, total deposits increased by $180 million or 2.7% from the private quarter as we were successful in acquiring significant time deposits, which enabled us to reduce our borrowings and manage our funding costs. While deposit rates have increased somewhat, the Hawaiian market continues to be rational on deposit pricing. CPB strong and stable core deposit base enables us to keep deposit repricing betas low, consistent with past tightening cycle. Going into 2023, we have already started to implement strategies to not only retain deposits, but to garner a larger share of core deposits to fund our future asset needs. I'll now turn the call over to David Morimoto, our Chief Financial Officer. Return on average equity was 18.3%, and our efficiency ratio was 59.56% in the fourth quarter. For the full 2022 year, net income was $73.9 million or EPS of $2.68. Importantly, full year 2022 pretax, pre-provision income excluding PPP income increased by $29.1 million or 45% year-over-year. When excluding the impact from PPP, the net interest margin increased by three basis points sequential quarter. We continued to manage deposit repricing to product segmentation, and thus far our interest bearing deposit repricing beta has been approximately 15%. Fourth quarter other operating income was $11.6 million, which increased by $2 million from the prior quarter, primarily due to higher BOLI income. This included certain non-recurring death  benefits totally $0.6 million, as well as the higher income driven by equity market gain. Our expense run rate will increase modestly in 2023 to the range of $40.5 million -- $42.5 million per quarter as we continue to invest in our people, facilities and technology. Going forward, we expect the effective tax rate to be in the 25% to 26% range. Our capital position remains strong and during the fourth quarter, we repurchase 241,000 shares at a total cost of $4.9 million for an average cost per share of $20.41. Additionally, our Board of Directors declared a quarterly cash dividend of $0.26 per share, which will be payable on March 15th to shareholders of record on February 28th. We continue with our conservative underwriting policies, including tight LTV and concentration standards, and 83% of our loan portfolio is in Hawaii. For the lending we do on the U.S. Mainland, loans are typically commercial and commercial real estate participation with larger banks and markets we are familiar with, and our consumer purchases are from established lending partners. Our construction portfolio is just 3% of total loans, and our Mainland consumer unsecured portfolio is 3% of total loans. At December 31st, non-performing assets to total assets were 7 basis points, or $5.3 million. Our net charge-offs were $1.7 million for the fourth quarter, which equates to 12 basis points annualized as a percent of average loans. In the fourth quarter, we recorded a $0.6 million provision for credit losses due to loan portfolio growth and net charge-off. Central Pacific Bank had a great year in 2022, and we continue to be well-positioned to continue deliver strong performance in 2023. You talked about it being a more rational market, and that's what we've seen historically. And any other updates on your -- the other deposit initiatives that you've been working on, both from the Japanese and the tech side. But as I mentioned in the earlier comments, we were successful in bringing in about $180 million. The way we look at this is that, while deposit rates have increased, we're looking at funding costs in general. As far as the market itself, I mean, further impact of continued Fed tightening and yield curve movements on deposit bonds is yet to be seen. So, obviously, we're actively managing our funding sources and ensuring that we're optimizing performance to this operating environment. And with regard to where we're focusing, of course, we're focused in garnering more core deposits. We had -- we're about a $1 billion now in Japan deposits, and that was up about $22 million quarter-over-quarter. Japan is opening up as I mentioned earlier, and we feel good about the opportunities that we have in -- bringing in deposits from Japan. So, generally, kind of challenging environment, but, teams doing a good job in managing funding costs overall near term. And I think, longer term, obviously, we're well very well positioned in the marketplace. We're fortunate obviously to have a strong core deposit franchise that provides over $6 billion in stable, relatively low cost funding. As Arnold mentioned in the current rate cycle, we are proactive in using CD specials to retain some more rate sensitive balances with CPB, while also attracting new deposit balances at reasonable cost. Our deposit pricing strategies that we're implementing in this rate cycle are very similar to what we used in the 2015, 2018 rising rate cycle. And then, I think finally, if you exclude government deposits from the sequential quarter growth, customer deposits grew $85 million or 5.3% linked-quarter annualized, and I think that's pretty good performance in this operating environment. And maybe just kind of taking this into context with kind of the loan growth and the improved pricing side, I guess, how do you think about rate sensitivity and maybe the NIM trajectory as we look forward, just -- as we talk about a discipline on the deposit side, beta are accelerating, but more rational market and then, assets continue to reprice higher. I'm just curious how you think about your ability to defend the margin and maybe the NIM trajectory as we go out throughout the year and over the course of the year, yeah. The guidance for net interest margin right now is 310 to 320, so it's kind of guiding to a flattish NIM going forward. It's -- like, it's an invitation only, so the app is available, it's operating, but we're only inviting customers from the Swell waitlist to join. We're going to do a lot of test marketing, and customer acquisition beginning in the first half of this year. But it â\u0080\u0093 we -- as we've talked about over the last several quarters, we've really -- we've slowed down the rollout of Swell as a result of what we've been seeing in the broader FinTech market. Obviously, there's been a lot of turmoil in the market. So, we've decided to slowdown and we're observing what's happening in the FinTech marketplace. So, rather than millions of unprofitable customers, we're looking for a smaller amount, a hundred thousand or profitable customers. I'll start by just saying that I think, near term, we're probably going to see a 50/50 mix time deposits and core. As I mentioned earlier, I don't see it -- this is a near term dynamic that us and every other bank has to manage through. I think, we're going to get back as Fed's start to ease rates in the future. On DDA, there's obviously a lot of interest in DDA. So, pre-pandemic, it was 28% of total deposits. At the end of last year, it was 31%. So, there's 3% differential to pre-pandemic, that's about $200 million, roughly $200 million in the in deposits. So, we're thinking maybe we have $50 million or $100 million more normalization on DDA balances, and obviously we're doing everything we can to keep that to the lower end of that range. Generally, it's for the next couple quarters. Obviously, an operating environment is very volatile and a lot of things can change, but that's what we're guiding for the next couple quarters, Andrew. We've been repurchasing about 200 to 252 -- 200 to 250,000 shares per quarter. And then, I guess off of that, I thought you were ceasing Mainland unsecured consumer. So, is this pilot testing then just in Hawaii, or help us think about that. I'll start on the Mainland unsecured consumer, and then I'll turn it over to David and he can speak to Swell. But yeah, we -- as I mentioned earlier in my comments, we are suspending Mainland consumer unsecured purchases until such time that we believe the outlook, the national outlook, economic outlook is improving. So, near term, pretty much full suspension of the Mainland consumer unsecured. So -- but as far as, Hawaii, we're continuing to be very active there on consumer, and in our whole market. And also we're still looking at auto, auto loans as an area where we believe it's acceptable risk given the -- what we saw in the past, in the last recession, it actually performed pretty well as far as the data points that we're looking at. So, generally speaking, we're open to auto, but in any event, on mainly unsecured consumer, we're just basically suspending for now until the national outlook improves. And just a clarification, when Arnold's talking about suspending Mainland unsecured, that's on the purchase side, Laurie. So, we're not suspending Swell, but we're continuing the very deliberate and gradual rollout of Swell. So, at year-end -- to give you an idea, we have about less than a hundred customers on the platform. We are planning to do some test marketing in the first half of 2023, but we don't anticipate the balances to be meaningful at all. So, in other words, I guess as we think looking out to 2023, and you said you would ramp it up, that you're obviously not going to stay at 5,000 in loans. And then, can you help us think about, I mean, your credit is pristine outside of consumer. The consumer piece, it looks like you had $1.07 million of charge-offs. Can you help us think about, of that $1.03 million, how much came from the Mainland piece? So, for our consumer unsecured book at the end of fourth quarter, it was just about $316 million. So, we did increase slightly from the 310 we talked about at the end of third quarter, and that was because we had a couple of orders in place that we did need to fulfill. With regards to the charge-offs, about $900,000 is from the Mainland consumer book. The breakdown was about $200 in auto, about $280 in our home improvement and about $450 in our unsecured consumer. So, December spot was 317, which is flat to the full quarter. And then just to give you a little more color, spot interest bearing deposit costs in December was 73 basis points, which increased 10 basis points month-over-month, while December loan yields was -- were 420, which in increased 12 basis points month-over-month."
}