{
    "symbol": "IGT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 12:53:04",
    "content": " In the quarter, we generated over $1 billion in revenue, up 4%, as reported, and 8% at constant currency, driven by strong global same-store sales growth in lottery, record US and Canada unit shipments and global ASP in gaming and a 56% increase in PlayDigital revenue, fueled by growth in both iGaming and sports betting activities. For the full year, we generated $4.2 billion in revenue, up 3%, as reported, and 8% at constant currency on significant year-over-year growth in gaming and PlayDigital. A robust and resilient margin profile in Global Lottery, coupled with very strong operating leverage in Global Gaming and PlayDigital drove operating income to $922 million, up 2%, as reported, and 9% at constant currency. Global Lottery generated $639 million in revenue in the fourth quarter, down 7% as reported, but up 8% at constant currency if we adjust the perimeter for the sale of Italy commercial services in September 2022. Q4 revenue of $389 million rose 21% with double-digit gains across service and product sales categories, driven by demand for IGT game offerings, new cabinet solutions and add-on services. Significant operating leverage drove operating income up nearly 90% to $68 million and operating income margin to 17.6%, a record quarter period. On a full year basis, operating profit rose over 5 times to $242 million, exceeding 2019's level, on increased service margin and high-margin IP royalties in the first half of the year, and despite higher supply chain costs. Operating income increased to $17 million and operating margin rose to 25.5%, helped by strong top line growth, lower-than-expected jackpot expense and despite integration costs and continued investment in Thailand and R&D, to fund the future of this high-growth business. Strong operating leverage resulted in 51% profit growth with operating income reaching $50 million, and the margin expanding almost 400 basis points. Cash flows were very strong in 2022, with nearly $900 million in cash from operations and $582 million in free cash flow, generated from outstanding operational performance and ongoing discipline around capital management including, increased investments for future growth of about $80 million, year-over-year. For the full year, we currently expect to generate revenue of approximately $4.1 billion to $4.3 billion, operating income margins of 21% to 23%, cash from operations of between $900 million and $1 billion and capital expenditures ranging from $400 million to $450 million. For the first quarter, on the back of positive early trends across our three business verticals, we expect to deliver revenue of approximately $1 billion and operating income margins of 22% to 24%."
}