{
    "symbol": "XRX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 15:11:03",
    "content": " I couldnâ\u0080\u0099t be more proud of the effort our team expended in the fourth quarter to deliver the highest level of quarterly equipment revenue since 2019, an accomplishment that was instrumental in driving full year revenue and free cash flow above our revised guidance. And each of these priorities are reflected in our full year guidance, which calls for stable revenues amid a challenging and volatile economic environment and growth in adjusted operating income margin and free cash flow, the details of which Xavier will provide. Gross margin improved 190 basis points over the prior year quarter, mainly driven by a favorable shift in product and geography mix, lower supply chain-related costs and benefit associated with price and cost actions taken throughout the year, partially offset by ongoing product cost increases and the effect of recent acquisitions. Other expense net were $7 million lower year-over-year due to a $39 million benefit from sales of noncore business assets, partially offset by an increase in nonservice retirement-related costs and higher currency losses due to currency volatility in certain geographies. Working capital was a source of cash of $73 million this quarter, $120 million lower than the prior year, driven by higher accounts receivable on the use of cash to position inventories ahead of Q1, partially offset by a higher account payable. Additionally, cash used to fund finance receivable and operating lease was $169 million in the quarter compared to a use of cash of $50 million in the prior year, reflecting improved equipment sales activity and FITTLE growth strategy. Investing activities were a source of cash of $17 million compared to a use of cash of $31 million in the prior year due in large part to an asset sale in the current quarter, partially offset by slightly higher CapEx, which mainly support our investments in IT infrastructure. Segment profit was minus $5 million, down $30 million year-over-year due to a reserve release of $12 million in the prior year quarter, lower net financing profit, higher intersegment commission associated with higher Xerox origination, higher bad debt expenses and strategic start-up cost on investment. We expect to generate at least $500 million of free cash flow, including the benefit of FITTLE receivable funding solution. We gave you -- I gave you an indication in my earlier comment there, by saying we expect in 2023 free cash flow without FITTLE movement here, normalized free cash flow to be around 90% to 100% of adjusted operating profit. So business without FITTLE, as we mentioned it, 2022 was an anomaly in the way free cash flow came, specifically due to the margin pressure and the erosion of margin, specifically during the first half of the year. Now if you look at the normalized on what we have put and guided for normalized free cash flow without FITTLE for next year, you can count on around 90% to 100% of adjusted operating profit. So we will provide a comment or more information during the next quarter earnings on how we will potentially use and the return of this cash between shareholders and also we will invest for the business and in order to support what Steve just described before, the investment or the strategies that we have on high yield, low -- I would say, low time of return that we will have on a product like digital services, but also all the automation offerings and the workflow automation that we are pushing to customers."
}