{
    "symbol": "XRX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 12:56:04",
    "content": " Free cash flow was a use of $18 million compared to a source of $81 million in the prior year, an adjusted operating margin of 3.7% was lower year-over-year by 50 basis points. Equipment revenue grew 6.7% in constant currency or 0.8% in actual currency, marking the first quarter of equipment revenue growth since supply chain constraints began last year. While our revenue outlook declined only slightly, we are lowering our 2022 free cash flow guidance from at least $400 million to at least $125 million, both of which excludes $41 million onetime product supply termination payment. To be clear, our cash flow generation year-to-date has fallen well below our expectations due to our strategic decision to invest in FITTLE's growth, a slower-than-expected improvement in supply chain conditions and persistent inflation. Equipment backlog of $429 million declined slightly quarter-over-quarter, but remain well above historical level as improvement in supply chain conditions did not materialize to the extent expected. Profits were lower year-over-year due to a slight decline in revenue at actual currency, the effect of persistent high inflation on cost of goods sold on the slower-than-expected improvement in supply chain conditions, which negatively impacted product geographic mix. Adjusted operating margin of 3.7% decreased 50 basis points year-over-year, reflecting lower gross profit, higher bad debt expense and inflation-related operating cost increases, partially offset by lower R&D spending on project own it savings. GAAP loss per share of $2.48 was $2.96 lower year-over-year due to an after tax non-cash goodwill impairment charge of $395 million or $2.54, an increase in adjusted items, including higher non-service retirement-related and restructuring costs. Free cash flow was a use of $18 million in Q3, and was lower year-over-year by $99 million, driven by a $60 million increase in the use of working capital on an incremental $46 million of capital used to finance origination on operating lease growth at FITTLE. Working capital was a use of cash of $14 million this quarter, $60 million higher than the prior year driven by the late receipt of product in the quarter and an increase in inventory in anticipation of higher Q4 revenues. Additionally, cash used to fund an increase in finance receivables and operating lease was $54 million in the quarter compared to a use of fund of $8 million in the prior year quarter reflecting FITTLE portfolio growth strategy. Investing activity were a use of cash of $33 million compared to a source of cash of $18 million in the prior year due in large part to $41 million of cash used to acquire businesses on lower proceeds from the sales of non-core business assets, partially offset by lower CapEx. Adjusted operating income margin improved sequentially this quarter, but at a slower pace than expected due to the effect of supply constraint, geographic mix and the impact of higher-than-expected inflation across our cost structure. We remain on target to deliver $150 million of gross cost savings this year through Project Own It, but high level of inflation has caused a rise in operating costs above the level expected when we increased our savings target to $450 million in Q1. We lowered our revenue guidance from at least $7.1 billion to a range of $7 billion to $7.1 billion at actual currency, largely due to adverse currency movement onto a lesser extent, slower-than-expected easing of supply chain constraint. More than $150 million of the decrease in free cash flow guidance reflect a greater than expected use of working capital to fund origination growth of FITTLE on inventory, which was the larger-than-expected use of cash in Q3 due to late delivery of equipment. The remainder of the reduction in free cash flow guidance reflects a lower operating profit outlook for the second half of the year due to slower-than-expected improvement in supply constraint, page volume trends and stronger-than-expected inflation across our cost base, the effect of which we expect will normalize in 2023. Our team is working tirelessly to improve margin and working capital efficiency, and we expect significantly stronger free cash flow result in the years ahead, due in part to improvement in supply chain constraint and a leasing of inflationary pressure on our cost base in combination with additional strategic action. Since, I would say, two years now, and since we reinitiated reinvigorated FITTLE, due to the fact that FITTLE has a strong credit assessment capability, a good platform and the ability to expand beyond Xerox, the FITTLE team, management team has expanded well beyond the pure Xerox product on the what we have noticed in quarter three and what we are expecting from the team is growth outside of the Xerox, what I call, captive activity."
}