{
    "symbol": "EHAB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 14:23:05",
    "content": " These items were offset by an approximate $5 million audit recovery related to a prior year home health medical claims review, improved collections experience related to Medicaid in hospice and a 3.8% increase in our hospice Medicare reimbursement rate, effective October 1st. While all of these items fall directly to the bottom line, adjusted EBITDA, which decreased $8.7 million or 17.8% year-over-year, also includes higher cost of services and incremental administrative and general expenses as a standalone company. Our net leverage increased sequentially from the third quarter due to a $20 million draw on our revolver in use of existing cash to fund three acquisitions totaling approximately $36 million, a $15 million deferred payroll tax payment associated with the CARES Act and a $9 million decrease in trailing 12-month adjusted EBITDA. In addition, while we are pleased with the progress we are making and improving our clinical capacity in both segments, we are having to pay more for these clinicians and use contract labors to support our referral pipeline as the new staff ramp up, and the net home health market basket update of 0.7% for 2023 is not enough to offset rising labor cost before we consider the impact of the resumption of sequestration in the first and second quarters of 2023. These headwinds include an approximate $14 million impact from the continued shift to non-episodic patients, approximately $9 million to $10 million of incremental administrative and general costs associated with being a standalone company, an approximate $8 million impact from wages increasing at a higher rate than the net market basket update from Medicare, and approximately $8 million from the resumption of sequestration. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Again, it's going to be -- it's got the TSA in there, the TSA is going to rolloff as -- in response to Brian's question, so by the time we get to the back half of the year, you should be at somewhere in that more normalized run rate of the ultimate $26 million to $28 million, but I think given some of those ramp ups in 2023, you're probably talking about a $26 million to $27 million range. Your line is open. And then the -- of course, obviously, the acquisitions that we did in the fourth quarter of 2022 -- remember that we completed $36 million of acquisitions in that quarter, they are in the number, but there's nothing specific to acquisitions within the 2023 guidance at this time. Your line is open. Your line is open."
}