{
    "symbol": "AIT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-04-29 17:38:04",
    "content": " We grew EBITDA and EPS 25% and 27%, respectively on approximately 17% sales growth; expanded EBITDA margins above 11%; and generated solid cash flow, while continuing to invest across our business for future growth. Underlying growth on a two-year stack basis remains strongest across Fluid Power and Automation, partially reflecting solid demand for our engineered solutions and system build capabilities. Our business mix was also margin accretive, as we saw a benefit from growth across local accounts and our Fluid Power and Flow Control segment, as well as from favorable customer mix within our international operations. While we are actually seeing inflationary pressures across our operating cost STACK this year, including higher employee-related expenses, we continue to benefit from a leaner cost structure following business rationalization initiatives undertaken in recent years, as well as benefits from our operational excellence initiatives, shared services model, and technology investments. Overall, our solid sales growth, gross margin execution, and cost control drove a 25.1% increase in EBITDA over prior year adjusted levels, while EBITDA margin of 11.1% was, up 75 basis points over the prior year. We now project full year fiscal 2022 EPS in the range of $6.15 to $6.25 per share based on sales growth of 14.8% to 15.3% including 13.6% to 14.1% organic growth assumption as well as EBITDA margins, up 10.5% to 10.6%. This compares to roughly $8 million to $9 million of LIFO expense we were assuming in our fiscal fourth quarter guidance which will result in greater year-over-year LIFO headwind, higher gross margins and incremental margins during the fourth quarter compared to year-to-date trends. From our legacy service center network supporting critical break-fix applications to our leading engineered Fluid Power and Flow Control solutions and a scaling presence across advanced automation solutions, we will be an increasingly critical partner for our customers' most valuable assets and supply chain investments in coming years."
}