{
    "symbol": "CNDT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 20:51:02",
    "content": " Importantly, it was one of the best, in fact, the best first quarter since spin for total contract value sales at $464 million, up 32% year-over-year and 58% sequentially. Adjusted revenue for Q1 2022 was $960 million as compared to $1.01 billion in Q1 2021, down 5% year-over-year and slightly ahead of our internal expectations for the quarter. Removing this item, which was not part of how we guided the adjusted EBITDA and margin for the quarter, would have resulted in a 9.7% margin, slightly better than how we guided in our recent 2021 full year earnings call. For Q1 2022, Commercial segment adjusted revenues were flat year-over-year at $512 million as ramp from new business wins begins to more than offset losses from prior years. Adjusted EBITDA for the Commercial segment in Q1 2022 was $54 million, up 5.9% as compared to Q1 2021, and the adjusted EBITDA margin of 10.5% was up 50 basis points year-over-year, driven by operational efficiency initiatives across the segment. Adjusted EBITDA for the Government segment in Q1 2022 was $83 million, down 7.8% year-over-year, reflecting the runoff of government stimulus volumes, partially offset with operational efficiency initiatives. Transportation segment revenues in Q1 2022 were $162 million, down 12% year-over-year. We did expect the Transportation segment to be down in the first quarter, a function of the timing of our strong new business ramp, the majority of which comes on in late Q2, early Q3 time frame, coupled with prior year losses and a onetime revenue item that benefited the prior year. For the Transportation segment, adjusted EBITDA for the quarter was $17 million, down 43% as compared to Q1 2021. The Q1 2021 adjusted EBITDA margin of 16.3% was the high point in 2021, benefiting as it did from a onetime revenue item with a high fall-through percentage to EBITDA that drove approximately 300 basis points of margin difference with the prior year compare."
}