{
    "symbol": "RF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-22 13:36:08",
    "content": "  Operator: Good morning, and welcome to the Regions Financial Corporationâ\u0080\u0099s Quarterly Earnings Call. And importantly, our second quarter adjusted pretax pre-provision income represents the Companyâ\u0080\u0099s highest level on record. Net population migration inflows into our markets remain robust, and the majority of our footprint has returned to equal or better than pre-pandemic employment levels. In fact, unemployment rates in 6 of our top 8 deposit markets are essentially at all-time lows. For example, consumers with less than $1,000 on average in their checking accounts prior to the pandemic are averaging a balance today that remains approximately 6 times higher than pre-pandemic levels. Overall asset quality remained strong during the quarter, with most metrics remaining substantially better than historical levels. And in fact, earlier this week, our Board approved an 18% increase to our common stock dividend to $0.20 per share. Excluding acquisitions, we have added over 200 new positions in the Corporate Bank since 2019, with approximately 85% in revenue generating or supporting roles. Our most recent acquisitions, Sabal Capital Partners and Clearsight Advisors are contributing to overall capital markets revenue growth in 2022. We recently restructured our SBA organization and continue to invest in key talent to build out our non-restaurant franchise lending division, positioning Regions as a trusted resource for franchisees within our footprint. We continue to invest in these businesses, rolling out new products and enhancements across our iTreasury platform, including real-time payments and fraud mitigation, as well as APIs and new cash flow analysis tools. In recent years, weâ\u0080\u0099ve expanded our mortgage loan origination team, upgraded our mortgage contact relationship management platform and continued to simplify the overall sales process. Year-to-date, weâ\u0080\u0099ve completed bulk purchases for the rights to service of approximately $13 billion in mortgage loans. EnerBank, a leader in the prime and super-prime home improvement point-of-sale space, helps us meet customer needs while generating quality asset growth. Since 2019, weâ\u0080\u0099ve added 44 new revenue-generating positions in our Wealth group, primarily in private wealth management and investment services. While sentiment across both, business and consumers remains generally positive, we will continue to monitor our portfolios for indicators of stress. We have a robust credit risk management framework and a disciplined dynamic approach to managing concentration risk, which has positioned us well to weather any economic environment and continue to deliver consistent sustainable long-term performance. Average loans grew 3%, while ending loans grew 5% during the quarter. Average business loans increased 5%, reflecting broad-based growth across all businesses and industries. While still below pre-pandemic levels, commercial line utilization ended the quarter at approximately 44.4%, increasing 50 basis points over the prior quarter. Importantly, being into this commercial loan growth, weâ\u0080\u0099re maintaining a very high asset quality portfolio. In fact, balances considered investment-grade equivalent are up 30% compared to a year ago and approximately 44% of our total commitments are also considered investment-grade equivalent, representing its highest level on record. Average consumer loans remained relatively stable, while ending loans increased 3%. Within other consumer, EnerBank loans grew approximately 7% compared to the first quarter. As a reminder, EnerBank has a track record of well-controlled loss rates throughout multiple cycles, and primarily originates prime and super prime loans to homeowners who tend to be lower risk borrowers. Looking forward, we currently expect to hold total loans relatively stable over the remainder of the year, which would result in full year 2022 average loan growth of approximately 8% compared to 2021. This assumes a slowing rate of growth compared to the second quarter, but also assumes increased capital markets activity in the back half of the year. Ending consumer deposits were mostly stable, while Corporate and Wealth Management balances decreased approximately $1 billion each. In addition to seasonal patterns and in line with our expectations, the declines also include certain commercial and wealth clients beginning to reduce some of their excess balances. We continue to expect a range of $5 billion to $10 billion of overall balance reduction for the full year of 2022, resulting from tightening monetary policy. The combination of our legacy deposit base, along with the more stable components of surge deposits, represents a significant opportunity for us as rates continue to increase. Net interest income grew $93 million or 9% linked quarter, evidencing strong balance sheet growth and asset sensitivity in a rising interest rate environment. Cash averaged $22 billion during the quarter, and when combined with PPP, reduced second quarterâ\u0080\u0099s reported margin by 38 basis points. The reduction in cash this quarter resulted mostly from strong asset growth, both loans and securities, as well as seasonal deposit outflows. Importantly, deposit balance and yield outperformance, including a 5% cycle-to-date deposit beta, allowed net interest income to grow by more than our previous guidance. Total net interest income is projected to increase 8% to 10% in the third quarter, as expectations for rate hikes have been pulled forward, so has our outlook for NII. This NII benefit is supported by a large portion of stable deposit funding and a significant amount of earning assets held in cash, which compares favorably to the industry overall. Over a longer horizon, a more normal interest rate environment or roughly a 2.5% to 3% Fed funds rate will support a net interest margin range of approximately 3.75% to 3.8%. While we have purposefully retained leverage to the higher interest rates during a period of low rates, we have begun to manage to a more normal interest rate risk profile as the interest rate environment normalizes. Through the first half of 2022, we have added $15 billion of swaps and securities. With a sizable amount of hedging complete, we will balance market rate levels and potential risk as we decide the appropriate time to finish the program. Adjusted noninterest income increased 10% from the prior quarter, primarily due to improvement in capital markets and card and ATM fees. Within capital markets, growth was driven by higher fees and M&A advisory and real estate loan syndications, as well as a $20 million benefit from CVA and DVA. We continue to expect capital markets to generate quarterly revenue of $90 million to $110 million, excluding the impact of CVA and DVA. While we expect to be on the lower end of the range next quarter, we do anticipate activity will pick up in the coming quarters. Spend was up 3% year-over-year as inflation has impacted several categories, including a 30% increase in fuel, while discretionary categories such as retail goods, department stores and apparel are actually down. While we anticipated a decline in mortgage income relative to 2021, mortgage, as well as wealth management, will remain key contributors to our overall fee revenue. These changes, when combined with previously implemented changes, are expected to result in full year 2022 service charges of approximately $600 million. We expect 2022 adjusted total revenue to be up 7.5% to 8.5% compared to the prior year, driven primarily by growth in net interest income. Salaries and benefits increased 5%, primarily due to annual merit increases, which became effective on April 1st, higher variable-based and incentive compensation associated with increased financial performance and better credit experience, as well as one additional workday in the quarter. With the changes in revenue and expense guidance, we expect to generate positive adjusted operating leverage of approximately 3% in 2022. Nonperforming loans increased modestly during the quarter, but remained below pre-pandemic levels at 39 basis points of total loans, while business services criticized loans and total delinquencies continue to improve. Provision expense was $60 million this quarter and included a modest build to our allowance for credit losses, attributable primarily to strong loan growth and, to a limited degree, general macroeconomic uncertainty, as well as some early signs of normalization within select commercial sectors. Our allowance for credit loss ratio is 1.62% of total loans, while the allowance as a percentage of nonperforming loans remains very strong at 410%. Our annualized year-to-date net charge-off ratio was 19 basis points, given increasing expectations for a slowing economy, combined with inevitable normalization, we are maintaining our full year net charge-off expectations in the 20 to 30 basis-point range, but currently expect to be towards the lower end. Based on the recent stress test results, our preliminary stress capital buffer requirement for the fourth quarter of 2022 through the third quarter of 2023 is expected to remain at 2.5%, once our supervisory results are confirmed in August of 2022. We ended the quarter with our common equity Tier 1 ratio at an estimated 9.2%, reflecting continued strong loan growth, particularly during the last week of the quarter. And while loan growth remains our top priority for capital deployment, we expect to manage to the midpoint of our 9.25% to 9.75% operating range over time. Also, as John mentioned, our Board of Directors declared a quarterly common stock dividend of $0.20 per share, an 18% increase over the prior quarter, which reflects strong earnings growth. Expenses are well controlled, credit risk is relatively benign and capital and liquidity are solid. Just based on the guidance, it looks like itâ\u0080\u0099s going to end the year about $1.26 billion. So, the question is, if the Fed were to stop raising rates at year-end, it seems like you have a lot of strong momentum for growth into next year. So, we do have an expectation that the Fed continues to raise rates probably finishing the year in a 3.25 to 3.50 range. We do believe there is risk that the economy slows to a point where they have to become more accommodative in the latter part of 2023 and 2024, hence, why you started to see us play some forward starting swaps in those positions to protect us to the extent that that happens. I donâ\u0080\u0099t have the page number, but a very strong net interest margin and, more importantly, a very good return on tangible common equity profile. But nonetheless, we think thatâ\u0080\u0099s our competitive advantage, even if the Fed stops at year-end without any further increases. So one, we have to acknowledge we had pretty strong loan growth. But this is when you need to be very cautious, very careful and make sure your client selectivity is robust and ensure that you get paid for the risk that youâ\u0080\u0099re taking. We still see good demand in a lot of sectors, financial services, utilities, wholesale durables, just to name, and elements of transportation are strong. And we think even in investor real estate, there are some places that weâ\u0080\u0099ve been able to grow in the multifamily sector, in particular, as well as in industrial area. So, I think itâ\u0080\u0099s a bit of a cautious tone is all weâ\u0080\u0099re sending. And so, weâ\u0080\u0099ve seen particularly our larger customers rely on the pro rata bank market for funding. And so, we believe that what is pent-up demand amongst issuers will -- they will begin to access the capital markets again, which will result in some pay-downs in some of the larger credit exposure that we have enjoyed over the last two or three quarters. Again, as David said, it may be a conservative point of view, but we believe it will happen at some point in the next few quarters. I think you mentioned, if I heard you correctly, a 3.75 to 3.80 normalized margin for Regions. One, if you could tell us like what the Fed fund needs to get to in order for you to get to that level for the net interest margin. So, if you look at our slide deck on page 8, we try to lay that out that gives you at least some parameters on where we think the margin could be in different scenarios. So, if the Fed is going to get close to 3% at the end of the day and stay there for a while, we think we can have a margin profile thatâ\u0080\u0099s in that 3.80 range. If the Fed starts to come the other way, our margin will decline some, but we think we can protect. As rates continue to move up and we finish our hedging program, weâ\u0080\u0099re about three quarters of the way through, we have another 25% to do. If we are patient enough, if we kind of understand where the economy is going, perhaps we can lock in a downside protection a bit higher than the 360. And thatâ\u0080\u0099s really what our goal is, and we think 3.60 is a great level today. And I think just tied to that, you mentioned deposit betas versus the core customer base could be higher relative to the last cycle. Weâ\u0080\u0099ve been a bit surprised, frankly, on both betas as well as balances for the industry. So, our cumulative beta thus far is 5%. Weâ\u0080\u0099re one of the lowest peer group, I think, as the median is about double that. So, we keep calling for deposit balances to decline some $5 billion to $10 billion. I think the largest contributor to that would be corporate deposits that are going, we believe, in time, seek a higher return. But if Fed moved 75 basis points in the next move in September -- Iâ\u0080\u0099m sorry, at the end of July, this month, and an expectation of another 50 in September, then we think those balances will start to move off balance sheet. And frankly, weâ\u0080\u0099re going to help facilitate that for our customers because we can earn a little bit of a fee on that and give them a better return today. So if you look at corporate customers, they actually have either deposit balances with us or off balance sheet that weâ\u0080\u0099ve helped facilitate. And if you add those two together, actually a little higher than they were at year-end. Iâ\u0080\u0099d love to hear how youâ\u0080\u0099re thinking about the risk that the strength we continue to see in labor markets, and you mentioned the balances in consumer accounts and strong liquidity and spending in general. And to the extent to which all of that is in and of itself inflationary and could lead the Fed to have to do more, so everything seems great now, but we all know the hiking cycle works on a significant lag and we could see unemployment continue to rise well after the last Fed hike and weâ\u0080\u0099ve started to see initial claims keep up a little bit. So maybe if you could just reinforce how that dynamic, even though youâ\u0080\u0099re not seeing it at the micro level yet, perhaps how that -- if that all impacts the actions that youâ\u0080\u0099re taking today across the business. In our discussions with others in the industry, including our regulatory supervisors than the Fed, in particular, about where they really want to go, I think we all believe thereâ\u0080\u0099s an expectation of getting to â\u0080\u009cneutralâ\u0080\u009d as fast as they can is what they would like to do. But I think every time thereâ\u0080\u0099s a move, thereâ\u0080\u0099s a need to pause and see what impact thatâ\u0080\u0099s going to have on the economy. But as much as they want to get to â\u0080\u009cneutralâ\u0080\u009d, I donâ\u0080\u0099t think the Fed wants to direct the economy either. So what weâ\u0080\u0099re trying to do is read all the tea leaves, look at all the data that we can, study our customers, whether it be consumers or corporate customers to try and get an understanding of what theyâ\u0080\u0099re thinking, how their business is, how theyâ\u0080\u0099re managing their personal money, to gather an understanding of the slowdown in the economy and what the Fed may or may not do. I donâ\u0080\u0099t know if theyâ\u0080\u0099ll move exactly like the market thinks, but we think thatâ\u0080\u0099s going to be a place where theyâ\u0080\u0099d likely stop and let things play out over time. And if thatâ\u0080\u0099s the case because inflation is not under control, there could be some ramifications to that long term, which is while weâ\u0080\u0099re cautious on extending credit, while we want to manage our bank as efficiently as we can, because you have to have scenarios for anything that could possibly happen as we seek to continue to have appropriate returns on capital to our shareholders. So, EnerBank, we said represented 1% of an industry that was about $175 billion. We donâ\u0080\u0099t think about the provisioning getting ahead of earnings because if we did that, we would not make any loans ever. Weâ\u0080\u0099re very excited about that, getting paid for the risk weâ\u0080\u0099re taking, and itâ\u0080\u0099s worked exactly like we thought it would be. Well, primarily -- youâ\u0080\u0099ve got carry, youâ\u0080\u0099ve got -- net interest income is the biggest driver of our profitability there. It comes from the customer paying a certain rate and thereâ\u0080\u0099s a discount from the vendor thatâ\u0080\u0099s providing the service to the customer, an HVAC contractor for instance. So, we set the reserves under CECL based on the economic forecast at each quarter end. As a matter of fact, we think itâ\u0080\u0099s actually pretty good. I mean, weâ\u0080\u0099re at 17 basis points of charge-offs this quarter. Weâ\u0080\u0099re forecasting charge-offs in the range of 20 to 30 basis points, and actually towards the lower end of that. 2023, you could see losses pick up as the economy slows as certain industries start to struggle a bit more than others. I think that -- so we were -- if you cut out the CVA, DVA, weâ\u0080\u0099re kind of at the lower end of the range. I think youâ\u0080\u0099ve seen that play out across the board, in particular, in the money center banks that have more ECM. M&A, advisory and loan syndications are the places where we think can continue to be robust for us. So, we think thatâ\u0080\u0099s a pretty good -- really good place to be. Real estate capital markets and leveraging our Sabal Capital Partners that we bought at the end of last year, I think, is helping us. Weâ\u0080\u0099ve been working very closely with those customers, particularly over the last 2.5 years as we work through the pandemic. We have been focused, as you know, for a number of years on recycling capital on risk-adjusted returns. Discipline that exists within the company; we have strong metrics and key performance indicators built around all of our businesses; and again, really a dedication to a strong concentration methodology to ensure that we have good balance and diversity. And as a result, we feel good about -- really good about the credit risk management culture that we have developed over time and think that our portfolios will perform well no matter what the economic conditions or how the economic conditions evolve. David, you talked about the $5 billion to $10 billion of potential deposit outflows starting to pick up. So, the first part of that, we do expect, as I mentioned earlier, those excess deposits from our corporate clients to seek a better higher-yielding home. So, I think that weâ\u0080\u0099re always looking for quality relationships, deposit relationships, treasury management relationships. And I think that from a consumer standpoint, weâ\u0080\u0099re in a good part of the country where we ought to see better migration of people into our footprint and take it -- and we should be able to take advantage of that. On the consumer side, those that had $1,000 or less in their checking account pre-pandemic have 6 times more cash in their account today than pre-pandemic. Our loan-to-deposit ratio is among the lowest in the peer group at 67% change, maybe close to 68%. And then second, David, youâ\u0080\u0099re targeting 300 basis points of positive operating leverage, and I know itâ\u0080\u0099s early to think about 2023, but maybe just to follow up on Peterâ\u0080\u0099s question from earlier. If you think about just reaching the NII run rate and assuming no further growth, that would give you about 8% revenue growth into next year. We had a pretty strong efficiency ratio this quarter of, call it, 54% on an adjusted basis. Weâ\u0080\u0099re substantially below the median, which is 400 basis points higher than we are. And I think that at the end of the day, if we could get closer to 50%, that would be great. So, if we stay focused on that, Ryan, I think we can generate pretty solid positive operating leverage. That means we have to reinvest in talent, we have to reinvest in technology, we will reinvest in our transformation weâ\u0080\u0099re going to go through on the deposit side, primarily, in other areas, and we do that while continuing to control our cost increases, which I told you earlier in the year, the vast majority of our increase earlier in the year was really related to acquisitions. So, weâ\u0080\u0099ve been good expense managers, and I think youâ\u0080\u0099ll see that continue into 2023. Obviously, if IOER continues to be full to Fed funds, your cash is going to be working a lot harder by the end of the year. We put a little bit to work in the securities book because the spreads got to a point where it was -- we were paid for the duration that we were going to take, and that securities investment is really part of our hedging program as well. I think, weâ\u0080\u0099re down to, call it, $18 billion of cash at the end of the quarter. And normally, that number is going to be $500 million to $2 billion worth of cash at the Fed. So, weâ\u0080\u0099ve got some of that that we need to hold on to for that deposit outflow that I just talked about, whether itâ\u0080\u0099s the corporate deposits or whether itâ\u0080\u0099s the EnerBank brokered deposits that will lead over time. So, I just wanted to make sure weâ\u0080\u0099re taking away the right message here. From second quarter NIM, 3.06% can hit a net interest margin of 3.70% to 3.80%, right, from higher beta to base case at a Fed funds rate of 3%. And if the Fed starts cutting rates, your swap program has protected you to 3.60%. And my other question for you, David, is if we were to prepare for a , how should we think about how more ACL build there may need to be from that 1.62%? So you cut out on the first part of that, but I think your question was how do we see the reserve build from here from 1.62 in a mild recession? So, weâ\u0080\u0099re having to forecast out through life of loan today, which has elements of a slowdown already built into it. Right now, we donâ\u0080\u0099t see that changing a lot because we think weâ\u0080\u0099re covered. And the real change to the allowance are just two things, whatever charge-offs have, reducing it and then the provision primarily for loan growth, which is what you saw this quarter. But, if the economy starts to slip, then weâ\u0080\u0099re going to have to have higher provisioning going forward. Just one question, David, on the C&I loan yields, just not up as much, of course, as the NIM, and Iâ\u0080\u0099m sure some of that is the hedging. So weâ\u0080\u0099re not expanding it quite the pace that maybe others that didnâ\u0080\u0099t hedge are, but we still have pretty good loan yields net-net. And if you look at adjusted net interest income thatâ\u0080\u0099s after charge-offs, weâ\u0080\u0099re one of the leaders in the peer group. So, thatâ\u0080\u0099s a good indicator of telling us weâ\u0080\u0099re being paid for the credit risk that weâ\u0080\u0099re taking. And then, on capital, 9.2% CET1, youâ\u0080\u0099re mentioning you want to get back to the middle of the 9.25% to 9.75% net-net. In this particular quarter, it was loan growth. So, we had really robust loan growth, and you could see our capital, our common equity Tier 1 declined. The primary use of that was, in fact, RWA growth through the loans. Weâ\u0080\u0099re generating, call it, 50 basis points of common equity Tier 1 each quarter or at least we did this past quarter. First off, itâ\u0080\u0099s for loan growth. Probably canâ\u0080\u0099t get there at the end of the third quarter, take us into the fourth quarter. We think that 9.25%, 9.75% still is a great range for us based on the risk we see in our book taking into account all the macro factors that exist today. But, I wanted to understand what the kind of repricing speed is, duration, like how quickly should we be thinking about the back book migrating to the front book of 3.3 that you just talked about? Well, if you look at all-in growth, so the 3.3 I just mentioned was an element of what we invested primarily as part of our hedging program. As we think about duration, weâ\u0080\u0099re looking at call it, right at five years today. No, I was saying, hypothetically, in normal times, we could take those down, that cash down to a level much lower than the $18 billion that weâ\u0080\u0099re having -- that we have today. We want to maintain a lot of liquidity to take care of deposit flows because, remember, we had some $40 billion worth of growth in what weâ\u0080\u0099re calling surge deposits. And weâ\u0080\u0099ve made our best estimate as to how we think those things will behave over time, and we have about $13 billion, $14 billion of it that we think has either very high beta or itâ\u0080\u0099s going to seek a better alternative, which means we need to have the cash to pay for that if it starts to happen. I think, David talked about small business. I wouldnâ\u0080\u0099t say in those two instances that weâ\u0080\u0099re seeing any normalization, but we do have a watchful eye on them."
}