{
    "symbol": "OSUR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 22:47:04",
    "content": " Good afternoon, and welcome to OraSure Technologies third quarter 2022 earnings call. Before we begin today, you should know that this call may contain certain forward-looking statements, including statements with respect to revenues, expenses, profitability, earnings or loss per share and other financial performance, product development performance, shipments and markets, business plans, regulatory filings and approvals, expectations and strategies. Factors that could affect results are discussed more fully in the Company's SEC filings, including its registration statements, its annual reports on Form 10-K for the year ended December 31, 2021, its quarterly reports on Form 10-Q and its other SEC filings. Although forward-looking statements help to provide complete information about future prospects, listeners should keep in mind that forward-looking statements are based solely on information available to management as of today. Also today, we may discuss financial measures in accordance with GAAP and on a non-GAAP basis. We use non-GAAP reporting internally to evaluate and manage our operations, and we choose to provide this information because it allows for greater transparency with respect to key metrics used by management and its financial and operational decision making, and is used by OraSureâ\u0080\u0099s, institutional investors and for the analysis to help analyze the health of OraSureâ\u0080\u0099s business, a reconciliation of GAAP to non-GAAP operating expenses can be found in the press release that is issued this afternoon, which is posted on the Investor Relations section of our website. We were really pleased to once again deliver strong results for the quarter, and Ken and I and our whole team are highly focused on ensuring we achieve our financial targets while providing increased transparency to investors. To that end, this quarter, we returned to both profitability and positive cash flow from operations ahead of our established guidance. We still have more work to do to ensure our long-term financial success and we are actively working on fiscal year 2023 with planned spending reductions, which include aligning our cost structure to various scenarios with InteliSwab. By doing this, we aim to ensure the company has a stable foundation from which to deploy the cash we expect to generate from COVID-19 sales in coming quarters to fund future growth investments. To this end, we are continuing our transformation journey now and had a number of key learnings in the quarter. As we look to strengthen our foundation we are putting in place, scenario plans to account for varying levels of InteliSwab revenue in coming quarters, while also working to leverage our new enterprise capabilities that we built ramping this test. We are also beginning to evaluate new complementary product offerings, expanded commercial channels, and of course, strategic partnerships too. Finally, as we develop greater visibility on our financial progress, we will begin to look at inorganic growth opportunities as well as our capital structure. This quarter, there were three significant emerging themes within our diagnostics portfolio. The first was our expanded retail success with our InteliSwab COVID-19 test, which could support a longer commercial tale for this product. Second, we saw the government take an increasingly active role in global public health challenges with the Together Take Me Home HIV testing program sponsored by the CDC administered by Emory University, as well as our new BARDA contract for version two of our Ebola testing. As we focus on InteliSwab, we had strong volume in Q3 and as we discussed last quarter, we have received delivery orders from the U.S. Federal government, which allow it to order up to approximately 90 million tests. As of the end of the third quarter, we have fulfilled 30 million of these orders and outside the federal government, we also had a number of other meaningful InteliSwab wins. This quarter, we won a retail contract with a midsized grocery store chain with the opportunity to be in up to 400 stores nationally. And additionally, we signed a contract with amazon.com under which the retailer will carry and fulfill InteliSwab orders from consumers. And given the improvements in our capacity, we are actively engaging potential customers in public health, government institutions and the retail settings, and we hope to have more positive developments as we continue to serve health needs through the upcoming respiratory virus events. Given the ease and simplicity of our test designs, we believe we are an ideal partner for outreach testing and critical diseases, and the global pandemic has shown how the government can play a more active part in addressing public health crises. This trend is well demonstrated by our announcement this quarter that we will be supplying our OraQuick HIV in-home test as part of the CDCs Together Take Me Home program, which will mail our HIV OTC kits to consumers requesting them, many of whom are in high risk or other vulnerable communities not well supported by the current healthcare systems. The total program administered by Emory University is valued at $41.5 million over five years, and while only a portion of that amount is for test procurement, this program has the potential to help grow our domestic HIV business and could serve as a case study for similar future programs in the U.S. and other jurisdictions beyond. Currently, Uganda and the Democratic Republic of Congo are experiencing significant Ebola outbreaks and we have seen increased interest in procuring Ebola test from several organizations. Finally, we continue to focus on production efficiency as we scale our super factory and plan for future volume scenarios around InteliSwab. We have submitted our new packaging configuration to the U.S. Food and Drug Administration for approval, and this new configuration is designed to reduce costs through lower material usage and due to its smaller size overall lower freight expense. We have also begun process development to transition our legacy HIV, HCV and Ebola products over to our new super factory automation, which will lead to labor savings and efficiencies as we consolidate around the single manufacturing process. To this point, we are reviewing our facility footprint and looking for areas where standardization across product lines can use our cost structure. Finally, we are performing a top down review of our supplier agreements to also look for areas of material savings, including the possibility of bringing some of the more expensive raw material production in-house. Next up, I'd like to discuss our commercial progress with our Molecular Solutions business unit. Beginning with our core collection kits, our core kits business was down 24% this quarter on a year-over-year basis as we saw continued pressure from some of our more consumer-focused customers. We remain optimistic, however, over the long-term and the growth prospects for this segment, and we are working very hard to add new significant customers in diagnostics and clinical lab services, which we know well to quickly accelerate our return to growth. Of course, alpha-1 deficiency raises patients risks for lung disorders and it's estimated that about 3% of the 15 million COPD patients in the United States have alpha-1 deficiency. The partnership with Grifols represents valuable opportunity for us in addition and very important, this clearance also means that our Orageneâ\u0080¢Dx and ORAcollectâ\u0080¢Dx products maybe used now at home by an adult without direction from a healthcare professional when approved in conjunction with a partner or a therapeutic â\u0080\u0093 partner, therapeutic or device, and without us having to obtain a separate new FDA approval. First, revenue for the segments recovered as anticipated and was up 63% sequentially to $2 million. Secondly, we saw the first microbiome-based therapeutic received the FDA's Vaccines and Related Biological Products Advisory Committee approval. Along with other drugs in the pipeline, there is the potential for multiple new biological license applications to be approved by the FDA in the coming year, which could be a strong catalyst for research funding. This quarter, we also announced a partnership with Mars Petcare to create the worldâ\u0080\u0099s largest biobank around microbiome data for cats and dogs. Mars Petcare scientists will then use the data to generate insights about what cat and dog microbiomes look like over time, including on health and disease. Like with our diagnostics portfolio, we are actively working on cost reductions and margin improvement projects. First, from a topline perspective, we delivered total revenue of $116.5 million in the third quarter, which was another new record for the company, representing year-over-year growth of 116%. Our diagnostic business unit delivered total revenue of $97.7 million in the quarter, growing 315% versus last year. While the majority of this growth was driven by InteliSwab, which increased over tenfold year-over-year, our core diagnostic business was up 14% in the quarter largely due to non-product revenue. Excluding COVID-19 revenue, the business declined 24% and as Carrie mentioned earlier in the call, this was really tied to some increased softness in ordering from our more consumer-oriented counts, and we are working hard to change this paradigm as we look into 2023. With our COVID-19 collection kits, we saw continued declines as PCR test volumes declined at our commercial partners in favor of point-of-care testing solutions. From a gross margin perspective, our non-GAAP gross margin in the quarter was 40%, which was flat on a sequential basis. We continue to make plans to boost our longer term gross margin profile, including looking at packaging and standardization across products moving our legacy test automation and site consolidation based on future volume contingencies. This quarter, we had a non-cash impairment charge of $6.6 million tied to the impairment of our manufacturing equipment associated with our COVID-19 molecular kits based upon our reduced volume forecast for these products. In the third quarter, we generated positive non-GAAP operating income of $11.4 million and non-GAAP net income of $9.7 million. Importantly, we generated positive cash flow from operations in the quarter, ending the quarter with total cash of $102 million. Additionally, if InteliSwab revenues decline in the future, our cash position would benefit from significant reductions in working capital associated with our scale up in InteliSwab revenue. As Carrie mentioned earlier in the call, however, we are committed to ensuring we have significant capital to invest in the business in the future. Given the current challenging capital market environment, we believe this puts us in the best position to succeed in the future and allow us to make targeted investments with attractive returns on invested capital, utilizing the cash we generated from COVID-19 products. We are providing fourth quarter financial guidance calling for revenue of $95 million to $100 million, and representing 49% to 57% growth over fourth quarter of last year. As we moved further into the school year, the stocking orders have moderated and consequently, we expect InteliSwab revenue to be lower on a sequential basis. Given our expectations of very high international diagnostic revenue, which is one of our lower margin business segments, it is possible we could see gross margins decline on a sequential basis in the fourth quarter, and then returns in our improvement trajectory in 2023 as we introduce additional operational efficiency programs. Therefore, our focus going forward will increasingly look for ways to optimize our existing business through new innovation and partnerships as we moved beyond strengthening our financial foundation. First, congrats on the quarter, and thank you for taking my question. I'll just start and then maybe pass to Ken, but I'd say one, we would call it a contract that makes InteliSwab available. Like the, retail opportunity, a terrific retail opportunity, but that's in general, we have shared that that's actually a higher price, higher margin opportunity than the majority of our InteliSwab business, which is governments fulfilled. Carrie, I agree and I think it's consistent with our other commercial business as you mentioned. And then just one follow-up, I think the last earnings call you said you had the capability to produce around 1.6 million InteliSwab test per week and you expected this to double next year. Lizzie, one thing to think about is, we want to be as efficient as possible and so one thing that we're looking at with the operations team and the company is really scaling InteliSwab to meet the demand level and then also not scaling beyond that from a personnel standpoint because we obviously â\u0080\u0093 the cost associated with that. But right now, we want to really use our resources efficiently and so we're really scaling to meet demand as it comes in. Maybe just a quick one for Ken, first, on the guidance for 4Q, you talked about InteliSwab sales being down, but obviously kind of record quarter there in 3Q is maybe a way to think about it. It's fair to say, maybe assume the base business is flat in 4Q and COVID is down by that much. You have others where you're selling to government agencies, and then you talked about kind of on the collection kit side, working more with labs. So I would just call out, our focus and our strength is effortless point-of-care diagnostic testing, effortless sample collection and stabilization innovation and effortless microbiome services and innovation. And while that can sound consumer-oriented, the types of partners we're talking about serving as our customers are other healthcare providers. And so you pointed out clinical lab, it's also health tech and I think that opportunity has gained real momentum through COVID and people's awareness of the diagnostics and the solutions and the shift that is taking place, so I would just emphasize that. Though I would say, one of the benefits for us through our COVID experience is really in relationship, not just with government, but public health more broadly and so we keep kind of pointing out government taking a more active role in serving public health needs. So in addition to COVID, we really like the HIV example because the Together Take Me Home program is a different space, but represents kind of that same government's involvement in proving care for the most vulnerable communities. So I think we're excited about each, but different product portfolios and strengths for different segments and channels we serve. So it looks like they came in below the Street and we're flat quarter-on-quarter, despite some of the cost-out initiatives that have already begun. So I think you're calling out something we tried to share some of the nuance on gross margins, but while we don't provide specific gross margin percentages, there is this sort of balance between the two that I'll let Ken talk about. We have â\u0080\u0093 we're looking at footprint opportunities as well as updated versions of our COVID product, our InteliSwab product. As far as the gross margin versus expectations part of it, think of it as a mix as well. We had a higher diagnostic mix versus the prior quarter, and the diagnostic margins are lower than our molecular margins overall. No, Ken, I think, yes â\u0080\u0093 I think that's the primary factor, Casey, is. Remember when we gave our guidance last quarter, we were guiding to $90 million to $95 million in revenue, and we had about $20 million of additional revenue for InteliSwab that was more than we had expected. And so just when you think about the mix impact, we did see a nice positive transition in InteliSwab margins again on a sequential basis, but some of that was absorbed obviously by the mixed changes in the business. And I want to just circle back around to Casey's initial question, which is, there is room and we do have plans to take out additional costs in InteliSwab and beyond. And then I guess just on genomics, on the step down, last quarter you called out some weakness in the segment related to clinical trial work, specifically on some of the biotech funding concerns in that business. So you listened well, last quarter we called it out, but the BLA, we actually have progress there and progress in microbiome, but the softness remains. When we look at some of the consumer partnerships that we announced on the call here for InteliSwab, some of those â\u0080\u0093 most of those were relatively recent from a timing standpoint, such as Amazon. Carrie, in your prepared remarks, you talked about how you're looking to align the cost structure across a number of scenarios as it relates to InteliSwab demand, looking out kind of into 2023, and you'll give us an update as we get there. When we think about cost structure and alignment with the business of today and tomorrow, one of the moves we had made earlier in the year was to centralize operations of the corporate function. We had introduced Zach Wert as our new SVP of Operations off to a terrific start, but really that manufacturing efficiency and the footprint consolidation potential is a big part of that. So if you think about kind of big chunks, there's structural cost chunks, there are operating expense chunks, and then there are cost of goods sold and unit costs reduction chunks, and we're going after all three of those. I think when you think about the transition of the other tests over to the new lines, there's definitely efficiencies. We're in the process right now of kind of scaling, how significant those could be as we look at our production plans and our sites and the facilities that we'll utilize."
}