{
    "symbol": "CTOS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 15:58:05",
    "content": " We delivered $91.6 million of adjusted EBITDA and up 9% versus the prior year, while at the same time, Q3 revenue was up slightly versus Q3 of 2021. Supply chain issues continued to impact us in the third quarter, but we were able to deploy $97 million into our rental fleet in the quarter, which is the most sense the merger. Gross profit, excluding rental depreciation was $131 million, representing an adjusted gross margin for the quarter of 36.6%, up 220 basis points from 34.4% for Q3 2021 and up 175 basis points from last quarter. SG&A was $50 million for Q3 or 13.9% of revenues, which is up slightly versus Q2, but in line with the expectations we set forth earlier in the year. In ERS gross profit, excluding rental depreciation was $95 million for Q3, up 9% from Q2 and adjusted gross margin improved to 63.6%. With the LTM adjusted EBITDA of $364 million, we finished Q3 with net leverage of 3.77x, which is an improvement of almost 1 turn since the close of the transaction and down slightly from last quarter. With respect to our 2022 outlook, based on year-to-date results, current backlog, and our outlook for the rental fleet, we are adjusting our guidance as follows: we expect ERS revenue of $650 million to $690 million, TES revenue of $720 million to $750 million and APS revenue of $135 million to $145 million. And as Ryan noted previously, we will benefit from strong demand in the fourth quarter for rental asset purchases, particularly of older equipment in the rental fleet that will favorably impact our results and partially offset the supply chain headwinds that continue to impact the TES segment. And then two, as weâ\u0080\u0099ve been able to increase what weâ\u0080\u0099ve been able to deploy into the rental fleet, so the $97 million of gross CapEx that we talked about this quarter, weâ\u0080\u0099re comfortable being able to take out some of the older equipment that weâ\u0080\u0099ve talked about for the last several quarters."
}