{
    "symbol": "MOLN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 13:05:22",
    "content": " I would now like to turn the conference over to Seth Lewis, Senior Vice President of Investor Relations. Thank you, Betsy and welcome everyone to the Molecular Partners 2022 full year results conference call. My name is Seth Lewis, Senior Vice President of Investor Relations and I am joined today by Patrick Amstutz, CEO and Robert Hendriks, Senior Vice President of Finance. If you have not had a chance to see the press release issued yesterday evening highlighting these results, it can be found on our website, www.molecularpartners.com. Before we begin, I would like to remind you that this presentation contains certain specific forward-looking statements, beliefs and opinions. Such forward-looking statements are subject to known and unknown risks, uncertainties and other factors, which may result in a substantial divergence between the actual results, financial situation, development or performance of Molecular Partners AG and investments and those explicitly or implicitly presumed in these statements. If you havenâ\u0080\u0099t accessed this morningâ\u0080\u0099s presentation, it can be found on our website, molecularpartners.com under the Investors tab, News and Events and Presentations tab. I add that I am just off the plane, so a bit of jet lag. So hopefully, I didnâ\u0080\u0099t putâ\u0080¦\n You did not and I am back from the Cowen Conference, so also a good chance to then maybe follow-up in the Q&A a bit on investor sentiment, the questions we are getting and how sort of we present also in the field with other biotech. Itâ\u0080\u0099s the breakthroughs of tomorrow that link back to the company purpose, building value for patients where value today is not possible. And so we have invented the DARPin technology to bridge the gap between the small molecules and large molecules and we have validated the DARPin approach in over 2,500 patients with 7 clinical stage compounds. And I think it is important to stress that, that this is a proven technology and that all of these compounds one not yet, because it just went in, but 6 of those are really showing the exact activity in patients that they were designed for by our protein engineers and biologists. I mean, we want to solve a meaningful problem and we want to see an early clinical readout. The early clinical readout goes to the return on the investment, because if we donâ\u0080\u0099t see it, we can stop it. It can be early partnerships, it can be biology partnerships, it can be technology partnerships where payload, letâ\u0080\u0099s say, a radionuclide DARPin, we all classify that as partners and we are always open to partner to bring our breakthroughs forward. That gives you an overview of how we think or structure our approaches in the center of this picture, you see a DARPin and what I like to say the DARPin is a therapeutic modality. But we have built sub-platforms and there is different ways you can classify that the way we like to do it is, on the one hand, the multi-DARPin platform, where we have 533 or also Ensovibep, our COVID DARPin was part of that. Then we have the Radio DARPin therapy platform, thatâ\u0080\u0099s something I will also talk about. I would like to start with, letâ\u0080\u0099s say, the poster child of last and this year, and that is 533. We have dosed the first patient, and we have a lot of preclinical data that supports the mode of action and we will also generate more of that. MPO317, thatâ\u0080\u0099s the local CD40 agonist, proud to say that we have the safety that supported dose escalation. We are now at the highest dose and have not found any dose-limiting toxicities, supporting the mode of action of local immune stimulation over systemic immune stimulation. Then a platform, so here, we have not yet defined the candidate while we have defined the first target for us, but it starts with a Novartis collaboration with two targets. And in the Radio DARPin Therapy Platform, thatâ\u0080\u0099s where itâ\u0080\u0099s all about reducing kidney uptake as that is for many protein based approaches or even pepta-based approaches the dose-limiting organ, the problem zone. So if you can reduce the kidney uptake with a high tumor uptake, you are in business. A year ago, we were very heavily invested in virology with Ensovibep that actually had great data, right a year ago, went to EUA, but then we all know that from variance of SARS-CoV-2 virus came along and made the medical need much lower. Hopefully, not ever to be used but would only be used if a new variant of higher virement would appear again. At the same time, it did open the path for discussions with Novartis and we have Letter of Intent to look into a Research Framework Agreement also to establish pandemic preparedness. So you see here the stages, the programs, this is the pipeline view. We will talk about 317, 533, the DARPin platform virology, I did touch on and the immune cell engagers, you can put equal to the SWITCH platforms as those are likely going to be SWITCH. We see them as options â\u0080\u0093 optionalities that can happen, but we are not building on them as the future basis of the company. The problem in this disease is there are no clean targets like CD20 or CD19 on B-cell malignancies, but there are targets. And you see three of them here, CD33, 70 and 123. But our scientists found that they could with a lot of bioinformatics work in many databases, establish that mostly they are co-expressed, three of them or at least two of them. So what we built is a tri-specific T-cell engager with a long half-life and this will kill preferentially the dual and triple expressers, but not the healthy cells with mono expressing one of these targets. We are guiding towards more the second half for safety, but also initial efficacy. So that is maybe a bit cryptic, but you can think if the first Phase 1 looks good, you will want to go into different settings, different lines, also different combinations. Moving to Slide 8, here I will speak about 317, this CD40 by FAP. And when targeted systemically meaning with systemic antibodies, you get dose-limiting toxicities, so the highest dose you can reach is still below 1 milligram per kilogram. So, it seems that this texture really solves that problem. We will do more of that, complete the dose escalation and then depending on the data, obviously, enter partnering discussions. Here, I would also point out the indirect value inflection point as Roche has a similar molecule. If that data looks good, obviously, there is a cross validation of the mode of action. In this case, CD3 and we have a gray DARPin that has two binding sites. It was made from two DARPins, actually a yellow and the dark blue one and they were put together into this gray DARPin that is now called two in one. The blue part binds the CD3 DARPin and with a very low affinity, but a high local concentration of the linker. You can think of the blue DARPin and the blue part of the gray DARPin as on off, on off very fast, but mostly off in circulation. So if on healthy cells, you would even find the target â\u0080\u0093 the green target nothing would happen as your CD3 is off. If you are now in the tumor, the green DARPin will accumulate this drug in the tumor. The gray DARPin with its yellow binding site will yellow antigen release the blue, because there cannot be simultaneous binding and with that set that activity free and recruit T-cells for local killing. For us, this is the first time we have seen or this has ever been described, such a mechanism. With that, I will switch to Radio DARPin Therapy. This is, letâ\u0080\u0099s say, a link to radioligand therapy, but we want to expand the ligand space with the DARPin space. So ligands can maybe target a set of targets that are on tumors, but DARPins can expand that set dramatically. We did a deal a bit more than a year ago with the â\u0082¬20 million upfront, CHF560 million in potential milestones and double-digit up to double-digit royalties. So, two targets are exclusive for Novartis. At the same time, there is many more targets out there and one of those is DLL3 and thatâ\u0080\u0099s what we have selected for our first in-house target and we are expanding to additional targets. And as we donâ\u0080\u0099t have the radioligands or the radionuclides at our disposal, so we are looking into partnerships to get access and partner with companies that have radioisotopes. Also, this will be one of the activities that you will see this year and we definitely want to sign one or two agreements with these companies. Lower bars are better, because it shows how much of your drug is in the kidney. You see the solid â\u0080\u0093 the red solid, thatâ\u0080\u0099s a parental DARPin. Then you have the striped red that is a different approach on top of cells, thatâ\u0080\u0099s now blue and it again reduces by 60%. So, we are working on a suite of ways to reduce kidney â\u0080\u0093 and they are additive. At the same time, if you look at the tumor side, you see the tumor accumulation stays the same. And really with this purpose-drive and this understanding that we want to do good for patients, we want to do good for society, we want to do good for the world, ESG or corporate sustainability was always part of our culture and in our DNA. And now with the, I will call it, a bit more trends of ESG and reporting, we went back and we really were able to bring out what we always have in the company and it also is very much carried from our employees. So this is not just a tick-box exercise, but it really makes visible what is here. And you see there the different pillars that we are moving forward and some of them like human capital management, I mean, for us, people, talent, thatâ\u0080\u0099s our co-workers. It sounds a bit dry, but for us, itâ\u0080\u0099s not, but those are the titles that one uses in the ESG exercise. But believe me, these titles are really full of life and full of passion for our co-workers. And the same is for access to medicines, for product safe, service and safety business ethics. These are really dear and core to our heart, and we fill them with life at Molecular Partners, and it is really that what also makes up our culture. So for us, this slide is not just a dry tick-box slide. With that, Iâ\u0080\u0099ll pause, I will hand over to Robert, who will lead us through the numbers. I think he has set an exciting year that we had, and happy to hear him talk about the numbers. Currently on Slide 13, just to discuss some of the basics here. Of course, the rest of the details will be in the press release as well as in the appendix of the presentation and the presentation is clearly also available on our website to finish Stage 1. When we are looking at these financials for the past year, Iâ\u0080\u0099d like to focus your attention to three numbers in particular. The first one would be the revenue number, almost CHF190 million in â\u0080\u009822. And I will, on the next slide, provide more detail, but itâ\u0080\u0099s clear that this was largely driven by the funds that we received early â\u0080\u009822 from Novartis. The guidance that we provided during last year consistently was in the 70% to 75% range, and the CHF73 million ended up right in the middle of that guidance. Combined, these two numbers clearly lead to the positive results that we achieved in â\u0080\u009822. So these three numbers, the revenue, the expense and the cash are important to note as they tell the financial story of MP in â\u0080\u009822 and fully reflect the healthy financial state of the company. If we then look in more detail to the revenue numbers, it becomes clear with a remarkable year â\u0080\u009822 was, with a revenue close to CHF190 million. You can see that in the recent years, the revenue mostly related, if not all related to the Amgen collaboration, and in â\u0080\u009822, we see the impact of the Novartis collaborations. If I break down CHF190 million, CHF173 million of revenue relates to Novartis, and this can be broken down in a few buckets. The biggest bucket would be CHF163 million that were triggered by the exercise of Novartis on the license agreement, and this happened in the first week of January. Here, we can break that down to CHF2 million of FTE recharge and CHF8 million of the recognition of the upfront payments that we received following this agreement. Then following the notice from Amgen on MP0310, we were able to recognize in full the remaining contract liability or deferred revenue of CHF10 million that we still have on the books. This number is actually in line, as you can see with the most recent years when it comes to Amgen revenue. Then finally, and thatâ\u0080\u0099s the yellow bit on top. We were able to recognize CHF7 million into revenue from the amount that we received from the Swiss government, the as per the reservation agreement that we concluded with them in 2020. That agreement transitioned to Novartis upon the exercise the option exercise, so we were able to recognize the mute This revenue, together with the operating expenses, clearly resulted in a positive net result of CHF118 million in â\u0080\u009822 and a cash balance of just shy of CHF250 million. For the year â\u0080\u009823, we guided total operating expense of CHF70 million to CHF80 million, of which around CHF9 million will be non-cash. And as always, this guidance is subject to the progress and changes of our pipeline. So in summary, I think with almost CHF250 million in cash and no debt we are in a privileged position. We are funded into â\u0080\u009826, and this is without clearly taking into account any possible money coming in from collaborations and future partnerships. With this, Iâ\u0080\u0099d like to hand back to Patrick, who will tell you more about the R&D and scientific outlook for this year. Really a lot of numbers, impressive numbers, and I can only echo the health of the company, which is not a given in the current setting where not all biotechs can build on such a strong balance sheet. But before we open for questions, let me just quickly walk through the outlook. Again, additional preclinical work, especially for combinations, but also understanding the drug where to develop it further is ongoing and will be presented over the year. 317, thatâ\u0080\u0099s the completion of the escalation and safety trial first half of this year and initiating partnering discussions on the back of that and stressing again the indirect catalyst by the Roche FAP CD40, thatâ\u0080\u0099s Roche 6189. If you want to look it up, that would have a direct read through to 317 in good, but also obviously in negative data  working therapy platform. So we will definitely advance the platform, working on that kidney to tumor or tumor to kidney ratio. And last but not least, very importantly, the collaboration with radioligand companies that we can secure access. So immune cell engagers, where we are aiming to move a program forward for ourselves, but there is also partnering optionality there as these are platforms. And we have a rich pipeline, and we could add more in some partnerships on the SWITCH platforms and also update you on the virology projects, thatâ\u0080\u0099s kept a bit open because there is in-house activity and partner activity with Novartis. Letâ\u0080\u0099s see where that goes, essentially an update over the year. With that, I would like to echo what Robert said, weâ\u0080\u0099re well funded into â\u0080\u009826. Nothing we take for granted, but we really take that as a mandate to work hard to push forward and generate the value for patients and the shareholders as we invest that smartly in our pipeline. With that, happy to end the call it, formal presentation part and open for questions. I have a few questions, but your line did seem to cut out a bit. So I do apologize if I ask you to repeat some stuff that youâ\u0080\u0099ve already said, which wasnâ\u0080\u0099t available certainly to us. On the Novartis radioligand collaboration, have you â\u0080\u0093 what you have done for Novartis cut out for me. Itâ\u0080\u0099s just you need help with the actual radio activity, and you can do everything else yourself. And my final question on the funding side of things, I absolutely appreciate that if you keep at your current level of spending, youâ\u0080\u0099re funded through to â\u0080\u009826. Jo, very good questions, and let me kind of go through. So maybe Iâ\u0080\u0099ll actually take that one last, which is like FTE guidance â\u0080\u0093 spending guidance, Iâ\u0080\u0099ll take that last, but I will start with the 533 trial. As you said, we guided 25 to 45 patients that is absolutely correct. It is definitely something we want to do, especially then at the higher dose levels to include more patients. At this point in time, for this year, just given the time we will have initial safety data of a good handful. And so â\u0080\u0093 and then we will also see initial efficacy results as this cannot drag on for a month, the activity has to show itself in the first weeks when you apply the drug. The caveat we want to give here and just to be also clear is there has been success in AML where some drugs have shown early results, but it didnâ\u0080\u0099t last very long. So even if we see an early response for the real value that we are aiming for and because weâ\u0080\u0099re targeting also the leukemic stem cells, we want to see activity by on just 1 or 2 months. There is biomarkers to sort of predict that, but the data is the data. As we cannot foresee at what dose level we see activity, itâ\u0080\u0099s difficult to guide on timing, but the second half of the year for initial results is good. Maybe to the Novartis collaboration as well, I was just going to point out one thing in the way that we were â\u0080\u0093 the question was, so Jo, for your benefit, the deal when we did the two targets with NIBR, these are two targets that they had asked us to build which, we said at the time not things that we were actively prosecuting at that time. But the comment and the consideration around the kidney accumulation issue, thatâ\u0080\u0099s a systemic problem for all protein therapeutics and one that weâ\u0080\u0099re now showing that we can potentially and it looks very encouraging around, but that was not â\u0080\u0093 and is not a rate-limiting step for us in our relationship with Novartis. They will profit from it because we want the profit as a partner, and we want them to succeed, but I donâ\u0080\u0099t â\u0080\u0093 I just want to be sure that there was a confusion in the question that there were somehow this kidney toxicity accumulation consideration with somehow rate-limiting to our work with Novartis or anything else. Jo, when we signed the agreement with Novartis, there was no  cell whatsoever, no orthogonal approaches. But the time lines for â\u0080\u0093 from binders to candidates to clinical trials, thatâ\u0080\u0099s the question you have to ask Novartis. So we can only guide on our own pipeline, and we hold through that we want to see the first radio DARPin Therapy in the clinic next year in â\u0080\u009824. And you made it also, I think, very clear that I mean â\u0080\u0093 there is more to just linked DARPin to a  and put a radioisotope on and you have your product. I think what I just described, so the chemistry that is actually quite simple. And thatâ\u0080\u0099s where we want to also then work with the leader in the field or the leaders in the field, maybe one because that race is ongoing or race. We donâ\u0080\u0099t â\u0080\u0093 we need partners who can do it, and we will likely do collaborations, maybe more of the shape of a 50-50 that we co-own the product with such a company that actually has radioisotopes and is building the delivery and the logistics around it. So, get you understand how we see that. So, not alone, but real partnership and while the chemical or the technical part that we have or are mastering well, we donâ\u0080\u0099t see any limitation so far, not at all. At the same time, the complexity of the value generation chain, yes, and thatâ\u0080\u0099s where we want to team up. And thatâ\u0080\u0099s why you should see, hopefully, the collaboration agreements this year. Then I think the funding letâ\u0080\u0099s go back to that an acceleration, I think itâ\u0080\u0099s true. So, what we have at the cash reach is built on, letâ\u0080\u0099s call it, scenario â\u0080\u0093 on a conservative scenario of a rather steady cash burn. And if a program is stopped obviously then the cash burn will be longer, which is in a way not good, if things go really well, if 533 looks great, then we want to accelerate, you are right. At that point in time, but also our stock price should change, so there is different optionalities there or partnerships. So, to do a partnership or whatever on good data is a totally different game than now. So for us, itâ\u0080\u0099s really bringing the good programs forward, collecting the data and then see what is the best way to bring it forward alone or in partnerships. 533 is the base that we want to do it alone and if that is possible, that is plan A. I hope that answers part of your funding question. So, we see this rather steady, a bit up and down. I think we are at this point in time more on a steady state than a growth trajectory, also given the market and the state of the company â\u0080\u0093 stage of the company where the programs are. I hope we could answer your questions, Joe. You have given us your FTEs, You increased your staff by 7% on Page 14, but thank you very much. But what thatâ\u0080\u0099s going to be next year, if it is â\u0080\u0093 I mean, 7% is more or less almost equal. So, letâ\u0080\u0099s stay on the durability of 533, and it is actually the key design feature of this drug. And the problem of durability is also of other drugs clonal escape, because you are not killing all clones, that means you might reduce the tumor mass. But if 10% of your tumor cells are not killed, there you have your population that just goes back in two months afterwards, you are at the same starting point that you were. We are trying to go broader with our tri-specific approach and include â\u0080\u0093 and there is a bit of debate, we call it the leukemic stem cells or the precursor cells, because if you really get to them, if you really can kill those cells upstream that are causing the problem, you have at least the belief and the hope to have a much longer durability of your response because, a, you donâ\u0080\u0099t have clonal escape because we are targeting three targets. And b, you are sort of drying up whatâ\u0080\u0099s it called the stream or you have to source so that you really could kill those cells that are responsible for the relapse. Thatâ\u0080\u0099s where we have a lot of preclinical data that was presented at ASH, and thatâ\u0080\u0099s what we want to show in the clinics. Now, as I have said, the holy grade is obviously to follow the patients and see the non-relapsing patients that follow the time they donâ\u0080\u0099t relapse. And if you are MRD negative, meaning there is no disease that is a good, call it, biomarker for your durability of response. So, that is something we are looking into as early as we can when we see a complete response. So, to have a complete response, MRD negative, thatâ\u0080\u0099s the first thing we are hoping for. And then obviously, looking that translates into durable responses. And all on the design of the drug, so this is not by chance, if this happens, this is because we designed it to happen. On the DLL3 and I am also glad about that question, now going to Radio DARPin therapy. And take PSMA that target or other targets you were hinting to, these are targets that have groups where ligands combined really well. With the DARPins, we are rather agnostic is itâ\u0080\u0099s on the surface and itâ\u0080\u0099s a protein that we can bind it. So, we are hoping to expand the target space beyond what is, I would say, ligandable or addressable with ligands, so going to the broader space. And we have chosen DLL3 because of other also â\u0080\u0093 because itâ\u0080\u0099s â\u0080\u0093 because certainly itâ\u0080\u0099s high medical need, especially in small-cell lung cancer, but also in some prostate, and it is â\u0080\u0093 the tumors are highly metastasized, so that one of the reasons. At the same time, we have a rather big initiative to identify new targets for DARPins. And as I have said, they are sort of a gating system that it should be something where that is more DARPin unique, I mean maybe not ideal for ligand. And then in indications where radiotherapy is used, so itâ\u0080\u0099s sort of a Venn diagram we are building. And that is ongoing, definitely also something we can update over the year how our thinking of differentiation between radio DARPin and radioligand is coming along, but both great questions and both hinting to the differentiation activities that we are building into our pipeline. One question for me, in other T-cell engagers, there is often a pretty steep dose response curve. So, if you follow receptor occupancy, you see it jump up. No, thatâ\u0080\u0099s â\u0080\u0093 itâ\u0080\u0099s start on, and it is something we are following. As you say, we have to try specific with the lower affinity, so itâ\u0080\u0099s not quite as easy as itâ\u0080\u0099s not one target. What we are doing is obviously â\u0080\u0093 and thatâ\u0080\u0099s the good thing in AML, we can take patient samples as you go. So, itâ\u0080\u0099s much easier than a solid tumor biopsy. But your point you make, so how steep that sort of response curve will be, we will have to find out. We did not up for the most potent molecule because potency was seen with other T-cell engagers, but with the side effects were just too strong. So, the idea, hopefully is that we actually can find that window of engagement and killing without the side effects. And we will update definitely with all the data we have, and we are measuring exactly what you were hinting at. So, how â\u0080\u0093 and its receptors occupancy, if you want, or how many DARPins per cell and how active are the T-cells. Just a couple of quick questions on 533, any plans on â\u0080\u0093 and please, I beg your pardon if you have already addressed this, but any plans on expanding the clinical sites to the U.S.? So, the initiation of the trial plan or the first part is planned for Europe at this point in time. With success, with good response rates, with complete responses, we would immediately want to go to the U.S. to include U.S. sites. Then abicipar, where does the program stand, let me quickly remind you so abicipar went to through two Phase 3 trials. It has stellar efficacy data activity data with three or every three months injection being as â\u0080\u0093 then as a monthly Lucentis regime, so non-inferiority reached. So, we put a lot of activities on further purifying and we brought the 15% to below 10%, but then we hit a ceiling we could not explain. As we gave the program back and more recently, we have found the likely culprit of those 10%-ish, below 10% inflammation, which is the silicon oil that is used to lubricate the syringe that together with the DARPin, so itâ\u0080\u0099s sort of an induced indirect impurity that causes DARPin aggregation. The solution is rather simple to go for non-siliconized syringes, then you could move the program forward. So, this has to happen outside of Molecular Partners. While the efficacy is good, we also have to state that other programs have caught up on durability that is now is also out there now, taking market with high-dose idea. So, the question is really more how would one run trials and what is the investment to make a big part competitive in the landscape. Just to give you an update, that â\u0080\u0093 those discussions are out there. Itâ\u0080\u0099s not what we are kind of doing a day job, that 533 in the pipeline. But if there is optionality, we are open to discuss that with potential partners or investors. So, I just have a couple, first on 317. So, you have mentioned you expect to complete the patient recruitment in the dose escalation part of the Phase 1 study in the first half of this year. So, we are definitely closing in on that, and it depends a bit sort of how long patients are on trials and so thatâ\u0080\u0099s going on. Also to what are we looking for, and one thing we wanted to guide is we are not expecting to  a good panel of biomarkers showing activation of the immune system locally. ABC is going up, T-cells moving in for those markers and cytokine patterns and mRNA patterns in the cells. So, that data set should then be used to sort of conclude that the mode of action is safe, it does, and it moved forward in combination with drugs that would that initial incubation. What companies come as a partners, likely those that are in immuno-oncology and have a franchise to build or defend. So Roche, obviously, has Atezo. If that Atezo combination and they are doing the PD-L1 combo with their FAP CD40, if that looks stellar, my guess is companies with a PD-1 or PD-L1 would like, obviously not to be pushed out by Roche, but to have a chance against. So, likely partners would include those that have that franchise and that investment ongoing. There is other combination partners like more chemotherapy, radiation therapy that also boost that can be looked into. I think the questions also allowed us to highlight how we are thinking about our pipeline, how we are differentiating over other approaches, and that is our highest mantra differentiation and to gain high patient value and early clinical readouts. Thanks to Seth, who I visited this week and also thanks to everyone on the line and all of our investors supporting us."
}