{
    "symbol": "LICY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-30 11:50:11",
    "content": " Beginning on Slide 3, covering key achievements from the past year that position Li-Cycle as a preferred global battery recycling partner, in North America with four spokes in operation, we grew our total processing capacity by nearly three times versus the prior year. We are reiterating that we expect commissioning to commence in late calendar 2023, beginning to expand and diversify our customer base within the battery material supply chain, including notable multi-year commercial arrangements with strategic global participants LG and Glencore, and we further strengthened our balance sheet with the receipt of $250 million from strategic partners and have significantly progressed meaningful debt financing alternatives in support of our future network growth. Turning to Slide 6 for a look at our total addressable market, or TAM for lithium ion batteries available for recycling in our focus regions, as well as Li-Cycleâ\u0080\u0099s progress in capturing this growth, as mentioned earlier, we continue to add to our portfolio of customers across the entire battery supply chain, including battery, EV, energy storage OEMs, as well as traditional recyclers. Turning to Slide 7 for black mass production, we continued to generate higher product sales volumes due to the ramp-up of operations in our spoke facilities, with the Arizona spoke coming online in the latter half of the year and the Alabama spoke right at the end of the year. Specifically, key milestones include achieving nearly 75% completion of the warehouse and associated administration center for the storage of black mass and finished battery-grade materials; progress with the construction of the cobalt, nickel and manganese processing buildings; largely completing civil works as well as underground utilities and electrical infrastructure; more than 90% of equipment has now been procured and weâ\u0080\u0099re nearing 65% completion on detailed engineering for the project."
}