{
    "symbol": "LICY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-06-14 15:51:06",
    "content": " Strategically, we are positioning Li-Cycle’s Spoke & Hub integrated network as a long-term preferred recycling partner and supplier of lithium-ion battery materials, particularly in North America and Europe. Now, let's shift the Li-Cycle commercial strategy and our recently completed global partnerships bolstering our ability to capitalize on these market trends and accelerating our comps in sustainable, regional, closed-loop battery supply chains. Importantly, these agreements enables us to jointly develop big opportunities for Spoke, secure incremental black mass supply to our hubs and optimizing the black mass sales, commercials, expand the market for our battery-grade end products to reach our house, secure off-take for the main byproducts producing our Spoke & Hub network, and finally, obtain a secured supply of sulfuric acid, one of the key region inputs for our house. Partnering with Glencore as a leading primary metal source, and LG as a leading battery manufacturing source, Li-Cycle’s Spoke & Hub network is well-positioned at the intersection of the battery material supply chain. The current network consists of a total of seven Spokes in North America and Europe, and one hub in North America targeted to be operational in 2023.This phase of our goal is fully funded and is expected to lead to sustainable cash flows particularly following commissioning of our Rochester Hub in 2023.As for future growth prospects, we anticipate a modular approach to capital investment and associated operating expense. Your line is open. There is always saying, Robin, the  specifically, Kingston is been running a lot of large format feeds, which in the future would be directed to one of our newer format plants, which will have increased ability to process that material and we'll optimize by Kingston and Rochester to focus on smaller format materials for consumer, electric drive batteries and manufacturing scrap in order to see a further increase in throughput. Your line is open. Your line is open. Your line is open. So you're right, so to the two spots that we've announced, one in Norway, one in Germany are both in the same design as the Arizona and Alabama Spokes, so what we're forecasting is that they'll reach out to that time to the year of processing capacity and be able to process everything up when excluding four electric vehicle battery packs. Your line is open."
}