{
    "symbol": "LICY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-03-17 14:43:05",
    "content": " From there, we will process the black mass produced at our spokes to our hub, resulting in finished battery-grade specialty materials that can be sold as a domestic source of supply and an alternative to mined sources. Bringing this all together, by the end of 2023, we expect to have a total of 65,000 tonnes of lithium-ion battery spoke processing capacity between North America and Europe with the first hub in North America, capable of processing 35,000 tonnes of black mass annually. So one of the key benefits of the business model is we're able to turn those potentially volatile materials on the inbound side into an easily transportable --  And as you can see in the deck, we average price at around $3,500 per tonne for the quarter, high-value intermediary product that is shipped in bulk bags like most concentrates that you've seen around the world directly to the facility in Rochester. What I would just say that really simply put is as you think about this year, I would just encourage you to have listened to Debbie's remarks that we're talking about the Alabama and Arizona spokes coming in primarily in terms of ramp up in the back half of the year as you think about how to model this year in terms of the guidance we've stuck with, obviously, in terms of the black mass production. I guess what I'm going to figure out is with the Kingston plant running below for this last quarter with the maintenance, can you catch up, so to speak, because with your maintained -- all your black mass production, I would have thought that you would need Rochester and Kingston running pretty close to 100% capacity. There's capital, there's our OpEx component, and there's also the revenue benefit from the additional spokes to bring them online and alter selling black mass and of course, given the broader environment, which is favorable for us from a supply-demand perspective for those materials and their associated material pricing that factors in the black mass that's, of course, favorable. While not perfect math here, if we were to take the black mass produced in the first quarter and kind of imply with the lithium-ion battery equivalent into the spokes via pricing as the third variable, you kind of get like a low 70% conversion rate, which would make sense given that right now, a lot of the input is feed scrapped."
}