{
    "symbol": "NEWR",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-04 00:00:10",
    "content": " Customers trust New Relic with their telemetry data because we've taken a strong regulatory posture in security, privacy and compliance with SOC2, GDPR, FedRAMP, and as of last week, we're now the industry's first HIPAA-compliant observability solution across all data types. New Relic is thinking much more broadly about the users of observability, considering not just the needs of IT operations, site reliability engineers and cloud engineers by taking a developer first approach, and bringing the power of telemetry data into the flow of tools developers already use every day, ultimately reaching the estimated 28 million professional developers who build the software to begin with. For eight quarters, revenue growth has decelerated while we've replatformed our products front-end and back-end, pivoted towards the new platform pricing model, and migrated existing customers' contracts to the consumption model as a foundation for the vision I described earlier. As I mentioned at the beginning of the call, we're pleased to report just over $180 million in revenue, 11% year-over-year growth compared to the first quarter of our last fiscal year, and a significant increase over the $172 million to $174 million that we provided as guidance in our earnings press release last quarter. These on top of AI Ops, logging , New Relic Explorer and many other platform innovations over the past few quarters are delivering incredible value for customers, which we believe will fuel increased platform consumption for quarters to come, and that's just the start. As I mentioned, though, one of the aspects of the New Relic One strategy that I laid out that is new as of last year, is this focus on self-service and really building next-generation cohort of customers that are looking for observability from the start and really starting in a self-service model that not only validates our platform and the product market fit. Operator, next question, please? Operator, next question, please? The way I think about go-to-market - this is Bill, the way I think about go-to-market, there's really three approaches and now that we have at New Relic, there's our sales-led approach, which for our top most highest contract - highest value contract customers. Operator, next question, please?"
}