{
    "symbol": "COLM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 21:47:13",
    "content": " Your line is live. Your line is live. I think, Laurent, it's effectively - when you look at our Q2 outlook at plus 5% on the top line, this is really a function of the top line in change in our outlook relative to what we've previously provided because we previously indicated that the first half would be up high teen to low 20% and pretty balanced between the first and second quarter. Aside from that, in the first half, we've actually increased our outlook from a gross margin standpoint as we've seen slightly lesser effect from ocean freight relative to what we previously estimated and continued strong oil price environment in which we're not as promotional. Your line is live. And then as we've planned it for the balance of the year, and as we've previously discussed, we've moderated some of that growth that's factored into the outlook that we've provided, and how we thought about that from -- in the back half of the year. Your line is live. And certainly, you're seeing that as it relates to ocean freight, and we've also seen increases in oil prices that are equating to fuel surcharges much of that is up in our gross margin, but it's effectively the inflationary pressure that's impacting that SG&A line. Your line is live. Your line is live. And the way we've thought about that as we look out at the balance of the year, it's really keeping it relatively stable with maybe some modest improvement, which is part of the reason why when we think about our outlook for the year and the order book that we've taken from our wholesale customers and the revenue forecast we put out there, we have adjusted that in part just due to certain of the uncertainty and risk associated with the supply chain and just overall economic environment. Your line is live. I think on the region and mix or region and channel mix side of your question, part of that is due to the fact that our wholesale business is growing at a faster rate than our direct-to-consumer business on the year, and that's implied in the outlook, and that's a little bit lower of a gross margin. It's -- these are shifts of spring deliveries that are coming in quite a bit later than last year, knowing that we've been impacted by later or longer logistics time frames, coupled with the Vietnamese factory closures last year. And then part of the reason why, as you look at our second quarter outlook, it's plus 5%, you're not necessarily see that catch-up and that's in part because we've reduce the Q2 outlook for the combination of the Russia business and backing those sales out, coupled with the reduction in our China business. Your line is live. Your line is live. I would say that the second quarter is typically the most significant shipping quarter into the Russian distributor because that's when we ship the bulk of our fall product, so it will have a disportionate impact, which you see that in the outlook that we're providing."
}