{
    "symbol": "LW",
    "quarter": 3,
    "year": 2023,
    "date": "2023-04-06 13:25:03",
    "content": " Despite lapping some of the pricing actions we took in fiscal 2022, price/mix in both the Foodservice and Retail segments in the quarter was better than we anticipated as we continued efforts to rationalize pricing structures and strategically improve customer and product mix across the respective portfolios. Global's product contribution margin increased to $168 million from a relatively weak prior year quarter, which at the time reflected significant input in manufacturing cost increases and only a modest benefit from product pricing actions. Global segment's product contribution margin percentage in the quarter was 25.8%, which is back to a seasonal pre-pandemic level and was also a bit better-than-expected as we realize more benefits from pulling forward pricing actions for some customers than we originally anticipated. Sales in our Foodservice segment grew 22%, driven by a 25% increase in price/mix as we continue to realize the carryover benefit of product pricing actions that we announced throughout fiscal 2022, as well as the actions taken in fiscal 2023 to counter inflation. Retail's product contribution margin increased to $83 million and its margin percentage topped 38%, as the cumulative benefits from pricing actions more than offset higher manufacturing costs per pound. Excluding the contribution from EMEA, we expect our net sales growth in the fourth quarter to be driven by price/mix as volumes will continue to be affected by certain -- exiting certain lower price and lower margin volume business to strategically manage customer and product mix and the potential for a slowdown in restaurant traffic and consumer demand. And then certainly there's going to be a number of things as we bring EMEA into our operations that we're looking forward to having that one phase to the customer, introducing our revenue growth management capabilities and bringing in our supply chain common methodologies and ways of working that we're looking to work on over time as we integrate this business with ours to bring in more upside as we continue to progress."
}