{
    "symbol": "AGO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 12:15:26",
    "content": " Adjusted operating income per share of $2.11 for the third quarter and $3.88 and for the first 9 months represented increases of 369% and 49%, respectively, compared with last year's periods. In total, our insured par sold in the primary and secondary market was $15.1 billion, the third largest amount we have insured during the first 9 months of any year in the last decade. During the third quarter of 2022, our insured par sold in the primary and secondary markets totaled $3.4 billion, of which $480 million was secondary market par. In aggregate, for the first 9 months of 2022, we insured more than $2.3 billion at par on 103 primary and secondary market transactions that either S&P or Moody's or both had assigned AA underlying ratings. In terms of premiums, third quarter 2022 net earned premiums and credit derivative revenues were $92 million compared with $114 million in the same period of last year. Specifically, fair value losses related to alternative investments in the third quarter of 2022 of $11 million compared with gains of $33 million in the third quarter of 2021. In third quarter 2022, the related fair value loss was $8 million on a pretax basis, primarily due to rising interest rates. Economic loss development, which was a net benefit of $72 million in the third quarter of 2022, was also affected by the rising interest rate environment as it included a benefit of $25 million related to higher risk-free rates used to discount expected losses. The economic benefit was mainly driven by a $95 million benefit in U.S. RMBS, which has several components, including a benefit related to the purchase of a loss mitigation security, a benefit on assumed RMBS, where we share proportionally in a ceding company's rep and warranty settlement; and additional benefits related to updated second lien default assumptions, higher recoveries on charged-off second lien loans and improved performance in certain other transactions. The Asset Management segment's adjusted operating loss was $3 million in the third quarter of 2022, an improvement over last year's adjusted operating loss of $7 million. With respect to our capital management objectives, we repurchased 1.8 million shares for $97 million in the third quarter of 2022. However, between then and the year-end 2021, we repurchased $1 billion of our common shares, $1 billion worth of common shares, paid approximately $140 million in dividends, paid over $700 million of par debt service, excluding settlements, invested over $500 million through AGS and other high cap charge investments."
}