{
    "symbol": "AGO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 10:24:05",
    "content": " Our U.S. public finance, international infrastructure finance, and Global Structured Finance, financial guarantee businesses combined to produce $375 million of total PVP in 2022. Primarily as a result of the substantially reducing -- substantially resolving our Puerto Rico par exposure, including $2 billion from the settlements plus $200 million from normal amortization, we have reduced the below investment grade portion of our net par outstanding to just 2.5%, the lowest level since we acquired AGM in 2009. Also in 2022, we retired 8.8 million common shares or 13% of the shares outstanding at the beginning of the year, which helped to boost adjusted book value to a new record of almost $142 per share. Net economic development for 2022 was a benefit of $125 million, primarily consisting of a $17 million loss for public finance transactions and a $143 million benefit for U.S. RMBS transactions as we continue to see improved performance, higher recoveries related to charge-off loans, benefits from loss mitigation efforts and the economic benefit associated with higher discount rates. The benefit of $221 million in last year's loss expense mainly consisted of $155 million benefit for public finance transactions, which reflected the increased certainty of the outcome of 2022 Puerto Rico resolutions and an $84 million benefit for U.S. RMBS transactions. The other main driver of the year-over-year variance in the Insurance segment adjusted operating income is the mark-to-market on alternative investments, which was a loss of $51 million in 2022 compared with a gain of $144 million in 2021. In the Asset Management segment, results improved year-over-year with adjusted operating loss of $6 million in 2022 compared with adjusted operating loss of $19 million in 2021 as increasing fees from opportunity fund strategies that were initiated after our acquisition of Blue Mountain outpaced lower fees from reduced AUM in the wind-down funds. The Corporate division adjusted operating loss was relatively consistent year-over-year, including the $130 million after-tax extinguishment of debt in 2021 that did not recur in 2022. In terms of our capital management objectives, we repurchased 1.7 million shares for $100 million in the fourth quarter of 2022, bringing full year 2022 repurchases to $503 million at an average price of $56.79 per share. Continued share repurchases, along with our positive adjusted operating income, new business production and favorable loss development have increased adjusted operating shareholders' equity per share and adjusted book value per share to new records of almost $94 and $142, respectively. Rob, I think I get my math about $240 million of kind of capacity that you'd have for share buyback this year, if you just take the dividends without special, less holding company kind of obligations."
}