{
    "symbol": "CHCT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 15:31:08",
    "content": " During the second quarter, we acquired one property with a total of approximately 37,700 square feet for a purchase price of approximately $23.5 million. I am pleased to report that total revenue grew from $22.7 million in the second quarter of 2021 to $24 million in the second quarter of '22, representing 6% growth over the same period last year. Revenue for the first quarter of '22 was $23.5 million, representing 2.4% growth quarter-over-quarter. On a pro forma basis, if the '22 second quarter acquisition had occurred on the first day of the second quarter, total revenue would have increased by an additional $302,000 to a pro forma total of $24.4 million in the second quarter. G&A increased from $3.3 million in the first quarter to $3.6 million in the second quarter, or 8.9%. I am pleased to report that funds from operations, FFO, for the second quarter of '22 grew to $13.7 million from $13.5 million in the first quarter of '22, representing 1.5% growth quarter-over-quarter. On a per share basis, FFO increased from $0.56 per diluted share in the first quarter of '22 to $0.57 per diluted share in the second quarter of '22, an increase of 1.8%. Adjusted funds from operations, or AFFO, which adjusts for straight-line rent and stock-based compensation, totaled $15 million in the second quarter of '22 compared with $13.9 million in the second quarter of '21, or 7.6% growth year-over-year. On a per share basis, AFFO increased from $0.58 per diluted share in the second quarter of '21 to $0.62 per diluted share in the second quarter of '22, or 6.9%. Finally, AFFO for the first quarter of '22 was $14.8 million, representing a 1.1% increase quarter-over-quarter. On a per share basis, AFFO increased from $0.61 per diluted share in the first quarter of '22 to $0.62 per diluted share in the second quarter of '22. And on a pro forma basis, if the second quarter acquisition had occurred on the first day of the second quarter, AFFO would have increased by approximately $271,000 to a pro forma total of $15.3 million, or $0.63 per diluted share."
}