{
    "symbol": "BRZE",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-21 01:04:05",
    "content": " Our customers are already seeing great results with this product, including a financial services company that has driven a 14% conversion rate by personalizing onboarding journeys for new members; and an on-demand streaming service that saw a 61% conversion rate by sending users some custom paths based on their engagement with e-mails and livestreams. Your line is open. And so when we're in a competitive sales cycle and we're working with customers that are in varying points in their journeys, those that have already embraced the interdisciplinary aspect of doing kind of modern customer engagement where you have the creativity for marketing and growth teams coming to light quickly through collaboration with product engineering and then having those results being analyzed to kind of drive additional experimentation through collaboration with data science, that those are groups that can look at the differentiation that Braze provides through our vertical integration and through our real-time capabilities and really vividly understand the ROI that that's going to bring to them. But there are other cases where customers are still thinking about things in a single channel mindset, or maybe other parts of their systems are not kind of ready to embrace the new kind of data streaming paradigm and they just can't get over that hump for they kind of perceive it as a bridge too far to leap over today but those are places where a product that is maybe built for a less sophisticated audience is going to have a more appealing lower price point and maybe they don't experience the ROI or kind of vividly understand it as much. Your line is open. So Bill, when we see the top line acceleration that you're reporting here in this quarter, I guess I'm curious whether you're seeing any extra type of tailwind from some of the large brands that they could be just fundamentally rethinking their whole stance on first-party relationships and maybe pivoting in that direction kind of in the wake of Apple's changes to IDFA. And so when you look at the footprint of our SDKs and libraries that have been integrated into the products of our customers and not just doing so in a way where they kind of sit in the background but are actually integrated into the user experience, into the UI and the look and feel of those products, that's something where we've had to build in a ton of technical sophistication to be really good citizens inside the world's largest mobile applications across all the different platforms and across the web as well and then be able to kind of both instrument and deliver messaging in an interactive way through all the platforms. The demands that are placed on that to be able to do both kind of large, kind of volume-based, things like breaking news alerts and other sorts of kind of just-in-time or urgent kind of large volume messaging while also being able to deliver those interactive in-product messages and do so on the basis of a real-time data platform where everything is always live and able to seamlessly move back and forth across platforms and channels, this is just an immensely hard problem to do at scale. So, I think I could probably -- I started this answer by saying there's two main things and there's obviously a lot more to it there but we believe that the design and technology this year has really been purpose-built for more than a decade now in a really focused way for what the modern customer engagement should be and how it should be approached. The -- if you look at companies that are coming to the stock market to have their IPO, there's kind of a branding thing that goes with it in terms of the -- as a CFO, you have less calls with prospective customers around like financial stability and stuff like that because people can see your numbers. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. And we also know that customers want to build and buy in ways that are going to vary from place to place which is why if you go back to kind of the dual purpose that we try to serve with Braze where we are both going to be that turnkey SaaS solution and be a collection of powerful robust APIs that product engineering teams can build on top of, all of those are also conducive to our engagement with the rest of the partnership ecosystem as well."
}