{
    "symbol": "BRZE",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-30 23:21:09",
    "content": " So a few things there, and I've spoken about this before, but we think that within the broader marketing landscape in the marketing, both spend as well as from the perspective of focus and prioritization within organizations, that we expose  focus of Braze causes us to actually have a large comparative benefit in times where there is either a slowdown or there's increased scrutiny on profitability, I think both of which are being experienced in the market right now. And then Vis -a - vis the overall bucket of marketing spend we have seen ourselves take up actually a large  And then the third one is that even during the period of decreased demand, the need to maintain healthy conversations and relationships with your customers remains always on  We saw that even for heavily impacted industries like travel and hospitality,  strong growth and just strength within the existing customer base as that needs to maintain those  Relationships remains a priority for all businesses with a long-term focus. So as we've added more channels over time, as we've added more comprehensive data integrations than as brands in general, if you go back to the question that I just walked through, are continuing to grow their own direct-to-consumer audiences and start to embrace new customer engagement strategies, that all of those just mean that the overall size of the audiences that we're engaging, the scope of the services that we're providing in the amount of focus and prioritization that customers are putting on it have grown and all of those multiply together to give us the ability to land larger and larger deals within more and more categories. Yes, I think that when you look at the overall product investment trends that we're doing a few things and what we're really trying to do is lean into our advantages and ability to control the complexity  customers can use more and more Braze's products as we continue to grow the portfolio. So when you look at the commerce side, there's a lot of improvement in terms of data integration's, making sure that we've got the right data models and reporting capabilities as well as integration into platforms like Shopify that we continue  quickly so that as they grow with us overtime  in data insights to their strategies,  you improve and upgrade and advance  Allowed for customers to  Strategy that customers go through. When we see our commerce  to product catalogs and recommendation, there's a lot around recommendation that especially for certain types of retailers, involve things like inventory and margin that they want to optimize for when they're looking at different amount to compare together their first party engagement strategy with what in many cases also involves heavy acquisition strategy that we've been really building for  and small Commerce customers over time. I think that we've tackled a very fundamental business problem with Braze, where we're focused on trying to invest in customer relationships over the long term, doing that through communication and understanding our customers, the go-to-market across the specialty. And so in all of those examples, there are certainly aspects of it that will require product investment for Giga -Hertz expansion, we balance those against our penetration into those markets, the nature of those markets, and we'll continue to put go-to-market resources closer to the locuses of customers, especially as we see the potential to grow into a very large market, or if there's particular ways that the traditional industries in those areas work. And so when you look at a lot of the trends in the space right now, and a lot of it is about helping data engineers and product engineers really work at the higher value-add points, getting out of the data pipelines, getting out of , making sure that they can use more and more sophisticated APIs over time, making it easier for them to collaborate with the people that are closer to the business problems, like with the marketing and the growth teams."
}