{
    "symbol": "BBBY",
    "quarter": 3,
    "year": 2022,
    "date": "2023-01-10 10:17:07",
    "content": "  Operator: Good morning, and welcome to the Third Quarter 2022 Bed Bath & Beyond, Inc. Earnings Conference Call. Before we begin, Iâ\u0080\u0099d like to remind you that our fiscal 2022 third quarter earnings release can be found on the Investor Relations section of our website at bedbathandbeyond.com and as exhibits to our related Form 8-K. This conference call and the press release we refer to may contain forward-looking statements, including statements about or references to our outlook regarding the companyâ\u0080\u0099s performance, our internal models and our long-term objectives. Please refer to our most recent periodic SEC filings for more detail on these risks and uncertainties, including the Risk Factors section in our annual report on Form 10-K and our quarterly reports on Form 10-Q. Additionally, the information we will discuss today contains certain financial measures that exclude amounts or are subject to adjustments that have the effect of excluding amounts that are included in the most directly comparable measure prepared in accordance with generally accepted accounting principles. For a reconciliation to those comparable measures presented in accordance with GAAP, please refer to the table in our earnings release available on our website and included as an exhibit to our Form 8-K filed today. Lastly, in light of the ongoing review of strategic alternatives that we disclosed last week, we will limit todayâ\u0080\u0099s call to our prepared remarks. In light of our preannouncement last week, we recognized the importance and focus on todayâ\u0080\u0099s call for those who have been with us on our journey to enact significant change in our business over the past few months, especially, our customers, our associates and our business partners. While we reported our fiscal third quarter financial results in a press release earlier today, my remarks will be focused on the strategic pillars of our turnaround and the progress we are making towards our vision for the company. For decades, Bed Bath & Beyond has set the pace across the home goods sector, and we have commanded our position in retail through many different economic cycles and serving a continuously evolving customer. We believe our concrete advantages in defining categories, offering broad and curated selection and delivering great service for customers are compelling reasons why we will continue to command a formidable presence in the Home and Baby categories in the future. Furthermore, our closing store and no go-forward inventory has reduced from almost $500 million at cost on hand and on order to just over $130 million at cost in the last 6 months. We have worked diligently with our supplier partners and our payables remain at healthy levels, as demonstrated by the continued sequential decline in accounts payable as well as accrued expenses and other current liabilities on our balance sheet. Weâ\u0080\u0099ve seen significant sales trend improvements on both the sequential and year-over-year basis where in-stock levels have improved to a more normalized range, above 80%, particularly related to our Bed Bath circular items and at our buybuy BABY business. In addition to our merchandise strategy, strengthening our operations and financial performance to better serve our customers continues to drive our decision-making. As part of our turnaround, we are resetting foundational elements to create a stronger and more nimble infrastructure that aligns closely with customer demand and preference. We are delivering on our aggressive second half commitment of $250 million in SG&A optimization, or $500 million annualized, and the 150 store rationalization target that we previously outlined. To more accurately align resources with our focus areas and future, we are enacting an additional $80 million to $100 million in cost reductions across corporate, including expense and headcount. Our organization is more streamlined to enable our priorities across Bed Bath; buybuy BABY; and Harmon, and we have adopted an infrastructure that reflects our current business priorities. Our entire organization is laser-focused on maximizing the value of our company by reconnecting with our customers and positioning Bed Bath & Beyond, buybuy BABY and Harmon for long-term success."
}