{
    "symbol": "PLAY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-06 18:08:03",
    "content": " Based on a thorough strategic review of the business, anchored and deep consumer research and spending considerable time learning directly from our operators, our core brand position for our Dave & Buster's brand going forward will bring greater focus to executing adult occasions aged 21 to 39, who are visiting our locations to have a great time with their squad. This long-term holistic approach to managing the business anchored in strategic planning and operational execution led to the successful reinvigoration of the Main Event brand, and we're excited to apply the same approach to the larger Dave & Buster's enterprise. We estimate that the calendar shift of the holiday season as it specifically relates to our special events business in 2022 versus 2019 for this five-week period represents a temporary negative 3% overall comp headwind, which will reverse in the remaining weeks of December. And so overall, for the month of December, when you take this noise out between the five weeks in the full quarter, we're extremely pleased with the level of work that we're seeing by our sales team and what we think we will experience from the special events business as a whole for the month of December. I think you're reporting same-store sales just for Dave & Buster's because the Main Event stores, I don't think are considered comp base, and then you're giving us pro forma. And it looks like just as we -- the first five weeks of the third quarter, for Dave & Buster's alone, I think that's all you provided at the time was 17.6% and then you reported 13.6% guidance is for -- even on a consolidated basis, significant deceleration we're not guidance but the quarter-to-date, even when we're making that three-point adjustment to 12% versus the 17.5%. So the weekly average of what we're seeing is fairly consistent with that level of, call it, differentiation or split between the main event in the Dave & Buster's brand that you saw back in Q3 that we showed in the detail to help everybody get their arms around what Main Event is and to help you guys with your modeling perspective. So versus 2019, Europe, I think you said 17.5% on a combined three-year comp in the third -- in this quarter you just reported, and that's slow to say, maybe in the 12 now if you make the Special Events adjustment."
}