{
    "symbol": "NVMI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 13:37:09",
    "content": "  Operator: Good day, and welcome to Nova's Third Quarter 2022 Results. With us on the line today are Mr. Eitan Oppenhaim, President and CEO; and Mr. Dror David, Nova's CFO. Before we begin, may I remind our listeners that certain information provided on this call may contain forward-looking statements, and the safe harbor statement outlined in today's earnings release also pertains to this call. Thank you, Miri, and welcome, everyone, to our third quarter financial results conference call. Nova reported another sequential gross quarter, advancing the agility and the expanding diversification we have built into our business model. Following the introduction of Nova's $1 billion plan and the strong execution of our targets throughout the year, we are confident in the company's long-term performance despite some near-term challenges. Since dimensional and material process control are becoming critical enabling factors for our customers, we continue developing our advanced metrology portfolio to capitalize on various horizontal and vertical emerging opportunities in the markets. Our consistent outperformance in the last few years, driven by our unique organic engines and growing market exposure, support our expectations to continue our outperformance beyond the pure demand dynamics, which is a result of the near-term market cyclicality. Specifically for the quarter our revenue result exceeded expectations and attained the high end of our guidance, including another sequential quarterly record, which represents around 28% growth year-over-year. Highlighting the financial results for the third quarter and given our guidance for the fourth quarter, we currently aim to grow revenue approximately 35% year-over-year overachieving our previous expectations while continuing to deliver strong outperformance versus CapEx and WFE growth numbers for the year. During the quarter, we also held our Investor Day in which we discussed at length our new strategic plan to attain $1 billion in revenue in five years. The plan's fundamentals to achieve growth while strengthening our resiliency and agility were based on the company's consistent performance in diversifying its business across products, markets, customers and geographies. First, the diversity of our customer base is well demonstrated by four major customers this quarter, representing our growing expansion in various leading players. Furthermore, the overall customer mix includes contribution from over 20 active customers across geographies, territories and even new industry segments like advanced packaging, back-end and PCB. While we continue to proliferate our traditional OCD products and set new integrated metrology sales records, we also see growing traction with our new organic growth engines. During the year, as well as in Q3, we continued the momentum of our SI technology and delivered a growing number of PRISM tools, both for R&D and high-volume manufacturing for critical 3D applications. Since acquiring ancosys and based on our growing focus to lead the materials metrology space, we are encouraged by the solid contribution of our materials portfolio to the overall revenue mix this quarter. Specifically, I would like to highlight, as shared in the press release during the quarter, that another Logic manufacturer selected Nova's METRION for next-generation IC development. Based on our Q4 guidance, we now expect a record year for ancosys, creating multiple growth opportunities for next year as well. Turning over 4,700 active tools to date in our installed base, Nova continues to develop and offer our customers a portfolio of services ranging from ongoing support to new upgrades and productivity packages to keep improving utilization rates, metrology accuracy and fleet matching. As a result, revenue contribution from services is expected to grow approximately 30% this year. As we continue to evaluate the impact of such restrictions on our U.S.-based activity and global export conditions, our initial assessment is that the direct impact on Nova's overall business plan for 2023 is marginal and estimated at around USD 10 million in direct revenue, mainly from our U.S.-based operations. Furthermore, while the Chinese market becomes more volatile due to the new trade restrictions, we are encouraged by our growing business in the U.S., which demonstrates significant growth year-over-year. We anticipate this growth to continue next year as well, propelled by both new fabs and new expansions. Finally, as we look at the industry demand environment, although our long-term growth forecast for the industry remains intact, we expect softness in the near term due to excess inventories driven by a slowdown in consumer electronics demand. Although we are monitoring these trends carefully and increasing agility in our operating model, over the last few years we have consistently demonstrated our ability to outperform the industry by proliferating our new technologies, expanding diversification and market share gains. Considering all aspects, we remain positive about the company's long-term growth potential and reaffirmed the strategic target we introduced on our Analyst Day in September. Given our guidance for the fourth quarter, we are striving to achieve another record growth year for Nova. Good day, everyone, and thank you for joining our 2022 Third Quarter Conference Call. Total revenues in the third quarter of 2022 reached a record level of $144 million, up 28% year-over-year. Earnings per share in the third quarter on a GAAP basis were $1.10 per diluted share, and earnings per share on a non-GAAP basis came in at $1.24 per diluted share. Moving into our guidance for the fourth quarter of 2022, we expect to see a strong finish for an exceptional year, led by the company diversified exposure to multiple customers, geographies and manufacturing technologies. At the midpoint of our fourth quarter 2022 estimates, we anticipate the following: gross margins of approximately 57%, operating expenses on a GAAP basis of approximately $45 million, operating expenses on a non-GAAP basis of approximately $40 million. Moreover, including our fourth quarter guidance, the company is expected to present the following annual results on a non-GAAP basis. Annual revenues of more than $560 million, reflecting CAGR of 20% across the last five years and reflecting yearly revenue growth of 35% or more in 2022 relative to an expectation of single-digit wafer fab equipment growth in 2022. As conclusion to my prepared remarks, I would like to note that the company management is closely monitoring the different scenarios of market demand and customer investment plans for 2023. In addition, the company cash reserves grew to over $500 million at the end of the third quarter of 2022. This healthy cash level allows us to continue and execute aggressive growth strategies and infrastructure investments as part of the Nova $1 billion strategic plan as well as to execute the $100 million share repurchase program, which was recently announced and initiated. As mentioned a couple of times in my script, the agility and diversity that we have built in our business model, along with the adoption of our newly introduced technologies and the growing expansion in several markets should support our consistency and outperformance beyond pure semiconductor demand. We're also benefiting from some expansions in R&D line, some new fabs that are coming in play penetration into the materials world with new technologies as well as expanding our portfolio to other markets. And as a follow-up, I know on the Analyst Day, you mentioned services will be on track to reach $100 million this year. We currently have approximately 4,700 tools in service installed base, and this will continue to grow in Q4 and the following quarters. So it's â\u0080\u0093 when we're looking right now on the Chinese markets, we look on the on the straight restriction that came from the U.S. in regard to advanced nodes in both DRAM, Flash, NAND and also the Logic."
}