{
    "symbol": "WKME",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-23 23:10:04",
    "content": " I would like to take this opportunity to invite everyone tomorrow to our first ever Investor Day in New York, where we will outline our company vision for the future ahead, our product roadmap, detail our go-to-market focus and how we believe we can build a scalable, durable business while delivering real ROI and value to our customers. With the progress we've made in our growth drivers in the first quarter, we continue positive momentum from our category and enterprise-class salesforce and growing diversification of ISVs and GSI channels, I'm confident we have a capability to grow 30% plus over the next three to five years. We continue to see strength in our Enterprise segment where ARR from customers of greater than 500 employees is above 92% of our total ARR whereas we continue to face short-term headwinds from churn in our less than 500 employee segment, but we expect those headwinds to abate in 2023 and beyond as we continue to focus on revenue from customers with greater than 500 employees. Today, they represent less than 10% of our total ARR, but we are beginning to see the early signs of the growth potential as Dan indicated earlier regarding our pipeline from these partnerships. Today, they represent less than 10% of our total ARR, but we are beginning to see the early signs of the growth potential as Dan indicated earlier regarding our pipeline from these partnerships. We're all about a fair exchange of value between us and our customers, and that sometimes required some education from our side as you know, it's a new category and we move from selling point solution to selling a wide platform that impacts their digital transformation strategies. So I think we're going to continue to deal with it for throughout 2022 to a lesser degree, but as you move into 2023, I see that that percentage becoming one, that's almost material and it comes from customers  we continue to migrate those customers to DAP value proposition or we'll just move away from that category itself."
}