{
    "symbol": "WKME",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 13:28:05",
    "content": " With this new dashboard leveraging our proprietary DTI AI technology that uses machine learning to understand any user interface and any user journey across all enterprise applications, enterprises will be able to get a clear view of how many licenses are used and the type of usage. I'm excited to announce that we're launching DAP kits, a second generation to our solution accelerators that packs pre-built content for almost every enterprise workflow and task, leveraging all best practices and years of accumulated knowledge from all the major enterprise SaaS applications. Our DPYI  technology has eight unique patterns that automatically understands end user interface and end user journey, and all its elements allowing us to deliver the best experience for both building content and automation focused on end user journey. With this new dashboard leveraging our proprietary DTI AI technology that uses machine learning to understand any user interface and any user journey across all enterprise applications, enterprises will be able to get a clear view of how many licenses are used and the type of usage. I'm excited to announce that we're launching DAP kits, a second generation to our solution accelerators that packs pre-built content for almost every enterprise workflow and task, leveraging all best practices and years of accumulated knowledge from all the major enterprise SaaS applications. Our DPYI  technology has eight unique patterns that automatically understands end user interface and end user journey, and all its elements allowing us to deliver the best experience for both building content and automation focused on end user journey. Before I pass it off to Hagit to review the numbers, I want to thank all of our amazing customers, partners, and most importantly our employees for a great 2022, and I'm looking forward to building value with our entire ecosystem in 2023. Before I pass it off to Hagit to review the numbers, I want to thank all of our amazing customers, partners, and most importantly our employees for a great 2022, and I'm looking forward to building value with our entire ecosystem in 2023. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}