{
    "symbol": "TT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 17:14:05",
    "content": " While this demand has been broad based, we're seeing particular strengths in our nonresidential businesses led by commercial HVAC, global commercial HVAC, organic bookings were up nearly 40% in 2022 on a two-year stack. At our guidance midpoint revenue growth rate of 7%, 2023 revenues would be approximately $17.2 billion when compared to bookings of $17.5 billion in 2022, bookings would need to decline by over $1.1 billion in order for backlog to fall to the $6 billion number that I referenced heading into 2024. We drove an exceptional volume of shipments in the month of December in our commercial HVAC and Thermo King businesses to meet customer demand, which shifted the timing of approximately $150 million in receivables into the first quarter 2023. Over the past five years, including the pandemic in 2020, we delivered a 7% revenue compound annual growth rate, 250 basis points of margin expansion and free cash flow conversion well in excess of 100% and since 2017, we've deployed more than $13 billion in capital, with $8.3 billion return to shareholders in the form of dividends and share repurchases. In the Americas, our commercial HVAC business is driving strong demand and share gains as demonstrated by our full year 2022 order growth that is more than 40% on a two-year stack. While it's been impossible to realize that level of gross productivity over the past three years, given the tumultuous macroeconomic backdrop, productivity has been improving as supply chain slowly recover and is contributing to our 25% plus organic leverage target in 2023. And we see that around, really between $1.30 and $1.35 in adjusted EPS, I think the revenue growth in terms of the first quarter, it's roughly in line with how we see kind of a full year at this point. Yes, Chris, the only thing I would add is if you look at the Thermo King Americas business on two-year stack, order rates are up over 40% and a very large backlog going into 2023. And I'd say I'm so proud of our team in commercial HVAC EMEA, yes, we had 40% plus revenue growth in the quarter, we had some supply chain issues earlier in the year that we highlighted. Steve, as we think about commercial businesses, I'll speak for Americas and EMEA really just our plans right now up high single digits in terms of revenue on the full year, the significant backlog just gives us really strong visibility to the revenue profile. That 68% kind of range, commercial HVAC, I would expect to be stronger as we work throughout the year, just given the profile, we've got some backlog, but certainly carrying into the first quarter. I would say in the commercial HVAC businesses really been impacted the last couple of years of the supply chain challenges, lots of inefficiencies, the inability to drive productivity, lots of increased costs to serve customers and expediting freight, buying components on the spot markets, we've incurred a lot of costs in the business just to get the revenue out."
}