{
    "symbol": "WST",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 15:57:04",
    "content": " You're right, on the Contract Manufacturing side of our business, which is a little bit less than 20%, we do have -- with our agreements with our customers, we are passing on inflationary costs for the most part, whether it's raw materials and et cetera. One is, if we think about for 2022, our confirmed order book for the balance of the year, as we mentioned earlier, it's a very -- it's much stronger than it was the same time period as last year. And what we're actually seeing in operating margin, if you look at our business on a normalized basis, if you back off the one-time take-or-pay that we got in Q1 2021 and compare operating results excluding that, operating margin would have expanded by about 130 basis points. So when you look at it, Paul, it's less than 40%, and we're seeing the biologics become a larger piece of the -- obviously, it's the largest unit today but with the highest growth even ex COVID in the equation. And what we're seeing is really a buildup -- as we talked earlier about, the capital that we're spending in the last couple of years really is -- was already built in our five-year plan, and we're just bringing it forward to support the COVID vaccines. If you think about how biologics is becoming a larger portion of the portfolio, again, across many different customers, so it's not really concentrated on one customer or one drug, it's across the whole portfolio of the market, that will continuously drive higher revenues, higher profits with not a lot of increase on units per se, 100, 100-plus basis points. the -- when we look at it, and it goes back to the point I made earlier about the absorption rates that we experienced in the first half of the year due to some of our labor constraints and that was primarily around Omicron, it impacted us in one or -- in a couple of different sites. And we also had -- when we had spoken earlier on in the year, we were saying we were going to see more of our growth to come in the back half of the year versus the first, and that's still what we're seeing. Because if we look -- again, look at our -- the demand that we're getting with non-COVID related, particularly in the biologics space, which is -- overlaps 100% with the investments that we are putting in, the growth is actually -- is a little bit higher than we anticipated."
}