{
    "symbol": "CAC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 17:58:10",
    "content": " To further highlight the strength of our core operations and results for the nine months ended September 30, 2022 we reported an increase in non-GAAP earnings, which excludes income taxes, provision expense and SBA PPP loan income of 4.5 million or 8% over the same period last year. In regard to our performance for the most recent quarter, we reported net income of 14.3 million diluted EPS of $0.97 for the third quarter, each down 5% compared to the second quarter of 2022. Historically, weâ\u0080\u0099ve seen an increase in our net interest margin in the third quarter each year, due to seasonal growth in deposits within our markets, which we again saw this year, the average quarter deposits increased 4% in quarter-over-quarter. The seasonality and our deposits and our shift in earning asset and nets as we continue to redeploy investment cash flows to fund loan growth, each contributed to NIM increasing four basis points between quarters to 2.88% for the third quarter. Our yield on interest earning assets for the third quarter increased 29 basis points to 3.4% over the second quarter, and represented an asset beta of 20% for the period. Non-interest income comes the third quarter of 2022 totaled 10 million and was down 11% compared to the previous quarter, as we were not immune to the effect of higher interest rates, pressuring mortgage banking income and the down markets affecting wealth management fees and bullying income. That said, we believe, if we were focused on margin, weâ\u0080\u0099re focused on deposit betas, we are aiming to call it be flat on a quarter and for the fourth quarter from a margin perspective, understanding that thereâ\u0080\u0099s call it some level of downside risks there just in terms of seasonal outflows, but again, we think we can manage that, and weâ\u0080\u0099ll be right around flat on the link quarter basis."
}