{
    "symbol": "HMN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 04:32:04",
    "content": "  Operator: Good day, and welcome to the Horace Mann Educatorsâ\u0080\u0099 Third Quarter 2022 Investor Call. With us for Q&A, we have Matt Sharpe on Supplemental & Group Benefits, Mark Desrochers on Property & Casualty, Mike Weckenbrock on Life and Retirement; and Ryan Greenier on Investments. Last night we reported third quarter core earnings of $24 million or $0.57 per share, up 14% over last year. In this challenging environment, those results clearly show how we are benefiting from the revenue and earnings diversification of our multiline business model. Providing employer-sponsored coverages, personal lines insurance and savings products enables us to build strong and lasting relationships with our educator customers. Consistent with the external environment, financial market volatility and inflation continued to affect our financial results in the third quarter and we expect them to impact fourth quarter results as well. And because of educator risk characteristics, our market is insulated, although certainly not immune from the full impact of broader external pressures. Bret will cover the details of guidance later in the call, but at a high level, we now expect full year core EPS of $1.70 to $2. We remain confident, we are properly positioned to address the headwinds and to achieve our long-term objectives of a larger share of the education market and a sustained double-digit return on equity. But first, as I discussed last quarter, three major external factors; severe weather, financial market volatility and inflation are challenging the insurance and financial services sectors in ways not seen in recent memory. For Horace Mann, our strategic actions over recent years mean that weather wasnâ\u0080\u0099t an outsized factor in the third quarter results. Further, the demand surge related to Ian recovery is likely to intensify already unusually adverse inflationary trends affecting both property and auto carriers. Investors are having to adjust to significantly higher and less predictable interest rates as well as considerable uncertainty around the underlying trends in inflation and growth, putting valuations under significant pressure. However, as we said last quarter, our portfolio is certainly well positioned. Our core portfolio new money rate approached 5% in the third quarter, up nearly 150 basis points from last year, which will certainly be a positive as we invest over the coming quarters. Further, our Life and Retirement segment continues to experience lower charges and fees on variable annuities and asset-based accounts as well as unfavorable market performance related to DAC unlocking. In addition to rate action implemented in the first nine months of 2022, we expect to increase auto rates by approximately 15% to 16% between now and the end of 2023. As a result, we expect to be at a seasonally adjusted combined ratio under 100 by the fourth quarter of 2023. In property, we expect to increase rates by 8% to 9% over the next five quarters. As we said last quarter, these external events have clearly interrupted our progress towards our long-term goal of a sustained double-digit ROE. Weâ\u0080\u0099ve spent most of the last decade positioning Horace Mann to be able to significantly increase our share of this market by expanding our product set, strengthening our distribution and modernizing our infrastructure. So in most geographies, our agents are attending more education events, providing more in-school financial wellness workshops and are better able to build new relationships with in-person interactions. Since the programâ\u0080\u0099s launch in 2016, weâ\u0080\u0099ve helped educators identify more than $450 million in student loan forgiveness opportunities primarily through the federal public service loan forgiveness program. Our program is complementary for educators, increases our brand affinity and our niche market and build strong prospecting opportunities that we can leverage to accelerate household acquisition. In this yearâ\u0080\u0099s more normal operating environment, weâ\u0080\u0099re also hearing from our independent benefit consultant partners that school administrators are more attuned to addressing staff recruitment and retention challenges. Policy application counts, one of our key leading indicators for individual life sales was strong, running above last yearâ\u0080\u0099s back-to-school season. That said, weâ\u0080\u0099re fully aware of the risks inherent in todayâ\u0080\u0099s competitive auto market. I commented during the height of the pandemic that we werenâ\u0080\u0099t surprised educators werenâ\u0080\u0099t focused on shopping for auto insurance, given their frequently changing work environment and concerns about their own families. Stepping back, whether it is through a new auto policy, a new life policy or any of our other interactions, each new touch point with an educator has the potential to be the beginning of a lifetime relationship. Our customer cross-sold percentage is far higher than the industry average, and our retention rates for cross-sold customers grow the more products they own. In summary, while our results in the short-term have been affected by very challenging external factors, we have many reasons to be optimistic about the opportunities to leverage our leadership position in the education market in 2023 and beyond. As Marita mentioned, inflation and financial market volatility impacted our results again this quarter as we reported core earnings of $24 million or $0.57 per share. One, we now expect the P&C segment will see a core loss for the year of between $13 million and $19 million. This is below our prior guidance due to third quarter results and our expectation that the fourth quarter will reflect the continued impact of inflation as well as the normal seasonal pattern, where Q4 can be our highest auto loss ratio quarter. Our cat loss expectation for the fourth quarter is unchanged at $5 million, our 10-year average for the period. And two, we now expect the Supplemental and Group Benefits segment will see core earnings between $55 million and $58 million. On one hand, itâ\u0080\u0099s certainly disappointing to see external impacts interrupting our trajectory toward our long-term performance objectives. On the other hand, this year is clearly demonstrating the value of the earnings diversification that the new work site focused businesses bring. Letâ\u0080\u0099s look at the results and outlook for each segment, starting with P&C, where the segment core loss was $2.5 million. Net investment income for the segment continues to reflect lower returns on the limited partnership portfolio, largely due to the equity market volatility. The $14.6 million of cat losses were in line with our historical average, although auto losses were a larger portion of the total than we might have expected due to Hurricane Ian. Total written premiums were up a bit more this quarter than they were last quarter, and weâ\u0080\u0099re certainly going to see that rate of increase continue to accelerate. The year-over-year increase in average written premiums for auto policies improved sequentially to 4.4% from 1.6% in the second quarter, while the increase in average written premiums for property policies improved to 9.2% from 7.5%. Turning to third quarter underwriting results, excluding catastrophe, first auto, where the underlying loss ratio rose to 78.4% from 76.9% in the second quarter and 70.6% in last yearâ\u0080\u0099s third quarter. Although frequency continues to trend back up toward prepandemic levels as mile driven continues to increase, higher severity is the primary driver of the increase in loss costs. This reflects the challenges being faced by the entire industry, including the unprecedented level of inflation that is driving higher replacement costs, the trend towards more severe accidents and increased utilization and cost of medical treatments. In the third quarter, we also continued our longstanding approach of a prompt response to trends that have an impact on open claims from prior periods with reserve strengthening, adding $2 million pretax to auto reserves. In property, the third quarter underlying loss ratio rose to 53.3% from 43.5% last year. The nine-month underlying loss ratio was up only slightly over last year, largely due to higher severity. Turning to Life and Retirement, core earnings were down 33.5%, in line with expectations we discussed last quarter. Similar to P&C, this segment is feeling the impact of lower returns in our limited partnership portfolio and other effects of equity market volatility. We continue to expect the full year spread will be below the 2021 level of 290 bps, but still comfortably above our threshold to achieve a double-digit ROE in this business. Mortality costs for the quarter were above last year, but are down year-to-date and remain in line with actuarial expectations. Net annuity contract deposits increased sequentially, and we had another strong quarter for Retirement Advantage, the fee-based mutual fund platform that we believe creates long-term opportunity for this business segment. Youâ\u0080\u0099ll recall that Madison Nationalâ\u0080\u0099s results were added effective January 1 of this year, which makes some of the comparisons to 2021 performance less useful. For the full segment, third quarter premiums and contract charges earned were $68.3 million, of which Madison Nationalâ\u0080\u0099s employersponsored products represented $38 million. Seasonality also affected the level of benefits and expenses, which were $19 million in the third quarter, down from $27 million in the second quarter and $35 million in the first quarter. But in addition to seasonality, we benefited by about $1 million from a couple of minor adjustments, for example, updating social security offsets and disability reserves. Looking at the performance of our consolidated portfolio, net investment income was down slightly, largely due to the 3% annualized return on limited partnerships in the quarter. On a year-to-date basis, LP returns are now slightly below our historical average, which is in the range of 8%. Combined with this quarterâ\u0080\u0099s underperformance, this is the primary reason we slightly lowered guidance for net investment income on the managed portfolio to $295 million to $305 million. The new money rate on fixed income investments has continued to exceed portfolio yields this year, although our investing activity for portions of the summer was somewhat limited by the outsized P&C claim activity plus opportunistic share repurchases. As we mentioned in the earnings release, we are incurring modest realized losses in the quarter, primarily due to portfolio repositioning to improve book yield. Due to the significant rise in interest rates, unrealized losses on the portfolio have risen to $632 million. In closing, inflation, financial market volatility and severe weather are clearly making this a challenging year. Our long-term objectives remain the same: first, sustained double-digit ROEs and second 10% average annual EPS growth. Our Life and Retirement and supplemental and Group Benefits segments are a stable source of earnings, which mitigates the occasional volatility of P&C. This, in turn, creates a stable source of capital, which in a more typical year means we would generate at least $50 million in excess capital above what we pay in shareholder dividends. While our priority is and will continue to be growth, we are committed to using available excess capital for steady shareholder dividend increases and opportunistic share repurchases. In 2023, our diversified business model will be key in getting us quickly back on our trajectory towards those objectives focused on providing strong returns to shareholders. But is this claims that were dormant, say, during the pandemic and, our revived and now look worse than they did before or is there something more recent where youâ\u0080\u0099re getting just worse hits and more severe accidents, more attorney representation, those kinds of things. And before I hand it over to Mark to answer your specific auto question, I do think itâ\u0080\u0099s important to put this whole auto question in perspective. We also have the benefit of our exclusive agents, which I think give us a lot more control in the P&C space, more than the broader IA distribution channel, if you will. And itâ\u0080\u0099s important to remember, when we make choices, we can leverage the third-party distribution that weâ\u0080\u0099ve built over a long time where itâ\u0080\u0099s appropriate and where itâ\u0080\u0099s available. Our strategy, the way weâ\u0080\u0099ve always talked about it to offer a fair price over the â\u0080\u0093 life cycle really has weâ\u0080\u0099re sticky. We donâ\u0080\u0099t play a market share game where we ramp rates down to drive market share and then ramp them back up and hope that, that retention will hold. I think before I get to the specific question, I would like to spend a few minutes just kind of unpacking the overall view of where we are in auto and how weâ\u0080\u0099re reacting to what weâ\u0080\u0099ve been seeing. I think as weâ\u0080\u0099ve come out of the pandemic, we in the industry are experiencing as both Marita and Bret said, unprecedented inflationary changes. All we can do is evaluate the experience, react with adjustments to our rate and non-rate actions and do the best we can to predict how we think the trends will continue to emerge. I think when we look at this quarter, itâ\u0080\u0099s no different. We continue to see the rising repair and replacement costs, increased number and the cost of medical treatments and certainly, I think, some reemerging social inflation issues with court starting to open back up. And we expect these loss trends that continue to exceed our long-term averages, both in the fourth quarter and I think throughout 2023. To that end, as we mentioned, weâ\u0080\u0099re adjusting our rate plans to be more aggressive both in the size and the timing of rate changes in the fourth quarter and through 2023. In Q4, we are actually expecting to increase rates in 16 states, representing 48% of our business by an average of about 7% to 8%. And in Q1 2023, weâ\u0080\u0099re planning increases in 22 states, representing 41% of our business with an average increase of nearly 10%. So as the trends have continued to emerge, weâ\u0080\u0099re reevaluating and I expect, given the continued elevated inflationary impact that in many of those places will take â\u0080\u0093 look to take additional rate in the second half of 2023. So in aggregate, we expect auto rate increases will total approximately 20% over the seven quarters ending through the fourth quarter of 2023. In addition to these rate actions, we have continued to make certain that our â\u0080\u0093 both our new business and renewal underwriting remains appropriately tight. We think with these actions, we expect that weâ\u0080\u0099ll be rate adequate in nearly all states by the end of 2023. Because of the position that weâ\u0080\u0099re in, and nearly all states being rate adequate by the end of the year, weâ\u0080\u0099re comfortable growing new business because we know that even in places we may not be rate adequate yet, we see the line of sight to getting there. Lastly, Iâ\u0080\u0099d say if the trends emerge differently than we think, then weâ\u0080\u0099ll evaluate where we act and weâ\u0080\u0099ll make changes. Getting back to your specific question Gary, on kind of the changes that weâ\u0080\u0099re seeing from an inflationary standpoint, I think as things were kind of quiet during the pandemic, some of what we had seen coming into the pandemic with some of the social inflation, cost of medical, medical treatments that slowed down. And I think as things had opened back up, weâ\u0080\u0099ve clearly seen, as I pointed out earlier, the cost of some of these medical treatments going up, the number of medical treatments happening. I think when we look at our overall loss costs for Q3 weâ\u0080\u0099re kind of mid-single digits over where we were for Q3, 2021. The frequency has been actually running lower throughout the year, probably a little bit lower in the first half, and itâ\u0080\u0099s crept up a little bit in the third quarter. So when we look at that, weâ\u0080\u0099re probably seeing overall severity inflation kind of in the high single-digits when compared to Q3 of 2021. When I look at industry data, and actually, just if I didnâ\u0080\u0099t know anything else other than thinking that the economy is opening up a little bit more people are driving at least 2022 versus 2021, I might expect frequency to go up. No, I donâ\u0080\u0099t think I have a lot of specific color, I mean I think the one thing that is a challenge when you look at our book is obviously because we are educator dominant, the patterns can be different especially when you look at where people are returning to school, are they returning to school. Quite frankly itâ\u0080\u0099s I think been a little bit of a surprise for us this year that we did see that kind of return earlier in the year where frequency was actually a little bit lower than last year, maybe that could be somewhat gas price related. I mean, itâ\u0080\u0099s still a thought â\u0080\u0093 a part of our thought process, but we think about this holistically as part of the holistic capital management process and strategy, as weâ\u0080\u0099ve talked about before. We generate more excess capital than we did before, and that is first and foremost for profitable growth and also our strong increasing dividend position that weâ\u0080\u0099ve had for a very long period of time. John, obviously itâ\u0080\u0099s a balancing act based on results, based on where the stock is trading, and I think through the third quarter. I think weâ\u0080\u0099ve shown that when there were opportunistic buying opportunities, we certainly did that within the quarter. I think we bought back about 300,000 shares, which brought the total year to $24 million of share repurchases. So obviously with results certainly below where we had originally had planned them for, the excess capital is not where we would like it to be, but as we indicated when we get those lines performing at their targeted returns, we will generate that $50 million level of excess capital after dividends. And then â\u0080\u0093 the volatility of the business this year, but maybe on the Supplemental Group Benefits business, strong results guidance went higher. Yes, John, this is Bret. Let me take this and Matt may want to chime in here as well but obviously, from both a sales and benefits ratio perspective there is seasonality in this segment more so than our other segments, I mean the other segments do have seasonality, but obviously, with this being a new segment to the Horace Mann Family, weâ\u0080\u0099re still learning but if you look at I would say the sales for the year as it relates to kind of the Madison National Group benefits piece. Those have been steady all year long, as well as the seasonality, weâ\u0080\u0099ve seen has come through in the benefits ratio. Iâ\u0080\u0099ve got them right here in front of me, but the first quarter was 66%, the second quarter was 43%, and as you saw we had a very favorable third quarter which tends to be a better quarter for their business, but I would have you probably focus more on the year-to-date benefit ratio of 45%. And I think it was either covered in my prepared remarks or Maritaâ\u0080\u0099s, we would target long-term of about 50%. Yes, I think thatâ\u0080\u0099s right, but while weâ\u0080\u0099re on the Supplemental and Group Benefits subject we couldnâ\u0080\u0099t be more pleased with where we are. So it may be a little bit of a marketing spend but whether an educator buys their products individually or gets them from their school district, weâ\u0080\u0099ve got them covered and that certainly is playing out broadening our reach within this educator segment that weâ\u0080\u0099re in and there is no doubt, and I think this quarter is a good example of that. I couldnâ\u0080\u0099t be more optimistic about the sales momentum and youâ\u0080\u0099re seeing that coming back in as weâ\u0080\u0099re back in the schools face-to-face, and I think weâ\u0080\u0099re just scratching the surface. And then lastly on the premium persistency, it relates to maybe inflation done in this are we seeing persistency declines  as well. Thank you very much. I donâ\u0080\u0099t know that we can draw a direct connection between inflation and the premium persistency number more so as an increase in the overall business that weâ\u0080\u0099re bringing in into supplemental as â\u0080\u0093 we start to add new business, the new business has a different persistency metric as the business season. Yes, John, this is Bret. Thank you very much. Yes, John and I think itâ\u0080\u0099s another place when you look at the rest of the market. And just to put things in perspective, I believe our unrealized capital loss position at 930, is more in the range of I think about $450 million unrealized loss versus a year ago. We were basically, I think around about a $350 million gain. So the delta between the periods is pretty large, and I think youâ\u0080\u0099re seeing that mentioned really throughout a lot of the earnings releases. Yes Matt, specifically to your question on duration, weâ\u0080\u0099re at about 6.5 year duration thatâ\u0080\u0099s down about a quarter of the year. Tactically down as I look back a year ago, but you need to remember itâ\u0080\u0099s a liability driven investment strategy. So we are, we have liability, we have target liability durations that are in bands that give us a little bit of flexibility and weâ\u0080\u0099re moving towards the lower end of those targeted bands and have been over the last year. You see the mark-to-market, if you will on the asset side go through unrealized gain loss through AOCI and impact that total reported book value number, but you donâ\u0080\u0099t see the same on the liability side. And because I donâ\u0080\u0099t expect to realize many of those unrealized losses, we have a stable highly liquid portfolio and we have good ongoing new business cash flow. And then the second one if I could Marita just maybe kind of the forest from the trees sort of question, we sit here for several quarters now, youâ\u0080\u0099ve had all your puzzle pieces in place schools are back open, so, youâ\u0080\u0099ve been able to kind of go through your kind of that cycle. When we talked about our PDI strategy building the products, that, are relevant in this educator space expanding our distribution and our reach, not only to individual educators but in the school districts, as well, as well as funding for modernizing our infrastructure. Iâ\u0080\u0099m very excited about the momentum in the business, we had our first in-person EA meeting with our exclusive agency plant in a long time to kick off our back-to-school and our year, and the interest, the enthusiasm, the energy, you could just feel it and we see it in the numbers. We put the information in the script, so folks could see how much more weâ\u0080\u0099re doing in the schools and the really good news is everything they learned over a very strange two years has a multiplicative effect on the reach they have and the things that they learn. Our recruiting numbers are up, whether itâ\u0080\u0099s benefits consultants on the Supplemental and Group Benefits side or itâ\u0080\u0099s EAâ\u0080\u0099s on the retail side, weâ\u0080\u0099re seeing a lot of interest in joining Horace Mann, some of that we know is our market niche and folks wanting to be a part of that mission of serving educators, but you can feel the energy in the place and weâ\u0080\u0099re very optimistic about being back doing things, the way we do it. So Iâ\u0080\u0099m very bullish and very excited that all the moves we made were the right moves and pricing in a short tail auto line is something we know, we understand and weâ\u0080\u0099ve put the pieces in place to rectify it. I mean, I think itâ\u0080\u0099s important to go back and look at our retention characteristics as a company which tend to be quite strong and quite frankly have been increasing this year and holding even with the rate increases. Yes, I think Marita makes a good point on the elasticity side and the impact of retention. Clearly, weâ\u0080\u0099ve seen our retention come up, considerably over the last couple of years as weâ\u0080\u0099ve been in a stable rate environment. And in a normal world when you were pushing as much as 20 points of rate over a seven-quarter period time, youâ\u0080\u0099d expect to take some hit to retention. Iâ\u0080\u0099d say that there is two things going on right now, that one obviously the market is moving generally in sync so that as customers go out and shop they may not find greener pastures at lower rates in some, place else. But it is likely to be less than we have seen traditionally given the size of the rate increases that weâ\u0080\u0099re going to have and, therefore, I expected yield, most of the rate that weâ\u0080\u0099re pushing through the book, especially, given that itâ\u0080\u0099s more across the board as opposed to a small set of customers getting very large increases and a number of customers getting smaller. I guess now that we have a better sense of what reinsurance rates will look like, and now that weâ\u0080\u0099ve also gone through and event with maybe some unusual characteristics like the significant flooding that we felt with Hurricane Ian. Certainly, a lot of things you read as Ian the straw that broke the camelâ\u0080\u0099s back probably, but weâ\u0080\u0099re obviously still in the process of negotiating. As we do at this time every year, itâ\u0080\u0099s too early to pin down what our rate increases would be. However, I would say that we have fared even over the past few years better than most just because weâ\u0080\u0099re really not costing the reinsurers anything with not hitting the layers on a frequent basis and I think we brought this up when it happened. And we didnâ\u0080\u0099t sell out the several rights, but I think last year itâ\u0080\u0099s old news, I think most were anticipating a 10% rate increases and ours was south of that. So I know, I didnâ\u0080\u0099t tell you exactly what we think our rate increases were going to be. Yes and historically as Bret said our reinsurance pricing tends to be better than the market, just because of our experience and our profitability in the line. I mean we â\u0080\u0093 did still have some auto exposure in Florida, we did experience some losses, but I think â\u0080\u0093 Ian as a whole for us on a direct basis is a relatively benign event. But now you have hundreds of thousands of autos, that where people are going to be out seeking new cars and thatâ\u0080\u0099s just going to put more pressure, I think in the short-term on some of the potentially used car pricing. Every year we look at alternative structures for reinsurance and for the most part, weâ\u0080\u0099ve said this before, but for the most part, the reinsurers are really good at pricing those alternative structures. So if you donâ\u0080\u0099t need them, and youâ\u0080\u0099re not looking for balance sheet smoothing, if you will they tend to not make sense over the long haul, and with our property business. Obviously, with each year of increasing volatility that changes a bit, and with each year we look at those structures, we price those structures, we make sure that we have the right reinsurance program in place and donâ\u0080\u0099t have any immediate plans to change that. Yes, I would say in those alternatives that are out there, the price of that poker certainly has gone up a lot as we come into the new renewal season versus our traditional cat coverage that we have. Thank you very much."
}