{
    "symbol": "CPS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 22:35:29",
    "content": " Excluding this gain, restructuring expenses and other special items, as well as their associated income tax impact, adjusted net loss for the second quarter of 2022 was $58.5 million or $3.40 per diluted share compared to an adjusted net loss of $51.1 million or $3 per diluted share in the second quarter of 2021. On the top line favorable volume and mix, net of customer price adjustments increased sales by $102 million versus the second quarter of 2021. Sales were slightly better versus the first half of last year with improvements in volume, mix and net price adjustments being mostly offset by the impacts of the deconsolidation of an Asian joint venture last quarter and unfavorable foreign exchange. In terms of cash flows, cash provided by operations during the three months ended June 30, 2022 was an inflow of approximately $12 million, driven primarily by the $51 million of tax refunds received in the quarter and to a lesser extent, the positive contribution from lower inventories. In terms of our 2022 guidance, we are reaffirming our full year estimate for adjusted EBITDA in the range of $50 million to $60 million as we leverage better than expected operating efficiencies and material cost recoveries across improving production volumes in the second half of the year. As I said a few quarters ago, with our newly streamlined cost structure and customer commitments to pay their fair share of materials, I believe we are back on track to achieve our strategic targets for adjusted EBITDA margin and return on invested capital as industry production volumes normalize over the next few years. So, we don't see that as a big component of the EBITDA for the second half of the year rather it's the buckets we've already been talking about higher commodity inflation, further exacerbating things by an incremental $40 million more in the second half of the year than we've already incurred this year or in the first half of the year and then the ongoing other inflationary pressures. You saw in the first half of this year, we're able to unlock or consider amount of capital with call it a non-strategic site in Europe and almost $50 million U.S. of proceeds related to that sale-leaseback transaction. So if that's your question, I think more positively the outlook we have in the second half in Europe and in fact in the fourth quarter, I can tell you that the outlook we haven't seen volume like that in years."
}