{
    "symbol": "RGP",
    "quarter": 1,
    "year": 2022,
    "date": "2021-10-06 20:04:04",
    "content": " Revenue was the highest achieved in over ten years during the fiscal first quarter, and at one hundred and eighty three point one million dollars exceeded our guidance and represented twenty five percent growth year-over-year. Enterprise revenue increased by twenty five percent over the prior year quarter and eight point five percent sequentially, while top of the funnel activity was strong, leading to increases in qualified opportunity and ultimately to the highest level of closed deals since twenty nineteen. Furthermore, we remain disciplined in SG&A spend, increasing leverage significantly and enabling us to deliver twenty two point four million dollars of adjusted EBITDA or a twelve point two percent adjusted EBITDA margin, which is also the highest margin in any first quarter last decade. After adjusting for business day and currency impact, Q1 revenue represents growth of twenty five percent year-over-year and five percent and two percent over the pre-pandemic first quarter periods of fiscal twenty twenty and twenty nineteen, respectively. 21:01 Emerging from our restructuring initiatives and positions with a more nimble cost structure, run rate SG&A expenses for the quarter were forty nine point four million dollars after excluding non-cash stock compensation, contingent consideration expense and restructuring charges, representing twenty seven percent of revenue, a five seventy basis point improvement compared to the same period a year ago. 26:12 And then it sounds like across North America, you ended up seeing really strong growth, particularly strong growth in the tri-state area over forty percent, to what extent do you think it's being driven in part by increased deal flow deal activity, whether it's IPOs specs or private equity transactions. I think broadly we are seeing some tailwind from the transaction deal flow, particularly related to M&A and some spec stuff, we saw probably more spec activity in the end of the fourth quarter in the early part of the summer and then it's sort of tailed off a little bit, but that doesn't mean that the transactions themselves, I mean, there's all kinds of things going on. Tri-state has participated in that a fair amount as well, but I think a lot of it kind of comes down to sort of the work that's been done over the last three or four quarters, we have a new leader in place and a new team and they have been doing a lot of work relative to penetration generally back into the financial services market and to diversify outside of it. So what we're really focusing on are the new engagements and also winding back any pricing arrangements that we had put in place for COVID, but we -- I think I've said for a long time, we -- it's an opportunity for us, we need the price to market more and when you think about tight labor market, it's -- this is the right time for us to be able to push through some of those increases and we're doing that proactively. You might paying normalized standard deviation up over we see some flex around that through the year is what -- what I would say is, what we've seen over the last three quarters, is that our overall attrition rate of decline, usually that happens in the first year that somebody joins our joined our company that kind of really feeling out what the model is about and if they like the culture and the things that we provide for them from an experience perspective. And at that conference they shared a McKinsey report that’s just been published that surveyed employment working models pre-COVID and desired working models, post- COVID and what they published is that there's been twenty five percentage point move from away from on-site works and a twenty two percent growth in hybrid."
}