{
    "symbol": "GNE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 11:49:10",
    "content": " With me today are Michael Stein, Genie Energyâ\u0080\u0099s CEO; and Avi Goldin, Genie Energyâ\u0080\u0099s CFO, who will discuss operational and financial results for the 3 months period ended June 30, 2022. Any forward-looking statements made during this conference call, either in the prepared remarks or in the Q&A session, whether general or specific in nature, are subject to risks and uncertainties that may cause actual results to differ materially from those which the company anticipates. Our earnings release includes a reconciliation of consolidated adjusted EBITDA to its nearest comparable GAAP measures, consolidated net income and income from operations for all periods presented. In addition, adjusted EBITDA for applicable segments are reconciled in the earnings release to their respective segmentâ\u0080\u0099s income from operations for all periods presented. Today, I will provide some color on our second quarter results and then discuss our strategy moving forward. Despite this, we recorded record profitability in both income from operations and adjusted EBITDA easily the most profitable second quarter in our history. As I have mentioned in recent quarters, we adapted to the current period of high energy prices to optimize our portfolio of businesses, while deliberately reducing our customer acquisition efforts to preserve margins. This strategy, combined with the work of our excellent risk management team, positioned us to generate the record profits we have delivered so far this year. Looking at our segments, Genie Retail Energy, or GRE, generated record Q2 gross profit of $29 million and adjusted EBITDA of nearly $15 million. This strong performance was driven by our careful forward commodity hedging and customer acquisition strategies, which position us well in this volatile market. Genie Retail Energy International, or GREI, also reported strong results. The revenue increase was generated primarily by our CityCom Solar subsidiary, which provides customer acquisition, billing and management services for third-party community solar developers. Finally, we opportunistically repurchased 639,000 shares of common stock and redeemed $2 million in par value of preferred stock. This, combined with our regular $0.075 quarterly common dividend and the base dividend on the outstanding preferred stock, totaled nearly $9 million in capital returned to shareholders during the quarter. In anticipation or response to evolving market conditions, we invest in customer acquisition and growth during some periods, while doing others such as the most recent three quarters when we have seen rapidly rising energy market pricing, we reduced our growth investment or take other steps to manage our obligations to customers to drive higher margins. Underlying our strategy is our risk and mitigation team, which, among other things, hedges our forward obligation and as I mentioned earlier, works to allow us to preserve margins during times of price volatility. In the U.S., our REPs operate in 16 of 20 deregulated states as well as Washington, D.C. GREâ\u0080\u0099s asset-light model has proven to be remarkably flexible and resilient, generating positive cash flow across a wide range of challenging market conditions, including the current period of extraordinary energy price volatility. While our customer base management strategy has led to throttle back our customer acquisition engine at present and even selectively trim our customer base, our mid to long-term strategy is to grow, but to do so opportunistically when market conditions warrant. Our customer expansion programs include increasing our market share in existing territories, expanding into new areas and offering additional products and services to our installed base. This segment consists of Genie Solar, which markets a full suite of solar procurement and installation services; CityCom Solar, which as I mentioned earlier, provides customer acquisition, billing and management services for third-party community solar developers; and Diversegy, a full service energy broker. In recent quarters, I have mentioned that our solar strategy includes creating value with robust returns by putting our strong balance sheet to work. I am excited to say that over the past few weeks, we took a major step forward on this path with the formation of Sunlight Energy Investments an investment vehicle structure to generate stable, predictable returns for participants through ownership of Genie Renewables originated commercial, community and utility-scale of generation projects and also projects developed by third-parties. Genie will serve as Sunlightâ\u0080\u0099s general partner, but we expect to source most of the capital from outside investors, who will participate individual projects as limited partners. We believe that Sunlight will provide attractive financial returns for Genie and outsized investors will increase the win rate on new projects, creating significant value for Genie over the medium to long-term. In our international business, as I mentioned earlier, the second quarter results benefited from very significant mark-to-market gains on our forward electricity hedges. Given the continued volatility in overall global economic and geopolitical risks, we are now taking steps to optimize this position and reduce our forward obligations in the market, starting with the sale of our Swedish book. Looking to the remainder of the year, at GRE, we currently expect adjusted EBITDA to remain strong and to exceed historical seasonal averages. In summary, we had record bottom line results during the first half of the year and we expect to continue to generate strong year-over-year consolidated adjusted EBITDA expansion in the second half. Throughout my remarks, I will compare the second quarter of 2022 results to the second quarter of 2021, focusing on the year-over-year rather than a sequential comparison to move seasonal factors characteristic of our retail energy businesses. The second quarter is typically characterized by reduced levels of per meter electricity and gas consumption compared to the peak heating and cooling seasons of the first and third quarters, respectively. Overall, Genie Energy had a very strong second quarter, achieving record profitability driven by strong performance in our domestic retail business as well as gains due to the mark-to-market increase of our international forward hedges. As Michael noted, we also continued to return capital to our shareholders through our dividends and acquisition of both our common and preferred stock. This decrease was from GRE where sales fell 5.7% to $63.2 million, reflecting reduced electricity sales due to lower meter counts partially offset by higher electricity rates and increased gas sales. Not only have gas prices risen substantially over the past year, but we are selling more gas after entering new gas-only markets during the last four quarters in a relatively high average consumption gas meters, thus boosting average gas consumption per meter. Electricity consumption per meter, which began to significantly decline last quarter as more workers return to the office, declined slightly compared to the year ago period in the second quarter. Revenue at GREI climbed 14.6% year-over-year to $8.1 million as electricity prices increased, which more than offset consumption declines resulting from fewer meters served. Results this quarter were driven by growth within the CityCom Solar business, which leverages our sales and marketing expertise to acquire and manage customers for community solar programs. Gross profit at Genie Renewables was $817,000 compared to $922,000 a year ago. Consolidated SG&A expense, including corporate overhead, increased to $19 million from $16.7 million a year earlier, reflecting a modest increase in GREâ\u0080\u0099s customer acquisition spend and general overhead. At GRE, income from operations was $14.4 million compared to $5.4 million a year ago on the strength of our increased gross profit. GREI delivered $36.4 million in income from operations compared to $144,000 in the year ago quarter. Genie Renewables posted a loss from operations of $519,000 compared to income from operations of $334,000 as we continue to invest in our solar businesses. Through the first two quarters of the year, we have generated $74.8 million in adjusted EBITDA. Net income attributable to Genie Energy increased to $34.5 million compared to $5.4 million in the second quarter of 2021, and earnings per diluted share in the second quarter increased to $1.30 from $0.19 in the year ago quarter. On June 30, cash, restricted cash and marketable equity securities totaled $67.2 million or $2.58 per diluted share. During the quarter, we repurchased 639,000 shares of our Class B common stock for $4.4 million at an average purchase price of $6.90 per share. At GRE, the second half outlook is strong, although we expect the year-over-year gains will be more modest than what we achieved in the first half of the year. Given the current electricity pricing environment in Europe, we have taken initial steps and are exploring additional options to reduce GREIâ\u0080\u0099s forward obligations and optimize our position. Finally, we are very excited about the range and depth of opportunities for Genie in the solar generation and related businesses. I had some questions last quarter, but I guess there were some problems with you being able to press the button right or something going wrong. As you know, weâ\u0080\u0099re also buying â\u0080\u0093 weâ\u0080\u0099ve been buying back the preferred and attempt to give some money back to shareholders. No one here has done them, but maybe we should, about what â\u0080\u0093 where the stock would have to be for Genie to get back into the Russell 3000 and then being the Russell 2000 indices. Iâ\u0080\u0099m wondering if you can lay out exactly right now which markets youâ\u0080\u0099re operating in Europe and in particular, and in â\u0080\u0093 outside the U.S. in general? Instead what weâ\u0080\u0099re doing is essentially profit taking on the value of the hedge book that we had built up for those customers, and the value of the hedge book is well in excess of what we felt the value of the customers are and would be. And since we sold the customers, there is nothing precluding us from going back into that market whenever we please. So a little bit of a complicated answer there, I would say we are still potentially in that market, even though, as of the moment, weâ\u0080\u0099re not serving customers actively there. And ideally, weâ\u0080\u0099re looking to do it in a way there as well that would allow us to continue marketing at some point in the future if thatâ\u0080\u0099s something we deem is in the best interest strategically of the company. The first thing is just on â\u0080\u0093 I am trying to understand the balance sheet and the cash flow statement, because the cash went down pretty significantly year-over-year, quarter-to-quarter. So, over the course of the past, I would say, a little bit over a year, we have been looking to optimize our position in the UK market, specifically exiting that market. And in the tail end of the year of 2021, there was a series of transactions that moved some cash to the U.S. that we, over the course of the first half of the year, moved back into the UK pending that resolution. And because that entity is currently in the hands of the administrators that are working through a process there, itâ\u0080\u0099s not on our balance sheet, and it all flows through as within that discontinued operations line on the balance sheet. And so I would say that the â\u0080\u0093 we certainly expect in the next few quarters in the short-term for very strong financial results, given the market and given kind of the portfolio moves that we have made, I mean do with the customers in our hedge book. If you asked us a year ago could we see these kinds of returns, we would not confidently say yes. But no question about it, to build the book back up again, we would have to spend marketing dollars. How that â\u0080\u0093 that obviously doesnâ\u0080\u0099t affect or touch the question of what kind of gross profits we can generate, itâ\u0080\u0099s really the marketing line item, which figure over the course of the year. If we went back to marketing at full strength, over the course of the full year, would probably be another $5 million, $6 million worth of costs. And then just in terms of the growth question with regards to the solar energy, I am trying to understand, you have a lot of different subsidiaries now you started new subsidiaries of financing, which I think is a great direction to go into. But what we like about the structure is it gives us a little bit of flexibility in terms of how much we decide to put in versus how much we decide to collect from LPs essentially determining exactly the question or the answer to the question that you are asking, which is how much would Genie benefit specifically from the financing piece versus how much it might benefit from the development of the building of the business and selling the off-take to customers, which are obviously also line items that the Genie family of companies will be benefiting from. So, they are â\u0080\u0093 in the GP-LP structure, yes, I mean you are essentially you own an asset and then you have expenses related to the upkeep of the solar array, which I mean there is small amounts of money thatâ\u0080\u0099s related to the operation and maintenance of those facilities and then whatever debt service you might have associated with building the project in the first place. And then from there, yes, you have a net income thatâ\u0080\u0099s â\u0080\u0093 that gets distributed to the LPs and which like I said, will include Genie. And then, of course, the GP generates dividends or generate sorry, management fees and incentive fees associated with what itâ\u0080\u0099s able to generate in returns to its limited partners. I will say that we are seeing small incremental progress towards the resolution, which might ultimately come in some stages, certain funds coming back and then others being held for some period of time."
}