{
    "symbol": "GLRE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 10:23:08",
    "content": "  Operator: Thank you for joining the Greenlight Capital Re Limited Fourth Quarter and Year-End December 31, 2022, Earnings Conference Call. Joining us on the call today will be Chief Executive Officer, Simon Burton; Chairman of the Board, David Einhorn; and Chief Financial Officer, Neil Greenspan. On behalf of the company, I'd like to remind you that forward-looking statements may be made during this call and are intended to be covered by the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not statements of historical fact, but rather reflect the company's current expectations, estimates and predictions about future results and are subject to risks and uncertainties. A if one or more risks or uncertainties materialize or if the company's underlying assumptions prove to be inaccurate, actual results could vary materially. The reconciliations to these measures as well as the risk factors can be found in the company's filings with the Securities and Exchange Commission, including Form 10-K for year ended December 31, 2022. The reinsurance industry experienced a significant capital void resulting in a market that struggled to clear the demand for risk in classes that were impacted by losses in 2022 such as property catastrophe, aviation, war on terror and marine. In these classes, we commonly saw placements close at 25% rate increases or better whereas in property catastrophe, the rates were generally up by 50%. In our view, the subjectively good but unlucky 2022 market for short-tail specialty and catastrophe business is now an objectively good market in 2023. Overall, I'm very pleased with the quality of the business that we wrote at January 1, and I believe the outlook for our underwriting business over the next year or 2 is excellent. In 2022, when most of our peers saw a decline in this metric, I am pleased to report that our fully diluted book value per share increased during the fourth quarter by 7.7% and by 4.3% for the year. While the underwriting combined ratio of 102.3% for the year was broadly in line with our peer group, it was significantly behind our expectations going into 2022. First, we experienced catastrophic losses mainly from the Ukraine war and Hurricane Ian, that were in total well beyond an average year, contributing 8.4 percentage points to our combined ratio. Secondly, revisions to our estimates of reinsurance and deposit accounted losses incurred in prior years increased our combined ratio by 3.9 points. Long positions in Twitter and Green Brick in an undisclosed short position were the largest positive contributors to the quarterly results, a basket of housing sector short positions, hedging some of our Green Brick Partners exposure and our high-yield index credit default swaps were the material detractors. In recent years, the company has grown and transitioned its business mix toward its higher-margin ambulatory centers. The company announced a sizable buyback of its shares, which we expect will shrink the share count by about 20% by the end of 2024. The Solasglas fund had an excellent 2022, returning 25.3% compared to a decline of 18.1% for the S&P 500. Short-term rates remain below the rate of inflation, and we believe that the ability to now earn about 4% on cash in the bank to be a significant income boost to the household sector, which has $17 trillion in short-term interest rate sensitive assets compared to only $5 trillion in variable liabilities. I'd like to thank, also, Neil Greenspan for his service to the company over the last 5 years. For the year ended December 31, 2022, our net income was $25.3 million or $0.73 per diluted share. Although the company benefited from $1.4 million of favorable loss development during Q4, on a net financial impact basis, the company experienced roughly $3.2 million of adverse prior year development. By comparison, the fourth quarter of 2021 reported net underwriting income of $4.8 million. Gross premiums written in the fourth quarter of 2022 were $127.4 million, an increase of 2% from the fourth quarter of 2021. This increase was due to growth in personal property, general liability and other specialty business, including premiums underwritten by our innovations partners. We earned $30.4 million from our investment in the Solasglas fund and recognized an additional $2.2 million of other investment income, primarily from interest income earned on our restricted cash. Total general and administrative expenses incurred during the quarter were $8.9 million, up from $8.0 million in the fourth quarter of 2021. At the end of the fourth quarter, our fully diluted book value per share was $14.59, an increase of 7.7% from September 30."
}