{
    "symbol": "GLRE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 18:03:05",
    "content": " Forward-looking statements are not statements of historical fact, but rather reflect the Company's current expectations, estimates and predictions about future results and events are subject to risks, uncertainties and assumptions including those enumerated in the Company's Form 10-K for the year ended December 31, 2021, Form 10-Q for the three months ended March 31, 2022, and other documents filed by the Company with the SEC. Good morning, and thank you for joining us today to discuss our third quarter results. Our key performance metric is change in book value per share, which decreased during the third quarter by 3.9%. On the other side of the industry balance sheet, the rapid increase in bond yields has for the second successive quarter, hit those with fixed income investment strategies very hard. Relative to the reinsurance industry as a whole, our investment strategy is working well, and has allowed us a level of capital preservation on available to more traditional reinsurance balance sheets with significant fixed income exposure. The industry has since seen an unusual confluence of events through the year, the Ukraine-Russia war, a series of natural catastrophes including Hurricane Ian, claim inflation and investment losses from multiple sources. So from a sentiment perspective, it's clear that reinsurers are determined to achieve better pricing and terms across a range of short-tail specialty classes led by property catastrophe to achieve some level of payback following several years of underperformance. In previous market cycles, we have seen inflows of fresh reinsurance capital at times like these, but investors seem skeptical and fatigue by a pattern of weak performance and trapped capital particularly in the catastrophe  funds. Finbar Griffin, who was appointed Chief Underwriting Officer of Greenlight Reinsurance Ireland; Regal Cairns was appointed Chief Underwriting Officer of our Cayman subsidiary, Greenlight Reinsurance Ltd.; and Kagabo Ngiruwonsanga is now Head of Innovations Underwriting. Looking ahead, the combination of an improved insurance operating environment for everybody, including tech-enabled startups and the reemergence of the buyer's market and early-stage investments has made our overall innovation thesis even stronger. For the year-to-date, about 12% of our total net written premium is derived from our Innovations business and the pipeline of attractive opportunities continues to grow. At $102.50 per share we believe the consortium is getting a great deal, but we are intent to exit our two-plus year investment for a large gain after the deal was announced. Green Brick Partners shares advanced 9% during the quarter as the Company announced its second quarter earnings of $2.08 per share, which beat the consensus estimates by nearly 70%. Nonetheless, Green Brick outperformed its peers and as a result, a short position we had in August in the basket of homebuilders to hedge housing sector risk was also positive for us during the quarter. Aside from Twitter, which we've exited into the completed deal, we didn't add any new material long positions during the quarter. Net exposure in the investment portfolio was approximately 13% at the end of the third quarter, down from 20% at the end of the second quarter. While the losses from Hurricane Ian are frustrating in light of an otherwise comps form season, we did well on a relative basis and are positioned to capitalize as the reinsurance market improves further. For the nine months ended September 30, 2022, our net loss was $9.4 million or $0.28 per share. By comparison, the equivalent period in 2021 reported an underwriting loss of $12.6 million, which included $25.9 million of catastrophe losses from Hurricane Ida, the European floods and hailstorms, and South African riots. Gross premiums written in the third quarter were $155.1 million, an increase of 21% from the third quarter of 2021. This increase was due to growth in specialty, general liability, multiline and personal property business including premium generated by the Company's Innovations partners. We earned $8.5 million from our investment in the Solasglas fund, and recognized an additional $3 million of other investment income primarily from interest earned on our restricted cash. Total general and administrative expenses incurred during the quarter were $7.4 million, up from $6.1 million in the third quarter of 2021. At the end of the third quarter, our fully diluted book value per share was $13.55, a decrease of 3.9% from June 30."
}