{
    "symbol": "XFLT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-26 16:14:04",
    "content": " And the reason for that is the goal is to enhance risk adjusted returns and the view at inception and the view today is that having a healthy mix of loans, CLO equity and CLO debt together results in an optimal composition for purposes of generating returns and also generating those monthly cash flows that we talked about. In terms of this quarter, we did see negative price and NAV returns for both XFLT and the benchmark reflecting some of the pricing changes in the quarter and if you are investors in XFLT, you appreciate that any given quarter the total returns can be driven quite a bit by the NAV's reflection of where the market values of CLO equity in particular are held in the fund. This quarter, we've obviously seen two fed rate increases and with floating rate assets, the fund invests in floating rate loans and CLO debt and CLO equity are also considered floating rate securities. CLO equity while there's no third party index that tracks that performance we believe CLO equity saw negative low to mid-single digit return in the quarter, which was driven by the price movement in loans in the quarter, which were down about a point, which in turn drives CLO equity NAVs. Even with this strong loan supply last year, the demand for loans was also quite strong as a result of new CLO creation, as well as other buyers of loans, such as retail loan mutual funds, which we're seeing strong inflows over the course of the year. And part of what I want to address here is that I think the reason Robert gets a lot of questions is, you see a lot of press and articles talking about senior loans, floating rate loans, and based on investors prior experiences in prior cycles, there's concerns about if the rate hikes actually result in increasing or higher levels of income. The expectation by the marketplace is that there will be future rate hikes and so the speed at which the rate hikes have happened and the expectation for future rate hikes, I think that's what's causing a lot of people to take a second look at floating rate investments, including senior loans but also CLO debt and CLO equity. Let's say it's a portfolio of loans where you start to add in BB CLO debt, or you add in CLO equity, you're going to be introducing risk and the trade-off is that you're potentially generating higher returns. But that's also why we have octagon at the helm managing this portfolio and what Gretchen and her team are going to do is potentially the goal is to improve upon these passive measures and as I mentioned, the mix that XFLT has was by design, that we would be able to invest in a mix of loans, CLO debt and CLO equity, because over time, and even from quarter-to-quarter, those opportunity sets change and the dynamic allows Octagon to take advantage of some of the current market opportunities. So this slide, while it doesn't list the peers, we're not really comfortable doing that, but if you take just the senior loan peer group, XFLT is going to outperform just because of what I talked about, you're introducing the risk of CLO debt and CLO equity, but the benefit is the additional return and additional income. Because XFLT invests in a healthy amount of senior loans, it is not going to have the same level of return or the same level of income as a fund that would invest in a 100% CLO equity. So just to put some numbers around that in a CLO with $500 million in loan assets, prepayments of just 10% provide a manager with $50 million of currency to then go by loan assets that say $0.95 on the dollar, which in turn generates $2.5 million in additional notional value for the fund and for the benefit of CLO equity investors. So as long as credit losses can be mitigated, a skilled manager can take advantage of periods like this to both grow the notional value of the loans in the CLO, as well as increase the income stream generated by these loans, both of which benefit CLO equity investors in the long term."
}