{
    "symbol": "CULP",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-01 13:22:06",
    "content": " Operating performance for the quarter was also affected by continued inflationary pressures, as well as reoccurring labor challenges within our mattress fabrics business and our Read Window Products business that resulted in increased employee training costs and operating inefficiencies during the quarter. The company reported a loss from operations of $4.7 million compared with income from operations of $3.3 million for the prior year period, and compared sequentially with the loss from operations of $5.4 million for the fourth quarter of last fiscal year. Our overall operating performance for the first quarter was significantly affected by lower sales, continuing inflationary pressures, and reoccurring labor challenges within our Mattress Fabrics business and our Read Windows business that resulted in increased employee training costs and operating inefficiencies during the quarter. Our cash income tax payments totaled $637,000 for the first quarter of this fiscal year and we currently expect cash income tax payments of approximately $2.8 million for the entire fiscal 2023 year. For the Mattress Fabric segment, sales for the first quarter were $29.4 million, down 31.8% compared with last year's first quarter and down 1.4% compared sequentially with last year's fourth quarter. Our operating performance for the first quarter of this year was significantly pressured by operating inefficiencies due to lower sales volume, ongoing labor challenges, including inefficiency due to hiring and training new employees and higher raw material cost among other factors. Our operating performance for the first quarter this fiscal year as compared the prior year period was pressured by lower sales, labor challenges, and inflationary pressures affecting the Read business and additional employee training costs and operating inefficiencies in the segments Haiti -- in our new Haiti cut and sew facility as it continued to scale capacity to its full plant output level. Our cash flow from operations of free cash flow during the first quarter of this fiscal year were favorably affected by working capital management including an increase in accounts payable, primarily associated with the company's operations in China as COVID-related restrictions were lifted during the quarter, reductions in inventory, and lower capital expenditures. Notably, we reduced our inventory by $2.8 million or 4.2% as compared sequentially to the fourth quarter of last fiscal year and have reduced our inventory by $9.4 million or 12.8% as compared to the peak level at the end of the third quarter of last fiscal year. Despite the headwinds in this business, Culp Home Fashions remained focused on working capital management and cash generation throughout the quarter, reducing its inventory by $2.5 million, balance in its raw materials with production needs and generating cash despite an operating loss for the quarter. Although sales for the quarter were down compared to the prior year period, sales did grow about 22.4% sequentially compared to the fourth quarter of last fiscal year, aided by the lifting of COVID shutdowns and significantly affected our China operations at the end of last fiscal year."
}