{
    "symbol": "MGNI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 19:45:11",
    "content": "  Operator: Good evening, and welcome to the Magnite First Quarter 2022 Earnings Conference Call. After today's presentation, there will be an opportunity to ask questions to ask questions. I would now like to turn the conference over to Nick Kormeluk, Head of Investor Relations. As a reminder, the comparisons you will see in the 10-Q as reported include the financial results of SpotX and SpringServe for Q1 2022, but for the periods prior to the acquisition dates, the results do not include SpotX or SpringServe, which were acquired on April 30, 2021, and July 1, 2021, respectively. When we make comments referring to pro forma comparisons, we are including SpotX and SpringServe for the relevant pre-acquisition period in order to provide a like-for-like comparison. Please keep in mind as it relates to the SpotX and SpringServe acquisitions, prior quarterly results are estimated and unaudited. Before we get started, I will remind you that our prepared remarks and answers to questions will include information that might be considered to be forward-looking statements, including, but not limited to, statements concerning our anticipated financial performance and strategic objectives, including the potential impact of macroeconomic factors on our business. They reflect our current views with respect to future events and are based on assumptions and estimates, and subject to known and unknown risks, uncertainties and other factors that may cause our actual results, performance or achievements to be materially different from expectations or results projected or implied by forward-looking statements. A discussion of these and other risks, uncertainties and assumptions is set forth in the company's periodic reports filed with the SEC, including our first quarter 2022 quarterly report on Form 10-Q and our 10-K. We undertake no obligation to update forward-looking statements or relevant risks. Our commentary today will include non-GAAP financial measures, including revenue ex-TAC or less traffic acquisition costs, adjusted EBITDA and non-GAAP income per share. At times, in response to your questions, we may offer incremental metrics to provide greater insights into the dynamics of our business. Please be advised that this additional detail may be one-time in nature, and we may or may not provide an update on the future of these metrics. I encourage you to visit our Investor Relations website to access our press release, financial highlights deck, periodic SEC reports and webcast replay of today's call to learn more about Magnite. We delivered strong Q1 results on total revenue, CTV revenue, adjusted EBITDA and free cash flow, and we're providing a positive outlook for Q2. Recently, questions have been raised about the relevance of the sell-side platform and where it might fit in a world where sellers can connect directly to buyers. And today, I'm going to go further and say that we see them as an indication that the SSP is becoming more valuable than ever and Magnite’s independent omnichannel approach positions us to lead the group long-term. To understand our perspective, I think, it's helpful to explore the evolution of Magnite and SSPs more generally. First, I'll focus on the role of the SSP and DS price, and then I'll transition to CTV. Let's start nearly 2000s when programmatic wasn't yet a saying and display publishers made most of their money selling ad inventory directly, which they book in their primary ad server, usually Google CFP. They sell everything they could direct and throw the remaining impressions known as  into the bargain bin, where dozens of ad networks stocky to get first look. So in 2007, ad network optimizers such as the Rubicon project emerged to help publishers maximize their remnant yield. In the 2010, as programmatic buying ramped up and DSPs gradually replaced ad networks, the ad network optimize retain the SSP, managing yield across all indirect sources and offering an array of additional services, such as tools for private deals, ad quality, billing and reconciliation and real-time reporting controls. In this era, most publishers partnered with one SSP, relying on them to navigate a rapidly changing space and maximize what was quickly becoming a significant portion of the revenue. In 2015, programmatic truly peaked into high gear when publishers began calling direct and programmatic demand simultaneously, known as header bidding. The practice is difficult to manual, but it finally put programmatic on a level playing field and publishers are relieving far less money on the table. In time, publishers learned that the more SSPs they called in their headers, the more money they made, which was once a valued one-on-one relationship became one of main, and the SSP was pushed away from its core yield management role and towards something closer to an ad exchange. We co-founded prebid work and open source header bidding framework, and wants Demand Manager, a suite of software that makes it easy for publishers to configure and optimize their prebid heaters. As header bidding expanded and even as buyers dramatically limited their connections to only the most credible SSPs, it became increasingly clear to buyers that the header model was inefficient and expensive as it required them to bid against themselves for the same impression across multiple exchanges. The Trade Desk's recent announcement of OpenPass is, in many ways, a response to these inefficiencies by attempting to acquire supply directly from the very largest publishers. Though some publishers will ad OpenPass is a demand source, we expect it will be supplementary to other sources and Pass, not a replacement for them. After all, it's not just the Trade Desk even just DSPs looking from our direct access to publishers. As a result, large publishers will need to manage and optimize a growing list of newly minted direct connections with buyers, something they can't do by adding another SSP into the header. Instead, we’ll need to partner with one scaled un-conflicted SSP to unify the auction, optimize yields and deliver a full suite of seller-focused tools, including the ability to embrace and activate the shift towards seller-centric audience and identity. In many ways, this is a return to the one-on-one publisher SSP relationship that preceded header bidding. And for several reasons, no platform is better positioned to lead in this role than Magnite. First, our deep expertise in pre-bid, now the preeminent header bidding standard and our work enhancing it, expanding it with double demand manager, puts us in a unique position to be the clear leader for yield management across every type of demand, including display, audio and video. Second, as the industry moves away from the third-party cookie and other buy-side identifiers towards solutions that are seller-centric, our robust audience technologies bolstered by our recent acquisitions of Nth Party and Carbon in our deal management tools, which are among the best of the business, will enable publishers to activate and monetize their audiences across every media type with an eye towards privacy and security. Third, our relationships with brands and agencies are strong and continuously growing, which benefits our seller clients by bringing them new and unique pools of demand. And lastly, Magnite's omnichannel footprint enables us to meet our clients' needs across a wider range of channels and formats, including CTV, which other SSPs talk about doing, but no independent SSP can match our full stack of capabilities in this area. And that's a good transition to CTV, which is fundamentally different from DV+ and how it operates. Because CTV is a world in which there's a finite amount of the available inventory and viewer experience takes precedent over CPMs, there isn't the same need for header bidding. Even if the means of executing these direct sales is increasingly programmatic, in many cases, there's no action at all. For this reason, our clients prefer to work primarily with Magnite and they look to us to provide far more than the highest bid. These range from device manufacturers and OEMs such as LG, Vizio, Samsung and Roku to virtual MVPDs such as Fubo, Hulu, Sling and DirecTV to digital first and free ad-supported streaming TV services like Pluto, Tubi, and Crackle and broadcasters and programmers such as Disney, Discovery, Fox, and A&E. For many of these companies, we're not just helping them sell or serve the ads, but more importantly, to manage a highly complex series of decisions that balance revenue, targeting, and enforcement of business rules, while fiercely guarding viewer experience and publisher data. Moreover, by integrating our proprietary ad service, SpringServe, we offer CTV sellers a holistic yield management solution that drives value across their entire ad business by dynamically allocating between programmatic and non-programmatic inventory, and we are constantly innovating to solve the evolving needs of CTV sellers. One, all media display CTV audio, you name it, will be bought, sold or executed programmatically, and two, sellers will always need a scaled and unconflicted agent to help them make the most of every programmatic opportunity. With that, I will hand the call over to David, who will provide additional detail regarding our financial performance and expectations. Despite macro headwinds, we are pleased that Q1 revenue came in consistent with our guide. Adjusted EBITDA came in above our implied guidance, which resulted in strong cash flow and non-GAAP earnings per share. We also see this translating into solid guidance for Q2, but I'll cover after I discuss the first quarter results. Revenue ex-TAC was $107.1 million, up 79% from Q1 2021 on an as-reported basis and a 15% on a pro forma basis. TTV revenue ex-TAC was $42.3 million in Q1 2022, up from $12 million or 253% from last year on an as-reported basis and up 27% on a pro forma basis. Mobile revenue ex-TAC grew 12% and desktop revenue ex-TAC grew 3% year-over-year, both on a pro forma basis. Our revenue ex-TAC mix for Q1 2022 was 40% CTV, 35% mobile and 25% desktop. Operating expenses, which, in our case, includes cost of revenue for the first quarter, were $157.9 million versus $74.5 million in the same period a year ago. Adjusted EBITDA operating expenses, which represents the difference between revenue ex-TAC and adjusted EBITDA was $78.2 million for Q1, an increase of $3.7 million sequentially and up from $50 million in Q1 2021, also driven primarily by the acquisition of SpotX in a year-over-year comparison. Costs for the first quarter were lower than expected, primarily driven by slower hiring, consistent with the overall labor market, lower technology and cloud costs and lower office and travel expenses in the quarter. The increase in net loss was primarily attributable to an increase in amortization of acquired intangibles related to the SpotX acquisition, which had no cash impact. Q1 2022 adjusted EBITDA was $28.8 million, an increase of 208% versus prior year, resulting in a margin of 27% as compared to adjusted EBITDA of $9.4 million or a margin of 16% in the first quarter of 2021. Non-GAAP earnings per share in the first quarter of 2022 was $0.08, which was up compared to non-GAAP earnings per share of $0.03 reported for the same period in 2021. The Capital expenditures, including both purchases of property and equipment and capitalized internal use software development costs were $8.7 million for the first quarter of 2022, in line with our expectations. Operating cash flow was $20.1 million in the quarter, which we define as adjusted EBITDA less CapEx. Our interest expense for Q1 2022 was $7.1 million, of which roughly $5.7 million was cash. At the end of Q1, we had $204.6 million in cash on the balance sheet. For Q1, our cash outflows included $21 million for our acquisition of carbon. Regarding M&A opportunities, we believe that we have the core assets that we need at this point in time, although we will always consider tuck-ins or aqua hires that would expand our talent pool or accelerate our product features and functionality, such as our recent acquisitions of Nth Party and Carbon. Regarding debt, we continue to reduce our net leverage ratio, which was approximately 3.1x at the end of Q1 as compared to 6.2x at the time we closed SpotX the end of April last year. As it relates to our $50 million share buyback program announced in December, we repurchased 931,000 shares for $12 million in Q1, leaving $31.9 million in the program at the end of the quarter. In addition, for our regular RSU vesting during the quarter, we utilized the withhold to cover method to cover employee taxes withholding 315,000 shares for $4 million. As a result, share dilution was reduced by about 1.2 million shares during the quarter. We expect adjusted EBITDA operating expenses in Q2 to be $83 million to $85 million, implying an adjusted EBITDA margin of 33% at the midpoint. The sequential increase in adjusted EBITDA operating expenses is primarily driven by an increase in technology infrastructure costs, hiring a full quarter impact of our return to office and the return of T&E and marketing events. For the second half of 2022, we expect quarterly adjusted EBITDA operating expenses to increase roughly $3 million to $4 million each quarter. And for 2022, we continue to expect that we will generate over $100 million in free cash flow. We're very pleased with our results for the first quarter of 2022 and are optimistic about our growth trajectory, especially in the back half of the year. With that, let's open the line for Q&A. Hi, Laura, it's Michael. And so even though there's scarcity in the market today, it's not exactly inflating prices. So I think over time, even though it's more inventory, I don't see it having a dramatic impact on CPMs because of adding more supply into the marketplace. And then secondly, you said in your prepared comments, Michael, that you thought everything was going to be programmatic. Well, I think our -- the meaning there Laura, was that the vast majority of publishers don't have the means and/or ability to land a major tech player to bring in-house. And then, of course, the pendulum swings both ways, Microsoft picked up Sander from AT&T, who tried to do it in-house and that didn't work out so great. But our meaning is that, I think folks have learned when they put all their eggs in one basket in the DV+ world as it relates to Google, a little by little over the course of 15 years, they learned that it was in the most efficient way, and they broke the system by doing pre-bid and bringing ahead of bidding into the world. And I think that -- it's not lost on folks that if your partner is independent, isn't in conflict if you doesn't own inventory, doesn't sell ads against other inventory, then that's in their transparent and above board. So kind of an inline Q1 from the topline perspective, but when we look at the Q2 guide that looks a lot more robust, particularly on the CTV side. Yes so Jason, I think that -- look, we saw the same impact that others did in the face of the crisis in the Ukraine, our CPMs across the board in particularly EMEA, they plunge dramatically. Well, obviously, we think that there's going to be some aiding of political that's going to kick in for midterms. We also see some strength in our managed service business on the CTV side with the return of some of the important ad verticals, I wouldn't say 100% return by any stretch, but strengthening. No, I think that's right. I think, I would still say cautiously optimistic in Q2, just because there's so much going on. But certainly, as Michael mentioned, as we especially get into the latter half of the year with the political, with our GroupM SPO deal, we're continuing to -- in the upfront process, agencies are really going to be pushing for greater amounts to run through programmatic. A couple of factors that we're observing, one is, we had a small number of Russian publishers who we no longer have on the exchange, that had a smaller impact. We've also seen some softening of CPMs, particularly in our DV+ business in EMEA. And we think that comes from, I suppose, some general skittishness around the Ukraine situation. Also a lot of advertisers don't like to be advertising around these kinds of events, so even know there's a ton more inventory. So we've had -- we normally don't see, significant impacts from the normal FX volatility, but there's been a very significant strengthening in the dollar. And then just a follow-up for me, so any updates on the relationship with Disney, kind of looking at this two ways. And then second, I know we're starting to approach the term on that 18-month agreement from a year ago. And the -- as for Disney+, I think it validates the model rate, the idea of having an ad-supported tier. And although, it's obviously Disney's decision and how they go to market with Disney+ and the other streaming assets, our understanding is it's all going to be available through Drax and obviously, we powered a nice chunk of that. And so therefore, we say there's nothing but a positive opportunity. I know you're cautiously optimistic, a lot of moving parts. But as it relates to OpenPass, I think it's in its nascent formation. I think that, as we pointed in our remarks, others will seek direct pass, particularly agencies. The challenges, a lot of them don't have the technology to work directly with publishers. And that's why, I think, you see deals like the GroupM deal that we announced and the OMD deal we talked about in IPG and Avas . It adds a degree of complexity for our publishers, and that's why we think that -- our thesis is that an SSP will never be more valuable, because they are the ones that can help manage this complexity and manage the yield of the complexity. To be completely candid, as long as the third-party cookie exists, it's going to be hard to make that like revolutionary. But once the cookie is deprecated, I think you're going to see a big rush to first-party data being readily used by buyers that's provided by the sell side and tools, the tools that we've acquired are going to play an integral role in that. And, David, maybe you want to talk about the pro forma growth CTV expectations. And we've always talked about the CTV business being very volatile, it's nascent. But we do believe that over time, our growth rates should definitely exceed those of market, which I think folks handicap in the low 30% range right now. The last couple of quarters, you've talked about a few supply chain issues in the auto business. If there's anything you could give us a bit more in terms of that or any other sectors that are affecting your Q2 number, because on a very difficult comparison actually in Q2, I think it's very nice to see a 25% growth forecast for the top line. Yeah, I think on Q2, we're still seeing -- I don't know that we really have the issues that we talked about. I think supply chain, particularly auto remains a challenge. The Ukraine situation, I think, still has a bit of a dampening effect, particularly in our EMEA business. But I think where we've seen improvement, I think travel, in particular, has had some rebound, still not fully back to pre-COVID levels by any margin, but we've seen significant improvement there and have expectations for growth there. And I think if you look at the Group N premium marketplace and their partnership with us there, I think you're going to -- we certainly hope that, that will have an impact in terms of moving dollars over. There's many, many more conversations regarding having programmatic front and center in the actual upfront itself the guaranteed world. So, it's -- yeah, it's a nice development early stage and not sure that there'll be a milestone announcement or event, but hopefully, it would play through in our back half numbers, as David kind of alluded to in his prepared remarks. And would there be -- as opposed to, I guess, to kind of fall into remnant spot inventory kind of over time is kind of what you were saying, just to make sure I understand that. And so what you're seeing now is that much more of a mutual agreement at the table, at the bargaining table during the upfront about a chunk of the dollars being allocated programmatically as part of the guarantee. So if you're an agency and you're guaranteeing one of the broadcasters $50 million, you -- in the past wanted some of that to go programmatically it was never part of the deal. And so that's -- yeah, that’s -- it's the maturation that we thought was going to happen in the business. It's just that I think like, again, with feels like the GroupM deal, you're going to -- that shows you how vested they are and wanting to transact business wise this way. That's exactly right, yeah. I think that as we've talked about this in the past, DV+ in a world where you're transacting hundreds of millions of options a day, every little bit tweak here or tweak their results and improvement. I wish there was a seminal product or project that we could point to that once it's completed, it unlocks the flood gates. But it's a constant area of maintenance for us, innovation for us, and admittedly an area that was under maintenance or innovated over the years as we acquired the CTV assets. But when we're thinking about the full year guide, and you mentioned Q2 starting to see some political -- obviously, the CTV environment changed so much since the last mid-term cycle. And it feels to me like mid-terms might be a little bit better positioned than general election for you because of the emphasis on targeting, right, because they're all regionalized elections. Yes, I think we feel as though if and when we see the impact of political spend for the mid-term, it will be predominantly through CTV. The folks from scripts who are bundling inventory from other non-script stations to create a bigger pool of available inventory in those markets, and they're working exclusively with us on that. And so -- and of course, we have our direct team in the middle market in the states working with the top agencies that are specialized in spend. And so our best guess is that this mid-term probably will behave more like a general election like two years ago than it will like a traditional mid-term, especially as it relates to CTV. So, yes, we're cautiously optimistic that we're going to see some flow through in Q2 and certainly in the back half of the year. And yes, as far as the volume of spend, as Michael mentioned, maybe similar to presidential and with this recently leaked news on rovewave , that would be a super charge of that spend as well. When they -- because political campaigns pay are not price sensitive, they just outbid non-political advertisers. Vasily, it's very keen observation. So I think what you see in the online video is that there's just -- there's always a lot of inventory, and therefore, there's a lot less displacement. In CTV, I think you do see some displacement, but I think that, that -- any displacement is more than made up for, as you pointed out, there's not a lot of price elasticity as it relates to CPMs. And so although -- and even though inventory generally speaking, is very tight in the CTV world, it's not always all sold, and there's different dayparts and things like that where political may be less sensitive about running it. And so I think that -- all in all, we have seen historically that even if there's a displacement, it's a net positive because of the rates as it relates to Magnite. I mean, I think that, generally speaking, especially if you get into Q4, so right at the tail end of the election cycle, those are pretty tight windows anyway. But as I said before, it was still a good guide because of the rates that displace these buyers were significantly higher than market. Thinking about these new AVOD services, you touched on Disney Plus, but with regard to Netflix, maybe Apple TV Plus, just in general, if you could comment on how do you think about your ability to win new business. So yeah, it's a very fair question. Are you launching in foreign countries, if you're never had an ad business before. It's hard to predict how long it would take, especially if you're starting from scratch, but one would say it's obviously a multi-quarter journey, given the fact that you haven't even pitched your customer base on this tier, tried to figure out what the cannibalization might be, et cetera, et cetera. So I think that there's a lot more that goes into it, obviously, than just ad technology. But as it does relate to add technology, I think we are being extraordinarily well positioned as we talk about all the assets that we have and not just doing the traditional work of bringing demand like an SSP to fill these ad slots, but having the server to actually serve them. So at the very minimum, we have the leading CTV ad server and especially if you don't have a legacy business, there's not really a need for a server that was built in the online video world that meets the conditions and rules that broadcasters needed to spread the needle between linear and streamed. And obviously, every day, we're helping these new services get off the ground and sell ads. And some of them have a direct sales team, where the rules of engagement are quite structured and others don't have any direct sellers, and they rely upon us for the vast majority of their demand. And then just one more for me, you briefly touched on it, but any update just with regard to the construction of the seller defined audiences, maybe specifically within CTV, utilizing that first-party data from publishers. So early days, right, as I said before to one of the other questions, as long as a third-party cookie world exists, it's hard to generate enough urgency on the publisher side because it's a need that necessarily doesn't match what buyers want, but the minute third-party cities go away. It will be multiple solutions, but we feel very good about the assets that we have and the work that we're doing right now on those assets. Many, many open web sites and apps don't have a looting component, and it makes profiling an audience a little bit more difficult than the login user approach of CTV. And so yes, I think in CTV, you're going to find that, that's going to quickly move to the front and center of buyer needs because of the displacement of the cookie. First, on Trade Desk moving away from Google open bidding, I know, it's still fairly early, but I'm curious what you're seeing in terms of impact. I think you've talked about having that out fully in the market, I think it's by 1Q 2023. So I'm just curious, how that's progressing. They came to all the SSPs and they went to publishers and they basically said, hey, we're buying your inventory on multiple pads. It's kind of hard to track it as to whether or not it's flowing through prebid, and it's also too early to see if the hundreds of SSPs that were in the OB program if that shift of share to the validated SSPs in which Magnite is one of them for Trade Desk. But I do think, again, very early days, and we could be seeing it just in prebid and not recognizing the specific dollars. That timing is around -- as you know, it's all not just dependent upon us. But I think if you build a next-gen platform that has all the bells and whistles and while the -- that everyone's asked for, it just leads to more revenue opportunities in terms of access to inventory. And maybe one quick follow-up, and this has been -- I think touched on a couple of times, but I think that my question is, I think when you think about some of the opportunities or changes out there, so Disney launching an AVOD in the US by fourth calendar fourth quarter or the Warner Discovery merger now being done. When you think about your full year commentary and guidance and we don't need to get into specifics, but I guess does that contemplate or take anything into account in terms of some of these incremental perhaps opportunities out there, or would you landing one of these or an increased role with one of these be incremental to kind of what you've talked about. I think, Matt, whenever you look at new business opportunities, you kind of bake it into a general forecast. So, a lot of our business growth every year, organic is same-store sales, but we always do lie upon kind of an unknown number out there that will come from new client relationships. And so I think by and large, it's already baked into the forecast and these things tend to start off as walk before you run types of relationships. No, I think that's right. I would now like to turn the conference back over to Michael Barrett, President and CEO, for any closing remarks. We continue to see and invest in clear areas for growth in CTV, DV+ in audience and identity. We've established ourselves as a critical long-term partner for many of our publishers and buyers, especially in CTV and believe much of our future success lies in both our execution and in winning new business. As we look at the back half of the year, we feel strongly that our selection by Group N and CTV, Disney+ recently announcing an ad-supported alternative, return in verticals such as travel and political spend are tangible examples of growth drivers for the quarters ahead."
}