{
    "symbol": "DPZ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 13:53:14",
    "content": " Looking at a three year stack, our Q4, 2022 global retail sales, excluding foreign currency impact, grew over 26% versus Q4 2019. Breaking down, total global retail sales growth, U.S. retail sales increased 2.7%, rolling over our prior increase of 4.6%, excluding the impact of the 53rd week in 2020, and are up more than 21% on a three year stack basis relative to Q4, 2019. International retail sales, excluding the negative impact of foreign currency grew 7.5%, rolling over a prior increase of 13.2%, excluding the impact of the 53rd week in 2020 and are up more than 30% on a three year stack basis relative to Q4, 2019. Turning to comps, during Q4 same store sales for the U.S. business increased 0.9%, rolling over a prior increase of 1% and were up 13.1% on a three year stack basis relative to Q4 2019. Looking at the business on a three year stack, Q4 delivery same store sales were 3.3% above Q4 2019 levels. Our market share in total pizza QSR, which includes Delivery, Carryout and Sit Down continued to hold steady over the past year, and it's still up close to 300 basis points versus three years ago  Before I conclude my comments on market share, I would like to touch on channel dynamics for pizza QSR versus non-pizza QSR based on data we receive from NPD. Same store sales excluding foreign currency impact for our international business increased 2.6%, rolling over a prior increase of 1.8% and were up nearly 12% on a three year stack basis relative to Q4, 2019. Finally, given the current macroeconomic headwinds that are impacting our U.S. delivery business in particular, we are updating our two to three year outlook from 6% to 10% global retail sales growth to 4% to 8% global retail sales, and unit growth from 6% to 8% global net unit growth to 5% to 7% global net unit growth. One moment for our next question. One moment for our next question. So think about our Carryout business that's not encumbered by any of those headwinds was up 14% to 15% in Q4, over 30% over the last three years, $1 billion dollars over the last three years, you know that's really a business that's on fire, and then internationally we open more organic stores than we ever had in our history. One moment for our next question. One moment for our next question. I think, look â\u0080\u0093 on the Carryout business, when we look at it, when we look at three years tax of 31% on a business that has actually grown over $1 billion over the last three years, you get to a point where the sequential change is sometimes going to be off a little bit, but I don't think it really reflects on the underlying business. One moment for our next question. One moment for our next question. One moment for our next question. One moment for our next question. One moment for our next question. And I wonder as you kind of think about the footprint going forward to 8,000 stores, if there be a way to reduce the sales impact from those splits, because obviously to the most nearby stores, it would be much greater than 25%, so that's the first part of the question."
}