{
    "symbol": "GWW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 15:48:03",
    "content": "  Operator: Hello, and welcome to the W.W. Grainger First Quarter 2022 Earnings Conference Call and Webcast. Actual results may differ materially as a result of various risks and uncertainties, including those detailed in our SEC filings. This morning's call will focus on our first quarter 2022 results, which are consistent on both the reported and adjusted basis for all periods presented. Please remember that MonotaRO is a public company and follows Japanese GAAP, which differs from U.S. GAAP, and is reported in our results 1 month in arrears. As a result, the numbers disclosed will differ somewhat from MonotaRO's public statements. Today, I'll provide an overview of our first quarter performance, and then pass it to Dee to walk through the financials in detail. I'll begin by quickly highlighting our strategic operating framework, the Grainger Edge. I'm excited to share that earlier this month, we were recognized as one of Fortune 100's -- Fortune's 100 Best Companies to Work For. Not unlike the past 2 years, the first quarter of 2022 threw us some challenges, including the ongoing impacts of the pandemic, heightened inflationary pressures, supply chain and labor challenges and now the Russian war in Ukraine. First, we continue to manage through the highest inflationary period in our careers. On the cost side, we are leveraging our purchasing scale and working closely with our supplier partners to chart a shared path forward. Despite high inflation, our goal remains to be price competitive while targeting price/cost neutrality. On the supply chain front, we continue to work with our supplier and transportation partners to ensure products are available and delivered to customers on a timely basis. Overseas freight remains pressured with delays, port congestion and container challenges and when coupled with increasing fuel prices, is pushing costs higher than historical trends. In my visits to our customers in Q1, I continue to hear that we are performing well, relative to the market, on securing product. We also continue to stay focused on hiring and maintaining competitive payroll and benefits to ensure we attract, engage and retain high-performing teams. We continue to receive feedback that Grainger is a great place to work, and our team members still value as they work to support our customers each day. We continue to invest in our strategic initiatives like marketing, remerchandising, KeepStock and technology. These efforts, coupled with our advantaged service, have allowed Grainger to have strong outgrowth versus the broader MRO market. Demand remained robust, and we finished the quarter with sales growth of 18.2% or 17.9% on a daily constant currency basis. In the U.S., we outgrew the broader MRO market by 550 basis points for the quarter as our supply chain and inventory investments helped us meet our customers' needs. Total company gross profit margin finished the quarter at 37.9%, expanding 245 basis points over the prior-year first quarter. Even when excluding that adjustment, however, we were still up nicely year-over-year. We delivered 14.6% operating margin, an increase of 305 basis points over the prior year as the improved gross margin performance was further aided by top-line leverage and disciplined cost management. In the quarter, we delivered an adjusted ROIC of 41% and returned $163 million to shareholders through share repurchases and dividends. Yesterday, we announced an increase in our dividend, which marks our 51st year of consistent increases and continued commitment to our shareholders. As a result of our strong performance, we are raising our full-year 2022 guidance estimates. Earlier this year, we talked about our focus areas for 2022, executing on our key growth initiatives, driving operational excellence and strengthening our culture. With that, I'll turn it over to Dee to take us through more detail on the quarter and our guidance. We covered revenue and margins at the total company level, and I'll get into more detail on the segments in a minute. Our total company SG&A as a percentage of sales was 23.3%, gaining solid leverage over the prior-period first quarter. Given our investments in the DCs at MonotaRO and our continued strategic initiatives in High-Touch Solutions, I am proud of the way the team concurrently managed these investments as well as operating expenses to support strong top-line performance in the quarter. Finally, resulting EPS in the quarter was $7.07, up 58% versus the first quarter of 2021. We continue to see strong results with daily sales up 18.2%, compared to the first quarter of 2021. In the U.S., we saw a strong price realization from our recent pricing actions and delivered strong growth in every end market, with particular strength in commercial, transportation and heavy manufacturing. In Canada, the economy has rallied back, and the business saw year-over-year sales growth in nearly every end market, with manufacturing especially strong this quarter. For the segment, GP finished the quarter at 40.4%, up 310 basis points versus the prior year. If we exclude the first quarter 2021 pandemic product inventory adjustment, we still achieved gross margin expansion of roughly 80 basis points. While the sale provided a modest tailwind in the quarter, it is expected to net out as we move through the balance of the year. Given the timing of price and cost increases in the quarter, our price/cost spread was favorable. I'll also note that our pandemic mix at the end of the quarter was back to near prepandemic levels at just above 20% of sales mix, and we continue to see similar results through the first few weeks of April. While we have included our pandemic-related sales in the appendix for this period, given that we have returned to prepandemic mix levels, we do not expect to provide this information in subsequent quarters. At the operating margin line, we saw improvement of 395 basis points year-over-year as the strong gross margin recovery was aided by 85 basis points of operational expense leverage. Overall, an extremely solid quarter for the High-Touch Solutions North American segment. Looking at market outgrowth on Slide 10, we estimate that the U.S. MRO market grew between 12.5% and 13.5%, indicating that we achieved roughly 550 basis points of market outgrowth in the quarter. As I've gone out and spent time with customers and investors over the last few months, we often are asked about the drivers of our share gain. We also know that by focusing on and investing in the right areas like remerchandising our assortment, increasing our use of analytically-driven marketing and improving the effectiveness of our salesforce, we can consistently deliver growth above the market. We continue to execute well, and our goal to achieve 300 to 400 basis points of annual market outgrowth remains intact. In local currency and local days, MonotaRO achieved 18.4% growth, whereas Zoro U.S. daily sales were up over 19%, both very strong. GP expanded 10 basis points versus the first quarter of 2021, while operating margins declined 95 basis points as planned. This decline was primarily a result of our increased DC investments at MonotaRO and was partially offset by Zoro's operating margin expansion, which improved 90 basis points over the first quarter of 2021 on strong GP improvement. In addition, we've also continued to see positive results in our key operating metrics. On Slide 12, you can see registered users are up 20% over the prior period. In 2021, Zoro made a strategic pivot away from certain less productive channels, allowing them to focus on more profitable B2B customers, who also have a higher likelihood to make repeat purchases. As a result, we've elected to remove these customers from this metric, which lowers the nominal user count for Zoro, but the growth rate remains relatively consistent to what we have shown in the past. We think this is a more accurate way to reflect this metric, and we will use this new definition, going forward. On the right, we show the continued growth of the Zoro SKU portfolio. We're off to a great start and results remained strong in April, with total company daily sales trending up around 20%. While we don't typically adjust our guidance expectations after a quarter and acknowledge the broad market uncertainty, our conversations with customers' results to date and continued momentum give us confidence to make a change at this time. As a result, we are raising our 2022 full-year guidance. Our new outlook includes expected daily sales growth between 11% and 14% and EPS between $25 and $27, representing over 30% earnings growth year-over-year at the midpoint. We've also updated our supplemental guidance in the appendix, which reflects a slight upward revision in the High-Touch Solutions operating margin and an increase in total company operating cash flow. Before I open it up for questions, I would make just a few comments. First, we performed extremely well in the quarter. I'm proud of the team and the way we've executed, focused on serving customers well and navigated through some of the bigger challenges that we discussed at the beginning of the call. We continue to execute on our growth drivers, drive operational excellence and strengthen our culture. As we shared last quarter, I'm excited to provide some information on our upcoming Investor Day. We will be focused on providing more details on our strategic initiatives and longer-term outlook, as well as provide a tour of our DC, where we will highlight some of our automation and ESG investments at work. More detailed information will be available in the coming weeks, and we certainly look forward to an exciting day. I know you folks used to break that out a little bit separately, but maybe you can just give us an update on how things are progressing in Canada. It's a great question. The cost structure is in a good place, and we're seeing growth with some attractive customer segments, most notably manufacturing in healthcare. And that business just continues to get better and better, from a profitability perspective, and it's steady, and it's going to continue to be a steady rise in profitability, but we feel pretty good about the path we're on. And then, just as a quick follow-up, I'm looking at the safety side of the business. You mentioned that, that's back to kind of prepandemic levels as a percent of sales. I'd say, there's a slight elevation in some of those products. I can't really predict what customer behavior is going to be around those products, given the way the virus proceeds. And in almost all cases, there isn't a lot of new PPE versus what was borne in 2019 being used. So we don't expect it to be hugely elevated, mask and sanitizer sales, going forward. And we're pretty much back to normal, still elevated, but not that much. First off, I was hoping you could unpack the comment you made about speaking with customers and they expressed a lot of confidence about demand. I can give you my perspective and Dee, if you've talked to customers that have a different perspective. I have talked to a lot of heavy manufacturing, line manufacturing commercial customers. And despite -- we talked about -- a little bit about it despite sort of the uncertainty of the world, everybody right now would say super busy, just hanging on. If I can get the supply chain parts into my operation, I have the demand, and we see that through most of the customers that we're talking to, right now. I haven't been -- I'm trying to think, it's been a while since I've been in an energy plant. But generally, customers are pretty bullish on demand, right now. And then for my follow-up, what really stood out to me was the profit margin in the High-Touch business. And I'm curious, the guidance seems to imply that 1Q will be the high watermark. So when we talked about guidance last year, I think a lot of the underlying assumptions really stick, even with some strong performance up to this point. I know the cost cycle has been a little unusual, but I will say, the seasonality related to our price changes, we are assuming the same types of outcomes. We feel like Q1 will be a higher watermark as it relates to that, and we will moderate as we go through the year. And then on the midsized customer margins, they used to be running, I think, about 10 points above the average in that segment. Structurally, we don't think there's any reason why we can't get there. Given the path of the business, we're focused on sequential improvement, and we do feel like we can build to that, but it's going to take multiple years to get back to that 10%. But structurally, there's no reason why we can't get back to double-digit margins there. And on midsized customers, I think it's a good assumption now to use high single-digit number. It's, if anything, it's been slightly better than what we saw for 1Q revenue in April. But generally, it's very, very good. I mean you had really nice outgrowth, and I'm trying to understand the factors there. Our marketing efforts, we're getting more capable in terms of marketing, spending money in the right places and getting really strong returns out of marketing, and that's a big piece of it. We see a nice expansion of our KeepStock offer, so becoming more integrated with our customers' inventory management practices and supporting their inventory management practices. Those are things that have been very consistent and are a bit evergreen for us at this point, in the sense that we're always getting better at those and we -- those -- cause actually drive significant share gain. I think the core thing that we are working on, I would add providing better insights to our customers to help them manage their business, they cost out, and I think we're getting better and better at that as well. I think, through this time, we've done a better job than most of managing, adding product of finding customers' substitute products, if we don't have products, and being able to serve them. And then just quickly, if you could zoom out on gross margin kind of 5-year plus sort of basis. I was going to add that -- DG, you can continue on. In the High-Touch business, we've kind of noted, specifically for this year, that we're focusing on gross margin stability around 40%. I mean -- so what I would say is, we feel like we are price competitive at the gross margins we're at. We feel like within the High-Touch, the 40% number is going to be a fairly stable number over time. Our company gross margins are likely to go down slightly, just given the assortment growth continues to be -- to grow faster than the business, and then they tend to operate at a lower gross margin and lower SG&A. But in terms of the segment performance, we actually expect pretty stable gross margins over the next several years. Just first question, I guess, a clarification. Dee, you mentioned, I think, in some of your opening remarks about kind of a seasonal benefit in 1Q kind of tied into a sales event in February, I just -- starting to unpack -- hoping to unpack that a little bit more and maybe add some numbers to it. From a Q1 GP perspective, the show provides a modest tailwind for us year-over-year. And that's due to supplier funding, as you can imagine. And then a competitor of yours, pretty recently, talked about some supply chain stabilization, maybe not seeing as much inbound inflation outside of freight-related items. I mean, obviously, the freight environment has gotten more difficult, and China has a bit more of wild COVID lockdowns. We certainly have seen some improvement in -- particularly, domestic freight, in terms of service. But yes, we would say something similar, where things were easing a little bit and continue to do that domestically, the overseas piece is probably the more complicated . I guess, so first, I kind of wanted to follow up on DG's prior commentary around the longer-term gross margin drivers. And certainly, I understand that Endless Assortment outgrowth is a structural gross margin, I don't have the consolidated level. I think, just working with our customers, understanding the value we provide, the value we create, seeing some midsized outgrowth and having confidence as we continue to return to more industrial product as we've seen. And then I wanted to also follow up on the last question and commentary around potentially maybe easing some of the domestic freight costs or supply chain, and I understand that part of it. So I would first comment that the China shutdown is going to take weeks and maybe longer for that to flow through, in terms of understanding the impact. I would say that ex that, what we were seeing before was still significant supply chain challenges but more isolated to specific suppliers that were having trouble getting product to meet their manufacturing needs. And so for customers that have the materials that we haven't seen, labor has gotten a little bit better and transportation got a little bit better. And we still see -- it's still a challenged supply chain, from our suppliers' perspective, in many cases, but it is more isolated to specific suppliers rather than -- it was broad-based this time last year. You would have just said, it was kind of chaos, and it's less chaos now, but there's still plenty of challenges. I don't think -- so to answer the second part first, I don't think there's a significant change in the mix of the portfolio. We have more on those assortment business, but I don't -- that will probably perform similarly. We look at share gain during downturns, and it's usually been very good. Part of that is because we are steadfast in maintaining service to customers in downturns, and that allows us to serve customers better than many others can. We take a financial -- you can go back and look at 2008, '09, is probably the most severe one we've had, and you can model what happened there. But we're -- one of the things that I would sort of say is, we are -- while we don't know when a recession will hit, we are certainly aware of the uncertainties of the world and we are being very mindful of the cost of running the business. But in general, we performed well, and we would expect to do that again. So -- and Dee, do you want to -- you may have the details. Roughly, if you go back over a kind of 10-, 12-year period, we were at about $2 billion of midsized customers. We're now, I think, $1.5 billion or more, $1.6 billion, maybe this year, something like that, is the expectation. And we continue to do a really nice job of reacquiring customers that left us, and then growing with existing customers and building solid relationships. So we think we've got a long runway, in terms of share gain, with midsized customers. No, I wouldn't say we had many missed sales. We have -- I mentioned this a little bit before, more than ever, probably we're relying on some of our product information investments to make sure we can get customers to substitutes. Obviously, if a product has a chip in it, that's been a challenge. So I won't call out specific products, but I would say, we've done a nice job of finding alternatives in most cases, and it's hard to argue that we're missing too many sales. Coming out of the pandemic, you've got a number of your customers opening up shop, back to work. So you typically get a bigger lift during the, like reopening or restarting process. This is -- first of all, we have not had many customers that closed shop. I mean, we've been with our customers throughout. So if you said cruise lines, which we have cruise line customers, obviously, they shut down. And you'd see a little bit of that type of growth potentially there, but it's a very small portion. If you go back to 2019, we've seen substantial growth, and we saw really growth only in the front end of the pandemic in 2022 that we really see a drop because most customers actually kept operating. And so, I think it's just normal business. I mean, it sounds like you're moving more into productive channels. We've been making a strategic pivot with that business for the last several years, dramatically expanding the product line, building new data analytics capabilities, getting that business independent from a technology stack. In terms of the question specifically you're asking, we have done a whole bunch of analysis, working with the team in Japan, on customer profitability. And customer profitability, not in terms of the first transaction but in terms of lifetime value. I think, ultimately, it actually will accelerate our growth rate as we get better at acquiring and getting attractive customers to the second, third order, where they become more frequent buyers. But certainly, we have made a little bit of a shift in getting out of some channels that were lower lifetime. That's really, really helpful. I think, historically, when you accrue volumes in customers, it's pretty sticky base for continued scaling. So I just wanted to kind of revisit that there might be some reversion, once everyone has sort of democratic access to process or to procurement. But yes, just -- I'll listen from there. It's a great question. I think what I'm hearing from customers is, most of the work that we've done has been highly valued to support their operations and to keep them up and running. And in many cases, we've actually added inventory management solutions to our KeepStock solutions or further embedded in customers really, really want to continue to have long-term relationships. So you could argue there may be some pullback, but that's really not the behavior we're seeing, and it's not what we're hearing from our customers. Our customers are saying, if anything, we've learned a whole lot about who we want to partner with and why we want to partner with them through this. And our ability to keep customers going is super valued, and I think it will continue to help us be sticky with those customers. So what we basically have been looking at is, we took price, obviously, through some of the back half of last year as well, as everybody has. That doesn't mean prices will go down, they won't. But relative to some of the changes that we made last year, you'll start to see a bit slower -- a lower difference. So we would expect them to moderate somewhat, still a pretty healthy price, obviously, this year. Sorry, I don't know, there was a problem with my line, I apologize for that. Yes, we -- in High-Touch U.S., I know specifically, we usually talk a little bit about our pricing outlook. So we've kind of usually talked about the lumpiness of price for us and how it impacts gross margin through the year, with a large portion of our High-Touch U.S. business being contract based. So in light of still saying suppliers continue to come in, with cost inflation request and our ability to continue to work with them on that, when we look at the outlook, we believe that staying in line with our current gross margin is most feasible right now, knowing that we're going to have some lumpiness as we continue to appropriately pass through some inflation as it comes through off-cycle. As the year progresses, as you know, the math works, you have less months to push some of that through. I would just reiterate the fact that we're completely focused on what we can control, and that's making sure we advance our strategic initiatives to grow profitably. Building the culture, we think, is really, really important and making sure that we serve our customers well. And while there are many things going on, the market right now is very, very strong, and we feel good about the share gain performance we're getting."
}