{
    "symbol": "SSD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-24 19:29:03",
    "content": " Net sales of $553.7 million increased 39.6% year-over-year, primarily driven by product price increases that we implemented throughout 2021 to offset rising raw material costs as well, as our acquisition of ETANCO, which contributed $67.5 million to our top line. In Europe, third quarter sales totaled $111.9 million, up 104.1% year-over-year. ETANCO contributed $19.4 million to our gross profit on its $67.5 million of sales, net of $2.9 million in purchase accounting adjustments, which reduced our third quarter gross margin by approximately 210 basis points. Within the North America segment, net sales increased 29.3% to $437.8 million, primarily due to the price increases we implemented last year, along with higher sales volumes. In Europe, net sales increased 104.1% to $111.9 million, primarily from ETANCO, which contributed $67.5 million in net sales and, to a lesser extent, price increases intended to offset higher material costs abroad. On a segment basis, our gross margin in North America decreased to 47.5% compared to 52.1%, primarily due to higher raw material, factory and overhead and labor costs, each as a percentage of net sales, which were partially offset by the product price increases we implemented in 2021. Our gross profit dollars in Europe totaled $35.2 million and included $19.4 million from ETANCO, which is net of a $2.9 million nonrecurring fair value adjustment for inventory costs as a result of purchase accounting. Our third quarter research and development and engineering expenses increased 17.3% to $17.1 million, primarily due to personnel costs. Selling expenses increased 21.3% to $42.5 million, primarily due to $5.6 million from ETANCO as well as personnel and travel-related expenses. General and administrative expenses increased 26.2% to $60.3 million, primarily due to $9.6 million from ETANCO, which includes $4.2 million in amortization of the acquired intangible assets as well as personnel, travel and professional fees for the company overall. As a result, our consolidated income from operations totaled $122.8 million, an increase of 22.1% from $100.6 million due to higher consolidated gross profit partly offset by higher operating expenses. In North America, income from operations increased 27% to $127.3 million, primarily due to higher gross profit given operating expenses were effectively flat. In Europe, income from operations decreased 18.2% to $6.1 million, which includes ETANCO's operating income of $1.8 million net of the $2.9 million nonrecurring fair value inventory adjustment I noted earlier, as well as the aforementioned $4.2 million of amortization expense on acquired intangible assets, and $1.9 million in integration costs for a total of $9 million. During the third quarter, we invested approximately $10 million for capital expenditures, paid $11 million in dividends to our stockholders and repurchased approximately 308,500 shares of our common stock at an average price of $91.67 per share for a total of $28 million. Further, we continue to estimate the cumulative top line impact from product price increases we implemented throughout 2021 to be approximately $300 million in 2022 versus 2021."
}