{
    "symbol": "SSD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-25 22:52:01",
    "content": " We delivered strong financial and operational performance in the second quarter Net sales of $593.2 million, increased 44.6% year-over-year. Our consolidated net sales in Europe for the second quarter were $133.2 million, an increase of 136.1% year-over-year year, due primarily to the contribution from ETANCO as well as product price increases in response to rise in material cost, which were offset by significantly lower volume overall and the negative effect from a strengthening U.S. dollar. ETANCO contributed $19.2 million to our gross profit on its $80.3 million of sales, net of $9.2 million in purchase accounting adjustments, which reduced our second quarter gross margin by just under 160 basis points Compared to the prior year and before considering the addition of ETANCO, our gross margin declined as expected as our average raw material costs began to catch up with some of our price increases. Within the North America segment, net sales increased 30.2% on relatively flat volumes to $456.4 million, primarily due to the price increases we implemented in 2021 to offset rising raw material costs, which was partly offset by foreign currency translations. In Europe, net sales increased 136.1% to $133.2 million, primarily from ETANCO, which contributed $80.3 million in net sales, and to a lesser extent price increases, intended to offset higher material costs abroad. The second quarter research and development and engineering expenses increased 19.6% to $16.9 million, primarily due to ETANCO. General and administrative expenses increased 23.2% to $58.4 million, primarily due to ETANCO including amortization and personal and professional fees for the company overall. As a result, our consolidated income from operations totaled $133.1 million, an increase of 30.8% from $101.7 million due to higher consolidated gross profit, partly offset by higher operating expenses, and an additional $5.9 million spent on acquisitions, specific integration costs for ETANCO. In North America, income from operations increased 35.8% to $137.4 million, primarily due to higher gross profit, which was partially offset by higher operating expenses, including travel and entertainment and personnel costs. And now we expect capital expenditures spend will be in the range of $80 million to $90 million compared to our previous estimate of $65 million to $70 million, primarily due to the addition of ETANCO, which has an annual run rate of approximately $10 million, as well as the facility expansions Karen highlighted earlier. But we still do estimate the $220 million approximate of revenue from the ETANCO team\n Of course, with their certain parts of Europe, very much focused on, excuse me, energy efficiency, the products that ETANCO brings to market from helping put up new facades and cladding and the like very, very much in line with some of the -- what we think are some of the tailwinds are in Europe."
}