{
    "symbol": "HOMB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 20:57:04",
    "content": " From our side, we're going to continue to do what we always do, which is be conservative and make good credits and I think we're going to see an opportunity possibly if things do get volatile, that we'll have an opportunity to keep doing what we do, and you may see some loan growth. Well, probably -- I don't have the exact number for the month, but obviously, when we were running at 47% in the first quarter, and happy he's running north of 62%, and we combined through this quarter around 46%, it is pretty amazing turnaround and expense reductions. I think on the insurance, I think Stephen said, we were paid about $1.4 million now and Happy with -- we paid $1.2 million last year, Happy paid 800 and combined we're going to pay $1.4 million it's about $600,000 savings, it's $50,000 a month, we'll take that. I think it's probably -- we're going to wait after the next increase and then -- which is -- 75 to 100 basis points, I assume probably 75. I think you can see what we can see 6% so like in our 6% loans and our securities we're getting back on some of the shares are getting better made, as you well know. I think it's -- whatever our portfolio looked like 3 years ago, you're getting that percentage pay off now. But just based on what we've seen over the last couple of months, I would think things -- I wouldn't expect any material growth from where we're at today. So we've just been passed along we've got our other securities that went up -- you can see the base signed down on this last quarter call us $1.8 million, but they're back they're up. I'm curious, I'd love to hear a little bit more from Chris around what he's seen in his markets in those larger ticket loans, I feel like -- I don't know, I feel like Chris kind of hate everything. So we're seeing opportunities over the summer and through the second, third quarter, where people are just saying, \"Hey, listen, I got this project, I want to move it forward or I'm buying these things and don't want to do that, and we're going to have to get that done over here.\" I would say the last couple of months, it's been borrowers readjusting their expectations because they're saying, well, I used to get 70% at L plus 2 75%. You think about the rest of the world out there, all the banks out there are doing not all in having liquidity, but most banks good banks have liquidity, and they're getting lots of money and that's cost us as taxpayers lots of money. But we'll pay attention we listen I think we're in good shape I wouldn't mind going back to 2.50, 2.5% reserve, but I wouldn't mind that at all fire money, right. And I think the goal was to have 75% of the $50-plus million recognized by the end of this year, whether we're close to half there or not, maybe that they give you some direction in terms of where we would hope to see by December and into the first part of next year. It's -- when you look at how they manage that, they get some lease income and a lot of things cover themselves on that term spots around those -- all the markets, it could be because -- and we're looking for future expansion for certain things, but that probably wouldn't happen. The second part here that's going to be, I think, even better for the company, but I want to look at the banks that are 2.33% ROA, it's better and get you, Johnny, but I'm going to try."
}