{
    "symbol": "LLAP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 10:54:18",
    "content": " Good morning, everyone and thank you for joining Terran Orbitalâ\u0080\u0099s second quarter 2022 earnings call. With me this morning are Marc Bell, Co-Founder, Chairman and Chief Executive Officer of Terran Orbital Corporation and Gary Hobart, Chief Financial Officer of Terran Orbital Corporation. During todayâ\u0080\u0099s call, we may be making certain forward-looking statements. With that, I will turn it over â\u0080\u0093 the call to Marc. Thank you, John and good morning, and thank you to everyone for joining our second quarter 2022 earnings conference call. Our customers include NASA, Lockheed Martin, the Department of Defense, the Intelligence Community and the European Space Agency as well as numerous commercial customers. Terran Orbital delivers to its customers and month for millions of dollars, solutions that used to take years and carry a price tag in the billions. Our satellites provide higher functionality, persistent and faster product delivery at a lower price point. We serve an industry that the U.S. government forecast will launch approximately 50,000 satellites over the next decade, creating an enormous opportunity for companies with advanced, scalable, vertically integrated satellite and design and production capabilities like us. We are delighted with our teamâ\u0080\u0099s performance this quarter, and we are happy to report that our business is rapidly expanding. First, we saw a significant increase in business momentum during the second quarter. Revenues rose 120% in the quarter compared with the prior year period, primarily due to the continued and increased level of progress made in satisfying our customer contracts, including the ongoing and favorable impact from significant contract wins and modifications in recent periods. And in June, representatives from Lockheed Martin and the Space Development Agency joined us for a tour of our new expanded state-of-the-art facilities in Irvine, California. We are thrilled that with our backlog, which is up 200% to the end of 2021 to $224 million, and our pipeline is comprised of more than 140 identified opportunities representing a value of approximately $16 billion of potential customer revenues as of June 30, 2022. Difficult supply chain conditions persist, but Iâ\u0080\u0099m proud of how our vertical integration strategy is proving its merits, and we continue to make investments in infrastructure and equipment to expand production capacity and decrease our reliance on outside suppliers. Within the defense sector, we are pleased to have delivered in May the first of 10 satellite buses to Lockheed Martin in support of the Space Development Agencyâ\u0080\u0099s Tranche 0 for the Transport Layer. The Transport Layer is the foundational layer for the National Defense Space Architecture and a secure mesh communications network in space, which will enhance U.S. global defense capabilities. Our reliable execution on these tranches enhances our competitiveness for future awards and related to this critical defense constellation, which will consist of hundreds of satellites and low earth orbits, and we expect these to be replaced every 5 years. This is showing how a change going from â\u0080\u0093 there used to be geosynchronous satellites that would last 25 to 35 years now goes to satellites that last 5 to 7 years, and our business becomes a recurring revenue business as the business model has changed. As previously announced, we subsequently won a contract to provide an additional 42 buses for Tranche 1, and we expect to begin delivering in 2023. Within civil government sector this quarter, we are also exceptionally proud to have delivered NASAâ\u0080\u0099s CAPSTONE satellites in NASA in June as a critical part of the Artemis program to return humans to the moon. Since NASAâ\u0080\u0099s launch of CAPSTONE on July 7, Terran Orbitalâ\u0080\u0099s mission operations team successfully established communications with the satellite and is now utilizing groundbreaking low-energy navigation technologies to guide the satellite, as far as, 1.5 million kilometers from earth before returning it to a near linear halo orbit, which is basically an elliptical orbit around the moon. This is very exciting mission, not only verifies the dynamics of the orbit but also proves Terran Orbitalâ\u0080\u0099s reliability and speed and delivering technological breaking satellite solutions for our customers. Additionally, within the civil and commercial sectors, we supported the launch of 6 customer satellites on a single SpaceX launch in Q2, all of which are successfully operating for a diverse mix of satisfied customers. In the defense community, for example, we are seeing increased urgency and demand for space solutions in response to a variety of factors, including Russian and Chinese development of new military technologies and capabilities. We also saw real-time utility of satellite imagery, coverage and resilience and the miss of geopolitical crisis demonstrated in Ukraine. In Congress, there continues to be broad bipartisan support for the National Defense Authorization Act, which has been passed every year since 1961 and is one of the few programs to have such bipartisan room support. In July, both houses advance the bills proposing a significant increase through 2023 â\u0080\u0093 in the 2023 defense budget and prioritizing research and development for space programs. 2 weeks ago, the Senate advanced the bill with a $63.6 billion increase in DoD spending versus fiscal year 2022 versus fiscal year 2021. The Senate earmarked $2.2 billion for development of resilient space capabilities, including low earth orbiting satellite systems. Early in July, the House of Representatives provided an even bigger year increase in funding, including for tactically responsive space programs and the mandate to integrate commercial base capabilities related to space situational awareness, imagery and communications. Outside of the U.S., other countries are responding similarly to military and environmental threats by increasing budgets for space systems and seeking to harmonize and integrate their space requirements for those in the United States. For example, both the UK and Australia have recently announced new military space investments and expanded cooperation with the United States. Finally, looking ahead, we expect the second half of this year to be very exciting. Firstly, we look forward to delivering the rest of Tranche 0. Second, we have over 20 programs in house, and we are ramping production capacity to execute on our backlog and future opportunities. And finally, we continue to be excited about our pipeline and achieve engagement we have with our customers. And this, as I said before, is the future of space, which is a recurring revenue business. In sum, our results for the quarter demonstrate the strong growth in our business and I could not be proud of our teamâ\u0080\u0099s execution or validation of our market opportunity and business strategy. Revenue for the second quarter was $21.4 million, a 127% increase over the same period last year, reflecting our continued execution on our programs. As a reminder, we recognize revenue on most of our programs on a percentage of completion basis and changes have a cumulative catch-up impact in the period in which we make the adjustment. In the second quarter, adjustments to our estimates at completion or EAC reduced revenues by approximately $1.3 million. Adjusted gross profit for the quarter was $2.1 million, down from $4.5 million in the same period in the prior year and up from negative $0.2 million in the first quarter of this year. EAC adjustments during the second quarter reduced adjusted gross profit by an estimated $3.8 million comprised of the $3 million I mentioned previously, plus $2.5 million from EAC adjustments to cost of sales. Adjusted EBITDA was negative $14.8 million for the quarter compared with negative $2.5 million in the same period in the prior year, and essentially flat compared to the negative $14.7 million in the first quarter of 2022. The decrease in adjusted EBITDA year-over-year was primarily due to the decrease in gross profit and increases in selling, general and administrative expenses related to salaries and wages, research and development, facility expenses and other operating costs as a result of our growth initiatives. Finally, at June 30, we had approximately $62 million of cash on hand and approximately $203 million in gross debt obligations. This committed equity facility gives us the right, but not the obligation to sell to B. Riley over a 24-month period up to the lesser of $100 million of newly issued shares or 27.5 million newly issued shares at a 3% discount to market, subject to certain conditions and limitations. Thank you, Gary, and thank you, everyone, on the call for your continued support of Terran Orbital. So in the release, it says that the PredaSAR launch for the first two satellites has been moved to 2023. That said, we are well along on the antennas for the PredaSAR bus, and the buses will come after Tranche 0. And then just a follow-up there, do you expect that â\u0080\u0093 if we think about the timing for the first two PredaSAR satellites. It has our desire to get one up in the first quarter and possibly both, but weâ\u0080\u0099re going to take it to schedule. And so, the satellites continue to evolve. And then, Gary, just with regard to cash burn, it was much higher in Q1 than Q2. And with the business of designing and really manufacturing satellites, a lot of the payments are coming up and paid to us ahead of the labor and spend. So we tend to be â\u0080\u0093 as we have new awards, we tend to be fairly â\u0080\u0093 generated a fair amount of cash from our working capital. So it could be anywhere from $20 million to $25 million, but this quarter it was only $15 million of burn. And then just last thing, Marc, you talked about adding people. I think weâ\u0080\u0099ve been very lucky on being public, itâ\u0080\u0099s helped a lot. We are being â\u0080\u0093 we are having a lot of people who â\u0080\u0093 more visible we get, things like the NASA CAPSTONE program. Weâ\u0080\u0099ve got a lot of people excited and a lot of resumes in the door, the SDAâ\u0080\u0099s Tranche 0 and Tranche 1 got a lot of resumes in the door. So as we get on these bigger, more exciting programs, weâ\u0080\u0099re getting a lot of people who want to leave the big primes and come work for an exciting startup like us. So itâ\u0080\u0099s â\u0080\u0093 for us, itâ\u0080\u0099s a very exciting time. And as we look forward to continue to expand in Florida and California, but Florida has been a very rich ground for us behind some pretty amazing talent. Thank you very much. As far as the evolving goes, weâ\u0080\u0099re looking at the Tranche 1 bus, which is a much larger bus. So for example, weâ\u0080\u0099re putting an OISL link to connecting to DARPAâ\u0080\u0099s Blackjack on one of our satellites. We have another customer on the tune of first or second satellite, and we have another customer with another program connecting to something else. So, we take a larger bus with additional secondary payloads gives us more connectivity into more existing government programs and an increasing potential for revenues. We always think â\u0080\u0093 we always remember, my space was the first, but it werenâ\u0080\u0099t the winner. Sure, on CapEx, for the first 6 months of the year, weâ\u0080\u0099re at $9.4 million. During the first quarter, we guided to about $15 million to $20 million of CapEx for the year. CapEx is going to be a function of various things, including the launch of PredaSAR satellites and other things. Also with the addition of the B. Riley facility and the access to additional liquidity, it really allows us to have a lot more flexibility on when and what weâ\u0080\u0099re spending money on, even as we look at our resources and are mindful of our capital resources. And weâ\u0080\u0099ve seen minor issues on chips, but not a lot, mostly with third-party vendors, they are having some issues, but everyone are delivering on time and on budget. Weâ\u0080\u0099ve been very â\u0080\u0093 we have a great team managing our supply chain, and weâ\u0080\u0099ve done very long-term relationships with our vendors, and weâ\u0080\u0099re in good shape. Thank you very much. Just a follow-up on the larger bus for the PredaSAR, are you seeing any larger needs for power for the PredaSAR. So, power, what makes us different than a lot of our competitors out there in the SAR market that are using much, much smaller buses is we are able to have a longer time imaging and we can image when we are not facing the sun. And thatâ\u0080\u0099s one of the â\u0080\u0093 thatâ\u0080\u0099s one of the huge advantages of being a much larger bus, we have much more batteries. And so, we are working with our customers, figuring out what is the best solution and continuing to develop other technologies with them that allows us for greater connectivity. And forgive me, the â\u0080\u0093 what was the second part of your question, that was like a two part question after that. The Ukraine, which is an incredible tragedy has really proven to the government and to customers the value of SAR. And the SAR satellites were credited for stopping the Russians on their advance to Kyiv and because they are only attacking at night and being able to see at night and find those missile launches, made a huge difference in the war. So, SAR by now you see people going out on our own looking at SAR, commercial SAR and other people looking at commercial SAR, whereas a year ago, those conversations were all classified. Itâ\u0080\u0099s a very â\u0080\u0093 just like electro-optical was classified and became a commercial product, you are seeing SAR quickly moving down the road of becoming a commercial product, meaning they are much more willing to buy from people like us than they were a few years ago, which is great. And then just a question on â\u0080\u0093 as you move to Tranche 1 from the first tranche, is there a learning curve improvement on your end or is Tranche 1, the bus is any more complicated. That being said, we are building â\u0080\u0093 I think our large â\u0080\u0093 we are building satellites now as large as 800 kilograms. So, we are really stepping up what we are able to do, because while we invented the CubeSat and we created this industry, itâ\u0080\u0099s a great demonstrator, you could do something in a small package, but itâ\u0080\u0099s â\u0080\u0093 now there is a happy medium between where you need to be. You want to make sure you can put on a  on SpaceX, but it is the more batteries and the more processing power that you can put into these things within reason, it is because you donâ\u0080\u0099t want to get too big, because then you want to â\u0080\u0093 you want on a transporter launch. But itâ\u0080\u0099s exciting how these things have transformed, and very quickly, because we are able to â\u0080\u0093 because we manufacture a lot of our components ourselves, we are able to do a lot of this transformation in-house without relying on third-party suppliers. As it relates to the SDA program in Tranche 0, it seems like you are on schedule to deliver all 10 buses by year-end. Not only have we done that, but we have already begun work on Tranche 1, just to give you an idea of the schedule. So, we are doing excellent â\u0080\u0093 our staff is doing excellent job, I mean not only keeping on schedule, but moving it along already progressing to Tranche 1. I spoke to the tenant governorâ\u0080\u0099s office yesterday, and we are working feverishly to get it done. It is unfortunately working with â\u0080\u0093 our government does take time, as I have learned, patience â\u0080\u0093 lot of patience is a virtue. We are very eager to have a shovel on our ground, and we just need everybody else in between our three shovels to get it done. And then maybe just last on the Irvine facility, thatâ\u0080\u0099s going to â\u0080\u0093 looks like thatâ\u0080\u0099s going to open in the fall timeframe. I mean we are going from â\u0080\u0093 we are going to add 40,000 square feet of clean room. We have already completed â\u0080\u0093 20,000 square feet is already completed and a moving condition. So, we â\u0080\u0093 that facility will be completed by the fall. So, we could do â\u0080\u0093 all we could do all of Tranche 1 in there plus a lot more. Satellite, our manufacturing business is booming, we are seeing incredible demand from both not only the government but the civil, the commercial and civil sectors. We are seeing everybody really â\u0080\u0093 people are finally getting it at slightly a better term, and have seen the opportunity to make money from space. And so, we are seeing â\u0080\u0093 there are lots of people out there who are trying to build constellations that are working on it. And itâ\u0080\u0099s just a land rep, we have a finite amount of facilities, and we are adding more. Itâ\u0080\u0099s really about the customer at the end of the day, what the customer wants and the things the customers want PredaSAR to do and as PredaSAR as we continue to get these secondary payloads and this thing evolves with it. Itâ\u0080\u0099s not necessary â\u0080\u0093 itâ\u0080\u0099s not about our manufacturing capacity after the new facility opens, we are in fabulous shape to get to Tranche 1, to get PredaSAR out and a few other people to boot. And our customers are becoming â\u0080\u0093 the customer base that we are talking to is increasing its size and they have more things that they want, and we are listing to our customer, because we want to be successful from day one, and thatâ\u0080\u0099s very important to us. And so, itâ\u0080\u0099s not about â\u0080\u0093 so it has nothing to do with cap spend. But the reality is, I had dinner with people from Space Force not long ago, and their dream is to order satellite on Monday and get it on Friday. And I see a time, 3 years or 4 years from now, where that isnâ\u0080\u0099t going to be too far from reality, that you will be able to order a satellite and get it in a very quick time â\u0080\u0093 get it in a very quick fashion. Your people â\u0080\u0093 I hear people joking about it now that they can deliver a satellite in 30 days, thatâ\u0080\u0099s not reality. You have to test it and a lot of testing moves into these things, because remember, you canâ\u0080\u0099t â\u0080\u0093 itâ\u0080\u0099s all your card to break some lease a dealership, you go pull it back and fix it. So â\u0080\u0093 but that being said, you will see things going much, much â\u0080\u0093 timelines getting more and more compressed as â\u0080\u0093 over the next few years. Thank you very much. Well, I just want to thank everybody for attending todayâ\u0080\u0099s earnings call. We are â\u0080\u0093 we appreciate your support, and we look forward to talking to everybody soon."
}