{
    "symbol": "NRUC",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-18 14:12:09",
    "content": " The $1.5 billion increase in loans to members during the six months ended November 30, 2022, reflected net increases in long-term and line of credit loans of $825 million and $688 million respectively. Our total assets at the quarter November 30, 2022 were approximately $33.2 billion, an increase of $1.9 billion or 6% from the fiscal year ended May 31, 2022 primarily due to the growth in our loan portfolio. Our loans to members totaled $31.6 billion as of November 30, 2022, an increase of $1.5 billion or nearly 5% from May 31, 2022 level and an increase of $890 million or 3% from the prior fiscal quarter end. Our total liabilities increased by $1.6 billion or 6% to $30.8 billion as of November 30, 2022, compared to 29.1 billion as May 31, 2022 largely due to the issuance of debt to fund the growth in our loan portfolio. Our member's equity, which excludes cumulative derivative forward value losses and accumulated other comprehensive income increased by $47 million or 2% to $2.1 billion as of November 30, 2022, compared to the May 31, 2022 level. We had loans to the same three CFC power supply borrowers totaling $203 million or 0.64% of total loans outstanding classified as non-performing as of November 30, 2022 compared to $228 million or 0.76% of total loans outstanding classified as non-performing as of May 31, 2022. Our total debt outstanding was $30.4 billion as of November 30, 2022, an increase of $1.6 billion or 6% from May 31, 2022, primarily to fund the growth in our loan portfolio. At November 30 2022, our funding under the Guaranteed Underwriter Program and notes payable with Farmer Mac totaled $9.4 billion or 31% of our total debt outstanding, an increase of $164 million from May 31, 2022, due to a net increase of $212 million in borrowings under the Guaranteed Underwriter Program, partially offset by a net decrease of $47 million in the borrowings under the Farmer Mac no purchase program. Our short-term borrowings increased by $630 million to $5.6 billion accounting for 18% of our total debt outstanding at November 30, 2022, compared with $5 billion or 17% of total debt outstanding at May 31, 2022."
}