{
    "symbol": "FLS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 18:41:06",
    "content": " Additionally, we delivered solid bookings of $1.1 billion, representing constant currency year-over-year bookings growth of nearly 20% with continued support from our traditional end markets and enhanced 3D booking activity. In the fourth quarter, we delivered modest improvement in our shipping cadence, which drove year-over-year constant currency revenue growth of roughly 19% and total revenues over $1 billion, which was our highest quarterly sales level since the fourth quarter of 2019. Full year 2022 bookings of $4.4 billion increased roughly 18% or nearly 23% on an FX-neutral basis, as the overall market rebounded nicely from prior years. We delivered year-over-year revenue growth of 13% or 18.6% on a constant currency basis to over $1 billion, marking our highest quarterly revenue level since 2019. On a reported basis, fourth quarter gross margins decreased 60 basis points to 28.4%, including charges of $8.1 million due to our Russia exit partially offset by a $4.5 million settlement on previously written down assets. Fourth quarter adjusted SG&A was roughly flat compared to the prior year, but down 200 basis points as a percentage of sales to 18.4% as we demonstrated ongoing cost control that leverage the higher revenues. Fourth quarter reported operating margin increased 80 basis points year-over-year to 10.1% where our previously highlighted cost management more than offset the gross profit decline, the $6 million increase in adjusted items and FX headwinds of roughly $6 million. It was a use of $40 million, driven by a working capital usage of nearly $190 million to support our strong 22.7% constant currency bookings growth and 36.5% increase in year-over-year backlog as well as required adjustments to longer lead times for certain critical materials. However, fourth quarter working capital as a percent of sales increased only a modest 20 basis points sequentially to 32.4%, again reflecting our sales growth, which largely compensated for the strong bookings and backlog improvement. Additionally, while our backlog increased over $730 million since year-end 2021, our inventory, including contract assets and liabilities as a percentage of backlog dropped 500 basis points to 28.5% versus prior year, reflecting the ninth consecutive sequential quarterly decline and reaching the lowest level in five years. As Scott highlighted, we expect to deliver strong revenues and adjusted EPS this year, supported by our near-record backlog with expectations for continued support of end markets and further building off the operational momentum we established in the fourth quarter. As you likely saw in our pre-release a few weeks ago, we are targeting a full year 2023 adjusted EPS and the $1.50 to $1.75 range which would represent a year-over-year adjusted EPS increase of nearly 50% at the midpoint. We also expect revenue to increase in the 9% to 11% range, while we typically ship roughly 90% of our beginning backlog in any given year, due to the return of large project awards to our backlog as well as some lingering supply chain issues impact on our lead times, we currently expect to recognize just over 80% of our $2.7 billion backlog during 2023."
}