{
    "symbol": "FLS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 15:17:09",
    "content": " This level was also up 12% sequentially compared to last year’s fourth quarter, which was the highest bookings quarter of 2021. We are pleased that Flowserve was awarded several midsize projects in the first quarter of this year, each about $30 million in size, plus a larger award of around $50 million. This quarter’s strong bookings generated a quarter end backlog of $2.2 billion, which is the highest level we have had since the third quarter of 2015 and is up 18% year-over-year. Flowserve’s first quarter revenue declined 4.2% or 2% constant currency, impacted by the previously discussed operating headwinds and included low single-digit declines in both FPD and FCD. On a reported basis, first quarter SG&A increased a modest $8 million year-over-year, which included $10 million of Russian-related charges, partially offset by the $4 million decline in realignment expenses. First quarter reported operating margin decreased 560 basis points year-over-year to 0.9%, where the previously discussed challenges and Russian related charges of $20 million were partially offset by the $14 million reduction of realignment spending. And while the strong bookings environment and backlog growth has driven increased inventory, I am pleased that our focused inventory management drove sequential and year-over-year decreases in total inventory, including net contract assets and liabilities as a percentage of backlog by 130 and 740 basis points to 32.2%, the lowest level since the second quarter of 2019. Both the reported and adjusted EPS target ranges also assume current foreign currency rates, reasonably stable commodity prices, the continuation of current market conditions, no significant improvement in the Russian-Ukraine conflict and expectations for our customers to continue to release larger project work in the second and third quarters. In terms of phasing, considering Flowserve’s traditional second half-weighted earnings and cash flows, our results in the first quarter, we now expect this pattern to be more pronounced than our initial guidance assumed as supply chain, logistics and labor availability issues are expected to improve throughout the third and fourth quarters."
}