{
    "symbol": "LILA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 16:25:24",
    "content": " This was a solid start to the year for the group, driven by strong performances in Costa Rica and C&W, which grew by 9% and 5%, respectively, and also a robust subscription revenue growth in Puerto Rico. We are on track with our integration of previously acquired operations in Puerto Rico and Costa Rica, and this remains an important driver of our future free cash flow growth with over $85 million in synergies anticipated once these businesses are fully integrated. Building on a strong performance in Q4, we added 28,000 postpaid subscribers in the first quarter, driving 25% year-over-year postpaid revenue growth. As Balan highlighted, we delivered modest rebased growth of 1% for the quarter, led by B2B and slightly positive rebased growth across both residential and mobile subscription revenue. Similar to revenue, Costa Rica and C&W Caribbean & Networks posted strong rebased growth on the back of subscriber volume gains over the last 12 months, which was more than offset by declines in Chile, Panama and Puerto Rico. Beginning with C&W Caribbean & Networks, we generated $445 million of revenue or 5% rebased growth and $193 million of adjusted OIBDA or 8% rebased growth. CWP contributed $127 million of revenue and $41 million of adjusted OIBDA in Q1, reflecting flat rebased revenue growth and a decline of 8% in rebased adjusted OIBDA. Residential mobile revenue declined 3% from Q1 2021, primarily as a result of lower prepaid recharging activity, which more than offset strong growth in postpaid revenue. We reported $171 million of revenue and $47 million of adjusted OIBDA, reflecting rebased declines of 9% and 26%, respectively. Led principally by continued strong performance in our newly acquired mobile business, we reported revenue of $107 million or rebased revenue growth of 9%. First, our residential fixed business continues to be fueled by broadband growth as we reported $121 million of revenue in the quarter."
}