{
    "symbol": "LILA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 23:19:07",
    "content": " Our Q2 performance was driven by a 6% year-over-year rebased growth in C&W and Panama and Liberty Costa Rica, which was up 10% year-over-year on a rebased basis. Similar to the first quarter, we generated revenue of $1.22 billion, reflecting an approximately $45 million increase or 4% reported growth as compared to $1.17 billion of revenue for the Q2 2021 period. Partially offsetting this growth, foreign currency depreciation versus the U.S. dollar in the quarter reduced our reported revenue by over $30 million, with the largest impact attributable to the weakening Chilean peso as the average rate fell by roughly 18% quarter-over-quarter and an organic top line reduction in Chile stemming from continuing high competitive intensity. Our Q2 result reflects a rebased decline of 2% over Q2 2021 as our double-digit rebased increase in C&W Caribbean & Networks and 4% growth in Costa Rica was more than offset by declines in Chile, Puerto Rico and Panama. Starting with C&W Caribbean & Networks, we produced $455 million of revenue or 6% rebased growth. We had steady revenue performance across both fixed and mobile in Q2, benefiting from higher volumes gained over the last year and a very strong B2B performance with 9% rebased growth. CWP increased revenue from Q1 by roughly $15 million to produce Q2 revenue of $142 million, resulting in 6% rebased revenue growth over last year's Q2. As compared to last year's adjusted OIBDA of $46 million in Q2 2021, our Q2 result reflects a rebased decrease of 3% and a margin decrease of 300 basis points to 31%. We reported $150 million of revenue and $38 million of adjusted OIBDA, reflecting rebased declines of 16% and 35%, respectively. Finally, to Costa Rica, we delivered $108 million in revenue for 10% rebased growth and $36 million in adjusted OIBDA for 4% rebased growth in Q2. Our rebased adjusted OIBDA growth was slower than revenue growth, in part due to roughly $2 million of integration expense in the quarter and $3 million of nonfunctional currency impact as the colon is depreciated by 9% on average quarter-over-quarter. The primary development in Q2 with respect to the capital structure is that we borrowed roughly $172 million, including $160 million in 4.25% term loans at the end of the quarter in Cable & Wireless Panama in anticipation of funding the acquisition of Claro Panama in July. Adjusting our guidance for the estimated Claro Panama impact in H2, our adjusted FCF target would be approximately $220 million and P&E as a percent of revenue would remain at approximately 18%."
}