{
    "symbol": "LILA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 13:50:27",
    "content": " Without VTR which was still consolidated in the period, our revenue would have been $1.1 billion and up by 3% on a rebased basis, driven by top line growth across most broad reporting segments, particularly Liberty Costa Rica, and our Cable & Wireless Caribbean businesses. Turning to the bottom of the slide, we delivered adjusted OIBDA of $415 million, which reflects a 6% reported and rebased decline to our results for Q3 2021. To put our results in perspective, if we were to simply adjust our results for the estimated hurricane Fiona adjusted OIBDA adverse impact of $12 million and incremental immigration expenses year-over-year of $5 million, our rebased adjusted OIBDA growth would have been about 3% for LLA. C&W Caribbean was LLA's best segment performer in Q3 with respect to overall adjusted OIBDA growth, achieving double-digit rebased expansion as compared to last year. Total revenue was $173 million, producing rebased growth of 2% and adjusted OIBDA was $47 million, generating a rebased decline of 5%. CWP's rebased revenue growth was driven by 9% residential fixed and 4% B2B growth, while residential mobile declined by 2% as postpaid service revenue growth was more than offset by a prepaid decline. Finishing on the far right, C&W Networks in Latin America reported revenue of $103 million and adjusted OIBDA of $59 million, reflecting modest year-over-year declines of 1% and 4%, respectively. Moving to the bottom left of the slide, Liberty Puerto Rico delivered revenue of $367 million in Q3, which reflects 2% rebased growth and produced adjusted OIBDA of $132 million resulting in a rebased decline of 6%. We posted Q3 revenue of $109 million and $33 million adjusted OIBDA, reflecting strong rebased revenue growth of 7% and a modest adjusted OIBDA rebased decrease of 1%. We generated $130 million of revenue and $31 million of adjusted OIBDA reflecting rebased declines of 19% and 42%, respectively, as both heightened competitive intensity in 2022 and strategic decisions to better align our propositions with those with the broader market have resulted in compression across our financial metrics. With respect to our consolidated 2022 financial guidance targets, we remain on track to deliver 18% P&E as a percent of revenue and are revising our expected adjusted FCF for 2022 to $200 million to account for an estimated $20 million cash flow impact from Hurricane Fiona, as previously voiced over."
}