{
    "symbol": "STRC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 22:14:09",
    "content": " The increase was primarily due to increased revenue from product development contract revenues, cost of revenue increased by $3.3 million to $4.4 million as compared to $1.1 million in 2021, mainly due to the cost associated with the product development contracts I just mentioned. Fourth quarter 2022, total operating expenses, including cost of revenues were $101.3 million, an increase from the fourth quarter of 2021, operating expenses of $28.6 million. The increase was mainly due to a non-cash goodwill impairment charge of $70.2 million, which was primarily driven by the sustained decrease in the company's publicly quoted share price and market capitalization during the fourth quarter. Research and development expenses increased by $4.1 million to $10.2 million in the fourth quarter, this increase was driven primarily by increased headcount from the acquisition of RE2. Fourth quarter of 2022, net loss was $92.3 million, or loss of $0.61 per share compared to a net loss of $34.1 million or a loss of $0.25 per share in the fourth quarter of the prior year. Moving on to the full year 2022, revenue increased to $14.6 million from $5.1 million for the full year of 2021, primarily due to increased revenue from product development contract revenues. Cost of revenue increased by $7.7 million to $11.6 million in 2022 as compared to $3.9 million in 2021, mainly due to the cost associated with increase in product development contract revenues I just mentioned. 2022 total operating expenses including cost of revenues were $191.6 million, up $105.5 million from 2021 due mainly to the goodwill impairment charge that previously discussed. Research and development expenses increased by $16.6 million as compared to the prior year due to increased labor and overhead expenses as a result of increased headcount due in part to the RE2 acquisition and third-party service provider costs as the company focused on the development and commercialization of its Guardian XT, XM, Sea Class and XO products. For the full year 2022, net loss was $157.1 million, or a loss of $1.07 per share compared to $81.5 million or a loss of $0.72 per share in the prior year, $70 million of which was due to the goodwill impairment charge, I mentioned earlier. Full year non-GAAP net loss for 2022 was $67.4 million, or loss of $0.46 per share compared to a non-GAAP net loss for 2021 of $35.5 million, or loss of $0.31 per share."
}