{
    "symbol": "FLIC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 15:25:09",
    "content": " Net interest income improved $8.9 million or 8.3% to $115.7 million and our margin increased to 115 basis points to 2.89% in 2022, up from 2.74% in the prior year. The growth in net income for the year was mostly attributable to a $300 million increase in average loans for the year, stable non-interest income of $12.4 million and a slight decline in non-interest expense of $1.1 million to $67.6 million for the year. Mortgage originations slowed to $63 million during the fourth quarter, due to higher rates and less demand from consumers and businesses, but the average rate improved to 5.44% and the yield on our C&I portfolio at the end of the year increased to 6.34%. Net income for the fourth quarter of 2022 declined $2.6 million, when compared to the third quarter of 2022, due to a $3.1 million increase in interest expense, primarily due to higher borrowing cost and seasonal deposit outflows from average check and deposits into interest bearing liabilities. The Federal Reserve's aggressive push to increase federal fund rates by 450 basis points since March of 2022 and expectations, they will continue to increase short-term rates to possibly 5.25% in the first half of 2023 has increased the cost of funds we pay on these types of deposits. The bank is liability sensitive with approximately $410 million or 10% of our interest earning assets, either maturing or repricing in 2023 and approximately $340 million or an additional 8% of interest earning assets in annual cash flows from securities and loans. The bank's non-interest expense was $18.4 million during fourth quarter, an increase of $1.4 million, when compared to the third quarter. And then based on prepayment speeds, we kind of, Alex, what Iâ\u0080\u0099d like to do is I look at last year's full-year annual cash flows 2021, I look at 2022s, I look at estimates from our dialing system and then I kind of look at our quarterly run rate and based on that, I'm projecting about $340 million or about another 8% in interest earning assets from securities and loan cash flows."
}