{
    "symbol": "OPRT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 23:44:06",
    "content": " We delivered record revenue of $215 million and adjusted net income of $53 million, for adjusted EPS of $1.58 and adjusted ROE of 34%. We ended the first quarter with 1.7 million members up from 1.5 million at the start of the year, a 48% annualized growth rate for the quarter, so we are very pleased with the pace of member growth. For our secured personal loan product, we ended the first quarter with $79 million in receivables, up 1,375% year-over-year and on track to meet our year-end target of $140 million. In the first quarter, we generated $215 million of total revenue and $53 million of adjusted net income, or $1.58 of adjusted EPS. Total revenue of $215 million was up 59% year-over-year, also well above our expectations and reflected higher receivables due to increased originations. Interest expense of $14 million was up 1% year over year, primarily driven by increased debt issuance to fund our growth, partially offset by the decrease in our cost of debt to 2.6% versus 3.9% in the year-ago period. As a reminder, last year we locked in $1.4 billion of fixed-rate, term asset-backed funding at a weighted average interest rate of 2.2% and negotiated better terms on our $750 million warehouse lines of credit. For our net change in fair value, we had a $4 million net increase in fair value which consisted mainly of a $41 million mark-to-market net increase on our loans and our debt, a $16 million cumulative mark adjustment related to the sale of $228 million in loans through the structured loan sale at the end of the quarter and current period charge-offs of $51 million. The $58 million mark-to-market increase in our asset-backed notes resulted from a 353 basis point decrease in the weighted average price to 96.3%, due to the increase in interest rates and credit spreads during the quarter. Turning to expenses, our first quarter total operating expense was $147 million, an increase of 39% as compared to the prior-year quarter. Adjusted operating expense which excludes stock-based compensation expense and certain non-recurring charges increased 42% year-over-year to $133 million, growing more slowly than total revenue and net revenue which grew 59% and 86%, respectively year-over-year, thus increasing our profit margins. On a non-GAAP basis, we delivered adjusted net income of $53 million, more than quadrupling $12 million in the prior-year quarter and adjusted EPS of $1.58 versus $0.41, respectively. Adjusted EBITDA was $34 million, a $36 million increase compared to a loss of $2 million in the prior-year quarter. As of March 31, our 30 plus day delinquency rate would have been 4.1% had we not sold $228 million of loans, or approximately 9% of our owned portfolio, at the end of the quarter. Our updated guidance for the full year is: Aggregate originations of between US$3.45 billion and US$3.5 billion, total revenue between US$910 million and US$930 million; adjusted Net Income between US$83 million and US$87 million; and adjusted EPS between US$2.45 and US$2.56. When I look at the prior full year guidance, what's the Q1 guidance versus the updated full year guidance versus the Q1 actual and it looks like we're kind of exiting the year at sort of a $0.40 per quarter run rate of earnings power."
}