{
    "symbol": "OPRT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 21:26:03",
    "content": " As a proof point of achieving this objective, third quarter adjusted operating expense declined 3% sequentially, to define our typical seasonal patterns and adjusted operating efficiency improved by approximately 1,300 basis points year over year to 54%, our lowest level since our 2019 IPO. In the third quarter, we generated $250 million of total revenue and $8.4 million of adjusted net income or $0.25 of adjusted EPS. Our aggregate originations were $634 million down 4% year-over-year, and modestly below the prior guidance of between $650 million and $675 million for the quarter. Interest expense of $27 million was up 152% year-over-year, primarily driven by increased debt issuance to fund our growth and the increase in our cost of debt to 3.9% versus 2.8% in the year ago period. For the first three quarters of the year, combined, adjusted net income was $65 million, representing 23% year-over-year growth and adjusted EPS was $1.95, representing 11% year-over-year growth. Additionally, net cash flow from operations for the third quarter was $68 million, up 44% year-over-year. In terms of guidance, our outlook for the fourth quarter is; aggregate originations of $650 million to $700 million, total revenue of $255 million to $260 million, adjusted net income of $8 million to $10 million and adjusted EPS of $0.24 to $0.30. Our updated guidance for the full year is, aggregate originations of $2.962 billion to $3.012 billion, total revenue of $946 million to $951 million, adjusted net income of $73 million to $75 million and adjusted EPS of $2.19 to $2.25. It's worth keeping in mind that this upward revision of full year guidance only represents $8 million more in charge-offs than previously expected, and even after these expected incremental charge offs, we are forecasting $8 million to $10 million in adjusted income for the fourth quarter. So first of all, when you take a look at the beat we delivered for 3Q, that was really driven by two things; One, we beat revenue by $5 million and that was largely driven by slower prepayment rates in the portfolio, which is not unexpected given the inflation that's occurring. So as you heard both Raul and I comment, we actually reduced adjusted operating expenses by 3% quarter-over-quarter, which is about $4.6 million."
}