{
    "symbol": "OPRT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-13 21:03:06",
    "content": " We delivered fourth quarter record revenue of $262 million, up 35% year-over-year. While our post-July vintages are performing better or near 2019 pre-pandemic levels and continue to grow as a proportion of our loan portfolio, our annualized net chargeoff rate of 12.8% was higher than our prior expectations due to underperformance of our back book of loans originated before our July credit tightening. We grew total revenue by 52% to a record $953 million, while total originations grew by 27% despite significant credit tightening actions in the second half of the year. In the fourth quarter, we generated $262 million of total revenue as shown on Slide 9, and $4.6 million of adjusted net income, or $0.14 of adjusted EPS. Our aggregate originations were $610 million, down 29% year-over-year and below our prior guidance of between $650 million to $700 million for the quarter. Total revenue of $262 million was above the guidance range and up 35% year-over-year, with upside reflecting outperformance in our Digital Banking business. Net revenue was $143 million, down 11% year-over-year due to a net decrease in the fair value of the Company's loans and increased interest expense, partially offset by increased revenue. Interest expense of $36 million was up 211% year-over-year, primarily driven by increased debt issuance to fund our growth, and the increase in our cost of debt to 5% versus 2.5% in the year-ago period. The $21 million mark-to-market increase in our asset-backed notes resulted from a 47 basis point decrease in the weighted average price to 92.5%, due to the increase in interest rates and credit spreads during the quarter. In the fourth quarter, our sales and marketing expenses were $21 million, down 2% sequentially and down 43% year-over-year, as part of our continued cost cutting focus. Our customer acquisition cost was $152, up 13% from the prior year period as lower marketing expenditures were offset by lower aggregate originations due to credit tightening. Adjusted EBITDA was a $33.5 million loss in the fourth quarter, a $57 million decrease compared to a gain of $23 million in the prior-year quarter. Additionally, net cash flow from operations for the fourth quarter was $89 million, up 48% year-over-year. Turning to our expectations for the first quarter and full year 2023 as shown on Slide 12, we remain focused on prudent, profitable growth and our forecast reflects that our tightened credit posture will persist until we see our charge-off rates coming down, the Federal Reserve moderating their interest rate hikes, and the macroeconomic outlook improving. While we still expect that the fourth quarter of 2022 was our peak charge-off rate, and we expect to see improvement throughout 2023, I do want to point out that we now do not anticipate returning to our 7% to 9% charge-off rate in the second half of the year. In terms of guidance, our outlook for the first quarter is, total revenue of $245 million to $250 million, annualized net charge-off rate of 12.5% plus or minus 15 basis points, adjusted EBITDA of $49 million to $44 million. Our guidance for the full year is, total revenue of $975 million to $1,000 million, annualized net charge-off rate of 11.5% plus or minus 50 basis points, adjusted EBITDA of $52 million to $60 million. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}