{
    "symbol": "OPRT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 23:00:22",
    "content": " For our secured personal loan product, we ended the second quarter with $100 million in receivables, up 620% year-over-year. In the second quarter, we generated $226 million of total revenue and $3.8 million of adjusted net income or $0.11 of adjusted EPS. Our aggregate originations were $878 million, up 103% year-over-year and ahead of our guidance of between $825 million and $850 million for the quarter. Total revenue of $226 million was up 63% year-over-year, also above our expectations and reflected higher receivables due to increased originations. Interest expense of $17 million was up 41% year-over-year, primarily driven by increased debt issuance to fund our growth, partially offset by the decrease in our cost of debt to 3% versus 3.3% in the year ago period. Our second quarter total operating expense was $158 million, an increase of 43% as compared to the prior year quarter. Adjusted operating expense, which excludes stock-based compensation expense and certain nonrecurring charges, increased 45% year-over-year to $140 million, growing slower than total revenue, which grew 63%. We delivered adjusted net income of $3.8 million compared to $17 million in the prior year quarter and adjusted EPS of $0.11 versus $0.56, respectively. For the first half of the year, adjusted net income was $56 million, representing 93% year-over-year growth, and adjusted EPS was $1.70, representing 73% year-over-year growth. Adjusted EBITDA was a $4.5 million loss in the second quarter, a $9 million decrease compared to a gain of $4.5 million in the prior year quarter. Additionally, net cash flow from operations for the second quarter was $53 million, up 49% year-over-year. In terms of guidance, our outlook for the third quarter is: Aggregate originations between $650 million and $675 million; total revenue between $240 million and $245 million; adjusted net loss between $4 million and $2 million; and adjusted EPS between negative $0.12 and negative $0.06. Our updated guidance for the full year is aggregate originations between $3.15 billion and $3.18 billion, total revenue between $930 million and $940 million, adjusted net income between $40 million and $45 million, and adjusted EPS between $1.19 and $1.34. Given our focus on prudent growth in this current macro environment, we are reducing our forecast for year-end secured personal loan receivables from $140 million to $130 million, and for year-end credit card receivables from $150 million to $130 million."
}