{
    "symbol": "CNNE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 22:45:18",
    "content": " In total, we have invested $306 million to repurchase approximately 13% of our shares outstanding since we received approval from our Board for our repurchase program in 2021, as we continue to believe that our shares are not only undervalued but so too are the shares of our portfolio companies. This -- in particular, the 9.2 million shares that we sold happen to be shares that we acquired in the IPO at a value of around $21.60 or $21.65 and we were in a kind of a tough tax position in terms of having disposed of some Ceridian shares incurring a very large tax bill and we thought, we just said that we all got together and we said, we own 88 million shares of this company. So with the AmeriLife monetization in the Dun & Bradstreet sale, we're kind of in a good cash position to make a couple of investments but also continue to repurchase shares which is a pretty high priority in our viewpoint right now. So I mean I think really you kind of saw what happened in the first half when we really kind of stepped up when we bought -- we took out the FNF position which, frankly, they were going to have to go to market with that position prior to -- I think it was around November 1 of this year due to the 5-year window that they had to sell their shares that they got as part of the spinout. So we're going to be in the market buying shares back at current levels and even higher and we would get much more aggressive if we again get a pretty stiff downturn in the marketplace and we got back down below that $20, $19 range. And a number of them are just sort of immune to inflation and interest rates, theyâ\u0080\u0099re recurring revenue models and theyâ\u0080\u0099re kind of all part of our playbook and what we like to look for and what weâ\u0080\u0099d like to invest in which are companies that can be strong in really good times and be very dependable in time -- when times get a little tougher. While the future path of the market remains ambiguous, we will remain focused on what we can control which is driving operational improvements across our portfolio companies through our playbook, buying back our shares, given the steep discount to fair value and finding exceptional investment opportunities in monetizing investments."
}