{
    "symbol": "CNNE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 21:13:07",
    "content": "  Operator: Good afternoon, ladies and gentlemen, and welcome to the Cannae Holdings Inc. First Quarter 2022 Financial Results Conference Call. As a reminder, the conference call is being recorded, and a replay is available through 11:59 p.m. Eastern Time on May 16, 2022. With that, I would like to turn the call over to Rory Rumore of SOLEBURY TROUT. On the call today, we have our Chairman, Bill Foley; Chief Executive Officer, Rick Massey; Cannae's President, David Ducommun; and Bryan Coy, our Chief Financial Officer. Before we begin, I would like to remind listeners that this conference call and the Q&A following our remarks may contain forward-looking statements that involve a number of risks and uncertainties. Statements that are not historical facts, including statements about Cannae's expectations, hopes, intentions or strategies regarding the future are forward-looking statements. Because such statements are based on expectations as to future financial and operating results, and are not statements of fact, actual results may differ materially from those projected. The company undertakes no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise. The risks and uncertainties, which forward-looking statements are subject to include, but are not limited to, the risks and other factors detailed in our quarterly shareholder letter, which was released this afternoon and in our other financial filings with the SEC. Additional information, including reconciliation between non-GAAP financial information to the GAAP financial information is provided in our shareholder letter. I would now like to turn the call over to Cannae's Chairman, Bill Foley, who will open with a few brief remarks and then open the line for questions. Within a quarter that presented a challenging equity market backdrop, geopolitical tensions and shifting macroeconomic conditions, our focus remains unchanged. We will continue to take a balanced approach to capital allocation with a focus on repurchasing shares while also searching for private companies that fit our investment profile, and we'll continue to work with our management teams to help them execute. Bill, you talked to maybe what looks like a balanced approach to buybacks and kind of balancing that in with new potential private market investments. Well, I mean, our stock price is really depressed. But relative to other new investments, we're early stages. So we're going to be allocating capital, buying shares back. And then on the -- I mean, obviously, the multiples in the public side have gotten a bit insane. But we are really -- we have drawn down about $60 million, I think, against one of our revolvers. But frankly, at $20, that's a pretty good investment. And then maybe for Bryan, just a kind of housekeeping question. The step-up had to deal with the Dun & Bradstreet additional shares we got, you had a big change in deferred as well. The Ceridian sales shares that mark-to-market value dropped quite a bit from quarter end, so that caused the deferred to go down as well. Deal closes, you get some conversions and now I guess you reported about a 1.4 million share sale. Yes, that's a good question. As part of this, we're locked up on System1 for the majority of our investment until late June, I think June 27 or so. However, we did have some unlocked shares that were a result of a final investment we made in the business when it was being taken public. So I felt that with System1 trading above its $10 mark, and it actually traded quite a bit higher than that, that would take the opportunity prior to earnings release and prior to our lockup or prior to our blackout period to sell a few shares to raise some capital. And so we did, we sold about 1.4 million shares over the last 20 days or so. So we're not in the market now because we are blacked out and System1 released earnings, I believe, on the 11th or 12th. It's -- you'll see when the first quarter numbers come out -- are released, its growth is really fantastic. But from time to time, we may dispose of some additional shares once our lockup expires at the end of June. And the other was the Ceridian mark-to-market that was about $324 million, and that was offset by our cash gain on the Optimal Blue transaction was $313 million the other way. One was sort of what are we seeing out there in the market backdrop and the -- I would say the juiciest area for -- in Irving, an American Capital that I've seen so far, are small-cap GARP type companies. Some of those that went GARP, not crazy, but growth companies that actually have cash flow. And there -- they've been sold off, thrown out with the bathwater. So we like them a lot, but we don't have a lot of capital to put to work on those. And in terms of what we're thinking and doing, as you -- Bill described it, we are in an unfortunate state where we've got to borrow because we -- I don't think he's at all excited about selling anything that we own. It's -- they're way below where they ought to be, and it'd be crazy to sell those in and go do another deal. Just to sort of piggyback on that last question, what guys mentioned that you could possibly borrow to acquire a company. But obviously, the leverage part of the LBO, those have gotten a lot more expensive over the past 60 days or so in the high-yield markets, which I'm sure many of you are well aware, are almost frozen. So I don't know that anybody is going to pull off a levered LBO anytime soon, except for the really highest quality stuff. We had a very -- it was a very difficult January for the restaurant business in terms of spike in commodity prices and really shortage of labor, trying to keep your restaurants open and moving forward. But after the -- following January, we started to see some really nice improvement in terms of restaurant operating margins and year-over-year same-store sales growth. So we're anticipating in 2022 to, despite the bad January and part of February, to have a strong restaurant year. Over the last several years, we've taken -- we've reduced store count significantly in the Charlie system and also the 99 system. We sold off our -- the baking company, the pie business and also our family dining business. And so the rest -- the other 2 chains, Charlie's chain and 99 chain, are really doing fairly well. So we're actually -- for the first time in a lot of years, we're pretty happy with the restaurant business. And Bill, you're probably going to shoot me for this question. You're going to have a monetization event for yourself, hopefully, with Black Knight here in the future. But you bring out an interesting point, and that's why we actually are going to really be talking about drawing down some of our lines of credit to start buying shares back and be really significant about it. Because at this point, we really have -- that potentially is our best investment. And I guess if it gets down to a low enough number, maybe it's a number I can actually afford. John, that's what you get for asking the question. Thank you, and thanks to everyone who joined our call today. While the market volatility may persist, we will remain focused on driving operational improvements across our portfolio, buying back our shares and finding exceptional investment opportunities and monetizing investments."
}