{
    "symbol": "FINV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 00:03:02",
    "content": " Our total transaction volume in the third quarter reached RMB 45.5 billion, representing sequential growth of 10% and year-over-year growth of 19%. With the completion of our business transition, our proportion of category A and B borrowers in the domestic market who meet our highest credit standards further expand to 75% of our total borrowers in the third quarter compared to 58% in the same period last year. In the third quarter, we served a total of 504,000 small business owners and facilitated RMB 11.3 billion of loans for this segment, representing 25% of total transaction volume, an increase of 43% from the same period last year. With stronger branding in the local market, our transition to better quality borrowers in Indonesia has outpaced our expectations with the proportion of better quality borrowers in the third quarter expanding to 68% from 62% in the previous quarter. Coupled with Indonesia's improving macro environment and an easing COVID-19 policy, this brought transaction volume in international markets to RMB 1.1 billion, representing a sequential increase of 22% and a year-over-year increase of 6%. The ongoing transition to better quality borrowers also helped us deepen our relationship with local funding partners, evidenced by an expansion in the proportion of loans they've facilitated to 48% in the third quarter compared to 39% in the previous quarter and in sharp contrast to 0 local funding in the same period last year. With a larger number of high-quality borrowers, coupled with our successful pricing transaction and advanced technologies, our founding partners are more willing to offer us attractive interest rates, evidenced by our funding cost improvement to 7.1% in the third quarter from 7.5% in the previous quarter. Driven by our  efforts to optimize our operations, effective execution of our overall strategy and the skillful deployment of our technological capabilities across business, our net revenues for the third quarter grew to around RMB 3 billion, up 18% year-over-year. Transaction volume in the third quarter reached RMB 1.1 billion, representing a sequential increase of 22% and concurrently, outstanding loan balance also reached RMB 640 million, representing a sequential increase of 33%. And in the third quarter, we have served a total of over 500,000 small business owners and facilitated loans amount of RMB 11.3 billion, contributing to around 25% of total transaction volume."
}