{
    "symbol": "WMB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 13:09:05",
    "content": "  Williams reported another great quarter, and John will walk through the details in a moment, but the punchline is that Williams delivered exceptional results in the third quarter with adjusted EBITDA up 15% compared to the same period last year, driven by strong performance across all of our core businesses and our JV upstream operations. Again, the third quarter built nicely on the strong start we've seen this year with 15% growth reflecting the combined effect of the performance of our core business and upside from our upstream joint ventures. So stepping now from last year's $4.152 billion to this year's $4.644 billion, starting with the $77 million of first quarter 2021 winter storm benefits that we're showing here in gray, and then moving to the $182 million contribution from our Midstream operations which were Wamsutter related in the first quarter of '22, and then begin to have a more significant Haynesville component in the second and third quarters. Our Transmission & Gulf of Mexico business has seen 4% growth year-to-date, driven by Transco's Leidy South expansion project and strong first quarter '22 seasonal revenues and also higher Gulf of Mexico results due to less hurricane-related impacts in '22 versus '21, partially offset by higher operating and maintenance costs. The Northeast G&P business has now seen 6% growth year-to-date, driven by higher rates on overall flat volumes, as previously discussed. The West has seen an impressive 27% growth year-to-date, driven by higher commodity base rates, but also a strong 11% overall volume growth, excluding the Trace acquisition. Finally, our Gas & NGL Marketing Services segment is up $32 million, driven by favorable commodity margins as well as the new contributions from the Sequent acquisition that closed on July 1, 2021, and the year-to-date comparison was also unfavorably impacted by lower cost or market adjustments on inventories as discussed in the third quarter comparison, which as we discussed, should result in higher margins in the future. We see multiple contributors to this expected strong finish to the year, including continued growth in our upstream joint ventures, but also growth across our other business segments versus our third quarter results. So again, with our expectations to finish 2022 near the high end of our adjusted EBITDA guidance, this would amount to over 13.5% growth versus 2021 and a four-year CAGR of about 8%, driven by continued growth in our core business as well as contributions from our Trace acquisition and upstream JV operations."
}