{
    "symbol": "WMB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 17:12:04",
    "content": " Our natural gas focused strategy continues to play out with strong fundamentals that are driving incremental growth opportunities particularly as we continue to see increasing demand for US LNG exports along the Transco corridor, as well we’ve seen domestic demand for power and industrial sectors continue to grow despite much higher natural gas prices, admittedly, it has been somewhat surprising to us how inelastic the challenge ahead to meet this higher cost of supply is the infrastructure to connect some of the world's lowest cost supplies to this burgeoning demand. So the upside that we have is really just from volume metrics, those with a pretty modest assumption on pricing for the balance of the year, so really the drivers, the primary driver for growth is first, our base business and segment the E&P in the Haynesville and that ramp up that is going very well at this point that did not contribute in the first quarter. And so we're being I would say a bit conservative about what we expect for the balance of the year, because we do think given the kind of growth that we're seeing in both the Haynesville and it's gearing up in the Marcellus and Utica that the workflows do, we can't very well on one hand, see the kind of prices to remain at these levels. I think we caught that at a great timing, and we had unique considerations that we had to offer Quantum and Rockcliff they're both in terms of access to LNG markets via our LEG and Transco systems as well as an interest in LEG with Quantum which was valuable to them so we will continue to look for those kind of unique opportunities as they pop up where we've got significant value that we can add between us and environs, so I wouldn't say we're not going to look at everything because probably will, but I think we'll remain fairly patient and picky about how we choose our points of growth. And we have some interconnect that we're increasing capacity to be honest, well, to put digital volumes and execution at Grover from those systems and so those will come online next year but in fact just been locked our capability to move gas out of the system and then taking advantage of latent capacity so they'll  pipeline so I would say we are seeing pretty excited growth coming into ’23 from definitely the rich side with the support of NGL and condensate prices that are tied to WTI. And we're really excited to see what that's going to mean for us both in terms of responding to this very strong pricing environment we have on gas and here in the near term, but as well the volumes and the cash margin that we'll get from the downstream assets in the longer term. And I think getting some clarification on that would really benefit our country and hopefully, set legislation in place that puts aside some of the ways that we continue to stand in our own way as a country and using our natural gas resource as both a powerful economic driver for us which, I think in the next year or so, we're going to wish we had as well as a powerful geopolitical tool, obviously."
}