{
    "symbol": "AP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 14:58:09",
    "content": " As shared in our recent press release, Ampco-Pittsburgh recorded a net income of $0.8 million in our third quarter of 2022, delivering an earnings per share of $0.04. Ampco's net sales for the third quarter of 2022 were $99.6 million, an increase of approximately 23% compared to net sales for the third quarter of 2021, led by 23% sales growth in the Forged and Cast Engineered Products segment which was driven by higher pricing, including surcharge revenues and higher shipments. Other income expense net improved overall for the third quarter of 2022, primarily due to higher foreign exchange transaction gains in addition to the timing of dividend income from one of the corporation's Chinese joint ventures. At the bottom line, the corporation reported net income attributable to Ampco-Pittsburgh of $0.8 million or $0.04 per diluted share for the third quarter of 2022 compared to a net loss of $1.6 million or $0.08 per diluted share for the third quarter of 2021. Capital expenditures for the third quarter of 2022 were $6.7 million and are $13 million year-to-date, primarily in the Forged and Cast Engineered Products segment. At September 30, 2022, the corporation's balance sheet and liquidity position included cash on hand of $12.2 million and undrawn availability on our revolving credit facility of approximately $35.6 million. During the quarter, the corporation closed on some key financing transactions that significantly improved our liquidity position and to provide future financing for the strategic modernization CapEx plan in our U.S. On August 30, 2022, our Air & Liquid segment completed a sale and leaseback transaction for its real estate at 2 plants in Virginia valued at $15.5 million, with a subsidiary of Store Capital, a major real estate investment trust. And we drew $4 million on it because we have incurred -- we've actually incurred more than that, but we're trying to manage our total interest cost and it's a nice way for us to manage liquidity going forward to seek reimbursements on the past progress payments kind of to maintain an even liquidity."
}