{
    "symbol": "AP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 14:52:08",
    "content": " Although, we again recorded a positive net earnings quarter, we were negatively impacted by the lag in product surcharge coverage in our Forged and Cast Engineered Products segment as well as supply chain delays in our Air & Liquid Systems segment. Ampco's net sales for the second quarter of 2022 were $102.6 million, an increase of 11% compared to net sales for the second quarter of 2021, led by 12% sales growth in the Forged and Cast Engineered Products segment, driven by higher pricing, including surcharge revenues and higher shipment volumes of forged engineered products to the oil and gas and steel distribution markets. The decrease primarily reflects the inflationary impact of higher operating costs in excess of recovery through product pricing and surcharges, and the impact of a $0.7 million reserve recorded for the refund of certain excess COVID-19 subsidies received in 2020, but to be returned in 2022. Air and Liquid Processing segment's operating results improved for the second quarter of 2022 compared to prior year, primarily due to improved mix and lower employee-related costs. Excluding the reserve for the excess COVID-19 subsidies, Ampco's non-GAAP adjusted income from operations was positive for the second quarter of 2022 and approximately comparable to the prior year quarter. Other income expense net benefited from higher foreign exchange transaction gains, but declined overall for the second quarter of 2022 when compared to the prior year quarter, primarily due to the timing of dividend income from one of the corporation's Chinese joint ventures. At the bottom line, the corporation reported net income attributable to Ampco-Pittsburgh of $0.4 million, or $0.02 per diluted share for the second quarter of 2022, compared to net income of $1.1 million or $0.05 per diluted share for the second quarter of 2021. Net cash flows used in operating activities was approximately $6.7 million for Q2 2022, due to an increase in trade working capital associated with the higher level of business activity and in the case of inventories, higher costs associated with inflation and supply chain disruptions. Capital expenditures for the second quarter of 2022 were $2.9 million and are now $6.3 million year-to-date, primarily in the Forged and Cast Engineered Products segment."
}