{
    "symbol": "AAPL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-10-27 19:46:03",
    "content": " We reached a September quarter revenue record of $90.1 billion, up 8% year-over-year despite over 600 basis points of negative foreign exchange impact, with new September quarter records in the Americas, Europe, Greater China and rest of Asia Pacific. Products revenue was $71 billion, up 9% over last year despite FX headwinds and a record for the September quarter. Our Services set a September quarter revenue record of $19.2 billion, up 5% over a year ago despite over 600 basis points of negative impact from foreign exchange. iPhone revenue grew 10% year-over-year to a September quarter record of $42.6 billion, despite significant foreign exchange headwinds. We set September quarter records in the vast majority of markets we track, and our performance was particularly impressive in several large emerging markets, with India setting a new all-time revenue record and Thailand, Vietnam, Indonesia and Mexico more than doubling year-over-year. Wearables, Home and Accessories revenue was $9.7 billion, growing 10% year-over-year, driven by the launch of Apple Watch and new AirPods Pro. Moving to Services, as I mentioned, we set a September quarter record in aggregate and in most geographic segments, generating $19.2 billion in revenue in spite of very large foreign exchange headwinds. This momentum helped us achieve over $78 billion in Services revenue during fiscal 2022, a new record and up 14% year-over-year. It was also a strong year for our enterprise business, as we set new annual records for iPhone, iPad and Mac during fiscal 2022 and grew strong double-digits year-over-year as our devices and services continue to help more-and-more companies empower their employees and serve their customers. Can we have the next question, please. Can we have our next question, please\n Yes, sir. Can we have our next question, please\n Yes, sir. Can we have the next question, please. Can we have the next question, please."
}