{
    "symbol": "AAPL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-07-28 21:11:05",
    "content": " Today, Apple is reporting another record June quarter with revenue of $83 billion, which was better than we expected despite supply constraints, strong foreign exchange headwinds and the impact of our business in Russia. Services revenue rose to $19.6 billion, a June quarter record and a 12% increase year-over-year, which was in line with our expectations. We set a June quarter revenue record of $83 billion, up 2% year-over-year despite supply constraints, over 300 basis points of foreign exchange headwinds and the impact of our business in Russia. Our Services set a June quarter revenue record of $19.6 billion, up 12% over a year ago, with all-time revenue records in the Americas and the rest of Asia Pacific and June quarter records in Europe and Greater China. We also achieved June quarter revenue records in each major Services category, including all-time revenue records for Music, Cloud Services, Apple Care and Payment Services. Our investment focus on Mac has helped drive significant growth in our installed base, which reached an all-time high during the June quarter as nearly half of the customers purchasing a Mac were new to the product. Wearables, Home and Accessories revenue was $8.1 billion, down 8% year-over-year as we faced foreign exchange headwinds, different launch timing for Home and Accessories products and supply constraints as well as the overall macroeconomic environment. Services had a June quarter revenue record of $19.6 billion, up 12% despite almost 500 basis points of FX headwinds as well as impacts from our business in Russia and the macroeconomic environment. We set June quarter revenue records in both developed and emerging markets and set all-time records in many countries around the world, including the U.S., Mexico, Brazil, Korea and India. The record level of performance of our Services portfolio during the June quarter reflects the strength of our ecosystem on many fronts: First, our installed base has continued to grow, reaching an all-time high across each geographic segment and major product category. Given the continued uncertainty around the world in the near term, we are not providing revenue guidance but we are sharing some directional insights based on the assumption that the macroeconomic outlook and COVID-related impacts to our business do not worsen from what we are projecting today for the current quarter. Overall, we believe our year-over-year revenue growth will accelerate during the September quarter compared to the June quarter despite approximately 600 basis points of negative year-over-year impact from foreign exchange."
}