{
    "symbol": "AAPL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-04-28 19:21:03",
    "content": " Apple is proud to report another record quarter, with a March quarter revenue record of $97.3 billion, up 9% from a year ago and better than we anticipated. iPhone, Mac and Wearables, Home and Accessories had their best ever March quarter and Services set an all-time record on the strength of subscription growth over the past year. In the March quarter, iPhone revenue grew 5% over the previous year despite a challenging compare as we saw strong demand from our customers for the iPhone 13 family. We are pleased to report very strong financial results for the March quarter during which we set a revenue record of $97.3 billion, up 9% year-over-year. On the product side, revenue was $77.5 billion, up 7% over a year ago and a March quarter record. Our Services set an all-time revenue record of $19.8 billion, up 17% over a year ago, with March quarter records in every geographic segment and services category. We generated over $220 billion in revenue growing 10% year-over-year and set all-time records for iPhone, Mac, Wearables Home and Accessories and Services. For Mac, revenue of $10.4 billion was a March quarter record despite supply constraints with 15% year-over-year growth, driven by strong demand for our M1-powered MacBook Pro. Customer response to our iPad lineup including our new M1-powered iPad Air, remains very strong and our installed base of iPads reached a new all-time high during the quarter, with over half of the customers purchasing an iPad during the quarter being new to the product. Wearables, Home and Accessories set a March quarter record of $8.8 billion, up 12% year-over-year. As I mentioned we reached an all-time revenue record of $19.8 billion, up 17%, with all-time records for the App Store, Music, Cloud Services and Apple Care and March quarter records for video, advertising and payment services. And really, it's those products that have powered the line and given us the overall results that we've had on iPhone, which for the first half the revenues were $120 billion and we feel very, very good about those results. We are looking at it from the lens of continuing to satisfy our customers, adding to the portfolio, improving the quality of the services and that has served us very well, because in the last 12 months, we've generated $75 billion of Services revenue."
}