{
    "symbol": "OC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:55:08",
    "content": " As we said very consistently, we were expecting inflation to continue to accelerate as we moved into 2022 and moved through the year, therefore what you’re kind of seeing in the composites business, at least in the first quarter, is you’ve probably got a slightly larger spread between pricing and inflation specifically on the contract side, just because of the inflation expectation that was built into the contracts themselves, so therefore margins are stronger. I think first, I’d start strategically - this sits very, very well with the enterprise strategy we outlined at our investor day last fall, where we want to expand into new building and construction material products and applications that really leverage our material science strength, our channel knowledge, our manufacturing and expertise, and this certainly fits inside of that and also supports the pivot, as Ken talked about, we continue to make in our composites business to expand into higher value, more capital efficient products that really benefit from our glass fiber technology, and that would be the WearDeck product. We continue to run on extended cycles in a lot of those product lines, so we think that that’s going to continue into the foreseeable future, and we talked about our Q2 guide of continued volume growth in both residential and the technical insulation side, so we’re seeing really good demand trends both in the U.S. market and the European market, so that is something that we think is going to continue into the near term. We’ve invested in Eloy and Nephi, two facilities that we think are going to create and give us great flexible, cost efficient manufacturing capabilities that we can kind of scale up and down with demand, so we think we’re in a really good position in terms of in the near term, the investments we’ve made to increase capacity, but over the long term creating a much more flexible, more cost effective network to adjust to any kind of demand variations in the market going forward. The third of the business that’s not tied to contracts, which is more driven by spot pricing, we’ve seen that be very strong even leading up to--you know, before we renegotiated contracts going into 2022, so there’s probably maybe a bit more sensitivity about that third of the business that’s not tied to contracts, but it has been strong and the demand for the products there as well across the board in composites has been very strong."
}