{
    "symbol": "MHO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 20:50:04",
    "content": " For the fourth quarter, our new contracts were down 44% compared to a year ago. And though down 18% from a year ago, this represents an approximate 60% sequential improvement over the average monthly sales we recorded during the last half of 2022. In our Southern region, which consists of 11 markets in Texas, Florida, North Carolina and Tennessee, our deliveries increased 4% over last year's fourth quarter, comprising 1,413 deliveries, or 59% of the total. Northern region, which consists of our other six markets located in Ohio, Indiana, Illinois, Michigan, and Minnesota, contributed 971 deliveries, which was an increase of 2% over last year's fourth quarter. Our new contracts were down 45% in October, down 51% in November and down 35% in December for a 44% decline in the quarter compared to last year's fourth quarter. As to our buyer profile, about 58% of our fourth quarter sales were to first-time buyers compared to 53% a year ago, and 64% of our fourth quarter sales were inventory homes compared to 45% in last year's fourth quarter. We delivered an all-time quarterly record 2,384 homes in the fourth quarter, delivering 53% of our backlog compared to 43% a year ago. And revenue increased 16% in the fourth quarter of this year, reaching an all-time quarterly record 1.2 billion. Our average closing price for the fourth quarter was 492,000, an 11% increase when compared to last year's fourth quarter average closing price of 443,000. Our fourth quarter and full year SG&A expenses as a percent of revenue were 9.1% and 9.8% of revenue, a 70 and 60 basis point improvement compared to the prior year, reflecting greater operating leverage and our lowest percentage ever. During the fourth quarter, we generated 196 million of EBITDA compared to 155 million in last year's fourth quarter. In the fourth quarter, our mortgage and title operations achieved pre-tax income of $9.7 million, down $1.1 million from 2021 and revenue of $22.6 million, down 1% over last year. 79% of the loans closed in the fourth quarter were conventional and 21% were FHA or VA compared to 81% and 19%, respectively, for 2021's same period. Our mortgage operation captured 77% of our business in the quarter, a decrease from 83% in 2021's fourth quarter."
}