{
    "symbol": "WDFC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-04-07 22:40:04",
    "content": " Today, we reported net sales of $130 million for the second quarter of fiscal year 2022, which was an increase of 16% compared to the same quarter last year. While we have work to do to restore our margin back to our target of 55%, I am happy to share with investors today that we reported net income of $19.5 million in the second quarter compared to $17.2 million in the same quarter last year, reflecting an increase of 13%. In the second quarter, sales of WD-40 Multi-Use Product increased 18% globally to $101.7 million. In the second quarter, sales of WD-40 Specialist increased 40% globally to $14.6 million. In the second quarter, sales of products included under this initiative decreased 9% globally to $13.7 million. Sales in the Americas, which include The United States, Latin America and Canada, were up 18% in the second quarter to $54.5 million compared to last year. Sales of our homecare and cleaning products in the Americas decreased 16% compared to last year, largely due to lower sales of 2,000 Flushes, Spot Shot and Lava. Now on to EMEA, sales in EMEA, which includes Europe, the Middle East, Africa and India, were up 9% in the second quarter to $54.1 million compared to last year. Sales in Asia-Pacific, which includes Australia, China and other countries in the Asia region, were up 34% in the second quarter to $21.4 million. In our Asia distributor market, sales were $9.8 million in the second quarter, up 64% compared to last year. In China, sales were $6.7 million in the second quarter, up 42% compared to last year driven primarily by successful promotional programs as well as the timing of customer orders related to price increases that went into effect in the second quarter. In Australia, sales were $5 million in the second quarter, down 5% compared to last year due primarily to decreased sales of homecare and cleaning products, which were down 10% compared to last year. In the second quarter, our cost of doing business was approximately 30% of net sales compared to 36% last year. You heard that sales of WD-40 Specialist were up 40% in the second quarter, and that we will be launching an eco-friendly new Specialist product later this calendar year."
}