{
    "symbol": "WDFC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-06 21:06:07",
    "content": " Today, we reported net sales of $134.7 million for the first quarter of fiscal year 2022, which was an increase of 8% compared to last year. As a result, net income for the first quarter was $18.6 million compared to $23.6 million in the first quarter of last fiscal year, a decrease of 21%. In the first quarter, sales of WD-40 Multi-Use Product increased 14% globally to $107.1 million. In the first quarter, sales of WD-40 Specialist decreased 5% globally to $12.5 million. In the first quarter, sales of products included under this initiative increased 12% globally to $15.1 million. Today, I'm happy to report total global sales growth of 8% for the quarter compared to the double-digit growth we experienced for most of fiscal year 2021, our sales results have softened a bit, but remember, we did not guide to the level of sales growth that we saw last year. Net sales in the Americas which includes the United States, Latin America and Canada, were up 4% in the first quarter to $56.3 million. Net sales in EMEA, which includes Europe, the Middle East, Africa and India, were up 5% in the first quarter to $57.5 million. Net sales in Asia Pacific, which includes Australia, China and other countries in the Asia region were up 54% in the first quarter to $20.9 million. In China, net sales were $6 million in the first quarter, up 69% compared to last year, driven primarily by successful promotional programs as well as the timing of customer orders. In our Asia distributor markets, net sales were $9.3 million in the first quarter, up 36% compared to last year. In Australia, net sales were $5.5 million in the first quarter, up 7% compared to last year, due primarily to increased sales of WD-40 Specialist, which were up 45% compared to last year. We continue to experience impressive growth for our flagship brand with global sales of WD-40 Multi-Use Product, up to 14% compared to last year. We've seen significant growth in priority markets like China, Mexico, India and Russia, where in the first quarter, sales of the blue and yellow can with a little red top increased by 79%, 58% and 30% and 14%, respectively. In the first quarter, sales of WD-40 Smart Straw and EZ-REACH, when combined, were $48.3 million, up 10% compared to last year. That being said, in the first quarter, we've seen a rebalancing of sales towards brick-and-mortar locations, some of the e-commerce sales were down 22% compared to last year. In the first quarter, our cost of doing business was approximately 32% of net sales, flat compared to last year. For the first quarter, 79% of our cost of doing business came from three areas: people costs or the investments we make in our tribe; the investments we make in marketing, advertising and promotion; as a percentage of sales, our A&P investment was 4.2% in the first quarter; and finally, the freight costs, to get our products to our customers. EBITDA was 19% of sales for the first quarter, which is down significantly compared to last year, primarily due to lower gross margins we reported."
}