{
    "symbol": "WDFC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-10-19 23:38:03",
    "content": " In fiscal year 2022, sales of WD-40 Multi-Use Product increased 8% globally to $399.4 million. In fiscal year 2022, sales of WD-40 Specialist increased 19% globally to $59.9 million. In fiscal year 2022, sales of products included in this initiative declined 11% globally to $59.5 million. Last quarter, we shared with you that market conditions suggested that for the full fiscal year, sales were likely to be in a range of between $519 million to $532 million, reflecting year-over-year growth of between 6% and 9%. Today, we reported net sales of $518.8 million for fiscal year 2022, up 6% over last fiscal year. For the fourth quarter, we reported net sales of $130.4 million, which reflects an increase of 13% over the fourth quarter of last year. Sales in the Americas, which includes the United States, Latin America and Canada were up 25% in the fourth quarter to $68 million. Maintenance product sales in Canada increased 41% or $1.3 million in the fourth quarter due to the timing of customer orders, the impact of price increases and successful promotional programs. Maintenance product sales in Latin America increased 80% or $5.4 million in the fourth quarter, resulting in the strongest sales quarter in the regionâ\u0080\u0099s history. On a constant currency basis, sales would have increased 10% over the fourth quarter last year. Sales in our EMEA direct markets, which accounted for 71% of the regionâ\u0080\u0099s sales in the fourth quarter, declined by 7% during the quarter to US$31 million. Changes in foreign currency exchange rates had an unfavorable impact on net sales for the fourth quarter. On a constant currency basis, sales would have increased 6% over the fourth quarter last year. Sales in our EMEA distributor markets, which accounted for 29% of the regionâ\u0080\u0099s sales in the fourth quarter increased by 7% during the quarter to US$12.6 million. Sales in Asia-Pacific, which includes Australia, China and other countries in the Asia region were up 18% in the fourth quarter to $18.8 million. In our Asia-Pacific distributor markets, sales were $9.5 million in the fourth quarter, up 64% compared to last year. In Australia, sales were $5.5 million in the fourth quarter, up 3% compared to last year. In China, sales were $3.8 million in the fourth quarter, down 21% compared to last year, driven primarily by the timing of customer orders in the industrial channel and decreased sales through the e-commerce channel. Changes in foreign currency exchange rates had an unfavorable impact on net sales for the fourth quarter. In fiscal year 2022, sales of WD-40 Smart Straw and EZ-REACH, when combined, grew 4% year-over-year, with growth across all three trade blocs and currently represent 47% of global sales of WD-40 Multi-Use Product. As additional capacity for Smart Straw Next Generation comes online, we will move closer to our objective for this Must-Win Battle, which is to grow sales of premiumized products to greater than 60% of WD-40 Multi-Use Product sales by the end of 2025, which represents a growth opportunity of approximately $140 million. In fiscal year 2022, global e-commerce sales were down 8% compared to last fiscal year, partially due to the continued rebalancing of sales towards brick-and-mortar locations. Price increases take time to embed their way into our results, but I am happy to share with you that gross margin was positively impacted in the fourth quarter by 810 basis points from sales price increases, which were implemented during fiscal 2022. EBITDA was 16% of net sales for the fourth quarter, which is up compared to the fourth quarter of last year, but lower than we would like to see."
}