{
    "symbol": "WDFC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-07-07 22:50:20",
    "content": " Today, we reported net sales of $123.7 million for the third quarter of fiscal 2022, which was a decrease of 9% compared to the same quarter last year. Although, WD-40 Multi-Use Product sales were down 11% to $92.3 million this quarter, we have seen strong growth in recent years as we inch closure towards our 2025 aspiration. In the third quarter, sales of WD-40 Specialist increased 12% globally to $16.7 million. In the third quarter, sales included under this initiative decreased 16% globally to $14.7 million. As Garry mentioned earlier, net sales were $123.7 million in the third quarter, down 9% or $12.7 million compared to the prior year. In addition, we experienced decreased demand for our products in certain regions in EMEA compared to the record sales we reported in the third quarter of last year. On a constant currency basis, net sales would have been $127.9 million in the third quarter, the 6% decline from the prior year. Sales in the Americas, which includes the United States, Latin America and Canada, were up 2% in the third quarter to $61.5 million compared to last year. In Latin America, we also experienced strong sales of WD-40 Multi-Use Product, which increased 16%, primarily due to the positive momentum in Mexico from the shift we made in 2020 from a distributor model to a direct market, as well as the price increases that went into effect earlier this fiscal year. Now on to EMEA, sales in EMEA which includes Europe, the Middle East, Africa and India were down 16% in the third quarter to $49.5 million compared to last year. In our EMEA distributor markets, we experienced a 21% decrease in sales of maintenance products primarily due to our suspension of sales in Russia, which resulted in decreased sales $3.6 million compared to last year. Sales in Asia-Pacific, which includes Australia, China and other countries in the Asia region, were down 28% in the third quarter to $12.8 million. In our Asia-Pacific distributor markets sales were $3.2 million in the third quarter, down 56% compared to last year. The severe lockdown measures also impacted China where sales were $3.3 million in the third quarter, down 25% compared to last year. In Australia, sales were $6.2 million in the third quarter, 4% compared to last year, due primarily to increased ongoing growth of our base business, increased promotional activities and price increases that went into effect in February. Despite these disruptions, market conditions suggest that for the full fiscal year, net sales are likely to be in a range between $519 million to $532 million, which reflects year-over-year growth of between 6% and 9%. In the third quarter, our cost of doing business was approximately 31% of net sales, compared to 32% last year. For the third quarter approximately 71% of our cost of doing business came from three areas, people costs or the investments we make in our tribe, the investments we make in marketing, advertising and promotion as a percent of net sales, our A&P investment was 4.9%, and finally, the freight cost to get our products to our customers."
}