{
    "symbol": "INSG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 20:20:21",
    "content": "  Operator: Hello, and welcome to Inseego Corp's First Quarter 2022 Financial Results Conference Call. After today's presentation, there will be an opportunity for analysts to ask questions. On the call today are Ashish Sharma, CEO, Bob Barbieri, Chief Financial Officer, and other members of the management team. These forward-looking statements are not historical facts, but rather are based on the Company's current expectations and beliefs. For a discussion on factors that could cause actual results to differ materially from the expectations, please refer to the risk factors described in our Form 10-K, 10-Q, and other SEC filings, which are available on our website. Thank you, operator and welcome to Inseego’s first quarter fiscal 2022 earnings call. Before I get into the details, I want to take a step back and reflect on where we are as a company in terms of our strategy and execution and share my vision for Inseego’s future. Our objective is to position Inseego as a key solutions provider for enterprises, which has taken a new sense of urgency in the last couple of years by the need for increasingly distributed enterprise workflows. We plan to address this through what we call a 5G edge cloud, which comprises three components. A highly flexible 5G WAN connection, anchored by Inseego’s world-class devices, a cloud networking software stack, allowing the creation of a 5G WAN and a purpose-built suite of enterprise applications. Inseego now has the most extensive and highest performing 5G products, both mobile broadband and fixed wireless in the market today. In addition to being offered by leading carriers around the world, we have created a great pipeline of enterprise customers in multiple regions, who are starting to roll out our 5G WAN solutions for many different used cases. We've also integrated into these products, a comprehensive software platform to provide a unified view for our customers, allowing them to fully manage these 5G WAN solutions. Then, introduce this to the market in the near future, our enterprise customers will be able to innovate at the edge and empower a more secure distributed workforce or branch locations or a 5G network fabric for the first time. Current enterprise WAN architectures are complex, highly fragmented, expensive to maintain, and dependent on costly on-premise appliances and brittle third-party integrations. We plan to offer this application suite as part of our 5G Edge cloud, as it has great synergy with the other two solution portfolios I described earlier. Since the sale of Ctrack South Africa unit, we've been busy modernizing the architecture of this application along with enabling 5G and integrating into our 5G Edge cloud. We see a huge opportunity to utilize this technology to digitize many facets of enterprise operations in verticals such as transportation, construction, logistics, supply chain, energy, utilities, services, local governments, and more. We will have more to say during our next call, but I'm really excited with the progress we've made and believe the improvements will help accelerate growth. In addition to selling our high performing hotspots, and FWA devices, carriers are also important go-to-market partners for our enterprise 5G solutions. First is what we call stock, where T Mobile buys our devices directly and sells them to their customers as part of our service package. The second is what we call sell with, where the T Mobile sales force brings us enterprise opportunities that we fulfill through the VAR and distributor channel. Ultimately, our carrier relationships will be an important driver of growth and profitability as you look to take share in what is still a nascent and rapidly growing market. With that, let's dive into the first quarter. First, I'm pleased to report that we are off to a good start in '22 with revenue growth of 23% year-over-year on a pro forma basis excluding Ctrack South Africa. Had it not been for minor supply chain issues that affected our enterprise business late in the quarter, our revenue would have exceeded street consensus. Reflecting our focus on next generation products and go-to-market expansion, 5G revenue was 142% year-over-year and comprised 44% of total revenue. Importantly, next generation software solutions represented 23% of total revenue in Q1. We continue to see lead times lengthening and with limited availability of parts in the spot markets and rising shipping cost, especially for our products with relatively short sales cycles. Although we were relatively unaffected in Q1, a prolonged lockdown in China may have more of an impact in Q2, particularly as it relates to our anticipated new product launches. I will now touch upon new customer expansions from this quarter, both on the carrier side and through our new enterprise initiatives. During the quarter, we launched a 5G solution with TELUS in Canada. In North America, our 5G products are certified by all the major carriers. We have a broad range of engagements with both carriers and enterprises, which we are very proud of. Our investments in our targeted international markets of Europe, Middle East and Australia are beginning to pay off after a couple of years of investment. We also want a new carrier customer in the Nordics, and we shipped the initial quantity of product to them recently. On the enterprise side, we saw good progress with new customer engagements for our 5G solutions in multiple regions. As I've stated in prior calls, we're still in the early stages of 5G adoption for the enterprise. While we may see the 5G icon on our mobile phones and conclude coverage is sufficient, the underlying infrastructure is still evolving with new mid band capacity, new 5G SA core network and carrier data plans to make 5G a primary event solution for the enterprises. Speaking of FWA, we are encouraged by the continued growth in our pipeline but more importantly, we are seeing several customers move to deploy our products broadly across their organizations. Thereafter they order 30 to 50 devices for small scale deployment before rolling out company wide, which in many cases required 1000s of Inseego devices. To ensure security and consistency, the customer is now using our cloud management solution so that their IT team can have visibility into the entire deployment, enabling them to manage, configure, and monitor the connections all from a single pane of glass. In the retail sector, we have a couple of U.S. based customers, laying the foundation for their own digital transformation leveraging our solutions for 5G connectivity across their stores to power a number of applications that require reliable real-time connections, such as surveillance. These customers one in the industrial supply sector with approximately 2000 stores and a nationwide clothing retailer with 800 stores respectively, have successfully completed all testing and are now starting widespread deployments. Finally, we're seeing an accelerated drive to close the digital divide, which is driven largely in part by the beauty of 5G being significantly easier and cheaper to deploy than fiber in many instances. But we have a robust 5G product portfolio and growing enterprise pipeline, we remain confident that Inseego is well-positioned to achieve our financial goals. After setting records in 2020 and 2021, the first quarter reflected the normalization of 4G as 5G becomes more widespread. And our current expectation is for several key partners to begin ramping during the summer, which will position us for a strong finish to the year. We've always planned on a strong back half of the year, but we also projected those data plans to be released a few months ago. And lastly is the supply chain, as we've said in previous quarters, we've not really experienced any meaningful supply chain issues on our existing products. However, we remain wary that ongoing supply chain challenges associated with COVID-related lock downs in China could impact our new product launches later in 2022. Note that, we measured this as a delay by matter of months, as opposed to multiple quarters or more. I would now like to turn the call over to Bob, who will provide more details on our Q1 results. Please note that all metrics and comparisons made are non-GAAP on a pro forma basis adjusted for the divestiture of Ctrack South Africa, which was completed in July 2021. Q1 revenue was $61.4 million, up 23% from the prior year. Our strong growth reflects rising demand for our 5G, mobile broadband and fixed wireless products and further uptake of our cloud solutions. Next generation solutions which are comprised of 5G devices, and all of our cloud software assets increased 68% over Q1 fiscal 2021 and represented 67% of total revenue in this quarter as compared to 43% of revenue in the year ago quarter. Our strong performance was again driven by demand for our 5G mobile hotspots from both our carrier partners and enterprises, partially offset by a decline in the sales of 4G devices. Enterprise SaaS solution revenue was 6.9 million, which was flat on a sequential and year-over-year basis. As Ashish noted, we're currently modernizing the architecture of our software assets and integrating them into our 5G Edge Cloud. Consolidated gross margin was 27.3%, up from 25.4% in Q4, but down from 31% in Q1 last year. Gross margin for the IoT and mobile business was 24.1%, down from 26.1 in the year ago period, but up almost 200 basis points from 22.2 in the prior quarter. The gross margin decline from last year reflects higher freight costs, while the improvement on a sequential basis was driven by a more favorable mix of device sales. Q1 non-GAAP net loss was 12.1 million or $0.11 per share, down from $0.08 per share in both the prior and year ago quarters. We reported an adjusted EBITDA loss of 3.3 million, which was down by 1.1 million and 2.1 million respectively, compared to Q1 last year and last quarter. For additional details on our non-GAAP and adjusted EBITDA results, please refer to the reconciliation tables in our press release. We note that our cash position benefited from the timing of some larger collections, which we expect to normalize this quarter, and therefore result in the uses of cash in Q2 that is more consistent with our recent historical run rate. Since taken over as CEO last quarter, I've had numerous conversations with our shareholders and the investment community. But as I said before, we believe these challenges will be measured in months, not quarters or years. In the coming months, the pieces will be put in place for mainstream adoption as the carriers evolve their 5G data plans and we move beyond the renewed COVID lockdowns. The first is, Ashish you mentioned the China lock downs could cause a bigger impact in 2Q. But it's just the overall global uncertainty, as that kicked in through to what's happening with COVID in Asia. So on the last quarter, maybe the last couple of quarters, you guys obviously talked about an outlook for 2022 for 25% year-over-year growth, obviously, that's sort of pro forma for the Ctrack South Africa sale. And could you help us think about the magnitude of a potential, when you finish the year, where do you think you'll be burning 10 million a year burning more or less than that something that we can kind of put some goalposts around those two things would be great. And as you know, the second point that I mentioned earlier in the remarks was the 5G data plans put in place by the leading carriers. So to me, this is more of a delay and if I were to talk about how you model it that I would just say you model it as a delay versus the demand leaving us or so anything like that. Second, certainly and a lot of these are bigger than any company, including the largest companies COVID supply chain shops and things like that, and some delays rolling up a 5G new plans. With those headwinds, the way we think about it now is we're seeing Q1 as a run rate. So all of our goals and aspirations, including the numbers you threw out, probably look to be reaffirmed in our next quarterly call and for that fiscal year, call it the end of Q2 to end of Q2 next year, because we really do -- just due to these global things with some of the technology giants have come in and suspended what they provided as guidance. I think, Bob, just my last question before I turn it on to the next person. And I may have missed the commentary, I'm actually referring to the release where you talked about the improvement in gross margin. Presumably you're referring to the non-GAAP basis versus Q4, which I think I went back and tried to do that calc, I think it was about a 200-basis point sequential improvement in gross margin on a non-GAAP basis. Well, so my question is, presumably, that was entirely driven by mix shift with supply chain offsetting, what would otherwise have been an even bigger improvement. And if so, I'm wondering if you could maybe try to quantify for us how much the supply chain cost you if it did cost you in terms of gross margin in the quarter. Second, I would say Q4 to Q1, our supply chain issues, both with freight and material costs were relatively the same. So I would say, we always try to take the opportunity particularly in this environment to make those changes, but it's not always possible, not for me certainly. Well, let me just add one thing, because I think it's relevant to your question, Lance. The second thing we're looking forward to as a company is greater penetration into the enterprise space that we think will bring additional margin enhancement, including some greater software attach, which even though it's a SaaS basis over time will bring certainly greater and higher margins over that extended rolling period of time. So look, first off, the majority of our product goes into enterprises. Well, we would like to do and it's kind of builds on what Lance asked earlier, is come back in Q2, with hopefully some version of a reaffirmation of what we were previously guiding. And ladies and gentlemen, this concludes our question-and-answer session, I would like to turn the conference back over to Ashish Sharma for closing remarks. We look forward to seeing you at upcoming investor conferences, including Stifel and Cowen in June, and updating you all next quarter on our continued progress."
}