{
    "symbol": "INSG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 18:48:05",
    "content": " The lower gross margin on a sequential basis was attributable to a significantly higher mix of hotspot revenue, which had lower contribution margin than we've seen of late due to higher component and distribution costs associated with the initial launch of our MiFi X Pro product. The change was largely due to the supply chain costs alluded to earlier and higher-than- anticipated levels of R&D this quarter, which included a one-time non-cash adjustment of $700,000 related to capitalized software expenses that incurred in prior periods and also higher certification costs that will abate as we now have completed a major product launch and obtained key certifications from our carrier partners. We note that our expectation for generating positive cash flow next year is predicated upon a steady ramp in our enterprise fixed wireless revenue and growth in our 5G carrier hotspot sales, offset by the anticipated decline in our 4G product sales. We continue to prioritize growth in our higher margin enterprise sales, which we believe will have a transformative impact on our business by increasing our mix of recurring revenue, expanding our margins, and ultimately, sustaining strong free cash flow over the long-term. And we did see an impact on our hard spot margins while the revenue increased this quarter, but we continue to see higher elevated supply chain cost, particularly given it was a brand-new product in the quarter from approval to launching it, we have to put everything on air. But still, like I said, like there was just too much hotspot revenue this quarter that shifted the margins downwards given in general, the margins and hotspots are quite lower compared to the FWA enterprise margins. And number three, and the most important one is, we are seeing a lot of traction in our enterprise FWA business, with already this year, we have signed up hundreds of new customers with higher margin revenue. One, positive that our enterprise FWA business grew quite a bit at the end of this quarter, and it's now 13% of overall revenue, and that's all very high margin revenue, 40-plus percent margins on that."
}