{
    "symbol": "GDS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-23 14:28:06",
    "content": " Leading today's call is Mr. William Huang, GDS Founder, Chairman and CEO, who will provide an overview of our business strategy and performance; Mr. Dan Newman, GDS CFO, will then review the financial and operating results; Ms. Jamie Khoo, our COO, is also available to answer questions. Before we continue, please note that today's discussion will contain forward-looking statements made under the Safe Harbor provisions of the US Private Securities Litigation Reform Act of 1995. As such, the company's results may be materially different from the views expressed today. Please also note that GDS earnings press release and this conference call, includes discussions of unaudited GAAP financial information as well as unaudited non-GAAP financial measures. For the companies in China, it's an extremely challenging year, especially the tech sector. Our customer and impacted -- are impacted by this economic slowdown, the COVID lockdown and supply chain shortage. Despite the challenges, we are still delivering solid result, growing revenue by 24% and adjusted EBITDA by 18% in the second quarter. And at the same time, we continue to make significant progress in the execution our growth strategy by further developing our customer franchise as demand diversified across the cloud, internet and enterprise verticals. Even in a softer demand environment, there are still significant new business opportunities. As a result of our customer targeting and market presence, we are well placed to compete. The first came from a global car customer, who we are already serving in Mainland China. As a result of this deal, we are -- we now have the largest global cloud and the largest China cloud as our anchor customers in Hong Kong 1, which is quite an achievement. During the first half of this year, our new bookings was 31,000 square meters. For the full year, we are confident of achieving 70,000 square meters of net additional area committed. Going forward, we still target 80,000 square meter and -- to 90,000 square meters of annual new bookings. However, within this number, we expect a change in the next week, perhaps 15% to 20% coming from our regional business. GDS business is focused on Tier 1 markets, which were -- was affected by lockdown. Nonetheless, we still achieved over 13,000 square meters of net additional area utilized in the in the second quarter. Based on feedback from our customers, we expect move-in to continue at a similar level for the next few quarters. We have the large backlog totaling 240,000 square meters which underpins our multiyear growth. To adjust to the current slow -- slower environment, we have scaled down our capacity delivery schedule. In the first half of 2022, we brought 16,500 square meters of capacity into service. In the second half, we plan to bring another 31,000 square meters into service. As compare that with our original plan for FY '22, we have pushed back nearly 39,000 square meters of completions into next year and beyond. Our home market customers are putting increased emphasis on international expansion, particularly in Southeast Asia. In Hong Kong, we have accomplished the difficult task of establishing a 5-year pipeline of purpose-built data center capacity  in prime location. It is almost sold out with learning Chinese and the global customers, we are now working up anchor customers orders for Hong Kong 2. In Southeast Asia, we have secured a hyperscale capacity at campuses in  Indonesia. With demand from Chinese and global customers, Southeast Asia is one of the fastest growing data center market in the world. We believe that our regional business including Hong Kong will become a second growth engine for GDS, alongside Mainland China. As part of today's earnings release, we announced the formation of RMB6.7 billion equivalent to US$1 billion Mainland China data center fund. To finish up, we have been through difficult times and the cycle -- cycles in the past year -- in the past. The challenges that we are experiencing now are for short-term, while data center industry is for long-term. During this time of uncertainty, we continue to build up our position by expanding our customer base and enhancing our market presence both in and outside of China. In 2Q '22, our service revenue grew by 2.6% and underlying adjusted EBITDA grew by 0.2%. Net additional area utilized during 2Q '22 was 13,659 square meters. Around 8,300 square meters was in Tier 1 markets affected by lockdowns, and the remaining 5,300 square meters was from B-O-T projects in unaffected remote areas. In the second half of 2022, we expect a similar level of move-in as we saw during the first half. Monthly service revenue per square meter was RMB2,265, down by 1.4% compared to the previous quarter. However, for FY '22 as a whole, we still expect MSR to decline by around 4% to 5% year-on-year in line with our original expectations. Turning to Slide 16, our underlying adjusted gross profit margin was 50.9% for 2Q '22 compared to 52.4% in the previous quarter. Furthermore, power tariffs are now up the maximum permitted 20% across our Tier 1 markets. In 2Q '22, utility costs was 30% of service revenue compared with 28.3% in 1Q '22 and 26.9% in 2Q '21. Therefore, we expect the combined effect of higher power consumption and higher power tariffs to continue being a drag on our margins in the second half of the year. We think about our CapEx in three parts, Mainland China organic, acquisitions and regional expansion. For Mainland China organic, we spent RMB2.7 billion in the first half of 2022 out of our full year budget of RMB6 billion. However, while CapEx is generally linked to capacity expansion, there is a significant portion that has to be front ended the installation of power infrastructure at new campuses. Accordingly, it will take time for our Mainland China organic CapEx to come down. For acquisitions, in the first half of 2022, we paid just over RMB3 billion of consideration. For regional expansion, which includes Hong Kong and Macau, as well as Southeast Asia, we spent just over RMB1 billion in the first half out of our original full year budget of RMB2 billion. Regional CapEx is likely to step up by several billion next year, given the expected new business wins. For the whole of 2022, we will most likely still hit our original CapEx guidance of RMB12 billion before taking account of any potential capital recycling through the data center fund. Turning to how we fund this CapEx, we think it makes sense to take a different approach for our regional business and our Mainland China business. Accordingly, we have set up an international holding company under GDS Holdings to hold all of our projects outside of Mainland China. As a first step, we intend offering a small minority stake to private equity investors who we believe can add value. For our business in Mainland China, excluding acquisitions, our objective is to become self financing within a few years. With buildup in operating cash flow, as more data centers reach stabilization and substantial front end CapEx already incurred, the gap to free cash flow breakeven is narrowing down. In order to enhance our access to capital, which is a competitive advantage in uncertain times, we've been considering structures which enable us to bring in outside equity investors at the project level in Mainland China. Further to this strategy, we recently entered into a Framework Agreement with an investor which is a sovereign wealth fund for the formation of our first offshore Mainland China data center fund. As envisaged by the Framework Agreement, the fund will have RMB6.7 billion equivalent to US$1 billion of committed capital, with 70% coming from the investor and 30% from GDS. The investment objective of the fund is to acquire data centers in Mainland China, either from our own portfolio, or from third parties through M&A transactions. This will allow us to recycle capital and accelerate monetization, while maintaining our recurring income model with management fees. Meanwhile, we're also in discussions with some domestic financial institutions about an onshore version of this fund structure. At the end of 2Q '22, we have RMB9.2 billion or US$1.4 billion of cash on our balance sheet. Our in service portfolio, which is 96% committed and 68% utilized, has a net debt LQA adjusted gross profit ratio of 4.2x. For this part of the portfolio, we believe that it makes more sense to look at the ratio of net debt to fixed assets, which is a reasonable 53%. Once we have completed the regional equity capital raise and some capital recycling through the fund, we expect our consolidated leverage to come down. Against this, we had total area committed by customers of 588,000 square meters. Assuming that we had delivered all the backlog and fell out remaining inventory, our area utilized or revenue generating capacity would increase by around 90%. On top of our existing projects, we have secured another 457,000 square meters of pipeline held for future development. Its land and buildings with project approvals and energy quota predominantly in Tier 1 markets, which we believe is a very valuable asset. After evaluating the impact of COVID lock downs and slow economic growth, we are revising our original guidance for 2022 revenue and adjusted EBITDA. Our CapEx guidance at around RMB12 billion remains unchanged, but could be lower if we inject any data centers into the fund by year-end. Your line is open. Thanks for taking the questions. And then second question is, in the U.S. we've seen over the years kind of decline in returns for build-to-suit type deals. It includes acquiring data center projects from GDS at all stages of development, and also acquiring data centers from third parties through M&A transactions, which where the fund would be the direct buyer, rather than buying from GDS. Having said that, from our perspective, for the first phase, we're focused on injecting a small number of projects from our own portfolio in order to hit a certain level of capital recycling. We're looking at something like US$300 million to US$500 million in terms of injection equity value in existing state either by the end of this year, or if not by the end of this year, by the end of the first quarter. Certainly, very welcome to have this fund to give us a reserve of capital for third-party M&A, which of course we did not have before. Second question, William about our appetite for B-O-T type projects in remote areas. I think we did -- historically we did a lot of , which we think retains quite a bit, right. But in the last 2 years, I think that we rejected a couple of the deal. So I think we are -- we still  do the business, which we think is suitable. Your line is open. I have also two questions, if it's okay. The first one is regarding your overseas business in the ASEAN markets, especially with Malaysia and Indonesia. And also, I believe previously, our strategy in ASEAN is more to go out with our domestic customers. I think the number one -- how we look at it as being , we still maintain our strategy in the Tier 1 markets, right. But we know -- we understand that Singapore market is the most attractive market in Southeast Asia, in the world. If I remember, I mean, the simple data center market is represented almost 50% of total Southeast Asia. But the situation is in last 2 years Singapore government stopped to allocate power, right. So that means if you look at it Singapore market, the demand is very strong from the global multinational, even from China. So if you look at next 3 years, in Singapore there's very, very limited supply, almost zero in next 3 years, but demand still there. It's not only from China, it's also from the global. I think GDS has become a -- we have it after 20 years, we build up our very, very  capability to do the data center business. Number one, I think we are more familiar with the customer. So, in terms of the -- to build our market presence, I think we are always -- we have to maintain the first mover in this region. We always take first mover advantage, which I think this is our strength. These are all -- these are projects which are under construction, maybe a small part is in service partly pre-committed. And at least save 3 years away from being complete and fully stabilized, at least based on our current projections. So from a financial perspective, these are projects where we've already invested considerable sums of money. And it feels like maybe the public equity markets or value these situations, they probably don't value our Southeast Asian business either. After the  projects, as I said before out there, we're open minded we may do other kinds of projects, but that was our thinking for the first phase. I think  as in a position to very practical to access the different capital and  as can more flexible, do more valuable business and acquisition as well. Your line is open. Thanks for taking the questions. I will first touch old target rich, I think that's a good way of putting it. Yes, we -- in the past, we were very focused on building up our resource pipeline. Now, we don't see that any particular acquisitions missed -- its obvious to us whether they make -- whether there'll be a very strong strategic rationale, but therefore there has to be a strong financial rationale. It has to be highly accretive to  so much about what is the market multiple, it's what makes financial sense to us. And that's why we take a disciplined approach and wait to see those opportunities, which do satisfy our financial natural criteria. For Indonesia and Malaysia, I don't think we have to wait for revenue to move the needle. Bora, I think the -- I think probably apparent to many investors that we've already created value with what we've done, maybe when we do the regional equity capital raising and put a value on the business that will illuminate a number for investors. Also, when we have some -- when we're able to announce some significant business wins, which is not very long now before we're able to do that. So two business wins and regional capital raising, I think, yes, I would hope that moves the needle in the next few months or a couple of quarters at the most. Yes, I think our business target â\u0080¦\n Yes, Bora, I think -- yes. I think we are -- we have the ambition to do more business globally, right. So because we are -- we absolutely maintain the strongest position in China already, right. So I think our step is to, number one, is Hong Kong, which we did, and we are well-positioned. Number two is Southeast Asia, which we think the -- it's good timing to step in. But we -- in the meanwhile, we're also looking at other Asia market. In China M&A target, I think that the effect is that in China M&A target is getting more I think. But the question is with your  we are -- we have a lot of patience, because we tried to create value for our shareholders. So now I think they are still in the transition that the seller along with the data center owner, this started to lower their expectation which we think is not -- still not meet our expectation. Your line is open. I think China market demand obviously in this year has slowed down, right. So I think the -- but another angle is the USC, the  active and the demand is shifting. It's shifting from the traditional cloud service providers to I think the big, very clear Chinese , it's happened in the last couple of quarters already. So I think the -- so that's why we -- if you look at in the last two or three quarter, even this quarter, our internet  order from the internet and enterprise is getting bigger and bigger, right. We are well-positioned on that, because we have a very broad customer base build on that for 20 years. But I think this is not a takeover or the like Alibaba, Tencent's market share. I think the -- a lot of the cloud service provided, they have a different way to calculate it, the cloud revenue. Literally on the expected return to the fund actually, the fund will look at projects on a individual project basis. And so the expected return is not for the fund as a whole, it's for individual project investments. But I would just highlight that, from our point of view, structuring the fund, it was critical importance that we maintained our management role. I didn't mean just as fund manager, I mean as data center manager. And so, the projects that go into the fund will carry with them our long-term management contract from which we will generate fee income, which is -- which if it works out as we expect, it will give us a profit share of the project. So, the fund investor, we will sell to the fund at a -- at an equity valuation and then reinvest best in the fund at that valuation alongside the investment. Of course, we would get an enhanced return from our participation in the fund plus the management fee profits. I think they  they slowed down, not means the market slowed down in the same way, right. They build it back by their own private  is already happening in a few quarters, maybe in a few years, in 1 or 2 years. Your line is open. Yes, so Frank, we will sell to the fund 100% of the equity, which we own in each project. Having executed the sale of 100% to the fund, we will take 30% of the sale proceeds and reinvest that into the fund. So in effect, this is releasing 70% of our equity in the projects at a valuation plus having a continuing 30% investment with the management fee income. So for a $1 billion fund, which is what we've been sized at and for fund one. I mean, we would have no difficulty allocating just from our own portfolio if that's what we chose to do. But it really does depend for now, we're just focused on this initial batch of  projects that these -- hopeful of establishing this mechanism and recycle a certain amount of capital. We've selected projects that, I mean, if we go ahead with these projects that won't be stabilized based on our existing projections until the fourth quarter of 2025 or the first quarter of 2026. That means over the next 3 years, there is a ramp up of EBITDA. I don't think it --  will impact our future EBITDA, because based on our strengthening of financial position. Your line is open. And these are -- just emphasize, and it is all based on existing business plans is not like a guidance, right. But I said was that our China organic CapEx, which is around RMB6 billion this year, probably come down by 1 billion or 2 billion next year. And our regional CapEx, which will be about RMB2 billion this year. When we talked about raising capital, it's true the international Holdco for the regional expansion. But you'll see with that level of CapEx RMB4 billion, we're going to need around US$200 to US$300 million of equity to see us through the next 18 months also. As there are no further questions, I would like to now turn the call back over to the company for closing remarks."
}