{
    "symbol": "SJM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-01 12:04:12",
    "content": " Your line is now live. I would highlight couple of our previous comments on our more recent calls that we have become more efficient in our spend and we have been able to get better bang for our buck on our marketing spend and also just the fact that there has been so much inflation makes the percent of sales look lower or lower but in terms of what we're committed to we did have a little bit of a down quarter but I want to be very clear with all of the, our investors that we are committed to maintaining the momentum, we've had great, over two-thirds of our brands continue to grow or maintain share and so our strategy clearly is working, shifting our resources to the highest growth opportunities and in this inflationary environment is really only so much you can spend, but rest assured that we are committed and we will continue to support our brands now and ongoing. Your line is now live. With respect to the guidance at the bottom line, taking the midpoint of our previous guidance range of $8.55, we over delivered the third quarter by approximately $0.25 that was primarily due to SD&A expenses and some timing of marketing from the third quarter into the fourth quarter, then we are essentially giving back $0.30 in our fourth quarter, of that is $0.05 due to divestiture, $0.20 due to incremental cost inflation which is impacting gross profit dollars of about $30 million primarily within our pet portfolio, and then lastly, is a $0.05 impact to additional SG&A expenses in the fourth quarter, some of that is timing coming out of the third into the fourth as I have previously noted. Your line is now live. Your line is now live. Your line is now live. Your line is now live. But what we need to do is continue to take the necessary actions to ensure stability within the supply chain, to ensure that we are recovering the cost inflation either through pricing actions or productivity savings and thinking about advancing the ongoing momentum of our business inclusive of at-home consumption and the growth or return to growth of our Away From Home business and then underpinning all of that, we will continue to make strategic investments in the business to support our coffee, pet and consumer portfolios. Your line is now live. Your line is now live. What we would envision in our fourth quarter is as we are taking into account the pricing actions that we have taken throughout our fiscal year and the impact to Q4, we have also acknowledged the underlying momentum of the business and we have accounted for the impact of price elasticity of demand by taking material pricing against material inflation. Your line is now live."
}