{
    "symbol": "MYNA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-10-31 18:00:04",
    "content": " Welcome, everyone, to Mynaricâ\u0080\u0099s first half 2022 results conference call and webcast. Prior to today's call, we released our first half 2022 results as part of our first half 2022 management report, which is available for download on the Investor Relations section of mynaric.com. Before we begin todayâ\u0080\u0099s formal presentation, I must remind you that this presentation and oral statements regarding the subject of this presentation include forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 as amended. These forward-looking statements involve known and unknown risks, uncertainties and assumptions that are difficult to predict or are beyond our control and actual results may differ materially from those expected or implied as forward-looking statements. With that out of the way, we have a great agenda for you today, including an update on our vision and strategy, most of our success highlights, a discussion of our first half 2022 financial results and our outlook for the remainder of 2022. On the call today are Mynaricâ\u0080\u0099s CEO, Bulent Altan; and Mynaricâ\u0080\u0099s CFO, Stefan Berndt-Von Bulow. With that, it's my pleasure to turn the call over to Bulent for his opening remarks. Mynaric reported solid results for the first half of 2022, as we're prepared for significantly higher production levels later this year, next year and into 2024. At the Analyst Day back in April, I spoke about growth and momentum, and this continues through today. We also remain disciplined in our investment strategy to support the future growth of the business, and our pipeline of opportunities remains the highest in our industry. Over the past two years, we invested and hired to ready the company for serial production, and we no longer need substantial investments in capability and capacity. We are now focused on continuing to improve our operational excellence and the improvements we have implemented over the past year in our product design have allowed us to now have the capacity in place in order to fulfill our medium-term goal of producing 2,000 terminals per year. We are not only a space company or an aerospace company, we are a critical communication systems company with products that are produced at scale to serve many end markets, including government and commercial customers. We do this by making what has previously been a one-off highly tailored solution market into a scalable volume production market through serial production, the higher reliability and simplicity, greater affordability and increased standardization of our product. Before I turn the call over to Stefan for a more detailed look at our results, I want to highlight a few customer successes we've had since we last spoke with you all. First, we've recently won an additional order from Northrop Grumman in support of the Space Development Agency's tracking layer program. For those unfamiliar with the SDA program, these programs will support critical government defense efforts, their budget dollars have already been allocated and deployment schedules are relatively set at this point, which gives us great visibility on our forward delivery commitments, revenue and cash flow. In addition, these are selected by DARPA, the U.S. Defense Advanced Research Projects Agency for Phase 1 of their space bacon program, which aims to develop a low-cost, high-speed reconfigurable optical data links to connect various low-earth orbit constellation. In July, we signed agreements with L3Harris for increased future collaboration and L3Harris invested â\u0082¬11.2 million for a 7.2% stake in Mynaric. This is a significant validation for Mynaric, as L3Harris is now not only a customer, but also a strategically aligned partner for us, and we see this developing into future program activity across all domains, including airborne, space, maritime and ground. As we have said for some time, the government market is ahead of the broader commercial market and its shift towards optical data links, but the commercial market is poised to catch up quickly. For example, we know there are a number of major commercial constellation operators making key supplier decisions over the next six to 12 months, as they look to deploy these constellations starting in 2024 and the subsequent years. I could not be more excited by the market opportunity in front of us, and I believe we have the right team to capitalize on this opportunity. First, let's turn to the two key business metrics we introduced at the Analyst Day in April, that we believe will continue to best demonstrate the momentum we are seeing in the business. First, cash-in from customer contracts. In a sense, this is pre-revenue cash received, and we believe a very significant indicator of the future revenue of the company. For the half year period, cash-in from customer contracts, was more than â\u0082¬8.3 million as of the end of the period, compared to â\u0082¬1.9 million for the comparable period of last year. Since the end of the half year, our cash-in from customer contracts has continued to increase and is now at more than â\u0082¬11 million. By comparison, two years ago, we had virtually no cash interim customer contracts. Second, optical communication terminal backlog in units as of today is 243 units. As of today, we still include 15 units attributable to SpaceLink and the backlog pending final notification from the company. Including this adjustment, our guidance of 2022 remains unchanged and healthy given our terminal backlog is more than 90% related to government-funded contracts. Looking at a few other figures, revenue was â\u0082¬25,000 in the first half of 2022, and represent only product leasing revenues that we were negatively impacted by supply chain challenges, which delay HAWK shipments and push-outs in customer delivery schedules. Our current contractual committed optical communication terminal backlog, primarily consistent of CONDOR Mk3 product, mostly for these scheduled shipment, primarily in 2023 and 2024. We expected our capability across â\u0080\u0093 we expanded our capability across all divisions of the company this year, and will continue to do through the remainder of 2022. However, we expect pace of the headcount expansion will slow somewhat over the coming months and into the first half of 2023, as we look to align our headcount needs with the program we have been awarded. Overall, the company reported an operational loss of â\u0082¬34.9 million, as we continue to make necessary investments in people, equipment and systems in preparation for strong shipment growth in 2023 and beyond. Our cash balance at the end of June was more than â\u0082¬25 million, compared to â\u0082¬18 million at the half year 2021. Not included in this figure is the early July investment by one of our key customers, L3Harris, who invested more than â\u0082¬11 million in exchange of our 7.2 percentage stake in Mynaric. In 2022, we remained in the investment mode and as a pre-breakeven company we expect our cash balance to decline further through the end of this year. Inventories were â\u0082¬13.4 million, up from â\u0082¬8.4 million at the end of the last year, as we continue to invest in components inventory ahead of the expected ramp in communication terminal production we see next year. Property, plant and equipment at the end of the period was â\u0082¬21 million, compared to approximately â\u0082¬17 million at year-end. We invested â\u0082¬6.4 million in property, plant and equipment this half year, as compared to â\u0082¬3.5 million in the year-ago period. As Bulent spoke of earlier, through the combination of our previous investment and a major breakthrough in the main production truck driver, our tenant pulp , we were able to arrive at our 2,000 unit medium-term capacity goal in our manufacturing. Through additional automation, Mynaric is now able to utilize our manufacturing capacity with minimal amount of factory employees up on order arrival. As a result of all these breakthroughs and improvement, we see our future capital investment needs for our production capacity lower relative to historical levels. As noted earlier, we are well on our way to achieving the goal based on the year-to-date cash income customer contracts. We expect our year-end 2022 optical communication terminal backlog to exceed 250 units, which we recently increased from our previous guidance of 220 units. There are a number of opportunities that potentially could close by year-end, and our team remains well positioned to capture this. When we talk about growth and momentum, we are talking about strong growth in our order backlog and our cash in from customer contracts. At two recent conferences, World Satellite Business Week and the International Astronautical Congress, the buzz was all about laser communications. The recent announcements from large consumer brands and communication service providers, such as Apple, Starling, T-Mobile, Huawei and others, all demonstrate the long-term need for interconnected satellites and laser communication is what will enable all these constellations to achieve their goals of ubiquitous connectivity. As many of you listening today now, I've been in the space industry for two decades. I've seen what growth of this magnitude looks like, and more importantly, what it takes to capitalize on that growth. In order to do that, you must have a great team, and we have put together a great leadership team that is driving execution in order to capitalize on the multi-decade opportunity ahead of us, as we enable the Internet above the cloud. In August, we added a key executive, Mustafa Veziroglu as our new President of Mynaric. We've also added considerable talent over the past six months to our engineering and product development, sales and communications and administrative teams on a global basis. We believe now is the time to capitalize on the opportunity ahead of us, and we made the right investments ahead of the growth, so we can now accelerate our momentum, and we are only getting started capitalizing on the investments we've already made. On the host side, yes, the supply chain is something we looked over -- quite a bit over the last year. And what we saw there wasn't the supply chain issue that we see across the industry, rather an obsolescence issue that we are working through in our design, which is something to expect, and we are well-equipped to do so. You mentioned some of the commercial opportunities that could be decided in near-term, and you saw some good orders in the quarter from Northrop. I think engaging with our potential commercial customers, we see a good respect for the amount of capability we have built within the company and the fact that we can produce at scale. The commercial opportunities we all know about have been to a certain extent, hit by the current invasion of Russia in Ukraine, and therefore, the resulting unavailability of Russian rockets to Western constellations. So the investment we have already made and the capacity they already have put together is giving them a lot of confidence in the fact that with miner, they would not be facing an execution. First of all, on the launch of the CONDOR to space, we do not expect that to take place this year as our customers have many different challenges that they are facing. And we expect them to solve them soon, but I don't expect the launch to be this year. On the HAWK side, yes, we have built quite a handful of HAWKs already before the parts became unavailable that we are talking about and for which we did a redesign. So, yes, our manufacturing capability is exactly with the investment that we have already made at 2,000 units, there is few last items coming in -- that are coming in over the next few weeks and months. And as you said, there is a certain amount of uptick to meet the customer demands that may come. I think overall, today, we have just -- as Stefan said, a little bit more than 250 terminals to build, I think this is given the factory capacity a fraction of what we can build. It would be a handful, if anything, because as also Stefan alluded to, we have multiple technical breakthroughs that happened over this last year that allow the easier build of the terminals with quite a few less machining and integration operations necessary. Yes, L3Harris, I think, it's a fantastic partner to be had for our company. If you look at the non-space market, if you look into the aviation market, the maritime market, the ground market or what have you that really requires this type of technology that is felt that is high bandwidth that is low probability of interference or detection, I think that level of partnership is tremendously valued. So we would hope for an uptick in the amount of markets we can address as we are a good technology partner for them, and they are a good, I want to say, integration and also after sales support experts across all these markets. And I think, Stephan, its I think, very useful, I think, to reiterate here that Mynaric has been doing quite a bit of investments to bring in the bigger cost drivers in-house, such as the telescope of the terminal that allows us to control costs. And as Stephan alluded to, all of these are done in the Eurozone where all our -- almost all our contracts are in the dollar side. And then secondly, for the execution of these contracts, we have gone into long-term purchase agreements with most of our cost drivers. Thank you, everyone, who joined us today and for your interest in Mynaric."
}