{
    "symbol": "TREX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 23:05:12",
    "content": " Our sales growth reflected an increase in Trex Residential net sales driven by pricing actions taken in 2021 and 2022, volume growth that continues to reflect strong secular trends in the outdoor living category, continued execution of our wood-to-composite market strategy share conversion, and channel inventory built to support historically high growth rates. The channel inventory build was due in part to expected consumer demand along the lines of what was seen in 2020 and 2021, but also was a consequence of improved product availability following more than 2 years of capacity constraints and product allocations. Second quarter net sales increased 24% to $386 million, driven by 25% growth in net sales at Trex Residential to $374 million. Consolidated gross margin of 40.7% expanded 270 basis points year-over-year driven primarily by price realization at Trex Residential, increased capacity utilization and our continuing focus on cost reduction measures, offset by continued inflationary pressures on raw materials, labor and transportation. Even as we strategically increased our branding and marketing spend, SG&A expenses of $40 million decreased 160 basis points to 10.2% as a percentage of net sales compared to 11.8% in the 2021 quarter as a result of a reduction in accrued incentives and improved operating leverage driven by our double-digit revenue growth. Net income for the 2022 second quarter was $89 million or $0.79 per diluted share, representing increases of 45% and 49% respectively, from net income of $61 million or $0.53 per diluted share in the year ago quarter. We're expecting that this inventory rebalancing given the magnitude of what we're talking about dollar-wise, and we've already had meetings with our distributors, that we expect inventory to get back to -- what I would say, is going to be very low levels, it will be lower than where we were going into the inventory build from last year as our distributors want to be conservative. And if you add $200 million to your guidance for the back half of this year, you're coming up with a little bit of growth, maybe 5% to 10% end market growth, maybe going out the door at the dealers and at the end consumer."
}