{
    "symbol": "TREX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 23:29:02",
    "content": " We are pleased with our strong first quarter performance results, led by a robust 40% increase in Trex Residential sales, reflecting double-digit increases in both volume and pricing. We had a very strong start to the year with first quarter sales rising 38% to $339 million, driven by a 40% growth in net sales at Trex Residential. SG&A expenses as a percentage of sales decreased by 100 basis points to 11.8% as a result of improved operating leverage supported by strong top line growth and more than offset increased promotional spend for our new At Trex, We See It Too branding campaign. Net income for the 2022 first quarter was $71 million or $0.62 per diluted share, representing increases of 47% and 48%, respectively, from net income of $49 million or $0.42 per diluted share in the year ago quarter. EBITDA increased 49% to $105 million, with EBITDA margins strengthening to 31.1% compared to 28.9% in the first quarter of 2021. Given our strong cash flow, our confidence in the company's long-term growth prospects and our belief that Trex shares represent a compelling value, we repurchase 833,963 shares of our outstanding common stock for $75 million in the first quarter. Second quarter consolidated net sales are expected to range from $375 million to $385 million, representing year-on-year growth of 22% at the midpoint. To sum up, our first quarter performance has set the stage for a year of strong double digit revenue growth in 2022 and reflects our continued ability to provide the consumer with a broad range of product choices and deliver meaningful and measurable value throughout the channel. And if there are any trends that might emerge that could, let's say, drive back half year-over-year growth above 10% because I think right now, if you're reinfirming the mid- to high teens type of total growth that would imply some growth but below 10%. And with the price increases that you put in place, is there anything to really think that you wouldn't be able to sustain the gross margins that you generated the 39.8% in the first quarter going forward?"
}