{
    "symbol": "TWNK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 19:57:08",
    "content": " Please proceed with your question. Please proceed with your question. So I feel really good about the playbook we're running, the ability to drive the growth, which is included in our plan as we benefit from our consistent execution partnership with our customers, focus on our consumers and driving our algorithm over time. So we feel really good about that, and therefore as the year goes on, what we'll see is the benefit of lapping out of the pricing and more into the back half we get to the volume driving the algorithm and that's more of our sustainable long-term. We think we have a -- well, we do have a good beat on what the elasticity impacts and what we see is our investment in innovation, our investment in marketing, our execution, our work on driving our partnership and enhanced merchandise with our customers, which includes not even just the displays -- type of displays, timing of it, that's all offsetting any short-term impact that we'll see on elasticity and we'll start seeing that come through the back half. Please proceed with your question. So, it's good top-line growth and we're targeting -- and we're expecting and guiding to 4% to 6% top-line growth and as Andy mentioned, a lot of that is volume. I feel we've -- what's paid off really well for Hostess Brands is our continued focus on our consumer -- customer first and sustainable profitable growth over time and that's going to serve us well and as Travis mentioned, we're committed to recovering gross margins over time and we'll do that until we'll do that within the context of continuing to deliver consistent sustainable profitable growth. Please proceed with your question. When you get a chance to listen prepared remarks if you haven't already, Travis talked about our enhanced merchandising which is multi-tiered related to our focus on availability across the store, displays, merchandising, we're activating our access to consumers through customers tools and really good about -- I feel really good about the visibility we have in the partnerships performing. Please proceed with your question. Hi, this is Travis. We've accelerating our investments to build this capability, to develop scalable and repeatable processes to keep this pipeline of productivity the full and we feel very good about that, and that's again part of our flywheel of growth and then allow us to continue to invest in growth and obviously recover our margins. But this year we have it and we've really -- under Travis's leadership, we've been doing great on building our pipeline of productivity and I believe as we settle out there, that's going to be a real driver of fuel as we invest in -- continue to invest in growth. Please proceed with your question. Please proceed with your question. Please proceed with your question. Hi, this is Travis. As we sit here today, as we've driven our growth over time, we talked about our total volume growth, our stacked growth, when we get back into the algorithm, we need the growth and there's not a time now that there's not a human or online either producing cake product, sanitizing our lines, we're up upgrading them with either equipment or preventive maintenance. Please proceed with your question."
}