{
    "symbol": "TWNK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 23:17:06",
    "content": " Joining me on today's call is Andy Callahan, Hostess Brands' President and CEO; and Travis Leonard, Chief Financial Officer. By now, everyone should have access to the earnings release for the period ended September 30, 2022, that was published at approximately 4 P.M. Eastern Time. During the course of this call, management will make a number of forward-looking statements, including expectations and assumptions regarding the company's future performance. Let me start with the third quarter, which delivered strong growth across all three key elements of our financial performance; net revenue, adjusted EBITDA, and adjusted EPS. The growth was driven by successful pricing and revenue growth management initiatives, as well as improving supply chain execution and productivity savings, which helped to mitigate inflation. Given our strong year-to-date, results and continued momentum, we are raising our full year top and bottom-line outlook. We now expect our 2022 net sales to increase by 17% to 19%, while raising our full year EBITDA and EPS growth guidance to $290 million to $293 million and $0.96 to $0.98 respectively. Our strong topline led to solid bottom-line growth with our adjusted EBITDA and adjusted EPS increasing by 12.2% and 9.5% respectively, even as we continue to encounter pockets of supply chain fragility and elevated cost inflation. It was also notable that we were able to keep our volume essentially flat in the quarter, demonstrating the strength of our portfolio supported by our innovation and marketing investments and focus, which helped to offset elasticity from recent pricing actions. We are well-positioned to continue to drive growth during the challenging economic times due to the resiliency of our categories, our pure play snacking portfolio, and our accessible price points. At the retail sales level, Sweet Baked Goods and cookies both posted strong broad based growth in the quarter. As expected, pricing was a bigger driver of Hostess growth during the quarter as retail prices increased by double-digits, reflecting our recent pricing actions and our continued focus on revenue growth management. Underlying consumption trends remained solid as snacking frequencies, including for sweet indulgent snacks remain elevated even in the post-pandemic environment. Our access to all retail channels and our affordable price points are particularly attractive in the current environment as consumers seek better value to fit with their lifestyle and consumption occasions, which is reflected in another quarter of double-digit growth for Hostess Brands' single-serve and multipack offerings. Point of sale for each increased by more than 15% during the quarter, with two-year stack growth of approximately 33% and 29% respectively, both well ahead of underlying category trends. Turning to the Voortman brand, Voortman point of sale increased by 28.8% in the quarter, including 28.1% growth in the sugar-free segment where it gained 500 basis points of share during the quarter. We continue to be very pleased with the performance of Voortman business, which is margin accretive to our portfolio and is continuing to deliver against our initial expectations. With strong double-digit top and bottom-line growth of the last three years, we have built an impressive track record of strong performance during a period of unprecedented volatility and challenges. More importantly, as I set out our March Investor Day, despite increasingly complex consumer macro macroeconomic environment, I continue to believe the foundation of Hostess Brands has never been stronger and I've never been more confident of our team's capabilities and drive to deliver our long-term growth algorithm. First, we have unique access to broad, fast-growing snacking occasions, and a best-in-class business model that fits perfectly with our impulse-driven categories. The indulgent sweet snacking segment is one of the largest and fastest growing segments within macro snacking, which itself continues to grow faster than overall food, and has also shown to be consistently more resilient in prior economic downturns. In fact, a recent survey to better understand the impact of the current environment on our consumers and core categories signaled the majority of the consumers surveyed are indeed worried about the economy and plan to cut back spending. However, a vast majority of the same consumers indicated they will continue to look for new snacking options and 82% say that sweet snacks brings them joy, especially during times of uncertainty. Within the overall macro snacking universe in which we compete, we are attractively priced relative to other snack offerings, providing consumers and accessible option as they look to stretch their shopping dollars. In addition to our presence in growing categories, we are targeting the most attractive snacking occasions where Hostess and Voortman are uniquely positioned to win. We are prioritizing five fast-growing occasions, which are more than $50 billion in retail sales, and provides us a large and sustainable platform for future growth. Now, second, we're accelerating innovation, marketing, and consumer facing capabilities to fully unlock the potential of our iconic brands and access to these attractive snacking occasions. We have not slowed our investments in innovation, even during times of resource constraints, and supply chain challenges. And it's really about how we are leveraging our occasion-based framework, our consumer and shopper insights to innovate and generate profitable and sustainable growth. From last year standout Baby Bundts to this year's highly anticipated Hostess Bouncers, we're building and executing a multi-year pipeline of new products to continue our innovation momentum and drive category growth. While it is early, we've had strong display support for the key back-to-school period with good sell-through, driving trial, and expanding placement in the traditional channels before its introduction into convenience store channel this month. As we mentioned at our Investor Day earlier this year, our A&M spending will likely grow ahead of our expected revenue growth over the next several years as we establish a new base level of spend to support long-term mid-single-digit topline growth. We also continue to invest in talent throughout the organization, including our bakeries, warehouse, and importantly, in our R&D and product quality teams. Adrian joins us with nearly 30 years of diverse supply chain experience with Kimberly Clark, which began in his native Argentina and culminated as Head of Global Capabilities. Additionally, our innovation and marketing investments are attracting new households to our brands. Third, in addition to pricing actions, we continue to pull on multiple levers to manage the current inflationary environment, as well as protect and modestly expand margins over the long-term. Revenue growth management is a key component of our growth flywheel, we continue to step up efforts to accelerate our productivity agenda. While we successfully navigate the current environment, we remain focused on growing the right way over the long-term. Attaining our key CSR goals as part of strategic objectives of our executive team with direct oversight from our Board as we continue to build a strong sustainable corporate culture that values nimbleness integrity, tenacity, inclusivity, and a commitment to quality. In summary, I am pleased with our strong quarterly and year-to-date results, which are enabling us to raise our full year sales, EBITDA, and EPS guidance and build on our track record of delivering excellent results through a challenging operating environment. With that, let me turn it over to Travis to go through the quarterly financial results and revise outlook in greater detail. Organic net revenue for the third quarter increased 20.2% to $346.2 million, another record sales quarter for Hostess Brands. Our topline was driven primarily by price/mix, as we benefited from plan pricing actions and successful execution of our revenue growth management initiatives. Our Sweet Baked Goods portfolio, nearly 90% of total sales grew 18.7% during the quarter, while our cookie portfolio grew 33.2%, demonstrating growth across our entire portfolio. Switching to retail sales trends, our Nielsen measured Sweet Baked Goods point-of-sale increased by 17% for the 13-week period ending October 1st, with broad based growth across all key channels. Voortman POS increased by 28.8% in a period, nearly double the 13.4% growth for the overall cookie category, driven by pricing, innovation, and distribution gains with strong growth in the sugar-free sub segment. As Andy mentioned, both our single-serve and multipack offerings grew by double-digits during the quarter. Our breakfast portfolio also continued to outperform the sub-segment with 20.6% growth in the quarter compared to 18.3% for the total breakfast sub-segment, driven in part by our impactful innovation. Moving to the rest of the P&L, adjusted gross profit of $116.1 million increased by 16.9% in the quarter, driven by pricing actions, revenue growth management initiatives, and productivity savings, partially offset by inflation. Adjusted gross margin of 33.5% for the quarter, declined 93 basis points from a year ago period at 18.5% inflation and inefficiencies caused by continued supply chain fragility, were partially offset by stable price/mix and benefits from productivity initiatives in the quarter. More specifically, our continued focus on development of our revenue growth management capabilities led to higher net price realization during the third quarter, which is historically our largest promotional quarter. Our adjusted operating expenses, including SG&A, increased by 23.9% to $61.9 million, driven primarily by planned investments in our people and capabilities, as well as higher depreciation and advertising spend. Adjusted EBITDA margins declined by 150 basis points to 21%, primarily due to lower gross margin as previously discussed. Our effective tax rate excluding discrete items was 26.7%, consistent with the prior year quarter and largely in line with our 27% outlook for the full year. At the end of the quarter, we had cash and cash equivalents of $190.8 million, short-term investments of $41.9 million, and net debt of $850.5 million, with a net debt leverage ratio of 2.9 times, which is at the bottom of our targeted three to four times range. In the quarter, we received insurance proceeds of $33 million under the representation and warranties insurance policy we purchase in connection with our 2020 acquisition of Voortman. During the quarter, we repurchase $45.5 million worth of shares under our previously announced $150 million repurchase program. Turning to our outlook for the year, given our strong quarter and year-to-date results, we are raising both our top and bottom-line guidance for 2022. We now expect full year net revenue growth of 17% to 19%, up from our previous guidance of at least 15% growth. We now expect adjusted EBITDA of $290 million to $293 million, up from towards the high end of the $280 million to $290 million range. We are also increasing our EPS guidance to a range of $0.96 to $0.98 per share, up from the previous $0.93 to $0.98 per share range. We now expect average shares outstanding of approximately 138 million, down modestly from the previous range of 138.5 million to 139.5 million. Consistent with our last call, we continue to expect high teens inflation for the full year. However, given the timing of certain costs, our Q4 inflation rate is expected to be higher than Q3. We now expect full year gross margins to come in slightly better than our previous outlook of down 200 basis points versus prior year, driven by better than expected contribution from revenue growth management and productivity initiatives in the second half of the year. As previously communicated, we will continue to make targeted investments across the organization including investments in our people, capabilities, products, and brands. Our most recent innovation, Bouncers, is off to a good start, and we will meaningfully step up advertising and marketing support in the fourth quarter to drive awareness and trial. So, several companies, particularly in the snacking space, implementing additional rounds of pricing, given continued input costs inflation. So, we're not really going to speculate on 2023, we'll do that next quarter. We continue to evaluate future pricing actions, really, in the broad context of the consumer, but also our ability to continue to drive efficiencies, revenue growth management which Travis talked about today, our productivity initiatives. So, it's all the balance of making sure we're delivering the right consumer value in a responsible way, and also managing our revenue growth, management and all of our efficiency. With all that being said, we feel we're really well placed both in our snacking categories, the resiliency of our categories, our underlying trends, our innovation and our marketing initiatives. And right now as we enter 2022, all the pricing we need to deliver on our commitments for 2022 are in the market as we talked about last time it flowed through in July. And then my second question is just on your guidance, which has moved up for topline and EBITDA, but you've narrowed your EPS range, despite projecting a lower share count. We did raise the bottom end of the range, as you've talked about we have bought back shares, and you see that in our prepared comments. When we think about our EPS, there's a lot of activity going on in our business and many of which we've alluded to, we've talked about the amount of innovation that we've done, we've talked about our investments in innovation, we've talked about our cap allocation against our core business, which includes Arkadelphia, and a meaningful spend, we have there. And the reason why I set that up is that as we look at our assets, we are continually focused on our network optimization, delivering our long-term innovation pipeline, and driving productivity and efficiency initiatives. Just to give you a little bit of context, 65% of our debt is essentially fixed at approximately 4% interest rate. Our effective interest rate for Q3 was about 3.8%, so we're really proud about that, given the current interest rate environment that we are in. So, obviously, we will have interest expense rise as we continue to operate in this environment. But obviously, the -- fixed debt at 65% does give us a little bit of a bit of a bit of a help there. So, I would anticipate interest expense to go up in Q4 and as long as the interest rate environment remains as is, we will continue to experience higher interest expense on that variable portion of our debt. Please proceed with your question. As you can imagine, given what we've shared year-to-date, inflation is in the high teens, Q3 was 18.5%, Q2 was 20%. So, our largest headwind, if you think about year-over-year margin decline is obviously an inflation, given the magnitude. And Andy alluded to this a little bit earlier, we think about a toolkit to manage costs, and to manage cost and to drive our ability to continue to invest back in our business. So, there's multiple tools in this toolkit, pricing is one of them. We've also invested in our ability to drive repeatable and scalable processes across our entire business system, across our bakery, across our warehouses, in procurement, and transportation to continually fill pipeline of productivity initiatives. So, as we think about our margins over time, as we think about recouping our margins over time and slightly expanding them, we will leverage our GM capabilities and our productivity capabilities to really drive and continue that investment into innovation, into our product quality, and into our marketing as well. So, David it's too soon to talk about timing, but as Travis said, I think most importantly, we're committed to recovering our gross margin and expanded modestly over time, including the anchor that the starting point you talked about. And just looking at your slides, your multipack sales growth was still strong, although it's not as strong as your single-serve them. So, let's keep thinking things in context. So, -- because you talked about slowing, so we're -- I think we're one of the top growers if you look over the past several years, both in units and in dollar sales for the quarter just so everybody's grant grounded. Our -- let make sure I think for the quarter our single-serve was up 17.5% in Dollars, our multipack was up 16.5%. Our two year stack on single-serve is 33%, and multipack, was 28.9%. Specifically, within the convenience channel, our POS was up 17%. We did expect unit sales -- we guided for the full year kept that the same on our unit sales of the high side, 2.5% for the full year to zero. So, we do expect unit sales to slow, it's consistent with our model. I think what's important for us is we have opportunities on both multipack and single-serve, given the nature -- the impulse nature of our category, and our growth model to access this $50 billion of occasions that we talk about a lot and that's proven to be true. In our model, we see the impact of our pricing on the elasticity and that impacting our units on the downside, that's been offset by some of the macro trends. But more importantly, some of the largest drivers in our model are our innovation, our investment in marketing, and our ability to execute. And those things will continue over time throughout our algorithm, even as the impacts of short-term pricing kind of go back. So, yes, we can talk about a lot of things in the short-term and they're all good questions. But over the long-term, what our model says is the activities that we're doing access at $50 billion, which are broader than our category alone, continue to work. Please proceed with your question. I wanted to ask about Bouncers, clearly, it's doing well. I wanted to ask this, you've obviously been innovating well, for a long time, but I feel like this is sort of a step up in a maybe a little bit of a bigger direction. And I -- the strategies that we've been implementing, are building the sustainability of that because we're -- our strategies are category-growing strategies. And what we're doing is we're accessing consumers and attracting them to Sweet Baked Goods as the buyable  snack, which is what I just talked about in the previous message, we do have a good tribe. With that we never left innovation during COVID, we continue to invest, when there wasn't as much out there, we were able to launch a Baby Bundts and other things that were highly successful, of high repeat rates. The enthusiasm between our -- from our customers, it's too early to tell, consumers ultimately determined, has been highly enthusiastic, our distribution has been very strong. We're just turning on our advertising here in October, that's a testament of our enthusiasm behind it, because we need to drive awareness. But Tina Lambert and Dan O'Leary, who you heard from an Investor Day do a terrific job of starting with the consumer insights, looking at our occasion-based segmentation model, this target is lunchbox and has a broader appeal out there does really well. Too early tell it to consumers, but we do believe that it's scalable and platformable. So, it's not a one and done and it's -- that as much as just one individual item that gets them excited that we're focused on category growth, we're focused on pipelines, and we're focused on sustainability of them. Please proceed with your question. Yes, there's a lot of things. And we -- when we originally integrated it in, we got efficient on the SKUs, we reformulated where we needed to do, we reimagined the packaging, so it'll fit within our logistics. So, what I'd say at the fundamental piece of it is we got a portfolio that we thought was a sustainable growth, what we call scalable niche, and that's our model. Our customer teams are executing extremely well, our distribution continues to move up and the quality of the distribution is really good. We have expanded into the convenience channel and both -- importantly, as you saw the sales dollars were up, but also the unit consumption in this environment continues to be up. So, we now have two really meaningful branded businesses, one in cookies, which is an $8 billion in retail sales and Sweet Baked Goods, which is quickly approaching the size above $7 billion approaching the size of cookies where we obviously have a more meaningful position with tailwinds to be able to grow. So, we have macro tailwinds, two really branded positions with tailwinds in the category that we're executing, I would put them up against as good or better than anybody else. So, one of the beauties efficiencies of our business model is the nature -- we're one of the highest impulse categories there is, which by the way is really testament to the expandability of our categories. So, we're -- when we can activate our plan and we can do it the way we want, we talked about accessibility to $50 billion of occasions. So, when we go in to C-stores, our logistics model allows us to do that really efficiently and getting really display ready things right out the convenience channel as well as getting it on the shelf. Please proceed with your question. As Travis mentioned in the prepared remarks, it's just the timing of some of the COGS coming through our P&L in Q3 versus Q4, which is kind of related to some of the contracts and relationships we have. It's not a long-term indication that things will talk about that at the due time, but that's the way it's flowing through this year. And then related to sales growth, we feel terrific about the sustainability of our model. In today's environment, I mentioned some incredible numbers. One thing that didn't come up, Rob that I know you're always interested and it's not just the point of sale, but if you look at the consumer fundamentals of our business, if you step back, we continue to access households. If you look at over the last 52 weeks, we're adding two times buyer to our category, more than twice the rate of the rest of the category. Those things -- and so therefore, when they come back to us our investment in quality, our investment in the execution at the retail, given the impulse nature of our of our business, investment, innovation and our investment â\u0080\u0093 investment in the consumer advertising to take our unaided awareness and then close that gap. So although Q4, we're expecting to end the year and a very strong we raise guidance across the board. Yeah, I would just add, again, as, as we said in prepared remarks are our volume, low to mid-single digits, that's what we've said in the past that is still consistent on a full year basis, low to mid-single digits versus per year. My follow-up, though, in the Nielsen data anyway, your biggest competitor seems to have recovered, a lot of the market share had lost last year. There's a couple ways to combat that are, I have a lot of respect for all of our competition, I take him serious, and they're out there doing a nice job. The flat answer is our market share has was flat, but basically essentially flat for the quarter on a market share basis. But what's really, you shares one metric, and that'll go quarter-to-quarter, some of the things I talked about long term are important, but also the expandability of our categories really important. Because we can grow, even with a flat market share, as I mentioned, our top three channels were up at least 13%. Certainly we did mention, we've benefited in the short term from a competition, just distribution, some things, but what's going to last over time with a lot of the strategies that we talked about over time. Please proceed with your question. I want to pull together a couple of different things you've been talking about throughout the call it sounds like you're successfully reaching new consumers, new households, new occasions, with incremental products and incremental initiatives, which is great. Now I get it flat volume, given the pricing you're taking is, is, impressive in its own right. Yeah, what I think in â\u0080\u0093 the way I think about that is obviously we're putting a lot of pricing into the marketplace, and there's some more matter of elasticity impacts us. The strategies that we're implementing, will last well beyond this period of inflation, and the impact that the pricing in the short term has to consumers relative to elasticity. So that's why I did bring that up about our ability to be able to access new households, our ability to win they try us that, they repeat with us, and that's where innovation in our marketing efforts are important. We expected as was communicated, and it sounds like we're getting, I don't know whether it's just our side, but I apologize, if there's interference on our line. And as I mentioned, as Travis mentioned, we take pricing extremely serious seriously, we think we have a good value equation to the consumer. We expect to recover margins over time, and we expect to then not just pull the pricing lever. That's why we're very balanced about that and continue to pull our gm of productivity, as we talked â\u0080\u0093 talked about. Please proceed with your question. Andy, I just wanted to kind of talk about a quarter, let's say circle back to the kind of the longer term opportunity. They kind of assume, the category and your products overall, still kind of sell it, somewhat of a lower absolute price point per ounce versus the total store. Volumes flat with high pricing released in Q3, obviously is impressive. As Travis said, we're not seeing everybody put up the same numbers can everyone's been impressive, the store has been impressive, consumer seems resilient. But would you kind of step back and say, look in the near term, or even, â\u0080\u009cthe medium termâ\u0080\u009d, maybe the volumes wouldn't grow as much. But it also be an opportunity, especially as you continue to speak with the retailers, that if you are kind of performing year-over-year on a volume basis, a little bit better than some other carriers, maybe you get a little bit more pricing than some other categories, that this could be actually an ideal of an opportunity time to kind of lean in, right, and try to attract new consumers that you get into next year, because your absolute price point is not very expensive. So with your investments in value and innovation are you truly price to the value and we think about that all the time pricing the value, while we look at our algorithm and make sure we have the sustainability of it. So we want to deliver to consumers, the best value for the dollars that they can have, at the same time that we're delivering industry leading growth, at industry leading margins, and therefore industry leading total shareholder return. We think we have as we stand here today to at least close out 2022 We think we have that balance of sustainability, sustainable, profitable growth, correct while the consumers absorbing a lot. So we don't think about as opportunistically, we will think about the right price value to the consumer that will drive to sustainable profitable growth. We think we haven't right, with that being said, to really look at 2023. And we're in a position maybe the other end of that, given what you said that if needed, we'll be in a position to activate the correct levers to continue that keep that track record of successful results. Well, I appreciate your interest and thanks for the confidence you placed in our team as we continue to execute our plan to inspire moments of joy. Rob, this one's for you for all stakeholders, consumers, our investors, our suppliers, and certainly our team. Have a great day â\u0080\u0093 I guess holiday season, because we'll be back and talking to some of you in the interim, but not on the quarterly call, until after the holiday."
}