{
    "symbol": "TTEC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 13:18:04",
    "content": " Our fourth quarter year-over-year top line performance primarily reflects the contribution from the April 2022 annual asset acquisition in our Engage segment, as well as increased CX technology services in our Digital segment, driven by the increasing adoption of cloud CX technologies. Our full year top line growth was primarily driven by the Engage Faneuil acquisition in April of 2022 and Digital's Avtex acquisition in April of 2021, alongside increased business across our core offerings from new and existing clients. Digital segment revenue increased 4.2% to $123.4 million in the fourth quarter of 2022 of the prior year period, all organic. Our fourth quarter revenue growth is a function of increased cloud and systems integration services across our Tier 1 CX tech partner platforms, slightly offset by lower year-over-year product sales and on-premise managed services as more clients move to the cloud. Our combined recurring cloud and managed services revenue grew 4.5% in the fourth quarter of 2022 over the prior year period, representing 54% of Digital's total revenue and our reoccurring systems integration revenue grew 18%, representing 27% of total revenue. On a full year basis, Digital's 2022 revenue increased 13.9% to $471.5 million over the prior year period, of which 1.7% was organic on a constant currency basis. Our Cloud and Managed Services revenue grew 15% in 2022 over the prior year period, representing 54% of Digital's total revenue, and our systems integration revenue grew 20% representing 27% of total revenue. Our Engage segment reported fourth quarter 2022 revenue of $534.9 million an increase of 8.3% over the prior year, 4.6% on a like-for-like basis, excluding the impact of pandemic-related volumes. The annual asset acquisition was the primary contributor to growth in the quarter and the full year, alongside increased volumes across our virtual and digital delivery capabilities, contribution from our EMEA region and select verticals, including health care and financial services, excluding the pandemic-related volumes. And to give you some context, if you think about hyper growth where it's at, you take a decline in that business, the rest of the business right now, when you talk about resilient and verticals like financial services, health care, et cetera, they're growing right now in roughly 7% growth versus the hyper growth business that's in the decline. Your line is now open. Your line is now open. Your line is now open. Go ahead...\n Well, I might just add, just in terms of - our top 10 clients actually provided a lot of our growth in 2022, and we see that continuing into 2023 and in particular, some of these were there, as you said, consolidating, we're performing well and they're getting excited, and we see demand for our new offshore locations to add to the services that we're providing those clients. Your line is now open. Your line is now open. Your line is now open. So I would say, going back to right now, what we're at this point, talking about as you look at hyper growth, I said roughly $400 million to specific numbers, roughly 380 is coming down to roughly $300 million in fiscal year 2023 and then the rest of the remaining verticals are growing at 7%. Your line is now open."
}