{
    "symbol": "FTS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-10 12:20:25",
    "content": " Over the next five years, we expect rate base to increase by $12 billion from approximately $34 billion in 2022 and to over $46 billion in 2027, supporting average annual rate base growth of 6.2%. In total, we estimate incremental investments of approximately US$2 billion to US$4 billion through 2035 will be required to implement TEP's current integrated resource plan. The key drivers of growth include strong regulated rate base growth across our utilities as well as higher sales and transmission revenue in Arizona, higher hydroelectric production in Belize, which was up significantly from historically low levels in the fourth quarter of 2021 and higher gas margins at Aitken Creek also contributed to earnings growth. To recap, in 2022, we invested $4 billion in capital delivered strong EPS and rate base growth, further reduced our carbon emissions, managed operating costs, and were recognized as a leader in Canada for our governance practices. Moving forward, we are focused on executing our $22.3 billion capital plan, which will drive rate base growth of 6% and support our dividend growth guidance of 4% to 6% through 2027. Actually, it might be a little of everything and that's what we're doing in the Integrated Resource Plan, update now is to figure out exactly what that means from a timing perspective, investment opportunity perspective as well as cost associated with the renewable energy investments that we have to make to keep on that transition path that we have there. We do think that based on Chair Phillipâ\u0080\u0099s comments that he's really going to be pushing down the same path to get some of these policy issues that are in the NOPRâ\u0080\u0099s, the transmission planning and cost allocation, NOPRâ\u0080\u0099s, as well as the interconnection in queue NOPR, it seems like he's really going to continue to progress those. Most of the O&M impacts that we have seen in '21 and '22 were to get the system to where it needs to be, and we continue to make the additional changes in investments and tweaks to that system as we go to make sure that it's -- we got to get to the point where it's ultimately operating as design, which we think we're getting close on."
}