{
    "symbol": "FRLN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-04-04 10:31:02",
    "content": " This morning, we issued a press release and filed our annual report on Form 20-F with our 2022 financial results and business updates. We'll begin the call with prepared remarks by Michael Parini, our Chief Executive Officer; Pam Foulds, our Chief Medical Officer; and Paul Schneider, our Chief Financial Officer. Henning Stennicke, our Chief Scientific Officer, is also on the call and will be available for Q&A. Before we begin, I would like to remind everyone that we will be making forward-looking statements, which may include our plans and expectations with respect to our research and development pipeline, clinical trials, and financial projections, all of which involves certain assumptions and risks beyond our control that could cause our actual developments and results to differ materially from those statements. We announced several important updates this morning, including the further prioritization of our clinical programs, the corporate restructuring, and the extension of our cash runway. Despite treatment with existing therapies, many people with Gaucher disease continue to experience serious symptoms, disease progression, and a shortened lifespan. Given the tough market conditions, our cash position and anticipated timing of data for our programs, we reassessed our priorities, the capital needs required to advance two clinical stage programs in parallel, and options for reducing our operating expenses to extend our cash runway. As a result of this assessment, we made the difficult decision to pause development of FLT190 in Fabry disease and further reduce our workforce. These actions extend our runway into the second quarter of 2024 providing us time to advance FLT201 to key data readouts starting with initial data from the first cohort, which we now expect to report in the third quarter of this year. In assessing our two clinical programs, we believe that FLT201 represents a higher value opportunity. The novel transgene encoding a rationally designed longer acting variant of GCase, the enzyme lacking in people with Gaucher disease, combined with our highly potent AAVS3 capsid give us reason to believe that FLT201 can improve outcomes over existing therapies and sets it apart from any other gene therapies in development for Gaucher Type I. In addition to reductions related to FLT190, weâ\u0080\u0099re reducing headcount across the organization while preserving core capabilities and ensuring our ability to drive enrollment in our GALILEO-1 Phase 1/2 dose escalation study and advance FLT201 to key data readouts. By focusing on driving FLT201 to data readouts that can serve as potential catalysts, we are laying the foundation to build a strong and sustainable company over the long-term. With that, I would like to turn the call over to Pam to provide a detailed overview of FLT201. As you heard from Michael, FLT201 has the potential to deliver better efficacy over existing therapies, while freeing patients from the burden of lifelong treatment. It's also highly differentiated from other investigational gene therapies for Gaucher disease type 1, which either require extensive conditioning prior to treatment, or deliver short half-life wild-type enzyme that may not be able to penetrate deeper disease affected tissues. As a result, harmful substrates known as Gb1 and lyso-Gb1 fills up in multiple organs, including the spleen, liver, bone, and lung. Symptoms include pain and swelling of the abdomen from enlarged spleen and liver, exhaustion, bruising and bleeding issues from low blood counts, bone pain and fractures, and shortness of breath from reduced lung function. We are focused on Gaucher disease type 1, which is the most common form of the disease with approximately 18,000 patients in the U.S., UK, EU, and Israel. Currently approved therapies poorly address certain aspects of disease, especially in difficult to reach organs, including bone and lung. Despite treatment with enzyme replacement therapy or ERT, which is the current standard of care, many patients continue to experience serious symptoms and may have reduced life span. And lung dysfunction may be more prevalent than first thought, with one study suggesting that as many as 68% of patients are affected despite ongoing treatment. ERT requires lengthy biweekly infusions, impacting decisions about work, where to live, ability to travel, and overall quality of life. Additionally, the trough and enzyme levels in between infusions mean harmful substrates have the opportunity to build back up potentially contributing to disease progression. In contrast to ERT, FLT201 is designed to deliver a steady and continuous level of enzyme, potentially providing better enzyme coverage and uptake in disease affected organs. Importantly, FLT201 delivers a novel transgene for engineered GCase variant that has a substantially longer half-life than wild-type in both plasma and the cells of interest. We believe that together with this steady release of enzyme, this allows for greater likelihood that enzyme will penetrate the deeper tissues, which other therapies do not reach. In preclinical studies, FLT201 demonstrated high GCase expression at low doses, increased uptake of GCase, and disease affected organs, including bone and lung, compared to ERG; and importantly, greater clearance of pathologic substrate in disease affected organs, again, including bone and lungs, than ERG. Building our relationships in the Gaucher investigator community and expanding the number of sites and geographies to position us to enroll not just the first patient, but subsequent patients and subsequent cohorts. While we have faced unexpected headwinds, we believe we are on the right track and well-positioned to enroll the first cohort to deliver meaningful data in the third quarter. As a reminder, the trial is designed to enroll two patients in the first cohort with a four-week stagger between patients. We expect initial data in the third quarter will focus on assessments of safety and enzyme activity in these first two patients, with later data readouts looking at substrate reduction and various clinical parameters. We believe in FLT201's life changing potential and we're committing to program, we are singularly focused on driving enrollment in the GALILEO-1 trial with the aim of delivering key data readouts. As you'll see reflected in the financial results reported today, we've made significant strides over the past year and a half to drive increased focus, financial discipline, and operational efficiency by prioritizing our highest value programs aligning resources with those priorities and reducing the size of our workforce. These decisions are always difficult, but as a management team, we are committed to focusing our resources where they will matter the most for our patients, for shareholders, and for Freeline. For the year ended December 31, 2022, our cash and cash equivalents totaled 47.3 million, compared to 117.7 million at the end of 2021. Taking into account the proceeds from the closing of the sale of our German subsidiary received in February 2023, the pausing of the FLT190 program and our proposed reduction in force, we now expect our cash and cash equivalents to fund our planned operations into the second quarter of 2024. Our net loss was 89 million or $1.50 per basic and diluted share for 2022, compared to a net loss of 140.4 million or $3.93 per basic and diluted share for 2021. The decreases across R&D and G&A were driven by lower employee related expenses, due to workforce reductions and portfolio prioritization activities initiated in both 2021 and 2022. Before opening up for Q&A, I wanted to say a few words about changes to our Board, starting with Paul's appointment. With his track record of execution and financial stewardship and deep understanding of our business, his perspective will be instrumental on the Board as we focus in the near-term on delivering on the potential of FLT201 and longer-term on building a sustainable and successful company. We also announced this morning that Dr. Amit Nathwani is retiring from the Board, but will continue to stay closely involved with Freeline as a Clinical and Scientific Advisor. A pioneer in the field of gene therapy, Amit co-Founded Freeline and has made countless contributions to the company over the years. On behalf of the entire Board, I want to thank him for his service and I look forward to his ongoing contributions as a clinical and scientific adviser to the company. Just briefly, so the construct is  stabilized variant of TCAs, which means that it has about six-fold longer half live for stability in the plasma, but more importantly, more â\u0080\u0093 about 20-fold increased duration of action on half-life inside the lysosomes or at lysosomal pH. It's a little difficult to talk about area under the curve for a gene therapy, but definitely looking at the coverage we expect to have inside the cells, our preclinical data clearly shows that we will have a much greater effect at comparable vector doses than wildtype GCase. So, we do expect to have much more impact of the treatment and hence be able to reach more difficult to treat tissues and clearly that is what our preclinical data demonstrated. And I think Henning touched on it a little bit, David, on the dose There's no question based on the preclinical data and our preclinical modeling. We do anticipate that we could use lower doses for FLT201, particularly in-light of the potency of the AAVS3 capsid, which I think we've seen across our other two programs. And so, we have a starting dose of 4.5 , which we do think should show enzyme activity that again hopefully has a therapeutic benefit. We will now take the next question. Your line is open. Maybe the first part, I'll ask Pam to comment on what we expect to share in the data. So, as you know, we'll be dosing into the first cohort within GALILEO as he mentioned and Michael mentioned that  . What we plan to be sharing in this first cohort, which would be two patients, would be any safety data, of course, as well as enzyme activity. Importantly, as I mentioned earlier too, as Michael mentioned, we do expect to see based on our modeling a nice robust enzyme level thatâ\u0080\u0099s based at our modeling. And then on the second part of the question, we certainly have done thorough safety assessments pre-clinically on the novel enzyme. But overall, with the 19 patients, we have treated far events of ALT has been fairly well-tolerated. We will now take the next question. Your line is open. Second is, Pam, in your prepared remarks, you talked about facing some headwinds and I believe you're referring to the one-half 2023 prior guidance for the GALILEO-1. I mean, let me start by saying certainly a difficult decision to pause the program, but given where we are financially in the market conditions, we feel strongly that putting our full weight behind 201 is the right decision for Freeline and for patients. And so, it was nothing to do with what we observed in the third patient or ongoing surveillance of patients 1 and 2 in that study. 190, we're not sharing data at this time on patient 3. We will share data from that program at the right time, but right now, we're really not sharing anything beyond that. I know Pam, you want to talk a little bit about, sort of what we've heard from investigators in terms of interest, but also some of the steps that we've taken to really prepare that program for success. So, as Michael said, we are really pleased with the tremendous progress we've made in the Gaucher program in GALILEO-1. And they too have been very interested and excited and are partnering with us again as appropriate to share our â\u0080\u0093 to share our trial, to share information and to give us feedback and that has been extremely positive. Also, we've been really focusing on execution. So, as I mentioned, getting sites up and running as well, but also in terms of looking across multiple patients screening, drug shipments, helping with scheduling of screening activities. And maybe, I think the third question had to do with our cash runway. We have taken a number of steps Dae Gon as you saw in our release to extend our cash runway into Q2 2024, and we absolutely are hyper focused on spend right now as you can imagine. And so, we are looking forward to dosing patients and really driving data in the third quarter of this year, which we think will be an important catalyst for the company. Beyond that, we continue to work on operational efficiency and certainly are open to business development and other opportunities, but nothing specific to say beyond that. We will now take the next question. Your line is open. And importantly, within all of our clinical trials it does allow for individualization with the physicians and in discussion with our medical monitors here at Freeline. So, importantly, patients, a number of weeks, about 3 weeks into their treatment, they have the ability to start prophylactic prednisolone, as well as tacrolimus. Importantly, as I said too, that all patients, including those in GALILEO, will have the ability with their physicians talking with their medical monitors determine what is the best path for each individual patient. So, there's a lot of variability that is going to be allowed and is allowed already in these clinical trials. At about the 3-week time point, the physician then will be looking to understand based on the enzyme levels, the GK's enzyme levels to withdraw ERT or SRT at that point. Looks like it's â\u0080\u0093 at this point, it's still an ex-U.S. study. Well, thank you everybody for participating in today's call. Before we close, I would like to thank the Freeline team, as well as our study investigators and the patients who are participating in our trials, the IR team, and management team are standing by."
}