{
    "symbol": "INTA",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-06 20:54:03",
    "content": " Presenters included keynote speaker Luke Flemmer, Managing Director at Goldman Sachs; Ian Clark, Managing Director and Global Chief Technology Officer at Lazard; Angie Goenaga, Senior Investment Associate at Women's World Banking; and Jamie Fowler, Chief Transformation Officer at Grant Thornton, who shared their experiences creating efficiencies within their complex organizations, operating successfully and they're highly regulated industry and winning business by leveraging their knowledge, intellectual capital and relationships for competitive advantage Many of our attending clients shared, but they do not anticipate. We celebrated Go Lives of DealCloud for the asset management arm of one of the world's leading investment banks, as well as a large global financial advisory and asset management firm and go lives of our risk and compliance solutions in our industry cloud for one of the world's top strategy consulting firms Notably, all three of those deals closed just in Q1, demonstrating our ability to shorten our time to value even on large or complex client implementations. SaaS and support revenue was $61.6 million, up 31% year-over-year reflecting both new sales to new clients, and upsells and cross sells to existing clients of Intapp's purpose-built cloud solutions. Total revenue was $84.7 million, up 31% year-over-year driven primarily by continued strong sales of our cloud solutions, as well as by solid growth in professional services revenue. Your line is open. And that was one of the questions that we were asking at our City Tour event in New York in the winter, what's going on inside your firms and how are things going, and we were very encouraged by the general tone that folks are following through on their cloud transformation initiatives, because they see some real benefit to themselves operationally to better position to weather any kind of economic uncertainty and they see in our platform some real advantages that they can take advantage of its capabilities. Your line is open. Your line is open. We're very excited about that and vice versa, because we have a position in the professional financial services industry, with an industry cloud, value proposition that augments the whole Microsoft Office 365, Teams, Azure capabilities in a way that makes it more specific for this end market that historically has been very Microsoft friendly, but has had to do a lot of work to try to adjust the Microsoft platform to really work for the way that the partnership based firms operate and we're able to solve that problem. Your line is open. Your line is open. Your line is open. Your line is open."
}