{
    "symbol": "QDEL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 21:37:07",
    "content": " Also during todayâ\u0080\u0099s call, to facilitate a comparison of the companyâ\u0080\u0099s operating performance in the second quarter of 2021 to second quarter of 2022, we will be discussing supplemental second quarter 2022 and 2021 revenues and adjusted operating results as Quidel and Ortho has been combined for the  period. Beginning with our results, we delivered strong performance highlighted by 37.5% supplemental combined revenue growth, 32% supplemental combined adjusted EBITDA margin, and triple digit supplemental combined adjusted EPS growth, as the newly formed team did a terrific job in executing on our strategic priorities. Supplemental combined revenue for the second quarter, including both Quidel and Ortho for the full quarter reached $898.5 million supported by double digit growth and point of care and molecular diagnostics, along with solid high single digit combined growth for labs, and transfusion medicine. In the process, our lab business has gone from low single digit to mid single digit growth, in a quarter, or vitro integrated analyzer installed base grew by 12% year-over-year including the double digit growth in Europe, Middle East and Africa, China and our other U.S. regions and high single digit growth in North America. Turning to our Q2 performance by business unit point of care revenue grew 181% in the quarter, and grew 19%, excluding COVID related revenues. Labs revenue, which includes Ortho clinical labs and non-core revenue as well as Quidel specialized diagnostic solutions grew 3% in the quarter, and grew 6% excluding COVID related revenues, largely driven by strength, including clinic and asset revenue. Molecular diagnostics revenue declined 40% in the quarter, but grew only 45% excluding COVID related revenues largely driven by strength and Lyra, Savanna and Solana product lines. Now turning to our quarterly performance by geography on a constant currency basis, North America revenue grew 59%, EMEA grew 6%, China grew 25% and other regions which includes Latin America, Japan and other Asia pack markets grew 2%. Recurring revenue, which includes reagents, service and other consumables grew 1% and was up 9% excluding COVID related revenue driven by across the board strength and many pull through in our instruments. QuickView revenue grew 756%, largely driven by COVID-19, instruments revenue grew 2%, which is an improvement from the first quarter but open labs instrument orders due to global supply chain challenges are relatively flat sequentially, approximately 600 instruments. Profit margin for the quarter was 53.6%, which is an 80 basis point increase versus prior year due to volume growth, mix and positive pricing in both labs and transfusion medicine partially offset by lower margin on COVID related revenue, including a $25 million QuickView inventory reserve recognizing the quarter due to the timing of a government order. Adjusted EBITDA grew 75% to 291 million and adjusted EBITDA margin expanded 760 basis points year-over-year to 32.4%, largely driven by the previously mentioned drivers of gross margin and efficient operating spending. And on supplemental combined basis, our adjusted earnings per fully diluted share for the second quarter increased 123% year-over-year to $2.12 driven by the increase in our COVID-19 guidance and our solid operating performance as well as lower interest expense. First revenue, excluding COVID related sales is expected to grow 6% to 9% on a constant currency basis to 2.49 billion to 2.57 billion."
}