{
    "symbol": "CNQ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 14:23:10",
    "content": " Canadian Natural delivered strong operational results in 2022, as we achieved record annual production of approximately 1.28 million BOEs per day, an increase of 4% over 2021 levels, which included approximately 933,000 barrels a day of liquid production and record annual natural gas production of approximately 2.1 Bcf per day. In 2022, the company's total proved reserves increased by 6% to nearly 13.6 billion BOEs, this resulted in a 265% replacement of 2022 production, at an FD&A metric of $8.39 per BOE, including changes in further development costs. Overall, 2022 annual natural gas production was approximately 2.1 Bcf per day, which is a 23% increase over 2021 production levels. For North American operations, 2022 annual natural gas production was approximately 2.08 Bcf per day versus the 1.68 Bcf for 2021, up almost approximately 395 million cubic feet per day, primarily as a result of the company's strategic decision to invest in liquid-rich natural gas areas through our drill-to-fill strategy, adding low-cost, high-value, liquid-rich gas production as well as opportunistic acquisitions completed late 2021 and early 2022. On an annual basis, our 2022 North American natural gas operating cost was $1.19 per Mcf, an increase of 3% from 2021 of $1.15 per Mcf, primarily due to increased energy costs. For the fourth quarter of 2021, North American natural gas production was approximately 2.1 Bcf versus 1.84 for Q4 2021, with operating cost of $1.22 per Mcf versus $1.08 in 2021, once again, reflecting the higher cost of energy. For North American light oil and NGL the 2022 annual production was approximately 110,000 barrels a day, up 16% from 2021, primarily as a result of strong drilling results. Q4 production was 112,989 barrels per day, again, up 16% when comparing to Q4 2021, with quarterly operating costs of $16.47 per barrel as compared to Q4 '21 costs of $14.61 per barrel, again, primarily a result of higher energy costs. For international assets in 2022 had an annual production of 27,233 barrels a day, a 14% decrease versus 2021 levels, primarily due to maintenance activities in the North Sea and natural field declines. Offshore annual production was 14,343 barrels per day versus 2021 of approximately 14,000 barrels with annual operating costs in 2022 of $17.25 per barrel versus 2021 at $14.73. In the North Sea, annual production averaged 12,890 barrels in 2022, down from the 2021 level of 17,633 barrels per day and an annual cost of approximately $89 per barrel. Moving to heavy oil, the 2022 annual production was approximately 67,700 barrels a day in 2022, an increase of 5% versus 2021, reflecting strong drilling results, increased development activity offset by natural field decline. Q4 2022 production was strong at 253,188 barrels per day, down 4% from Q4 2021 levels, with operating costs of $17.20 per barrel, reflecting higher energy costs when compared to Q4 2021 of $13.08 per barrel. At Canadian Natural's world-class Oil Sands Mining and upgrading assets, we had an annual production averaging 425,945 barrels a day of SCO, a decrease of 5% from 2021 levels, primarily as a result of unplanned downtime at both Scotford and Horizon during the year. The net present value of future net revenues before income taxes using a 10% discount rate and including the full company ARO, is approximately $151 billion for total proved reserves and approximately $184 billion for total proved plus probable reserves. Our fourth quarter financial results were strong and adjusted funds flow of $4.2 billion and adjusted net earnings from operations of $2.2 billion, driving full year 2022 adjusted funds flow of $19.8 billion and annual adjusted net earnings of $12.9 billion. We returned a total of approximately $10.5 billion to shareholders through $4.9 billion in dividends and $5.6 billion through share repurchases, equaling about 77 million shares repurchased in 2022; while at the same time, reducing our net debt level by $3.4 billion. Based on strip prices today and taking into account the final 2022 tax installment in Q1, capital profile and our current shareholder return framework, including dividends and a significant share buyback program, we target to reach the $10 billion net debt level late this year."
}