{
    "symbol": "ADUS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 12:24:02",
    "content": " First, even with the continuing labor challenges we are seeing in parts of our industry, our team grew revenue 11% to $240.5 million for the third quarter of 2022 as compared to $216.7 million for the third quarter of 2021. However, as we started to see in the second quarter, we did experience improved hiring in our Personal Care segment with hours per business day for the third quarter of 2022 increasing approximately 3% as compared to our hours per business day in the second quarter of this year. For our Personal Care segment exclusive of the New York Consumer Directed Program or CDPAP and ARPA funds, our same-store revenue growth was 7% when compared to the third quarter of 2021, up from a same-store growth of 2.5% for our second quarter of this year's as we expected. While our home health segment same-store revenue was flat when compared to the prior year, we did see a 15.1% increase in same-store admissions over the third quarter of 2021. Our top line growth reflects positive same store growth trends in all three segments compared to the third quarter last year particularly in personal care, which at 7% was above our normal expected range of 3% to 5%. The revenue breakdown is as follows: Personal care revenues were $179.2 million or 74.5% of revenue; Hospice care revenues were $51.4 million or 21.4% of revenue, when compared to the third quarter last year hospice care revenues include the addition of the hospice division of Armada, which closed on August 1, 2021, and the acquired hospice operations of JourneyCare, which closed on February 1, 2022. So just interested in how those bigger deals may break out between those two segments and then multiples that you're willing to pay at this point for home health and personal care clearly got some visibility on the home health rates, but obviously still flat â\u0080\u0093 it's flat, right, not up; and CMS also still talking about maybe continuing to put the behavioral adjustment in the rest of it into 2024 and beyond. And we think it's very important as we look at these deals â\u0080\u0093 larger deals included that we build on our markets; personal care, home health particularly while we will continue to look in the hospice market for small deals in markets where we currently have hospice operations you should see most of our focus over the next 12 to 24 months to be around either a larger personal care, fill-in personal care or we'd like to see a larger hospice â\u0080\u0093 home health deal that we can put on top of our personal care. But as far as the macro environment, I think, for us when we target deals, again, we're looking at where is the right geography, concentration of services, how does it fit into the three segments that we have today, but primarily focused, as Dirk said earlier on home health and personal care."
}