{
    "symbol": "WM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 15:23:02",
    "content": " The year-over-year increase in operating expenses as a percentage of revenue was largely driven by fuel and commodity price impacts, 70 basis points from higher fuel costs, 30 basis points related to the alternative fuel tax credits received in 2021 that have not yet been renewed for 2022 and 30 basis points from the impact of higher commodity prices on our recycling brokerage business. During the first half of the year, we've invested $856 million in capital to support the business, and we invested an additional $112 million to support the strategic growth of our recycling and renewable energy businesses. But when we put all of that together and think about our outlook for the full year and our performance in the first half, particularly relative to our original guidance, we can say that we're 60 basis points ahead of expectations on base performance, and that's a really strong outlook. And I think that's what you would see with our pricing is that if inflation starts to really taper back down, that you'd see a bigger percentage of our price go to margin improvement, not just cost recovery. If inflation comes back down to a more reasonable number, let's call it 3% over the next kind of 2 to 3 quarters, then I think we have a greater percentage of our price that actually goes to margin improvement and not just focused on cost recovery, which is kind of where we are today with the open market pricing. I mean, we've estimated it differs a little bit whether you're a residential customer versus a business customer, but it's probably 0.5% of a small business' overall spend. That's why we've talked about kind of the third of the big 3, which is cost control and taking advantage of the attrition in our business, the cost categories that we're looking at, not backfilling for have -- some of them have 50% turnover. And then you're right, the other piece is just very traditional solid waste acquisitions, tuck-ins, that -- where we may have kind of a hole in our network or we've got something that feels like it's -- it would be additive and makes a lot of sense for us at a reasonable valuation. The one thing I would emphasize, Michael, in terms of looking at the total company margin over that 5-year period, in addition to what Jim outlined specifically for commodity-based impacts and the ADS acquisition, is that when you think about the investment we're making in technology, it's showing up in our SG&A in a different way than it would have had we effectively decided to have SG&A dollars be to run the business model."
}