{
    "symbol": "SSTI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 22:43:06",
    "content": " Coplink X also realized strong bookings with a late Q4 2022 multiyear 7-figure deal, representing $1.2 million in annual recurring revenue. We're starting the year on a strong footing with approximately $80 million in ARR, a large booked and growing pipeline of domestic and international Tulsa gunshot detection deals, along with a growing pipeline of investigative and patrol management transactions, which exhibit faster and compressed contractor revenue time lines. We're also pleased to report that we had total bookings for the year of approximately $75 million, including three new investigate contracts that have not yet gone live. Fourth quarter revenues came in at $21 million, a 50% increase over the $14 million in the fourth quarter of 2021. In Q4 and similar to Q2 and Q3 of 2022, our expenses for the quarter were reduced due to a reduction in the contingent consideration liability related to the Forensic Logic earnout by approximately $300,000 as the Forensic Logic-related revenue in 2023 is slightly lower than originally expected. This contingent consideration adjustment by itself reduced our expenses for the quarter, but these ongoing reductions in contingent consideration also affects our tax projections and increased our tax expenses by slightly over $1 million for the year in total, which reduced our overall net income. Breaking down our expenses, sales and marketing expense for the fourth quarter was $5.7 million or 27% of total revenue versus $3.6 million or 26% of total revenue for the prior-year period. We start with almost $80 million in ARR, adding approximately $4.5 million of GAAP revenue from the pace of expected go-live miles and $4 million of professional services from our Leeds division totals over $88 million. We've already seen, as we mentioned, Forensic Logic, it's going to be somewhat flat, adding about $6 million in '22. And ultimately, we expect it's going to get closer to 70% or 70-plus percent over the next several years because the majority of - well, all of our projects right now, especially the three new ones, are all software of nature that are going to have gross margins closer to what you would see with the software product. So when you think about, when I said, adding $4.5 million of GAAP revenue for miles, when we built our guidance last year in '22, it was probably closer to about $3.7 million. So it effectively did lower some of the actual revenue that we got, now for a good reason, though, because originally, we thought that would be around $4 million to $5 million, now it's significantly higher than that."
}