{
    "symbol": "ZH",
    "quarter": 1,
    "year": 2021,
    "date": "2021-05-17 14:09:04",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to the Zhihu Incorporated First Quarter 2021 Financial Results Conference Call. Joining us today are Mr. Zhou Yuan, Chairman and CEO of Zhihu; and Mr. Sun Wei, our CFO. Before we start, we would like to remind you that today's discussion may contain forward-looking statements which involve a number of risks and uncertainties. I'm pleased to deliver today's opening remarks on behalf of Mr. Zhou Yuan, Founder and CEO of Zhihu Inc. Our average MAUs reached 85 million, representing a year-over-year growth of 38%. Even after the significant growth we realized in Q1 2020, currently most users spend more time online due to the COVID-19 pandemic. Our revenue increased significantly, growing 154% year-over-year to RMB478.3 million. Most impressively, our content-commerce solution also known as  plan continues to deliver expectation beating results, contributing RMB121 million in revenue during the first quarter. In addition, our growing merchants and brand portfolio for the business line also represents a much broader industry coverage, such as fast-moving consumer goods, education, beauty and personal care as well as daily live services. We see great growth momentum in the bus line, delivering optimal marketing efficiency to our customers and contributing commercial content to our users. The Zhihu's advertising business continued its rapid growth in Q1 2021, effectively overcoming the negative impact of COVID-19 on the Internet advertising sector. In the quarter, our advertising revenue reached RMB214 million, representing a year-over-year increase of 70%. My first question centers around, MAU progression, which we note has done very well. My second question, at the time of the IPO, you talked about, you disclosed what the total visitor number was. We had a very high percentage of new users coming from the content created by the organic traffic, and in terms of performing our new users, we noticed that they are presenting the same features and behaviors generally. However, relatively speaking, I should say, the final new users are giving us a higher percentage on a year-on-year basis. In terms of our content, our ecosystem has been growing very sustainably, and we are well penetrating into a wider range of topic areas. For instance, our unique visitor number increased by 220% in material science and by 560% in microeconomics year-on-year. Whereas at the same time, we are also well positioned in other topic areas such as hobbies, for instance, in ACG, in 3Cs and in gaming, the content and content creators are also very active. In terms of -- on top of knowledge sharing and interest discussion, we are also helping our users to solve their actual problems. Right now, every day, there are more than 1 million users looking at those informations. So these will help our users not only to share their views about their interest, but also solving their actual problems in their work and life. We see that in both retention rates and impact, these new contents are giving us very nice numbers in terms of users that we have, and we will continue to invest and gaining more and more users this way. As to your second question, mostly viewers we are having right now is 460 million, maintain a stable level. And also, the percentage of MAU to monthly viewers, are also state of -- a stable uprising trajectory. So video content is a very important part in our ecosystem and in the past couple of months, you see that our value of video, both in terms of creation and consumption increased significantly. For those videos that are over 1 minute long, the daily uploading volume increased by 17x on the past quarter. Our Zhihu community is very open and highly accommodating to different kinds of content creators, different kinds of media formats and given kind of user groups. So right now, you see video penetrated DAU is now over 30%. And also, as we are progressing in our product as well as technology innovation, video is going to be a very important element to content creators as one of their creation tools. As you can see in our community, video is presenting very nice growth rate. On the other hand, in the entire industry of video, mid-form video is still at a very early stage. If you look at many other similar content communities, if we put all uploading volumes of mid-form videos altogether, the daily uploading volume is only by hundreds of thousands. Unlike many other platforms, our community video strategy is driven by our ecosystem, which is very healthy that promotes the good quality to come out from the rest. In Q1, we're actively taking some measures to control the low-quality content, meaning that it will give more exposure opportunities for better quality video. And also at the same time, our content creators for better quality videos are enjoying a wider space for the creation. And in the second quarter, we expect -- we hope to make some structural changes to the content videos as well as we further build on our ecosystem so that as an entirety, our video business will continue to grow very fast. I'll try to answer the second question from Alex, regarding the gross profit margin. This is from CFO, Sun Wei, of Zhihu, and the answer to the gross margin is by 2021, our Q1 gross margin stood at 57%, which represented a very significant increase over the same period last year. For instance, for our  business in 2020 first quarter accounted for only 1% of our total revenue, whereas by the Q1 2021 is accounting for 25%. And our revenue contribution from paid membership and advertisement stood at 67% and 30%, respectively, in the first quarter of 2020 whereas the percentage has now dropped to 45% and 26%, respectively. So therefore, you see that our higher-margin business that is  is contributing more to our gross margin as a whole. For instance, the costs for brand bandwidth as well as for our servers are not increasing at the same place as we are increasing our user base and our business. Therefore, due to the economy of scale that we're getting from the fixed items of costs, we are also registering a higher gross margin. Going forward, I think in the next couple of quarters, we might see some slight changes in our gross margin level as we are seeing very nice perspectives in terms of the video content that we have. Therefore, we will invest a little bit more in encouraging the video creation and content creators by compensating them more on their content creation and video format. And my second question is about your sales and marketing expenses, which nearly tripled in the first quarter of '21 compared to the same period last year. First, well, actually, in Q1, content commerce solutions speaks our expectations for that, which registered a revenue of 121 million accounting for about 89% of the end of the numbers that we got from the last year entirely increasing by over 100% and even on a quarter-on-quarter basis. As for the drivers behind Content-commerce solutions, I would say that we are very happy to see that both the number of the brands and merchants on our platform are on the rise as well increased by about 10x if you compare the number in Q1 2020. And because they are larger volumes of merchants working on our community platform, we are seeing very nice price out of the bidding from the merchants. So in conclusion, I think I would say that both the volumes as well as the price are the drivers behind our CCS growth, Content-commerce solutions. In terms of industry concentration, we see very nice popularities from the sectors such as FMCG, education, beauty progress, 3Cs and automobiles, whereas we're seeing very nice conversion rate from the CCS that we're having. As to your second question, the increase of sales and marketing expenses in our Q1 -- well, I should say that in January, we were celebrating the tenth anniversary of Zhihu as a community. Therefore, we launched a number of brand campaigns heavily in the country such as nice party adventure as well as the award ceremony for a new generation of knowing, which is very welcomed by the community as a whole. And this helped us a lot in building our brand recognition, and that is why we see a jump in terms of our sales and marketing expenses, especially in this Q1. That said, I should say that we're still very secondly in terms of our sales and marketing expenses and looking at the efficiency of our marketing dollars spend. Well, our advertisement business revenue increased by 70% compared with the previous year that was mainly contributed by our brand advertisement. Instead, we will rely on the increase on our user base, the better and higher recognition of our Zhihu as a community and also diversifying our format so that there will be more forms for consumption on our advertisement on our community. Due to time constraints, that concludes today's question and session."
}