{
    "symbol": "ZH",
    "quarter": 3,
    "year": 2021,
    "date": "2021-11-22 13:50:02",
    "content": " As of the end of the third quarter, the cumulative pieces of content on our platform reached 458.9 million, including 398.4 million questions and answers, representing a year-over-year increase of 43% and 38%, respectively. Additionally, our average number of monthly active concentrators increased to 3.6 million, of which the average number of monthly video content creators increased 86% year-over-year. It is encouraging to see more and more users in our community consuming content with timeliness, with a related video penetration rate exceeding 40% at the end of third quarter. In Q3, the percentage of female users grew to 47% from 44% in the same period of last year, along with the improvement of content timeliness of a user group of those who over 30 also grow steadily in both numbers and activeness, further solidifying our unique and vibrant community ecosystem, at the same time, expanding our content formats capabilities enabled us to satisfy younger generations demand for learning life and entertainment. More brands and business partners are recognizing Zhihu as an important platform to gain visibility, and more concentrators joined Zhihu’s ecosystem we were able to cooperate with a huge number of commercial content creators in different specialties, and together, make achievements and share the benefits by expanding user coverage and improving commercial efficiency. In the third quarter, the number of brands and merchants that use our content commerce solutions increased 200% compared to the same period of last year, and GMV on our platform reached a new high of nearly RMB5 billion, representing a year-over-year increase of 92% as of the end of third quarter. In the quarter, advertising revenue was RMB321.1 million representing a 39% year-over-year increase underpinned by our advantage as a comprehensive content platform and increasingly wide range of advertisers now consider us as a marketing platform, due to our ability to continue to connect their ad wares with our broad user base."
}