{
    "symbol": "ZEUS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 12:12:03",
    "content": " In 2022, our record cash flow resulted in $162 million or 49% reduction of debt, providing increased liquidity for higher return growth opportunities, including the January 2023 purchase of Metal-Fab. In January, we upsized our asset-based revolver from $475 million to $625 million, providing additional capital to further execute our growth strategy through acquisitions and robust organic growth expenditures, while simultaneously rewarding our shareholders with an increased quarterly dividend of $0.125. We finished the quarter with $11.9 million of adjusted EBITDA, and in the face of the largest and steepest decline ever in metal pricing, we delivered over $37 million of adjusted EBITDA during the second half of 2022. The Specialty Metals segment, led by Andy Markowitz, contributed EBITDA of $9.1 million in the fourth quarter of 2022, a record earnings year in spite of the considerable decline in the nickel surcharge and an increase in stainless steel coil imports throughout the year. The Pipe and Tube segment led by Bill Zielinski contributed adjusted EBITDA of $6.3 million in the fourth quarter of 2022, and as Rick noted earlier, had a record earnings year. Adjusted EBITDA was $11.9 million for the quarter and $152 million for the full year, making 2022 the second most profitable year in our companyâ\u0080\u0099s history. Following the $131 million acquisition of Metal-Fab, our availability remains in the $300 million range, providing us with significant capital to continue our growth and diversification strategy through investments in acquisitions, new capacity and automation to drive increased efficiency. Consolidated operating expenses totaled $81.6 million for the fourth quarter, a decrease of $8.9 million or 9.9% from the prior year quarter. During the first quarter of 2023, we expect to record approximately $4 million to $5 million of required GAAP related purchase price expenses and adjustments, primarily expense deal fees, the write-up of inventory to fair market value and the amortization of certain acquired intangible assets. Year-over-year, we were down about $9 million and when you kind of adjust out for the incentive, the incentives that are performance based, we basically saw about a 4% inflation fourth quarter of 2022 versus fourth quarter of 2021 and thatâ\u0080\u0099s down from what we saw early in the year."
}