{
    "symbol": "LVS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 19:55:06",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the Sands First Quarter 2022 Earnings Conference Call. It is now my pleasure to turn the floor over to Mr. Daniel Briggs, Senior Vice President of Investor Relations at Sands. Joining the call today are Rob Goldstein, our Chairman and Chief Executive Officer; and Patrick Dumont, our President and Chief Operating Officer. Also joining are Dr. Wilfred Wong, President of Sands China; and Grant Chum, Chief Operating Officer of Sands China. With that, I'll turn the call over to Rob. Our results continue to reflect the pandemics impact, the travel restrictions to press visitation, our financial results in both Macao and Singapore this quarter. The  in Singapore as the travel corridors established last quarter have been replaced with an introduction of the backdated traveler framework, which allows backdate travelers to enter Singapore in much the same way as prior to the pandemic. In short term, as we are open for business in Singapore. In Macao, our considerable investment Londoner are nearing completion. As the market recovers 4 Seasons, Londoner will provide growth opportunities in both premium and mass customer segments. We continue to have the largest footprint in the Macao marketplace, and we appreciate the opportunity to provide input in the public consultation process, and we look forward to participating in the retendering process as well. While the current quarter results in Macao were impacted severely by the enhanced travel restrictions in China, customer demand and spending Macao have proven resilient at the premium mass level from both a gaming and retail perspective in periods when the restrictions have been relaxed. In addition, we continue to pursue opportunities to develop large-scale resorts in both the United States and Asia. The sale of Las Vegas was completed this quarter, which creates additional liquidity and optionality. Lastly, we can build out our digital presence and to explore multiple opportunities. Paul, we're ready to go to questions. Joe, it’s a fair question. I started $17 million in January, went to $46 million in the hours of February. I think – look, Singapore is back, and it will experience the same post-COVID numbers as you see in the U.S., in my opinion. The demand is there. So $58 million in March feels pretty good, and that momentum is continuing. And hopefully, I’m not going to follow up Macao-related question but is much to ask. Yes, I think it’s premature, Joe, and we’re looking at a lot of different things in Asia, and that’s certainly a list of things, but I think it’s premature to get ahead of ourselves there. There's obviously been a lot of back and forth in New York, specifically New York City, different boroughs, you've been seeing some headlines around Times Square. Well, New York has been on our radar for a long time. And we'll just keep you posted as we hear and learn things, but we're in the hunt and we'll see how it works out for us. And then you did mention you'll discuss digital when the time is right and they obviously say patience is a virtue, which is clearly paid off looking at some of these stocks. So it's very early on, and we have something to talk about, we'll definitely start discussing it. But at this point, it's a very early stage. I think you maybe have mentioned this in the remarks, but just remind us in terms of thinking about capital allocation priorities. And we think there's a lot of them out there, a lot of potential. And as Rob said, where we can invest to get the highest returns. In terms of return of capital, I think we've always said that the dividend is really the cornerstone of our turn capital program. It's something that we want to look at in terms of really long-term operational cash flow growth, and then we'll size it accordingly and look to that to recur before we actually start the dividend again. In terms of share repurchases, we've always said we've been opportunistic to return capital that way as well. If you look at our past, we've actually returned a fair amount of capital through share versus when we felt that we had the excess liquidity. So I think at this point, our priority is to make sure we get out of the pandemic, make sure we have ample liquidity and a protected balance sheet to ensure that we recover from our pandemic operations. Then we're going to focus on new development and growth and investment in our existing markets, which we've been doing throughout the pandemic and then we'll look to restart the dividend as operating cash flows recover. And then lastly, I think we'll look at share repurchases where the opportunities arise. Rob, there have been some different starts as it relates to the reopening in Hong Kong, and I think some positive progress there as case counts have come down. I mean at this stage, there is no new information or news in terms of quarantine-free travel from Hong Kong to Macao. Either, I think arriving in Hong Kong and then, I guess, coming in from inbound places or leaving Hong Kong going to places like Singapore. Well, specifically talking about -- just is there any sign that Hong Kong is loosening of its overall visitation policy because it's been pretty closed from the external perspective. So you can go to Hong Kong from next month overseas into Hong Kong, but you would still have to be subject to the quarantine policy once you enter Hong Kong. I mean it's demand over there for -- in the month of March, we saw outsized demand from free independent travelers on the pure leisure side, we saw premium mass. It's -- obviously, in Macao is in a difficult place right now, so people are going to gravitate to other opportunities. I think our MBS products as a very, very unique opportunistic window here. But until it does, I think you'll see a lot more demand than typical. I think it's from all segments, the team there is being very good about what happened in the month of March. And again, it's leisure travel, it's casino, it's is VIP casino, it's premium mass as casino. And hopefully, without a COVID interruption or a change in policy, I believe MBS is going to be very productive '22. And then my follow-up question is about you had an announcement a week or 2 ago about it's probably a small investment, and I think it was sort of an integrity-related business for online sports betting. So from our standpoint, we're looking at a variety different businesses that are in start off or early stage in order to make sure that we stay in front of technological innovation in our industry. It is a relatively small investment relative to Las Vegas and -- we think over time, this investment in others will help contribute to our overall digital efforts. And I think over time, you'll start to see how that evolves. And I don't know, Rob, maybe answer the first and then perhaps something on color on Macao and the time line there. But just in terms of MBS, obviously, construction and things along those lines in this type of environment is very hard to predict. And then secondarily, as it pertains to the tender process and whatnot in Macao. Carl, in Singapore, as you know, we're underway in a rather extensive renovation, $1 billion-plus renovation in Singapore that's underway as we speak. We've had -- as everyone in the world has been impacted by COVID, both getting supplies and labor has been issued, but it's happy it's underway. We intend to complete IR 1, again, '23 IR2 is token for interpretation. As for Macao time lines and the retendering, I'm going to turn it over to Wilfred or Grant to take that question. Now currently, a few things are at play, 2 bills relating to the gaming law is -- has been approved by the legislative assembly and will be approved in full after the panel discussion before the end of this legislative session in August. At this stage, we are going to be granted an extension of the current concession until the end of 2022. And so after the amendment of the law, then the retendering procedure will start a lot of information about the retender will come out. We are in the process of preparing for that retendering exercise and hopefully, everything will be done before the end of 2022. And then that period from, say, August, if not maybe earlier through December will be the formal tendering process when everything is more or less buttoned up. I think, as you know, the cessation of operations of all of these fixed-room junket promoters, obviously happened fairly recently in December of last year. And as a result of that, obviously, there are some new court cases being raised by various stakeholders and participants in that system. Currently, there is nothing material to report from Sands China perspective. There are a few cases ongoing, but none of them are material, and we will continue to monitor the situation and obviously report back if there any changes. Now clearly, the first quarter was quite difficult for your Macao operations is putting a lot of stress on your balance Sands China. Yes, we've received some stress over the last few years under the pandemics tough operating conditions, I think we all have. I think the good news is also that we were an investment-grade company during the pandemic, which does a lot about the market's view about our ability to raise additional capital. So from our standpoint, I think we have a lot of flexibility. And I think where we are today is we'll look to see how the operations continue coming out of the pandemic, which hopefully soon, look at our liquidity to review. I think we have cash of the parent, we have cash around the system. So I think we have a lot of flexibility, and we'll use it as net\n Next question is coming from Chad Beynon from Macquarie. Obviously, margin is inflation. We're going to be really -- I'd be shocked if will see a big return in Singapore this year and then hopefully a big return in Macao in '23, hopefully, maybe '22, I don't know. We don't have any visibility more than you do about what's going to happen in China, to be clear. But I do think, just like here in the U.S., margins have gone very powerfully positive because the demand is there. The equation is going to be driven by excessive revenue, I think, in Singapore, we'll see it this year, I believe, and hopefully see in Macao this year or next. As for the operating entities, Grant discussed as you see as far as Macao, for example, in wage inflation, I don't know how to address that question. I think right now, Macao is a slightly different situation. If you look at the wage trend, it's very moderate, if not flattish in terms of wage inflation. But obviously, that's for reasons that are not hard to discern because there is pressure on unemployment since it's such a tourism-dependent economy. And then interestingly, in terms of construction works costs are, again, either in line with prior years or if not going down somewhat, again, because of the demand supply situation that's specific to Macao as a lot of large scale works have moderated, they being completed. So at this stage, we're not seeing any significant signs on the inflation front. Of course, there are some supplies such as food and so on, where we do experience inflation, but obviously, thoughtful for the totality of our business, this is not going to be material. But I think the important point is what Rob said, I think you also have to consider for our type of business, the revenue side of the equation, which I think is going to be the more dominant driver. You see that in the U.S., you'll see it in Singapore and you'll start to see in other markets in Asia. So that is something that is a likely thing to be seen, you're already experiencing a little bit of it in certain markets. I think the other thing is, the good news is that inflation also comes pricing. It's always been very tight, and we've always managed it. We have the ability to change rates as a hotel as a consumer products company and really work through the changing inflation and in effect, make that part of the business margin. And the reason I say that is our core business, and let's be honest, our balance sheet is what it is. If our business returns in Singapore, like we anticipate, -- and then behind that comes to Macao, we get back to $4 billion or $5 billion, $6 billion EBITDA. But at this time, we're going to stay doing what we're doing now, which is being very disciplined waiting for our core business return because there's no 1 like us. If the Macao comes back and I think it will be back hopefully sooner than later, Singapore is coming back, we'll be in a very different place in 6 months or a year and that may change our thinking. Our company has a history of being a platform of development in entrepreneurship, and we are taking that approach through our digital efforts in several different areas. And we think over time, that will provide the most reward for shareholders. In our mind, we'll execute against our long-term strategy and take advantage where we can. If you sort of have your druthers or how your wishes come to pass, what does the LVS U.S. land-based presence look like over time? So that limits the opportunities doesn't to Texas, New York. We failed in Florida recently, but we're not done with Florida. And there thereaf places we can go and invest the kind of money on investment, the kind of returns we want, we're not going to be buying small businesses. So I think at this point, as you talk to you today, it would have to be Texas, New York and perhaps Florida. Rob, you talked about getting to that $1 billion EBITDA run rate in Singapore by potentially by the end of the year. Well, I guess, looking at March, you're at about $700 million run rate if you take you annualize March, and April looks better at this point. I mean, to be honest, I don't know why we wouldn't get there. We won't get into specific numbers in April, but the trending Singapore, as I referenced earlier, Robin, someone asked the question about what's happening it's outsized demand in all segments. I mean I think it's going to blow past the $1 billion, frankly, I think it should. I think we compete very well anyway in Singapore, but it's unique now. The only negative there, as you well know, is China is still relatively close to us. In the last month, things have gone from hesitancy to full-bore excitement about what's happening in Singapore. Can you remind me, is that -- I believe there was some tax changes coming into play, I guess, simplistically, VIP and mass each go up roughly 300 basis points. Yes, it was as of March 1, that was - were impacted as of March 1 by the changes you referenced, yes. And then two, I think in the last few days, there's been some changes in Singapore regarding travel restrictions -- can you remind us maybe -- can you just refresh us where we are today versus where we were in March? Where we are today is if you're a vaccine, you can get into Singapore pretty easily. There are still restrictions and you've got to be -- if you're in the casino, you've got to be smoking or drinking water or something to I think your mask off. But pretty much, it's -- if you're a vaccinate, you have full access to Singapore. And then just last quick one, not to get ahead of ourselves, but -- you mentioned $1 billion a few times. But why not, I mean you're doing $1.7 billion, right, pre-COVID and the new hotel coming, like what's -- is the billing just a round number to --\n There's no new hotel coming. Look, we just see $1 billion of benchmark. The demand is there. And again, as we referenced, that's a very unique asset. We get back to some time Yes, I think we will and then beyond that, but it won't be this year. You may disconnect your phone lines at this time, and have a wonderful day."
}