{
    "symbol": "LVS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-20 20:38:04",
    "content": " And I think we're all struggling a little bit to know exactly what Asia is going to do, but we can all I think do the math, if visitations down 50 and obviously, you're 75% or 80% of your productivity levels already that's just very good spend per visit levels, but obviously, don't want to extrapolate just from the airport, if you could give us a little bit more guidance. That's why I referenced the other high end luxury hotels are lots of sleeping rooms, who we benefit from, they come to shop, eat with us, gamble with us, we're not getting that lift, I think that's the -- could be a very impactful down the road, we're very happy to spend levels we're seeing, and we're happy with the occupancy we're getting, but we're not getting that extra people don't sleep in our hotel unnecessarily coming over to gamble, shop, et cetera. And so we're going to look to do that, before we look to buy anything, I don't think the idea is that we would never look at something, I think we're always interested, I think we're interested in seeing if there's a way to create greater returns for our shareholders. I think they're really premium salons, premium gaming salons that could be applicable and used by the different segments whether that's the VIP rolling or the premium mass. So to me, it's a very valuable transition to a higher focus margin business, that enables us to again, Singapore, I mean, Macao, the penetration is Chinese still, I think sub 3% for the China population, there's going to be a growth market, capacity will be an issue down the road, because there are new casinos opening. And so over the next couple of quarters, as we have rooms out of inventory, it's going to -- there's going to be some choppiness, but by the time we're done getting into '23 and getting across '23, when the project is completed, then you'll have a good look what ADR can really be under the value of the full investment, which is substantial. So, given the momentum you're seeing in Singapore and the recovery is still in its infancy, how do you think about the long-term path to getting back to pre-COVID, the $1.7 billion of EBITDA in the event China doesn't open, do you need China to reopen to kind of get back or get close to that level or given what you're seeing now, do you have a line of sight to getting near there in the absence of China reopening? And we're watching like you are, I think, let's not ever dismiss the importance of China in any of our businesses, China's still a powerhouse as a consumer market."
}