{
    "symbol": "ENPH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 22:01:04",
    "content": " After the speakers’ presentation, there will be a question-and-answer session. As a reminder, today’s program is being recorded. I would now like to introduce your host for today’s program, Karen Sagot. On today’s call are Badri Kothandaraman, Enphase’s President and Chief Executive Officer; Mandy Yang, Chief Financial Officer, and Raghu Belur, Chief Products Officer. After the market closed today, Enphase issued a press release announcing the results for its first quarter ended March 31, 2022. During this conference call, Enphase management will make forward-looking statements, including, but not limited to statements related to our expected future financial performance, the capabilities of our current and future technology and products, and the benefits to homeowners and installers, our operations, including manufacturing and customer service and supply and demand, the anticipated growth in the market and in ourselves and regulatory matters. For a more complete discussion of the risks and uncertainties, please see our Annual Report on Form 10-K for the year ended December 31, 2021 on file with the SEC and our quarterly report Form on 10-Q for the quarter ended March 31, 2022, which will be filed with the SEC in the second quarter of 2022. We caution you not to place any undue reliance on forward-looking statements and undertake no duty or obligation to update any forward-looking statements as a result of new information, future events, or changes in expectations. Also, please note that financial measures used on this call are expressed on a non-GAAP basis, unless otherwise noted and have been adjusted to exclude certain charges. We’ve provided a reconciliation of these non-GAAP financial measures to GAAP financial measures in our earnings press release posted today, which can also be found in the Investor Relations section of our website. Now, I would like to introduce Badri Kothandaraman, President and Chief Executive Officer of Enphase Energy. We reported record quarterly revenue of $441.3 million, achieved non-GAAP gross margin of 41%, and generated free cash flow of $90.1 million. We exited the first quarter at approximately 41, 15 26. This means 41% gross margin, 15% operating expenses and 26% operating income, all as a percentage of revenue on a non-GAAP basis. As a reminder, our baseline financial model is 35%, 15%, 20%. Our Q1 Net Promoter Score worldwide was 68% and compared to 69% in Q4, and our North American Net Promoter Score was 74% compared to 73% in Q4. During Q1, we added field service technicians in the U.S. and Europe to provide on-site help to our installers, particularly for batteries. As we have discussed in the past calls, the global supply chain situation is still under stress, but our situation is stable due to supplier management and qualification of alternate suppliers. With the growing demand for our microinverters, we remain vigilant regarding the global supply chain and logistics challenges due to COVID disruption. Currently, our quarterly capacity across all contract manufacturing facilities is a little more than 5 million microinverters. Mexico has a quarterly capacity of 2.25 million microinverters, India with Salcomp has 1.5 million, and the rest is in China. To support the increased demand and to improve delivery times to customers in Europe, we are adding an automated line at FLEX’s factory in Romania. This line will have quarterly capacity of approximately 750,000 microinverters starting in Q1 of 2023 and will enable a global capacity of nearly 6 million microinverters per quarter. Our lead times for batteries are still long at about 14 to 16 weeks, primarily due to global logistics challenges. U.S. and international revenue mix for Q1 was 84% and 16%, respectively. In the U.S., revenue increased 9% sequentially and 49% year-on-year. The channel inventory for both, microinverters and batteries, were at a healthy level at the end of Q1. In Europe, revenue decreased 6% sequentially while increasing 39% year-on-year. We continue to see strong growth in our existing markets in Europe, including Netherlands, France and Belgium and are also pleased with our growth in newer markets, including Italy, Spain and Portugal. In Latin America, revenue increased 13% sequentially and more than doubled year-on-year. Now, I’ll provide some color on Australia, Brazil and India. In Australia, we expect to introduce IQ batteries in the second half of 2022. We think regulatory changes designed to improve solar installation practices will favor our safe AC approach, as grids and utilities require more intelligent and safer solutions. As for Brazil, we have started shipping IQ7+ Microinverters to installers in Q1 and expect to ramp continuously. In India, we are making steady progress in adding more installers into our network, ramping digital sales and planning to introduce IQ batteries in early 2023. The component availability is better than what we have experienced in the last 18 months, but there are still global challenges, which are not specific to Enphase. We shipped 120.4 megawatt hours of IQ batteries in the first quarter, a 20% increase from Q4 of 2021. While we have done various fixes to improve quality and homeowner experience of the batteries, we are still not where we would like to be on commissioning and installation experience. Due to the increase in logistics and component costs driven by inflation, we implemented a modest price increase on our batteries in March of 2022. By the end of the first quarter, we have certified more than 1,300 installers in the U.S. on a cumulative basis. We started with an Enphase YouTube channel in Q1 for training, where installers can access videos to learn installation tips and tricks. In Q1, we ramped shipments on IQ8 Microinverters in North America and are receiving positive feedback about the product in general. As a reminder, IQ8 solar microinverters can form a micro grid during a power outage using only sunlight, providing backup power even without a battery. And with our Sunlight Jump Start feature, IQ8 Microinverters can start a home energy system using sunlight only after prolonged grid outages that may result in a fully depleted battery. We started piloting IQ8D 640-watt AC microinverters to select installers in North America during the first quarter, and we expect production shipments in late Q2. The value proposition of IQ8D is the ease of installation, high-quality and rapid shutdown capability. On batteries, we plan to introduce our next new product, IQ Battery 5P later this year. This battery will deliver twice the power of our current battery at a lower manufacturing cost, enabling homeowners to start heavier loads. Also going forward, we will enhance our communication using control area network, which is a robust wired protocol for connectivity between the battery, the gateway and the system controller. Let’s now discuss ClipperCreek, an acquisition, which we completed in Q4 of 2021. The acquisition is performing in line with our expectations, with reasonable gross margins and profitability in Q1. As for new products, we expect to introduce a smart EV charger to customers in the U.S. and Europe in early 2023. This increase will drive adoption of more solar and storage, which will enable homeowners to save money and charge their vehicle in a green manner. This acquisition plays extremely well to our strength in energy management, ultimately helping the homeowner manage solar, storage, EV and other home loads. During the first quarter, we announced that Vermont-based utility, Green Mountain Power will offer Enphase Energy systems to its customers in a cutting edge battery lease grid services pilot program. We have previously announced our participation in connected solutions covering 3 utilities in the Northeast U.S., Hawaiian Electric’s Battery Bonus Grid Services program and Arizona Public Service’s Residential Battery Grid Services Program. We also recently announced a partnership with Swell Energy to participate in VPP programs in California, New York and Hawaii. We are working on Solargraf Pro, a design and proposal tool with shading analysis, ability to detect obstructions on the roof and 3D modeling of homes. We expect to launch the Solargraf Pro, a higher version -- advanced version of the product in Q2 and already have a few installers piloting the software. In addition, we plan to expand the availability of Solargraf Pro internationally, starting with Germany. In March of 2022, we acquired SolarLeadFactory, which provides high quality leads to solar installers in the U.S. Our objective is to substantially increase lead volumes and conversion rates to help drive down customer acquisition costs for installers. We plan to expand the team, optimize lead management and offer this service broadly to our installer network. We have made four acquisitions in the last 15 months to strengthen our installer platform in the areas of lead generation, solars, design software, permitting services and O&M software. In addition, we have robust and homegrown mobile apps for commissioning and monitoring of solar and storage systems. We plan to integrate all of these seamlessly onto one platform and offer them to our installation network, simplifying their lives and reducing soft costs. We have now onboarded approximately 1,200 installers to our EIN worldwide through highly selective process focused on installation quality and an exceptional experience to homeowners across the globe. Next, I’d like to comment on some recent policy issues that are impacting the U.S. solar industry. As you’re aware, the U.S. Department of Commerce is investigating the circumvention of antidumping and countervailing duties on some PV modules. Utility costs are rising, climate change is happening, geopolitical issues are driving energy security and EVs are taking off. At a time like this, when there needs to be full support for renewable, an AD/CVD investigation creates massive uncertainty in the marketplace which we believe will impact U.S. jobs, raise electricity prices for homeowners and increase import from China, all of which are counter to the goals of the current administration. We are hoping that the current administration takes this problem seriously and resolves it rapidly, well before the proposed August time frame. As it relates to Enphase, our products aren’t directly impacted by AD/CVD as we don’t make modules. But based on conversations with some of our partners, it is our opinion that the module supply for the residential segment will be less impacted than other segments. Module pricing is expected to be higher in the interim, and we think the residential segment may be able to absorb higher prices. All of this further underscores the importance of supporting domestic manufacturing through a production-based tax credit, or PTC, so we can proactively increase domestic manufacturing rather than reacting to such a market disruption. The support of domestic manufacturing is well-aligned with the administration’s goals to promote renewables, increase U.S. jobs, reduce electricity pricing for homeowners and lessen the dependency on imports from China. We would like to see rapid resolution of both, AD/CVD as well as implementation of PTC as soon as possible. I would also now like to comment on the California NEM 3.0 proposed decision, or PD, which was announced in the December of 2021. EVs are ramping up considerably for obvious reasons, so are heat pumps. Climate change, coupled with situations like the Ukraine, is forcing European countries and others to think hard about their reliance on oil, coal and natural gas. Countries like Germany are leading the way in adopting renewable technologies such as solar and batteries to support heat pumps, EVs and other home loads. We sell them to homeowners through our installation and distribution partners, enabled by our installer platform. Our top most core value is customer first, and we are focused on providing a great experience to installers and homeowners. I will provide more details related to our first quarter of 2022 financial results, as well as our business outlook for the second quarter of 2022. We have provided a reconciliation of these non-GAAP to GAAP financial results in our earnings release posted today, which can also be found in the IR section of our website. Total revenue for Q1 was $441.3 million, representing an increase of 7% sequentially and a quarterly record. We shipped approximately 1,029 megawatts DC of microinverters and 120.4 megawatt hours of IQ batteries in the quarter. The decrease was driven by lower marketing expenses, offset by continuous investment in R&D and customer service. On a non-GAAP basis, income from operations for Q1 was $114.5 million compared to $97.7 million for Q4. On a GAAP basis, income from operations was $61.8 million for Q1 compared to $57.7 million for Q4. On a non-GAPP basis, net income for Q1 was $109.7 million compared to $102.8 million for Q4. We exited Q1 with a total cash, cash equivalents and marketable securities balance of approximately $1.1 billion compared to approximately $1.0 billion at the end of Q4. In Q1, we generated $102.4 million in cash flow from operations and $90.1 million in free cash flow. Capital expenditure was $12.4 million for Q1 to increase manufacturing capacity as well as costs related to IT infrastructure, R&D equipment and international facilities. Now, let’s discuss our outlook for the second quarter of 2022. We expect our revenue for the second quarter of 2022 to be within a range of $490 million to $520 million, which includes shipments of 130 to 140-megawatt hours of IQ batteries. We expect GAAP gross margin to be within a range of 37% to 40% and non-GAAP gross margin to be within a range of 38% to 41%, which excludes stock-based compensation expenses and acquisition-related amortization. We expect our GAAP operating expenses to be within a range of $127.5 million to $130.5 million, including a total of approximately $57 million estimated for stock-based compensation expenses and acquisition-related expenses and amortization. So, just quick on the background for Europe. In general, we are quite strong in Netherlands, France, Belgium and those businesses or those regions continue to grow pretty well on the solar side. The new regions, if we talk about actually, our Germany, Italy, Spain and Portugal. The residential solar is well north of 1 gigawatt a year, maybe even up to 2 gigawatts a year right now on residential. Most of our installers say, for a given home when they mean solar, they mean solar, battery, EV charger and heat pump. So, they are much more advanced, probably the most advanced, I would say, in terms of full home electrification. So, there’s an incredible opportunity there for us. And the companies that will be successful are companies that can manage all of these resources, solar, storage, EVs and heat pumps. Now with ClipperCreek, we have an EV charger, we are quite strong in solar and storage. We care a lot about customer experience, customer service. So, that’s on our side. I was there late February to early March with our team and it’s really, really clear that the opportunity is big and now. Netherlands is primarily a solar market today, but storage is coming according to all of the installers. And installers are all -- they like Enphase a lot, primarily due to the attributes I told you, quality, customer experience. If you go to Italy, Italy has been promoting the heck out of batteries, the Ecobonus and the Super Bonus program. And these programs are -- will extend multiple years, may not be the Super Bonus, but at least the Ecobonus will be there. So Spain, for example, we have a natural advantage because of small systems in Spain. Because you go from Germany, you have a 12 kilowatt, 13 kilowatts of PV, you go to Spain, which is probably 4 kilowatts -- 3 or 4 kilowatts of PV. So, there is no barriers there, and we’re doing well. In fact, this quarter, the second quarter, we expect our revenue to be 40% higher than the first quarter. And with regarding our OpEx, you should continue to think of our OpEx as right at the baseline. Our OpEx is -- our baseline numbers, financial numbers are OpEx equals 15% of sales. Just super quick, if I can ask you to elaborate here as well. I.e., do you think about price inflation again just to pass it along, or how are you thinking about the battery part of the mix, both in terms of the trajectory and acceleration as well as the price points that you’re entering at? So, with regarding your specific question on raw materials, yes, cell pack costs have been a little bit up because our suppliers are facing issues in their supply chain, too. In the past, you have talked about how your order visibility into the coming quarter has either been in line or even exceeded at times what your guidance has been. But just given AD/CVD, lockdowns in China that are happening, maybe in other areas of the value chain. We got a lot of visibility into the second quarter, and we got visibility into the third quarter in terms of backlog, too. So, we only guide this quarter, meaning the second quarter, and we are very comfortable with these numbers. Like what I said in the prepared remarks, our demand is quite north of the higher end of the guidance range. Regarding COVID shutdowns in general, we are also seeing some shutdowns in China, but our factories remain open. There are hiccups in raw materials, getting into manufacturing in China from time to time, but we are managing it. So, I cannot predict what’s going to happen tomorrow. So, you mentioned the new markets you’re entering into, you’re obviously signing up new dealer partners. I mean, in places like Netherlands and Germany, I would say the market is growing so much. And, of course, we do take market share because of our quality and customer experience. Regarding new regions, like Spain, et cetera, they come to us because of our quality. Even in Netherlands, we continue to gain market share because of our service and quality. In Germany, we do gain market share from some string inverters because of -- one is we do supply all the components, we can do both solar plus storage, and we can manage the complete home energy system in the future, we can add an EV chargers in the future, we are able to work with heat pumps as well. So, they like our capability as energy management -- home energy management supplier, and sometimes we get the nod because of that. So, it’s a multitude of both. As it relates to the lockdown in Shanghai, I was wondering if you could drill in a little bit deeper on the potential impact, if any, on the cell supply. So, as far as the cell supply is concerned, right now, we have two sources of cell packs, both of them are situated in China. In terms of the lockdowns, our factories are still operating in China, our shipping is still active, the batteries are generally on the board with a lot of weeks in advance. Now we are planning for a long cycle time, 14 to 16 weeks. Like I said, I cannot predict tomorrow, but so far, it seems to be okay. On the battery costs, there are a couple of ways that we are working on battery costs. And therefore, we do all the standard price negotiation, but we are also sensitive to their increasing costs. And so there is limited things we can do in the time frame, but there’s a lot of things we can do. In terms of what we can do is what I call is the overhead, meaning you have the cell pack and then you want to convert that cell pack from DC to AC. This involves battery management, power conversion and associated electronics. And that’s where I think we can add a lot of value, which we are. So, first thing we are doing is the battery that’s coming out in the second half goes to a slightly higher modularity, meaning instead of 3.3 kilowatt hours, we are going to 5 kilowatt hours, so we can amortize the overhead over the 5 kilowatt hours making the overhead less. And so, in addition, that battery has got double the continuous and peak power. So, that’s got a natural cost advantage due to the amortization, the higher modularity. In addition, it provides customers with a superior customer experience compared to our current generation batteries. Then, on top of that, we are going next year into our next -- what I call as the next-generation battery, where we are taking individual microinverters, the same microinverters that we use on the rooftop, plus extra battery management circuitry, plus a bunch of connector boards. We are taking overall 7 boards and collapsing them into one, which is integrating the battery management plus power conversion into a big microinverter as well as utilizing some advanced technologies and unique architecture, which we got as a full bridge architecture. So that one will help us do a very high-power microinverter and we basically will be able to cut the volume of the battery almost by 40%, because everything is consolidated into a single board versus 7 boards. We’re not ready to quantify yet, but definite reduction in manufacturing cost for us. So, all of these initiatives, basically blocking and tackling for the present going to the next-generation battery for the second half -- sorry, going to the high power battery for the second half and the next-generation battery for 2023 will continuously improve our gross margins and also enable us to do the appropriate thing for customers in terms of price. Next question here is on IQ8 versus 7, our work a couple months ago suggests that you were and are forcing top customers to IQ8 from IQ7 starting this quarter in Q2, due in part, I believe, to some chip issues for the IQ7. Just for the record, we never force customers. Sometimes, if the problem is entirely ours, we will be able to give them appropriate adjustments for the given time frame. For some customers, the movement to IQ8, they want it to be on the latest and greatest product, and they negotiate it for a good deal to transition faster. And each customer there is a story, each customer we -- is unique, and we don’t force anything wholesale on customers. But the beautiful thing is IQ8 uses another from another manufacturer, and there is plenty of supply there. So basically, we were able to mix and match IQ7s and IQ8s and were able to support customers. We gave them some concessions for that quarter where it -- in your language, it seems like we forced them. But in reality, we don’t. Then in terms of the customer conversion, I’ve always said, it takes us 4 to 6 quarters to convert from 7s to 8s. In the first quarter, our total shipment of overall microinverters, 20% of them was IQ8. This -- meaning, Q1 I’m talking about, so. And it’s just math, as I said. When you take 100% divide it by 5, that’s 20% a quarter. And so, next quarter, we roughly expect that. Sometimes it may take 5, sometimes it may take 6, sometimes it may take 4, it depends. For Europe, we are going to introduce IQ8 in the second half of 2022. So bottom line, IQ8 is going quite healthy. But I want to see if there is potential for a new line beyond the one you’ve already talked about, which is 750,000 units per quarter by year-end. Well, I mean, it’s easy for. We started -- we are starting with an auto line, that’s 750,000 units. And if we think we need more, it only takes us three months. So, if we need it, we’ll pull the plug on ordering it. So, we’re not worried about that. I mean, this quarter, like what I said, I think we’ll ship more than 40% compared to last quarter. And we are very excited about Germany, Netherlands, like what I talked about. Badri, just on the new battery, I was curious. But, it also sounds like lower cost. The good question on the next-gen battery, that’s a little bit out. So, it’s probably too early to give some numbers out. But the idea is generally that, meaning today, we have extraordinarily -- meaning the situation is extraordinary in terms of inflation, supply chain, et cetera. Eventually, batteries need to come down the cost reduction curve. And whenever you reduce cost structure, you basically integrate -- instead of 7 boards, you have 1 board, that’s all goodness. But you’re right, we may use it for market share gains while still retaining a healthy gross margin. And it will -- and once we come to that, we’ll make a decision. And with regarding the next-gen battery, I mean, there is no reason why that cannot follow a similar process like the microinverters. If it provides a lot of benefits for customers, like form factor is quite less and other things, we may be able to do the transition in 2 to 3 quarters instead of 4 to 5. But, the 40% growth sequential here for 2Q is quite robust. I mean, that’s a good question as well. Usually, we are very-disciplined in filling the channel or not, and we always look at point of sales. We have a very meticulous meeting, meaning review every week where we look at point of sales in Europe by country, by distributor. So, there may be a little bit of creating a channel in some really regions where we have never shipped before, but that’s not the primary reason. The primary reason is, especially for countries like Netherlands, in general, booming solar, for countries like Germany is especially considering the Ukraine situation, everybody wants to go towards self consumption. And so, basically solar plus storage there. So, these two are the biggest markets by large, and of course, closely followed by utility, where the government is making it very easy. All of these three regions -- actually, Italy, you can argue that some of the channel thing is there. But at least in Netherlands and Germany, we are -- we’ve been present for some time. Of course, we cannot say whether we’re going to grow every quarter like that, but we’ll give you -- we’ll do the same thing next quarter. I’m curious to understand a little bit better growth in the U.S. and Europe, how much of the guidance is really channel until at this point? Historically, I’ve always said that a reasonable channel inventory is 8 to 10 weeks, and we don’t usually quantify it every quarter, but that’s a healthy inventory. Europe, I would say, is a little bit less in terms of channel inventory, and they need product, and that should be obvious because of the demand increase. I mean, the logic is we release new products and new products get better and better over time. So, as simple as that, we -- today, our battery basically does 3.84 kilowatts of continuous power for 10-kilowatt hour battery and 5.76 kilowatts of peak power for a 10-kilowatt hour battery. And very often, when you have air conditioners and when you have pool pumps, et cetera, what you do is the tendency is to buy a lot more kilowatt hours to solve the kilowatt problem. Now, with this, we don’t need homeowners to buy kilowatt hours just for the heck of it -- for solving a power problem. But at least what we take is right now, with the high-power battery, which is going to be released in the second half of this year, we will be able to support 7.68 kilowatts for a 10-kilowatt hour battery, continuous, and something like 11-point-something kilowatts peak power. So, we’ll be able to start some really nice loads with the 10-kilowatt hour battery, for example. And so, that’s a customer experience thing. And of course, when we did that design, what we said is, okay, our previous modularity -- our batteries that we are shipping today have a modularity of 3.3 kilowatt hour. These new batteries, if we have a modularity of 5-kilowatt hour, then you can amortize our overhead, what I call is anything other than the cell pack, over a higher kilowatt hour. The cost gets a little better, manufacturing cost. And then, you go to the next generation, which is in next year, 2023, is we talk about transforming the overhead to something that is -- was a lot to something that’s very less, 7 boards going to 1 board, which is integrate power conversion, integrate battery management all into one board, and making our microinverter a high-power microinverter. And that microinverter will be like approximately a 2,000-watt microinverter, single bolt. So, you can see a drastic volume reduction of 40%. So…\n That’s incredibly -- yes, that’s super helpful. However, I was wondering if you could just give us a sense of what you’re hearing from your customers in the U.S., specifically in April? I’m trying to get a sense if you’re seeing any signs of deceleration in U.S. resi demand in April, or it seems like demand is still strong within the U.S., based on your most recent discussions? And we are continuing to take market share in the U.S. And then, we talked about Europe. And then, maybe just switching gears to the battery side. And when we actually add it, I’ll provide more details on the capacity. Then, in terms of the motivation to add, it’s all of the above. We have noticed -- I mean, we have realized that based upon the last couple of years on supply chain for the microinverter, there are some products that we need five suppliers. So, more number of suppliers, it helps us in terms of -- yes, it helps us in everything. Price negotiation, it helps us in supply. But right now, all of our three cell pack suppliers are in China. So, you’ve made several acquisitions that are going to strengthen your installer platform, including the SolarLeadFactory, I guess, was the most recent one. The installer platform has got a few elements to it, lead generation and management, number one; design and proposal, number two, with the connectivity to the fintech partners. So, we have made acquisitions on lead management through SolarLeadFactory. They -- very healthy business, profitable business. They work with about 10 installers mostly, 90% of the revenue comes from 10 installers. The name of the game for us is to take that business, generate a lot more leads, increase the quality of leads, make sure those leads have a very high conversion rate into actual installs and kind of make sure we proliferate the long tail. So, that’s the name of the game on the first one, lead generation and management. I would say, this quarter, that business will do 50% higher than one year ago. And essentially, the business service is 900-plus installers right now. Also, another important thing is Solargraf or Sofdesk, that software has got connectivity to various fintech partners. So, that’s important ease of access, fintech partners is very important for our installers. We have a team in Noida, approximately 80 installers. We almost do proposal and permitting services, meaning an installer says just generate this proposal for me. Or here is the details of the proposal, I want to permit plan set from you in 24 hours. So, we have a large team there, 80 installers, doing very well. Again, that revenue is ramping quite nicely, very profitable. There the name of the game for us is automate the permit plan set, so that we can reduce the cycle time from hours to minutes, and we can service the long tail well with highest quality. Now, installation and commissioning is what we do for a living -- monitoring is what we do for a living. We’re still not happy with our commissioning on batteries, like what I indicated. And that one is probably the most nascent of them is the concept being -- it’s like an Uber, Uber for an installer or Uber for an asset manager. Basically, if I have a problem with the particular asset and I’ve already charged the customer for an O&M contract and I’m short of labor, which happens all the time, we can -- the platform can basically find -- the platform is a labor market place for you. And when you as an asset owner or you are a service provider who want to service a particular asset, but you don’t have the manpower to do so because your crew is busy on new installs, you then log into the platform, submit a work order. It automatically gets routed to the next labor service provider who is free, and that is a match that happens, and Enphase gets paid for -- at both ends of the platform as a software fee. And that’s the newest of them all, which we need to basically -- we need to introduce that company to our installers. But, we will not do that unless they have a -- the software is high quality. But all of them are geared to only one thing, making installer’s life simple. Badri, you have a very large installer network, right, in the U.S. and have access to most developers and installers, right? I mean, we made 5 acquisitions in the last 15 months. Our first priority is to obviously take care of the needs of the business, make sure we have plenty of cash for working capital, make sure that we make the necessary capital investments on the software side, make sure we invest in anything on batteries that we need. So, take care of the current needs of the business. Number two, we do have a lot of interesting ideas, interesting pipeline in terms of mergers and acquisitions. Like what I talked about in Germany is leading the way in every home having solar, storage, EV, heat pump and other home loads. And because the market in Germany is reasonably mature, like, for example, not all systems may use Enphase -- Enphase actually solar. Some may only use Enphase storage, might have third-party solar, might have someone else’s EV charger and somebody else’s heat pump. So that requires heavy investments in home energy management, which we are prepared to do. So, we’re always looking for networking opportunities on EV chargers that enable -- that basically enables dynamic access, which is both inside and outside the home. So, we are looking -- we’re always interested in software companies there. So, we did -- for example, last year, we bought back -- Mandy, we bought back 3.2 million shares? We bought back 3.2 million shares last year, bought back at $1.55 a share. And if the share price goes down, we will consider opportunistic scenarios like that to do more buyback, provided number 1 and number 2 are taken care of. I haven’t talked about it too much, but we have an outstanding guy running Brazil. And they are going to get the IQ8D variant of the product, which will help them on the cost structure, that’s pretty soon. We have not introduced our storage yet in Australia, which we are working on and they should have their storage in the second half of this year. And in addition, we are focusing on other Southeast Asian countries as well. First, just looking at your installer network, been hearing from different sources that just simple labor availability for the install process has been a bit of a challenge. So, I’m just wondering if you can comment on feedback that you’re getting from your network. Demand is very robust, like what I pointed out. So, installers are always looking for skilled labor. And then, the other question, we’ve talked a lot about M&A, but in particular as regards grid services, right, aggregating and bidding assets into frequency regulation markets or what have you. Grid services really is focused on providing capacity, not necessarily frequency regulation at this time. So, we are focused on the residential market. And if you look at all of the grid services programs that we participate in are really focused around that, which means that during periods of stress typically around where the grid is stressed between 4 p.m. and 9 p.m., the batteries get a signal to discharge the batteries for the duration of that period. So, we really are focused on that market. So, we have a very strong team, both on the battery side to enable the battery to discharge the homeowner side for the homeowner to sign up simply as well as a platform or a grid services manager, as we call it, where the utilities are very clean, very simple access, one view access into all of the assets that are available to them. And in that case, we provide them with API and API access for the entire fleet to allow them to discharge the battery. As you can see, we have made a significant amount of progress with this team, and they’re developing very strong tools and products to meet the requirements. I mean, so remember, this -- IQ8D only addresses the small commercial market. The small commercial market in the U.S. is -- we are talking about a TAM, maybe a little more than 1 gigawatt. And when I say small commercial, it means 20 kilowatts to 200 kilowatts. So, we think our microinverters can be extended there with the use of IQ8D. Having said that, we just are getting started. We are piloting with about, I would say, 10-plus installers. And if the pilots go well, which we will find out in the next few weeks, we always make some changes. And then, onwards, it is a business that will take some time to develop. But we are confident with our principles, quality, customer service, our wrap and shutdown capability, our easy-to-use product that this will get good adoption. And first, we’ll start off with North America. And if we are successful, and success means that we are like residential where we can capture significant share. And then, we will look at the next follow-on, which is the real commercial market. For that, we need a 480  product basically. Obviously, you’ve been making acquisitions on the lines of -- you have an inverter product and storage and now you -- with ClipperCreek, you have EV chargers as well. So, the way we think about it is we have the technology -- energy management technology platform and its role is to manage a whole family or a disparate set of distributed energy resources. So, we obviously do solar today, storage. We are -- by making the EV charger very smart, so we can do green charging. But there are other elements also that we need to integrate, and that’s -- those are heat pumps. Obviously, we will not be selling heat pumps, but our goal is to develop -- either develop or buy companies that can -- that through software, integrate all of these other heat pumps, et cetera, and other loads as well and effectively bring them on to the platform. And when we bring them on to our energy management platform, we can then manage how the loads get serviced. What’s the most economical, what’s the most reliable and what’s the most green way of servicing the load. In the case of EV, for example, if the homeowner may choose I only want to charge my car from -- charge my car through green electrons, which is, obviously, the first choice would be your own solar system or if you get a signal from the grid says that the grid is green at this time, then you can charge from the grid as well. In general, it’s about managing all of these different type of resources, and we’ll do that with software primarily. And you’re seeing is a lot of standardization that’s starting to take place where all of these different kinds of loads, different types of heat pumps and different types of EV charges, et cetera, are starting to adopt certain standards, and those standards will make it easier for us to integrate them onto our platform. You have managed the supply chain much better than your peers and competitors, right, not just your competitors, but other companies in other sectors, right, the large ones at that. I mean, to tell you, you’re giving us a lot of credit. Last year, we didn’t, and we had a supply problem last year in 2021. And I think planning better and executing on multiple factories, multiple sources, and it also helps that we don’t have a lot of SKUs. And then, so that every region we can load the appropriate grid profile and software so that can get functioning. In that way, we don’t need to make one SKU for one country. But again, I think with the software-defined architecture that we have, it helps us a lot. So, to answer your thing, it is upfront product architecture, diligent supplier management, qualification of multiple sources, planning better and some luck too. So, yes, hopefully, we have had our -- hopefully, luck is on our side. Well, I was hoping we could start just very quickly on this Department of Commerce investigation. Really, we are not -- as we sit here today, based on all of the discussions that we have had with our customers, based on what we see out in the marketplace, we don’t see any impact on our business. Obviously, we are expecting and we have heard that module prices are going up. So, in our opinion, can those module prices increase and module prices be absorbed by the residential customer, and we believe that magnitude of module price increase that we are seeing an easily be absorbed by the customer. So, our opinion is that we won’t see any impact on our business. So, what the homeowner actually sees is a small increase in their monthly payment. So, all of those things point to residential segment that is probably going to be much more resilient segment than any other segment. And then just switching gears to your European strategy, I was hoping you could talk a little bit about your installer strategy there. I mean, you’ve had tremendous success in the U.S., obviously, with the long tail installers. And basically, just do you think you can replicate your installer strategy that you’ve had success with in the U.S., can you replicate that in Europe? If you say U.S. has got a lot of long tail installers, Europe is even more long tail. So, Germany, for example, has got 5,000 installers. And I think -- yes, I’m not sure about it, but I was told that the -- a top installer is an installer who does approximately 10 to 20 megawatts a year. So basically, it’s -- the same definition holds, the same principles hold for us. We think those installers will obviously care about quality, care about customer experience. Obviously, in the current geopolitical situation, all of the frontline states in the eastern portion of Europe are in the headlines. Obviously, we do pay attention to the regions and pay attention to opportunities that lie, and we’ll continue to do that. At this time, we are very focused on the countries that we talked about. The market is really expanding very strongly and countries that we are already in, which is Netherlands, France, Belgium, Germany and the new markets, which include Spain, Italy and Portugal, and we need to bring all our products. Last year, EV market share in Europe was 4 times higher than the United States, 19%. And the angle is what I said, which is when an installer basically goes to a homeowner and who is even thinking about an EV, the -- there are so many incentives that an installer actually told us saying, even if the homeowner doesn’t have an EV, I still install an EV charger. When an installer is there selling the homeowner solar, storage, EV charger and heat pump, in that sale, if Enphase can make life better by having a comprehensive home energy management system, ClipperCreek definitely has its place. And so, we are planning to introduce an EV charger basically into Europe in Q1 of ‘23. But in the interim, we are working hard to make our system interoperable with other EV chargers, so that the homeowner still gets the right experience. Thank you, ladies and gentlemen, for your participation in today’s conference."
}