{
    "symbol": "WBK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-09 10:43:05",
    "content": "  Andrew Bowden : Good morning, and welcome to Westpac's First Half 2022 Results Presentation. My name is Andrew Bowden, and I'm Head of Westpac's Investor Relations. I would like to begin by acknowledging the traditional owners and custodians of the land which we stand today, the Gadigal people of the Eora nation, and pay my respects to elders past and present. And after their words, I'll invite some questions. Well, thanks, Andrew, and good morning, everyone. Just over 18 months ago, we reset the strategy to turn the company around, to make Westpac a simpler, stronger bank. And we're working through these plans, and we're realizing the benefits. Under the Fix priority, we're 1 year into our 3 years of the CORE program, and we're on track. Under Simplify, we're getting back to banking in Australia and New Zealand. We've now sold 6 businesses with 2 sales completed this half, and the process to sell super and platforms is well advanced. In this half, we completed the rollout of our new app, which is faster, more intuitive and has more features. On Perform, we had better growth in business and institutional lending, and we grew in owner-occupied mortgages. But unfortunately, investor lending declined, dragging on overall mortgage growth. We are working hard on costs, and the 10% reduction underpinned the stable ROE this half. Finally, our balance sheet is in great shape, allowing us to return $5.5 billion to shareholders through both the dividend and the buyback. And so in summary, we're delivering on Fix and Simplify, and this creates the capacity to increase our focus on Perform. Reported profit and cash earnings were up significantly, and the big driver was the large fall in notables from $1.3 billion to $6 million. If we strip out notables, core earnings rose 6%, and I was particularly pleased that the 10% lower costs more than covered the decline in revenue. And revenue was lower as we navigated low interest rates and the competitive market, but NIM pressure eased through the half. So in contrast, cash earnings was little changed as we absorbed a turnaround in impairments, and that included adding just under $500 million to economic overlays. Our return on equity was maintained with average equity 1% lower following the buyback, and that reduced shares on issue by 4.6%. Turning to our businesses, and this slide has core earnings excluding notables. In Consumer, core earnings were down 7%, mostly from lower net interest margins. We grew fees and we reduced costs, although this was not enough to offset lower mortgage spreads. In Business, core earnings were up 36% driven by the 15% reduction in costs. We had good growth in loans, while markets income also improved as more customers were active in the hedging markets. In New Zealand, revenue was unchanged. And with costs down 2%, core earnings rose modestly. Following business sales and lower life insurance income, the contribution from specialist businesses was down but not unexpected. And finally, the group businesses were up following a standout treasury contribution. And this half, we largely completed the design phase, which is our first major milestone. We're also a long way through the implement activities and expect to complete most of this phase by the end of this calendar year, and this is the second major milestone. We'll also soon release Promontory's latest reports, which point out the substantial work already completed. This is our biggest business, reflecting its significant market share in mortgages. While we've been particularly challenged by low rates and competition, we are more positive on the future. We're making progress on improving service, and that's starting to be reflected in our franchise metrics. In this mass market business, digital is vital, and we're building capability into our existing apps. As an example, our new deposit onboarding process where customers can join Westpac and open a functioning deposit account in a matter of minutes. We have made progress in mortgage processing, including the expansion of digital applications. However, there is more to do as we complete the rollout of our new system to third-party brokers. And as new bankers come up to speed and we add digital functionality, we expect this trend to continue. We've made good early progress in turning around the Business Bank, and freeing up banker time has been the focus. On average, this has given bankers 1 extra day per week to spend with customers. As I look forward, we have a significant opportunity in Business given our large customer base. Having refocused the business and refreshed the leadership team, we're now well placed. And this, combined with the growth in lending, contributed to a much improved result. We've also strengthened our sustainability position with the new carbon trading desk, and we're currently engaging with customers on transition pathways. The team was particularly active with 39 sustainability transactions, which was a rise of 50% over the half. And we are bringing sustainability-linked loans and deposits to a range of customers, which is providing further options for growth. And overall, I'm happy with the progress of the new WIB leadership team. Westpac New Zealand made sound progress with growth in lending and deposits, a flatter margin and lower costs. And while the results were better, there is much more we need to do to improve customer metrics and achieve more balanced growth across Consumer and Business. But part of the challenge in New Zealand has been our significant Fix agenda, which has absorbed a lot of resource. On dividends, the growth in earnings and the strength of the balance sheet enabled us to lift the dividend per share to $0.61. In this half, we landed at 69% for the payout ratio, and we'll also be neutralizing the DRP by buying shares on market. Let me now hand to Michael, who will take you through the numbers in detail. Looking at the results, I'd make 3 points. First, core earnings, excluding notable items, were up 6%. Margins stabilized through the half, and loans and deposits are growing. Second, progress on cost reset was a standout with costs reducing 10%. Our work to simplify and be more efficient is well underway, and this was the driver of the result. Third, our balance sheet and capital are well positioned for a changing outlook. Most of our credit metrics are back to pre-COVID levels, and we've actively managed funding with much higher deposits and early access to markets. In aggregate, the impact of notables was small at $6 million with $1.3 billion lower than last half. Cash earnings were up over the half, although stripping out notables, they were 1% lower. Excluding notable items, net interest income was down 2% with competition for new lending compressing margins, while loan growth was impacted by lower Australian investor lending. Expenses were down 10% from reduced head count, less third-party spend and lower property costs. More of our staff also took a well-deserved break, reducing leave provisions. Given uncertainty in the outlook, we added to economic overlays, and that was the main reason for the turnaround in the credit impairment charge. In mortgages, we had good growth in owner-occupier, partly offset by a contraction in investor lending. Business lending grew in the property and agri sectors, while WIB supported a lift in M&A activity and existing customer growth. Lending was higher in New Zealand, although FX movements saw a contraction in Australian dollar terms. And while growth was sound, it slowed through the half following implementation of new consumer law and as interest rates rose. Finally, specialist business did a good job of running down the consumer order book and sold the wholesale dealer book during the half. We had solid growth in owner-occupied, but investor continued to contract. First, outflows have been elevated from our decision to run down lending to self-managed super funds and to foreign buyers. Second, we have been out of the market on investor lending policies. While we prioritized owner-occupied mortgages when rolling out our new platform, we must improve our service to businesses. On portfolio mix, fixed rate lending continued to be popular but has now eased. Fixed was around 39% of the flow for the half, reducing to 24% in March. This mix change has impacted margins, so let's turn to that. Over the half, margins fell 14 basis points. Most of the margin fall was in the first quarter with liquidity half of the fall, while there was a small increase in the second quarter. Lending spreads were the big driver, down 15 basis points. We grew fixed rate mortgage lending, while higher-margin investor lending contracted. Competition has been intense in Business, which has also seen reduced spreads. You can see in the tractor chart, we expect this to shift to a benefit in the second half. We have largely completed our liquidity build for the phaseout of the CLF, and this drove the 7 basis point drag from liquidity in the half. The margin -- the exit -- March exit margin, excluding treasury markets, was 1.68%. As we think about drivers of our margin, we have provided our insights on this slide, given there are so many factors at play. First, we are in a rising rate environment with significant market rate increases already this year. Looking at lending, the pressure from fixed rate home lending has slowed as we have repriced and seen a move of flow back to variable rate mortgages. There will be some impact of lower fixed rate margins in the second half, and we expect competition to shift to variable rate mortgages and remain competitive in New Zealand and Business. All in all, while there are a number of factors that will impact margins going forward, on balance, we are positive on the trajectory in the second half. Excluding notable items, noninterest income was down 8%, mainly from the exit of our general and lenders mortgage insurance businesses. Excluding divestments, the fall was 1%. Adjusting for this, wealth and insurance income fell 13% from revaluation losses on life insurance liabilities, margin compression as customers migrated to the Panorama platform and from lower Kiwisaver fees. Excluding the impact of revaluation gains, the total was up 2%. This increase was mostly due to markets income growth, and this next slide looks at that in a bit more detail. The team has also stepped up their customer focus and delivered better solutions on derivatives, which is building on the momentum we have seen in the half. Noncustomer income remains below historical levels, and the team is working to drive growth in the second half. Overall, we are in a much stronger position in our markets business. Looking across the chart, BAU fell $170 million, mostly reflecting the success of our simplification to date. Overall, investment spend remains weighted to Fix and is expected to rise slightly in the second half as we continue to invest. We remain committed to our $8 billion cost target, and expenses in 2022 are on track to be materially lower than 2021. The structural changes necessary to achieve our target are underway, and we got ahead of the 2022 outcomes in the half with more than 2/3 of people exits completed. Therefore, over the second half, we expect to hold the gains made but are not expecting another step-down. In total, costs excluding notables will be around 2% lower and 7% lower for the year. We will benefit from productivity measures already taken, although we will invest more, particularly in completing Fix initiatives in New Zealand. While we recognize the impacts of higher inflation, along with the timing and nature of our final divestments, we remain committed to the $8 billion target for our core businesses. On this slide, you can see we are implementing our digital-first approach with a larger proportion of our mortgages shifting to digital processes. This will allow us to further simplify decision-making, streamline our head office and reduce bureaucracy. In the half, unemployment was at generational lows. Savings continued to rise, and economic growth remained robust. On the left, you can see that stress has reduced with lower watch list and substandard exposures as corporates were upgraded. On the top right, 30-day mortgage delinquencies have continued to trend down as we've ceased COVID deferral packages and many customers returned to health. In aggregate, provisions were down 6% over the half. And while credit quality is back near pre-COVID levels, our provisioning is 20% higher than September 2019. The $325 million reduction in total provisions was mostly due to lower impaired Stage 3 provisions, mainly from the partial write-off of foreign finance. Collective provisions in aggregate were little changed, although the mix shifted to a higher proportion of overlays. Applying our models, the improvement in credit quality metrics and better unemployment led to lower collective provisions. Given current uncertainties, we increased the weight applied to our downside economic scenario from 40% to 45% with a corresponding reduction in the weight applied to the base case. Overlays were increased to reflect the impact of higher inflation, rising interest rates and supply chain disruptions. In aggregate, we increased overlays by $489 million. New IAPs were lower, reflecting the better environment, few new impaired assets and no large new names. Write-offs direct were down, consistent with the decline in unsecured lending and lower delinquencies in the consumer and auto portfolios. Model collective provisions decreased, offset by higher overlays. Allowing for announced divestments, that arises to 11.5%. There were large movements in the half, so let's look at that. And while we await final approval of our models and delivery of our data requirements, we are expecting total risk-weighted assets to be largely unaffected. With the rules finalized, we've now updated our CET1 capital operating range. Applying a management buffer and with guidance from APRA, we will operate in the range of 11% to 11.5% from the start of 2023. Looking forward, there are several dynamics that will impact the result in the second half. While the mortgage market remains competitive, we expect growth in mortgages based on the activity we're seeing. As mentioned, we have work to do on investor mortgages, and we are focused on this. Business and institutional lending have performed well, and we are looking forward to maintaining this momentum throughout the year. Competition in all our lending sectors means margins continue to remain under pressure, although the flow-through of higher rates to the tractor and other tailwinds are positive for margins. While markets income is difficult to predict, our business is much better placed than 12 months ago. Costs, excluding notables, are expected to be around 2% lower on the first half. Credit metrics are in good shape, and the economic outlook is positive. And finally, we are well placed to implement APRA's updated capital rules. Well, before we turn to Q&A, I'd like to cover our progress on climate and the outlook. On our footprint, we're on track to reduce both scope 1 and 2 emissions by 65% this year and scope 3 emissions by 35% by 2030. While getting our operations to neutral is important, our biggest impact will be helping customers respond to climate change. We have begun to take our larger customers through some of our thinking and the changes required, and we'll capture their feedback as we build our pathways. Household balance sheets are in good shape, and borrowers have the capacity to absorb higher interest rates. However, we are entering an interesting period with rising inflation, supply chain challenges and increasing interest rates. And as this rate cycle progresses, we expect a moderation in GDP growth, a pullback in housing prices, but that's after what has been an extraordinary increase. And as growth slows, it will take pressure off inflation and help the economy return to more normal settings. As always, changes in cycles impact customers differently, and it is inevitable that we'll see some rise in stress. The CORE program remains a priority, and we won't let up our effort. And on Perform, we'll build on our gains in business and WIB, address the bottlenecks in investor and mortgage, and our cost reset program is critical to supporting returns. So finally, while there is still a lot to do, I'm pleased with the delivery of our commitments, and I'm positive on our future. So we'll first take questions from the market, and then we'll take them from the media. I will take a question now from Brendan Sproules, please, if he's there. Look, just -- I guess I've got one question. I just want to start with your costs, I guess. But in your cost guidance, you're talking about 2.5% inflation in your forecast for your $8 billion target. And our cost base is still over $10 billion if you annualize the result, Ed. So we're starting from a different position, say, to some of the peers. If I think about how we do that, it's the plan about the SBD exits, the plan about resolving our risk management and sorting out issues, and then we need to be more productive. If I look at inflation, and certainly, the last read of inflation, if you unpack it, obviously, there was a lot of energy costs in there, oil, price of petrol and whatnot. Not -- they don't really flow through into our business, not being a big user of those pieces. Obviously, they will flow through to customers, though. So in terms of inflation, we set out in the document what the $8 billion was based on because we knew we were going to get lots of questions on it, and we just had it out there. How much, we'll work through over time. I'll take a question from John Storey, please. Once through -- I think your line should be open, John. So I'll take a question from Victor German, please. Yes, I was hoping to actually follow up on the previous question on costs and also ask a question on interest rates. So on costs, I'd be interested, Peter or Michael, if you can maybe holistically sort of help us out with respect to your cost number. If I look at certainly rebased expectations for consensus across peers, all of them are now looking for costs closer to sort of $9 billion, $10 billion. And given your multibrand strategy, arguably, your cost should be higher, not lower. And the second question on interest rates, thank you for that disclosure around replicating . Well, Victor, let me start with costs, and Michael can come back on margins. So when we've thought about where we're heading in terms of the shape of the company in a couple of years' time, we've thought it through from a physical distribution perspective. We thought about the size of the head office, the corporate footprint that we need, what type of people we need to have employed by the company versus partners. And so we are working very quickly and methodically through customer journeys, digitization, the size of the physical footprint and the shape of the workforce that we need in a digital world. That's also critical for risk management because in that type of world, a lot of our risk management is automated as well. Can't comment on peers, obviously, but we just believe we need a step-change in the cost base but, more importantly, through digital. And on interest rates, as you point out, we've shown more disclosure on our hedge balances, both capital and nonrate sensitive, and that large bucket of deposits that are less than 25 basis points. Look, it's hard to articulate clearly what the behavioral aspects go there. As interest rates rise, we would say about 1/3 of those balances are at 0 rates. I'll try again with Andrew Lyons, please. Andrew, apologies, but we heard you from about halfway through the question. So Pete, just on the NIM pressure, you noted that it did ease over the half. However, I do note that in the second quarter, we did see pretty big run-up in swap rates, and you still had 40% of your mortgage flow into fixed over the half. So just on deposit pricing, so yes, we did have that impact in the second quarter, and we called out 4 basis points in the presentation that will flow into the second half. We also indicated that most of the liquids build occurred in the first quarter, that 7 basis points adverse impact to margin. And as you point out, as interest rate rises occur of the remainder of the half, we will get a benefit on our hedge balances. The only other thing I'd add, Andrew, is in terms of the flow of fixed rates in March, they were a little bit over 20% as a proportion of total flow. And that's -- before these record low interest rates, we had a portfolio that was 80-20, 80% variable, 20% fixed. There has been material upward repricing in fixed rates in the market, and we'll just have to see whether the 3-year swap settles. I'll take a question from Andrew Triggs, please. We've got you, Andrew. Look, just first, a really quick point of clarification again. Just on the inflation number you're talking to, the 2.5% you baked into your $8 billion target, can I just clarify that, that's general inflation in the cost base, not wage inflation specifically, noting that staff expense is about 60 -- or just under 60% of your overall expense base? Well, just on -- maybe I'll just answer the -- how did markets volatility impact the result. And as I think about it, we had a very good outcome in treasury, but I'd average it just -- look at the averages, that was above normal, a very good result from the team. So that was about $73 million down, I think. So think about that as the bucket of market volatility, not just the treasury result. And on cost, as you point out, the 2.5% is across the cost base. So depending on how that plays out, that -- we'll have to see how that has impact. But as Peter said we're committed to the $8 billion, and we've got the plans in place to do that. Clearly, having -- if underlying inflation is greater and it has a greater impact on our cost base, it creates more of a challenge. I'll take a question from Brian Johnson, please. When you're talking about, and you used the word APRA quite a few times, when you're talking about the core equity Tier 1 target, 11% to 11.5%, I'm assuming the 11% is ex div. So basically, you've listed the target -- the bottom end of the target from 10.75% to 11%, which I think is telling us the capital intensity has basically -- is set to rise. So we never said we didn't reset our preferred range for Basel III until this period, Brian. And if you go back and look at the APRA release, it certainly talked about 11%. So post-dividend, you want to be around 11%. Pre-dividends, so March and September reporting, we want to be 11.5%. So Peter, the way to think about it is you're neutralizing the DRP, which is, I don't know, 45, 50 bps. Pro forma for the asset sales, we're 11.5%, which is right on the top of the range. But sorry, the other point I should say, that's effective from the 1st of Jan, obviously, with the new rules. At this point, if you just go we're 11.5% against the top of the range of 11.5%. Obviously, we're having a couple of difficulties here. I will take a question from Carlos Cacho, please. You noted that investor lending had been falling, but you've taken steps to address that and get policies back in market. And then just secondly, on the owner-occupied side, we've seen that running about 0.4x system recently. On -- so mortgages, we've got a number of initiatives in place. Firstly, we've got more bankers. So over the 12 months, we've put on 200 more bankers. So we've got the customer service hub, which is being used in the Westpac brand. It's about 3/4 through the St. George brand in terms of flow, and we've got about half of brokers and 20% of flow being used on that new process. So this half, we're going to roll it out. But more distribution, better process, and then the business channel is the other one that we particularly need to improve. So we haven't been great in mortgages through our business channel, and that's a big impact on investor. In terms of sort of what do we want to do in the second half, we want to balance pricing and volume. I'll take a question from Brendan Sproules, please. I just want to refer you to Slide 61, where you show us your investment spend and particularly, you show us the mix. Particularly, Peter, you made mention of investing in digital to get to that $8 billion cost base. But sort of ex Fix, it looks like you're only running at around $600 million of investment spend. So Brendan, I think -- I'll make a sort of overarching point and then let Michael also comment. But the old way that we used to think about projects is create a team, give them multiyear funding and deliver an outcome. But increasingly, what we are doing is hiring digital engineers, experts in customer journeys, data experts and aligning them to businesses. And so one of the challenges is -- I think everyone looks at the old $1.2 billion, looks at what we disclosed today, that's appropriate. But actually, there's a lot more of, what I would say, BAU operating capability that's changing the company. So a big part of what we need to do is, over time, have more data engineers, more digital experts. And so that's whether it's capitalized or expensed, as Peter said, we're managing the total change effort under our new transformation approach. So that's why we're doing it this way, and we're giving you that transparency. Second point is that, as we indicated, the majority of our investment spend at the moment is on our fixed priority. So it is skewed, 68% or whatever the number is, close enough, to the spend is on fixed. So as CORE goes through the implement and embed phase, that the spend on fixed will decline. So 6 months ago, we talked about really needing to reengage with the brokers and the sharp increase in flow that came through. But if you look at the flow of new lending that you've seen, proprietary flow is down 7%. The broker are down 25% during the half, and credit growth is now stagnant in the second quarter -- in the March quarter, I should say. So it would suggest that you've eased off the discounting, your broker flow has fallen 25%, and your credit growth has gone back to a stagnant level. But if you expand that, that's what it looks like is happening. Jonathan, how I think about it is that the margin impact, in particular, was massive movements in fixed rates through this low period. Obviously, it did see higher flows through third parties given that dynamic. Now we sit here today, fixed rates have gone up materially. Probably, I think they're in the -- I can't remember exactly, but the 3% to 4% range for the 3-year rate compared to 2s before. And I'd just encourage you to have a look at Michael's slide on mortgage growth, and it sort of breaks it out into the components. The paydowns are about the same, but it's in that net refinance. And I think you're right, that's price-based. We'll take a question from Richard Wiles, please. If we go back to 2019, term deposit rates were roughly 100 basis points higher than the rates on a lot of at-call accounts. At the time, term deposits were more than 30% of your Australian deposit portfolio. For all of 2021, there was basically very little incentive for depositors to take term deposits because the rates were so low, but that's clearly now shifting. So I think the -- obviously, I can't comment on where prices might go in the future. But if I step back, customers are very smart, and they will take what they perceive as the best value between the short-term rates and the fixed rate. So I think the answer to that question actually becomes, what's the difference between the cash rate and, say, an 18-month TD rate. And customers are pretty intuitive and normally move from cash to term, depending on what they're trying to achieve, Richard. So obviously, I can't comment on where rates might go in the future, but that's what I've seen in the past. Well, if you -- I think if you model out the cash rate against the 18-month rate, that will give you the mix is what I'm saying. So we'll probably see some people going into -- assuming rates increase on savings accounts, you'll see more people in there versus term. But it will just be a relative game, depending on the 2 rates. Look, I just wanted to, Peter, to gauge the, obviously, about rates going up or the cash rate going up. Well, Peter, our economics team is forecasting the cash rate to be at 1.75% at the end of the calendar year and to increase again to 2.25% in the middle of '23. When we assessed mortgages, we had a higher interest rate than what the customer was paying. So with that type of outcome in the cash rate, that's broadly been what we assumed in our mortgage application. Unemployment is at record lows, and there's still a lot of demand. We've got expenses going up, but how much wage inflation fee is triggered by the higher inflation. So we sort of look at -- we step back and we go, we were assessing mortgages on a much higher rate. Obviously, customers will need to think about how they reshape it. The short answer is no, because we've already factored in higher interest rates into the assessment process. As I said before in an answer to a question, we'll probably -- we have to push up expenses in our mortgage calculations a little bit quicker given inflation and whatnot. That may impact borrowing capacity, but I don't think it will be material in the sense of it. I think people are now -- if I look at the sentiment survey for time to buy a house, it's pretty low. I'll take a question from Clancy Yeates, please. You've increased overlays in provisions for a bunch of issues, supply chain issues, inflation and expectations of higher interest rates. And so when we looked at what's not factored into the portfolio, we did take a view that what we're seeing on supply chain, on interest rates and also in the floods in New South Wales and Queensland may have an impact. But that's mainly on the business portfolio, not so much the mortgages or the consumer portfolio. Peter, what sort of -- you spoke about expecting the cash rate to hit 2.5%. Clancy, it was 2.25%, not 2.5%. There's lots of choice, and we are already seeing it. It's just part of being in banking now that people are looking for a better deal, and we're providing better deals. I'll take a question from James Eyers, please. And Peter, it's just a follow-up to Richard Wiles' question relating to savers. Well, I think -- well, the first thing is interest rates have been at record lows. In relation to where we end up, that will -- as I said before, customers are pretty intuitive. They'll pick the best rate between term deposits and saving rates, and we'll just see how the shape of the curve looks over time. Well, I haven't had any calls from anyone on that matter. I'll take a question from , please. Peter, look, I just wonder if you could just put in some more color around this carbon trading desk. Well, it's -- we know that as the energy system transforms, there will be a lot of need for risk management. So you think about derivatives and interest rates or FX, we can see a market for derivatives in carbon trading. And we've created that desk, the carbon price -- the carbon units, sorry, I think, is the right term, are already traded in Australia and New Zealand. We're a big part of the market in New Zealand, and we want to be a bigger part in Australia. So think about it as hedging any risk like interest rates or FX, but there will be some carbon offsets, if you like, is the other way to think about it. Certainly, we -- when there are offers of carbon offset units, we buy them, and then we'll sell them at certain points. But certainly, we would buy them and use them for risk management purposes. You mentioned to Peter Ryan, you changed the rate buffer from 2.5% to 3%. So we wouldn't want to have customer rates go up plus a bigger buffer because that -- it's sort of if you look at both the interest rate buffer plus the actual customer rate, and with customer rates moving up, you don't want to double count them, if you like. I'll take a question from Kate Weber, please. Well, in fact, we want to invest, as I said before, increase our resources in digital data and tech. So 2/3 of that was -- of that 4,000 number was reduced. So in fact, we want to increase in digital and data. We haven't -- don't go to that level of detail, but happy to give you an update next half. We'll take a question from , please. Well, in fact, in this result, we absorbed the increase -- the full impact of the increase in superannuations. Or put another way, it was effectively an increase in benefits for our team because we didn't reduce the take-home pay, if you like. In terms of our enterprise agreement, it's sort of tiered but at the less than 90,000 tier. For the last couple of years, we've been paying 3.25%. Obviously, we'll have to sit down with the team and work through with the union what's appropriate for the next couple of years. It's a very competitive market, particularly for some areas. And more broadly, I mean, do you see any sort of -- factoring in all of wages growth and inflation, I mean, the Reserve Bank's commentary on Friday was interesting given that I think real pay is probably going to decline before it goes on the increase. Well, I think the read-through will be more of people's income will be spent on housing, whether that's rental or mortgages. And depending on what type of rate cycle we'll see, there may be less income available for other discretionary spending. The new home loans are a bit over $0.5 million -- $500,000, sorry, in size. So if we talk about a 2% increase in rates from here, that's $10,000 a year in after-tax income. They've got to be getting prepared for it, and it's probably going to be the way that money is spent that will change in the broader economy. I'll take a final question from , please. Well, I think owner-occupied grew in the half, investor didn't. As I said, we've added distribution capability into our first party, and we want to provide really good service to both channels. I just think we want to be excellent in both channels, and mortgages are a very good business for us, very big. But I don't -- they always look at price, speed, the amount of money you're prepared to lend. So there's a number of factors to go through, which is really the -- what the customer looks."
}