{
    "symbol": "UVV",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-03 21:27:05",
    "content": " In the six months ended September 30, 2021, Tobacco Operations results improved on a favorable product mix consisting of a higher percentage of lamina tobacco and fewer carryover sales of lower margin tobaccos, compared to the same period in the prior fiscal year. Net income for the six months ended September 30, 2021, was $25.9 million or $1.04 per diluted share, compared with $14.8 million or $0.60 per diluted share for the six months ended September 30, 2020. Excluding restructuring and impairment costs and certain other non-recurring items, detailed in Other Items in today’s earnings release, net income and diluted earnings per share increased by $14.2 million and $0.56, respectively, for the six months ended September 30, 2021, compared to the six months ended September 30, 2020. Adjusted operating income also detailed in Other Items in today’s earnings release of $41.6 million increased by $19.3 million for the first half of fiscal year 2022, compared to adjusted operating income of $22.4 million for the first half of fiscal year 2021. Net income for the quarter ended September 30, 2021, was $19.5 million or $0.78 per diluted share, compared with $7.5 million or $0.30 per diluted share, for the quarter ended September 30, 2020. Excluding restructuring and impairment costs and certain other non-recurring items, detailed in Other Items in today’s earnings release, net income and diluted earnings per share increased by $7.4 million and $0.29, respectively, for the quarter ended September 30, 2021, compared to the quarter ended September 30, 2020. Adjusted operating income, also detailed in Other Items in today’s earnings release of $29 million increased by $11 million for the second quarter of fiscal year 2022, compared to adjusted operating income of $18 million in the second quarter of fiscal year 2021. Consolidated revenues increased by $111.1 million to $804 million and by $76.9 million to $454 million, respectively, for the six months and quarter ended September 30, 2021, compared to the same periods in the prior fiscal year, on the addition of the business acquired in October 2020 in the Ingredients Operations segment, and a better product mix and higher sales prices in the Tobacco Operations segment. Now turning to the segment, Tobacco Operations, operating income for the Tobacco Operations segment increased by $12.3 million to $35.8 million and by $8.4 million to $26.9 million, respectively, for the six months and quarter ended September 30, 2021, compared to the same periods in fiscal year 2021. Tobacco Operations segment results improved largely due to a favorable product mix consisting of a higher percentage of lamina tobacco and a reduced amount of carryover sales of lower margin tobaccos, as well as increased value-added services to customers in the six months and quarter ended September 30, 2021, compared to the same period in the prior fiscal year. Africa sales volumes were higher in the six months and quarter ended September 30, 2021, compared to the same periods last on accelerated shipments and some shipments of carryover tobacco. Selling, general and administrative expenses for the Tobacco Operations segment were higher in the six months and quarter ended September 30, 2021, compared to the same periods in the previous fiscal year, primarily due to unfavorable foreign currency comparisons, mainly from remeasurement. Ingredients Operations, Operating income for the Ingredients Operations segment was $7.1 million and $2.7 million, respectively for the six months and quarter ended September 30, 2021, compared to operating losses of $2.2 million and $1.5 million, respectively, for the six months and quarter ended September 30, 2020. Selling, general and administrative expenses for the segment increased in the six months and quarter ended September 30, 2021, compared to the same periods in the prior fiscal year, on the addition of the acquired business."
}