{
    "symbol": "UVV",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-25 21:44:05",
    "content": " Ongoing shipping constraints reduced our Tobacco Operations segment results for the year and quarter ended March 31, 2022, as a result of continued limitations in worldwide shipping availability coming from COVID-19 pandemic. Net income for the year ended March 31, 2022, was $86.6 million or $3.47 per diluted share compared with $87.4 million or $3.53 per diluted share for the quarter ended March 31, 2021. Excluding restructuring and impairment costs and certain other non-recurring items detailed in other items in today’s earnings release, net income and diluted earnings per share decreased by $10.8 million and 46%, respectively, for the year ended March 31, 2022, compared to the year ended March 31, 2021. Adjusted operating income, also detailed in other items of $173.6 million, increased by $0.7 million for the year ended March 31, 2022, compared to adjusted operating income of $172.9 million for the prior fiscal year. Net income for the quarter ended March 31, 2022, was $25.8 million or $1.03 per diluted share, compared with $39.4 million or $1.58 per diluted share for the quarter ended March 31, 2021. Excluding restructuring and impairment costs and certain other non-recurring items detailed in other items in today’s earnings release, net income and diluted earnings per share decreased by $15.3 million and $0.62, respectively, for the quarter ended March 31, 2022, compared to the quarter ended March 31, 2021. Adjusted operating income, also detailed in other items, of $57.1 million decreased by $8.2 million for the fourth quarter of fiscal year 2022 compared to adjusted operating income of $65.3 million for the fourth quarter of fiscal year 2021. Consolidated revenues increased by $120.2 million to $2.1 billion for the year ended March 31, 2022, compared to the year ended March 31, 2021, on the addition of the businesses acquired in the Ingredients Operations segment and lower tobacco sales volumes, partially offset by higher average sales prices in the Tobacco Operations segment. In the quarter ended March 31, 2022, consolidated revenues also increased by $29.4 million to $647 million compared to the quarter ended March 31, 2021, on the inclusion of the Shank’s acquisition in the Ingredients Operations segment and higher tobacco sales prices. Segment operating income for the Tobacco Operations segment decreased by $11.1 million to $157.8 million and by $9 million to $52.2 million, respectively, for the year and quarter ended March 31, 2022, compared to the same periods in fiscal year 2021. Tobacco Operations segment results declined, largely due to tobacco shipment timing as well as some tobacco inventory write-downs, partially offset by increased value-added services to customers in the year and quarter ended March 31, 2022, compared to the prior fiscal year ended March 31, 2021. Africa sales volumes were lower in the year and quarter ended March 31, 2022, compared to the same periods in the prior fiscal year on smaller burley crops as well as slower shipment timing. In Asia, although trading volumes were down on higher freight costs, our operations saw a more favorable product mix, as well as increased value-added services for customers during the year and quarter ended March 31, 2022, compared to the same periods in the prior fiscal year. Our operations in Europe experienced significantly higher energy costs in the quarter and year ended March 31, 2022, compared to the same periods in the prior fiscal year. Selling, general and administrative expenses for the Tobacco Operations segment were higher in the year ended March 31, 2022, compared to the year ended March 31, 2021, primarily due to unfavorable foreign currency exchange comparisons, mainly re-measurement, offset in part by the effects of currency hedging activities. Operating income for the Ingredients Operations segment was $16.6 million and $6 million, respectively, for the year and quarter ended March 31, 2022, compared to operating income of $0.4 million and $5.1 million, respectively, for the year and quarter ended March 31, 2021. For both the year and the quarter ended March 31, 2022, our Ingredients Operations saw strong volumes in both human and pet food categories, as well as some rebound in demand from sectors that have been impacted by the ongoing COVID-19 pandemic. Selling, general and administrative expenses for the segment increased in the year and quarter ended March 31, 2022, compared to the same periods in the prior fiscal year on the addition of the acquired businesses."
}