{
    "symbol": "UVV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-02 21:14:06",
    "content": " We continue to experience the impact of tobacco shipment timing on our results in the nine months and quarter ended December 31, 2021. Tobacco shipments through the nine months ended December 31, 2021 were lower compared to the same period in fiscal year 2021, in part due to elevated tobacco shipments in the third quarter of fiscal year 2021 related to earlier customer mandated shipment timing. Logistical challenges due to continued limitations and worldwide shipping availability stemming from the ongoing COVID-19 pandemic also slowed tobacco shipments in the nine months ended December 31, 2021. Turning to the results, net income for the nine months ended December 31, 2021 was $60.8 million or $2.44 per diluted share, compared with $48 million or $1.94 per diluted share for the nine months ended December 31, 2020. Excluding restructuring and impairment costs and certain other non-recurring items, detailed in Other Items in today’s earnings release, net income and diluted earnings per share increased by $4.5 million and $0.17, respectively, for the nine months ended December 31, 2021, compared to the nine months ended December 31, 2020. Adjusted operating income also detailed in Other Items of $116.5 million, increased by $8.9 million for the nine months ended December 31, 2021, compared to adjusted operating income of $107.6 million for the nine months ended December 31, 2020. Net income for the quarter ended December 31, 2021 was $34.9 million or $1.40 per diluted share, compared with $33.3 million or $1.34 per diluted share for the quarter ended December 31, 2020. Excluding restructuring and impairment costs and certain other non-recurring items, detailed in Other Items in today’s earnings release, net income and diluted earnings per share decreased by $9.7 million and $0.39, respectively, for the quarter ended December 31, 2021, compared to the quarter ended December 31, 2020. Consolidated revenues increased by $90.9 million to $1.5 billion for the nine months ended December 31, 2021, compared to the same period in the prior fiscal year, on the addition of the businesses acquired in the Ingredients Operations segment, and a better product mix and higher sales prices in the Tobacco Operations segment. In the quarter ended December 31, 2021, consolidated revenues decreased by $20.3 million to $652.6 million, compared to the quarter ended December 31, 2020, on lower tobacco sales volumes, offset in part by a better tobacco product mix and higher tobacco sales prices, as well as the inclusion of the Shank’s acquisition in the Ingredients Operations segment. Tobacco Operations, operating income for the Tobacco Operations segment decreased by $2.1 million to $105.6 million and by $14.3 million to $69.8 million, respectively, for the nine months and quarter ended December 31, 2021, compared to the same periods in fiscal year 2021. Tobacco Operations segment results declined largely due to tobacco shipment timing, partially offset by favorable product mix consisting of a higher percentage of lamina tobacco, as well as increased value-added services to customers in the nine months and quarter ended December 31, 2021, compared to nine months and quarter ended December 31, 2020. Africa sales volumes were lower in the nine months and quarter ended December 31, 2021, compared to the same periods in the prior fiscal year, on smaller barley crops, as well as slower shipment timing. Sales volumes for Brazil were lower in the nine months ended December 31, 2021, compared to the same period in the prior year, when high volumes of lower margin carryover tobacco shipped. In Asia, although, trading volumes were down on high freight costs, our operations saw a more favorable product mix, as well as increased value-added services for customers during the nine months and quarter ended December 31, 2021, compared to the same periods in the prior fiscal year. Our operations in Europe experienced higher energy costs in the quarter and nine months ended December 31, 2021, compared to the same period in the prior fiscal year. Selling, general and administrative expenses for the Tobacco Operations segment were higher in the nine months and quarter ended December 31, 2021, compared to the same periods in the previous fiscal year, primarily unfavorable foreign currency exchange comparisons, mainly from non-cash remeasurement. Ingredients Operations, operating income for the Ingredients Operations segment was $10.6 million and $3.5 million, respectively, for the nine months and quarter ended December 31, 2021, compared to operating losses in the prior fiscal year of $4.7 million and $2.5 million, respectively, for the nine months and quarter ended December 31, 2020. For both the nine months and quarter ended December 31, 2021, our Ingredients Operations saw strong volumes in both human and pet food categories, as well as some rebound in demand from sectors that have been impacted by the ongoing COVID-19 pandemic. Selling, general and administrative expenses for the segment increased in the nine months and quarter ended December 31, 2021, compared to the same periods in the prior fiscal year on the addition of the acquired businesses."
}