{
    "symbol": "UVV",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-04 20:45:42",
    "content": " I urge you to read our 10 K for the year ended March 31st, 2021 and form 10 Q for the most recently ended fiscal quarter, such risks and uncertainties include, but are not limited to the ongoing COVID-19 pandemic customer mandated timing of shipments, weather conditions, political and economic environment, government regulation, and taxation changes in exchange rates and interest rates, industry consolidation, and evolution and changes in market structure or sources. Results for our tobacco operations segment improved on higher African carry over tobacco shipments and a favorable tobacco product mix in the three months ended June 30, 2021 compared to the three months ended June 30, 2020. Turning to our results, net income for the quarter ended June 30, 2021 was $6.4 million or $0.26 per diluted share compared with $7.3 million or $0.29 per diluted share for the quarter ended June 30, 2020. Excluding restructuring and impairment costs and certain other non-recurring items detailed in other items and today's earnings release, net income and diluted earnings per share increased by $6.8 billion and $0.28 respectively for the quarter ended June 30, 2021 compared to the quarter ended June 30, 2020. Adjusted operating income also detailed in today's earnings release of $12.6 million increased by $8.3 million for the first quarter of fiscal year 2022, compared to adjusted operating income of $4.4 million for the first quarter of fiscal year, 2021. Operating income for the tobacco operations segment increased by $3.8 million to $8.9 million for the quarter ended June 30, 2021, compared with the quarter ended June 30, 2020. Although tobacco sales volumes were down modestly, segment results improved on carry over shipments, product mix and increased supply chain services to customers in the quarter compared to the same quarter in the prior fiscal year. Carry over crop shipments were higher in Africa in the quarter ended June 30, 2021 compared to the same quarter in the prior fiscal year in part due to some shipments that were delayed from fiscal year, 2021. Brazil experienced an improved product mix on lower volumes in the quarter ended June 30, 2021 compared to the same period in the prior fiscal year, when high volumes of lower margin carry ever crops shipped. Carry over tobacco crop shipments were lower and product mix was less favorable in Asia in the first quarter of fiscal year 2022, compared to the same quarter in fiscal year 2021. And in the first quarter of fiscal year 2022, we also provided increased supply chain services to customers for rapper tobacco compared to the same quarter in the prior fiscal year. Selling, general and administrative expenses for the tobacco operation segment were lower in the quarter ended June 30, 2021 compared to June 30, 2020, primarily on higher recoveries of value added taxes and advances to suppliers. Operating income for the ingredient's operation segment was $4.3 million for the quarter ended June 30, 2021 compared to an operating loss of $0.7 million for the comparable quarter in the prior fiscal year. Selling, general and administrative expenses increased in the quarter ended June 30, 2021 compared to the same quarter in the prior fiscal year on the addition of the acquired business."
}