{
    "symbol": "RELX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 21:23:04",
    "content": " Underlying revenue growth was 8%, up from 7% in the first nine months of the year, with underlying adjusted operating profit growth broadly in-line with underlying revenue growth. Business services, which represents around 45% of divisional revenue, continued to deliver strong revenue growth in financial crime and compliance and fraud and identity. Specialized industry data services, which represents just over 10% of divisional revenue, saw strong growth overall, with commodity intelligence growing particularly strongly and other segments, including aviation, returning to historical growth rates. In STM, further development of analytics continue to drive an improvement in underlying revenue growth to 4%, up from 3% last year, reflecting the ongoing shift in business mix towards higher growth analytics and a reducing print track. In databases, tools and electronic reference, and corporate primary research, which together represent around 45% of divisional revenue, continued strong growth across research, clinical and commercial markets, was driven by further content development and enhanced analytics and decision tools. In primary research, academic and government segments, which also represent around 45% of divisional revenue, growth was driven by a higher volume of articles both submitted and published, with pay-to-publish open access growing particularly strongly. In Legal, we saw a further improvement in underlying revenue growth to 5%, up from 3% last year, driven by the continued shift in business mix towards higher-growth legal analytics. Underlying revenue growth was 64%, driven by the reopening of exhibition venues across most geographies and with an improvement in profitability, reflecting the increased activity levels and a lower cost structure. As Erik said, underlying revenue growth was 9%, the underlying adjusted operating profit growth well ahead of that of 15%. Those improved growth rates, together with the continued recovery in Exhibitions, took underlying revenue growth for the group as a whole up to 9%. Here's the group adjusted income statement, showing the underlying growth of 9% in revenue and 15% in operating profit. The improving long-term growth trajectory is being driven by the ongoing shift in our business mix towards higher-growth analytics and decision tools, and we remain focused on managing our cost growth below revenue growth. Going forward, momentum remains strong across the group, and we expect underlying growth rates in revenue and adjusted operating profit to remain above historical trends, driving another year of strong growth in adjusted earnings per share on a constant currency basis. Your line now has been opened. Yes, a little bit up because the â\u0080\u0093 there is a delay in submissions to acceptances to publish and as the number of submissions leveled off a little bit the year before and now has gone back to the mid- to high-single-digits growth rate of submissions, that means that the number of articles published has a little bit of a time lag as it's come through and get registered. Your line now has been opened. On Exhibitions, in the near term here, as you might understand, and as I mentioned earlier, we remain 100% focused on the growth opportunity from the new reopening and the introduction of these new data-driven digital tools we're using. Your line now has been opened. In the different divisions, Legal and STM, as you might have heard from the two seminars we've had on those individual divisions in the last year or so, both of those division heads have articulated the clear objectives for that growth objective for them, which is to continue on this improving growth trajectory and because this is driven by the business mix shift towards higher-growth analytics and decision tools, and of course, in both of those divisions also supported by the gradual reduction in the print drag on the growth rate. But of course, as we've heard, the subscription percent in each one of those is three quarters of the division is multiyear subscriptions, which means that they're working on improving the long-term growth rate, but it's going to have to be 1 percentage point at a time, and it will be, in the short-term, influenced by possible volatility on the lumpy print revenues in any one-year, even though that effect would also reduce this over time. Your line now has been opened. Your line now has been opened. Your line now has been opened. Your line now has been opened."
}