{
    "symbol": "GECC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 18:21:05",
    "content": " Good morning, and thank you everyone for joining us for Great Elm Capital Corp.'s second quarter 2022 earnings conference call. On today's call, I'll walk through some second quarter highlights and our CFO, Keri Davis, will take us through some of our financials for the quarter. Overall, we continue to make progress on the priorities we laid out after the March quarter, supporting our revamped strategy to improve our NII and NAV over time and maximize shareholder value. While the rights offering led to some per share NAV dilution, we are taking a measured approach to navigating through market volatility, while maintaining our strategy to grow our specialty finance platforms. From the closing of the rights offering on June 13 through the end of July, we deployed approximately $25 million in 15 bet investments at a weighted average price of below $90 current yield over 10% and yield to maturity over 12.5%, excluding $5 million invested in cash surrogate. To that end, our specialty finance mix as a percentage of the portfolio dipped a bit in the quarter. Over the long term, we still see tremendous opportunity in expanding our platform and expect to build a balanced portfolio of corporate and specialty finance investments over time. For the June 2022 quarter, our NII of $1.2 million was slightly above NII in the March quarter, excluding the reversal of previously accrued incentive fees in the prior quarter. While our NII increased slightly from the March quarter, it was impacted by higher average cash balances held over the quarter, as we decided to maintain excess liquidity. Furthermore, our deployment timing was skewed, with over 75% of our secondary debt purchases weighted into the back half of the second quarter. Considering this strategy we do look for the cash drag experienced in the second quarter to continue through the third quarter, as we focus on thoughtfully deploying capital into opportunities with the best income generation and long-term value creation potential for our shareholders. I would also like to note that entering the third quarter cash-generating investments comprise 98% of our portfolio, as we made progress in diversifying and reshaping our holdings. As of June 30, 2022, 29% of our cash-generating assets are specialty finance-related investments, down modestly from 34% at the end of March, but still up from 22% at year-end 2021. As of June 30, our rights offering helped push our asset coverage ratio up to 166.9% versus 147.5% for the March quarter. With that, I'd like to hand the call over to Keri to discuss our second quarter 2022 performance. As Matt noted, we continue to evolve the company and our portfolio during the second quarter, with more stable yield profile that features cash-generating assets and specialty finance platform. During the second quarter, GECC generated NII of $1.2 million versus $2.1 million in the prior year quarter and $6 million in the first quarter of 2022. Please note that the first quarter NII was positively impacted by a $4.9 million waiver, previously accrued incentive fees and would have been $1.1 million excluding the waiver. Our net assets as of June 30, 2022 were $97.6 million, up from $69.3 million at March 31, 2022 and $91.7 million as of June 30, 2021. The increase was driven by our rights offering in June, which added $37.5 million in gross proceeds. Our NAV per share was $12.84 as of June 30, 2022 versus $15.06 as of March 31, 2022 and $23.40 as of June 30, 2021. As of June 30, 2022 GECC's asset coverage ratio was approximately 166.9% compared to 147.5% as of March 31, 2022. GECC reported a net loss of $0.87 per share in the second quarter, compared to a net loss of $1.12 per share in the prior quarter. NII per share was $0.23, compared to $1.31 in the prior quarter, which included the impact of the incentive fee waiver. As of June 30, our total debt outstanding was approximately $145.9 million, comparable with the March 31, 2022 outstanding. As of June 30, 2022 our cash and money market securities totaled approximately $34.1 million. We previously announced that our Board of Directors has approved a $0.45 per share cash distribution for the quarter ending September 30, 2022. The third quarter cash distribution will be payable on September 30, 2022 to stockholders of record as of September 15, 2022. Our Board of Directors has also approved a $0.45 per share cash distribution for the quarter ending December 31, 2022. Annualized the distribution equates to a 14% dividend yield on our June 30, 2022 NAV of $12.84 per share. While we did not cover the distribution with NII in the second quarter, we did enter 2022 with undistributed income and had an unusual one-time benefit in the first quarter from the reversal of incentive fees, further building distributable income for the year. As mentioned earlier, the cash drag experienced in the June quarter will likely continue through the third quarter. Going forward, we intend to grow NII by deploying cash into new investments as we seek to position GECC to cover the quarterly distribution on a regular basis. As I noted, we continue to evolve our portfolio into a diversified book of performing cash-paying investments with stable yield profiles. In addition, GECC's income-generating portfolio continues to diversify with exposure across 19 separate industries through 48 investments, up from 41 at the end of the year resulting in lower average position sizes."
}