{
    "symbol": "GECC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 23:08:04",
    "content": " Hosting the call this morning is Matt Kaplan, Great Elm Capital Corp.â\u0080\u0099s Chief Executive Officer, who will be joined by Keri Davis, GECCâ\u0080\u0099s CFO; Adam Kleinman, President of Great Elm Capital Management; and Mike Keller, President of Great Elm Specialty Finance. In the third quarter, we advantageously deployed approximately $40 million into new investments at average yields in excess of 12%, with 60% of those deployments in floating rate investments. Approximately $30 million of assets were monetized in the quarter had average yields below 10%, with 90% of those assets comprised of fixed rate investments. As a result, nearly half of our debt investment portfolio at quarter end consisted of floating rate debt, up from one-third just one quarter ago. At the same time, NII of $1.1 million or $0.14 per share was below our expectations largely due to costs and expenses related to certain legacy investments and the formation of Great Elm Healthcare Finance, which collectively impacted NII by approximately $0.09. In addition, we estimate NII was impacted by approximately $0.03 from the continued cash drag, resulting from our measured deployment of capital noted on our prior call. In the quarter, we identified a senior management team led by industry veteran, Mike Gervais, to lead the specialized secured lending vertical with support from our existing ABL platform, Sterling Commercial Credit. In the near term, our goal is to grow our portfolio and our investment income to cover our quarterly distribution on a regular basis and we believe you will begin to see progress toward that NII goal in the fourth quarter. With that, Iâ\u0080\u0099d like to hand the call over to Keri to discuss our third quarter 2022 performance. As Matt noted, we continue to reposition the portfolio during the quarter with a higher yield profile and a sizable increase in floating rate debt as a percentage of our holdings to take advantage of rising rates. During the third quarter, GECC generated NII of $1.1 million versus $1.6 million in the prior year quarter and $1.2 million in the second quarter of 2022. Our net assets as of September 30, 2022 were $95.5 million compared to $97.6 million at June 30, 2022, and $99.4 million as of September 30, 2021. Our NAV per share was $12.56 as of September 30, 2022, versus $12.84 as of June 30, 2022, and $22.17 as of September 30, 2021. As of September 30, our total debt outstanding was approximately $145.9 million comparable with the June 30, 2022, quarter end. As of September 30, our cash and money market securities totaled approximately $21.3 million. Our Board of Directors has authorized the $0.45 per share cash distribution for the quarter ending December 31, 2022. The fourth quarter cash distribution will be payable on December 30, 2022 to stockholders of record as of December 15, 2022. Annualized, the distribution equates to a 14.3% annualized dividend yield on our September 30, 2022, NAV of $12.56 per share. At the start of the year, we saw limited opportunities in floating rate secured debt and played defense in a certain higher yielding bonds and preferred security, some of which have been called and refinanced over the past few months in spite of capital market disruption. In addition, we took the opportunity during the credit rally in the third quarter to pair back a couple of fixed-rate bond positions we purchased late in the second quarter, MicroStrategy and Fortress Infrastructure with nice short-term gains. We redeployed these proceeds in the third quarter at 12% plus yields, largely in the floating rate instruments. As we selectively took advantage of the credit market rally in the middle of the third quarter and making sales, we also remained prudent in our deployment of capital. During the third quarter, we had a few disruptions, including a leadership change and summer seasonality impacting originations, which ultimately led to lower distributions from our specialty finance companies. We expect some of this disruption will continue into the fourth quarter, but key hires made in the third quarter are already hard at work, building the pipeline and setting the stage for our platforms to execute on growth initiatives, including our new specialty secured lending vertical focused on healthcare. Before closing out, I would note that as we expected, the cash drag from the June quarter continued throughout the third quarter, and we did not cover the distribution with NII. Going forward, we intend to grow NII by deploying cash into new investments as we seek to position GECC to cover the quarterly distribution on a regular basis. We do expect to see the cash drag continue to some extent into fourth quarter, but it should be less impactful than in the third quarter as we find opportunities to selectively deploy capital to generate solid risk-adjusted returns."
}