{
    "symbol": "GECC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-03 17:27:09",
    "content": "  Operator: Greetings, and welcome to the Great Elm Capital Corp. Fourth Quarter 2022 Financial Results. Good morning, and thank you, everyone, for joining us for Great Elm Capital Corp's Fourth Quarter 2022 Earnings Conference Call. Today's conference call includes forward-looking statements, and we ask that you refer to Great Elm Capital Corp.'s filings with the SEC for important factors that could cause actual results to differ materially from these statements. To obtain copies of SEC filings, please visit Great Elm Capital Corp.'s website under Financial Information, SEC filings or visit the SEC's website. Hosting the call this morning is Matt Kaplan, Great Elm Capital Corp.'s Chief Executive Officer. Today, I am pleased to discuss our fourth quarter results, which I believe marks a clear turning point in Great Elm Capital Corp.'s history and begin to validate the revamped portfolio strategy on which the team has been executing. To that end, the cash income generated from our investment portfolio in the fourth quarter was the highest amount in GECC's history, and our portfolio is almost entirely comprised of cash-generating investments today. Our focus on cash generation and portfolio construction set us up to report fourth quarter NII of $2.3 million or $0.30 per share more than double the $0.14 reported for the third quarter of 2022. Quite simply, our shift to focus on deploying capital into senior secured floating rate investments is working and materially boosted NII from the prior-quarter. Additionally, our Board decided to realign our quarterly distribution to what we believe to be a sustainable level of $0.35 per share for the first quarter of 2023. While 2022 was a challenging year to raise capital in the markets we successfully closed on a $37.5 million rights offering in June, which positions us to take advantage of the volatility in the second half of 2022. In the fourth quarter, we opportunistically deployed approximately $38 million into new investments at average yields of approximately 12%. Meanwhile, about $20 million of assets were monetized in the quarter at average yields below 10%. While we were pleased with the quarter from an income generation perspective, we saw a reduction in our net asset value to $11.16 per share as a result of unrealized mark-to-market losses on certain investments in the quarter. Moving forward, we remain measured with respect to deploying capital in the current market environment and are focused on finding investments with limited risk of permanent capital impairment and durable returns. I'm proud of our team's ongoing efforts as we continue to transform and grow Great Elm Capital Corp. With that, I'd like to hand the call over to Keri Davis to discuss our fourth quarter 2022 performance. During the fourth quarter, GECC generated NII of $2.3 million, growing from $1.1 million in the third quarter of 2022 as well as year-over-year from $1.9 million in the prior-year quarter, excluding an expense reversal. Our net assets as of December 31, 2022 were $84.8 million compared to $95.5 million at September 30 and $74.6 million as of December 31, 2021. Our NAV per share was $11.16 as of December 31, 2022, versus $12.56 as of September 30 and $16.63 as of December 31, 2021. As of December 31, 2022, GECC's asset coverage ratio was approximately 154.5% compared to 165.5% as of September 30, 2022. NII per share was $0.30, more than doubling from $0.14 per share in the prior-quarter. As of December 31, 2022, our cash and money market securities totaled approximately $7 million. Our Board of Directors has authorized a $0.35 per share cash distribution for the quarter ending March 31, 2023. Annualized, the distribution equates to a 12.5% annualized dividend yield on our December 31 NAV of $11.16 per share. When secondary markets are robust, we direct our time and capital to club and/or direct deals as well as specialty finance, while still maintaining an active pipeline of potential secondary market investments. As noted before, we were excited in the fourth quarter to launch Great Elm Healthcare Finance, and I am personally thrilled to be working alongside the Berkadia team. I'm pleased the Board has realigned the dividend and while only two-thirds of the first quarter, I'm optimistic we will cover the $0.35 dividend this coming quarter."
}