{
    "symbol": "PHG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-25 13:19:05",
    "content": " We expect 6% to 9% sales growth and year-on-year margin improvement in the second half of the year, resulting in a 1% to 3% sales growth for the full year, with an adjusted EBITA margin of around 10%. Accordingly, for the period 2023 to 2025, we expect to deliver 4% to 6% average comparable sales growth, with an adjusted EBITA margin reaching 14% to 15% by 2025, recognizing the lower starting point from 2022 and the macro environment. The comparable sales for Connected Care declined 13%, driven mainly by a substantial decrease in Sleep & Respiratory Care, as Q2 last year still included Sleep Therapy system sales and by supply chain headwinds in Patient Monitoring. In our Diagnosis & Treatment businesses, demand remained strong as orders were up 3%, on the back of 29% growth in the second quarter of last year, with growth across all businesses. We continued to see solid demand in North America, where Diagnosis & Treatment orders declined 6%, but on the back of over 70% growth in Q2 of last year. Although Connected Care orders declined 2% in the quarter, demand remained strong, with an average growth of 7% over the last 3 years. This gives us the confidence that we will resume growth from the third quarter onwards, which is expected to result in a 6% to 9% comparable sales growth in the second half of the year, on the back of a 9% decline last year. We further expect to deliver 1% to 3% growth in the full year, which includes approximately â\u0082¬500 million impact from the lower sales in China, Russia and the supply shortage compared to our January guidance after mitigation as well as significant cost inflation. Some of the actions we are taking: engaging with senior government officials, strategic suppliers and foundries to prioritize health care; directly working component issues across all tiers of the suppliers; diversifying sourcing of high-risk components, and we've now qualified over 300 alternate component suppliers till date; redesigning printed circuit boards or PCBs to qualify alternate sources of supply; driving dual sourcing in low-cost locations for magnets, tubes and detectors; expanding long-term contracts with strategic suppliers, including logistics; and driving a risk mitigation program covering 1,500 suppliers or 70% of our revenue, with actions that include dual sourcing as well as prebuild of inventories. Or let's take the innovations in our new Spectral CT 7500, which reduce the overall time to diagnosis by 34% due to a 23% increase in diagnostic confidence, all resulting in 26% reduction in follow-up scans, a truly revolutionary and innovative CT. Our diagnostic pathway informatics solutions optimize clinician workflows by connecting diagnosis with therapy selection and delivery. Based on these actions, the strong fundamentals of our businesses and taking into account our 2022 exit rate, we now expect to deliver comparable sales growth of 4% to 6% and an adjusted EBITA margin of 14% to 15% by 2025, with further improvement thereafter. Well, I think your first question relates back to also my answer to Hassan, where I said the order book underpins the revenue growth of 6% to 9% for the second half of the year. I call it, in fact, a pivot point, a hinge moment, from a negative first half to a resumption of growth in the second half and where cost productivity and pricing and supply chain actions underpin a 6% to 9% growth for the second half year."
}