{
    "symbol": "XP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 00:04:05",
    "content": " This also has an impact in the take rate, because of course, especially if you see, instead of looking at the last 12 month take rates as we do, where you have five data points of AUC, when you look at only the annualized quarter and try to get the take rate, this higher AUC as a denominator will have an impact there, but a growth of 22% year-over-year. If you look at insurance services revenue related to capital market, it’s a 48% decrease year-over-year, 55% decrease quarter-over-quarter. When we look at the capital markets activity and getting all the revenue that we get from there, insurance services, retail channels, REITs and compare the revenue of March to the average revenue again of January and February together, March was 260% greater than the average of the first two months of the year, given a sign of recovery ahead. So retail keeps the three fourths of the total revenue, but then you have institutional increasing the relevance, basically because of the record that we had this year because of the war, the trading desk, everything that I explained already going to 17%, which is unusual, usually it’s like 11%, 12%. If it has an impact, so if you take that and in the fourth quarter was R$233 million, if you take that out, you’re going to see that adjusted EBITDA in the first quarter was pretty much flat a little bit greater than fourth quarter without the benefit of the capital market activity that we had in the first quarter. So it’s a high custody that you are using as in a letter, a retail revenue that has grown 16% year-over-year, but had a huge impact in terms of specifically capital market activity. And I see it was in a significantly negative in the quarter, it was R$1.2 billion negative, and it looks like it’s the first time, at least at least look over the next four quarters, six quarters that this number is negative. So we – you can think about like a revenue growth, new clients and clients that we already have, of course, in investments that new money can come from both clients, but even if we don’t bring any new investment for the customers we already have."
}