{
    "symbol": "XP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 00:49:08",
    "content": " We know we are in a tough macro environment with the bare markets, and that has an impact in the investment business, especially, but despite these tough macro environment, we were able to deliver our all-time-high record quarterly revenues, R$3.6 billion in the second quarter of this year with also an all time high retail revenues, a growth of 15% quarter-over-quarter. Last year, December, we highlighted the new verticals to give more disclosure about those new verticals that are in very early stage, and they do not get the same impact of the macro environment as investments and by the new verticals, I mean, the credit card credit, credit, the retirement funds and insurance and those new verticals added together they grew 113% year-over-year, very strong growth quarter-over-quarter also a strong growth, 7%. And by early stage initiatives, we mean banking from scratch the direct international investment platform and also we built from scratch XTAGE, our digital asset platform that I'm going to talk more about it, also builds from scratch and internal advisors investments as we believe there is a huge opportunity together with the IFAs plus internal advisors to keep growing and disrupting the concentration in the investment and financial landscape in Brazil. When I look at the mix, the product mix, just to give you some numbers here equities capital market and listed funds altogether, as a percentage of our total revenue in the first semester, last year was close to 35% of total revenue. On the other hand, when we look at fixed income floating and the remuneration over our adjusted gross cash and we add all of that together in the first semester last year in a bull market, they represented less than 20% of the total revenue. So going to the retail revenue, all-time high, we had â\u0080\u0093 in the first quarter this year, we had a lot of questions from investors about the take rate of the first quarter. Now going back to your question, looking forward I would expect something close to be adjusted EBITDA, so the 1.2 billion per quarter when we have, there is a volatility when we pay bonus, we pay on a semester base."
}