{
    "symbol": "DM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 21:13:06",
    "content": " Revenue for the fourth quarter was a record for the company, $60.6 million, coming in towards the top of our revised guidance range, with a fantastic quarter of customer adoption with many new and existing customers contributing to growth, including Bayer, BMW, Carbon Motorsports, Cummins, Dixie Iron Works, Eaton, Fraunhofer, Google, Honeywell, Jacobs Institute, Matthews and Entire Power, just to name a few. Highlighting full year 2022 results, on the right side of the slide, revenue was $209 million in 2022, representing growth of 86% over 2021. We have earned the reputation of being at the forefront of 3D printing innovation, and thatâ\u0080\u0099s now transitioning into a real tangible result as the third largest additive manufacturing company by revenue, but fully focused on mass production, which we believe has the largest addressable market and greatest growth potential. After years of development and nearly $100 million in investment, we started shipments in last year of our Production System P-50, a truly groundbreaking product that introduces performance and speed characteristics unmatched in the binder jetting market. Turning to Slide 9, Iâ\u0080\u0099d like to outline how we view our business in terms of two core technologies, binder jetting and photopolymer printing, both area-wide technologies that improving performance over time, benefiting from Mooreâ\u0080\u0099s Law, and both focused on mass production end-use part applications versus prototype and tooling. Adjusted EBITDA for fourth quarter of 2022 was negative $21.1 million, improving sequentially by $7.1 million compared to third quarter of 2022 and improving year-over-year by $4.7 million versus fourth quarter of 2021. Adjusted EBITDA is trending in the right direction as the $50 million in cost-reduction actions undertaken last year begin to positively impact adjusted EBITDA, and we expect to realize continued improvements from these cuts in the coming quarters. In addition, the incremental $50 million in cost savings announced last month will create a further tailwind for adjusted EBITDA, as results from those cuts contribute to financial results in the first half of 2023 and then more meaningfully in the back half of 2023."
}