{
    "symbol": "DM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 20:56:09",
    "content": " Good afternoon, everyone, and thank you for joining us to discuss Desktop Metal's financial results for third quarter 2022. Please note, our financial results, press release and presentation slides referred to on this call are available under the Events & Presentations section of our Investor Relations website. These forward-looking statements reflect Desktop Metal's views and expectations only as of today, November 9, 2022, and actual results may vary materially based on a number of risks and uncertainties. For more information about the risks that may impact Desktop Metals business and financial results, please refer to the Risk Factors section of the annual report on Form 10-K and quarterly report on Form 10-Q in addition to the company's other filings with the SEC. With that, it's my pleasure to turn the call over to Ric Fulop, Founder and CEO of Desktop Metal. Before we begin, it's my pleasure to welcome to the call Desktop Metal's new CFO, Jason Cole. Jason is a highly accomplished finance executive, who is joining us from an 18-year career at Analog Devices, most recently as Division CFO of a $10 billion business overseeing 12, 000 and 15 internal sites. Jason brings more than 20 years of experience in global finance operations, supply chain management, M&A integration and FP&A. We will start with a review of third quarter 2022 financial results, including detailing a few recent actions in response to our results in the current business environment. I'll follow with a number of recent business developments of note, including a promising new strategic partnership with Align Technology. Consolidated revenue for the third quarter was $47.1 million, representing a year-over-year growth of 85%, including contributions from acquisitions. Relative to internal forecasts reflected in our public guidance, we saw lower than expected sales volume towards the end of the quarter, which is typically when we see a sharp acceleration in volume as Europe and to a certain extent the U.S. to matter their slower summer months. Our printed casting business continues to perform well, and we saw very good resilience in our dental and healthcare platforms, but these strengths were offset by softness across the balance of our portfolio. As the third quarter progressed, in some cases, orders we expected to close shifted into later quarters. We saw customers delayed purchase decisions amid economic concerns, which was not the case at the start of the quarter. In addition, we experienced currency headwinds in international markets, which compounded to the lengthening of sales cycles towards the end of the quarter. While our product gross margins continue to improve and are well ahead of overall gross margins, there's a sizable overhead in our COGS that has a major impact on lower revenues. Our cost reduction initiatives announced in June significantly reduced our expenses on a dollar basis, the adjusted EBITDA trailed our internal forecast as a result of decreased sales volumes relative to expectations. This is not the first time, a recessionary cycle has impacted growth in the additive market. The last time this happened in a meaningful way, pre-COVID was 2008 to 2009 when the market contracted 3% on an annualized basis. And in the decade that followed the market rebounded significantly, compounding at 27% growth. The long-term trends supporting broad adoption of additive manufacturing and growth to over $100 billion in the next decade remain intact, particularly for mass production. Additive solutions unlock benefits of lower cost, on-shoring, digital inventories, assembly consolidation and design freedom among others that are enabling businesses to remain resilient and react more quickly to external circumstances in both supply and demand. As I've said in the past, production-based 3D printing is less affected than prototyping in challenging environments, and I still believe that is the case. However, projects that are still not fully greenlighted on the production side can be delayed as companies across the economy face tighter CapEx budgets. The durability of these benefits remains incredibly strong, and the trends driving more and more customers to embrace 3D printing will last well past the current short-term macro challenges. Notwithstanding current macroeconomic impacts on the business, we are not satisfied with our execution or performance in Q3. We have already taken swift actions to course correct in order to reduce our expense structure, well beyond what we outlined in June, getting profitable is our number one priority. As a result, we're tuning even more aggressively and quicker than initially planned, producing our cost structure improves our path to profitability time frame and enable us to reach our adjusted EBITDA breakeven by the end of 2023, even a lower revenue threshold if macroeconomic headwinds persist. We will continue to monitor the macro environment and make adjustments to expenses as needed to ensure this company turns profitable under the current capital structure, in line with our commitments. Now let's shift gears and discuss a number of very positive recent developments for the business, with significant revenue potential for 2023 and beyond. AM 2.0 continues to offer advantages versus traditional manufacturing for a host of applications, and we're seeing continued traction from both customers and major strategic partners in the added manufacturing ecosystem that are embracing these benefits. Last week, we announced a new strategic partnership with Align Technology to bring digital dentistry and workflows for printing to the mass market. We're very excited about the opportunity in this partnership, and I'll go into further detail on the following slides. We also announced a multifaceted partnership with Siemens to advance added manufacturing with a focus on large manufacturers that among other efforts, will integrate Desktop Metal's AM 2.0 solutions into Siemens simulation and planning tools, enabling production scale, factory planning and automation. In addition, we expanded our partnership with Henkel to qualify additional industrial photopolymer materials for the Xtreme 8K, the world's largest DLP printer for high-volume production of end-use parts. We're actively engaged with some of the largest companies in the world on the Production System in P-50 in particular, and we remain steadfast in our plan to build major business for hyperscalers on this platform, which provides the highest throughput and lowest cost part production of any metal printer in the market. Starting in December, we're planning to begin hosting quarterly open-house meetings to focus our progress on P-50 to the industry and potential customers. The Shop System has become a global success, and we've already taken sensor-based production processes that used to take required specialized knowledge and made it turnkey, easy to use and accessible to all manufacturers. And finally, at IMTS in September, we launched the Figur G15, the first commercial platform of its kind to shape standard sheet metal on demand directly from a digital design file. Using patent pending technology, manufacturers now have a new competitive way to form sheet metal parts and products quickly, but the high upfront costs associated with stamping prices in dies, which typically have a long lead time and are expensive to produce. While this product is still in its early commercialization, Figur is a one of a kind turnkey solution for the more than $300 billion sheet metal forming and fabrication industry that we're very excited about. Turning to Slide 5, I'd like to provide more color on the recently announced partnership with Align Technology, the undisputed category leader in clear aligners, intraoral scanners and dental CAD software. More and more dentists are looking for an integrated digital dentistry platform that encompasses scanning and printing hardware, dental parts made with best-in-class materials and design and production services. Through this partnership, Align's market-leading iTero intraoral scanners will be offered as a seamless managed service to dentists in a subscription model with recurring revenue. This is a gateway for our connected suite of digital dentistry solutions with seamless workflows backed by Desktop Labs, experienced network of dental laboratories and premium Desktop Health printers and materials. This integrated solution will allow dentists to capture patient data with iTero scanners, create print-ready digital files using Desktop Labs' design capabilities and 3D print custom parts either in their office or using Desktop Health Einstein printers for using Desktop Labs outsourced manufacturing services. It's a fully integrated care side workflow, providing real-time technical communication, workflow management, digital design and case support. We expect most, if not all of the $30 billion in annual dental parts market spend to move to 3D printed manufacturing this decade, the technology that's traded for prime time. We expect new CTC classification of materials used for dental insurance codes to be published in December this year to cover our Class II printed restorations in the U.S. With that backdrop, we aim to reach thousands of general practices over the next 12 months with this integrated workflow and potentially tens of thousands over the coming years. Moving on to Slide 6, we continue to grow the moat around desktop metal products. Since we entered the public market in 2020, our portfolio of patent and patents applications has grown from approximately 120 to over 950. This is one of the largest and most valuable intellectual property portfolios in the added manufacturing market and is primarily focused around mass production and technologies like binder jet and DLP, which benefit from Moore's Law and become more cost effective over time. Turning to the following slide, we really had some great customers that adopted or continue to adopt our technology in the third quarter. We've highlighted a few here on the left side of the slide, Precision Castparts, Schlumberger, Ford, First Solar, Cummins, Ultra Safe Nuclear Corporation and SolidCAM to name a few. On the right side, I'd like to highlight one of our customers' demonstrated repeat success with our products on both metals and polymers. In the span of a year, Gullmolar purchased 8 systems including 4 studio systems for metal part production, two Envision Ones for polymer printing and 2 DM print and furnace systems. Beginning on Slide 9, you will see highlights of our financial performance for the third quarter of 2022. Consolidated revenue for the third quarter '22 was $47.1 million, including contributions from acquisitions, up 85.1% year-over-year from $25.4 million in the third quarter of 2021. As previously detailed, compared to our internal plan, revenue was significantly impacted by customers delaying purchase decisions amidst an uncertain macroeconomic backdrop. On the next slide, non-GAAP operating expenses were $41.5 million for the third quarter '22. Through initial actions under our cost optimization initiative, we reduced non-GAAP operating expenses sequentially by $4.5 million versus the second quarter of 2022 and $10.5 million versus the first quarter of 2022. Third quarter '22 non-GAAP operating expenses as a percentage of revenue were 88%, which is an improvement versus 138% in the third quarter of '21. Nevertheless, we're committed to improving adjusted EBITDA going forward as we prioritize our path to profitability. We ended the third quarter 2022 with $217.3 million in cash, cash equivalents and short-term investments. We are well funded from a cash position even in a challenging macro environment, with our increased efforts to reduce our expense structure, expected to drive meaningful cash flow improvements. Inventory reflects our multi-quarter focus on supply chain resiliency, and we're now in a position to release that inventory over the next several quarters. Moving to our financial guidance, we're revising our revenue and adjusted EBITDA outlook to take into account our third quarter financial performance in a challenging environment, affecting CapEx spending due to recessionary concerns. As a result, for fourth quarter 2022, we expect to generate revenue in the range of $51 million to $62 million, implying a full year 2022 revenue of $200 million to $210 million or 78% to 87% growth over 2021. While customer traction is still very strong, we're taking a very conservative approach to revenue expectations. Additionally, for fourth quarter 2022, we expect adjusted EBITDA to be negative $20 million to $26 million, implying a full revised 2022 adjusted EBITDA of negative $117 million to $123 million. In closing, while the third quarter presented greater than expected challenges, I can assure you we are working with urgency to execute on what I've outlined today. While macroeconomic factors are impacting our industry at present, the benefits of mass production added manufacturing are only increasing. We're working very hard to mitigate some of the external factors, and I remain extremely confident in the value of our AM 2.0 mass production solutions that we bring to our customers and the massive long-term opportunity in added manufacturing. At this moment, we've continued to move beyond it, and we have quite a bit of levers to go above our initial plan, and we're going to essentially trim as needed until we get to cash flow breakeven. The good news is at the company, we've got, you would look at Horizon 1, Horizon 2, Horizon 3 in terms of the way we look at our products, the things that are shipping today, things that are going to ship next year '23, et cetera. So we're not cutting things that are revenue generating next year, but we are trimming expenses in all these other areas. So we're going to go beyond what we initially outlined in June, and we're already beyond that right now. Noelle, we've seen an acceleration in some of these programs as there's needs to diversify supply chain outside of China for some of those consumer electronic companies and we have multiple customers that we're engaged in and continue to make very good progress in this area. And I think it's going to -- for us, we have a lot of people working in this area, and we continue to believe it's going to be a meaningful part of our business in the long run, and there's an area that can become a significant business probably most produced type of parts in the AM world. We do think, like I said earlier, and if you look at Slide 3 of our presentation, there's just periods of time in additive when you enter a recession and you have essentially a slowdown of growth in '01, '02, it was flat or slightly negative, same in '08, '09, and then there was only 5% growth in 2020. So I would say, what we saw in September was a very quick pullback to decisions and things moving to the right on programs that we really had enough deals in play towards the end of the quarter or the last 3 weeks that we thought we can meet our numbers. And it was -- as we approached the end of the quarter that we realized that things were going to slide, you have the pound at 100. And so I would say, we do have a bullish view on the future of expenses to get to your question and how -- where are the things that you cut. We're adjusting our spending on things that are nice to have no need to have, in particular, longer-term, more futuristic projects. If I can look backwards a mistake, I felt like I didn't want to break any of the things required by going too quickly as we were acquiring. We have already cut more than what we outlined in June, and we continue to have a plan to trim a lot of levers so that we get to our breakeven targets at the time that we've told the market or faster even if conditions persist in a challenging environment. Well, I would say -- I mean, we're monitoring our stock price. We have quite a bit of inventory that we will -- we built in advance to essentially have a buffer with supply chain issues, and we'll be clearing that over the course of the next year and releasing quite a bit of cash flow. But I think your question on the stock market, we don't have an issue at the moment. But as a business, I do feel very bullish that we're going to have continued growth in growth faster than the market as we are positioned in a production area that is growing mass and prototyping and tooling. And I think that next year, we've been working on a lot -- you work on these projects. We have a lot of irons in the fire that should lead to growth next year that would be faster than the market, and we feel good about it. I think if you asked anybody in the beginning of the year, they never expected us to -- when people gave their projections for the year, and we don't do quarterly guidance at the moment, maybe we should, but we do yearly guidance. The -- in some of these other challenges with the fact continue to -- so that macro backdrop, I think, is definitely part of what's affected our industry. And I would say, it's probably similar to '08, '09 or similar to '01, '02 and this is people sort of delaying decisions versus canceling adoption of technology. We are market leadership in metal binder jetting that's dominant at a very, very good place with dominant market leadership in printed castings with dominant market leadership in Class II medical parts in dental. It can be a multi-billion dollar business, but we're doing homes, where we're the only company with industrial high throughput foam printing. So I'd agree with you, Ric, I think I came into the year thinking this industry is going to grow 18% to 20%. But I mean if you look at your 10-K filing from the beginning of the year, you guys said that if you owned all of your acquired businesses as of January 1, you had done like $208 million in revenue. Beginning we're already in the middle of it, and we are trying to put a number that would feel like having gone through this now, we want to make sure that we hit this number, but we feel confident on it. So I would say -- what's your question, the dental market for us, given that we have the best performing materials in the market with best properties, we're going to have insurance coverage next year for our products are -- is very strong, and we have this partnership with a line that's going to deliver very good growth next year, so that -- we're really well positioned in that segment. And those large companies are now going from their first or second or fifth or tenth system now to mega deployments and that step change in deployment, particularly as people look at that re-shoring is going extremely well. I would say, we have growth on the industrial plastics, industrial metal parts on the regular biogenic side. I think what we've seen in this past quarter is, we saw a delay of decision-making and it is driven in our opinion, by macroeconomic uncertainty, things like the bonding at 100 at the end of the quarter, things like that. Eventually in an inflationary environment, if people want to deploy CapEx and so -- because they know that they won't be able to afford in the future to do some of these things, and it's a way to like improve profitability. So I don't know where how long we're going to be in a recessionary period, but I think nobody expected last December, they would still be raising rates at this time. I think people thought that right now, things would have abated and inflation would have come down. And I feel really, really good about where we are going with our customers in this area and it's multiple customers. So I feel like we -- look, we took our lumps earlier in the year and raised cash probably, people looked at us like we were from outer space because we did that. Obviously, this initial partnership is kind of on the scanner side, a lot of language in some of the releases, suggest some potential expansion of that partnership. I mean, we have a very good business that we're setting up with our partners at Align is profitable out of the gate. But as you know, we provide managed design and printed parts through our Desktop Labs partnership services a bundling of the scanner parts in a managed service to the dental market, and it is really very much the future of how these products are going to be consumed. And this is going to allow us to essentially convert our business today, people selling printers and materials, and we may have doctors that don't have the full capability to do the design themselves. This is -- obviously, we cannot preannounce things did our call be on what we've currently talked about. $30 billion of opportunity, we get insurance reimbursement starting in January. Absolutely, I think -- I feel really great about where we are from inventory position now, we're going to start to bleed that off to free up cash. And it is what it is, but I feel like we're going to get to a very good place over the next 12 months. Once again, I'd like to thank everybody for taking the time to join the call and all your interest in Desktop Metal. As always, I want to extend my appreciation to all the members of team DM for their continued work and dedication in advancing our vision of Additive Manufacturing 2.0 for mass production. We look forward to speaking to you again either at Formnext or future upcoming investor events, in our fourth quarter financial results call."
}