{
    "symbol": "DM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 11:50:10",
    "content": " While we expected the gross margin to come down sequentially as a result of seasonally lower Q1 revenues and additional overhead from acquisitions, we did underperform relative to our internal forecast due to several factors, including a lower margin mix increased one-time costs related to product launches for the production system, P-50 and Einstein series and impacts from continued global supply chain and logistics disruptions, most notably higher than anticipated trade expenses. Looking ahead to the balance of 2022 there are a number of factors that give us confidence on our expectation of meaningful gross margin expansion for the year, including higher expected sales volumes resulting in improved overhead absorption, a more favorable product mix and recent product launches scaling into more mature margin profiles. Adjusted EBITDA did under-perform relative to our internal forecast driven primarily by the factors that impacted gross margins, including seasonally lower Q1 sales volumes, product mix and one-time product launch expenses as well as higher than expected operating expenses. And finally, moving to guidance as Ric detailed with strong first quarter revenue contributions and robust demand across our portfolio, we are reaffirming our revenue expectations of approximately $260 million for the full year 2022, which represents 131% year-over-year growth. We also continue to expect adjusted EBITDA of approximately negative $90 million as we anticipate a combination of increased revenue, improved gross margins, operating expense moderation, and operating leverage to drive significant improvements in adjusted EBITDA throughout the balance of 2022. We had launch of Einstein in Q1 and now in Q2 we are making much more of that product as we as we go through our ramp, but we feel very good about the – I don’t know if this answers your question but…\n So, I think the other part Josh, that we have talked about, typically we see about 15% of the – 15% percentage of the revenues in Q1, Q2 and Q3 tends to be in the low 20s. Well, I think that our strategy on inventory has been that, that we don’t want to have a situation like we had in Q3 last year where we were trying to balance things and ended up a short of parts to be able to ship products before the end of the quarter."
}