{
    "symbol": "IDXX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 10:01:03",
    "content": " Key execution metrics were excellent, reflected an 18% gains in premium instrument placements, continued strong double-digit growth in veterinary software and service revenues and a nearly 1,100 basis point U.S. CAG Diagnostics recurring revenue growth premium to same-store clinical visit levels. We've updated our full year overall organic growth outlook to 5.5% to 8% for 2022, reflecting 6.5% to 9% full year organic growth in CAG Diagnostic recurring revenues. CAG Diagnostic recurring revenues increased 7% organically in Q2, compared to strong prior year levels, reflecting 8% gains in the US and 5% growth in international regions. Our analysis points to two primary factors driving the recent change in US clinical visit growth trends, reduction in vet clinic capacity from peak pandemic levels and the continued lapping of the significant step-up in demand for pet health care during the pandemic, including benefits from the 10% increase in the pet population in 2020 and 2021. However, given the recent pullback in clinic capacity, which continues to be affected by near-term staffing challenges and the lapping of strong underlying demand levels throughout 2021, we believe it's appropriate to plan for continued year-on-year pressure on US clinic visit growth in the second half of this year. IDEXX' US CAG Diagnostics organic recurring revenue growth of 7.6% in Q2, continues to outpace solid sector growth trends reflected in the 1,070 basis point premium to clinical visit gains. CAG premium instrument placements increased 18% in Q2, reflecting 8% gains in the US and 25% growth internationally, as clinics showed continued confidence in investing towards support of increasing demand for diagnostics globally. Global Lab revenues increased 6%, organically in Q2 as high single-digit growth in the US was moderated by flat organic revenue growth in international regions, reflecting pressure on same-store clinic visit growth in Europe, including increased macroeconomic impacts. Operating expenses increased 46% year-on-year as reported in the second quarter and 48% on a comparable basis, including a 35% OpEx growth impact related to $80 million in discrete R&D investments. We're lowering our full year organic revenue growth range by 2% to reflect first half performance, recent care sector trends and to incorporate potential additional impacts from macroeconomic factors at the lower end of our guidance range. Supporting this outlook are benefits from price increases were advancing in the second half of 2022, which we estimate will provide 1.5% to 2% of additional benefit to worldwide H2 CAG Diagnostic recurring revenue growth building on first half gains of approximately 4%. Net of this incremental price benefit, the midpoint growth outlook for the second half of 2022 is consistent with the global sector growth trends exiting Q2 and reflects expectations for sustained high IDEXX CAG growth premiums supported by continued strong IDEXX commercial execution. At our updated revenue growth rates, we're now planning for full year operating margins of 26.4% to 26.9%, an adjustment of approximately 50 basis points from our last outlook. This was reflected in record second quarter premium instrument placements, continued high growth in cloud-based PIMS placements in a sustained IDEXX CAG Diagnostics recurring revenue growth premium to clinical visit growth. US diagnostics revenue per practice grew 6% during the second quarter, against a very strong prior year base, as veterinarians use diagnostics to deliver best care standards, while benefiting from profitable clinical services growth. We're also seeing continued momentum across global regions related to the adoption of IDEXX platforms, reflected in 25% growth in international premium instrument placements, including the successful expansion of our ProCyte One platform. We had excellent growth in ProCyte One placements across regions for the second quarter and continued high levels of customer satisfaction and retention, supporting the expansion of our global premium hematology installed base aligned to the approximately 4,000 placements annually as shared in last year's Investor Day."
}