{
    "symbol": "IDXX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-06 12:49:06",
    "content": " Revenues increased 7% organically, driven by 8% organic gains in CAG Diagnostic recurring revenues and continued strong growth in our software and water businesses. This performance is reflected in a 1,200 basis point U.S. CAG recurring revenue growth premium to U.S. clinical visits in the second half of 2022, driven by a solid volume growth premium and higher levels of price realization. We sustained record high customer retention levels and solid new business gains globally and achieved a record level of annual CAG premium instrument placements, which drove a 13% year-on-year expansion of our global premium instrument base. Fourth quarter organic revenue growth of 7% was supported by solid organic gains across our major business segments, including 8% organic growth in our CAG business, 10% organic growth in water and 6% organic growth in LPD revenues. We achieved continued double-digit organic revenue growth benefits from key execution drivers, including expansion of our premium instrument base, solid new business gains, sustained high customer retention levels and expansion of diagnostics revenue per visit, including benefits from higher price realization. IDEXX' U.S. performance was supported by a 1,200 basis point growth benefit from IDEXX execution drivers, including approximately 7% net price gains and continued solid growth contributions from customer additions and leverage of IDEXX innovation. IDEXX VetLab consumable revenues increased 9% organically, reflecting solid gains across U.S. and international regions compared to strong prior year growth levels. The quality of placements continues to be excellent, reflected in 3% global gains in new and competitive Catalyst placements, including 7% gains in the U.S. We also saw a 5% growth in new and competitive premium hematology placements globally leveraging strong customer interest in ProCyte One. Global Lab revenues expanded 8% organically, reflecting high single-digit gains in the U.S., which were impacted to a degree by holiday week weather impacts and improved organic growth in international regions. We estimate net price changes contributed approximately 7% to worldwide CAG Diagnostic recurring revenue growth in Q4, reflecting product and service enhancements and coverage of inflationary impacts. As we'll discuss, we've incorporated an expectation for a 7% to 8% global net price growth benefit for the full year in 2023 and building and effects from annual list price changes, which were communicated recently to our customers. Water revenues increased 10% organically in Q4 and for the full year 2022, reflecting strong performance across our major regions, including benefits from net price improvement and volume gains. Full year EPS was $8.03, a decline of 1% on a comparable basis, net of approximately 9% of EPS growth impact from discrete R&D investments. As noted, CAG Diagnostic recurring revenue gains will be supported by an estimated 7% to 8% full year growth benefit from net price realization with expectations for 8% to 9% global net price gains in H1 and 6% to 7% net price benefit in H2. In terms of sensitivities to changes to the FX rates assumed in our press release, we projected a 1% change in the value of the U.S. dollar would impact full year reported revenue by approximately $12 million and operating income by approximately $3 million to $4 million, net of currently established hedge positions. Our 2023 EPS outlook is $9.27 per share to $9.75 per share, an increase of 16% to 21% as reported and 19% to 26% on a comparable basis, including approximately 10% of the EPS growth benefit from the lapping of discrete R&D investments. For Q4 in the full year 2022, we achieved 8% organic growth in CAG Diagnostics recurring revenues supported by double-digit contribution and growth from IDEXX execution drivers. This strong performance is reflected in record full year placements for both CAG diagnostics premium instruments and software practice information management systems, continued solid contribution from new business gains, sustained high customer retention rates and net price realization aligned with our expectations. These teams delivered fourth quarter global premium instrument placement levels that were the second highest for any quarter in company history, supporting 13% growth in our global premium instrument installed base and contributing to record annual premium instrument placements for the full year 2022. But going back to the high end of 11.5% CAG U.S. recurring diagnostic revenue growth, netting out the price benefit, use the midpoint that would be about 4% volume benefit."
}