{
    "symbol": "IDXX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 12:33:02",
    "content": " This is reflected in record Q3 premium instrument placements, double digit growth in veterinary software and digital imaging revenues and 10% organic growth and U.S. CAG Diagnostic recurring revenues. Outstanding execution in the quarter has us on track to deliver a strong full year financial performance aligned with our updated guidance range In terms of our full year operational outlook, we've incorporated our Q3 organic growth results and maintained a similar midpoint estimate for EPS performance, supported by strong second half comparable operating profit gains. Third quarter organic revenue growth of 8% was supported by solid organic gains across our major business segments, including 8% organic growth in our CAG business, 12% organic growth in water and 7% organic growth and LPD revenue. CAG diagnostic recurring revenue increased 9% organically in Q3 compared to strong prior levels, reflecting 10% gains in the U.S. and 6% growth in international regions net of a 1% equivalent day growth headwind. We achieved double digit organic growth benefits from key execution drivers, including expansion of our premium instrument base, consistent new business gains sustained high customer retention levels, and solid expansion of diagnostic revenues per clinical visit, including benefits from higher net price realization. These gains helped IDEXX to deliver continued solid CAG recurring revenue growth, offsetting near term headwinds related to year-on-year declines in clinic visit levels globally, including effects from a pullback in clinic capacity this year, and macro impacts in international markets. Diagnostic revenue increased 7% on the same store basis in the U.S. in Q3, to approximately 9.5% on a per visit basis, reflecting continued solid gains in diagnostic frequency and utilization, including benefits from higher net price realization at the practice level. We anticipate year-on-year visit growth headwinds will continue in the fourth quarter, which is factored into our outlook IDEXX's U.S. CAG Diagnostic organic recurring revenue growth of 9.6% in Q3, which included a 1% equivalent day's growth headwind, continues to outpace sector growth trends. Global Lab revenues increased 8% organically in Q3 as double digit growth in the U.S. was moderated by modest organic revenue growth in international regions, reflecting pressure on same store clinic visit growth in Europe, including macroeconomic impacts. CAG recurring revenue growth, including net price benefits in the range of 5% to 6% to worldwide CAG diagnose recurring revenues in the quarters reflecting product and service enhancements and coverage of inflationary impacts. Water revenues increased 12% organically in Q3, reflecting strong performance across our major regions, including benefits from solid volume gains and net price improvement. Our updated full year organic revenue growth outlook is now 6.5% to 7.5%, reflecting a full year CAG Diagnostics organic recurring revenue growth outlook of 7.5% to 8.5%. Our updated CAG Diagnostic recurring revenue outlook implies fourth quarter organic gains of 5% to 10%, aligned with earlier estimates, which factors in a 2.5% organic growth risk estimate at the low end of the range for potential macroeconomic impacts on demand. Given the significant strengthening of the U.S. dollar this year, in 2023, we estimate that foreign exchange will reduce reported revenue growth by approximately 3%, reported operating margins by approximately 70 basis points and EPS by approximately $0.45 per share at the rates assumed in our press release with current hedge positions. Consistent with trends through this year, diagnostics revenue growth at the practice level continues to be driven by increases in both the frequency and utilization of diagnostics, resulting in 9.5% growth in diagnostics revenue per visit for the quarter, building on the strong gains seen through the pandemic. IDEXX grew overall U.S. CAG Diagnostics recurring revenue at approximately 10% normalized despite recent clinic visit growth headwinds as we benefit from decades of focus and investment, which brings differentiated value to our customers. These results, combined with continued sustained new business gains and 98% Catalyst customer retention rates, will support future recurring revenue growth aligned with the long-term financial framework shared at our recent Investor Day. Furthermore, the shift to cloud-based products that we highlighted at Investor Day continued in the quarter as over 90% of placements were cloud-based subscriptions, reflecting 50% growth in cloud-based placements compared to the prior year and demonstrating the value that last year's ezyVet acquisition continues to bring to the business. So that's been a relatively more meaningful headwind, but the progress that we're making and the very strong instrument placement gains and continued high retention levels, excellent level -- excellent engagement with our customers is allowing us to deliver solid, continued growth."
}