{
    "symbol": "IDXX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 11:47:03",
    "content": " CAG Diagnostic recurring revenues increased 9% organically compared to higher prior year levels, which included benefits from a significant expansion in new pet patients during the pandemic. We have seen a moderation in clinic visit levels compared to second half 2021 growth trends, which form the basis for our original 2022 CAG Diagnostic recurring revenue organic growth outlook of 12% to 14%. We're adjusting our overall organic growth outlook to 7.5% to 10%, primarily reflecting an adjustment of 3% in our targeted full year CAG Diagnostic recurring revenue growth range, now projected at 9% to 11% compared to strong prior year levels. We're targeting higher growth in the second half of 2022, with the high end of our full year growth outlook reflecting return to our original targeted CAG Diagnostic recurring revenue growth range in H2. CAG Diagnostic recurring revenues increased 9% organically in Q1 compared to strong prior year levels, reflecting 10% gains in the U.S. and 8% growth in international regions. Overall Q1 CAG gains were also supported by 22% organic growth in CAG instrument revenues and 13% organic growth in veterinary software and diagnostic imaging revenues, in addition to benefits from the ezyVet acquisition. Compared to the 2019 pre-pandemic base, U.S. same-store clinical visits and diagnostic revenues increased 4% and 11%, respectively, on a 3-year compound annual growth basis. IDEXX's U.S. CAG Diagnostic organic recurring revenue growth of 10% in Q1 continues to outpace sector growth trends, reflected in a 1,150 basis point premium to clinical visit gains, in part supported by relatively higher net price realization and equivalent day benefits. CAG premium instrument placements increased 31% in Q1, reflecting 24% gains in the U.S. and 35% growth internationally, as clinics show confidence in investing towards support of increasing demand for diagnostics globally. We achieved relatively higher benefits from net price gains in the first quarter, with 4% to 5% average gains on U.S. CAG Diagnostic recurring revenues and solid levels of increases across international regions. Our full year organic revenue outlook of 7.5% to 10% reflects an adjustment to our original guidance range of 2% to 2.5%, primarily reflecting a recalibration of our full year growth outlook for CAG Diagnostic recurring revenues. Our recalibrated CAG Diagnostic recurring revenue growth outlook is 9% to 11% for the full year, building on strong prior year gains. These impressive gains were moderated in Q1 by a 2% year-on-year decline in clinical visits, which is a change from the very solid 2% to 3% clinical visit growth trends we saw in the second half of 2021. Veterinarians and their staffs are continuing to adapt to the extraordinary growth in demand over the last 2 years when the U.S. pet population expanded, approximately 10%, resulting in double-digit increases in same-store clinical visit levels, reflective of the sustained pressure on their time as well as staffing challenges that many sectors are facing currently. Our full year outlook for CAG Diagnostics recurring revenue organic growth of 9% to 11% builds on our 17% average annual growth over the last 2 years, with goals to accelerate gains in the second half of 2022 benefiting from continued advancement of our commercial and innovation efforts. Just to revisit, we had a range on the multiyear CAG Diagnostic recurring revenue growth, and we raised the lower end of the range, I think, reflecting our confidence into the range is 11% to 14%."
}