{
    "symbol": "BLX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 19:41:06",
    "content": " Three main points here: one, in today's context the short-term nature of our loan portfolio allows us to accelerate repricing, capturing the upside of the interest rate increases; two, also our focus on foreign trade financing in Latin America positions us well to benefit from higher lending spread from customers who are directly experiencing increased demand for higher price commodities; and finally, the disproportional increase in local rates in the region, versus dollar-denominated rates, is driving a higher demand for dollar loans. Total assets set record levels again this quarter, reaching close to $9 billion as seen in the graph to the left on the back of sustained loan growth, complemented by a credit investment portfolio, which allows us to further diversify our exposures by country, including investments in non- LatAm issuers, mainly from the US representing 51% of the total. In terms of asset quality, provisions for the second quarter were substantially lower at $0.8 billion, compared to the $8 million provision charge in the first quarter of this year, mainly associated with a $1 billion or 14% sequential increase in the credit portfolio balance at the close of March. Strong combined loan and credit investment portfolio average growth of $1.9 billion year-on-year and $851 million from the previous quarter accompanied the related increase in financial liability and proactive liquidity management, resulted in a positive net volume impact on NII of $7.3 million from last year and $4.3 million from the previous quarter. At the same time, the positive trend in net interest margin reaching 1.54% in the second quarter resulted in an additional net rate effect increase in NII of $4.4 million year-on-year and $2.7 million with respect to the previous quarter. Moreover, the all-in rate differential between loans and financial liabilities shown in the graph to the left denotes a quarterly positive trend, mainly due to increased lending spreads, as shown in the graph at the top right, reaching 2.38% during the quarter, up 40 basis points from a year ago and 18 basis points from the previous quarter. This lending spread expansion reflects higher demand for US dollar financing across the region, based on superior trade volumes and higher commodity prices, coupled with Bladex's increased lending to the corporate segment, relative to financial institutions, the latter usually paying lower spreads and to our focus on extending the average debt maturity profile of our lending book, when and if followed by higher profitability. In addition Phase one exposure which accounts for 98% of the total increased by $295 million during the quarter on new loan origination, requiring $1.8 million in credit reserves at an average coverage of 41 basis points. Please go ahead, sir. Thank you very much. Thank you very much. Please go ahead, sir. Thank you very much. Please go ahead, sir. Thank you very much. Thank you very much."
}