{
    "symbol": "BLX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 16:35:31",
    "content": " The Commercial portfolio grew 12% quarter-on-quarter and 28% in the last 12 months, and it's now close to the historical peak of Bladex of $7.4 billion. Having said that, interest income does not reflect the full impact of the increased volume of commercial assets observed during the period as most of the growth took place in the last week -- or last weeks, I should say, of the quarter, and the bank maintained a higher liquidity levels at the beginning of the year in anticipation precisely of this expected increase in the credit portfolio. At the end of the quarter, 48% of this credit investment portfolio was invested with non-LatAm issuers, mainly from the U.S. We also have a smaller liquidity portfolio of close to $170 million, 100% of which qualify as high-quality liquid assets according to Basel III definitions, placed on multilateral and U.S. issuers and aimed at providing diversification to our liquidity investments, otherwise invested mostly with the New York fed. Notwithstanding, revenues during Q1 were up by 38% year-on-year and remained relatively stable, up 1% quarter-on-quarter, mainly on higher net interest income, I will surely expand on this, and on a sustained growth trend in letters of credit fees with increases above 30% year-on-year and in the mid-single digits quarter-on-quarter. In addition, the net grade effect added another $0.8 million to NII year-on-year, mainly as the all-in rate differential between loans and financial liabilities increased by 11 basis points on higher credit spreads reflecting growth in medium-term lending and market rates starting to pick up, aligned with expected Fed actions. Now when compared to the fourth quarter of 2021, NII was up by $0.9 million, again, strong credit portfolio growth with average loans exceeding prior quarter balances by $492 million and credit investments by another $142 million, was partly offset by the cost of increased liquidity position during the quarter, up $366 million on average, which in turn resulted from increased average funding for over $1 billion as the bank secured incremental funding towards late 2021 and early 2022 in anticipation of strong loan growth, which ended up fully deployed by March of 2022. This average asset composition with increased liquidity levels relative to total interest-earning assets had an impact on overall asset yields during the quarter, which in turn caused a 10 basis point quarter-on-quarter decrease in net interest margin, denoting net interest income to total average earning assets, reaching 1.32% for the first quarter of 2022. As of March 31, 2022, Basel III Tier 1 capitalization stood at 16%, down from 19% in the preceding quarter and from 21% a year ago, due to the higher credit risk-weighted asset base, up 58% year-on-year and 20% quarter-on-quarter, impacted by increased loan and investment portfolio, while equity levels remained relatively stable at over $1 billion at the end of the quarter."
}