{
    "symbol": "BLX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 16:30:39",
    "content": " Starting with Slide 5, total assets continue the growth trend up another 4% during the quarter, reaching over $9 billion on the back of sustained loan growth complemented by an investment portfolio, which allows us to further diversify our exposures by country, including investments in non-LatAm issuers, mainly from the U.S., representing 52% of the total. The bank's core business, namely our commercial portfolio, is constituted by the loan portfolio, which totaled $7.1 billion at quarter end, together with contingencies or off balance sheet assets for another $0.8 billion, the latter mainly consisting of the issuance and confirmation of trade related letters of credit. In terms of sectors, financial institutions represent 43% of the portfolio up by two percentage points from the prior quarter, as we capitalize on business opportunities arising from the liquidity constraint in the region, all while keeping a stringent focus on maximizing credit spreads. The continued positive trend in net interest margin that I just discussed up 23 basis points sequentially and reaching 1.77% in the third quarter, we saw that in a, rate effect increase in NII of $5.3 million in the period. Moving on to Slide 12, fee income from letters of credit remained stable from previous quarter and up from last year, representing a consistent support in fee generation complemented by loan structuring and syndication fees and activity that picked up during the quarter with four transactions executed, resulting in a sequential increase of $2 million. Stage 1 exposure, which accounts for 98% of the total increased by $204 million during the quarter or new loan origination, requiring $1 million in credit allowances at a, 41 basis point reserve coverage. This together with top line growth, including higher fee generation, ongoing capture of operating efficiencies, more than offset, increasing expenses and credit provision, all of which resulted in a profit of $27 million for the quarter, up by 17% sequentially, and 71% year-on-year."
}