{
    "symbol": "OHI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 14:29:08",
    "content": " Early in 2023, we expect Agemo to begin paying rent and interest on the balance of the 29 facilities that they retained in the restructuring and anticipate the rent and interest on the Agemo retained portfolio will add nearly $0.03 per share to quarterly FAD. Our adjusted FFO was $185 million or $0.76 per share for the quarter, and our FAD was $173 million or $0.71 per share, and both exclude several items as outlined in our adjusted FFO and FAD reconciliation to net income found in our earnings release as well as our third quarter financial supplemental. The $239 million of revenue in the quarter included $13.8 million in revenue reductions primarily related to the write-off of straight-line receivables associated with three operators transitioned to cash basis for revenue recognition and included $2.6 million of one-time revenue, both of which are excluded from adjusted FFO and FAD calculations. At September 30, 20 Agemo facilities were moved to assets held for sale, and so far in Q4, we've sold 19 of the 20 Agemo facilities for $316 million, bringing the total Agemo assets sold to 21 facilities for $359 million In both our first and second quarter earnings releases and conference calls, we discussed Guardian and an operator representing 3.4% of Q1 annualized contractual rent and mortgage interest. Also, as discussed in both our first and second quarter earnings releases and conference calls, an operator representing 2.4% of our first quarter contractual annualized rent and mortgage interest revenue was placed on a cash basis in the second quarter. In the third quarter, the operator continued to underpay rent and paid only $2.5 million, which was recorded for both adjusted FFO and FAD purposes. Finally, last quarter, we discussed an operator, representing 2.2% of our second quarter 2022 annualized contractual rent and mortgage interest that underpaid contractual rent due under its lease agreement by $550,000. On June 30, 2022, we held a $5.4 million letter of credit as collateral from this operator, and in July, we drew the full amount of the letter of credit and applied the $550,000 of proceeds to pay the underpaid portion of June's rent. In the third quarter of 2022, this operator continued to short-pay its contractual rent and the company applied $3.3 million of cash collateral against the unpaid rent for Q3. As the operator is on a cash basis, we recognized the cash received and the cash collateral applied in rent in the third quarter totaling $5.5 million for revenue, adjusted FFO and FAD purposes. During the second quarter of 2022, our operators cumulatively recorded approximately $29 million in federal stimulus funds as compared to approximately $39 million recorded during the first quarter. Subsequently, in the second quarter of 2022, another Omega operator, representing approximately 2.2% of Omega's total rent began making only partial monthly rent payments, thus causing Omega to begin utilizing an existing $5.4 million security deposit to offset shortfalls. To that end, in October of 2022, Omega released three facilities with 455 operating beds to an unrelated third-party for an initial annual rent of $1.6 million, which is materially similar to the previously allocated brand for those same facilities. I think it's â\u0080\u0093 we've had a little bit of conversation around rent deferrals, but it's more around moving assets to new operators, so transitions, and to some extent, incremental sales. So on Page 6 of the sup where you give the operator coverage below one, it looks like there's various small tenants on that page that are new this quarter that are not current on their rent, adds up to 2.2% of the portfolio, which is, I think, above and beyond the ones that you're referencing in the earnings release where you're calling out specific operators. When we think about all those things and we look at our coverages, as Dan mentioned, our biggest operator that's fallen into that bucket, there's a pathway for them to get it in or above that 1x area, and frankly, we'll continue to have discussions about them, are there certain assets that if we were to sell or re-lease to another party to actually improve that credit there's lots of toggles and levers we can pull."
}