{
    "symbol": "OHI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 14:56:03",
    "content": " First, regarding Gulf Coast, in Q4 2021, we recorded $7.4 million of adjusted FFO and FAD based on our ability to offset any unpaid rent against the balance of a sub-debt obligation owed by Omega. As noted in the Q4 earnings release, in January, an operator representing $8.3 million of quarterly revenue or 3.4% of Q1 contractual annualized rent and mortgage interest revenue did not pay as January contractual rent and asked for a short-term forbearance. Lastly, as noted in our April 1, 2022 press release, an additional operator representing $5.9 million or 2.4% of our Q1 contractual annualized rent and mortgage interest revenue did not pay its March contractual amount under its lease agreement. In April, the lease for this operator was amended to allow the operator to apply its $2 million security deposit to its March 2022 contractual rental payment and allow for a short-term rent deferral for the month of April, with regular rental payments required to resume in May. The $249 million revenue for the quarter includes $3.2 million related to the write-off of straight-line receivables associated with six facilities transition to a new operator and also included $1.2 million of one-time revenue, both of which are excluded from AFFO and FAD calculations. Gulf Coast, on March 31, 2022, Omega completed the fee simple sale and transition of 22 Gulf Coast facilities for net proceeds in excess of $300 million and simultaneously released one facility to an existing Omega operator. Our ultimate rent equivalents based upon net proceeds of $300 million and a 9.5% cap rate effectively equal Gulf Coast’s pre-restructured 2021 contractual rents, taking into account the offset which the company is entitled to under the terms of its subordinated notes. The agreement which was made retroactively effective to January 1, 2022, provided for amongst other provisions that, one, Guardian would be allowed to the first certain rents provided those rents would be repaid over time, based upon certain cash flow thresholds, two, Guardian would consent and actively cooperate in the transition of 20 existing facilities, either through sales to third parties or releases, and three, rent would resume post-deferrals beginning on April of 2022. Also, as previously announced, on January 31, 2022, Omega completed an $8 million purchase lease transaction for one care home in the U.K. For both transactions, the newly purchased facilities were added to an existing operators master lease, with initial yields of 9.5% and 8%, respectively. On March 16, 2022, Omega completed a $5 million purchase lease transaction for one care home in the U.K. and on March 23, 2022, Omega closed on $100 million purchase leaseback transaction for 27 care homes in the U.K. Concurrent with these acquisitions, Omega entered into master leases for the care homes with two new U.K. operatorship. Well, the best way I think, I mean, offline call you and walk through the model, but the best thing, I think, is to take that FAD number of that $162 million and then add back the numbers we said today are around $11 million, $11.5 million of additional FAD, because we have a couple of operators that at least that one operator that’s on a cash or a straight-line basis."
}