{
    "symbol": "OHI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 12:54:11",
    "content": " The $245 million of revenue in the quarter included $11.7 million in revenue reductions primarily related to the write-off of straight-line receivables associated with 2 operators, transition to a cash basis for revenue recognition and includes $1.3 million of onetime revenue, both of which are excluded from adjusted FFO and FAD calculations. In the second quarter, we recorded $5.2 million in income related to Guardian, consisting of $3.8 million of contractual rent payments received and $1.4 million in interest payments received. As discussed last quarter, an operator representing 3.4% of Q1 annualized contractual rent and mortgage interest revenue did not pay any of its Q1 contractual rent and asked for a short-term forbearance. During the second quarter, the operator paid its full Q2 rent and interest obligations of $8.8 million. Also, as discussed last quarter, an additional operator representing 2.4% of Q1 contractual annualized rent and mortgage interest revenue did not pay its March contractual amounts due under its lease agreement. In April, the lease with this operator was amended to allow the operator to apply its $2 million security deposit to its March 2022 contractual rent payment and to allow for a short-term rent deferral for April with regular rental payments required to resume in May. Of the $2 million in contractual rent owed for the month of July, only $1.5 million was collected during July, and we will only recognize revenue, adjusted FFO and FAD in the third quarter to the extent cash is received from the operator. Finally, in the press release, we discussed an operator representing 2.2% of our second quarter 2022 annualized contractual rent and mortgage interest that underpaid the contractual rent due under its lease agreement by $550,000. In the second quarter, we recognized $5.5 million of contractual rent related to the operator. During the first quarter of 2022, our operators cumulatively recorded approximately $39 million in federal stimulus funds as compared to approximately $47 million recorded during the fourth quarter. EBITDAR coverage for the stand-alone quarter ended March 31, 2022, for our core portfolio was 0.93x, including federal stimulus; and 0.76x, excluding the $39 million of federal stimulus funds. As of today, Omega had 2 other operators that were unable to make their full contractual rent payments in the second quarter and subsequently in July of 2022. I think last quarter, that number was kind of $11.5 million or so, and we did see FAD of about $10 million this quarter or this past second quarter versus first quarter."
}