{
    "symbol": "MOV",
    "quarter": 1,
    "year": 2022,
    "date": "2021-05-27 12:45:02",
    "content": "  Operator: Good day, everyone, and welcome to the Movado Group, Inc. First Quarter 2022 Earnings Conference Call. As a reminder, today's call is being recorded and may not be reproduced in whole or in part without permission from the company. With me on the call is Efraim Grinberg, Chairman and Chief Executive Officer; and Sallie DeMarsilis, Executive Vice President, Chief Operating Officer and Chief Financial Officer. Before we get started, I would like to remind you of the company's Safe Harbor language, which I'm sure you're all familiar with. The statements contained in this conference call, which are not historical facts may be deemed to constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Actual future results may differ materially from those suggested in such statements due to a number of risks and uncertainties, all of which are described in the company's filings with the SEC, which includes today's press release. If any non-GAAP financial measure is used on this call, a presentation of the most directly comparable GAAP financial measure to this non-GAAP financial measure will be provided as supplemental financial information in our press release. Good morning, and welcome to Movado Group's first quarter conference call. This morning, I will review the highlights of the quarter and our strategic initiatives and then Sallie DeMarsili, will cover our financial results in greater detail. And although we still saw a significant closures during the quarter in Europe and Latin America, we delivered a 93.5% increase in sales to $134.8 million. Our US sales exceeded our plan, driven by strengthened Movado e-commerce and wholesale business, our Coach brand and our Movado company stores, with all three areas exceeding our pre-pandemics sales levels. As a company we continue to focus on our strategy of expanding our digital footprint on our Web site, our customers’ Web site and our marketing initiatives, and driving product innovation while keeping a stringent focus on our expenses. Over the last 18 months, we focused on delivering an increasingly aspirational message to our consumers, driving innovation in our products and drawing new customers to the brand. This strategy is proven to be effective with the success of our new Movado SE introduced last fall and our most recent introduction in our BOLD collection, Verso. During the quarter, we also introduce a collaboration with the world renowned photographer, Alexi Lubomirski, a limited edition highlighting Alexi's doorways to veganism, featuring our first vegan straps that received an excellent reception from consumers. During the first half of this year, we're supporting the Movado brand with cable television advertising, as well as social and digital marketing efforts. For today's call, I will review our financial results for the first quarter of fiscal 2022 and then I will provide an update on our outlook for the year. Please refer to the description of all of the special items included in our results for the first quarter of fiscal 2022 and fiscal 2021 in our press release issued earlier today, which also includes a table for GAAP and non-GAAP measures. For the first quarter of fiscal 2022, sales were $134.8 million as compared to $69.7 million last year, an increase of 93.5%. Strong consumer response to our brands and offerings, coupled with the beginning of the easings of restrictions that brick-and-mortar retail in certain geographies led to net sales increases across our segments of owned brands, licensed brands and company stores, as well as across certain geographies, most notably the United States. Total net sales decreased 8% as compared to the pre-pandemic first quarter of fiscal 2020 with 10.8% increase in the United States, offset by 20.8% decrease in international net sales. One, I think, pretty much from the second quarter of last year, we began to see increased demand for watches as a category overall within the US wholesale channel, especially the department store channel, and we're now starting to see a resurgence in the chain jewelry channel as well. And that combined with I think the innovation and product that we've delivered across our brands and also you have a US consumer that is now pretty flushed in terms of their resources for discretionary spending, and I think all of those factors have contributed. We're optimistic that with the things that we're doing within our brands, we're going to continue to create the innovation and excitement for consumers to keep purchasing our products. And that's why I've called out our Movado SE, which is an iconic watch that the company redesigned and reintroduced last year. We're introducing a new Movado SE that starts at about $1,500 and goes up to $2,000 that we're very excited about. So on the inventory level, we are going to be monitoring our purchases, but we do have, obviously, a nice top line sales number that we're forecasting. So we will be adjusting our purchases in line with those sales numbers, but obviously, purchasing as tightly as possible for the demand. And as Efraim said, we're seeing high demand for our product. And so as far as -- what we're seeing is cost coming in, we are managing that as well with our supply chain, not seeing any major increases in what it's costing us to get our product or deliver it to where it needs to be. And so while there is demand for labor, we think we're in a pretty good position in terms of that but there's definitely some inflationary pressures in the marketplace. Well, I think across our brands, we have different initiatives on the ESG front, and from Tommy Hilfiger, where we put an emphasis on accessibility and product for people who have issues with being able to popular watch or put on a regular strap or bracelet. In other areas, like movement we’re involved in the environment and in the ocean, because that's very close to to their home in California. And they'll be introducing actually a watch of recycled ocean plastics in the next month or two, and we participate also with 1% for the planet. And then in Movado, we were really excited by the reception we got to our pathways to veganism collection and in vegan straps in our most current introduction with Alexi on our Web site. I think you'll see some balancing out of the growth of the e-commerce channel -- and especially, people are really welcoming the opportunity now as the weather gets better, masking requirements and -- vaccinations become more prevalent. I think you're still going to see e-commerce as a growing area in the business and from our perspective, because people have become much more comfortable shopping that way as well."
}