{
    "symbol": "MOV",
    "quarter": 2,
    "year": 2022,
    "date": "2021-08-26 13:16:05",
    "content": " With 28.5% growth versus the second quarter two years ago, our U.S. business continued to gain momentum led by the very strong performance of our Movado brand, both on digital platforms and improving brick-and-mortar stores, and our Movado company stores. During the quarter, we saw sales grow in our outlet division by 168% versus last year and 38 -- 31.8% versus pre-pandemic fiscal 2020, while improving operating margin. For the second quarter of fiscal 2022, sales were $173.9 million, as compared to $88.5 million last year, an increase of 96.4%. Compared to the pre-pandemic second quarter of fiscal 2020, operating expenses declined by $2.1 million, primarily due to the corporate initiatives and restructuring program, which was executed to reduce such expenses and this was -- but this was partially offset by performance based compensation. Net income in the second quarter was $20.1 million or $0.85 per diluted share, as compared to a net loss of $1.7 million or $0.07 per diluted share in the year ago period. Net income was $30.2 million or $1.27 per diluted share, as compared to a net loss of $14.7 million or a loss of $0.63 per diluted share in the year ago period, a net income of $13.9 million or $0.60 per diluted share for the first six months of fiscal 2020. Inventory at the end of the quarter was up $9.9 million or 5.7% above the same period of last year, while sales nearly doubled. The company is increasing its annual outlook and currently expects fiscal 2022 net sales to be in a range of approximately $680 million to $695 million, gross profit of approximately 55.5% to 56% of net sales, operating profit in a range of 13% to 13.5% of net sales and diluted earnings per share of approximately $2.75 to $2.90. So Europe for us was ahead in the -- versus two years ago in the second quarter, despite the fact that most of the markets had a lot of retail closures during the period, and again, really strong digital and e-commerce sales in Europe."
}