{
    "symbol": "MOV",
    "quarter": 3,
    "year": 2022,
    "date": "2021-11-23 13:00:04",
    "content": " Revenues for the third quarter were $217.7 million, an increase of 28% versus $169.9 million last year. Adjusted operating income for the quarter was 19.4% of sales, also a record, partially driven by adjusted gross margin expansion of 320 basis points to 57.7% from 54.5% last year. We continue to focus on remaining disciplined with operating expenses, which were 38.3% of sales, an improvement of 140 basis points against the same period last year, while increasing marketing expenses by $8.1 million over last year. Our licensed brand portfolio continues to drive strong results with almost a 28% increase over last year, powered by recovery in Latin America, the Middle East, and India, and continues strong growth in Europe and the U.S. On the licensed brand side, each of our biggest brands performed extremely well with strong growth in Tommy Hilfiger, Hugo Boss, Coach, and Lacoste. For the third quarter of fiscal 2022, sales were $217.7 million as compared to $169.9 million last year, an increase of 28.2%. U.S. net sales increased 41.7% and international net sales increased 17 -- I'm sorry, 19.7% as compared to the third quarter of last year. Net sales -- total net sales increased 5.9% as compared to the pre -pandemic third quarter of fiscal 2020, with an 8.3% increase in the U.S. and a 4.1% increase in international net sales. Cash at the end of the third quarter was $201.8 million, an increase of almost $40 million over last year, while paying down $37.3 million of debt and repurchasing $17 million of common stock during the same period. Inventory at the end of the quarter was down $6.1 million or 3.5% below the same period of last year, while sales increased over 60 %. We currently expect fiscal 2022 net sales in a range of approximately $715 million to $720 million, gross profit of approximately 56.5% to 57% of net sales, operating profit in the range of 15% to 15.5% of net sales, and diluted earnings per share of approximately $3.35 to $3.45."
}