{
    "symbol": "LAKE",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-09 22:25:04",
    "content": " But this is not the case in Q3, third quarter fiscal year '22, COVID 19 sales were in estimated $6 million or 20% of revenue, compared to our second quarter fiscal year '22 COVID sales of $3.5 million or 13% of revenue. Our third quarter saw a wave of COVID outbreaks in Southeast Asia that resulted in greater pandemic driven sales than we had in the previous second quarter, which was the height of the Delta variant outbreak in the U.S. As a result, we now anticipate that COVID 19 outbreaks in developing regions of the world are likely to generate greater pandemic related sales due to lower vaccination rates, less access to therapeutics and lower quantities of PPE stocking or stockpiling. As we had anticipated COVID sales diminishing to less than 10% of sales in the third quarter and even less in subsequent quarters based on increased vaccination rates, development of therapeutics and medicines to treat COVID 19 team, we believe that future economic shutdowns will be limited and are likely to only flatten industrial recovery, not reverse it. On a consolidated basis for the third quarter of fiscal 2022, domestic sales were $10.6 million or 35% of total revenues and international sales were $19.4 million or 65% of total revenues. For the sequential comparison, our third quarter, domestic sales of $10.6 million in international sales of $19.4 million improved from the second quarter of this fiscal year, when we had domestic sales of $10.1 million and international sales of $17.3 million. Gross margin of $12.6 million for fiscal 2022 third quarter match that of the second quarter, even though we have been dealing with significant shipping challenges and supply chain limitations where our materials are derived largely from North America. Gross profit as a percentage of net sales was 42.1% for the fiscal 2022 third quarter, down from 46.3% for the fiscal 2022 second quarter and 52.3% for the third quarter of fiscal 2021. Operating margins were 13.6% for the three months ended October 31, 2021, compared with 14.3% for the three months ended July 31, 2021 and 30.1% for the third quarter of the prior fiscal year. For the first nine months of fiscal 2022, when COVID demand has significantly declined, we maintained operating margins of 15 points, 6% versus 28.3% last year, the first nine months of fiscal 2022 operating margin of 15.6% is vastly improved from the pre pandemic levels of 5.5% for all of fiscal 2020; 3.6% in fiscal 2019 and 8.8% in fiscal 2018. Amid our flexing of production and fiscal 2021 to record levels, Lakeland remained a relatively asset lie business capital expenditures for fiscal 2022 are targeted at approximately $1 million with $100,000 spent in the third quarter and more than $500,000 spent in the first nine months of the year."
}