{
    "symbol": "JNCE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 09:45:05",
    "content": " Speaking on today's call will be our CEO and President, Dr. Richard Murray, who will review our pipeline progress and key milestones, followed by our COO, Hugh Cole, who will provide an update on business development activities; our CMO, Dr. Beth Trehu will provide an update on our clinical activities; our CSO, Dr. Dmitri Wiederschain will then discuss our discovery programs; lastly, our CFO, Kim Drapkin, will review our third quarter financial results. We are announcing today that we have met the criteria to expand an additional cohort in second and third line PD-1-inhibitor resistant head and neck cancer, in addition to our previously announced tumor types of PD-1 inhibitor naive ovarian and PD-1 inhibitor resistant renal cancer. The remaining two combo cohorts still in stage 1 in first line PD-1 inhibitor naive head and neck cancer and PD-1 inhibitor resistant cutaneous squamous cell carcinoma, along with the ovarian monotherapy cohort, still have the potential to meet criteria to advance from stage one to stage two. Furthermore, we started enrollment in October in stage one of a new combo cohort in PD-1 inhibitor resistant biliary tract cancers or BTC based on a clinically meaningful and durable confirmed response in a PD-1 inhibitor resistant patient in Phase 1 in combination with pimi. Consistent with data from Merck's MK-4830 data published in January 2022, we have seen patients with stable disease with tumor reductions less than 30% at week nine become responders at week 18, which means potential confirmation then has to wait until at least 27 weeks. In addition to confirmed responses, we have seen patients with partial responses at nine weeks develop progressive disease at 18 weeks due to new lesions and have observed one pathologically confirmed case of pseudo progression in PD-1 inhibitor resistant non-small cell lung cancer. We would first emphasize that the timing of data from any of the INNATE cohorts, whether the initial eight cohorts or subsequent additional cohorts, such as those we have described today, will depend on when enrollment begins in stage one and then stage two and will require the data to be sufficiently mature for full interpretation."
}