{
    "symbol": "PXLW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 18:48:05",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to Pixelworks, Inc. Second Quarter 2022 Earnings Conference Call. Following management's prepared remarks, instructions will be given for the question-and-answer session. Good afternoon, and thank you for joining us on today's call. Before we begin, I would like to remind you that various remarks we make on this call, including those about our projected future financial results, economic and market trends, and our competitive position constitute forward-looking statements. Please refer to todayâ\u0080\u0099s press release, the companyâ\u0080\u0099s annual report on Form 10-K for the year ended December 31, 2021, and subsequent SEC filings for a description of factors that could cause forward-looking statements to differ materially from actual results. Additionally, the companyâ\u0080\u0099s press release and management statements during this conference call will include discussions of certain measures and financial information in GAAP and non-GAAP terms, including gross margin, operating expense, net loss, and net loss per share. We caution investors to consider these measures in addition to, and not as a substitute for, nor superior to the company's consolidated financial results as presented in accordance with GAAP. Also note throughout the company's press release and management statements during this conference call, we refer to net loss attributable to Pixelworks, Inc. as simply net loss. For additional details and reconciliations of GAAP to non-GAAP net loss and GAAP net loss to adjusted EBITDA, please refer to the company's press release issued earlier today. With that, it's now my pleasure to turn the call over to Todd for his opening remarks. As reported in today's press release, we had a very solid quarter. Second quarter revenue increased sequentially and grew 36% year-over-year, marking another consecutive quarter of strong double-digit top-line growth. Looking at the first half of the year, total revenue grew more than 50% year-over-year and we realized a nearly 30% improvement in our adjusted bottom line results, compared to the first half of 2021. I also wanted to highlight that we achieved these results with most of our employees at our Pixelworks, Shanghai subsidiary, as well as multiple key customers being impacted by the COVID-related lockdowns for a significant portion of the second quarter. As previously mentioned, we had a record quarter in our mobile business with revenue increasing 33% sequentially and 68% year-over-year. A key factor underpinning our continued growth has been mobile gaming, which has increasingly become a cornerstone for smartphone OEMs both in terms of how they spec phone performance and their associated marketing strategies. As outlined on previous calls, we have embraced this market trend and continue to extend the differentiated value proposition that Pixelworks' visual processing solutions enable for low power, high frame rate mobile gaming. The strategic focus and our traction to date is observable in the marketing campaigns of our mobile OEM customers and their newly launched smartphones, which are increasingly positioned around the advanced visual quality, low power performance, and features for gaming that Pixelworks technology enables. First in May, vivo launched its S15 Pro smartphone, incorporating our X5 visual processor built on MediaTek's latest   8100 flagship light 5G mobile platform. The S15 Pro features a 6.56 inches full HD plus P-OLED curve screen with 2K resolution, and supports refresh rates of up to 120 hertz, a 100% DCI-P3 wide color gamut and peak brightness of 1500 nits. Unique to the smartphone in addition to high frame rate gaming, Pixelworks worked closely with the design team at vivo to incorporate a series of newly customizable game display filters that enable optimal visual performance on several of the most popular mobile games in China. In July, our long-time mobile customer, ASUS, launched the ROG Phone 6 series smartphone. Built on the latest Qualcomm Snapdragon 8+ Gen 1 mobile platform, the ROG Phone 6 Series smartphone features a 6.78-inch AMOLED screen with resolution of 2448x1080 pixels and supports refresh rates of up to 165 hertz. In addition to setting a new benchmark with its ultra-high refresh rate, the smartphone model sold in China is being offered in collaboration with Tencent Games, a division of Tencent. As discussed last quarter, earlier this year, Pixelworks became a unity verified solutions partner or VSP, making our high frame rate rendering accelerator SDK available to leading mobile game developers and studios through Unity's gaming engine platform. In June, we took the next step with the announcement of Pixelworks' first direct engagement with a major gaming studio, Nuverse, a ByteDance Company, who we collaborated with to integrate our rendering accelerator SDK into one of the more popular mobile games in China, One Piece Fighting Path,. In recent months, we've expanded our pipeline of committed and prospective engagements with a growing number of gaming studios to integrate our SDK into additional games scheduled for release later this year and early 2023. Building upon our ecosystem partnerships with both Unity and ByteDance, in July, OPPO's affiliate brand realme unveiled the GT2 Explorer Master, becoming the first smartphone launched with our latest generation X7 visual processor. Also based on Qualcomm's newest Snapdragon 8+ Gen 1 mobile platform, the phone has a 6.7-inch flexible AMOLED panel with 2K resolution and supports a refresh rate of up to 120 hertz. In addition to benefiting from the full suite of features offered in our new X7 processor, including our ultra-low latency MotionEngine, low power super resolution technology, and our proven AI-based adaptive display functions, Pixelworksâ\u0080\u0099 Rendering Accelerator SDK was specifically designed to leverage the unique advanced capabilities built into our X7 chip. When utilized together for playing games, such as One Piece Fighting Path, on the realme GT2 Explorer Master smartphone, it allows frame rate output to be increased by up to 4x the native rendering frame rate, while maintaining much lower power consumption. Due in-part to the impact of COVID-related China lockdowns out of OEM's overall design and decision processes, as well as some shifts in the OEM schedules for new product introductions, these near-term engagements are now likely to materialize in the fourth quarter and into early 2023. Despite the current macroeconomic uncertainty, and well documented decline in consumer end demand for smartphones, especially mid-range smartphones in China, we are continuing to see strong interest in our X7 visual processor for mobile OEMs. Highlighting this point, the X7 is our first visual processor being evaluated by all four Tier 1 mobile OEMs in China at introduction. For those who are new to what TrueCut is about, TrueCut Motion is a technology platform developed in-house over multiple years, specifically designed to solve the inherent and broadly acknowledged challenges associated with motion resulting from how and where content is created and viewed. As the industryâ\u0080\u0099s first and only end-to-end platform solution for motion grading, TrueCut also ensures the content creators original intended motion look and feel is consistently delivered regardless of the screen on which it's viewed. As discussed on previous conference calls, commercializing the full potential of TrueCut motion platform requires acceptance and buy-in from ecosystem partners across three primary domains: content creation, content distribution, and device manufacturers. The consistent feedback we received from other interested device and streaming ecosystem partners, going back more than a year, was that the content creators needed to get behind the technology first. Following a longstanding and formal engagement, in July, we announced a multi-title license agreement with James Cameron's Lightstorm Entertainment. As part of this latest ecosystem milestone, Pixelworks TrueCut Motion platform is being used to remaster both Avatar and Titanic in cinematic high frame rate 4K HDR for theatrical release. Notably, these respective titles rank as having the Number 1 and Number 3 highest grossing global box office sales of all-time, which together with James Cameron's public endorsement, we expect to significantly elevate the awareness and interest for TrueCut Motion platform. This increased brightness when combined with HDR and larger screen sizes further accentuates motion issues such as strobing, judder and deblur, all of which the TrueCut Motion platform solves without the viewer having to adjust any settings on their TV. Therefore, the value proposition absolutely extends beyond the theater and into every living room, which we believe is one of the primary opportunities to monetize our TrueCut Motion platform technology. Revenue increased 20% sequentially and 12% year-over-year, reflecting the highest quarterly revenue in more than two years. The post-pandemic recovery in the end market demand has continued to exceed our customers' ability to source supply of various projector components, including timing controllers and panels. Due to the longer lead times for the other components, order patterns for our projector SOCs have remained very healthy as projector OEMs work to backfill end demand, as well as build certain levels of buffer inventory of all critical components. While we've largely been successful at securing the requisite supply each quarter to meet customer demand for our projector SOCs, available capacity has continued to be extremely tight. To summarize, we delivered another quarter of strong top line growth, although a large portion of our team and customers were subject to lockdowns for multiple months. We've also continued to execute on our strategic initiatives, including the cultivation of expanded synergistic ecosystems that further support our anticipated long-term growth of both the mobile business and the TrueCut Motion platform. More broadly related to the second half of the year, there's obviously increased uncertainty with respect to the macroeconomic environment and consumer end demand. With that, I'll hand the call to Haley to review the financials and provide our guidance for the third quarter. Revenue for the second quarter of 2022 was $19.1 million, up 15% from $16.6 million in the first quarter of 2022, and represented an increase of 36% from $14.1 million in the second quarter of 2021. The breakdown of revenue in the second quarter was as follows: revenue from mobile increased sequentially and year-over-year to approximately 7.5 million, which represented nearly 40% of total revenue in the second quarter of 2022. Revenue from digital projector was approximately $9.5 million, increasing 20% sequentially and up 12% year-over-year, reflecting the sustained recovery of both end market demand and order patterns from projector customers. Non-GAAP gross profit margin was 49.3% in the second quarter of 2022, compared to 53.2% in the first quarter of 2022, and compared to 52.7% in the second quarter of 2021. As anticipated, gross margin in the second quarter reflected the results of expected product mix. Non-GAAP operating expenses were $12.9 million in the second quarter, compared to $11.6 million last quarter and $10.1 million in the second quarter of 2021. On a non-GAAP basis, second quarter 2022 net loss was $3.3 million or a loss of $0.06 per share, compared to a net loss of $3.5 million or a loss of $0.06 per share in the prior quarter and a net loss of $2.6 million or a loss of $0.05 per share in the second quarter of 2021. Adjusted EBITDA for the second quarter of 2022 was a negative $2.4 million, compared to a negative $2.2 million in the first quarter of 2022 and a negative $1.8 million in the second quarter of 2021. At the midpoint of this range, total revenue would represent growth of 15% year-over-year. Lastly, we expect third quarter non-GAAP EPS to be in a range of between a loss of $0.09 per share and a loss of $0.05 per share. Your line is now open. Just on the guidance for September indicating  , understandable in terms of what's going on in the macro and the Chinese handset market, but I'm curious on how you're thinking about the, kind of individual segments as we go into the third quarter. So, yeah, I mean, so what we're seeing is, we don't â\u0080\u0093 and I've been listening to many of the semiconductor calls that are targeting the mobile consumer space. And there is clearly a lot of inventory out in the market right now, both at the OEMs in finished goods or with, at the channel, probably the biggest issue is channel inventory and then of course at the semiconductor manufacturers themselves. So, I think that's probably â\u0080\u0093 there's still a lot of churn. There's also things that could happen on the downside, but I would say that for us, it's going to take a quarter, quarter plus before we start seeing burn through that, I see other vendors that are going to take 6 months to 9 months to burn through their channel and own inventory. And, you know, the features and functionality of the X7 are desirable, let's say. I will say that a wave of X7 press releases, which is really where the market will find out what phone were designed in with who because we usually don't announce it until it's out in the market. You might see  tail-end of the Q4, but predominantly it's going to get pushed out to Q1 2023. Your line is now open. I'm going to complete the question here on the guidance, clearly mobile is coming down, want to get your take on projector not only for the third quarter, which I think typically is maybe flattish in a normal environment, which clearly this isnâ\u0080\u0099t, but also get your thoughts on the fourth quarter. I would say, if you go back pre-pandemic, what you usually saw was fiscal Q1 was our â\u0080\u0093 which is our calendar, was our lowest quarter and Q3 was our highest quarter. Sounds like based on the last answers here, we're expecting to see fourth quarter not a great mobile environment either while OEMs, kind of figure out their forward plans and start to take up X7 here. And in the China market, there's usually two large waves of designs. So, let's just say, very end of December, you'll see it launch a start and it'll run till early February, right, which was traditionally towards  . We had expected with â\u0080\u0093 when we launched X7, it was tight to get into a large portion of 2022 second half of the year designs. We expect it to see a good number of models, but we knew some of the design activity would push it out to the wave that is December to February wave of 2023. What you're seeing with the downturn is some of the models that could have been used for X7 that may have been on a short leash with the excess X5 Plus inventory in the market, some of those models have switched over to X5 Plus. So, we're not losing sockets, we're just â\u0080\u0093 itâ\u0080\u0099s taking a little more time for X7 to get into the market, but the design activity is still pretty strong, okay. But, you know, I'm confident that the market we are targeting, which is, let's say,   and up all the way to flagship phones that are targeting that demographic. Obviously, it's been a few weeks here since you had that great announcement last month here of Lightstorm Entertainment adopting the technology. In fact, the team's meeting with some potential ecosystem partner right now in the other room as we speak. But there's a difference when you're in discussion with somebody and you're educating them, you know, this is something new. By having somebody like Cameron and Lightstorm Entertainment come out and endorse it enthusiastically like he has and like the group has, the attention, you know, the level of people are standing up at attention and saying, okay, this is something I need to strongly consider. And so, I think it's changed the dynamic of the conversation we were having with people already. Your line is now open. Such as total China phones shipped, most people were planning six months ago between 300 million and 330 million phones shipped into China or shipped to Chinese consumers is maybe how we should put it. Now within that, it looks like the premium segment's holding up a little bit better than the mid-range segment. This is happening at the same time that all the suppliers into the industry, had, we're trying to fulfill an order backlog from exuberant customers six months ago. you're going to have to â\u0080\u0093 the problem is, there's a boatload of supply, not by us, but by other people in the market. And so, there's some shift in what, kind of models they do and what components they put in those models. I think prior to that cyclical downturn, there was a trend for the large Tier 1s, we're all trying to start to adopt a sub brand like IQ brand in vivo's case or a model, like the realme gaming series models coming out of Xiaomi. All of the large phone manufacturers were starting to adopt, you know, I wouldn't call it a gaming phone. I think that trend is continuing, but it's continuing in the midst of this broader cyclical downturn and a group of people trying to digest a lot of AP inventory, display inventory, CMOS sensor inventory. And so there's a lot of very helpful background, Todd. So, our goal is to be very reasonable with our tools, services, and support to the content creators like Lightstorm and others, but we do charge for our technology and our support and services to help them create content that is TrueCut Motion certified. So, there's some revenue there. So, if that content that has now been created and shown in theaters and the distributors that want to stream that same content to your homes, to devices that in the secondary market, the tertiary market, they would have to license the streaming rights from us if they want to use that high frame rate version of the content. So, there's revenue from device royalties from TrueCut mobile certified devices. We're very focused on, I would say, the streaming portion of the ecosystem right now. And so as that all happens, we expect that the licensing revenue that would come in addition to the service and support revenue would start to make a meaningful impact on our aggregate financials. I think we do have a series of financial conferences coming up, so there'll be more opportunity for any investors that if you're attending those conferences, we can chat more than."
}