{
    "symbol": "MEI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-23 14:25:05",
    "content": " Our sales for the quarter were $289 million, upping our sales by $7 million with successful spot buy in premium freight cost recovery efforts. Even excluding $22 million in cost recovery and a favorable impact on foreign exchange, we have over 4% year-over-year sales growth. Fourth quarter net sales were $288.7 million in fiscal â\u0080\u009922, compared to $301 million in fiscal 21, a decrease of $12.3 million or 4.1%. Fiscal â\u0080\u009822 sales include a $7 million of spot buy in premium freight cost recovery, partially offset by an unfavorable foreign currency impact of sales of $5.7 million. Excluding the spot by premium freight cost recovery and foreign currency impact, sales decreased by $13.6 million or 4.5%. While year-over-year sales in Asia were higher in fiscal â\u0080\u009822 as compared to fiscal â\u0080\u009921, the lockdown in China due to the zero COVID policy impacted our fourth quarter results, especially to our expectations to our March guidance issuance. Income from operations decreased to $14.6 million from $33.7 million, mainly due to higher costs due to material cost inflation, spot buys, an increase unreimbursed freight which accelerated during the quarter and our ability to fully recover the increased costs from our customers was hampered from a timing perspective. For the full year, income from operations was $111.7 million, a decrease of $16.2 million or 12.7% from the $127.9 million of income from operations in fiscal â\u0080\u009821. Fiscal â\u0080\u009822 diluted earnings per share was $2.70, compared to $3.19 in fiscal â\u0080\u009821, mainly due from the impact from higher costs due to material cost inflation premium freight spot buys, higher selling and administrative expenses and a higher effective tax rate of 13.8% as compared to only 9.3% in fiscal â\u0080\u009821, which benefited from a significant amount of foreign investment tax credits. Net debt, a non-GAAP financial measure, increased by $31.6 million to $38.5 million in fiscal â\u0080\u009822, from $6.9 million at the end of fiscal â\u0080\u009821, mainly due to the share repurchases of 64.5 million and unfavorable working capital changes, especially related to inventory which increased significantly due to the supply chains related challenges. For the full fiscal â\u0080\u009922, we generated net cash provided by operating activities of nearly $99 million as compared to $180 million in fiscal â\u0080\u009921, lower net income of $20 million and a nearly $77 million unfavorable swing and changes in working capital accounted for most of the difference. The anticipated growth at the midpoint of our range considers the impact of the GM T1 program rolled off, which had sales in fiscal year â\u0080\u009822 of over $100 million."
}