{
    "symbol": "MEI",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-02 14:29:02",
    "content": " Second quarter net sales were $295.5 million in fiscal year '22 compared to $300.8 million in fiscal year '21, a decrease of $5.3 million or 1.8%. Sequentially, sales increased by $7.7 million or 2.7% from the first quarter of fiscal year '22. The decrease in second quarter sales was mainly due to lower automotive sales, especially in North America as compared to the same period in fiscal '21, which benefited from the rebound from the depths of the impact of COVID-19 pandemic experienced in our first quarter of fiscal year '21. The sales decrease was partially offset by higher sales of electric hybrid vehicle products, which amounted to 16% of sales in the second quarter of fiscal '22, which was in line with our previous communication that electric and hybrid vehicles sales would comprise a mid-teens percentage of our fiscal year '22 consolidated sales. Second quarter gross margins were lower in fiscal year '22 as compared to fiscal year '21, mainly due to higher material and logistics costs, including freight and supply chain shortages and unfavorable product mix. The negative impact of supply chain disruption and higher logistics costs, including freight on the second quarter fiscal year '22 gross margin was approximately 250 basis points. The minor fiscal year '22 second quarter percentage increase was attributable to higher stock based compensation, partially offset by lower professional fees and restructuring costs. The second quarter fiscal year '22 selling and administrative expenses percentage is in line with our historical norm, which should yield an efficient flow through from gross margin to operating income. In addition to the gross margin and selling and administrative items mentioned above, one other nonoperational item significantly impacted net income in the second quarter of fiscal year '22 as compared to the comparable quarter last fiscal year. Shifting to EBITDA, a non-GAAP financial measure, fiscal year '22 second quarter EBITDA was $47.4 million versus $60.2 million in the same period last fiscal year. In the second quarter of fiscal year '22, we reduced gross debt by $12.3 million, and we ended the second quarter with $177.2 million in cash. During the first six months of fiscal year '22, net debt, a non-GAAP financial measure, increased by $39 million, mainly due to the share repurchases of $42.4 million and unfavorable working capital changes, especially related to inventory, which increased by nearly $26 million due to the supply chain-related challenges. Regarding capital allocation on March 31st, we announced the $100 million share repurchase program, which we executed nearly $35 million of purchases during the second quarter of fiscal year '22. For the fiscal year '22 second quarter, free cash flow was $21.6 million compared to $36.7 million in the second quarter of fiscal year '21. In the second quarter of fiscal year '22, we invested approximately $5.4 million in CapEx as compared to $3.6 million in the second quarter of fiscal year '21."
}