{
    "symbol": "MEI",
    "quarter": 1,
    "year": 2022,
    "date": "2021-09-02 13:54:06",
    "content": " First quarter sales were 287.8 million in fiscal year '22 compared to 190.9 million in fiscal year '21, an increase of 96.9 million or 50.8%. The increase was mainly due to lower sales in the prior year quarter from the impact of the COVID-19 pandemic and to higher sales of electric and hybrid electric vehicles, which amounted to 16% of sales in the first quarter of fiscal year '22, which was in line with our previous communication that electric vehicles and hybrid electric vehicle sales would comprise mid teens of our fiscal year '22 consolidated sales. First quarter gross margins were higher in fiscal year '22 as compared to fiscal year '21, mainly due to increased sales, partially offset by higher material costs, higher logistic costs, including freight and supply chain shortages. That negative impact of the supply disruption and higher logistics costs, including freight, on the first quarter of fiscal year '22 gross margin was nearly 300 basis points. The fiscal year '22 first quarter percentage decrease was attributable to increase sales related to the negative impact of COVID-19 pandemic on fiscal '21 sales, partially offset by higher stock-based and performance-based compensation expenses. The first quarter of fiscal year '22 selling and administrative expenses percentage was in line with our historical norm, which should yield an efficient flow through from gross margin to operating income. In addition to the gross margin and selling and administrative items mentioned above, two other non-operational items significantly impacted net income in the first quarter of fiscal year '22 as compared to the comparable quarter last fiscal year. First, income tax expense in the first quarter of fiscal year '22 was 5.7 million or 16.4% as compared to a net tax benefit of 5.1 million in the first quarter of fiscal year '21. The effective tax rate was lower in the first quarter of fiscal year '21 due to discrete tax benefits of 7.8 million in the quarter, or $0.20 per diluted share. Shifting to EBITDA, a non-GAAP financial measure, fiscal year '22 first quarter EBITDA was 48.5 million versus 29.3 million in the same period last fiscal year. For fiscal year '22 first quarter, free cash flow was a negative 6.2 million as compared to a positive 4.8 million in the first quarter of fiscal year '21. While we experienced negative free cash flow in the first quarter of fiscal year '22, we expect improvement the remainder of the fiscal year. In the first quarter of fiscal year '22, we invested approximately 15.9 million in CapEx as compared to 11.6 million in the first quarter of fiscal year '21. The higher first quarter CapEx is in line with our expectation that CapEx in fiscal year '22 would be higher than the investment in the prior year, estimated to be in the range of 53 million to 57 million. In the first quarter of fiscal year '22, we reduced gross debt by 4.7 million. First, on March 31, we announced a $100 million share repurchase program, which we execute as 7.6 million of repurchases during the first quarter of fiscal year '22."
}