{
    "symbol": "MEI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-03 17:40:06",
    "content": " Third quarter net sales were $291.6 million in fiscal year '22 as compared to $295.3 million in fiscal year '21, a decrease of $3.7 million or 1.3%. The year-over-year comparison includes $8.6 million of premium freight cost recovery, partially offset by an unfavorable currency exchange impact on sales of $2 million. This sales decrease was partially offset by higher sales of electric and hybrid vehicle products, which amounted to 19% of sales in the quarter, which is higher than our previous communication that electric and hybrid electric vehicles sales would comprise a mid teens percentage of our fiscal year '22 consolidated sales. Third quarter gross margins were lower in fiscal '22 as compared to fiscal year '21, due to lower sales volume, unfavorable product mix, higher restructuring costs, partially offset by premium freight cost recovery. In addition to the gross margin and SGA - selling and administrative items previously mentioned, one other non-operational items significantly impacted net income in the third quarter of fiscal year '22. As mentioned, other net income was up by $2 million, mainly due to success in securing higher amounts of international government assistance between the comparable quarters and lower foreign exchange losses from re-measurements. In the third quarter of fiscal year '22, we reduced gross debt by $7.5 million and ended the quarter with $153.1 million in cash. During the first nine months of fiscal year '22, net debt, a non-GAAP financial measure increased by $55.6 million, mainly due to the share purchases of $63.9 million and unfavorable working capital changes, especially related to inventory which increased by nearly $45 million due to the supply chain related challenges. Regarding capital allocation, on March 31 2021, we announced a $100 million share repurchase program, which we have executed $21.3 million purchases during the third quarter of fiscal year '22. For the fiscal year '22 third quarter free cash flow was $11.8 million, as compared to $82.2 million in the third quarter of fiscal year '21. In addition, CapEx was $8.3 million in the current quarter as compared to $4.9 million in the third quarter of fiscal year '21. The revenue range for full fiscal year '22 is now between $1.16 billion and $1.17 billion, up from a range of $1.14 billion to $1.16 billion, largely due to the previously mentioned premium phrase corporate cost recoveries, which amounted to $8.6 million in the third quarter. So frankly so, you hit to the fact of 4Q guidance and some of the puts and takes are the recovery, the cadence and the amount of recovery in European auto as compared to the $60 million decrease we had in the third quarter, that’s from a product standpoint, and having a bit of you know, recovery in some of our sensor products and things of that nature."
}