{
    "symbol": "XXII",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 16:49:05",
    "content": " We’re absolutely thrilled that VLN is on the shelves at our Circle K pilot locations in Chicago, giving smokers for the first time ever an FDA authorized tobacco cigarette with 95% less nicotine designed specifically to help them smoke less. We believe that VLN Menthol King would be the only menthol cigarette left on the market under this rule and a cornerstone of the FDA’s policy, providing menthol smokers, a critical off-ramp as the rule takes effects. Building from our Chicago pilot in 150 Circle K stores, we’ll then roll out to their 7,000 stores nationwide, as well as other regional and national channel partners and even additional international markets beyond South Korea, where we made our first shipment in Q1. Circle K is an ideal partner for this given their 7,000 plus stores across the country, as well as thousands of stores outside the U.S. They’re poised to work with us here and abroad to help us make VLN widely available to adult smokers. Turning to Slide 8, our manufacturing facility is a key strategic asset where we have built the capabilities needed to produce high quality, reduced nicotine content cigarettes, including the tens of millions of research cigarettes used in the independent clinical studies that underlay our FDA mandated helps you smoke less claim and FDA’s larger plans to ban menthol and require all cigarettes to be non-addictive. With this year’s VLN crop, we will literally be harvesting the results of the work done in the past few years by our stellar science team and our world-class plant research partners to create our non-GMO VLN tobacco varieties and much of the IP that makes up our deep moat in this area, which will enable us to bring to market a non-GMO American blend version of VLN made with bright and burly varieties of tobacco. Elsewhere, we are advancing discussions with prospective partners in several other markets outside the U.S. where like South Korea regulations allow us to go to market today with claims with little or none of the regulatory complexity of the U.S. With the first and only MRTP designation for a combustible cigarette from FDA, the enormous body of scientific evidence supporting that positions VLN very well for international expansion. It’s an exciting time for us as we go-to-market in the U.S. with Circle K as our pilot partner, which will ultimately lead to the several major national C store and pharmacy chains placing our VLN products in front of customers. And that’s one of the reasons, why FDA looks favorably upon reduced nicotine cigarettes in VLN as well because this is something that, helps them not only to smoke less, but potentially helps them to wean themselves from combustible cigarettes."
}