{
    "symbol": "THRY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 22:44:19",
    "content": " With me on today's call are Joe Walsh, Chairman and Chief Executive Officer; and Paul Rouse, Chief Financial Officer. Before we begin, I'd like to remind you that shortly before today's call, we issued a press release announcing our third quarter 2022 financial results. Also, on today's call, our speakers will reference certain non-GAAP financial measures, which we believe will provide useful information for investors. With that introduction, I would like to turn the call over to Joe Walsh. As a result, we're raising our full year guidance once again. SaaS revenue of $56.6 million was up 26% year-over-year and 8% sequentially, ahead of our guidance. For the second quarter in a row, we kept a balance between subscriber growth and ARPU growth, with both in double digits. This growth has been bolstered by the digital transformation trends that we feel continuing to accelerate in the market, this golden age of SMB SaaS. We feel like this is the decade that SMBs are migrating into the cloud, and they're looking for a complete platform like Thryv offers. On our Q2 call, we guided for Q3 EBITDA loss around $5 million, and we delivered much better with a loss of $2.2 million. EBITDA losses are purely against our international markets, which we're in the process of standing up, which will lead to future SaaS growth. Keep in mind, we're generating a lot of cash flow on the Marketing Services side of the house, which is where we get the majority of our SaaS customers from. We have 400,000 existing customers in our base that we're calling on and working with in the normal course. And that's where we get the vast majority of our customers, either directly from there or by referrals from there, delivering that super sales efficiency. Regarding international, we just announced the opening of our regional HQ in Toronto, the hiring of a sales team as well as key partnerships with GetintheLoop and the Canadian Franchise Association. On the Marketing Services, we continue to see very predictable performance in billings, which allows us to generate solid cash flow and pay down debt. One other little item I want to mention is that we were named one of the most loved workplaces, which we're really proud of. Overall, I'm super proud of how we're positioned for the balance of the year. With that, let me turn it over to Paul Rouse to take you through our financial results. As a reminder, we're going to focus on total SaaS and total Marketing Services results, which include both domestic and international operations. As you may recall, this is how we provided guidance to the start of the year, and we feel is more helpful in modeling the business. Let's start with our third quarter results, starting with our SaaS business. Third quarter total SaaS revenue was $56.6 million, ahead of our guidance range, which represents an increase of 26% year-over-year and 8% quarter-over-quarter. As Joe mentioned, the growth in revenue was attributed to a balance between subscriber growth and ARPU expansion, with an increase of 13% and 11% year-over-year, respectively. Annualized spend per client was approximately $4,500 for the third quarter. Seasoned net dollar retention was 92% for the third quarter, which is slightly improved when compared to the prior quarter. As a reminder, seasoned net dollar retention represents clients that have been with us for over one year. Third quarter total Marketing Services adjusted EBITDA was $67.6 million, resulting in an adjusted EBITDA margin of 30%. As indicated in our quarterly outlook for Marketing Services provided at the start of the year, we expected less revenue for print due to the timing of our directories. Third quarter Marketing Services billings, excluding Vivial, was $198.1 million, a decline of 20% year-over-year. Third quarter consolidated adjusted EBITDA was $65 million, representing an adjusted EBITDA margin of 23%. Finally, our net debt position was $505 million in the third quarter. Our leverage ratio for the third quarter, in accordance with our credit facility, is 1.6x net debt to EBITDA and well below our covenant of 3x. From a year-to-date perspective, we generated $84.9 million in free cash flow and paid $81.5 million towards our term loan. For the full year 2022, we raised our guidance for total SaaS revenue in the range of $214 million to $215 million. We are updating our SaaS EBITDA loss outlook in the range of $14.5 million to $15.5 million, which is improved from our previous guidance of $16 million to $19 million. This implies SaaS EBITDA loss in the range of $3.4 million to $4.4 million for the fourth quarter and is designated for international investments, including our most recent launch in Canada. For the full year 2022, we are raising our guide for total Marketing Services revenue in the range of $965 million to $975 million and raising our adjusted EBITDA in the range of $338 million to $341 million, representing an EBITDA margin of 35%. Before I wrap up, I want once again to take a minute to talk to you about revenue recognition for Marketing Services and give you a peek into 2023. Our Marketing Services financial results are reported under accounting rule ASC 606, which has a material impact on both the timing and method of revenue recognition, specifically for our print directories. Print revenue is heavily impacted by the timing of shipments, and our publication schedule is nonlinear between quarters and fiscal years. As a result, this nonlinearity will have an impact on the timing of when we recognize print revenue as is common in the print industry. For example, a 15-month directory will have all revenue recognized in the first month of publication. For this reason, we provide billings as an operational metric, which shows the very consistent and steady performance of our Marketing Services business as we expect and have discussed with you. Billings and actual cash collections follows monthly invoicing and collection of cash receipts, unlike revenue recognition. This also gives us high confidence in our ability to manage the business, generate cash and pay down debt. For the full year, we anticipate paying $105 million to $110 million towards our term loan. Looking back on our Investor Day in April, we announced we would be lengthening the directory life in our Marketing Services business from 15 months to 18 months. Advantages of lengthening the directory life are that it helps us improve our unit economics and saves costs, enhances our forward cash flow visibility and frees up time for our business advisers to sell SaaS to existing customers. At this time, we expect this to be reflected in the third quarter of 2023, where the timing of publications will make the print revenue considerably less, relative to other quarters, both here in the U.S. and internationally. It's just an artifact of accounting, unfortunately. Our small business customers have been with us, on average, something like 15 years, and they view their listings in our Internet Yellow Pages directories and in our print directories as an important utility in running their business. They don't really think of it as advertising, like they're going to run an add. And remember, this is a gigantic, gigantic melting iceberg, that we're running for cash and very focused on the cash-generative characteristics of it, and it generates a lot of cash. It's a, just like it is here in the U.S., a payment tool that's particularly built for service-based businesses; allows them to recapture convenience fees and other costs that they have in doing business, which they like a lot; allows them to get paid right away for them to have sort of next-day funds. It's sort of 100% year-over-year growth off of a small base, but it's becoming meaningful. Staff can chat, share files, annotate photos, reference-link to any item within Thryv for fast coordination and collaboration in real-time. They don't necessarily get to see the entire Thryv with all the payment details and all the CRM stuff, but they can share details about the customer. It allows really great communication, sort of almost a Slack-like experience within Thryv, and gives the small business owner the flexibility that they were looking for and that they need. So this is a big deal, and this is going to increase engagement at a much, much higher level across particularly our service-based businesses, but really all of them. Anybody that's got people out in the market out in the field, that communication about the jobs, about their customers, is something that we've been asked a lot for by our power users. So with that, why don't we turn to the operator for questions. But I take it, your market is a little bit unique, with being in SMBs and service-based businesses, there are likely some differences versus what we see elsewhere. For us, things haven't changed that much in the last two months. We're dealing with -- these are pretty small businesses, typically, 5, 10 employee, very small businesses. They do read all the headlines, and they are told they're supposed to be scared and concerned and all that. We haven't -- I've seen some of the earnings calls in the last few days, people talking about elongated sales cycles and taking longer to get decisions from the C-suite. And the media campaign to get them scared about the economy is in full effect, but it really hasn't changed our results. And Arjun, it's largely down to us. And in the ordinary course, we have 400,000 customers that we communicate with on a regular basis about updating their listings and their programs across the Internet, across our Internet Yellow Pages and across our print directories. And you might say, \"Well, gee, those are 2 different things.\" There is a massive transition happening, where small businesses are beginning to move to the cloud. And the tailwind of that is way, way bigger than the little crosswinds of economic concerns that are bouncing around above them in the big corporate world. We're continuing with double-digit subscriber growth, double-digit revenue growth. No, that's great to hear. And then, just I wanted to touch on the new HQ that you opened in Toronto. Well, I mean, we have some revenue beginning to develop there now. We're adding the feet on the street through partnerships, and we're doing it by beginning to build a direct sales force. But we're going to go build that out, and we expect strong growth off of obviously a very tiny base. This is just us going in, getting going. And the model that you're seeing us execute there, I think, you'll see us doing in additional countries as time unfolds here. Joe, I have one for you, and then, Paul, a follow-up for you as well. So maybe I'll follow up a little bit on Arjun's question, Joe. You had smaller customers, sort of golden age here for SMB digital transformation. Keep in mind, in Marketing Services, these guys are not running ads. And a lot of it just auto-renews, and we barely even talk to them. So this is not some big advertising decision, and it's not being made by an ad agency. So -- and yes, we have been, Paul and I and some of the other members of the team, have been through a number of recessions over the years and have seen the way this thing rolls. As you can imagine, a 33-year-old that's opening up a new business doesn't say, \"Let's go sell -- let's go buy an add in the yellow pages.\" I think the thing that you highlighted in your question, as I turn to think about the SaaS business, is the efficiency, the sales efficiency that we have. A lot of our peer companies, and I talk to a lot of other SaaS CEOs, they complain about how much they're spending with Google and other online sources to try to generate inquiries and leads. And I feel so blessed that, every day, we're talking to thousands and thousands of small businesses, just in the ordinary course. About another 1/3 are referrals from those guys that are really happy with the changes that they've been able to implement, and they're bringing their buddy who's disorganized and needs some help in to talk to us. And then the final 1/3 comes from all the various sort of new channels, motions that we are creating from inbound and content generation, to our multi-location franchise sales, to resellers and so on. And I know one of the things that, at least, I'm hearing a lot about, reading a lot about as I look at some companies that were just spending whatever it took to drive growth numbers, we were never really comfortable with that, to be honest with you. Paul, just on that point, with the improved ROI on some of your marketing spend, it sounds like you have found some leverage you can continue to pull there to drive better profitability and more efficiency, which you guys are showing, which is great. So -- and as the business grows on the SaaS side, we have more revenue. As you saw, for this two straight quarters in the U.S., we're already profitable. First of all, Joe, you talked about Marketing Center to be released in, , it looks like by end of the year. You're in beta right now, at least it looks like it because I was able to find some things on your web page about it. And so we've got 51,000 Thryv customers. So it's got to be in place, set up, running, before you can then add Marketing Center to it. In terms of how we're selling it to them, all the have a business adviser of record. And then we have some tech touch, where we can put out -- which we haven't done yet, but we can put out some marketing to let people know that this is available. If they run an ad in a PennySaver, in a local school paper or something like, they want to be able to track that, that worked. And Marketing Center lets them do that, lets them track absolutely everything that they do and put everything into one dashboard and pull it all together. And that's worth its weight in gold, is a well-organized, well-run small business, which most of these existing Thryv customers really are starting to get good at kind of having their act together. I recognize you're not adding for next year, obviously, but you gave a little bit of color on what's happening with the accounting around the Marketing Services business next year. Anytime I think about some revenue changes there, I always like to think about the impact on expenses and/or profitability in the period. I assume, from the linearity of the year, we should expect some profitability metrics to decline in the third quarter of next year. And I purely recognize it's just because of the accounting treatment of those revenues, but just trying to think about how to potentially titrate our models going into next year. That's the reason I'm pointing now, particularly in the third quarter of next year, there's going to be very little print. So with very little print, there's very little profitability. So that's why, each quarter, we keep on bringing this up to remind everyone. Joe, just starting off, nice to see a double-digit subscriber growth again in the SaaS segment. I know it's typically been 1/3, 1/3, 1/3 in the past. I mean, look, it's probably -- we're talking about a very subtle shift, where the 1/3 that's coming from all the new channels, it's probably a little less than 1/3 at the moment as we decided to move more towards profitability. As you know, we guided for a loss at the beginning of the year. I forget the exact number, but in the mid-20s or something like that. One of the ways we can easily do that is leaning more on the sales that we get from the zoo, which our cost of acquisition is super, super low. And when we're out in those new channels, our costs look a little bit more like all the other guys out there. The concept of the 1/3, 1/3, 1/3, I wouldn't change yet, but maybe that 1/3 is 29%, maybe it's slightly off. And having said that, our new Chief Marketing Officer that joined us about 5 months ago, Tami Cannizzaro, is a whiz and is going to work on making all those channels better and more efficient. And so I'm excited about what that will mean a year from now, with the work that she's doing. We've massively invested in product and engineering and have had just release after release after release of what might seem to you like subtle product improvements, but they're big pain points for small businesses. But the TeamChat thing is like a really cool Slack feature right within Thryv, that allows people to live and communicate within Thryv and really is going to increase engagement tremendously; the Google Messages, where we've got a real-time 2-way sync going with Google. I mean somebody might send them a message on Facebook Messenger and then the next day, they might text them. We -- this last period of time, one of the things we're getting a lot of feedback from the small businesses, they had all these apps around invoices. They wanted to be able to do more itemized things in their statements, and they wanted to be able to make all kinds of different changes and refinements. And so we cut a team loose on that and just met with our power users and have just radically upgraded and improved invoice estimates, that piece of it. And so, no, we're not seeing any fall off at all in renewal rates or churn climbing. We're already shooting pretty close to par for small businesses, but we're trying. Maybe just quickly, the -- most of the questions have been answered at this point. But on the Marketing Services accounting, Paul, just to clarify, this is a situation where reported revenue and EBITDA is maybe artificially low in Q3 and full year '23, but the expectation would be that it would bounce back in '24. Yes, it is, that the normal decline rate is a shrinking business, will be normalized in '24. There was a loss on revenue, about $2.2 million, and maybe a $300,000 impact on EBITDA for Australia. And then, lastly, the question on retention, just following up there. I don't want to promise you that it will move in a perfectly straight line from here to 100%, but the direction will be up from here to 100%. But the data sometimes will have anomalies in it, where it could move back the wrong direction by or something like that. But all of the things that we're doing in our product road map, all the things that we're seeing with customer retention and our client experience team is doing, leads us to believe that our overall retention rate is steady, if not rising. And then we've got -- with the new centers, we've got new things to sell to these customers. As people start buying Marketing Center, that's a pretty significant adder to your net revenue retention line as that starts coming through. So it's -- up until now, we've had some small things to sell, like additional seats or some additional -- we could give them HIPAA compliance or whatever. But now, we've got full additional centers to sell. So we're really, I mean, really coming into the period when actually upselling is going to be a bigger thing than just selling. As you can see by our debt repayment this quarter, we're focused -- just, well, we have always been focused. So we're focused like a laser beam, paying down debt all the time, unless where you got some outstanding opportunity, an acquisition that comes our way. So -- and given the interest rate environment, it's in our best interest and our shareholders that we pay all the debt down we can. Dan, just as I think about your last question, we managed to make a massive paydown in our debt last year and acquired Vivial along the way. One is that it's so cash-generative, like we have our own kind of built-in DC, that it's generating so much cash. And I think, in an environment where people are concerned with sales efficiency, have a look here, take a look at what we're doing. And as they wake up and realize they need to modernize, we are there, and we're leading them over the line into SaaS land. That market is now -- I believe, in the month of October, the -- we have the U.S. broken up into regions, where in Australia, it's just one region. I think that one region in Australia beat all the regions in the U.S., just for the month of October. So I mean, they're really starting to hit their stride, really starting to get this thing figured out. Marie Caron is just the Energizer Bunny, running around, building these things, looking at opportunities. But if one comes, we're prepared to work a little harder and execute. And ladies and gentlemen, this concludes today's conference call."
}