{
    "symbol": "THRY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 20:29:11",
    "content": " We outlined a goal of getting to $1 billion in SaaS revenue in 2027, $4 billion in 2032, and we still are really confident that that’s a very realistic type goal, and we laid out the measurements by which you can kind of keep an eye on our progress, the levers we're going to use to get there and the signposts along the way. Your line is open. Your line is open. Your line is open. Joe, in terms of ARPU growth in the SaaS business, I know you've outlined that we're supposed to have a more balanced approach between new customer growth and ARPU growth this year, but can you talk about some of the opportunities to continue to grow that ARPU number and as a lot of that really dependent upon rolling out these new centers that you outlined at Investor Day. In the local marketplace the Thryv customer is at a tremendous advantage to a small business that's unclouded, I mean, they're going to be found easier online, they're going to be really easy to do business with, and they're just going to do better, they're going to compete for more carpet cleaning jobs, or whatever they do. Your line is open. But we're seeing strong momentum there and I would expect in the coming year or two that's going to be an important contributor and we're hoping honestly it may even actually help us find some news, SaaS subscribers for the software too. Your line is open. Dan, one of the weird things is that when you're trying to work the franchise market, and you can't go to the franchise shows because there aren't any, where they're all virtual, it's just really tough to get traction. And we're deadly serious about guiding small businesses into the cloud and helping them take full advantage of the devices, they already own, the phone in their pocket, the tablet that they're carrying around, to be able to run their business to have the freedom to move around, anywhere they want keep track of what's going on in their business."
}