{
    "symbol": "ITW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 14:39:02",
    "content": " While we did see some softening in channel inventory reduction actions in our businesses serving the construction, auto aftermarket, commercial welding and appliance markets, five of our seven segments delivered double-digit organic growth, led by automotive OEM, up 25% and food equipment, up 23%. With regard to margins, we were glad to see our incremental margins in Q3 return to our normal 30% plus level for the first time in five quarters as the impact of volume growth, enterprise initiatives, pricing actions and some moderation in the pace of input cost inflation drove incremental margin of 39% and a 130 basis point improvement in operating margin in our base businesses. On the bottom line, strong growth and margin performance resulted in GAAP EPS of $2.35, up 16% versus Q3 of last year and that 16% growth includes $0.13 of negative impact from currency. The conversion rate of 84% is lower than our typical Q3 performance as we remain committed in the near term to intentional working capital investments to support double-digit organic growth, mitigate supply chain risk and sustain service levels to our key customers. Looking on Slide 8 for an update on the year and starting with the top line, we are raising our full year organic growth guidance to 11% to 12% due to the strength of our Q3 organic growth performance and projecting current levels of demand, which remains strong across most of our businesses. We are projecting operating margin of approximately 24% for the full year, which includes approximately 100 basis points contribution from enterprise initiatives, about 200 basis points contribution from volume leverage and estimated 100 basis points of negative margin impact from price/cost and about 50 basis points of margin dilution from the acquisition of MTS. We expect free cash flow conversion of approximately 80%, which, as we have talked about, is below our typical 100% plus conversion rate due to the intentional near-term working capital investments that support the companyâ\u0080\u0099s double-digit revenue growth, mitigate supply chain risk and sustained customer service levels. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I think if you take our full year guidance and the fourth quarter kind of implied, as we said, organic growth of about 10%, solid incrementals in our normal range, maybe a little bit higher than that. We are just wanting to be a little conservative, hopefully, and account for some of the softness we are seeing in about 20% of the company, but also incorporate a lot of strength in the businesses that we talked about, including Auto, Food Equipment, Test & Measurement, Welding. Your line is open."
}