{
    "symbol": "ITW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 13:23:04",
    "content": " The ITW team delivered another quarter of strong operational execution and financial performance with organic growth of 10.4%, operating margin of 23.1%, after-tax return on invested capital of 27.8% and GAAP EPS of $2.37. As a result of our advantaged operational execution and delivery performance, we are being rewarded with meaningful additional share by our customers as evidenced by our 10.5% organic growth in the first half of this year. Based on our first half results and projecting current demand and supply rates through the balance of the year, we are maintaining our guidance for full year 2022, with organic growth of 8.5% at the midpoint, margins in the range of 24% to 25% and GAAP EPS of $9.20 at the midpoint, which would be an all-time record for the company. Let's turn to Slide 5 for Food Equipment, which led the way this quarter with an organic growth rate of 25%, record quarterly revenues of $614 million and operating margin of 24.7%. Test & Measurement and Electronics revenue grew 15%, with organic growth of 1%, which, as you know, is uncharacteristically low for this segment and entirely due to the timing of a large equipment order from an Electronics customer in Q2 last year. I think you also have to factor in -- if you just run rate -- if you just take our current revenues and project those into Q3 and Q4 because the comps are easing on a year-over-year basis, we'll be putting up some meaningful organic growth rates with all the operating leverage and the incrementals that are returning to something a lot closer to our historical incrementals in the back half of the year. And so those are kind of the big drivers here, less price/cost margin headwind and significant organic growth year-over-year with more normal incremental margins in that 35%, maybe plus range for the back half of the year. I think your sort of 90% odd conversion guide for the year on free cash, that implies, I think, sort of 50% growth in the free cash year-on-year in the second half."
}