{
    "symbol": "ITW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 14:30:04",
    "content": " Starting with the top line organic growth, was 12% as all segments delivered positive organic growth, and five of our seven segments grew double digits, led by Auto OEM, up 20%, Food Equipment, up 17%, Welding, up 15%, Polymers & Fluids, up 11% and Test & Measurement and Electronics, up 10%. Operating margin expanded 210 basis points to 24.8%, with 110 basis point contribution from enterprise initiatives and favorable price/cost margin impact of 70 basis points, which was for the first time in nine quarters -- which was favorable for the first time in nine quarters. GAAP earnings per share increased 53% to a record $2.95, including $0.61 of gains from divestitures and $0.12 of negative currency -- excluding $0.61, sorry, of divestiture gains and $0.12 of negative currency EPS growth was 27%. For all of 2022, the company delivered organic growth of 12% for the second year in a row, best-in-class operating margin of 24.4% in our base business, after-tax return on invested capital of 29.1% and record GAAP EPS of $9.77, an increase of 15% versus the prior year. As a result, our organic growth projection for 2023 of 3% to 5% and our EPS guidance of $9.60 at the midpoint reflect current levels of demand and a risk adjustment for further slowing in certain end markets. As you can see from the data on the left side of the slide, ITW's 12% organic growth rate for each of the last two years compares favorably to our proxy peers at about 9% both years, suggesting that while we're not there yet in terms of realizing ITW's full potential organic growth performance, we're making some very solid progress. Looking forward, we expect Specialty organic revenue of negative 1% to plus 1% in 2023, which is based on current levels of demand and anticipated further slowing in the appliance components business. For 2023, we expect GAAP EPS in the range of $9.40 to $9.80, which also includes $0.15 to $0.20 of higher interest expense on our short-term debt and $0.25 of increased income tax expense as our tax rate will revert to our normal, approximately 24% versus 22% in 2022, excluding the tax impacts from our divestitures. And you can see that we're expecting solid to mid -- solid mid- to high single-digit organic growth in four of our seven segments, offsetting some lower growth rates in Test & Measurement and Electronics, which is due to semiconductor demand, as well as in Construction and Specialty resulting in an overall organic growth rate at the enterprise level of 3% to 5%, which is on top of 12% organic growth in each of the last two years. Your line is open. Your line is open. Your line is open. And maybe just to give an additional data point, if you run the same data on Q1 contribution to EPS overall, it's somewhere around 23% of the full year, and that's a pretty -- the company has become remarkably predictable over the years. Your line is open. But I think, ultimately, look, I think if you model ITW long term, I'd go back to the TSR model we've given you, which is 4% plus organic growth, incremental margins in that 35% to 40% range. Your line is open. So if we just ended 2022 at operating margins of about 24%, you should expect volume leverage somewhere in the 50 to 100 basis points of positive contribution to margins year-over-year, the enterprise initiatives, which is sized at about 100. Your line is open. And so if you add up the organic growth rate here, over 17% coming out of the pandemic 23% last year, this year, high single digit, double digit, and that's really as a result of us innovating and growing all product categories. Your line is open. Your line is open. I think if you run the math, you'll see kind of the first half is the growth rates are maybe towards the higher end of that 3% to 5% and the second half is towards the lower end, and that's all driven by the comps on a year-over-year basis."
}