{
    "symbol": "LPRO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-26 10:39:06",
    "content": " Telham data shows total loan originations were about $160 billion in the fourth quarter of 2022, down 21% from a year earlier and down 19% sequentially from the third quarter of 2022. While still early, we have seen significant progress from these investments for the full year 2022, our non-OEM business, primarily credit unions, was up 16%, driven by strong refinance volumes earlier in the year, while in contrast the large universal banks reported auto loan originations down 25% to 30% year-on-year. Total revenue for the fourth quarter of 2022 was $26.8 million, which includes an ASC 606 negative change in estimate of $12.8 million associated with our profit share, compared to $51.6 million in the fourth quarter of 2021. When excluding the impacts of ASC 606 change in estimate from both periods, revenue during the fourth quarter of 2022 was only down $5.5 million or 12% year-over-year. To break down total revenues in the fourth quarter of 2022, profit share revenue represented $6.1 million, program fees were $18.3 million and claims administration fees and other were $2.4 million. To further discuss the $6.1 million in profit share revenue in Q4, the profit share associated with new originations in the fourth quarter of 2022 was $18.9 million or $546 per certified loan, as compared to $24.7 million or $580 per certified loan in the fourth quarter of 2021. In comparison, during the fourth quarter of 2021, revenue included a positive $6.5 million change in estimated future revenues on certified loans originated in historical periods. Gross profit was $21.9 million and gross margin was approximately 82% in the fourth quarter of 2022, as compared to $46.9 million and gross margin of approximately 91% in the fourth quarter of 2021. Net loss for the fourth quarter of 2022 was $4.2 million, which was driven by the $12.8 million negative adjustment to our profit share contract asset, compared to net income of $27.8 million in the fourth quarter of 2021. Please proceed with your question. Please proceed with your question. Please proceed with your question. But I will tell you that from a cash perspective, obviously, the cash flow statement, we generated about $90 million in cash in 2022 and we have got a healthy cash balance at year end at $200 million, and obviously, we started the share buyback program and invested there. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}