{
    "symbol": "LPRO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 12:00:04",
    "content": " During the third quarter of 2022, we certified 42,186 loans, total revenue was $50.7 million, gross profit was $45.5 million and adjusted EBITDA was $29.4 million. To break down total revenues in the third quarter of 2022, profit share revenue represented $26.5 million, program fees were $21.8 million and claims administration fees and other were approximately $2.3 million. Now to further break down the $26.5 million in profit share revenue in Q3, profit share associated with new originations in the third quarter of 2022 was $24.9 million or $589 per certified loan, as compared to $27.9 million or $566 per certified loan in the third quarter of 2021. Also included in profit share revenue in Q3 of â\u0080\u009822 was $1.7 million in positive change in estimate of future revenues from certified loans originated in previous periods, primarily as a result of positive realized portfolio performance due to lower severity of losses. Gross profit was $45.5 million and gross margin was approximately 90% in the third quarter of 2022, as compared to $52.5 million and gross margin approximately 90% in the third quarter of 2021. Based on year-to-date 2022 results and trends into the fourth quarter, we are tightening our previous guidance range for total certified loans to be between 160,000 and 170,000, total revenue to be between $180 million and $190 million, adjusted EBITDA to be between $112 million and $122 million, and adjusted operating cash flow to be between $130 million and $145 million. In our guidance, we continue to take the following factors into consideration, continued disruption in transportation networks and raw material shortages, including global semiconductor chip shortages, dealer inventory that remains below historic levels, the rate of contraction for an index of the largest public auto lender financial institutions, some of which originated 30% to 40% less volume on a year-over-year comparison in the third quarter of 2022, the Affordability Index of our target credit score due to continued inflated used car values, and finally, inflation and rising interest rates and overall consumer sentiment, specifically for the overall auto industry, the Affordability is now at 42.6 weeks, the highest levels in a decade. And you can see it in our Q3 results, we -- on new originations, we booked $589 for certified loan, over the last year, it was $566 and you may recall in our underwriting changes and some of the things we did earlier this year, we had in addition to the higher premium on the loan amounts, as well as the extended term vehicle valuation discount, which also is an increase to the premium. I mean you think back last year, I think, 2021 Iâ\u0080\u0099d like $30 million almost $31 million and positive changes and that was primarily driven by obviously the liquidity in the consumerâ\u0080\u0099s hands and lower defaults claims and severity. John, one of the -- in the quarter, we had $589 in average profit share for the new originations and our program fees were $518, which program fees were actually, if you look at it year-over-year, we are up about 18% and the profit share was up about 4%, a lot of that, obviously, the higher loan amount will increase the program fee, as well as mix of business sold. So, I think, longer term that profit share, itâ\u0080\u0099s hard to take an exact number there, but in that $550 million range and then the program fees longer term, call it, $475 million to $500 million, I think, is -- but it does depend on mix. But as if you think about the $1.7 million that we booked net in Q3, obviously, was lower than in any other quarters, in the past probably four, five or six, obviously that has slowed down as we continue to put stress on the portfolio as it relates to severity, the Manheim coming down gradually, severity of loss going up, defaults normalizing, et cetera."
}