{
    "symbol": "LPRO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 08:19:04",
    "content": " I would like to point out that if you exclude the ASC 606 change in estimated revenues associated with profit share from each quarter, Q2 of 2022 revenue is flat year-over-year on a lower number of certified loans as a result of our focus on higher average unity economics and quality of credit in our portfolio. Also included in profit share revenue in Q2 of 2022 was $2.8 million change in estimated future revenues from certified loans originated in previous periods, primarily as a result of positive realized portfolio performance due to lower claims and lower severity of losses, which was partially offset by higher prepaids and increasing severity of losses expected in future periods. Based on the first half of 2022 results and trends into the third quarter, we are revising our guidance ranges for full year 2022 as follows: total certified loans to be between $155,000 and $180,000; total revenue to be between $175 million and $205 million; adjusted EBITDA to be between $110 million and $135 million and adjusted operating cash flow to be between $115 million and $145 million. In our guidance, we took the following factors into consideration: we adjusted program underwriting with a focus on optimizing the health and quality of our portfolio from a credit perspective; continued disruption in transportation networks and raw material shortages, the global semiconductor chip shortages; low levels of dealer inventory and dealer sentiment; the investments we are making in the business; continued strength of our refinance program and the value proposition it offers consumers; the rate of growth for an index of public auto lender financial institutions, which peaked in the second quarter of 2021 at 21% and contracted to negative 2% in the second quarter of 2022; the affordability index of our target credit score due to continue inflated used car values and finally inflation and rising interest rates and overall consumer sentiment, which perhaps has had the most significant waiting on our guidance considerations. You may now proceed. I was going to say, what we believe and we have been forecasting is that if you track used car values and how we see them declining slowly, but we see them not being into this â\u0080\u0093 we think weâ\u0080\u0099re pretty conservative on our forecast and realistic as well that itâ\u0080\u0099s going to be in late 2023, early 2024 before theyâ\u0080\u0099re down to a level that will result in the change, in the affordability making our loans a lot more attractive. And as things normalize, we feel, historically, itâ\u0080\u0099s been a â\u0080\u0093 if you look past three years before the pandemic, the 30% revenue CAGR business, and we feel like we can get back to significant growth rates as things normalize. You may now proceed. You may now proceed. You may now proceed. You may now proceed. You may now proceed. You may now proceed. You may now proceed. You may now proceed."
}