{
    "symbol": "AZTA",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-10 16:02:06",
    "content": " Looking at the business by segment, we saw a strong performance in our products business, which grew 15%, reflecting another quarter of double-digit year-over-year growth in our automated stores business as well as some promising stability in our C&I business, which contained no COVID revenue and was up slightly quarter-over-quarter. The revenue increase of $41 million quarter-to-quarter carried higher gross margins, up 150 basis points to 45.4% primarily driven by the services segment and the addition of B Medical. Operating expense increased $23 million quarter-over-quarter with $13 million of the increase coming from B Medical, $7 million coming from the annual reset of stock compensation and variable compensation accruals and the remainder due to various corporate and commercial expenses, which translates into approximately 7% adjusted EBITDA margin. Sample Repository Solutions organic growth, excluding COVID, of 10% year-over-year was once again driven by our storage revenue, which grew 18% and continues to expand our recurring revenue base. Services business delivered 47.6% gross margin, a 170 basis point expansion quarter-over-quarter, driven by next-generation sequencing with a year-over-year drop of 360 basis points still reflecting inflationary pressures as well as lower volumes in Gene Synthesis. Revenue is expected to be in the range of $156 million to $171 million, with a midpoint supporting growth of approximately 13% year-over-year. We expect products revenue, including acquisitions, to be in the range of $72 million to $79 million as we expect the base business to increase a couple of million quarter-to-quarter and B Medical to show a decline quarter-over-quarter as it comes off of its December quarter, which tends to be the busiest of the year for vaccine cold-chain orders. I think you're still kind of targeting the same 30% revenue growth, but it seems like maybe margin expectations have been pushed out a little bit and you're talking about taking some costs out of the business."
}