{
    "symbol": "BEST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-17 23:36:07",
    "content": " Hello, everyone, and thank you for joining BEST's second quarter earnings call today. I'm pleased that in Q2, BEST SCM has achieved the profitability, while BEST Freight has significantly narrowed its losses. As we refocus on our core business, we are continuing the process of winding down BEST capital and we incurred additional costs as expenses related to this winding down during the quarter. BEST Freight continue to maintain its leadership position in service quality, its on-time deliver rate has improved by 11.4% quarter-over-quarter in Q2. We continue to develop BEST Freight's e-commerce, business and e-commerce volume had reached 20.4% of the total freight volume of 1.2 percentage points year-over-year. As the logistic industry was severely impacted by the pandemic during Q2, our total free volume was done by 8.8% year-over-year. In Q2, Freight net loss has narrowed substantially by RMB115.7 million compared with the first quarter of 2022 as we further reduce costs and improve operating efficiency. Going forward, we will continue to improve our service quality and network capability as well as continue our efforts in synergizing with BEST SCM and BEST Global for new business opportunities. Due to the pandemic and it's rigid to controls, many of our warehouses were restricted during the second quarter, particularly in Shanghai, which is our main hub for BEST supply chain services. The total number of orders fulfilled by Could OFCs decreased 22% year-over-year to RMB94 million in the second quarter, while the total number of orders fulfilled by franchise Could OFCs decreased by 19.4% to RMB58.9 million. However, Supply Chain Management service gross margin improved by 3.9 percentage points to 8.2% compared with Q1 2022. Going forward, we will continue to deepening our presence in apparel and fast-moving consumer goods, auto parts, and the pharmaceuticals industry, as well maximize the synergizing BEST Fright and Global as we provide a Global and the transportation services for our existing key accounts. Global's parcel volume was 30.8 million in the second quarter, a decrease of 20.6% over year -- year-over-year. Going forward, along with serving its major e-commerce key accounts customers, BEST Global will focus on expanding FME coverage within Southeast Asia by reinforcing our network stability and service quality, as well as improving our franchisees operational capabilities. We will accelerate our B2B2C and cross-border businesses in PRC, Southeast Asia, and the U.S. by synergizing with BEST Supply Chain Management and Freight. We're synergist among Global, SCM, and Freight, as well as our cross-border initiatives, we are confident that BEST Global will return to its growth trajectory by the end of this year. In summary, we believe information technology-driven and integrated supply chain and the logistics solutions will be in high demand to support the growth of E-commerce and cross-border businesses. As the pandemic eases, we are confident that our BEST's strengths in technology, domestic and Global Supply Chain Management and logistics capabilities will allow us to rebound strongly and on the past of possibilities. Our second quarter revenue reflected the industry-wide headwinds with revenue declining by 12.5% year-over-year, excluding UCargo and Capital. Our net loss from continuing operations excluding the one-off expenses associated with the capital winddown and the ADS ratio change has narrowed by 27.1% to RMB235.1 million compared with Q1 2022, benefiting from all consistent efforts to streamline our cost and expense structure. UCargo's Q2 2022 revenue was approximately RMB215,000 compared to RMB860 million in Q2 of last year. Due to the higher oil prices and additional costs resulting from the pandemic, our gross loss for Q2 was RMB93.8 million compared to a gross profit of RMB86.2 million for the second quarter of 2021. Excluding the one-off expenses associated with the capital winddown and the ADS ratio change that took place in May, we achieved a net loss reduction of RMB87.5 million or 27.1% compared with Q1 2022. For BEST Freight, second quarter revenue was approximately RMB1.2 billion compared with RMB2.3 billion for the same period of last year. Excluding UCargo, Freight's revenue decreased by 13.6% year-over-year, primarily due to 8.8% decrease in Freight volumes and a 5% decrease in ASP. Freight's gross margin was negative 7.8%, 10 percentage points lower year-over-year, due to the higher oil prices and additional costs associated with the pandemic. Compared with Q1 2022, the net loss of Fright was narrowed about RMB115.7 million resulted from a continuous efforts in excess controls and operating efficiency improvement. Q2 revenue for BEST Supply Chain Management decreased by 6% year-over-year to RMB451 million, primarily due to the disruption caused by the pandemic. However, Q2 gross margin has increased by 3.9 percentage points to 8.2% compared with the prior quarter as we continue to focus on high margin accounts, and the used digitized information system to improve our efficiency. For BEST Global, Q2 revenue decreased by 23.3% year-over-year to RMB241.2 million. Excluding such one-off expenses, our operating expenses would have been RMB253.7 million, which was a 3.2% year-over-year. Selling, general, and administrative expenses for continuing operations, excluding capital winddown and ADS ratio change expenses were RMB212.8 million in the second quarter, which was an approximately 2% decrease year-over-year, reflecting the effectiveness of our cost control measures. To close, we are encouraged by the improved financial results for BEST Freight and Supply Chain Management. As we drive quality and value for our customers by consistently enhancing our capability in Freight, Integrated Supply Chain Management, and the Global Logistics solutions, we are confident that we are on the right path to deliver future sustainable growth and profitability. So, as the economic growth to the third and fourth tier cities and as well as multi-channel marketing and consumption channels, more and more the transportation will be towards the less than truckload -- the Freight business."
}