{
    "symbol": "ELDN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 21:33:07",
    "content": " We look forward to the continued enrollments of this study through the remainder of the year and based on the timing of our first patient enrolled, we aim to provide initial three and six months open label data across available transplant participants in the first quarter of 2023. Additionally, we announced the FDA has cleared Eledonâ\u0080\u0099s investigational new drug application for IND application for a larger controlled phase 2a of tegoprubart for the prevention of organ rejection in patients receiving a kidney transplant, thereby allowing us to expand our development efforts for this important indication into the United States. Our goal is to provide meaningful insights into tegoprubartâ\u0080\u0099s clinical activity after 24 weeks of therapy in this indication, and we thus anticipate reporting initial six months open labeled data from this study in the first quarter of 2023. Additionally, a chronic utilization of CNIs to prevent graft rejection has been associated with significant nephrotoxicity which can impair graft function and even shorten graft survival in the same organ with CNIs are being taken to protect by improving the safety and tolerability of first line immunosuppression tegoprubart has the potential to both improve patient quality of life and reduce overall morbidity in the near term, as well as ultimately improve graft survival rates in the long term. This 52 week open label study was based in Canada, the United Kingdom and Australia is enrolling up to 12 patients undergoing renal transplant with primary endpoints of safety and pharmacokinetics as well as exploratory endpoints including biopsy proven acute rejection, change in EGFR, and biomarkers of inflammation and kidney rejection. With the opening of our first US site, we are looking to enroll the first patients in the space to islet cell transplantation trial, and aim to provide available three month data in the first quarter of 2023. Through the remainder of the year, we will be focused on enrollments across our three ongoing trials, as well as preparing for the launch of our larger phase 2 kidney transplantation study."
}