{
    "symbol": "ELDN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 20:35:05",
    "content": " Following the positive Phase 2a ALS results in the second quarter, we continue to make important progress in our three ongoing clinical trials, evaluating tegoprubart in kidney transplantation, IgA Nephropathy or IgAN and islet cell transplantation. Additionally, in the third quarter, we received FDA clearance of our IND application for Phase 2 trial of tegoprubart for the prevention of organ rejection in subjects receiving a kidney transplant in the United States. Finishing with ALS, following our announcement of positive top line data in our Phase 2a study of tegoprubart in adults with ALS, we have been working closely with key stakeholders on potential next steps as well as evaluating a range of approaches to fund a potential future trial. Our hypothesis for targeting CD40 ligand as first-line immunosuppression for kidney transplant, stems from the large amount of non-human primate data generated both by our company with tegoprubart as well as with historical anti-CD40 ligand antibodies. In addition to the ongoing Phase 1b trial in kidney transplantation, this quarter, we were very excited to announce the clearance of our U.S. IND application to evaluate tegoprubart for the prevention of kidney transplant rejection and patientsâ\u0080\u0099 undergoing de novo kidney transplant. As a reminder, this cash runaway allows us to initiate the Phase 2 trial on tegoprubart for the prevention of organ rejection and subjects receiving a kidney transplant, but additional financing will be required to fund any future ALS clinical trials. In the first quarter of next year, we look forward to providing meaningful initial data updates for three of our four programs, kidney transplant, IgAN and islet cell transplant. Steve, let me turn that over to you. CD40 ligand can actually activate multiple different costimulatory pathways on antigen presenting cells, not only through CD40 receptor, but as an example through the MAC complex which has been shown to be very important in CD8 â\u0080\u0093 cytotoxic CD8 positive transplant rejection, there's a couple of other integrins that CD40 ligand also can control and activate cell populations including various integrins. Steve, let me turn that over to you."
}