{
    "symbol": "TCS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-08-02 21:06:02",
    "content": " For the first quarter, consolidated net sales were $262.6 million, an increase of approximately 7.1% compared to the prior year. From a profitability perspective, we delivered adjusted EPS of $0.21, compared to $0.36 in the prior year, as we absorbed higher freight and commodity costs, restored expenses that were pulled back during the heights of the pandemic, and investments to support our path to $2 billion in sales. Total sales for the Avera event were nearly 9% higher than last year and further demonstrated our ability to sell premium spaces over $2,000 as the average face value was above $7,000, up 22% for last year. By segment, net sales for The Container Store retail business were $246.8 million, a 7.9% increase compared to $228.7 million last year. Website-generated sales represented a total of 21.3% of TCS net sales in Q1 of fiscal 2022 compared to 22.5% in Q1 last year, reflecting the expected normalization of traffic patterns across channels, following the pandemic-driven surge in digital channel performance. From a profitability standpoint, our consolidated gross margin for Q1 was 57.1% compared to 59.6% last year, with the decrease driven by the higher mix of TCS segment sales, combined with lower gross margins at our TCS segment. Consolidated SG&A dollars increased 10.7% to $121.9 million, compared to $110.1 million in Q1 last year. As a percentage of net sales, SG&A increased approximately 150 basis points year-over-year to 46.4% due to increased compensation and benefit costs and increased marketing costs, reflecting the restoration of expenses that were pulled back during the height of the pandemic and additional investments into the business to support our growth to $2 billion in sales by the end of fiscal 2027. Our adjusted EBITDA decreased 15.9% to $28.2 million in the first quarter this year, compared to $33.5 million in Q1 last year. While we still expect operating margins to be in the high single-digit range, we now expect over 50 basis points of incremental operating margin pressure, as compared to our previous guidance, which excludes the benefit of an expected one-time legal settlement gain of $2.6 million from SG&A in the second quarter of fiscal 2022. For Q2 of fiscal 2022, we expect consolidated sales growth to be in the low single-digits, driven primarily by comparable store sales at TCS, which is in line with our Q2 to-date trends, excluding the impact of a one-time legal settlement benefit of $0.04 per share, we expect adjusted EPS in the second quarter to be in the range of $0.20 to $0.25 per diluted share. Capital expenditures for the full year fiscal 2022 are still expected to be approximately $60 million to $65 million for technology, infrastructure and software projects, new stores and existing store merchandising and refresh activities. And in terms of categories you know it was softer on the General Merch than our Custom Closets side of the business that continues to deliver as you saw double-digit growth over OI and seeing great performance, not only with the Avera, but also with Elfa, very pleased with our ability to continue to win in the above $2,000 in space as you know, thatâ\u0080\u0099s where we see significant upside in our growth potential and our path to hit $2 billion in sales."
}