{
    "symbol": "ATER",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 23:03:06",
    "content": " And a $2.8 million gain on change of fair value of the earn out liability compared to the year ago quarter’s net loss of $82.6 million, which includes $50.3 million of net charges from the change in fair value on cancellation of warrant, $15.6 million of charges from the change in the fair value of earn out liabilities and $6.9 million of non-cash compensation expense. However, as we look at our current Q2 and taking to account the current global environment, rising inflation and continued difficulty with supply chain, we believe Q2 2022 net revenues will be below last year’s figure of $68 million. So the question – the first question I have this, I appreciate all the color in the prepared comments, but with regard to supply chain and clearly there’s still a lot of moving parts out there, but I guess the question I have is, are you starting to see some relief, any parts of the supply chain, versus what over the last several quarters or so. So the exercise for us is literally in real time adjustment of all the variables affecting the P&L of every one of our products to really try to find that sweet spot between holding market share, creating enough contribution margin for the product to make the profitable as much as we can, but also obviously with an increase in price on these products to absorb the cost, we’re seeing less sales, right. I think for Aterian specifically, we have a diversified portfolio of products and for those who follow us closely, we’ve always maintained that the strategy that we’re going after is to leverage the common denominator of all these brands around the kind of like bread and butter type of e-commerce that we have systematized at the parent company and to leverage out across these companies – these portfolio companies that we have. Right now, we’re also looking – we’re looking at a lot of things, but I think we have a good, we would prioritizing assets and businesses that are less affected by the supply chain crisis specifically, I’d say businesses in categories where the manufacturing is maybe not in Asia, but in South America, or Canada or Europe which there are assets like that."
}