{
    "symbol": "ATER",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 00:10:16",
    "content": " We're excited for Aterian's potential return to growth in 2023 as supply chain issues are expected to continue to ease, and we continue to believe that we're on track to build one of the most exciting long-term growth stories in e-commerce and consumer products. You may now go ahead. But you're absolutely right that the larger items, which are a big part of our portfolio, they'll both suffer more if we don't normalize inventory levels and bring back goods to lower costs because the dollar difference that we would have to increase prices on right are going to be significant and give our competitors an advantage, if we don't do something about it, right. You may now go ahead. So what I mean by that is that the weakness we're seeing, seems to be just an overall trend where in those particular categories, maybe consumers are going to stick around for their old AC for another year, whereas in the past, it wouldn't, right, or, you know, wait for, as we've seen across the board Prime Day was quite substantial for us, but also a lot of others. And I think, again, just like the container costs coming down, affecting organic growth on using launching new products, we're optimistic that we'll be able to reignite this M&A engine, and hopefully the future, right, but when exactly, it's something that again, we haven't put a date to it, but we're doing a lot of work in the background to as I said, prepare operationally from it. You may now go ahead. You may now go ahead. Well, what we don't want to be doing is launching products or buying companies at the wrong time where our chances of success are going to be lower because basically we bought them right at the peak of this COVID driven wave of e-commerce growth, and then we overpaid for them, or because we launched a product at a time where the shipping costs was so outrageous that we just set ourselves from a P&L perspective of the product level to fail against the existing incumbents, right. You may now go ahead."
}