{
    "symbol": "EMBK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 14:17:06",
    "content": " First, to deliver the first trucks into the fleets of carrier customers through our Truck Transfer Program; second, to accomplish two of the remaining five capabilities in our technological roadmap, bringing the total capabilities accomplished to 13 of 16 by the end of 2022 and third, to launch the backbone of the Embark Coverage Map across the Sunbelt region. Results from the testing demonstrate that in roughly 90% of runs through snowy conditions under study, Embark's proprietary, patent-pending Vision Map Fusion technology should be able to operate successfully or pause and resume travel within acceptable shipper delivery windows. Review of Embark’s testing and performance indicated that our Vision Map Fusion technology worked within tolerance thresholds for safe operation in snowfall rates up to one-sixth inch per hour and with snow accumulation of one inch on the road over three hours, conditions that cover the vast majority of snowy weather based on Embark's analysis. Stock-based compensation is a key part of our compensation philosophy, not because it simply results in a more efficient free cash flow spend, but because we believe it speaks to the upside potential new hires see in Embark, as well as their desire to be part of something unique. And I think the focus today, which you can see with the work we're doing in PDP, the work we're doing with the coverage map, the work that we're doing with snow is really making sure that it's not just that first initial deployment, but we're able to rapidly grow into our customers to meet the needs that they've laid out for us. If I was going to add anything there, I would say, if you look at a lot of the work that we do today, as we mentioned to one of the previous questions, there's really a focus on making sure we're able to scale rapidly something like snow, which is really focused to the 2026 time line. And then I would say the second point is we're actually running trucks as you know through the Truck Transfer Program that are not Embark-equipped trucks, which is obviously unique relative to AV industry, which allows us to expand the ability to test and get learnings without actually having to buy own and operate and maintain our own fleet."
}