{
    "symbol": "BCOR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 15:17:07",
    "content": " Total revenue of $256.9 million, an increase of 1% versus prior year and GAAP net income of $39.4 million or $0.81 per diluted share. Embedded within our GAAP net income figure is a $7 million gain associated with accruals for the HKFS earn-out, which ultimately will be paid out at $23 million, due to market conditions and the significant decline in advisory asset levels during the second quarter of 2022 relative to what we expected earlier this year. Adjusted EBITDA, which excludes these and certain other items, was $62.1 million, which represents a 21% decline versus the prior year period due both to the timing of the tax season last year, as well as the 16% decline in the equity market affecting wealth. Year-to-date, revenues for TaxAct were up 9.1% to $235.4 million versus prior year, reflecting our market share and ARPU gains, partially offset by a higher level of extensions in Q2, which we expect to come in later in the year. Segment operating income for the quarter came in at $53.9 million relative to $63.4 million in the same period last year as some marketing dollars shifted from Q1 to Q2 this year, compared to last. As a result, our plan is for second half expenses to come in meaningfully below those of last year, which gives us confidence to reaffirm the guidance we provided last quarter for segment operating income between $89 million and $91 million for the year. Second quarter reported wealth management revenue was $162.7 million, down 2% sequentially as a result of the decline in markets and lower transaction-based commission revenues of 13%, which tends to occur during times of heightened market volatility. In the second quarter we added another $514 million of total client assets bringing the year-to-date total to just over $1 billion, which surpasses last yearâ\u0080\u0099s   total of $930 million, which had been a record for the business. Fee-based advisory assets were down 7% year-over-year to $36.7 billion with advisory assets as a percentage of total client assets ending the quarter at 48%, an increase of 50 basis points versus last quarter and up roughly 310 basis points versus Q2 of 2021. Because of the investments we have been making, we believe Blucoraâ\u0080\u0099s wealth business is in a stronger position today than at any time over the last several years, as demonstrated by: improvements in advisor satisfaction as measured by our annual Voice Of The Advisor survey scores; Record recruiting in the form of newly acquired assets; higher retention levels as measured by 99% plus production retention levels; net positive flows for 2 straight quarters for the first time since early 2019; meaningful shifts to advisory, which is driving higher returns after financial professional payout along with higher sweep assets ahead of the rising interest rate environment, and lastly a steady pipeline of product releases addressing the most critical pain points of our financial professional base. For our wealth management segment, we now expect full-year revenue of between $645 million to $665 million, down modestly from our prior outlook reflecting market declines, with segment income of $90.5 million to $94.5 million, which is in-line with the midpoint of our prior guidance, reflecting an uptick in more profitable sweep income. I had shared last quarter that based on rate expectations, and of course market levels, we could see wealth management segment income approach $150 million. While market levels are down meaningfully from the end of Q1 and commissions revenues continue to show weakness, we estimate that an improved outlook for rates at 3.25% by year-end would still have us delivering roughly $120 million of segment income at an S&P level of 3,000, which is another 20% decline from the S&P close as of June 30, and upwards of $150 million at market levels above 4,250."
}