{
    "symbol": "BCOR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 13:19:13",
    "content": " More than $500 million in new assets transitioned to Avantax in the first quarter, which represents 56% of what we did in our record year of 2021. Our SMB offering, which we believe will serve as a meaningful source in growth in the future is expected to grow its revenue by more than 20% to over $11 million for the year, which is embedded in our reported consumer figures. On an annualized basis, conservatively assuming the 225 to 250 basis point Fed funds rate, cash sweep revenue would be between $73 million and $82 million, annually contributing to segment operating income run rate of $150 million, as I just mentioned. Total revenue was $307.6 million, an increase of 10% versus the first quarter of the prior year. Tax Software segment revenue for the first quarter was $141.2 million, which represents 14% growth year-over-year. As a 7.2 point swing in the planned assumption, 3.7% down versus 3.5% up, impacts top and bottom line by $12 million to $15 million for the year, depending upon the impact of extension filings. Wealth Management segment operating income for the first quarter was $16.4 million, driven by unfavorable revenue performance as well as the impact of headcount investments made in the second half of 2021 in technology, growth consultants and support to enhance the experience of our financial professionals and their customers. Fee-based advisory assets were up 11% year-over-year to $40.9 billion with advisory assets as a percentage of total client assets ending the quarter at a new high of 47.5%, 410 basis points higher than the end of Q1 2021. As detailed in this morning's earnings release and our Tax Software business, we expect revenue between $247.5 million and $251 million and segment operating income of $89 million to $91 million for full year 2022. For our Wealth Management business, we expect full year revenue of $690 million to $720 million and segment operating income of $85 million to $100 million. The higher end of our guidance assumes 1% positive movement in the S&P 500 per quarter from the end of Q1 levels as well as the current forward curve of achieving 225 basis point interest rate by the end of the year, which would equate to about $20 million to $35 million of revenue this year from cash lead depending upon when 50 basis point rate hikes occur. Assuming that rates end the year at 225 basis points to 250 basis points with no additional hikes in 2023, our cash sweep revenue would result in between $73 million and $82 million for 2023 alone. On a consolidated basis, we expect full year revenue between $937.5 million and $971 million, adjusted EBITDA between $143.5 million and $162 million, GAAP net income of $22.5 million to $43.5 million or $0.46 to $0.89 per diluted share and non-GAAP income attributable to Blucora of $81 million to $100 million or $1.65 to $2.04 per diluted share."
}