{
    "symbol": "BCOR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 12:43:10",
    "content": " With this strong foundation in place, we project Avantax to grow revenue annually in the 8.5% to 11% range over the medium term with an assumption of the market growing at 4% and additional growth drivers of newly recruited assets, net growth on existing assets; and lastly, high-value mix shifts towards advisory and our RIA business rounding out our growth algorithm. Total revenue of $171.7 million, a decrease of 1% versus the third quarter of the prior year. Tax Software segment revenue for the third quarter was $6.7 million, a $1.6 million improvement versus prior year, driven by greater extensions volume versus prior year. Third quarter reported Wealth Management segment revenue was $165 million, up 1% sequentially despite a meaningfully lower asset base on which we build for advisory assets, offset by the impact of the rising interest rate environment. Wealth Management segment operating income came in at $27.6 million for the third quarter, up 74% sequentially driven by the rising interest rate environment and up 41% versus the third quarter of the prior year. Fee-based advisory assets were down 11% year-over-year to $35.4 billion with advisory assets as a percentage of total client assets ending the quarter at 48.8%, an increase of 80 basis points versus last quarter and up 290 basis points versus Q3 of 2021. I shared last quarter that based on rate expectations and, of course, market levels we could see Wealth Management segment income approach $120 million to $150 million in 2023. While market levels are down somewhat from the end of Q2 and commission revenues continue to show weakness, we estimate that an improved outlook for rates of 4% by year-end would now have us delivering roughly $135 million of segment income at an S&P level of 3,000 which is another 16% decline from the S&P close as of September 30th, and upwards of $170 million at market levels above 4,250."
}