{
    "symbol": "OEC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 11:31:24",
    "content": " 04:37 As you can see on Slide three, first quarter adjusted EBITDA was up -- wasn't excuse me, was $83.2 million, up 17.3% year-over-year and a record for both the entire company and for our rubber business. And I said that and we've been able to achieve it, and it's really only fair, because we had a specialty customer lined up, who is prepared to do a multi-year agreement for a significant chunk of the capacity, for example from that new line in Ravenna and so to ask for similar, sort of, terms from our tire customers, I think it was only fair and reasonable and we've had success in that. So first of all, I'd say it's consistent in terms of capital per ton of capacity to the facility we bought in France years ago and we've often used that as a comparison, although we were never putting out specific numbers before for what we thought this project would install. I think that most of the higher-end companies, they're very proprietary around their mix and including their cathode and anode material mix and for most of those people they are not going to want an integrated solution, they're going to want to be able to slice and dice and buy each one separately that doesn't mean there won't be some who do, but I think there is going to be a very substantial proportion that's really more interested in the separate ones. If we shift over and we think about Europe, as I've said earlier, we've really done a great job of passing-through cost inflation, whether it's natural gas or oil and I think just the fundamentals are there it's high demand, it's fair, everybody knows it's happening, you know, gosh knows, where oil prices are going to go from here. The customers are looking at supply from, for example, ourselves that I mentioned, South Africa, but also from China is probably the place where there is the largest amount of swing capacity that's not going to be easy, that's going to see that carbon black -- probably degraded in quality and shipping that's going to be far from ideal. I would just add for all my customers who are listening, I think it's also only fair, we're all investing a lot of capital and keeping these facilities, operational and keeping these facilities up to the latest specifications, we've seen what happens with under invested plants."
}