{
    "symbol": "TSHA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-28 21:58:05",
    "content": " Please proceed with your question. Now to address your question about whether â\u0080\u0093 once you have an approved product like trofinetide, where the mechanism of action obviously is very different from our product TSHA-102, which addresses the root cause of the disease, we would ideally like to treat patients that are treatment naive such that we can optimize and show the FDA and other regulatory authorities and the patient communities and the healthcare providers who treat this disease that this â\u0080\u0093 our product will have significant impact on clinical progression of disease. Please proceed with your question. But we're also doing some modeling work, and we think that comprehensive data analysis should give us enough information to go back to the FDA and request a meeting in the second quarter of this year for further discussion on what is the best path forward in a dataset that we think could really make a difference in these patient's lives, especially given it's an ultra-rare disease with no other treatments available. Please proceed with your question. Please proceed with your question. Please proceed with your question. And the question is, will our intrathecal gene therapy actually show broad clinical impact, some or most of which could be collectively considered clinically significant, whether it's really in a very large way or even in a moderate fashion in our ultra-rare disease that allows us to make a case in behalf of patients and as the sponsor for potential accelerated approval or an approval that is acceptable such that we can make this medicine available to the patient community. Please proceed with your question. Please proceed with your question. And absolutely, if we believe our product is truly making a difference in this ultra-rare disease, while there's no treatment option available, I would absolutely love to ask for the FDA to consider our product for accelerated approval such that we can make the medicine available to patients. I would just say that based on the preliminary assessment, we're encouraged about the package that we can put together and we will certainly make the most aggressive presentation we can based on data to four patients, and to get down this product as soon as possible, given that there's nothing available to particular point in time. Please proceed with your question."
}