{
    "symbol": "BPMC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 14:27:10",
    "content": " Fourth quarter revenues were $30.1 million, with $26.3 million in the U.S. We have established AYVAKIT as the standard of care in advanced SM in the U.S., where we continue to grow the number of patients treated with AYVAKIT year-over-year. As we drive towards the PDUFA date for ISM, AYVAKIT has all the harbingers of a strong launch, high medical need, first to market with a strong product profile and a highly motivated group of patients and providers who are waiting for an FDA-approved therapy. Your line is now open. So as you know, our teams are in the market on the ground today, engaging with top volume prescribers of AYVAKIT, as well as the top volume providers who are treating ISM patients. And so within those top 350 high-volume prescribers, they are treating nearly 400 moderate to severe ISM patients today who are potential candidates to start AYVAKIT rapidly upon approval. Your line is now open. Your line is now open. Your line is now open. I think - but to your first part of your question, I mean, I think what we're so pleased to see in this launch is that we are - we have the dominant share of the current market of patients who are treated with advanced SM and we're seeing that consistent demand, where we continue to drive new patients, broadening the prescriber base, adding new accounts and new prescribers as we really work to expand the overall size of the SM market as well. And importantly, we know that it's important to engage a broader prescriber base who are treating that 7,500 moderate to severe ISM patients who are diagnosed and actively seeking treatment today. So when we think about where early adoption of AYVAKIT could happen post ISM approval, we see it not only among those 400 patients treated by the current top volume prescribers, but also among that broader group of patients who really have severe symptomology. So just to be clear on the 400, we see 400 moderate-to-severe, not well-controlled ISM patients amongst physicians who currently have AYVAKIT experience. Your line is now open. Your line is now open. Your line is now open. Your line is now open. As you think about the ISM presentation at PIONEER, we're going to show kind of the totality of data, including the impact on patients across all symptoms within the TFS. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And really, as we kind of come out of the Q&A and taking a step back, I mean, today, we have highlighted the significant opportunities that we have as Blueprint right in front of us, to create value for patients and for our shareholders, including our continued commercial execution, our anticipated launch in ISM, as well as the ambitious and achievable goals we have for our pipeline."
}