{
    "symbol": "BPMC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 13:10:28",
    "content": " Since the launch of AYVAKIT, the percent of advanced SM patients, who are being treated for their disease has grown by approximately 40%, as healthcare providers are now choosing to intervene where historically they may have chosen to watch and wait. 12:27 Together with the SM community our efforts to raise disease awareness and accelerate time to diagnosis are yielding a tangible impact, a 54% growth in the number of SM patients observed in US claims, since the launch of AYVAKIT in January 2020. In addition to the PIONEER topline data in late summer of this year, we plan to report multiple clinical proof-of-concept data sets across our EGFR and CDK2 programs into early next year, including combination data that will enable us to expand into earlier lines of treatment and increasing numbers of patients. 34:45 And as Christy mentioned as well, we at a near kind of upcoming medical conference, we plan to also present data based on some real world evidence on showing improved survival in patients who are receiving AYVAKIT relative to standard-of-care and other therapies, which I think is going to be incredibly compelling. They're being diagnosed and we're continuing to see that growth both through our efforts, as well as I think just the efforts of the overall SM community and these patients who are just so motivated to really seek peak diagnosis and treatment. 50:56 And so, the fact that we've seen 40% growth in the number of patients being treated such as sort of the overall market since AYVAKIT has launched, I think those speaks to that. So first off, I would say we're fairly confident that these are indeed unique patients that we're looking at as we're able to follow their journeys through initial diagnosis and their health care utilization, which includes things like the treatments that they may use, as well as the different physician specialties that they're interacting with both for chronic care, as well as sort of acute or episodic care. I think it's going to be much more about our continued engagement with healthcare providers and patients education around patient identification and testing and, of course, a very positive benefit risk profile that we're expecting to see from AYVAKIT in this syndication, particularly at the doses for non-advanced SM based on the data that we've seen so far from PIONEER in Part 1. So I think that what we're going to see is providers looking to understand the depth of the disease sometimes by trying the treatment that we know wiped out the clone and causes the disease and also starting to work with the community to understand the value of preventing the progression of the disease, even in the non-advanced setting."
}