{
    "symbol": "RGLS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 21:49:13",
    "content": "  Operator: Hello, and welcome to the Regulus Therapeutics Inc. Q3 2022 Earnings Conference Call. Thank you, and good afternoon, and thank you for joining us to discuss Regulus Therapeutics Third quarter 2022 financial results and corporate highlights. Joining me on today's call is Jay Hagan, President and Chief Executive Officer; and Dr. Denis Drygin, Chief Scientific Officer. Jay will provide opening remarks and share progress on our ADPKD program, and I will review the financial results before we open the line for questions. Before we begin, I'd like to remind you that this call will contain forward-looking statements concerning Regulus Therapeutics future expectations, plans, prospects, corporate strategy and performance, which constitute forward-looking statements for the purposes of the safe harbor provision under the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in our filings with the SEC. Thanks, Cris, and welcome, everyone, to our third quarter earnings call and business update. In September, we announced positive top line safety and PK data from our Phase I single ascending dose, or SAD, clinical trial of RGLS8429. In addition, importantly, preliminary results suggest that plasma exposure is approximately linear across the 4 dose levels tested and is similar to the PK data from the first generation compound RGLS4326. Last week, we announced the dosing of our first patient in our Phase Ib multiple ascending dose or MAD study of RGLS8429. The study is a double-blind, placebo-controlled, multiple ascending dose study to assess safety, tolerability and pharmacokinetics of RGLS8429 in adult patients with ADPKD. The study will evaluate the safety and efficacy of treatment with 4329 -- excuse me, 8429 across 3 different dose levels, including measuring changes in Polysystems, cystic kidney volume or high adjusted total kidney volume and overall kidney function. Switching gears, during the 3 months ended September 30, 2022, we sold and settled approximately 2.2 million shares for net proceeds of $4.5 million under our ATM facility. The poster presentation was titled Discovery of next-generation anti-miR-17 oligonucleotide RG-429 for the treatment of autosomadominant polycystic kidney disease, and it highlighted data supporting the potential of A429 in this important disease. We are excited about our progress as well as the attention RGLS8429 receives in the marketplace, which helps validate the effort our team is putting forth each day to advance this therapy and its potential to improve the current standard of care. As of September 30, 2022, our cash, cash equivalents and short-term investments totaled approximately $45.3 million. So curious what you saw with longer dosing in animal studies, and if you think there's read through there to what we should be expecting from the clinical data readout next year. Maybe I'll touch on the clinical part, and I ask Denis to comment on dosing duration in a variety of animal models, which depending on the animal model some are more rapid than others offering less opportunity to dose for extended periods. And if you recall, the trajectory of the change from baseline would suggest that with continued dosing, higher levels of Polysystem could be achieved prior to it plateauing once we reach steady state in the kidney. Indeed, as Jay mentioned earlier, the majority of the models for ADPKD are quite aggressive and do not allow extended period of treatment. However, we did test first generation molecule in a longer (inaudible) model where the treatment was for 7 weeks. So I think the -- previously, the data expectation for the first dose cohort might have been first half '23, please correct me if I'm wrong, and this time, we hear midyear. So the guidance that we provided for data from the first cohort in the first half of '23 dates back to when we did our financing in October, November last year, outlining at that time, our expectation for both initiation of the SAD and then initiation to MAD. Now that the MAD is actually initiated, we're a year after that initial guidance was provided, where we're taking a look at what -- how quickly we think we're going to enroll the study. So effectively, we're saying in the first quarter is likely out, we'd have to be done enrollment this month probably to hit the first quarter. And so while it's premature to estimate the time of enrollment of subsequent cohorts, one can anticipate that it could go more quickly than the first cohort just given more sites up and active. Seeing no further questions, I would like to turn the conference back over to Jay Hagan for any closing remarks."
}