{
    "symbol": "IBTX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 11:00:32",
    "content": " The increase in interest income versus Q2 was driven by floating-rate loans repricing, representing 17% of the core loans held for investment book as well as net loan growth combined with new fixed rate production funded during the quarter to replace normal amortization paydown and payoffs. As this book reprices over the next 8 to 12 quarters, it should present a consistent tailwind to interest income growth in the base case scenario, where the Fed reaches the terminal rate by year-end and holds flat by 2023. Yes, the loan growth, Brad, we were right, a little better than we'd expected here in the third quarter, but the pipeline looks good, I'm saying we're thinking fourth quarter here is probably a little back of the 10% in the third quarter, so maybe 8ish percent. So, we'll continue to grow the portfolio and then as our base case rate as Paul was talking about with the Fed recent terminal rate in the fourth quarter or in the first quarter of next year, then we think at some point in there, the deposit pressure will abate at whatever level that is. And even with a 6% to 8% kind of loan growth, we'll have again assuming that we can moderate our expense situation, then I think we'll be in pretty good shape second through the fourth quarter next year. Yes, speaking to the funding side, Brad, we've really invested deliberately over the last couple of years in our retail and our treasury platforms and we really do have a pretty strong team there that we think is going to be able to generate some incremental deposit growth for us to fund growth on the margins over the next, call it, three or four quarters anything, if you look at the brokered and specialty buckets that that we have. And then just kind of back to the expenses, you mentioned in the press release that you had filled a bunch of positions, were those -- can you just describe what kind of positions those were and as you balance some of your strategic initiatives to kind of keep the expense base flattish next year, what does that kind of encompass for ongoing hiring efforts, particularly on frontline basis to kind of help you continue to generate high single-digit loan growth."
}