{
    "symbol": "PARA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 12:08:07",
    "content": " As we moved into 2023, we see a year of continued content and platform momentum ahead of us, a year of further scaling streaming as we hit the peak investment point, a year where we further harness the power of One Paramount, including importantly with our Paramount+ Showtime integration and a year where we look to the ad market to turn as we get to the back half. Q4 demonstrated earnings resiliency in our traditional business, along with robust revenue growth in our D2C business, the combination of which puts us on a path toward meaningful earnings and free cash flow growth in 2024 as we transition out of peak streaming investment in 2023. Importantly, our focus on working capital optimization meant the year-over-year change in free cash flow in 2022 was better than the year-over-year change in OIBDA, a trend we expect will continue in 2023 as the gap between cash content spend and P&L content expense continues to narrow. By extending and evolving these powerful Showtime franchises and supplementing them with the breadth of content on Paramount+, weâ\u0080\u0099re able to deliver a powerful consumer proposition in both linear and streaming formats, thereby preserving revenue while meaningfully reducing total content expense. Also, with the consolidation of Showtime and Paramount+ taking place later this year, we plan to remove total D2C subscribers from our external reporting starting in Q1 of 2023 as this metric will no longer be meaningful in tracking our subscriber growth trajectory. While D2C losses will increase this year relative to 2022, weâ\u0080\u0099re approaching an important inflection point where the revenue scale, multi-platform content strategy and distribution footprint weâ\u0080\u0099ve established together with the integration of Showtime and Paramount+ allow us to turn the corner toward streaming profitability. Your line is open. Your line is open. Weâ\u0080\u0099re going to start to grow D2C earnings next year, and we do expect the ad market to recover starting in the back half of 2023, which means that weâ\u0080\u0099re going to see significant improvement in OIBDA and free cash flow in 2024. Your line is open. Your line is open. Operator, next question please. Your line is open. Operator, next question please. Your line is open. Operator, next question please. Your line is open."
}