{
    "symbol": "PEG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 17:42:04",
    "content": " We successfully navigated last year's challenges including inflation, supply chain disruptions, energies price spikes, and the steep rise in interest rates to deliver a GAAP earnings of $2.06 per share, and non-GAAP operating earnings of $3.47 per share, placing our results for the full year above the midpoint of our 2022 non-GAAP earnings guidance. At year end 2022, PSE&G's rate base topped $26.4 billion a 7.7% increase over the year end 2021. This improved business platform created by the strategic actions we have taken over the past two years, combined with our efforts to increase the predictability of our results, positions us to narrow our 2023 non-GAAP operating earnings to a range of $3.40 to $3.50 per share from our original guidance of $3.35 to $3.55 a share provided last November. The good news is that additional headroom was created in our gas and combined customer bill, as the recent decline in natural gas prices has enabled PSE&G to reduce its residential default gas supply rate by $0.15 to $0.15 per therm for the balance of the winter 2020 to 2023 heating season. For the full year 2022 GAAP earnings were $2.06 per share, compared to a GAAP loss of $1.29 per share for the full year of 2021, which included fossil sale related impairments. Non-GAAP results for $3.47 per share for 2022 compared to 2021's non-GAAP results of $3.65 per share, which you may recall excluded depreciation related to the fossil assets held for sale in the fourth quarter of '21 and retirement of power debt. Gas, electric and other margin contributed combined to add $0.07 per share compared with last year's fourth quarter reflecting GSMP II roll-ins the Conservation incentive program or CIP decoupling for both electric and gas, appliance service and other margins. We've narrowed our forecast of PSE&G's net income for 2023 To $1.5 billion to $1.525 billion which reflects pension and OPEB updates compared to 2022 offset by the benefit of contemporaneously recovered investments, predictability of utility margin from the safety coupling, as well as the implementation of the pension accounting filing effective for calendar year '23. The fourth quarter 22 CFIOs net income improved to $436 million or $0.88 per share from $174 million in the year ago quarter, reflecting higher gains on both mark to market transactions and NDT fund related activities. For the fourth quarter 2022 the non-GAAP operating earnings loss of $34 million or $0.06 per share reflected the absence of the fossil assets compared to the fourth quarter 2021 non-GAAP earnings of $81 million or $0.68 per share, which reflected the cessation of depreciation and lower interest costs related to the fossil sale. Referring again to Slide 10, non-GAAP operating earnings were $0.22 per share lower in the fourth quarter than the fourth quarter of 2021 driven by lower capacity prices for the remaining nuclear fleet, but regeneration volume recontracting lower prices and lower deck revenue compared to the year ago quarter. Activity was a pay per share favorable compare the fourth quarter of 2021 primarily reflecting the essence of 2021's donation to the PSEG foundation, partly offset by higher parent interest of $0.04. As Ralph mentioned earlier, we've narrowed our 2023 non-GAAP operating earnings guidance to $3.40 to $3.50 per share around the same $3.45 per share midpoint, with regulated operations continuing to contribute approximately 90% of that total. PSE&G's forecast of 2023 net income is narrowed to $1.500 billion to $1.525 billion reflecting the predictability provided by the expected transmission distribution investment recovery, and focus on owned and cost control. Please proceed with your question. Please proceed with your question. Hey, good morning team. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Hey, good morning team. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}