{
    "symbol": "PKG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 13:46:06",
    "content": " Yesterday, we reported third quarter net income of $262 million, or $2.80 per share, excluding special items third quarter 2022 net income was $266 million, or $2.83 per share, compared to the third quarter of 2021 net income of $257 million or $2.69 per share. Third quarter net income included the special items expenses of $0.03 per share primarily for certain costs at the Jackson, Alabama mill for the paper to containerboard conversion related activities, details of all special items that for the third quarter of 2022 and 2021 were included in the schedules that accompanied the earnings press release. Excluding the special items, the $0.14 per share increase in third quarter 2022 earnings compared to the third quarter of 2021 was driven primarily by higher prices in mix in our packaging segment of $1.60 and pay per segment $0.23 cents. The results were $0.03 above the third quarter guidance of $2.80 per share primarily due to the very sound implementation processes around our previously announced price increases in the packaging and paper segments, as well as the continued benefits generated from our mills and plants through process efficiency optimization efforts and material usage initiatives. Looking at our packaging business, EBITDA excluding special items in the third quarter 2020 of $467 million, with sales of $1.9 billion resulted in a margin of 24.1% versus last year as EBITDA of $467 million with sales of $1.8 billion and 25.5% margin. As Mark mentioned, we continue to get excellent realization from the implementation of our previously announced price increases across all product lines, domestic containerboard and corrugated products prices and mix together were $1.54 per share above the third quarter of 2021 and up $0.35 per share compared to the second quarter of 2022. Looking at the paper segment, EBITDA excluding special items in the third quarter was $33 million, with sales of $165 million or a 20% margin compared to the third quarter of 2021 EBITDA of $18 million, and sales of $150 million or a 12% margin. Lastly, our planned annual maintenance outage expense for the fourth quarter is now expected to be about $0.38 cents per share, or $0.11 cents per share higher moving from the third quarter to the fourth quarter. As Bob mentioned, scheduled annual outage expenses will be $0.11 per share higher than the third quarter. Thanks so much, everyone. So when you consider that I'd say about half of that sequential movement will end up in the volume side of so in the balance of that -- the items that are probably higher versus what we would normally see going from third quarter to fourth quarter, really a couple of buckets, primarily energy for obvious reasons, and labor and benefits again, for some obvious reasons as that continues to just increase with the situation with the labor force. Thanks so much, everyone. Just, first of all, just a clarification, you had mentioned that outages, I think we're going to be about $0.11 higher than you had previously anticipated in the fourth quarter."
}