{
    "symbol": "PKG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 11:56:10",
    "content": " Excluding the special items, the $0.95 per share increase in first quarter 2022 earnings compared to the first quarter of 2021 was driven primarily by higher prices and mix of $1.83 and volume of $0.23 in the packaging segment; higher prices and mix in our paper segment for $0.15, a lower share count resulting from share repurchases for $0.03; and lower interest expenses of $0.02. We also had higher depreciation expenses of $0.07, lower volume in our paper segment were $0.06, higher scheduled outage expenses, $0.05, a higher tax rate resulting from some favorable items in the last year’s tax rate of $0.03 and other costs $0.01. The results were $0.22 above our first quarter guidance of $2.50 per share primarily due to higher prices and mix and higher volumes in both our packaging and paper segments, operating cost improvements from efficiency and usage initiatives and favorable weather conditions. Looking at the packaging business, EBITDA excluding special items in the first quarter of 2022 was $464 million with sales of $1,960 million, which resulted in a 23.6% margin versus last year’s EBITDA of $352 million and sales of $1.62 billion or a 21.7% margin. Total volume in our corrugated products plants was up 2.9% and shipments per day were up 1.3% versus a very strong comp in last year’s first quarter, which for us was up approximately 8% over the prior year. Looking at the paper segment, EBITDA, excluding special items in the first quarter was $0.29 with sales of $153 million or an 18.9% margin, compared to the first quarter 2021 EBITDA of $0.16 million and sales of $165 million for a 9.6% margin. Accordingly, sales volume was about 19% below last year’s first quarter when we were producing paper on the number one machine at our Jackson, Alabama mill. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}