{
    "symbol": "PKG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 14:02:05",
    "content": " Second quarter net income included special items expenses of $0.02 per share, primarily for certain costs at the Jackson, Alabama mill for paper to containerboard conversion-related activities. Excluding the special items, the $1.06 per share increase in second quarter of 2022 earnings compared to the second quarter of 2021 was driven primarily by higher prices and mix of $2.04 and volume, $0.12 in the Packaging segment, and higher prices and mix in the Paper segment of $0.18. Results were $0.40 above the second quarter guidance of $2.83 per share primarily due to higher prices and mix in the Packaging segment, lower scheduled outage expenses of $0.07 per share resulting from the postponement of the international falls outage from the second quarter to the third quarter and lower fiber and energy costs resulting from efficiency and usage initiatives. EBITDA, excluding special items in the second quarter of 2022 of $525 million with sales of $2.1 billion, resulted in a margin of 25.4% versus last year's EBITDA of $409 million and sales of $1.7 billion or 23.8% margin. We had great execution of our previously announced price increases and demand in our Packaging segment was solid with corrugated demand about flat with last year's record second quarter, along with demand out of our containerboard mills generating new second quarter production and sales volume records. As Mark mentioned, total corrugated product shipments and shipments per day were essentially flat compared to last year's record second quarter, which was up 9.6% versus the previous year. Outside sales volume of containerboard was about 41,000 tons above last year's second quarter, which was our lowest outside volume quarter for 2021, but 6,000 tons below the first quarter of this year due to the lower export shipments, strong internal demand and managing through the scheduled maintenance outages at our mills. Looking at our Paper segment, EBITDA, excluding special items, in the second quarter was $32 million with sales of $150 million or 21% margin compared to second quarter 2021 EBITDA of $12 million and sales of $142 million or an 8.2% margin. Sales volume was about 12% below last year's second quarter when we were still producing paper on the number one machine of the Jackson, Alabama mill versus producing corrugating medium in this year's second quarter. Paper prices and mix were 19% higher than last year's second quarter and 5% above the first quarter of 2022, resulting from our previously announced paper price increases. And finally, as Bob indicated, scheduled outage costs will be $0.07 per share higher due to the International Falls mill outage that was postponed from the second to the third quarter. And they feel like â\u0080\u0093 and they feel very confident that once they work through these inventory issues, which I think is really our short-term problem at the end of the second quarter leading into the third quarter, once they come out of that, they're going to go back to demand trends that are more equivalent to where they were last year. And I think this year we're probably somewhere in that $160 million type spend, next year we'll wrap that up with about a $100 million of final spend on the spring outage that we've got scheduled or the final phase that will take care of that machine. I'm just curious from a broad perspective the impact on kind of productivity and cost that you see from kind of new corrugators and new converting equipment going in across the industry very similar to, I think, what you've just done up at Washington, because it seems like just an unprecedented period to me when I look across the industry broadly at the amount of new investment that's going on in converting, I don't know whether you would agree with that statement. And historic because if I look back last 10 years, I think, all about one year you were up third quarter versus second quarter, obviously you typically don't have this experience of as big, an increase in cost second to third quarter."
}