{
    "symbol": "ASPU",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-14 23:23:06",
    "content": " These statements include the continuing impact of COVID-19 on our operations and future growth, anticipated future revenue from our pre-licensure campuses, the timing for opening our next Tier 1 campuses, net income from our five operating campuses, the timing for new campuses to achieve breakeven, our campus growth by 2025, our future growth and growth strategy, the percentage of revenue from our campuses and USU, bookings and LTV, projected fiscal 2022 advertising spend, changes in our gross margins, fiscal 2022 EBITDA, our fiscal 2022 guidance and our liquidity. In the second quarter, our Aspen 2.0 strategy once again delivered growth on a year-over-year basis in our high LTV degree programs, which increased the 54% of total revenue due to the solid revenue growth from our BSN pre-licensure and MSN Family Nurse Practitioner or FNP Degree Programs. AU revenue in the second quarter of fiscal year 2022, which includes the high LTV BSN Pre-Licensure Program accounted for 67% or $12.8 million versus 71% or $12.1 million. The quarter’s general and administrative costs were $11.6 million or 61% of total revenue, compared to $11.3 million or 66% of total revenue. We anticipate revenue in the range of $77 million to $80 million, representing an increase of $18.7 million or 16% year-over-year from the midpoint of the guidance range and GAAP loss per share of $0.38 to $0.29 for an improvement of $0.10 or 24% year-over-year from the midpoint. As a matter of fact, we estimate our fiscal 2022 high and low projected EBITDA guide, without consideration of investments in ramping pre-licensure locations would increase by approximately $4.6 million, meaning the company would be approximately breakeven EBITDA for this fiscal year, if not for the opening of the three pre-licensure campus locations over the past one and a half years. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. And so next year conservatively, we think that there’s a 15% growth rate next year, which would imply about a $12 million increase in revenue year-over-year versus where our revised guide is today. And our forecasts suggest that, if we do in fact deliver a $6 million improvement and $6 million of leverage next year -- next fiscal year, we won’t burn cash, we will be basically cash neutral for the year. You may proceed with your question. And then just lastly on the guidance for the following year 2023, so you’re expecting about -- you talked about two numbers, it was $12 million with the increase in the revenues from the revised guidance. What Matt said is that, we’re going to -- we’re expecting an increase of about $12 million in revenue year-over-year and we expect to achieve adjusted EBITDA leverage of 50%. So we expect the improvement to be $6 million year-over-year and if we’re in the minus $1 million of adjusted EBITDA this year, that’s the middle of the range that would imply a $5 million positive EBITDA for -- positive adjusted EBITDA for next fiscal year. You may proceed with your question."
}