{
    "symbol": "RERE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-22 12:29:03",
    "content": " Hello, everyone, and welcome to ATRenew's third quarter 2022 earnings conference call. Hello, everyone, and welcome to ATRenew's third quarter 2022 earnings conference call. During the third quarter, our city-level service integration strategy continues to support a healthy growth of our core business of mobile phone and consumer electronics recycling. And the non-GAAP measures, the increases were primarily due to, first, an increase in personnel cost operation center and self-operated store-related expenses, which were in line with the increasing sales of prolonged consumer electronics and the addition of 103 self-operated AH stores compared with the second quarter 2021; and the second, an increase in personnel cost in connection with the company's growing business. Excluding SBC expenses, non-GAAP G&A expenses increased by 76.7% to RMB46.3 million, primarily due to first an increase in personnel costs in connection with the company's growing business; and second, an increase in professional service fees. Overall, after being negatively affected by pandemic control measures in core 1P recycling business locations, such as Shanghai and Beijing in the second quarter, our recycling business recovered to a normal growth track during the third quarter. during the fourth quarter, we will continue to refine our structured SKU database, enhance user experience, and including price inquiries and improve the conversion rates, we expect to have further breakthroughs in terms of CD coverage, extending our consumer ratio across over 160 core AHS stores across China, and we aim to share more detailed color about our multi-category recycling business in the fourth quarter. Our 1P business was less impacted by pandemic control measures during the quarter as our operation of offline stores gradually resumed, we were able to meet consumers recycling demand and with stable pricing."
}