{
    "symbol": "RERE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-24 21:39:04",
    "content": " Statistically, among all the 22 cities that implemented the city-level service integration strategy in the first quarter, 16 of them exceeded the average growth rate, while the majority of these 16 cities exceeded by 30%. In the mid to long-term, we are committed to the clear core strategy, namely increase market penetration rate and maintain healthy growth through city-level service integration, extend business goal through tiered store management and high value reflecting across categories, capture more value through compliance refurbishment at scale, and further improve operational efficiency by accelerating the application of automation technology. In the first quarter of 2022, despite the fact that it was in OPEC we delivered 45.7% revenue growth to achieve total revenues of over RMB2.2 billion, exceeding the high end of our previous guidance range provided in the fourth quarter earnings conference call. Growth in service revenues was primarily driven by growing transaction volumes and an increase in value-added services from our marketplaces, especially through expansion and delivery fees on PJT Marketplace in the first quarter of 2022. Operating costs and expenses increased by 44.7% to RMB2,352.5 million, non-GAAP operating expenses, which exclude share-based compensation expenses and the amortization of intangible assets resulting from business acquisitions, increased by 43% to RMB2,213.9 million. In the non-GAAP measures, the increases were primarily due to, first, the increases in logistic expenses and operation center, and self-operated store-related expenses, which were in line with the increasing sales of pre-owned consumer electronics and additional 155 self-operated AHS stores compared with the first quarter 2021. Non-GAAP selling and marketing expenses increased by 41.2% to RMB206.6 million, including non-GAAP measures, the increase was primarily due to, first, an increase in sales promotion and coupon expenses in connection with business development where we increased the investment into promoting Paipai by RMB45 million year-over-year."
}