{
    "symbol": "DOCU",
    "quarter": 2,
    "year": 2022,
    "date": "2021-09-02 21:08:12",
    "content": " Please proceed with your question. 2nd thing is, we can mine that information to help us drive more customer success, so we can take a look at how people are using our products, how they're not using our products, which used cases, they're not availing themselves up, when they have incomplete segments of agreements because certain parts of the Company might not be as responsive as others and help them really pinpoint and run their business better and help them figure out ways to grow more with DocuSign because of that. Now, one of the benefits that allow us to expand our footprint very, I think, related to your question is once someone realizes that they should have all of their agreements in our repository and service CLM solution at DocuSign, that means they're going to go out to all the other parts of the Company that haven't yet adopted eSignature as an example and so we really want to consolidate and get all that information into 1 repository. Please proceed with your question. Please proceed with your question. And so, I would say from the standpoint there, there's nothing different than I've noticed in the last year and prior years in terms of that mix, I think at the very peak of COVID we probably saw an increase in more use cases that sort of expansion of more things people were doing, over volumes. Please proceed with your question. I think it is about a year ago where you announced a new President of International and obviously, we've seen acceleration over the last year, so, maybe help us understand where you're seeing success and what the second half is going to look like over the next year. And I think going forward, it's more of the same, I think we've talked a lot about this construct that we had this focused eight in terms of the core countries where we're operating in and I think we want to continue to focus on those eight and I think over the next year, so you're going to see us expanding on that a little bit. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Just one question I wanted to ask maybe about what you're seeing in terms of services, because it's -- looking at your guidance, you're expecting a bit of acceleration on the professional service's line in the back half of the year relative to what we've seen in the first half. Please proceed with your question. It's a great question and I think when we're thinking about -- through the customers, and the expansion economics if you will, what we've seen is customers sometimes use more than what they've purchased and so we don't charge them overages per se. Please proceed with your question."
}