{
    "symbol": "BHIL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 12:50:04",
    "content": " Comments today from management will contain forward-looking statements including Benson Hill's expectations of future financial and business performance, industry outlook, as well as current guidance about 2022 annual results, our plans and goals for 2023 and our 2025 financial targets. As a result of this strong performance, we now expect to deliver full year ingredient segment revenues between $370 million and $389,000 million above the previously increased range of $275 million to $325 million provided on the second quarter call. The guidance includes the third quarter and expected fourth quarter revenue and gross profit contributions from the ADM strategic partnership, which should more than offset the approximately $3 million of unexpected negative impacts from the Fresh segment year-to-date. And the production utilization and performance â\u0080\u0093 operations performance continues to perform at a level that candidly we didn't anticipate, put a little bit of math around that, about 30 â\u0080\u0093 the Q3 production utilization and cross rate performance is about 30% better than the third quarter than it was all the first half of the year, and that's a function of the fact we've recently acquired these assets. It's clearly a couple of things, a function of the performance of the margins as we've expanded the gross profit and obviously the EBITDA that is true margin, cash margin performance, continuing to really optimize the working capital cycle, I think we took a reasonably conservative view given the dynamics of the markets, given the performance of operations, and is now we've seen their ability to perform. I mean, and the two kind of go hand-in-hand to the extent that we continue to see strong persistent demand and to the extent that we certainly more work to be done, but certainly firing on all cylinders from an operational perspective with regard to the production velocity improvements, the crush rate improvements, the overall capacity utilization, and those are having, I would say meaningful impacts on the overall margin expansion that we're seeing. But what, as it reflects to your question of consolidated revenue, we're in this midst of transition between non-proprietary over to proprietary, but I would say that the ceiling that we previously thought we had, say a year ago is higher and it's higher because of frankly, the team and the remarkable work that they have done to execute the operational goals far beyond our expectations which will provide overall greater capacity for flows through those plants over time."
}