{
    "symbol": "WLK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 23:00:29",
    "content": " Rising global energy prices, particularly in Europe, which began in early 2022, continued throughout the quarter, while lagging economic growth in Asia and Europe, combined with rising interest rates in the U.S., led to softer demand for many of our products globally and pressured profitability. As compared to the prior year period, our earnings were impacted by lower integrated margins for all of our products in our performance materials business, especially in the PVC export markets, lower production and sales volumes for chlor-alkali and PVC resin, particularly in Europe, higher feedstock fuel and power cost and higher turnaround activity. This sequential decrease in EBITDA is a result of lower integrated margins for our performance materials, particularly PVC, lower production and sales volumes for chlorovinyls and epoxy resins, higher feedstock fuel and power cost and the $70 million litigation. In our building products business, HIP segment EBITDA for the third quarter of 2022 increased $117 million to $254 million, when compared to the third quarter of 2021, which did not include the businesses we acquired from Boral Industries in the fourth quarter of last year. Housing product sales increased $482 million, compared to the third quarter of 2021 with pricing gains across all our products, along with contributions from the businesses we acquired in the second half of 2021. As -- but as chlorine demand kind of pulls back on the PVC and other derivatives, we'll see production drop a little bit, which is certainly supporting pricing on the caustic side, but we're also still seeing good strength on the merchant chlorine side, I would say, outside of PVC and the other big polymers. I think the other piece we see both in HIP segment and in the Epoxy business is we continue to work on creating synergies from the acquisitions, and we'll be accelerating that in the coming quarters as business slows down just a little bit, and we'll be able to come back and bring our -- all of our processes, manufacturing delivery into a much more, let's say, organized way as opposed to the pace it's been in the last 18 months."
}