{
    "symbol": "WLK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 14:46:06",
    "content": " Net income for the fourth quarter 2022 decreased $412 million from the fourth quarter of 2021 as a result of lower production and sales volumes in each segment adjusted for the acquisition of Epoxy, lower performance materials average selling prices in PBC, polyethylene and Epoxy and higher feedstock fuel and energy costs, particularly in Europe. When compared to the third quarter of 2022, net income decreased by $169 million in the fourth quarter due to customer destocking, seasonal demand trends and sales mix shift to export markets. However, in the middle of 2022, in response to softening macroeconomic conditions, sales volumes began to weaken moving selling prices lower in PVC and polyethylene within Performance Materials while driving a sharp reduction in Housing and Infrastructure Products sales volumes. As the second half of the year progressed into the fourth quarter, weaker end-use demand along with elevated customer destocking activity drove sharply lower sales volumes in epoxy and polyethylene within PEM and nearly every product line within HIP. As compared to the prior year period, Performance Materials sales in the fourth quarter decreased $378 million largely driven by lower selling prices, particularly PVC resin as customer inventory destocking led domestic sales volumes to decline much greater than end-use demand levels. Meanwhile, Essential Materials sales in the fourth quarter 2022 increased $279 million over the fourth quarter of 2021 primarily driven by higher average selling prices for caustic soda. As compared to the fourth quarter of 2021, our earnings were impacted by lower integrated margins for all of our products in our Performance Materials business, especially in global PVC markets, lower production and sales volumes for chlor-alkali and PVC resin particularly in Europe, higher feedstock, fuel and power costs and higher turnaround activity. This sequential decline in EBITDA is a result of lower integrated margins for our Performance Materials particularly PVC and lower production sales volumes for polyethylene, chlorine, caustic soda, VCM and epoxy resins, partially offset by higher sales prices for caustic soda. Housing product sales decreased $85 million, which reflects the significant destocking I mentioned earlier, compared to the fourth quarter 2021 driven by the 22% volume declines across our product offerings. Infrastructure products sales fell $24 million from the fourth quarter 2021 as a result of broad-based volume declines, particularly in a large diameter PVC pipe. Thus, we remain focused on actions that are within our control to grow shareholder value, including prioritizing quick payback capital projects, progressing our sustainability goals, including continued support for new innovations such as GreenVin caustic soda and PVC polyethylene one-pallet solutions and PVCO pipe, maintaining our investment-grade credit rating and strong balance sheet, which had $2.2 billion of cash at the end of 2022, using our strong balance sheet with ample liquidity look for attractive opportunities, to deploy our robust cash generation in a disciplined manner, including returning cash to shareholders through both dividends and share repurchases and identifying acquisition candidates that can exceed our cost capital while extending the breadth and reach of our product portfolio. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Thank you, so much. Your line is now open. Thank you, so much. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}