{
    "symbol": "WLK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 17:46:07",
    "content": " Iâ\u0080\u0099m pleased to announce that we achieved record quarterly results in the second quarter of 2022, including record net sales of $4.5 billion, record EBITDA of $1.5 billion and record net income of $858 million. These record results were driven by good demand with significant pricing and margin improvements in our chlorovinyls business, strong demand from new housing construction, repair and remodeling activities and contributions from the acquisitions weâ\u0080\u0099ve completed over the past 12 months. The second quarter of 2022 net income increased $336 million from the second quarter of 2021, as a result of strong price and margin gains in both segments, driven by the global economic expansion weâ\u0080\u0099ve seen since the onset of the COVID-19 pandemic, anchored by broad-based strength across manufacturing and construction markets. Compared to the second quarter of 2021, HIP segment sales for second quarter of 2022 increased $666 million to $1.4 billion with segment EBITDA increasing $180 million to $310 million. When compared to the first quarter of 2022, housing product sales of $1.1 billion, increased $144 million reflecting the continued strength in housing across our product offerings. As a result of the cost environment, in the second quarter of 2022, we had a favorable FIFO benefit of $52 million compared to what earnings wouldâ\u0080\u0099ve been reported to on a LIFO method with approximately 70% of the benefit related to the PEM segment and the remainder benefiting housing and infrastructure products. I think if you look at even three businesses, if you look at polyethylene, PVC and epoxy, youâ\u0080\u0099re seeing some similar trends in that, in general, China are importers of those businesses in those products normally with the lockdowns and the slowdown demand, they have shifted to either neutral or exporting."
}