{
    "symbol": "WLK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 16:16:06",
    "content": " The market trends we experienced in the second half of 2021 continued in the first quarter, healthy housing construction and repair and remodeling markets, which when paired with strong demand in industrial and consumer packaging and industrial manufacturing activity, drove record performance from broad-based pricing gains in both segments, along with volume gains from the businesses we acquired in 2021 and the first quarter of 2022. With a global footprint and North American cost advantages, Westlake captured the benefit of a vertically integrated production chain with globally competitive ethane, power, natural gas and oils, a North American manufacturing footprint well situated to serve strong domestic demand, which also provides most cost advantages to serve export markets and leadership in a growing portfolio of specialty higher-margin value-added branded products. First quarter 2022 year-over-year average sales prices and volumes for Westlake were up 46% and 26%, respectively, driven by very strong demand across product portfolios and contributions from our acquisitions. In housing products, sales were $972 million in the first quarter of 2022, a $129 million higher than the fourth quarter of 2021, reflecting the strength across our product offerings, including building products, pipe and fittings and our post-industrial recycled products, servicing the residential markets. Our caustic soda business is largely based in North America saw continued pricing gains in the first quarter of this year as global industrial manufacturing activities improved over 2021, as industrial production in Europe and Asia faced significant energy price increases. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}