{
    "symbol": "DIN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 15:09:06",
    "content": " Average weekly sales for Applebee's and IHOP surpassed the comparable quarter for 2021 by 15% and 19%, respectively. On the top line, consolidated revenues rose 13% in Q1 versus the prior year, driven by strong franchise revenues, which grew 14% to $161.2 million compared to $141 million for the same quarter of 2021. For our company restaurant operations, sales increased approximately 10% to $39.4 million for the first quarter compared to $35.9 million for the same period of last year. Applebee's business momentum continued in Q1 with a 14.3% increase versus Q1 of last year and a 26.2% 2-year increase versus Q1 of 2020, representing our fifth consecutive quarter of year-over-year comp sales growth. In the face of Omicron, January comp sales were up 17.6% versus 2021, February sales were up 25.1%, and to close out the quarter, March comp sales were up 5.5% versus Applebee's very strong March of 2021. From a Q1 Black Box perspective, we slightly trailed the CDR category on comp sales versus last year, but this requires additional context given Applebee's substantial overperformance in 2021 and very favorable 2-year and 3-year comp sales results. Given Omicron's impact to start the year, weekly sales dropped to $46,800 in January, volumes then accelerated to $54,800 in February and $57,600 in March, driven by organic demand as well as peak seasonality. In reviewing Applebee's Q1 sales mix, 72% of our business was dine-in, 14% Carside To-Go and 14% delivery, with total off-premise sales averaging between $14,000 and $15,000 per week. Despite the Omicron wave, January comp sales were up 24.9% versus 2021, February up 28% and March up 7.5%, despite rolling over the strongest month in the quarter of last year. Average weekly sales for the first quarter were approximately $36,000, an increase of 19% compared to the same period of 2021. If you can maybe talk about where breakfast sales stands maybe on an average weekly sales basis versus '19 relationship to -- overall, obviously, we still see -- I think my math is down about 5% in the first quarter. I think when you look at the -- like I answered on the first question, when you look at the comp sales, it looked like we dropped off, but that's really in relation to the comp you're rolling over from last year."
}