{
    "symbol": "DIN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 13:46:08",
    "content": " I would now like to hand the conference over to your speaker for today, Brett Levy, Vice President of Investor Relations and Treasury, of Dine Brands Global. Good morning, and welcome to Dine Brands' second quarter conference call. I'm Brett Levy, Vice President of Investor Relations and Treasury for Dine Brands Global, and Iâ\u0080\u0099m joined by John Peyton, CEO; Vance Chang, CFO; Jay Johns, President of IHOP; and John Cywinski, President of Applebee's. During the call, management may discuss information that is forward-looking and involves known and unknown risks, uncertainties, and other factors, which may cause the actual results to be different than those expressed or implied. Please evaluate the forward-looking information in the context of these factors, which are detailed in today's press release and 10-Q filing. We may also refer to certain non-GAAP financial measures, which are described in our press release and also available on Dine Brands' Investor Relations website. Beginning with this release, we have returned to our prior quarterly same-store or comparable store sales schedule, rather than the more recent practice of sharing monthly results, which we believe became temporarily necessary during the peak of the pandemic, given significant month-to-month volatility and uncertainty during the time. So, now, shifting to the quarter, thanks to the hard work of our team members and our franchisees, we sustained strong momentum and achieved another quarter of solid performance in Q2. Our competitive position today remains strong because of what makes us uniquely Dine, and that's our delicious food, our two world class brands, our asset-light business model, and our committed teams and franchisees around the globe. The last few years have showed us how important restaurants are and how more than ever, guests crave connection and community with one another. So, in Q2, both brands sustained and built on last year's momentum. Applebee's and IHOP achieved positive comp sales of 1.8% and 3.6%, respectively, off-premise sales remained strong, in particular relative to pre-pandemic levels, and Dine-in continues to recover. In Q2 Dine delivered strong EBITDA despite higher costs, and we remain comfortable that we will deliver results within our fiscal â\u0080\u009822 guidance range. During the quarter, we returned $61 million in cash to our shareholders, which resulted in the repurchase of over $900,000 shares or about 5% of our shares outstanding. We raised our dividend 11% to $0.51, and we're on plan to meet our development guidance for the year, in spite of lending supply chain and permitting difficulties across the country. This morning, I'll address the operating environment, including cost of goods, consumer sentiment, labor, and pricing, and I'll provide an update on our outlook. First, I'll begin with the acute cost inflation we're experiencing across all inputs to our restaurants. Our brands experienced a 22% rise in commodity costs during the second quarter, but Dine's P&L was not materially impacted because of our asset-light model. And in fact, if the declining gas costs during the last 50 days are sustained, it could serve as an indicator that suggests the potential for improvements for the back half of the year. They're providing flexibility, better work-life balance, and community support to help them retain and attract talent. And at the brand level, Applebee's and IHOP are enhancing back-of-house and front-of-house training and technology to help our team members become more productive. So, while the conditions we're operating in are difficult, we do believe that Dine is positioned well for challenging times. And that's because during past economic downturns, Applebee's and IHOP, both demonstrated resilience. For example, as leaders in the casual and family dining categories, Applebee's and IHOP benefit from consumers trading down from higher priced formats. And as value leaders, both brands have expertise and a proven track record of creating and executing enhanced value and marketing propositions that meet our guests where they are. At the start of this year, we committed to a long-term strategic plan that includes investments in tech development and new sources of revenue, and we're making tangible progress against those goals. For example, we launched the International Bank Of Pancakes, and by year-end, we'll have delivered on our plan to provide a simpler, faster, more agile tech stack across the Dine system. We continue to introduce new restaurant formats, and our teams are working with our franchisees to evolve our restaurants to meet changes in consumer behavior, while also optimizing in economics. And third, we're investing in disruptive new growth channels like virtual brands and ghost kitchens. Finally, Dine's long-term health depends on the health of our franchisees, and our franchisees remain healthy. However, the cost pressure on four-wall profitability is a priority focus, and we will continue to closely monitor the health of our franchisees. Across both brands, franchisees raised prices about 7% to 10% in Q2 on average. And in response to cost and traffic headwinds during the past two quarters, we leaned into advising our franchisees on menu pricing, on cost mitigation, and productivity strategies. Based on our solid first half of â\u0080\u009822, we expect to achieve full year results within the guidance ranges provided on our Q4 call, and reaffirmed after Q1. Of course, we don't know exactly what lies ahead, but what we do know is that we have the focus, the energy, and the commitment of our franchisees and our team members that gives me great confidence and optimism for the future. And then John and Jay will join us to talk about each of the individual brands' performance, momentum, and outlook as well. Despite the economic uncertainty, we're cautiously optimistic on the near-term, and remain confident in our plan over the long term. Consolidated revenues rose 2% in Q2 versus the prior year, driven by rental revenues, franchise revenues, and our company restaurant operations. Franchise revenues grew 1% to $168 million, primarily due to positive comp sales growth at both brands. rental segment margins for the second quarter of 2022 improved by approximately 7% to $7.2 million, compared to the same quarter of 2021. The favorable variance was mostly the results of franchisees higher retail sales, which drove higher percent rental income for the quarter. G&A for the second quarter of 2022 was $44.1 million, compared to $39.3 million for the same quarter of last year. Higher G&A reflects our strategic growth investments, as well as higher personnel-related costs, and travel related to supporting franchisees, as we return to normal operations. For the second quarter of 2022, consolidated adjusted EBITDA was $66.1 million, compared to $71.7 million for the same quarter of 2021, primarily due to greater G&A investments, as well as the impact of inflation on our company restaurant operations. Cash flow from operations for the first six months of 2022 was $29.9 million, and adjusted free cash flow for the first six months of 2022 was $23.1 million. This compares to cash flow from operations for the first six months of 2021 of $106 million, and adjusted free cash flow for the first six months of 2021 of $107.3 million. The variance in year-to-date adjusted free cash flow was primarily due to the change in working capital that we saw in Q1, as discussed last quarter, as well as an increase in CapEx related to our strategic investments. Even after returning $61 million back to shareholders during the quarter, our leverage ratio continues to stay healthy. With our current levels of unrestricted cash on the balance sheet, and the borrowing capacity available under our current credit facility, we feel very comfortable with our current liquidity, and the strength of the balance sheet, both to continue to invest in long-term growth, as well as weathering any near-term uncertainty in the macroeconomic environment. We're currently in the process of refinancing our $225 million credit facility, which will provide us with more flexibility. Dine remains committed to returning cash to shareholders, as evidenced by 11% increase in our second quarter cash dividend to $0.51 per share, which was paid on July 8. Additionally, we purchased 912,992 shares, which is over 5% of our shares outstanding in the second quarter of 2022. We will continue to be opportunistic with share buybacks, which are a key part of our overall long-term strategy to deploy excess cash and increase total shareholder return over time. Lastly, given the uncertain macroeconomic backdrop that we're facing, we're maintaining our current guidance range. I want to highlight that we're still tracking to achieve our 2022 financial performance guidance in G&A, CapEx, development, and EBITDA. Dine is stronger than ever because we played both the offense and defense during the past two years, and will continue to do so going forward. While there are headwinds out there, we believe our asset-light business model, strategic growth investments, and balance sheet, position as well to navigate this challenging environment in the near-term, and deliver compelling growth and shareholder value over the long-term. With that, I'll turn it over to John, who will share more on the Applebee's business. Q2 was an outstanding quarter for the Applebee's brand, as we posted a 1.8% comp increase on top of last year's record-setting 10.5% increase over Q2 of 2019. This 12.3% combined growth, reflects our powerful three-year comp performance, and reinforces the health and stability of the Applebee's brand. I always find it helpful to frame average weekly restaurant sales as a key performance indicator, and Applebee's sales remained quite strong at $54,500 in Q2, compared with $53,400 in Q1. And from a sales mix perspective, Q2 consisted of 74% on-premise and 26% off-premise, with our off-premise business equally split between Carside To G and delivery. From an absolute dollar perspective, weekly off-premise sales we're $13,900 in Q2. In Q2, total beverage, including alcohol and non-alcohol, was 18.5% of sales, a reflection of our dine-in business continuing to grow, providing an important profit contribution to restaurant P&Ls. Youâ\u0080\u0099ll recall, this is the work Applebee's initiated with PwC in 2017 that ultimately delivered 200 basis points of restaurant-level cost reduction throughout 2018 and 2019, which we then suspended out of necessity during the pandemic. Now, on the virtual brand front, we recently made a strategic decision to expand Cosmic Wingsâ\u0080\u0099 menu items from their delivery-only virtual presence, to Applebee's core menu, beginning here in August. broadening the availability of popular products like Cheetos wings, Cheetos cheese bites, and waffle fries to 100% of our guests, will allow us to fully leverage this opportunity in terms of product awareness and velocity. Simultaneously, we are actively exploring other uniquely-positioned virtual brands, and we'll share learnings should these ultimately prove viable through our disciplined test process. Looking forward, we continue to pay close attention to brand attributes, which have proven over time to be reliable leading indicators of Applebee's performance. Not surprisingly, at the top of this list is affordability, where Applebee's continues to lead the casual dining category, as it has for the past five years. One of the benefits of Applebee's tightly aligned franchise partnership, is our ability to activate relevant value propositions as needed on short notice with national media muscle. On a national basis, Applebee's franchisee prices were about 7% higher in Q2 than they were in Q2 of last year. Of course, pricing does not occur in a vacuum in the restaurant industry, and our franchisees remain fully aware of the market share opportunity this current environment represents. Remember, there are approximately 210,000 casual dining restaurants in America, and about 85% of these are low-volume, independently-owned restaurants, with a challenged business model because of their very small scale. It often surprises folks that the top 10 casual dining brands only account for about 4% of total CDR restaurants, and Applebee's is far and away the largest, with 1,570 units. As I've stated previously, brands and franchisees with scale and strong culture, who have earned the trust of their guests throughout COVID, and have demonstrated the ability to be both innovative and nimble, will win big over the long haul. In summary, the state of the Applebee's business remains healthy. Last quarter, the IHOP team and franchisees made great progress against our plans, reinforcing the strength and resiliency of the IHOP brand. Average weekly sales for the second quarter were approximately 37,900, an increase of 4% compared to the same period of 2021. Off-premise sales volumes were approximately $8,300 compared to last quarter, which was $8,900. For Q2, our to go business accounted for 21.3% of sales, broken down into 12.9% delivery, and 8.4% takeout. The team is continuing to work on ways to evolve and innovate what we offer on the to go menu, how we market it, and improving profit dollars in that segment as well, all of which will pay long-term dividends for the brand and our franchisees. The IHOP brand and our franchisees also work with PwC, which delivered nearly 100 basis points of restaurant-level cost reductions throughout 2018 and 2019, until we also paused the work due to the pandemic. In regard to virtual brands, they're delivering incremental sales and profits in the more than 1,000 restaurants offering one of our brands, Thrilled Cheese or Super Mega Dilla. After just four months, we have more than 2 million loyalty members earning PanCoins, 30% of whom are new to our brand. For over 60 years, IHOP has been serving up smiles, and this new distinctive advertising is reconnecting guests with remarkable cultural moments and our core menu. This summer, we also executed a fantastic promotion with Universal Studios and Illumination, Minions, The Rise of Gru, which premiered on June 20. given Minions is a movie franchise that gen Z grew up with, we're spending more media dollars on platforms like TikTok, which is driving viral content supporting the new menu. To enable our long-term growth and enhance the experience for both our guests and team members, we're also doubling down on technology. We also relaunched a brand-new version of our website and mobile app, and we're currently in the national launch of our new point-of-sale platform. We're currently in over 100 locations, and weâ\u0080\u0099ll be transitioning restaurants for the remainder of this year into next. We've opened 16 new restaurants domestically this year, and have a pipeline that's moving through the various development stages to help support our 2022 plan for new restaurant openings. Despite the continued supply chain challenges and increasing commodity costs, we're still within our guidance of 50 to 65 net new restaurants, and on track to grow our non-traditional footprint by 80% this year as part of that plan. And last month, we announced a very exciting new partnership in Saudi Arabia to open five new IHOPs there over the next five years. At IHOP, we know that we have a great opportunity to provide people across America with a sense of togetherness and belonging, something folks have been missing these past few years and will always need. We're excited by the progress we've made, and understand the work we have ahead of us for driving growth, regardless of the macro backdrop. Thanks Vance, and John, and Jay, for the work that you, your franchisees and your teams did this quarter to deliver solid results, and for continuing to focus on our long-term strategic plan and the initiatives to make sure that we achieve our goals. Your line is open. I know you stopped giving monthly same-store sales, but I think you noted that you have been seeing signs of an economic slowdown over the past quarter. And the second thing is, we're encouraged by things like the recent 50-day trend in the decline of gas prices, right, and the emerging opinion that inflation seems to have peaked in June. Just wondering whether that early line of sight is still there, or maybe there are some challenges with permitting construction equipment, things like that that we've heard across the broader industry. That said, we're on track for our development plans this year and our pipeline for next year remains encouraging. I think, Jay, if you can give some detail, and then John on each of your brands, that'd be great. We're doing more retrofits and turning restaurants that were preexisting to some other brand, into an IHOP. Please stand by for our next question. Your line is open. You're coming up against some really tough comparisons in the third quarter as you lap Fancy Like, which I believe took off around this time last year. But I'm looking right now at my balance of year tactical plan, and it's lined up very well in this environment. And just on that flexibility comment, we're hearing from a number of chains, both in full service and click service, that are beginning to lean more heavily into value. So, perhaps you could talk a little bit more about what that means and how you're thinking about doing value on a broader scale. Hey, Eric, itâ\u0080\u0099s John P. I'll make a quick general comment, and Jay and John will give you examples, which is, both of our brands, right, as you guys all know, our brands that position themselves as value-oriented brands, they're known for it, and they both anchor their segments. In normal times, they're known as value-oriented brands, which we define as delicious food, generous portions in a wonderful environment at an affordable and approachable price. And at times like these when the economics are tough for our guests, our brands have particular expertise in knowing what additional value-adds that they do that move traffic, and they both had success with that last quarter. And as we think about tactical execution around value, and again, we're the affordability leader within the category, there are a number of ways to do that. If you think about it, right now, we have, IHOPPY Hour, which is kind of our everyday value that is over 85% of our restaurants across the system. And that's there all the time for people that need to save a little money, or maybe they're pressed because of gas prices, et cetera. Please stand by for our next question. Your line is open. I do expect the level of aggression from a marketing perspective, and specifically marketing spend, national and local, to accelerate this year and next in the post - excuse me, kind of post-COVID environment. They kind of look at their business, they make personal decisions about what they think they need to do to try to maintain market share, or steal market share in this kind of economy, and we're no different. If you're comparing cash flow to last year because of the growth in the business in comparison to 2020, last year we had a one-time working capital benefit from the collection of the deferrals and royalties. but additionally, as you recall, we did have a one-time working capital hit from just our larger compensation - performance compensation expense that was paid in 2022, but it was part of 2021 P&L. Please stand by for our next question. Your line is open. We're still staffed at about 90%, but if you think about it, we're adding on a lot of extra day parts and hours in some of these restaurants. As I said, we're at 91% of our restaurants opening pre-pandemic hours. There's still quite a few more to go to get back all the way to that level, but we're working on it a little at a time, and reporting and obviously better. I know you'd potentially talked about a little more detail with the platforms broadening out on what you thought that business could be, but now you're also rolling it on the Applebee's menu. So, a little bit more time on maybe what the performance was through the aggregator channels as you broadened it out, but then also the thinking behind bringing the Cosmic brand onto the Applebee's menu. One of the challenges from my perspective with that particular virtual brand, is the fact that it's only available to about 13% of our guests via delivery. We wanted to expose those products to 100% of our guests, not just delivery, but also to go, and certainly our dining room guests. Our franchisees have embraced it, and that's going to happen here shortly in August. Please stand by for our next question. Your line is open. Just a question on Applebee's, specifically the drive-through pickup windows you first brought up at the Investor Day, and I think you were planning to have 15 done by year-end. As to whether we obtain 15, I don't know quite honestly, because those are driven by local municipality approvals, and it can be complex to carve out a drive-through lane and build out a pickup window on an existing lot. So, that investment cost can range from %75,000 to $150,000 plus, depending upon the market and circumstance. Once we have a good healthy 10 to 20 in market, we'll assess the business case and certainly share our view from not only a guest and team member perspective, but a financial perspective in the future. It seems like the dine-in sales per week, they made a lot of sequential progress in the quarter, but theyâ\u0080\u0099re still decently below 2019 levels, I think. The total business overall, we're back to about 97% of our total business sales compared to pre-pandemic. So, we've made great progress in recovering that business, and it keeps growing every quarter. Obviously, I think it's a little bit of everything. Obviously, the staffing was an issue with the weekends for a long period of time, because that's when you're absolutely at your peak. But overall, we're very comfortable with the recovery we're doing across the entire business and maintaining our off-premise sales pretty steady clip as well, even as guidance coming back. Please stand by for our next question. Your line is open. I wanted to circle back on the health of the US consumer, and you obviously have a pretty unique perspective operating two of the largest full-service brands in the industry. So, I guess I'm curious if you're seeing changes in frequency in any particular cohorts or income bands, or any changes in behavior once the customer is in the restaurant. Hey, Brian, itâ\u0080\u0099s John P. I'll take that because what we're seeing is very similar in terms of consumer behavior at both of our brands. The middle cohort is flat to up a couple of points, and the 75,000 plus is up significantly, six to eight points, which suggests to us that guests that often dine at more expensive restaurants, are finding Applebee's and IHOP because of their well-known value position, right, which is why we perform well during tough times like this. But technically, if you think about it, the model, from your perspective, should be simpler going forward, assuming that the transaction closes, since we're going to be back to the 100% franchise (slide) model. I think you held the guidance for the year, and that guidance implies a meaningful step-up in spend versus the first half. But primarily, we're investing in restaurant technology and marketing and business analytics systems. Please stand by for our next question. Your line is open. And John C, I think you mentioned that Applebeeâ\u0080\u0099s was running about 7%. Jay, I'm wondering if you could just confirm that the 7% to 10% that was mentioned earlier, pertains to IHOP, meaning that IHOP pricing is about 10%. And then for both brands, if you could just comment on your appetite for further pricing increases in the back half of the year, I assume you'd be reticent, given the value position, but any comments there would be helpful. There's a range, obviously, that franchisees take based on their own decisions on what they're going to do. At IHOP, we actually utilize RMS, which is an (outside) that helps franchisees with how they think about what prices to take by markets, et cetera. They know that they need to cover some of this cost pressure that they have, but they also know they're finding a share war and traffic battle during this time as well. They're playing the long game, and they're not going to do anything to compromise guest affordability and perceptions of the brand. So, Jay, if you can just give us - it feels like we're seeing 10% menu price increases, but as a whole, 22% commodity cost inflation, and I would imagine still very high labor inflation. And if you can share anything that would help us feel confident of the health of the franchise system on the IHOP side, maybe percentage that are also kind of multi-concept franchisees, any other details that would just give us some copings that the franchisees are going to get through the near-term in one piece here. If you think about things, I think that Vance mentioned earlier, is that we're not seeing bad debt. We actually, if you - again, one of the biggest indicators, if you think about it is, we reconfirmed our guidance on 50 to 65 net new restaurants right now. Breakfast has a food cost that's several points less than a lot of other kind of dine-in restaurants, et cetera. So, while food cost goes up, you're off a smaller base thatâ\u0080\u0099s going up, and a lot of the increases this year for us, eggs in particular was really a problem, and that was driven a lot by the avian flu, which is pretty much behind us now in the summertime. So, there are some circumstances that are continuing to improve, and we're very confident franchisees are in pretty good shape. And I'll just emphasize that both Applebee's and IHOP are resilient brands that are really positioned well to perform, not only in good times, but also in tough times, because they really are safe havens for consumers at times like this. So, thanks to Vance, Jay, and John for a great quarter, and welcome one more time to Brett, who I know many of well, and we're looking forward to him working with you over the next couple of quarters."
}