{
    "symbol": "BBW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-26 12:10:06",
    "content": " Total revenues were the highest for a first quarter in our company's history, with growth in both North America and Europe, and all reported business segments, including direct-to-consumer, commercial and franchising business, as well as in both net retail sales and digital demand. And importantly, we continued our trend of record breaking profitability for the fifth consecutive quarter with pre-tax income of over $18 million representing an increase of 38% over last year's previous all-time high. Revenue growth was broad-based across channels, both retail and digital, geographies and business segments, approximately one-third of the total revenue increase was related to our European locations that are open for the full quarter this year versus being closed for majority of first quarter last year. We expect to see some relief in transportation cost in the second half of this fiscal year, which is reflected in our full year guidance  SG&A was $43.6 million, up $8.4 million from the first quarter of fiscal 2021, an improvement of 130 basis points as a percentage of total revenues. The highest level pretax income for the first quarter in Build-A-Bear's 25-year history, handily exceeding last year's order record setting first quarter pretax income of $13.2 million. Inventory at quarter end was $77.4 million, an increase of $33.6 million versus the end of last year's first quarter. Based on our strong first quarter performance and positive trends and outlook, we are introducing fiscal 2022 guidance, which includes total revenues in the range of $440 million to $460 million, as compared to $411.5 million in fiscal 2021. So if you run that math forward based on what you guys reported today, I'm getting new and obviously, you shouldn't guide to this because there are a lot of moving pieces, but the flip side of that is things seem to be getting better, not worse, but I'm getting over 350 in earnings this year, and the stock today is sub-$20 and I'm happy you guys bought $14 million of stock in the quarter, but the dislocation here is so pronounced that I would encourage you guys to be more aggressive with the buyback and maybe do more than the 25. Now some of the timing with Q2, Q3 last year, UK stores open late Q1, so there was some of that pent-up demand, some of the impact that we have seen, and so that definitely we believe did help some sales in that particular region, but typically speaking, if we start using prior to COVID our seasonality Q1 was the second biggest quarter of the year, after Q4."
}