{
    "symbol": "BBW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-30 12:41:23",
    "content": " Specifically highlights of the quarter includes, total revenues of $104.5 million an increase of nearly 10% over the fiscal 2021 third quarter, even with a unfavorable impact of foreign exchange of over $2.5 million. Although the multigenerational 25-year history and expertise of Build-A-Bear began in the brick and mortar space, we recognized the significant trend to online shopping, especially during the pandemic and had simultaneously capitalize on the digital opportunity in e-commerce and our expanded omnichannel foundation, while leveraging our high-level of lease optionality to drive profitability in physical stores, which positions us for further growth across multiple channels. He drove our over $4 million in commercial revenue in the 2022 third quarter and $12 million dollars year-to-date, an increase over the prior year approximately 50% and 60% respectively. The retail revenue increased 8.3% from the fiscal 2021 third quarter with strength in retail store sales, more than offsetting a decline in digital demand as consumers adjust shopping behavior between in person and online. We delivered pre-tax income of $9.9 million, an increase of 25.3% from the third quarter last year, even with the impact of approximately $2 million in incremental freight costs and 400,000 in unfavorable currency exchange. Total revenues were $322.8 million, representing growth of 14.6%, compared to the fiscal 2021 first nine months, pre-tax income was $35.7 million, an increase of $16.7 million, compared with the first nine months of fiscal 2021. And we believe that, we are in a position for further expansion not only with the fact that, we have mentioned multiple times and multiple calls that there is really no data that implies that we are over stored in North America and certainly not in other countries, particularly now that, we have created this more integrated approach to retail but that we have opportunity to then raise the water level with all of these other initiatives that engages with our consumers across multiple touch points, whether that's retail, to gifting, to the pajamas, to watching movie on Netflix, to posting something online that goes viral on their own, that UGC, user generated content is an important piece of our brand, because we are so emotionally connected and again woven into the fabric of their lives."
}