{
    "symbol": "LAD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 14:36:04",
    "content": " As Bryan indicated earlier, we are reaffirming our guidance of the future state expectation, the DFC can add $650 million in earnings to Lithia and Driveway, again predicated on DFC's portfolio fully seasoning after maintaining a 20% penetration rate on Lithia revenues at our 2025 plan levels of $50 billion. Please proceed with your question. Please proceed with your question. I think we, at Lithia and Driveway, tend to play the long game and look -- take a longer view at things and look at that what we're seeing over the next few quarters as there's a more normalization of GPUs, that it's just a short-term part of the game and we do know that our original design was basically built on the fact that we are a lower margin business with a little bit higher SG&A costs and a lot of businesses. And now we're going into a little bit more volatile environment where we have a few more balls to juggle, but ultimately, the outcome of what we've designed with Driveway financial, with Driveway.com, that can obviously have lower SG&A costs in a traditional business and the other businesses that we're thinking about are there to really help relieve some of the stresses of a low margin business. And I think, though, we've -- we breached the -- probably the $40 in EPS target that was caused by market conditions that I believe weren't expected in our original 2025 plan that was announced 2.5 years ago, okay? Please proceed with your question. So when we begin to think about our growth and our ability -- whether we buy or whether we build, I think there's a good argument to be made that we could look at CRM systems or possibly DMS systems or those type of things to glue things together a lot cleaner to be able to share data on both customer platforms and other stuff to really maximize the experiences throughout the life cycle of the consumer. Please proceed with your question. I think the way that we look at 2023, we really believe that because of the pent-up inventory that we are really looking at the environment's most likely scenario is about a 3% to 5% increase in both new and used SAAR levels, okay, which is going to put you into a little over $14 million and a little over $42 million unused and really basing our expectations on that. And it's something that we've come to realize over the last 3 years of growth, buying bigger stores, but those top 10% have around 43% SG&A as a percentage of gross. Please proceed with your question. I think the advantage in our design over many of the used car retailers that really don't have the ability to absorb this equity because I think what we are all saying is at some point, there's going to be a greater amount of disequity and a portion of the consumers now sitting at around a quarter of the consumers have transacted over the last 3 years that disequity is going to push people into new car dealerships, which is a massive advantage. Please proceed with your question. Please proceed with your question. And if certain products are eliminated, there's usually other products that will be out there in the future for hybrids or for electric vehicles where we are reconditioning cars or most importantly, we really believe that F&I becomes the conduit for subscription services that help create a bond with a consumer that's in home or there's a more convenient experience than what they're looking for of coming into dealership and whatever happens with the CFPB. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}