{
    "symbol": "LAD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-20 17:01:02",
    "content": " We grew revenues to $7.2 billion, a 21% increase year-over-year, driven by continued performance of our Lithia stores, Driveway and contributions from our newly acquired stores. Starting with efficiency and operating leverage, we assume: achieving a blended market share of 2.6% in the U.S. across new and used vehicles; total vehicle GPUs returning to pre-pandemic levels or around $2,100 per vehicle; lowering SG&A as a percentage of gross profit towards 60% through operational improvements, resulting in greater efficiency across our footprint. Secondly, our expansion plans target acquiring an incremental $9 billion to $10 billion in annual revenue to complete the build-out of our North American footprint of 400 to 500 locations; integrating Driveway into an omnichannel solution and reaching profitability; continued headwinds around DFC's profitability due to building CECL reserves as we scale towards a 15% penetration rate on our loan portfolio; contributions from adjacencies with higher pretax margins and operating leverage resulting in a lower base of SG&A-related expenses. To put some context behind this statement, we assume the following: Driveway and GreenCars generating 15% to 20% of our total revenue; up to 20% of all vehicles sold by Lithia & Driveway will be financed through DFC, building out our complementary profit stream without any additional spend to acquire customers. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And I think it's important to remember in affordability that when people are buying new vehicles, their used cars are so highly valued that the delta between the trade-in and the vehicle they're buying when the new vehicle is capped at MSRP and the used vehicle is uncapped is quite lucrative for the consumers. I mean, we have examples of some consumers that bought cars -- new cars from us within the last year, 1.5 years, and they've now turned around and sold those same cars either on trade-in or direct sales for something north of $5,000 to $10,000 more than what they paid because they're really playing a commodity almost on their transportation needs. Please proceed with your question. Please proceed with your question. But ultimately, we're pretty confident that we can get our operational part of the business to that 62% SG&A as a percentage of growth with knowing that if Chuck can tone back our growth rates a little bit on DFC, that we can get those to profitability in three to four months typically. So though we know that, and today, we sit at about 35% of consumers have this equity and it's around $2,000 of this equity, they also have now over $2,000 of cash down, okay, which is a vast difference from what we are normally at pre pandemic, okay, where we saw 71% of our consumers with this equity averaging $5,100, average cash down of only $1,800.So, you're talking about a $3,500 delta so there's probably 25% of consumers that could have something a little north of that. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}