{
    "symbol": "TTWO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-16 20:08:04",
    "content": " In addition, Rockstar Games launched GTA+, an all-new membership program that's exclusive to Grand Theft Auto Online players on PlayStation five and Xbox Series X/S consoles whereby participants can receive a range of valuable player-friendly benefits, including a monthly deposit of GTA dollars and other bonuses designed to help players experience everything Grand Theft Auto Online has to offer including access to major content packs like last holiday’s The Contract. Dragon City and Monster Legends delivered a solid finish to the year, supported by enhanced live operations; WWE SuperCard has now been downloaded more than 26 million times and remains 2K's highest grossing mobile game; and, NBA 2K Online in China outperformed our expectations. On a standalone basis, for fiscal 2023, we expect to achieve a new record of $3.75 billion to $3.85 billion in net bookings, as we plan to deliver many exciting releases during the year. Our labels will continue to provide new content and experiences that drive engagement and recurrent consumer spending across many of their hit franchises, including NBA 2K, Grand Theft Auto Online, Red Dead Redemption Online, WWE 2K, Tiny Tina's Wonderlands, OlliOlli World, and more. We expect recurrent consumer spending to be flat compared to fiscal 2022, and represent 58% of net bookings, which is down from 64% last year due to a greater number of new releases. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please, proceed with your question. Please, proceed with your question. Please proceed with your question."
}