{
    "symbol": "GNLN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-04-03 19:41:06",
    "content": " Our plans are to reduce SG&A by another 40% from Q4 2022 to Q4 2023 through continued cost-cutting reductions and potential realizations, the estimated $13 million in working capital improvements this year should allow the company to go much further by reducing the overall burn rate and inflecting into profitability. For the year, ending, December, 31, 2022, total net sales were approximately $137.1 million, compared to approximately a $166.1 million for the year ending, December, 31, 2021, representing a decrease of $29 million or 17.4%. For the year ending December 31, 2022, gross profit was $24.9 million, compared to $33.8 million for the prior year, representing a decrease of $8.8 million or 26.1%. The company reported gross profit of $5.9 million and gross margin of 26.7% for the three months ending December 31, 2022. Sales, general and administrative SG&A expenses increased $66.2 million or 76.5% for the fiscal year 2022 to $152.7 million, compared to $86.5 million for the prior fiscal year. Excluding goodwill and indefinite lived intangibles impairment charge of $71.4 million for fiscal year 2022, SG&A expenses decreased 5.2 million or 6% to $81.3 million, compared to $86.5 million for the prior year. Net loss for fiscal year 2022 was $125.9 million, inclusive of a $71.4 million intangible asset impairment charge, compared to a loss of $53.4 million for the prior year. Adjusted EBITDA for fiscal year 2022 was a loss of $31.8 million, compared to $22.3 million for the prior fiscal year. We ended the year with $12.2 million in total cash with $5.7 million restricted, working capital of $41 million, compared to $53.8 million as of December 31 2021. The company entered a new loan facility for $15 million during the year to support our working capital needs and recently reduced this debt in February of this year by 40% to $8.5 million, while also receiving $4.8 million from the sale of its employee retention credit. One, in Q1, we expect 5% to 10% growth in revenue versus Q4 in the $23 million to $24 million dollar range with strength coming from our Consumer Goods segment, which saw an increase greater than 10% versus the prior quarter."
}