{
    "symbol": "GNLN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 12:07:06",
    "content": " Please go ahead, Nick. Shortly after doing so, we were able to secure an asset based loan for $15 million from an institutional lender, which will provide the company with non-dilutive financing to help support our working capital needs as we make progress on our overall plan to become the premier house of brands business in the ancillary cannabis marketplace. Looking to the company's balance sheet, the company significantly reduced third-party inventory and vendor deposits by $13.1 million in the first half of 2022, as we transition away from select lower margin third-party brands and the associated working capital requirements. Please go ahead, Nick. Now we're looking at selling the packaging business, which is going to dramatically reduce our costs and it's going to put us in a position where we don't need the revenue to be where we originally thought it needed to be, to be profitable. Please announce your affiliation, then pose your question. So just want to see, how that view is now with some of the recent changes that you've made and maybe some updates you could give particularly on the Amazon front would be really helpful with now you're looking to divest the packaging business as well as with the 5% that was big on the C-Store front there. Please announce your affiliation, then pose your question. Please announce your affiliation, then pose your question. I just kind of get a sense of the mindset around the, when I think about the two businesses, I think about the brands, the house brands thing is more of a potentially more volatile, in other words, that is, like, kind of, hit based where if you get a couple of products, they may just start working well, you can really, see a revenue ramp. Please announce your affiliation, then pose your question. So as we look to design new products, we're going to look to design them in a very cost efficient way knowing that if we can produce newly designed products at a lower cost, that's going to enhance our gross margin and we are very focused on bringing high gross margin revenue into this business."
}