{
    "symbol": "FCX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 13:52:05",
    "content": " Welcome to the Freeport-McMoRan conference call, and happy 2023 to everyone. Earlier this morning, we reported fourth quarter 2022 operating and financial results, and a copy of our press release and slides are available on our website at fcx.com. Our conference call today is being broadcast live on the internet, and anyone may listen to the call by accessing our website homepage and clicking on the webcast link for the conference call. Before we begin our comments, weâ\u0080\u0099d like to remind everyone that todayâ\u0080\u0099s press release and certain of our comments on the call include forward-looking statements, and actual results may differ materially. On the call today with me are Richard Adkerson, our Chairman of the Board and Chief Executive Officer; Maree Robertson, our CFO; Mark Johnson, our Chief Operating Officer of Indonesia; Josh Olmsted, who is our Chief Operating Officer for the Americas; Mike Kendrick, who leads our molybdenum business; Cory Stevens, who heads our Engineering and Construction and overall Global Technical Services Group; Rick Coleman, who is actively involved in all of our construction projects, as well as Steve Higgins, our Chief Administrative Officer. And weâ\u0080\u0099ll start -- Richard will make some opening remarks, and then heâ\u0080\u0099ll turn it back to me and weâ\u0080\u0099ll cover the slide materials, and then weâ\u0080\u0099ll open up the call for your questions. It reflects the performance of our global team, and I much appreciate everybodyâ\u0080\u0099s hard work. I read one of you said this morning in a report, mining is a tough business, and it certainly is. But what weâ\u0080\u0099ve done and is reflected in our results for 2022 and particularly the fourth quarter, is remarkable. Most of you, who know our business and maybe all of you do, recognize the need to look at Freeport into two major segments. Our operations in Indonesia by PT Freeport Indonesia is characterized by very large volumes, very low cost because of the grades and the gold content, largest gold mine in the world is a byproduct. As youâ\u0080\u0099ll see in the fourth quarter, it operated as the worldâ\u0080\u0099s second largest copper mine with a net unit cost of $0.06 a pound. We have among the largest mines in the world, the mines have low grades, thereâ\u0080\u0099s much more material to be processed, to be mined in process to recover the copper, and itâ\u0080\u0099s an operation that gets challenged by low copper prices and factors like inflation. But when you look at the results and what our team has done this year, itâ\u0080\u0099s been very positive. Itâ\u0080\u0099s also characterized by having some large future brownfield expansion opportunities, which is particularly meaningful given the situation of the copper in the world. We completed mining the Grasberg open pit, which had been the bulk of our operations since the discovery of the ore body in the late 1980s. And for years, this transition was viewed as a risk overlying Freeportâ\u0080\u0099s business. And itâ\u0080\u0099s all results of the hard work and accomplishments of our team there, very proud of them. The Americas business has done very well in meeting the challenges that weâ\u0080\u0099ve had there, dealing with inflation, dealing with a period of low copper prices, we have issues that are challenged in terms of getting workers for our operations in the Americas. We are continuing to manage housing, feeding our people and continuing our operations. We are slowing down a bit to make sure we have supplies for the long run, but we have support by our workforce and fundamental support for our business by the local community there because weâ\u0080\u0099ve established such a great relationship with them. But we are on the outlook for the well-known risks that the world faces today, and weâ\u0080\u0099re prepared to deal with it. And we -- everything we do is focused, not on the short run other than to protect ourselves by having a strong balance sheet, managing our business in the right way, but our success is going to be measured over the long run. We committed to copper 20 years ago when we were a single asset company, the rationale for acquiring Phelps Dodge more than 15 years ago is being reinforced today by the combination of this really special mine we have in Indonesia and the global operations and growing operations that we have in the Americas. Weâ\u0080\u0099ll start on slide 3, which summarizes our performance for the full year 2022. With average copper realizations in the fourth quarter of $3.77 per pound, we generated strong margins with fourth quarter adjusted EBITDA at approximately $2.25 billion. Looking at the year, we are proud of the performance of our team stayed focused on effective execution and on driving results in a volatile macroeconomic environment. After successfully growing our volumes in 2021 by 19% for copper and 59% for gold compared with 2020, we achieved another year of growth in 2022, with 11% higher copper sales volumes and a 34% increase in gold volumes. Our team in Indonesia has successfully and materially grown production levels and a sustaining large-scale, low-cost production at the worldâ\u0080\u0099s largest underground mining complex. In the Americas, our teams in Peru and Chile proved resilient in restoring production during 2022 that had been impacted by the pandemic. For the year, we generated $9.5 billion in adjusted EBITDA, and that was a year of dramatic swings in commodity prices and cost drivers. Our operating cash flows for the year, which were net of $1.5 billion in working capital requirements was in excess of our capital investments in our operations, and we nearly tripled our cash return to shareholders, pursuant to our performance-based payout policy. We ended the year with net debt, excluding the debt associated with our smelter of $1.3 billion, and thatâ\u0080\u0099s substantially below the level of mid-2021 when we initiated our performance-based payout policy. On slide 4, youâ\u0080\u0099ll see weâ\u0080\u0099ve listed notable accomplishments during the year. In addition to driving value in our operating and financial areas of achievement, weâ\u0080\u0099re very proud of our work with third parties to validate all of our operations under the Copper Mark standards, the measurable progress weâ\u0080\u0099re making on our climate initiatives and the expanded disclosures weâ\u0080\u0099ve developed to enhance transparency and accountability. Weâ\u0080\u0099ll talk about markets next, and weâ\u0080\u0099ve got a slide on page 5. We experienced significant volatility as many of you have seen during 2022, with copper prices trading from a high of $4.87 per pound earlier in the year, falling to $3.18 per pound midyear and partially recovering to $3.80 per pound by year-end. The facts are that the physical markets for copper have remained tight even during a period of weaker economic data coming out of China, and thatâ\u0080\u0099s evidenced by the low levels of available copper inventories throughout the year. At the same time, copperâ\u0080\u0099s importance in the economy continues to grow as a result of the intensity of use in clean energy applications and the global acceleration of electrification. The ability of the industry to meet this multiyear period of growing demand continues to be challenged, leading to large market deficits in the future. You read about these challenges every day, and itâ\u0080\u0099s getting harder, not easier, higher long-term prices are needed to incentivize new supplies. Weâ\u0080\u0099ve effectively managed our operations and balance sheet during periods of volatility, and weâ\u0080\u0099re prepared for this, but we believe the long-term fundamentals point to a real step change in how copper is valued in the economy. Our strategy, as Richard discussed, is centered around being foremost in copper. We added twice the amount of reserves we produced in 2022, principally at our U.S. mines in the Morenci and Safford Lone Star districts where weâ\u0080\u0099re focused on future growth. In addition to proved and probable reserves, we have enormous mineral resources of 235 billion pounds of copper. Over half of this is located in the U.S. where we have established operations, a great track record and a valuable franchise. And on slide 7, weâ\u0080\u0099ve got some information about our molybdenum business. And with the price move over the last couple of months of over 50% in molybdenum, we thought youâ\u0080\u0099d be interested in learning more about our business. We produced 85 million pounds of molybdenum in 2022, and thatâ\u0080\u0099s comprised about 60% from copper mines as a byproduct and the balance from two primary molybdenum mines that we operate in Colorado. So, we note on this slide, the impact of a $5 change in molybdenum prices, itâ\u0080\u0099s material at $400 million in annual EBITDA and $375 million in cash flow. And the recent move of over $10 per pound, if sustained at a higher price, adds additional leverage to our results. Looking at our operating stats for 2022 on slide 8, youâ\u0080\u0099ll see our sales for the year were about 35% from the U.S., 28% from South America and 37% from Indonesia. In the U.S., our sales were similar to 2021 levels, and we grew sales volumes by 10% in South America and by 20% in Indonesia. In the U.S., weâ\u0080\u0099re continuing our focus on productivity, given the current limitations on adding to our workforce, weâ\u0080\u0099re taking advantage of technology advancements and opportunities to expand production from leaching at low incremental cost, and weâ\u0080\u0099re planning our next phase of growth, as weâ\u0080\u0099ll talk about in a few minutes. As discussed, the biggest resource position and source of long-term growth we have is a real opportunity in the United States. In South America, both Cerro Verde and El Abra grew production in 2022 in a complex social and political environment. After successfully recovering from the pandemic-related interruptions in 2022, our team in Peru is now dealing with challenges associated with civil unrest that youâ\u0080\u0099ve all read about. To date, the impacts have not been significant but the situation is dynamic day by day, and weâ\u0080\u0099re watching it very carefully. As weâ\u0080\u0099ve talked about on prior calls, we experienced significant inflation pressures across the business during 2022, particularly for energy and other commodity-related consumables, and in the second half of the year, started to see inflation from a rising cost of materials, supplies and services. The situation started to improve in 2022 with a number of the commodity-related consumables, but weâ\u0080\u0099re still dealing with costs in excess of historical levels. If you look at the average cost for the year at Grasberg of $0.09 per pound is remarkable, particularly in the context of this cost environment. Richard talked about the significant success story of the Grasberg transition, and weâ\u0080\u0099ve got some details on slide 9, significant success for not only Freeport but also something for the global mining industry to be proud of in the country of Indonesia. We started planning for this transition over 25 years ago, and the team has just done an outstanding job. We benefit from the fact that several from the team who were involved in the planning of this project, including Mark Johnson, whoâ\u0080\u0099s on this call, stayed with it over this period. And over the years, weâ\u0080\u0099ve added great talent to our team with experts from around the world. The success of this project, the mutual respect built over the years between Freeport, the government of Indonesia and local communities has established a really strong foundation for the future. If you go to slide 10, weâ\u0080\u0099ve got an update on our smelter project. And this is our key feature of our commitment to the Indonesian government, was to expand domestic copper smelting and refining capacity in Indonesia. Weâ\u0080\u0099re making really good progress on constructing the new smelter in Eastern Java, itâ\u0080\u0099s near our existing smelter, PT Smelting at Gresik. As you recall, the capital investments for this project are being funded from a successful bond offering that PT-FI completed during 2022. Weâ\u0080\u0099re able to share experiences, new technologies, operating synergies and best practices across the portfolio as we develop projects, and we can direct capital across the portfolio to the highest value opportunities. And importantly, weâ\u0080\u0099ve earned a track record and a reputation for operating sustainably and responsibly. The world, we believe, is going to need all of our projects and more. The economics are compelling, low capital intensity, low incremental operating costs and a low carbon footprint. Weâ\u0080\u0099re continuing our work to apply covers to the leach stockpiles because of the benefits that you get from heat retention in enhancing recoveries, and weâ\u0080\u0099ve identified new areas that were not pursued historically. At our Bagdad mine in Northwest Arizona, weâ\u0080\u0099re progressing a feasibility study to double production at that site. We expect to complete the feasibility this year, and weâ\u0080\u0099ll be in a position to assess options on how we time the future development. We started advanced planning to commence construction of a new tailings site that would support the existing operation, but would also provide flexibility for the expanded production. And weâ\u0080\u0099re really in the early stages in the development of this mine, as we mine the oxide ores more quickly, weâ\u0080\u0099re opening up the opportunity for a major sulfide development long term. Youâ\u0080\u0099ve seen the numbers, 50 billion pounds of potential resource here. And importantly, itâ\u0080\u0099s located in an established mining district in the U.S. In Chile, weâ\u0080\u0099ve defined the opportunity for a major expansion at our El Abra mine. As we continue to monitor regulatory and fiscal matters in Chile, weâ\u0080\u0099re planning a project to invest in infrastructure, water infrastructure to provide flexibility to extend existing operations and optionality to support a new concentrator. Weâ\u0080\u0099re also planning at El Abra to test new leaching technologies in the near term, to evaluate the potential for expanded leach production and possibly competing technologies to a concentrator. And as we talked about, we achieved two years of growth in copper sales. And currently, our forecast reflects sales in the â\u0080\u009823 to â\u0080\u009825 period that are similar to 2022 levels. And so, a portion of our production will be inventoried until itâ\u0080\u0099s processed and sold through our smelters. In the reference materials on slide 30, we provide information on our 2023 sales by quarter. But, you can see the balance of the year is fairly stable at over 1 billion pounds of copper sales per quarter. Moving to the cost outlook for 2023, weâ\u0080\u0099re providing guidance of average cost of $1.60 per pound for the year. We show a comparison to the two years, and youâ\u0080\u0099ll see the site production cost line item is about 4.5% higher than the 2022 average. And thatâ\u0080\u0099s a result of assumptions that weâ\u0080\u0099ve made in our forecast for higher average electricity and coal costs compared with the 2022 average and also higher power requirements, principally in Indonesia, and the impact of higher cost of equipment components, supply costs and labor cost increases. So, if current prices hold, would have roughly $0.10 a pound less cash -- unit net cash costs and this reflects. In recent months, inflationary pressures have been less severe than we experienced during 2022. Weâ\u0080\u0099re continuing to pursue technology-driven enhancements to mitigate the impacts, particularly in the U.S. Getting to our cash flows, significant leverage to copper prices. Weâ\u0080\u0099ve got on slide 14, we show modeled results for EBITDA and cash flow at various copper prices ranging from $3.50 per pound to $5 per pound copper. These are modeled results and we use the average of 24 and 25 with current volume and cost estimates and holding gold flat at $1,900 per ounce and molybdenum flat at $20 per pound. And youâ\u0080\u0099ll see here that annual EBITDA would range from nearly $9 billion per annum at $3.50 copper, to $15 billion per annum at $5 copper. With our long-life reserves and large-scale production, weâ\u0080\u0099re well positioned from future -- to benefit from future metals intensive growth trends with prospects for increasing cash returns under our performance-based payout framework. The capital expenditures totaled $2.7 billion, excluding the smelter in 2022. Weâ\u0080\u0099ll note that this was lower than the $3.3 billion estimate we provided going into 2022, and that reflects lead times and our focus during the year to prioritize critical projects. The current forecast for 2023 totals $3.4 billion, and thatâ\u0080\u0099s a slight change from our previous estimate of $3.3 billion for 2023. We always are very careful in managing our capital cost to maintain flexibility in response to market condition, while ensuring that our investments are sufficient to support a reliable long-term production profile. Returning to the financial policy that we began to implement in the second half of 2021, itâ\u0080\u0099s really centered on three priorities. Since commencing the performance-based payout policy in the second half of 2021, weâ\u0080\u0099ve returned about 60% of our free cash flow to shareholders through dividends and share purchases. And at the same time, we also further strengthened our balance sheet, providing capacity for funding new projects over time. The improved market conditions will drive increased free cash flow, which will boost shareholder returns, and our future discretionary share purchases will be dependent on our cash flow and overall market conditions. We believe the three priorities of balance sheet strength, allocating cash flows to a mix of shareholder returns, and organic growth will enhance long-term value of our business. In closing, I just want to reiterate our view about the positioning for the Company, a bright long-term future supported by our attractive portfolio of assets, supported by the fundamentals of the copper business and the positive outlook for the markets we serve. Weâ\u0080\u0099re motivated to continue building long-term value in our business and on executing our plans responsibly, safely and efficiently. With leaching, weâ\u0080\u0099re not constraining ourselves to conserve capital or anything else. Weâ\u0080\u0099re -- we believe this is such a great opportunity for us that we are pursuing it as aggressively as we can, and we are pursuing it on a number of different fronts, some using outside vendors, some doing things on our own, some in joint ventures with companies. So, itâ\u0080\u0099s not something weâ\u0080\u0099re constraining. The other projects that we have, and Kathleen reviewed them, we have a series of major capital projects that are multiyear large capital requirements. As I said, the current sentiment is much stronger than it was three months ago, but thereâ\u0080\u0099s still a lot of overhang in the market, as you can see in the market today. So, weâ\u0080\u0099re not preparing any major change in the first part of 2023 versus what we did in 2022. Emily, on the leaching run rate, the 200 million pound target that weâ\u0080\u0099ve laid out, those -- we believe that that can be attained just from these operational changes that weâ\u0080\u0099re making. The heat retention, leaching in places that we werenâ\u0080\u0099t leaching previously, directing the solutions to places where we can enhance recoveries really from data analytics that weâ\u0080\u0099re getting that are helping us -- helping guide our operations every day. The -- on top of that, this research and development thatâ\u0080\u0099s going on with respect to additives, that could scale it larger. So, this 200 million pounds that weâ\u0080\u0099re talking about, we think that is really just bringing more of a light on our leach stockpiles and moving aggressively to -- over the last several years, the focus on the industry has been more on concentrating. And now weâ\u0080\u0099re putting focus back on these leach initiatives, and weâ\u0080\u0099ve identified some things. I wouldnâ\u0080\u0099t say low-hanging fruit, but itâ\u0080\u0099s achievable things that weâ\u0080\u0099re doing, and weâ\u0080\u0099re already starting to see results. Orest, weâ\u0080\u0099re not -- I mean, thereâ\u0080\u0099s pockets -- of course, in the residential markets thereâ\u0080\u0099s pockets of weakness, but there are -- weâ\u0080\u0099re just continuing to see strong physical demand, weâ\u0080\u0099re selling everything that we can produce. So, on balance, Iâ\u0080\u0099d say the physical market continues to be healthy, and we have -- most of our insights come from within the U.S. because weâ\u0080\u0099re a very significant part of the U.S. marketplace. And -- so generally, the market is continuing to be strong, and weâ\u0080\u0099re selling everything that we can produce. Even looking back to 2022, youâ\u0080\u0099ll recall, I mentioned I think on more than one conference call that there was a disconnect between even then the physical world we were dealing with, with our customers and what the market was doing. So, it has been striking as to the strength of demand that weâ\u0080\u0099ve had, we had no problem selling our production. And then, with our copper concentrate customers, including China, people were buying all that we produced and actually wanting more. When we announced the financial policy, as I looked out and I said, the likelihood is, cash is going to come in faster than we can spend it just because of the nature of our capital projects are long term. But, what this does is by having that cushion between where our debt is and our debt target is, it will allow us to readily be able to finance future construction projects. Well, I think...\n $3 billion to $4 billion is the limit. Yes, $3 billion to $4 billion is what we -- yes. You -- it looks like youâ\u0080\u0099ve increased your gold production guidance for 2024, â\u0080\u009825 and â\u0080\u009826, but copper volumes are pretty much the same. And additionally, weâ\u0080\u0099ve been getting higher gold recoveries than we had previously forecast. And itâ\u0080\u0099s not a targeting it -- itâ\u0080\u0099s not a targeting exercise, Chris. It was just -- if we look at the orebody, we maximize the value. Itâ\u0080\u0099s a dynamic process and report to you the results of that process, and thatâ\u0080\u0099s what it is. So, you can look at that pie chart and get a feel for which ones have the ability to change, and we provide some sensitivities on things like currencies and diesel costs. But unlike other operations where those joint ventures are run as a standalone business, we operate globally through our operatorship rights. And so, as those suppliers globally have been working to pass along their input cost, our global supply team working with our operations have been affected in mitigating certain of those costs. But again, itâ\u0080\u0099s a real dynamic situation and -- you saw we came in below our quarter-ago estimate. Some costs are moderating, some are carrying over, but itâ\u0080\u0099s just an ongoing thing. And we give you the best outlook we have, and then we work hard to try to operate with as low a cost as we can. Well, weâ\u0080\u0099re working on it right now, and weâ\u0080\u0099re structuring, so that we have the alternative of going forward with our current operations and maximizing those or undertaking a large-scale investment and new concentrator there. So, weâ\u0080\u0099re approaching it to give ourselves the alternatives of going in either of those directions. And so, weâ\u0080\u0099ve got to go through a permitting process on that as well. So, itâ\u0080\u0099s unlikely weâ\u0080\u0099ll have any material spending on it until a few years out. But as I said, we -- in the past, weâ\u0080\u0099ve been delaying that so -- we made the decision on the concentrator expansion. And in recent months, weâ\u0080\u0099ve decided we need to go ahead with the permitting for the water, desalt plant, so that -- because weâ\u0080\u0099re going to need it one way or the other. Thinking of the slide 11 with the five projects, I realize it takes a lot of engineering resources for each of these projects. But a $30-plus molys Sierrita new mill must be very attractive, youâ\u0080\u0099re budgeting 20 and maybe lower for the long term at 15 for your reserves. And you know itâ\u0080\u0099s a good new story to have this large pipeline of future projects, and I personally believe the world is going to need that copper. Going to your last question first, there is no relationship between Kucing Liar and projects in the U.S. And we believe, although we havenâ\u0080\u0099t been engaged in drilling exercises in the Grasberg Block Cave and Deep MLZ and who knows what else is down there because we really havenâ\u0080\u0099t drilled to explore future opportunities. But thatâ\u0080\u0099s on its own, there is no effect on what weâ\u0080\u0099re doing at Kucing Liar with what we do in the United States. So, we have the financial resources to do -- in the Americas, the United States and South America. So, the ones weâ\u0080\u0099ve listed are the ones we believe are the largest, most significant executable projects initially. The Bagdad expansion is a straightforward doubling of mill capacity, and weâ\u0080\u0099ve dealt with water issues and so forth and...\n That will add moly as well, John -- Bagdad. But thatâ\u0080\u0099s a very executable project, itâ\u0080\u0099s not that complicated. But -- and as we deal with the workersâ\u0080\u0099 situation in housing, as markets clear up, thatâ\u0080\u0099s one that would be ready to go. Lone Star, which really looks like it can be another base level high-profile operation for Freeport in the future, weâ\u0080\u0099re going to maximize it through the oxide, ore and continue to understand how we attack the big sulfide resource that weâ\u0080\u0099ve identified in. But all of those things provide us growth opportunities from inside our company, which makes it very unlikely that weâ\u0080\u0099ll be acquiring smaller operations to pursue externally. You can just see whatâ\u0080\u0099s going in the world when you have to pay a big price, you get a resource and then you put the capital on top of it. John, on your question about -- sorry, Richard. And weâ\u0080\u0099ve been operating at below capacity in recent years because of market conditions, but we have started to do a stripping campaign there that will allow us to expand production from Climax. And as Richard said, weâ\u0080\u0099ve got -- we got a lot of projects in the background. And Bagdad long term -- I mean, medium term and the Lone Star major expansion longer term. So, weâ\u0080\u0099ve got all our people focused on these things and we have an enormous resource base like we were saying in the U.S. where we already have established operations and community support. So, weâ\u0080\u0099re in a really good position as we look forward as to what this world is going to need in terms of new copper supply. A few years ago, Freeport bought a drinking water system and a sewage system for Arequipa, the third largest city as you were tripling the El Abra mill and mine -- excuse me, the Cerro Verde mill and mine. And I think you might have some rail -- short-line rails, so that you donâ\u0080\u0099t have as many trucks on the road. So, in the last several days, weâ\u0080\u0099ve been operating -- weâ\u0080\u0099ve been operating at around that 350,000 level. Weâ\u0080\u0099ve really been operating at 10%, 15% lower just to deal with supplies. But in terms of operations, weâ\u0080\u0099re continuing to operate, but we have limited our mill throughput just to deal with the limitations and the concerns about key supplies. I think all of you know that the Cerro Verde milling complex is the largest in the industry, 400,000-plus per day capacity. And what John is referring to is a number of years ago, we did as a community project invested in a freshwater system for Arequipa, the second largest city in Peru. And then, as we were developing the expansion of the concentrator and tailings dam, we shifted away from building a new dam on the river that runs just outside of the sea of Arequipa. Now, having said that, the situation in Peru is very complicated and nobody at this point can predict how itâ\u0080\u0099s going to unfold. And so far, weâ\u0080\u0099ve been able to continue to operate. Well, during COVID, we did have some impacts on our mining rates, and also suspended some milling operations at Morenci. And we started ramping back up in the U.S. during 2021, and that continued into 2022. And weâ\u0080\u0099ve got typically 10,000 to 12,000 employees in the U.S. And so -- and weâ\u0080\u0099ve seen a lot of turnover as well. And itâ\u0080\u0099s just been a very competitive marketplace for labor, as youâ\u0080\u0099ve read about it, in the U.S. And we donâ\u0080\u0099t have that situation in Indonesia or in South America, but we do have competition in the U.S. with other sectors, and thatâ\u0080\u0099s continued into 2023 and whatâ\u0080\u0099s caused us to change our outlook somewhat. And thatâ\u0080\u0099s why weâ\u0080\u0099re making some progress on hires and we are conducting training and some of these workers that weâ\u0080\u0099re hiring now are new to the industry, and so we do have to go through training, and the experience level is not what it was five years ago. So, weâ\u0080\u0099re going through that process. I mean, when I talk with people to business council, business around the table, itâ\u0080\u0099s a common theme you hear across many industries. And as a result, our mine rates start meeting what we would like for them to meet, and that affects not only current but future production, and itâ\u0080\u0099s a strategic challenge for us. But, itâ\u0080\u0099s not just us and itâ\u0080\u0099s not just the mining industry, but the mining industry because the nature of the work presents special problems. This leaching initiative that weâ\u0080\u0099re pursuing is not labor-intensive, because itâ\u0080\u0099s already -- the material has already been mined. I mean, we have -- Morenci the largest leaching operation in the world. And by enhancing the existing leaching operations using all these tools, data analytics and heat covers and supplements, itâ\u0080\u0099s really amazing. But with success, itâ\u0080\u0099s a great opportunity for us. But for a company like Freeport with the leaching operations that we have and the application with success to historical leach sites and future mine development, itâ\u0080\u0099s something thatâ\u0080\u0099s really exciting. I had the chance for the first time to meet the President of Chile when I was at APAC in Bangkok, and we had a very long conversation in advance of his presentation and it was really positive. And so, like whatâ\u0080\u0099s going on in a lot of different countries around the world, particularly when commodity prices go up, people see the opportunity to take financial benefits through royalties and taxes and use them to meet social needs. At one point, Chile built its whole economy on copper and was very successful. When I was talking with people in Indonesia, the Congo and other places, I would always point to Chile as an example of a country that to be successful by encouraging mining. Chile for a number of reasons, labor and now government situation is losing -- has lost and is losing competitive advantage that it once had. So, these government officials run on a platform of enhancing social programs and then they end up facing the reality of they go too far with that, what that does to their country in terms of its currency, in terms of its economic viability and investment and so forth. Weâ\u0080\u0099re not a real leader in Chile, although we are in the global copper business. So, we participate with the government, with other companies there and the conversations that are going on and share our experiences that weâ\u0080\u0099ve had in working globally on these kinds of issues. Weâ\u0080\u0099ve actually walked away from projects, because governments -- we didnâ\u0080\u0099t believe the deal the government was offering us was sustainable long-term deals. So itâ\u0080\u0099s a complicated deal, big part of a business for the leader of a company. And youâ\u0080\u0099ve got to -- as I said, listen, be responsible, and work to find middle ground so that itâ\u0080\u0099s a win-win deal and youâ\u0080\u0099re not taking advantage of anyone and youâ\u0080\u0099re representing your stakeholders. And in the meantime, weâ\u0080\u0099re maintaining our options by planning to move forward with the water infrastructure investments. And you know, I canâ\u0080\u0099t let this call go by without telling you how personally pleased I am with our much improved relationship with the government in Indonesia, where we had a multiyear discussions, negotiations over our mining rights in our contract and so forth. Itâ\u0080\u0099s just been remarkable whatâ\u0080\u0099s happened in the last six months, I made three trips there. We had -- the President had an incredibly positive visit to our job site at the end of August, early September. Itâ\u0080\u0099s great to have a quarter like this, and weâ\u0080\u0099re really excited about our future."
}