{
    "symbol": "FCX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 13:45:35",
    "content": " Our projected $0.03 per pound increase in site production and delivery costs reflects the assumption of higher energy prices in our second half -- in the second half compared with our prior forecast, higher consumable costs, together with the impact of a change in estimate for copper in the maturing leach pad at El Abra. On Slide 10, we show modeled results for our EBITDA and cash flow at various prices and have shown a broad range of prices this quarter, given the volatility ranging from $3 per pound of copper to $5 per pound of copper, which is close to where the prices were earlier in the year. But we go through mine by mine and look at overall production costs capital costs, the overall cash flows, and we'll make adjustments as needed and maybe first adjustments be to defer some capital projects which do have an impact on copper prices -- on copper volumes longer term, but we're going to be looking at all these things and closely monitoring the conditions. We've -- the lower copper prices gives us less cash flows to use, but we're going to continue to look at our plans and see how we might modify that with this disconnect in where our share price is trading and what's needed long term to develop new supplies. We're executing to the moderate volumes that we've put in to this year's forecast, building confidence into a sustainable -- what that looks like going forward and then have a number of activities going to add even more with a whole -- with a very large backlog of a number of alternatives that we're pursuing. I mean it's been such a dramatic decline, and there's still such uncertainties as to what's going to happen, that all of that is going to delay production investments and there was such a limited number of investments available out there anyway, it's just building towards this coming huge deficit in the copper markets. But the decisions about timing and when to come and so forth, has a lot of moving parts, and that got -- it's just gotten more complicated by seeing this 30% drop in copper prices and not knowing what's going to happen in the next 2 to 3 years globally. And so we just use current prices and then look at scenarios of -- I'll say this, for those of you who followed the company a long time, you've heard me say about the correlation between our input costs and copper prices that's been there. As Richard talked about the correlation, what we're spending on energy, if we did historical correlations going back over a long period of time, our energy costs correlated to a $3.25 copper price, would be 40% lower or greater."
}