{
    "symbol": "DRTT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 07:25:06",
    "content": " Turning to slide six, revenues for the quarter were $44.7 million, consistent with our expectations and an increase of 16.8% and 8.8% over the first quarter of 2022 and the second quarter of 2021, respectively. Looking at a breakdown of operating basis on slide eight, sales and marketing expenses increased by $0.2 million to $7.8 million for the 3 months ended June 30, 2022, which was largely related to an increase of $0.9 million in travel, meals and entertainment expenses, offset by a decrease in salaries and benefits costs due to flat headcount reductions as part of the cost savings initiatives announced in February. General and administrative expenses decreased by $0.9 million to $6.9 million for the 3 months ended June 30, 2022, approximately $0.3 million of professional fees associated with the contested election of Directors was more than offset by lower salaries and benefits costs. For the quarter ended June 30, 2022, we incurred $5.2 million in reorganization costs attributed to the closure of the Phoenix facility, reduction in workforce and change of control of the Board. On slide nine, adjusted EBITDA and adjusted EBITDA margin for the quarter decreased to a $9.4 million loss or negative 21.1% from $6.8 million loss or 16.3% in the same period of 2021, driven by the reduction of gross margin profit -- gross profit margin, as I've already discussed. On slide 10, net loss for the quarter increased to $19.3 million or $0.22 net loss per share in the 3 months ended June 30, 2022, from a net loss of $9.7 million or $0.11 net loss per share for the 3 months ended June 30, 2021. The higher net loss primarily is the result of the lower gross profit margin of -- a $4.2 million increase in operating expenses driven by onetime reorganization costs, a $3.4 million reduction in government subsidies and a $0.5 million increase in interest expense, offset by a $1.3 million increase in foreign exchange gains. Net working capital at the end of the quarter was $31.6 million, and we used approximately $19.1 million of cash in the second quarter, which included $6 million of onetime restructuring, proxy contest costs and other related payments."
}