{
    "symbol": "STG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-24 14:15:09",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by and welcome to Sunlands Fourth Quarter and Full Year 2022 Earnings Conference Call. Hello, everyone and thank you for joining Sunlandâ\u0080\u0099s fourth quarter and full year 2022 earnings conference call. Thanks to unwavering execution of our balanced growth and profitability strategy, we concluded 2022 with sustained growth in both new student enrollments and our bottom line in the fourth quarter. We maintained our disciplined cost management practices and streamlined operations to boost our efficiency and profitability driving our quarterly net income to RMB181 million in the fourth quarter and our full year net income to RMB643 million, more than triple that of 2021. During the quarter, we also sharpened our strategic focus on diversifying our course content, enhancing our course and service quality and improving student acquisition efficiency, leading to a 48.2% year-over-year increase and a 19.5% quarter-over-quarter increase in the new student enrollments. Driven by sustained demand for our certification programs and the rising popularity of our scale and interest courses, new student enrollments for our professional certification preparation, professional skills and interest programs in the fourth quarter grew 82.7% year-over-year and 22.4% quarter-over-quarter. For the full year of 2022, new student enrollments for these programs increased by 59.8%. Last but not least, in the fourth quarter, we remained focused on cost efficiency and refined operations to help us navigate the persistent macro uncertainties despite the lifting of pandemic restrictions. Amid a persistently challenging macro environment, our net revenues came in at RMB578.6 million in the fourth quarter, representing a 1.7% year-over-year decrease, but beating the high end of our guidance range by 7.1%. As we continue to execute cost reduction and efficiency optimization measures, we successfully brought our fourth quarter operating expenses down by 15.1% year-over-year, which contributed to enhanced profitability as reflected in our 20% year-over-year increase in net income. In the fourth quarter of 2022, net revenues were RMB578.6 million, a decrease of 1.7% year-over-year. Cost of revenues decreased by 15.8% to RMB75.3 million in the fourth quarter of 2022 from RMB89.4 million in the fourth quarter of 2021. In the fourth quarter of 2022, operating expenses were RMB336 million, representing a 16.1% decrease from RMB400.5 million in the fourth quarter of 2021. Sales and marketing expenses decreased by 19.7% to RMB272.5 million in the fourth quarter of 2022 from RMB339.4 million in the fourth quarter of 2021. General and administrative expenses increased by 11.1% to RMB56.1 million in the fourth quarter of 2022 from RMB50.5 million in the fourth quarter of 2021. Product development expenses decreased by 30.8% to RMB7.4 million in the fourth quarter of 2022 from RMB10.7 million in the fourth quarter of 2021. Other income in the fourth quarter of 2022 was RMB4.9 million, compared with other expenses of RMB3.1 million in the fourth quarter of 2021. Net income for the fourth quarter of 2022 was RMB181 million, compared with RMB150.8 million in the fourth quarter of 2021. And now for our outlook, for the first quarter of 2023, Sunlands currently expects net revenues to be between RMB530 million and RMB550 million, which would represent a decrease of 10.3% to 13.6% year-over-year."
}