{
    "symbol": "VOYA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 00:18:06",
    "content": " Our confidence in achieving this target is driven by several factors, the diversity of our revenue streams and the markets we serve, including the positive impact of interest rates on our wealth business, the continued decline of COVID related claims, the benefits we have already realized from the Allianz GI transaction including revenue on assets on boarded during the third quarter and the removal of all stranded costs associated with our prior divestitures, which we achieved ahead of schedule. Please state your question. And when you think about our health solutions we've got a breadth of voluntary solutions that we offer for employers to help us protection needs, but we did not have the benefits administration or the front-end user experience and so what this capability does is it allows us to have both that benefits administration capability on the health side to connect with all of the different partners the health providers, the benefit providers while leveraging our myVoyage front end user experience to really connect what has typically been very unconnected. Now to get to your question specifically around the run-rate, why is this accretive immediately is when you think about Benefitfocus or publicly traded organization you can see that they've got a revenue run rate of about $250 million on an annual basis that's recurring revenue and we're able to take advantage of immediate expense synergies from some corporate expenses you think about the elimination of public company expenses as well as taking advantage of our tax asset and all of this is for any revenue synergies that we see on the horizon and it's before synergies that we see in our ability to help Benefitfocus accelerate their growth plan and improve their margin by leveraging our technology, our digital and our operational experience. On Investment Management, continued expense discipline in the face of really adverse market conditions, I think, is the watchword there plus the benefit of the growth that we're going to see from the AllianzGI relationship and the new -- not only investment capabilities, but also new distribution horizons for us to explore. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question."
}