{
    "symbol": "HLIT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-31 20:14:05",
    "content": " Segment revenue was $91.9 million, up 13% sequentially and 60% year-over-year. At quarter end, consumer modems served grew to $10.9 million, up 179% year-over-year, still less than 20% of our existing customers' DOCSIS footprint. Referring back to our mid-September Analyst Day, we laid out an aggressive 3-year growth plan that calls for over $800 million of revenue and 28% EBITDA margin in 2025. Third quarter segment revenue was $63.8 million, down 7.1% year-over-year as expected due to the previously discussed movement of a few larger plants orders into the first half of the year and the corresponding Q2 upside. We reported September quarter record revenue of $155.7 million, up 23.3% year-over-year, along with strong gross margins of 50.9%. We also reported September quarter record bookings of $171.1 million and continue to maintain near-record backlog and deferred revenue of $490.1 million at the quarter end, positioning us well for the remainder of 2022 and into 2023. As I just mentioned, total company Q3 revenue was $155.7 million, slightly down on a sequential basis and up 23.3% year-over-year. Revenue for the quarter was $91.9 million, up 13.2% on a sequential basis from Q2 and up 59.6% year-over-year, reflecting both the continued ramp of existing customers and newer customer launches, including modest fiber revenue. In our video segment, we reported Q3 revenue of $63.8 million, down 16.3% sequentially and 7.1% year-over-year. Our video revenue included SaaS revenue of $8.9 million, up 63.9% from the prior year, ahead of our expectations. Adjusted EBITDA for Q3 '22 was 13.6% of revenue at $21.2 million, comprised of $16.9 million from broadband and $4.3 million from video. At the end of Q3, total backlog and deferred revenue was $490.1 million, up approximately 3% sequentially from $477.8 million in Q2 and up 47% year-over-year from $333.3 million at Q3 '21. Gross profit to range from $310 million to $319 million, up 2% at the midpoint versus prior guidance. Operating expenses to range from $242 million to $244 million, down slightly versus our prior guidance at the midpoint, primarily due to favorable foreign exchange rates. We expect revenue in the range of $151 million to $165 million, down 1% from the midpoint of previous guidance. Gross profit in the range of $78 million to $87 million, reflecting an increase of 3% from prior guidance at the midpoint. Adjusted EBITDA to range from $19 million to $27 million, up 7% at the midpoint. A weighted average diluted share count of approximately 113.5 million and EPS to range from $0.12 to $0.18, up 7% at the midpoint of prior guidance. For the full year 2022, based on our progress to date, we expect broadband to achieve revenue between $345 million to $350 million, a 2% increase from the midpoint of prior guidance, implying a full year revenue growth of 59% at the midpoint. Gross profit between $149 million to $152 million, up 3% from prior guidance at the midpoint, reflecting both higher expected revenues and margins. Operating expenses between $100 million to $101 million, up 4% versus prior guidance at the midpoint, adjusted EBITDA between $55 million to $58 million, up 4% from the prior guidance at midpoint, also reflecting higher expected revenue and margins. For our broadband segment in Q4, we expect revenue in the range of $90 million to $95 million; gross margin in the range of 46.4% to 47.4%. Currently, we expect revenue in the range of $267 million to $276 million, a 2% decrease from the midpoint of prior guidance. Gross margins in the range of 60.1% to 60.3%, a 130 basis point improvement versus prior guidance at the midpoint due to improved product mix, partially offset by a continued modest foreign exchange headwind. Gross profit in the range of $161 million to $167 million, a slight improvement from prior guidance at the midpoint, primarily due to stronger-than-expected Q3 margins. Operating expenses in the range of $142 million to $143 million, 2.7 better than prior guidance at the midpoint, primarily due to reduced hiring and improved foreign exchange benefit. Adjusted EBITDA in the range of $24 million to $29 million, an 18% improvement from prior guidance at the midpoint. Gross profit in the range of $36 million to $42 million, a slight decrease from prior guidance at midpoint. Operating expenses in the range of $35 million to $36 million, better than prior guidance at midpoint due to the factors mentioned previously."
}