{
    "symbol": "HLIT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-01 23:18:04",
    "content": " Revenue was up 39% year-over-year, reaching a record $157.4 million. Segment revenue was $81.2 million, up 62% year-over-year. Second quarter segment revenue was $76.2 million, up 20% year-over-year, ahead of our forecast as some business we expected to realize in the second half of the year came in earlier than anticipated. Strategically, the biggest highlight of the quarter was achieving streaming SaaS revenue of $8.6 million, which was up 69% year-over-year. Our results through the first half of 2022 demonstrated continued execution of this plan with important strategic SaaS wins, top line growth, gross margin expansion and continued segment profitability, despite ceasing sales in Russia with estimated loss revenue of approximately $6 million. We reported a record second quarter revenue of $157.4 million, along with solid gross margins of 52.8%, adjusted EBITDA margins of 15.5% and EPS of $0.16. We continue to maintain near-record backlog and deferred revenue, which was $477.8 million at the quarter end, positioning us well for the second half of the year. As I just mentioned, total company Q2 revenue was $157.4 million, up 6.8% on a sequential basis from Q1 and up 38.8% year-over-year. Revenue for the quarter was $81.2 million, consistent with our strong performance in Q1 and up 62.2% year-over-year, reflecting both the continued ramp of existing customers and newer customer launches. In our Video segment, we reported Q2 revenue of $76.2 million, up 15.8% sequentially and 20.3% year-over-year. In addition to these shipments, our Video revenue included SaaS revenue of $8.6 million, up 68.7% from the prior year, ahead of our expectations. Moving down the income side on Slide 9, Q2 '22 operating expenses were $61.7 million, net of foreign exchange benefit of approximately $1.3 million as a result of the strong U.S. dollar during the second quarter compared to $58.4 million in Q1 '22 and $54.6 million in Q2 '21. Adjusted EBITDA for Q2 '22 was 15.5% of revenue at $24.3 million, comprised of $11.6 million from Cable Access and $12.7 million from Video. The sequential decrease was primarily due to a reduction in convertible debt dilution of 1.4 million shares and a reduction in the dilutive effect of outstanding RSUs and options by 0.8 million shares, both resulting from a decrease in our average stock price in the quarter and by the share repurchases of approximately 324,000 shares in the quarter at an average price of $8.86, partially offset by issuance of 0.6 million shares to employees for vested RSUs. At the end of Q2, total backlog and deferred revenue was $477.8 million, marginally down sequentially from a record $497.3 million at Q1 '22 and up 38% year-over-year from $347.2 million at Q2 '21. Taking these CableOS contracts into account, we have total future contracted revenues of approximately $573.8 million, which continues to provide us with a very solid base as we move forward through the second half of 2022 into 2023. Gross profit to range from $300 million to $318 million, up 2.8% at midpoint versus prior guidance. Operating expenses to range from $239 million to $248 million, down 0.4% at the midpoint of our prior guidance. We expect revenue in the range of $147 million to $157 million, gross margin in the range of 48.9% to 50.5%; gross profit in the range of $72 million to $79 million, operating expenses to range from $60 million to $63 million, adjusted EBITDA to range from $15 million to $19 million, a weighted average diluted share count of approximately 109.5 million, EPS to range from $0.08 to $0.12. For the full-year 2022 based on our progress to date, we expect Cable Access to achieve revenue between $335 million to $345 million, a 5% increase from midpoint of prior guidance, implying a full year revenue growth of 56% at the midpoint. Gross profit between $141 million to $150 million, up 5% from prior guidance at the midpoint. Adjusted EBITDA between $53 million to $56 million, up 16% from prior guidance at the midpoint. For our Cable Access segment in Q3, we expect revenue in the range of $85 million to $91 million, gross margin in the range of 43% to 45%, gross profit in the range of $37 million to $41 million, operating expenses in the range of $24 million to $26 million, adjusted EBITDA to range from $14 million to $16 million. Currently, for the full year, we expect revenue in the range of $272 million to $282 million, a 1% decrease from midpoint than prior guidance, reflecting a decrease in appliance revenue, partially offset by an increase in SaaS. Gross profit in the range of $159 million to $168 million, up 0.7% from prior guidance at the midpoint. Operating expenses in the range of $145 million to $148 million, 1% better than prior guidance at the midpoint. Adjusted EBITDA in the range of $19 million to $26 million, a 12.5% improvement from prior guidance at the midpoint. For our Video segment in Q3, we expect revenue in the range of $62 million to $66 million, gross margin in the range of 57% to 58%, gross profit in the range of $35 million to $38 million, operating expenses in the range of $36 million to $37 million, adjusted EBITDA to range from $1 million to $3 million."
}