{
    "symbol": "HLIT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-30 21:05:28",
    "content": " Revenue was a record $164 million, EPS was $0.17 and adjusted EBITDA margin was over 16% as both business segments were again solidly profitable. Segment revenue was $96 million, up 4% sequentially and 38% year-over-year. The quarter end modem served grew to $15.2 million, up 218% year-over-year. As a reminder, in our mid-September Analyst Day, we laid out an aggressive 3-year growth plan that calls for over $820 million of revenue and 28% EBITDA margin in 2025 as we closed a very successful 2022 and head into 2023. Fourth quarter segment revenue was $68.3 million, up 7% sequentially, although down 21% year-over-year when compared to an extraordinarily strong fourth quarter in 2021. SaaS transformation execution continues to be the highlight, with record quarterly revenue of $10.5 million, up 51% year-over-year. For the fourth quarter, we reported record revenue of $164.3 million, with strong gross margins of 52.7%. For the full year 2022, our total revenue was a record $625 million, up 23% as broadband revenue increased over 60% and video SaaS revenue increased 63% year-over-year. Adjusted EBITDA of $86.5 million, increased over 50% year-over-year. Turning to Slide 8, again, total Q4 revenue was $164.3 million, up 5.5% on both a sequential basis and year-over-year basis. Looking first at our broadband business segment, Q4 revenue was $96 million, up 4.5% sequentially and 37.7% year-over-year, reflecting continued current customer ramp up and newer customer launches, including modest fiber revenue generated during the quarter. In our video segment, we reported Q4 revenue of $68.3 million, up 7% sequentially and down 20.7% year-over-year, with the comp being a very strong Q4 2021. Our video revenue included SaaS revenue of $10.5 million, up 51.3% from prior year, once again ahead of our expectations. Moving down to the income statement on Slide 9, Q4 operating expenses were $63 million, up 3.2% sequentially and 8.5% year-over-year. Adjusted EBITDA for Q4 â\u0080\u009822 was $26.6 million or 16.2% of revenue, up 88 basis points versus Q4 â\u0080\u009821, comprised of $20.2 million from broadband, representing 21% of segment revenue and $6.4 million from video, representing 9.3% of segment revenue. For the full year 2023 based on our progress to date, we expect broadband to achieve revenue between $445 million to $465 million, a 30% increase at the midpoint, based on the strong demand trends we continue to see. This guidance includes revenue from existing Tier 1 customers and does not include significant revenue from potential Tier 1 customer wins in our pipeline: gross margins between 45% to 46%, a 190 basis point improvement over 2022 based on assumed hardware and software mix, that is typical of what we have seen over the past 18 months, operating expenses between $120 million to $123 million, adjusted EBITDA between $86 million to $97 million. For full year â\u0080\u009823, video segment results we expect revenue in the range of $250 million to $270 million, gross margins range of 58.5% to 60.5%, operating expenses $140 million to $144 million, adjusted EBITDA, $12 million to $25 million. For total company for the full year â\u0080\u009823, we expect revenue in the range of $695 million to $735 million; gross margins in the range of 49.8% to 51.3%, operating expenses in the range of $260 million to $267 million, adjusted EBITDA in the range of $98 million to $122 million. For Broadband segment in Q1, we expect revenue in the range of $97 million to $102 million; gross margins, 45% to 46%; operating expenses, $29 million to $30 million, adjusted EBITDA of $16 million to $18 million. For our video segment in Q1, we expect revenue in the range of $55 million to $60 million, gross margins, 58% to 59%; operating expenses, $35 million to $36 million; adjusted EBITDA in the range from a loss of $2 million to a profit of $1 million. For total company for first quarter of â\u0080\u009823, we expect revenue in the range of $152 million to $162 million, gross margins, 49.7% to 50.8%; operating expense is $64 million to $66 million; adjusted EBITDA, $14 million to $19 million; effective tax rate of 20%; a weighted average diluted share count of approximately $117.9 million; and EPS to range from $0.07 to $0.10; cash to range from $75 million to $85 million. Please go ahead, Ryan. If I go back and look at your 10% customer information by quarter in 2022, I think Intelsat alone accounted for about $37 million, I guess I assume that, thatâ\u0080\u0099s not going to repeat in 2023. Please go ahead, Ryan."
}