{
    "symbol": "SITM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 19:39:07",
    "content": "  Operator: Good afternoon, and welcome to SiTime's Fourth Quarter 2022 Financial Results Conference Call. On today's call from SiTime are Rajesh Vashist, Chief Executive Officer and Art Chadwick, Chief Financial Officer. Before we begin, I would like to point out that during the course of this call, the company may make forward-looking statements regarding expected future results, including financial position, strategy, and plans, future operations, the timing market and other areas of discussion. It is not possible for the company's management to predict all risks, nor can the company assess the impact of all factors on its business or the extent to which any factor or a combination of factors may cause actual results to differ materially from those contained in any forward-looking statements. In light of these risks, uncertainties, and assumptions, the forward-looking events discussed during this call may not occur and actual results could differ materially and adversely from those anticipated or implied. For more detailed information on risks associated with the business, we refer you to the risk factors described in the 10-K filed on February 25, 2022, as well as the company's subsequent filings with the SEC. Also, during the course of the call, weâ\u0080\u0099ll refer to certain non-GAAP financial measures, which we consider to be an important measure of company's performance. With that, itâ\u0080\u0099s now my pleasure to turn the call over to SiTime's CEO. First, I'd like to welcome you as well as existing investors to SiTimeâ\u0080\u0099s Q4 2022 earnings call. SiTime created precision timing to service the needs of applications like automated driving, 5G, enterprise and IoT. SiTime has shipped 3 billion precision timing chips to 20,000 customers in 300 applications. Non-GAAP income was $14.4 million for the quarter and $82.9 million for the year, which is 29% of revenue. On the product side, SiTime introduced four new products since the last earnings call. Previously, we had introduced four key performance metrics as indicators of future revenue, SAM expansion, design wins, ASPs and single source business. While we don't expect to do this on an ongoing basis, given the current market conditions, we're giving further insight into our business by using these metrics this time. In 2021, our SAM was $1 billion. In 2022, we grew it to $2 billion. With a highly differentiated precision timing products, SiTime is creating a market where we continue to expand our advantages. Since our last earnings call, we introduced four new products and are on track to introduce five more in 2023. Customer activity for these nine new products, which includes architectural discussions and sampling, continues to be robust. Seven of these nine products are in our focus segments, Comms Enterprise, Automotive and Aerospace Defense. Last week, we introduced two new Endura product families that expand our presence in the aerospace defense market in applications such as position, navigation and timing, PNT, tactical communications, network service synchronization and surveillance. Both products deliver up to 10 times better environmental resilience, which is crucial for these applications that operate in harsh environments. In Q4 â\u0080\u009822, our design wins grew 55% over the same period in â\u0080\u009821. Additionally, 65% of these design wins were in our focus segments of comms enterprise, automotive and aerospace defense. As in the past few years, we are not seeing any meaningful loss of business to competitors even though their availability has increased and lead times have shortened. In â\u0080\u009823, we expect to continue to have 80% of our business as single sourced. As we said earlier, the shortages of past few quarters that customers and their contract manufacturers to purchase more than they needed. While most customersâ\u0080\u0099 inventory is as we forecasted earlier, a new development is that our historically largest customer recently informed us that they have more inventory at their subcontractors than the previously thought. Despite the rest of the business being as expected, this will lead to lower revenue in Q1 â\u0080\u009823 than previously thought. In conclusion, end customer demand continues to be generally healthy. SiTime continues to be the leader in precision timing, a category that we created and we are confident about our future success. Today, I'll discuss fourth quarter and full-year 2022 results, and I'll provide guidance for the first quarter of 2023 and make some comments on the year. I'll focus my discussion on non-GAAP financial results and refer you to today's press release for a detailed description of our GAAP results, as well as a reconciliation of GAAP to non-GAAP results. Revenue in the fourth quarter was $60.8 million and revenue for the full-year 2022 was a record $283.6 million, up 30% over 2021. Sales into our mobile, IoT and consumer segment were $24.7 million or 41% of total sales. Sales to our largest customer, which is included in this segment were $15.5 million or 26% of sales. Excluding sales to our largest customer, sales into this segment were $9.2 million or 15% of sales. Sales into our Industrial, Automotive and Aerospace segment were $20.3 million or 33% of sales. Non-GAAP gross margins were 63.1%, down about 2 points from Q3, due to the lower revenue. Interest income for the quarter was $4 million, up substantially from prior quarters, due to higher investment yields. Accounts receivable at the end of the quarter were $41.2 million with DSOs of 61 days, compared to $44.9 million and DSOs of 55 days in Q3. Inventory at the end of the quarter was $57.7 million, up from $45.4 million at the end of Q3 as we bought additional wafer safety stock, to provide a cushion in the event of any future geopolitical or other supply chain issues. During the quarter, we generated $5 million in cash from operations, invested $8 million in capital purchases and ended the quarter with $564 million in cash, cash equivalents and short-term investments, essentially flat with the prior quarter. Last quarter, we offered comments on Q1 of 2023 and said that revenue would be down sequentially from Q4 for two reasons. First, we expected the usual seasonal slowdown with our largest customer. And second, we expected a lull in comms and enterprise sales as our customers in those markets work through excess inventory. As Rajesh mentioned, it now appears that their subcontract manufacturers have enough inventory to support their needs through the first-half of the year. Therefore, once they work through this inventory sales should rebound to more normal levels starting in Q3. As a result, we now expect Q1 revenue will be somewhere between $37 million and $39 million. We will hold operating expenses relatively flat with Q4, so approximately $28 million. So at the midpoint of that guidance, we therefore believe Q1 non-GAAP net income will be approximately breakeven. That revenue will increase in Q2 and that once excess inventory gets worked down, sales should rebound nicely in the second half of the year. I'd like to conclude my remarks by saying that even though we are going through this short-term dip, we firmly believe that our long-term growth story is intact. And on that note, I'd like to hand the call back to the operator for Q&A. Your line is open. Obviously, it sounds like inventory correction is going to keep results fairly depressed in the first half of the year, but wondering if you might comment today where do you think the natural level of demand or what do you think consumption of your products is running at on a quarterly basis, so that as we start to snap back to that consumption, we have some sense what the revenue ramp might look like in the second half of the year? Yes, that's a great question, Quinn. As I mentioned in my discussion, I think you go back to 2021 and there are a lot of shortages in the industry and when those shortages eased, a lot of folks, a lot of our customers and certainly their subcontract manufacturers took advantage of the supply and over ordered. But clearly that is suppressing our revenue, I would say substantially certainly in Q1 and we will also do that in Q2. I think, if you just look at our historic numbers, I mean, for the year, we did $283 million in 2022 and there's some over buying in that. But if you notch that down, that's going to be a normalized number for 2022. And I think longer term, our 30% growth rate is intact once we get through this dip. So maybe just trying to frame it, it sounds like that the $284 million in 2022, obviously included some amount of inventory burn. I don't want to get tied down to an exact number, but I think the logic there is founded. Even though we're fabulous, we do have a certain amount of what I call fixed manufacturing overhead as the cost of our ops group and some depreciation on some of the back-end equipment that we own that's located at our OSATs. So -- and that's about 10 points of margin, so when the revenue is lower, the absorption rate is lower and that's what drove lower gross margins from Q2. There was 65% and change down to -- I'm sorry, in Q3, down to 63% in the quarter that we just announced and my guide down to 60% in Q1. So the direct answer to your question is yes, gross margins will increase as revenue increases. I would expect that we can exit the year with gross margins close to our historic margins again, we had gross margins just over -- non-GAAP gross margins just over 65% for the full-year that we just ended. Your line is open. So for the first question, I just -- I guess based on what you provided in guidance, if you can give some color on the additional segments. I mean, it seems like the guidance seems to imply sort of flattish revenue for both industrial auto, aero, kind of, enterprise. Again, comms and enterprise will be substantially lower from Q4 to Q1 for the reasons that I mentioned and that is our largest customers that's plural in that segment have enough inventory to get them through the first quarter. In our auto and industrial segment, in total, that's going to be flattish, I think from Q4 to Q1. And then our IoT and consumer space excluding our largest customer will be flattish, but our largest customer of course will be down very substantially. As a follow-up, if you could speak about pricing for the remainder of your products and/or just made it clear that large number, the vast majority of products are sole sourced and knowing that those customers are buying the product for the performance. That's also true in some of our other products, but let's just focus on this one. On this, we see no competition, we see no quest for lower pricing, because our customers clearly understand how unique our products are in providing value. On the products that are pin for pin compatible, higher volume, typically in industrial, perhaps in consumer, maybe in some lower end of networking telecommunications. That means that even in those markets, we sell in the higher end of that customer's product, which also means that we don't see any pricing pressure. And continues to lead to growth in our blended pricing, including our largest customer for the last several quarters. So I'm very confident that SiTime is in a good position, primarily because of a highly differentiated products, whether they are in the focus markets or in our non-focus markets. Please standby for our next question. Your line is open. So yes, I think we can get back to those types of numbers. I think, Alex, there's been some decline in their natural demand. And then similarly, not to harp on the consumer segment in general, but we've had conversations talking about the non-apple consumer portion being allowed to, sort of, bleed out over time as customers maybe go back to court. In general, as I said earlier, we see that wherever they have -- when our customers have differentiated products, they tend to use SiTime. So we think that ex our largest customer as well, that our business with consumer continues quite solidly. And in fact, we continue to get some nice design wins that will help us in the second half of the year, I believe. There are still as Rajesh mentioned, customers in the consumer space where we provide real value. And as I mentioned in my script, it was $9.2 million in fourth quarter, that was up what $1 million maybe a $1.5 million from Q3. And over time, if we have the right customers that could even go up. Please standby for our next question. Your line is open. Appreciate, Art the gross margin guidance towards the end of the year and the confidence there. Well, I mean, one of our basic themes and one of the ways that we got our gross margins to expand from the high-40s three years ago when we went public to 65% for the full-year that we just finished. Is that most of our new products are focused on the market segments that Rajesh mentioned, which are generally higher performance markets, we get higher ASPs and higher gross margins. So over time, as those new products become a larger percentage of our sales, that will continue to help expand our gross margins. They're all four tied together, which is why it's all part of one strategy. And I think, of course, we see the benefit of that in the relatively short-term in the coming quarters. So I think as those products, we talked about nine products as they unfold, in the marketplace as we get the design wins, I think it will be really good. So it's -- the typical thing would be to say that in the comms enterprise, automotive, aerospace defense, a rule of thumb would be about 18-months to ramp to revenue. That being said, we actually see sometimes enough of a desire for our products that they get rushed to markets quicker than we or ever thought. Also don't forget that while seven out of nine of these products are in fact meant for these focus segments, the remaining two are in fact for consumer, IoT and mobile. And those balance it out by a shorter design win, let's say, less than a year and shorter time to revenue less than a year. And so to get to its full glory, I think it takes maybe three years for a product in the focus areas. But again, a reminder that none of our products have ever been obsolete from the time we introduced them 12-years ago, 13-years ago, So they still continue to sell. And again, these new products, this looks forward, but we also introduced a lot of products last year and in 2021 and going back to 2020. So even though some of these design cycles can be one, two or three years, we have a number of products that are in the middle of those design cycles, yes. Your line is open. Yes, it's a tricky question to ask and there are some things we don't want to talk about too much. But I think they do have more CMs than anybody else, that's point one. In the case of our largest, historically largest customer, we have spent a lot of time in the past years looking at forecast directly from them and comparing it to forecast from the CMs. So again, given that your -- the sales to your largest customer is going to be basically nominal next two quarters. So first of all, we consciously increased our inventory, as you mentioned $57.7 million at the end of last quarter. And the increase is all in wafer stock, so as we've talked about many times, we get our MEMS wafers from Bosch, itâ\u0080\u0099s our process with their factory. If there's any type of geopolitical issues out there, if there's any type of supply chain issues out there, we have wafer stock that can support a number of quarters worth of sales. So you would expect it to come down during the course of the year to a certain extent, but wafers do not go bad. And quite honestly, this gives our customers a lot of comfort for the reasons that I just mentioned, if there are any type of supply chain issues out there with so many of our customers being single sourced with us, they cannot afford for us to not be able to ship something to them. I'm very comfortable with our inventory and we've done this somewhat deliberately for two, three reasons. One reason is, as we pointed out, none of our products have been obsoleted in the history of the company and wafers \"don't go bad.\" The second is 80% of our business is single source and as we head into the comms enterprise, automotive and aerospace defense markets, it's important for us to reassure our customers that they are in safe pair of hands. We definitely expect it to be more than first half, but there's a case to be made for it to be made for that to be a big snapback to be a real snapback in demand in the second half. I'm just speculating that if it is, I think it gives SiTime a great position to be able to capitalize on that with our programmability with our value proposition, and we think that, that it makes sense for that reason as well. Please standby for our next question. Your line is open. So we will clearly be shipping below end demand, right, because our customers have to work through some of their inventory. Like there really is no way to know right now, but like -- for example, at some point in Q3, Q4, if your largest customer goes from essentially zero to some amount, I'm just trying to get a better shape. I was just essentially trying to ask what Q3 and Q4 could look like on the other side, but I understand that's pretty hard to forecast. Yes, we believe that sales to our largest customer will come back in the back half for two reasons. One, in the first half, they're going to have to consume inventory. If you go back and look at preceding years, that is -- we ship a lot more to them in the back half of the year than the first half of the year. But I think it's safe to say that from the time that we went public, we've gone -- we have about doubled the number of applications. So in other words, we've probably gone from sub-150 to 300 applications, and we continue to add applications every month, really. Our funnel continues to grow very, very solidly year-on-year. every year that we've been here, it's been growing a lot. And that's no surprise given that we've been adding new products, and we've been marketing stronger and so on. as long as our funnel growth continues, particularly around single source, particularly around our focus markets, particularly around our higher differentiated products. But we think that they will grow, but I couldn't say whether they double, and I couldn't give you that level of precision. Just recently, as Rajesh mentioned on the call, we think it's about $2 billion now. And by the end of 2024, we think it goes to $4 billion. Obviously, the decline in our largest customer's revenue is not to our liking, but we understand the situation very well because, as I said, we helped get some clarification in it. We are also on the second half of the year, as mentioned by Art quite confident in the growth of their business. We continue to believe that Q1 is, in fact, the bottom and that we start to get back in Q2 and Q3, Q4, the -- it starts to ramp up. And given the -- even in spite of the complexity, we are able to bring them out and connect with our customers. So all in all, I think we're in a great shape, and we'd love to give you more information as we go further in the quarter. Ladies and gentlemen, this concludes today's conference call."
}