{
    "symbol": "SITM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 22:26:05",
    "content": "  Operator: Good afternoon, and welcome to SiTime's Third Quarter 2022 Financial Results Conference Call. At the conclusion of today's conference call, instructions will then be given for the question-and-answer session. On today's call from SiTime are Rajesh Vashist, Chief Executive Officer and Art Chadwick, Chief Financial Officer. Before we begin, I would like to point out that during the course of this call, the company may make forward-looking statements regarding expected future results, including financial position, strategy, and plans, future operations, the timing market and other areas of discussion. It's not possible for the company's management to predict all risks, nor can the company assess the impact of all factors on its business or the extent to which any factor or a combination of factors may cause actual results to differ materially from those contained in any forward-looking statements. In light of these risks, uncertainties, and assumptions, the forward-looking events discussed during this call may not occur and actual results could differ materially and adversely from those anticipated or implied. For more detailed information on risks associated with the business, we refer you to the risk factors described in the 10-K filed on February 25, 2022, as well as the company's subsequent filings with the SEC. Also, during this call, weâ\u0080\u0099ll refer to certain non-GAAP financial measures, which we consider to be an important measure of company's performance. These non-GAAP financial measures are provided in addition to, and not as a substitute for, or superior to measures of financial performance prepared in accordance with US GAAP. First, I'd like to welcome you as well as existing investors to the SiTime Q3 2022 earnings call. For those of you that are new to our business, SiTime is the leader in a dynamic new product category called precision timing. SiTime created precision timing to service the accelerating need for higher performance, smaller, lower power and more reliable timing chips for applications like automated driving, 5G and data centers. We have shipped three billion units of our precision timing chips to 20,000 customers in 300 applications across all electronics. In 40 years of industry experience, I have not seen a downturn as rapid or as deep as this one. Last quarter, we saw a significant change in market conditions, which has reduced our expectations for the year. While our Q3 revenue, gross margin and EPS were all solidly within our guidance range, we have seen end customer demand slowing, first in consumer then in industrial markets and now in comms, datacenter for fourth quarter '22 and first quarter 2023. This is because while we continue to see normal inventory levels at our distributors, it appears that customers have built inventory at their contract manufacturers. We expect that in all segments, our customers will need to spend the next two quarters working through this buildup. I'd like to discuss four key points: design win growth, increasing ASPs or average selling price, increasing our single source business and higher quote activity, all of which give us confidence in the future. When customers commit to our products, it gives us visibility into their deployment and thus our future revenues. As we have stated before, SiTime's unique future of programmability allows us to give customers the exact function they want. In Q3 2022, we doubled the number of design wins over the same period last year. Not only is our number of design wins and dollar value significantly higher than in 2021, our focus segments, automotive, comms, aerospace, defense, constitutes the large majority of these design wins. Additionally, ASPs have been rising consistently and significantly throughout 2022 and will be higher in Q1 2023 than a year ago. Note that we are not seeing any loss of business to competitors or business that we want, even though availability of the competitors has increased, lead times have shortened, and quarter prices are lower. 80% of SiTime's business is now single source, that is customers buy only SiTime solutions in that design and will buy only from us. A point to note is that this single source position exists independent of segments, excuse me. that it exists across all types of customers, including, for example, the consumer segment. Our fourth and final positive indicator is the rise in our quote activity, which is another indicator of our future business potential. While these positive indicators are indeed quite positive, we're still striking a cautious tone with respect to near-term sales results due to the challenges and headwinds we have seen. We believe that the inventory buildup at customers' contract manufacturers, for example, will take a couple of quarters to return to normal. As we have stated before, to capture the tremendous opportunity in the timing market, we have set a target to expand our SAM or served market from $1 billion in 2021 to $4 billion in 2024 with the introduction of new timing products that -- and we are on track for this. By the end of 2022, we will have introduced six new products, which will expand our SAM in automotive and comms. In 2023, we expect to introduce at least five new products in both oscillators and clocks with the same end market focus. To summarize, our continued strength in design win funnel ASP growth, single source business, and increased quote activity give me tremendous confidence in the future of SiTime. We're delivering strong value to our customers, and there are significant opportunities ahead of us. Today, I'll discuss third quarter results and I'll provide guidance for Q4 and make some comments on 2023. Revenue in the third quarter was $73.1 million, up 16% from the third quarter of last year, but down 8% from Q2. Sales into our mobile, IoT, and consumer segment were $24.2 million or 33% of sales, down 10% from Q2. Sales to our largest customer, which is included in this segment, were $18.2 million or 25% of sales. Excluding sales to our largest customer, sales into this segment were $6.0 million, down 62% from Q2. Sales into our industrial, automotive, and aerospace segment were $25.1 million or 34% of sales, down 22% sequentially. Within this segment, sales into auto were sequentially flat, but sales in the broadband industrial were down more than 35%. Sales into our communications and enterprise segment were $23.8 million or 33% of sales, up 17% sequentially. In addition, we earned $2.5 million in interest income this quarter up substantially from prior quarters as interest rates have recently increased. On the balance sheet, accounts receivables were $44.9 million with DSOs of 55 days. Inventory at the end of Q3 was $45.4 million, up from $34.4 million in Q2. We spent $10.3 million in equipment and assets and ended the quarter with $564 million in cash, cash equivalents and short-term investments. Looking forward, we see slowing sales in comms and data center. These higher-than-normal inventory levels, coupled with lower demand is leading to a classic semiconductor down cycle, and we are not immune. We now expect sales in the fourth quarter will be down between 15% and 20% sequentially, which would be approximately $60 million at the midpoint. Gross margins will be impacted by the lower sales and will likely be around 63%, plus or minus 1 point. In addition, we expect to earn at least $3 million a quarter in interest income. Diluted share count will be approximately 23 million shares and the resulting Q4 non-GAAP EPS should, therefore, be somewhere between $0.50 and $0.60 per share. We don't normally provide guidance two quarters out, we believe we have enough visibility to provide a few comments about Q1. First, we expect the usual seasonal slowdown with our largest customer. And second, we see a coming low in comms and enterprise sales as our customers in that space work through higher than normal inventory. Since Q1 is still more than a quarter out, sales could obviously be higher or lower than that but that's how we see it right now. At these lower sales levels, gross margins will also decline and will likely be in the low 60s. We do, however, believe Q1 will be the low quarter next year and the sales increased sequentially each following quarter. Our process and product development continues as planned, and we expect to introduce more than five significant new product platforms next year and each will span numerous derivative products. Design win activity has been strong, as Rajesh mentioned, and that, coupled with new product introductions and expanding SAM should lead to continued long-term growth for the company, once we get through this semiconductor downturn. Your line is now open. I think what we see is that the inventory buildup has been in a somewhat unusual place in the contract manufacturers, which is typically not the case. We see the demand at comms and enterprise, which is one of the larger declines, that continuing, albeit at a slower pace. But given the breadth of our customers, I think the broad view is that the next two quarters, Q4 and Q1 are going to definitely needed for all that to come through. We've also learned that in talking to our -- to looking at the channel, including the CMs  and we see that in many, many cases, that to be true. I would say that our mix is probably the most influential piece where we are selling more in comps, more in automotive, more in high-end industrial. And finally, I think the introduction of the new products is having an impact. As you know, in many cases, the new product introduction takes a little while to come through for revenue from design wins. But in this case, I think there has been a significant growth of new products, in particular, the Aetna product line and the Elite product line, which has contributed significantly to it. Last time, I commented on how our ASP has grown 30% year-on-year, Q2 2021 to Q2 2022. It may come down in Q1 a little bit over current numbers because of lesser on the mix side, but it will still be higher than what it used to be a year before that. We've always talked about our strategy being developing much higher performance, higher ASP products. Our newer products, again, higher performance, higher ASPs, generally higher gross margins, and that's exactly what we're seeing here. Yeah, I think automotive is going to hold up pretty nicely from Q3 to Q4 and well into next year, when we look at our forecast for automotive, that's definitely a growth segment for us. Our consumer sales will be relatively flat from Q3 to Q4, starting with our largest customer. Our largest customer is 25% of sales in Q3, and it's probably going to be pretty similar to that in Q4. Again, for the most part, it's because they are over-inventoried. So that trend will continue until they work through some of that inventory, then we think we get back on a growth path. And, Suji, I think you rightly identified that, as buffer stock, because that's how we are seeing it increasingly in a continuing uncertain world, site and of supply of both CMOS and analog chips and MEMS chips, we think it's prudent for us to have significant inventory to support our customers who, as I mentioned, are in fact, significantly single source to SiTime. We're also moving into some areas like automotive and aerospace, where it becomes even more critical to our customers to have these. Your line is now open. I guess, for just the first question, last quarter, you talked about sort of the split between precision timing and non-precision timing. So, what we have found more and more is that, most -- there's very little business of ours, which is so-called multi-source; in other words, where we can be easily substituted because the customers either don't want their performance or don't put the supply chain benefits or the quality benefits of SiTime and where they can substitute as readily. And when we exit the year, a large portion of it will be that 80% single source that we talk about. Our design wins in consumers are also, as we look out into the New Year are also at a lower level than design wins in all these other markets that we have spoken about. So I see that trend continuing where single source of high band products and also don't forget that we are introducing six new products this year, which will likely be a single source of customers. And we're going to introduce five new products next year, which will be also significantly single source next year. If you recall on our conference call a quarter ago, we estimated that about 70% of our business was precision, 30% non-precision timing and a bulk of the non-precision timing business was in our consumer space, not our largest customer, but the remaining consumer business. And if you recall my remarks, a few moments ago, that piece of the business declined 62% from Q2 to Q3. And then or just a clarification on your comment about the largest customer, you said would be flat quarter-to-quarter. Your line is now open. Is there anything to call out within like any subsegments, kind of, any insight you have, whether -- comms or the data center versus the enterprise segment is doing particularly. Yes, I think the particular areas, if you were to look at it, would probably be in the data center and enterprise. I think in general, those have been the hot markets and I think those are the ones that have been muting slightly as we go forward based on the over inventory situation we talked about. It seems like you guys have been pretty consistent, pretty well relative to the rest of the industry. So if you recall in prior conference calls, we talked about lead times going out two quarters or so. So I'm not sure I want to call out any particular segment, but I think the segments that we have always talked about being strategically important to us, our comms and enterprise as we mentioned, that is somewhat soft today. If you look at our new product introductions, again, higher performance, higher ASPs, higher gross margins, that's generally in comms, enterprise, and for us, aerospace most definitely, and auto is going to be strong. And extra largest customer, I don't think it's going to be consumer. We don't -- extra largest customer, I don't think it will be consumers that will be leading it. In that case, we want to thank everybody for joining us on today's call, and I hope everybody has a great afternoon."
}