{
    "symbol": "OGI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-11 13:37:05",
    "content": " SG&A, excluding non-cash share-based compensation increased to $12.6 million in Q1 2022 from $10.5 million in the prior years comparison quarter, largely due to higher employee cost due to increased headcount, general wage increases, increased professional fees due to technology fees and the auditor fees from the new requirement to have an integrated audit and higher trade investment and marketing spend initiative tend to support the launch of our new gummy and other derivative products. We are revising the outlook in terms of the total capacity to move from 70,000 to 75,000 based on the improved yields that we have been getting consistently over the last three, four months, and we are operating at capacity now based on the rooms available, and we just by increasing over the last few quarters, we have significantly reduced our cost structure to the point that we've gone from negative adjusted gross margins to positive adjusted gross margins. But we're only going to be planting in the rooms as this demand continues to outstrip our current capacity and based on the success of our products and our plans for innovation and launching new products, we do feel that as we complete the construction and add the rooms to take us from this 55,000 capacity we have today to the 75,000, that we will be able to be operating at or near capacity. But, of course, as well all cannabis companies, if there is an element whereby you're not operating at capacity with the competition in the marketplace, there is a cost or a fixed cost element that won't be a direct charging to cost of sales should we not be operating our capacity, but we feel that there is so much more that we can provide on cost reduction just based on moving from 55,000 to 75,000 and so we think it'll be sufficient buffer should there be sufficient slowing in demand in our products, which again, we do not expect. So we're not – while I recognize your comment that consumers have been swapping between brands, we've seen some pretty sustained demand on our SHRED brand and continued great performance, and we're looking forward to having that extra capacity to be able to expand our distribution. Now, it's hard to say whether that's a level playing field, you have differences in obviously strains and THC, but I feel like the increase in our demand on SHRED has sort of indicated that we're there, we're getting that crossover from the illicit market into legal market."
}