{
    "symbol": "OGI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-04-12 11:44:05",
    "content": " SG&A, excluding noncash share-based compensation, increased to $14 million in Q2 2022 from $10.3 million during the prior year's comparison quarter, and this was largely due to higher employee cost due to increased headcount, including the acquisition of Laurentian, general wage increases, increased professional fees due to technology investments and higher trade investments and marketing spend initiatives. We're confident that we'll continue positive adjusted EBITDA based on momentum over the past few quarters into the future with the increase to our capacity at all our facilities, this will result in economies of scale, which will lower our production cost, which will improve margins. But bear in mind that as we need to continue to invest in our business to support the continued growth, and -- so while we expect to have a growing EBITDA, we're not providing specific guidance at this time in terms of a percent of revenue, but we do expect with all the momentum we have with increasing sales demand, increased capacity to have higher sales throughput with lower cost per unit that, ultimately, we are well positioned to have increased your EBITDA over time. So when we introduce something like our SHRED-X kief-infused blends, we're introducing something new and exciting that’s high potency, really great feedback on our Tremblant hash as we've taken the education of what hash is out to the marketplace, how it's used and done a lot of education with the bud tenders. But I think the other element that's really key is just with overall continued sales growth over the last few quarters and with higher levels of production, we're just starting to achieve economies of scale and getting a lower cost of production on an overall basis, which is helping the margin in all our product categories. Now I'm not indicating that I'm expecting a similar growth to margin in terms of an extra 31% being added on as we go forward to capacity, but it is only to indicate the level of volatility the margin has as a direct consequence of the cost of production and by doubling our -- effectively doubling the output facility at the end of -- as we go into the early parts of next year from where we are today, we'll provide uplift to a reduction of cost is a significant enough that will make a meaningful difference to our adjusted gross margin in those future periods. In terms of Hyasynth, at this point, they're not connected, but for us, the whole focus is around innovation, and we see there's an opportunity that, at some point, we'll look at API that potentially is higher purity, that comes out of biosynthesis that isn't from cannabis plants that might be more appropriate for certain markets. And -- but I think there will be -- with some of the rooms coming on during -- some of the harvest coming on from the new rooms in June, July, that there will be some economies of scale, and therefore, lower cost that will benefit the Q4 margin, but that the real improvement comes after sometime as set on properly at that higher level, which, again, we think we're leaving fiscal 2022 with the full capacity room harvest."
}