{
    "symbol": "NEOG",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-26 14:48:05",
    "content": " The fourth quarter was a strong conclusion to a great fiscal year, reporting revenue growth of over 10% from the prior fiscal year to achieve a fourth quarter with double-digit top and bottomline growth, while preparing for the integration of the 3M business is a tremendous accomplishment and shows the strength of our exceptional team. As John mentioned, revenues for the quarter increased 10% to $140.1 million from $127.4 million in the prior year. For the full fiscal year, revenues rose nearly 13% to $527.2 million from last yearâ\u0080\u0099s $468.5million. Excluding these costs, our adjusted net income was a strong $19.1 million or $0.18 a share, an increase of 21% over last year. Full year net income for fiscal 2022 was $48.3 million or $0.45 a share, excluding the $25.6 million of 3M deal expenses, our adjusted net income was $67.9 million, an increase of 12% over last fiscal yearâ\u0080\u0099s $60.9 million or $0.57 a share. Overall, revenues in the Food Safety segment increased 5% in the fourth quarter and 11% for the year. Highlights from the Food Safety segment for the full year include a 12% increase in sales of our general sanitation line, driven by higher sales of our new AccuPoint reader, which was launched late in our 2021 fiscal year. The increase in Animal Safety revenues for the year was led by a 35% increase in sales of veterinary instruments, particularly our line of detectable needles and syringes, as we gain new business and took market share from a competitor. Cleaner disinfectant sales sold through this segment increased 6%, while our line of rodent control products was down 4% for the year, due to difficult comparisons from a strong fiscal 2021. Sales and marketing expense increased 4% in the fourth quarter and was up 15% for the year, with higher spending on travel and other customer facing activities as COVID restrictions eased in fiscal 2022. Excluding the 3M related professional fees, general and administrative expenses rose 25% for the quarter and 12% for the full year, primarily due to new headcount, increases in bonus accruals due to company performance, higher stock-based compensation expenses and incremental expenses including non-cash amortization from recent acquisitions. Excluding the costs related to the 3M transaction, adjusted operating income for the fourth quarter at $23.7 million was up 17% over the prior year quarter, due to the previously discussed increase in gross margin. And for the full year, our adjusted operating income was at 4.2 million or 16% of sales, compared to $74.2 million or 15.8% of sales in the prior year. We also recorded a $600,000 charge in our first quarter relating to a tax increase in the U.K. We generated $67.6 million in cash from operations for the full year versus $81 million in the prior fiscal year and invested about $25 million in property and equipment and another $38 million in acquisitions during the year."
}