{
    "symbol": "TNC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-25 21:29:05",
    "content": " For full year 2023, we anticipate organic sales growth between 3% and 7% and adjusted EBITDA between $140 million and $160 million. For the fourth quarter of 2022, Tennant reported net sales of $291 million, a 5.3% increase compared to the prior year. APAC net sales decreased 14.2% from the prior year period, primarily driven by organic sales decrease of 7.5%, mainly due to volume declines in China, stemming from the COVID-19 government actions. For the 12 months ended 2022, Tennant reported net sales of $1.092 billion, a 0.1% increase compared to the prior year. Organic sales grew 2.5% in EMEA, primarily driven by higher selling prices in equipment and parts and consumables across the region, partially offset by volume declines due to supply chain constraints and softening demand in the region. The decrease in adjusted EBITDA was due to lower gross margins and unfavorable foreign exchange translation of approximately $12 million, offset by lower S&A, which decreased approximately 5% year-over-year. The increase in cash used was attributable to investments in inventory required to support an anticipated ramp in production, higher accounts receivables due to increased sales to customers with extended payment terms and the timing of a large volume of sales in the back half of the quarter as well as increased cash payments for employee compensation and benefits and income taxes. Full year reported GAAP earnings in the range of $3.10 to $3.90 per diluted share; adjusted EPS of $3.70 to $4.50 per diluted share, which excludes certain non-operational items and amortization expense, adjusted EBITDA of $140 million to $160 million; capital expenditures of $20 million to $25 million and an adjusted effective tax rate of 20% to 25%, which excludes the amortization expense adjustment. And so I would say that in 2023, you saw kind of the increase in interest costs as we went through the year based on the increase in underlying rate on an average basis for 2023, net of hedging activities because we took some decisive actions in the fourth quarter to fix a portion of our floating rate debt, about $120 million or 40% of our debt to fix that out."
}