{
    "symbol": "SLP",
    "quarter": 2,
    "year": 2023,
    "date": "2023-04-05 20:09:08",
    "content": " From a profitability perspective, we maintained solid margins and saw improvement over the first quarter as revenues grew, leading to $4.2 million of net income, or $0.20 per diluted share. Total services projects worked on during the quarter decreased 6% compared to last year, and backlog decreased by approximately $2 million from last year to approximately $15 million. Total R&D costs were $2.1 million, or 14% of revenue compared to $1.6 million, or 11% of revenue last year. Capitalized R&D was $0.8 million or 5% of revenue compared to $0.7 million, also 5% of revenue last year. SG&A expense was $7.8 million, or 49% of revenue, compared to $5.6 million, or 38% of revenue last year. Income from operations decreased 26% to $4 million, while operating margin was 26 compared -- 26% compared to 37% last year. Income tax expense was $0.9 million compared to $1.1 million last year, reflecting an effective tax rate of 18% this year, compared to 20% last year. Year-to-date, total R&D costs were $4.2 million, or 15% of revenue compared to $3.3 million or 12% of revenue last year. R&D expenses were $2.5 million, or 9% of revenue compared to $1.8 million or 7% of revenue last year. SG&A expense was $15 million, or 54% of revenue, compared to $10.6 million, or 39% of revenue last year. Income from operations decreased 47% to $4.9 million, while operating margin was 18% compared to 34% last year. Income tax expense was $1.3 million compared to $2 million last year, reflecting an effective tax rate of 19% this year, compared to 21% last year. Adjusted EBITDA was $9.2 million and adjusted EBITDA margin was 33% compared to adjusted EBITDA of $12.4 million, or 46% margin last year. And so on a year-over-year basis, we should see normalized revenue growth in terms of the software business that inevitably meant that with a seasonality pattern last year, low first and fourth quarter, and this year with a low first quarter, you can lower first quarter and more comparable second, third and fourth quarter delivery of revenue, that the growth rates in terms of the first half of the year, we're going to be depressed and the growth rates in the third quarter and especially the fourth quarter, where last year was a very low revenue quarter would be exaggerated in the fourth quarter evening out as we get to the end of the year."
}