{
    "symbol": "UNIT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 11:45:05",
    "content": " We're building new fiber largely for our wireless customers and then successfully adding additional tenants with very high margins and minimal CapEx, resulting in a cumulative cash flow yield today of 22%, a more than threefold increase from the anchor yield on these projects. Today, dark fiber in North America is an approximately $1.5 billion annual market opportunity and is expected to grow about 10% annually over the next several years. As an example of this focus, today, we're announcing that we recently retermed approximately 1,100 lit backhaul sites with one of our major wireless customers, resulting in a net price increase of approximately 20% as we upgrade these sites to 10-gig, and we're extending the contract term from a blended 2.5 years remaining to eight years remaining. Given the proven success of our anchor and lease-up strategies and the attractive economics of these enterprise opportunities, with payback periods of almost half the initial contract term and cash yields of 50% plus, we continue to actively prioritize these metro markets for expansion in both 2023 and beyond. In looking at our national wholesale network and our 300 metro markets combined, we estimate that less than 5% of our total 8 million strand miles of fiber are actually lit. As of September 30th, Uniti has invested approximately $460 million of capital to date under the GCI program with Windstream, adding around 13,500 route miles and 731,000 strand miles of fiber to our network. Beginning with Uniti Leasing, based on our continued strong lease-up success, we now expect revenues and adjusted EBITDA to be $827 million and $805 million, respectively, at the midpoint, representing adjusted EBITDA margins of approximately 97%. We expect net capital intensity to decline from our current level of approximately 35% to 5% to 10% by 2030 and is indicative of accelerating operating leverage in the business and many years of high margin and high yielding lease-up, including dark fiber, lighting unique long-haul routes and expanding deeper into our existing 300 metro markets. I mean, generally, in the five -- you're right about part of what you said, generally in the -- our anchor yields, whether it's sale-leasebacks or greenfield builds or any other anchor type agreements are in the 5% to 10% range, as you mentioned, 8%. One moment for our next question. One moment for our next question. One moment for our next question. One moment for our next question."
}