{
    "symbol": "UNIT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 09:43:06",
    "content": " Today, dark fiber in North America is an approximately $1.5 billion annual market opportunity and is expected to grow about 10% annually over the next several years. Net income attributable to common shareholders for the quarter was approximately $41 million or $0.13 per diluted share, which includes a $24.5 million goodwill impairment charge related to our Uniti Fiber segment that was driven by an increase in the macro interest rate environment. As of December 31, Uniti has invested approximately $544 million of capital to-date under the GCI program with Windstream, adding around 15,450 route miles and 755,000 strand miles of fiber to our network. These installs add annualized revenues of approximately $2.6 million â\u0080\u0093 for the full year 2022, we installed over 1,100 lit backhaul, dark fiber and small cell sites, adding approximately $12 million of annualized revenue. At Uniti Fiber, we reported revenues of $75 million and adjusted EBITDA of $32 million during the fourth quarter, achieving margins of 42%. Our full year outlook for 2023 includes the following for each segment; beginning with Uniti Leasing, we expect revenues and adjusted EBITDA to be $850 million and $825 million respectively at the midpoint, representing adjusted EBITDA margins of approximately 97%. Turning to slide 13, we expect Uniti Fiber to contribute $314 million of revenue at the midpoint with core recurring revenue is expected to grow 6% from the prior year. For full year 2023, we expect adjusted EBITDA at Uniti Fiber to be $125 million at the midpoint. Net success-based CapEx for Uniti Fiber this year is expected to be $120 million at the midpoint of our guidance, a 10% decrease from levels in 2022. Our guidance contemplates consolidated interest expense for the full year of approximately $550 million, which includes a $21 million write-off of deferred financing costs and $44 million of early repayment premium in the first quarter of this year related to the redemption of our 7.875%  senior notes due 2025. And I think that, you guys had made some comments about how with the kind of new financing, net of the dividends, net of the payments to Windstream of about $100 million a year for the settlement, net of the GCI CapEx that you're making on their behalf that you might be free cash flow positive by the end of 2025 after the dividend."
}