{
    "symbol": "UNIT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 12:56:02",
    "content": " Today, Dark Fiber alone in North America is an approximately $1.5 billion annual market opportunity and is expected to grow about 10% annually over the next several years, reaching approximately $4 billion by 2030, with long haul fiber contributing to the majority of these revenues. Our operational performance in the first quarter was strong and we continue to successfully execute on our strategy of leasing up our existing fiber network with high margin recurring revenue opportunities, while at the same time, pursuing attractive new Greenfield builds. At Uniti Leasing, we reported segment revenues of $205 million and adjusted EBITDA of $199 million, up 5% and 4% respectively from the prior year. As of March 31st, Uniti has invested over $350 million of capital to-date under the GCI program with Windstream adding around 9,500 route miles and 354,000 strand miles of fiber to our network. This wireless backlog represents an incremental $15 million of annualized revenues At Uniti Fiber, we reported revenues of $73 million and adjusted EBITDA of $31 million during the first quarter. We achieved an adjusted EBITDA margin of 43% for the quarter, a 459 basis point improvement from the prior period -- prior year period, Uniti Fiber net success base CapEx was $37 million in the first quarter. Beginning with Uniti Leasing, we still expect revenues and adjusted EBITDA to be $819 million and $797 million, respectively at the midpoint, representing adjusted EBITDA margins of approximately 97%. Turning to slide 10 given the strength we saw in the first quarter, we now expect Uniti Fiber to contribute $309 million of revenues at the midpoint and adjusted EBITDA of $121 million for full year 2022. Net success based CapEx for Uniti Fiber this year is still expected to be $120 million at the midpoint of our guidance, a 12% decrease from levels in 2021. That business is growing at 10%, 15% a year, and we're taking share in new markets with an owned fiber network with substantial lease-up potential. I think this new normal of the level of bookings that that you see -- that we've been producing is a very intentional effort on both the enterprise side and the leasing wholesale side where we've built the teams around the fiber network that we have, particularly around the Windstream settlement fibers that we now have access to, to take advantage of that opportunity."
}