{
    "symbol": "WBD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 12:12:18",
    "content": " Number one, world-class IP content that is loved all over the globe; two, distribution of that content on every platform and device where consumers want to engage, whether it's theatrical or linear or streaming; three, a balanced monetization model that optimizes the value of what we create and drives diversified revenue streams; and four, finally, durable and sustainable free cash flow generation. 06:05 Given the depth of our content, decades of film and scripted and unscripted television series, many of the most iconic brands and franchises, including half of the MGM library, supported by a continuous pipeline of new production, together with the world's news leader, CNN, and a large international offering of live sports, we have enormous flexibility in terms of how we monetize these assets. Your line is open. As we've taken a look at the subscription platform and looking at HBO Max, which Casey is doing such a great job with, we're looking at the data and you could see that there is a huge amount of content and you look at the wealth of the TV library and the Motion Pictures library, that's not being used at all on the subscription platform. Your line is open. Look, I think it's a big benefit that we're a fully diversified company with the largest maker of content and whether it's Ted Lasso or we have over 100 series that we're producing, and more than 50% of those are for third parties, and we're generating a lot of revenue by being a great producer and maker of content. You take a look at what Netflix has done over the last several years and what Disney has done, they've cloud a path and behaviorally people have gotten acclimated to buying content, they got acclimated to watching content on different devices, how to move content around, and here comes this new company with this lane and it's wide -- the middle line is wide open for us to accelerate with the broadest and most compelling IP in the world, whether it's DC or Hanna-Barbera, Loony Tunes, Harry Potter, Game of Thrones, HBO. Your line is open. Your line is open. 48:10 That said, all I've seen so far makes me very, very enthusiastic about the opportunity of the combined product, but a great cadence of content coming to the market here, House of the Dragon for the third quarter, I think it's going to be exciting global phenomenon. Your line is open. So, we believe and we see this in Europe where we tried to offer, we thought that the answer was just to offer niche high quality that you get high-quality shock and all content together with a lot of nutrition, in our case in Europe, together with sport and you offer something that everybody in the family users and the churn goes way down, it's much harder to churn out of a product when your kids use it or your significant other uses it or your mom and dad are watching, but also if you find yourself watching it more often. Your line is open."
}