{
    "symbol": "BKNG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 20:35:05",
    "content": " Room night growth trends have further strengthened in 2023, with January room nights up 26% compared to 2019 or up about 60% year-over-year. Our customers booked an all-time high of nearly 900 million room nights on our platforms in 2022, which was an improvement of 52% versus 2021 and 6% higher than in 2019. In terms of our P&L last year, we reached a new revenue record of slightly more than $17 billion, which was 56% higher than 2021 and 13% higher than 2019 or up about 71% and 24% on a constant currency basis, respectively. We achieved this strong top line result while improving our profitability with adjusted EBITDA of $5.3 billion, increasing 82% versus 2021 and margins expanding by 4 percentage points year-over-year. In the U.S., both our Priceline and Booking.com brands continue to execute well and contributed to U.S. room night growth of almost 30% and gross bookings growth of about 60% in 2022 versus 2019. In the area of alternative accommodations, Booking.com alternative accommodation room nights for the full year grew about 56% versus 2021 and about 11% versus 2019 and represented about 30% of Booking.comâ\u0080\u0099s total room nights. For our alternative accommodations at Booking.com, our room night growth rate was about 15% in Q4 versus 2019 and the global mix of alternative accommodation room nights was about 29%, which was a couple of percentage points higher than Q4 2019 and Q4 2021. When looking at the full year, we are pleased to report that our 2022 room nights were 6% higher than 2019 and our gross bookings were 26% higher and about 36% higher on a constant currency basis. Full year revenue as a percentage of gross bookings was 14.1% in 2022, which was lower than the 15.6% in 2019 due to almost a full point negative impact from timing, about 40 basis points from the slow recovery in our advertising and other revenues, which have no associated gross bookings and about 30 basis points from an increased mix in flights. Our full year adjusted EBITDA was about $5.3 billion, which was 10% below 2019 and up about 6% on a constant currency basis. For the full year 2022, we generated almost $6.2 billion in free cash flow, which was 38% higher than in 2019. When comparing January 2023 with January 2019, room nights were up 26%, a very nice improvement from the 10% growth in the fourth quarter of 2022. We expect Q1 revenue as a percentage of gross bookings to be about 10.3%, a 40 basis point improvement from Q1 2019 due to a less negative impact on timing, partially offset by increased investments in merchandising and a higher mix of clients. For the full year, we expect our 2023 revenue as a percentage of gross bookings to be about 50 basis points higher than in 2022, which will result in year-over-year revenue growth is higher than our year-over-year gross bookings growth."
}