{
    "symbol": "BKNG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 22:39:14",
    "content": " In our accommodations business, we saw meaningful improvement from last year, with first quarter room nights declining only 9% versus Q1 2019 which was an improvement of 12 percentage points from our fourth quarter 2021 results. Our bookings continued to strengthen in April, with roommates increasing 10% and gross bookings up over 30% versus 2019, making April a record month for gross bookings and our first month that global room nights exceeded 2019 levels. And when compared to other platforms like desktop or mobile web, we continue to see more of our business shift to the app with over 40% of our room nights booked through our apps in the first quarter, booking.com app hit a new record in terms of monthly active users in Q1 and continue to be the number one downloaded OTA app globally, according to a third party research firm. Airline tickets booked in the first quarter were up 152% versus 2019 and up 69% versus 2021, driven by continued expansion of booking.com site platform, as well as continued flight ticket growth at Priceline. Consolidated revenue for the first quarter was $2.7 billion, which was down 7% versus 2019 and down about 2% on a constant currency basis, revenue as a percentage of gross bookings was about 150 basis points below Q1 2019 in line with our expectations, due primarily to differences between gross bookings, the timing differences between gross bookings and revenue recognition. About 34% of booking.com’s gross bookings were processed through our payments platform in Q1, up from 13% in Q1 2019 compared to Q1 2021, sales and other expenses as a percentage of gross bookings were about 30 basis points higher. Now moving on to our thoughts for the second quarter, April room nights increased about 10% versus 2019, an improvement from the 4% decline in March, driven primarily by Europe, excluding Russia, Ukraine and Belarus, April room nights increased about 16% versus 2019. April gross bookings increased over 30% versus 2019, driven by growth in room nights continued accommodation ADR strength, as well as continued strength in flight bookings. The timing impact on take rates in Q2 is driven by a combination of the acceleration in gross bookings from up 7% in Q1 to up over 30% so far in Q2 coupled with the lengthening booking window from Q1 to Q2, we expect our underlying accommodation take rates to remain stable. And Glenn mentioned some of the factors, the APAC recovering nicely, down, still down but down IT is not, again the best result we've seen since the start of pandemic, and the rest of world backup to double digits, so all nice improvements from Q1, all nice improves to March, so it's not just one reason we're seeing it across the world, which I think is a positive sign, I mentioned that we will be leaning a little bit more, expect to leaning in more in Q2 than in we did in Q1, relative to the amount of spending and the ROI. So I want to ask you is does that mean that once we get beyond these unusual timing issues for a variety of factors this year, that kind of the normalized take rate is a couple of points higher like 17%, you haven't done that, your booking has done that in the past, but that's going back 5, 6, 7 years. So yes, let's not confuse the difference between impact on EBITDA margin and actual take rates, take rate percentages, what we talked about is the fact that let's go back to numbers so in 2019, and take rates blended across the year was 15.6%."
}