{
    "symbol": "BKNG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 21:05:05",
    "content": " Our customers booked 246 million room nights in the second quarter, so just shy of 0.25 billion room nights, which represented an increase of 16% versus Q2 2019 and a significant improvement from the 9% decline in Q1. We continue to see very strong accommodation ADR growth, which helped drive an even higher 38% increase in gross bookings in the second quarter or 48% growth on a constant currency basis. While we continue to see bookings growth in July versus 2019, the pace of growth moderated to about 4% for room nights and just over 20% for gross bookings or about 35% growth on a constant currency basis with room night and gross bookings growth slightly improving in the back half of the month versus the comparable weeks in 2019. Looking towards the rest of the year, Booking.com, we see solid gross bookings for the fourth quarter, which are about 15% higher than at this same point in 2019 on a euro basis. In terms of attracting customers to our platform, our unique active customers at Booking.com surpassed 2019 levels in the second quarter, driven by very strong growth in returning customers who have not made a previous booking over a year as well as growth in repeat customers. Consistent with the first quarter, over 40% of our room nights were booked through our apps in the second quarter which is about 10 percentage points higher than in 2019. Alternative accommodation in room nights, Booking.com grew about 25% versus 2019 and representing about a third of Booking.comâ\u0080\u0099s total room nights in Q2. Room nights in the second quarter were up 16%, a 25 point improvement from Q1 and our first full quarter of room night growth versus 2019. In the second quarter, we continued to see an increasing mix of our total room nights coming to us through the direct channel versus Q2 2019 and versus Q2 2021. Q2 international room nights were up mid single-digits compared to Q2 2019 levels, which was the first quarter of growth versus 2019 for international. Our alternative accommodations of Booking.com, our room night growth rate was 25% in Q2 versus Q2 2019 and the global mix of alternative accommodation room nights was about 32%, which was about in line with Q2 2021 and a couple of percentage points higher than Q2 2019. Revenue as a percentage of gross bookings was about 275 basis points below Q2 2019, down more than our expectations due primarily to the timing differences between gross bookings and revenue recognition driven by stronger bookings than we expected in Q2. Marketing expense as a percentage of gross bookings decreased by about 40 basis points versus Q2 2019, which is better than our expectations, mainly due to higher than expected marketing ROIs in a high-intent travel environment. We expect the difference between the level of room night growth and gross booking growth for the fourth quarter to be a few percentage points less than the 22% it was in Q2 due to factors, including more FX pressure in Q3. We expect Q3 revenue as a percentage of gross bookings to be about 70 basis points lower than in Q3 2019 due to investments in merchandising, consistent with our prior commentary about the opportunity for us to lean into a recovering travel market in 2022 and due to an increase in the mix of flights and some impact from FX rates."
}