{
    "symbol": "SON",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 18:59:05",
    "content": " In addition, these results are $0.85 ahead of the $1 a base EPS that we delivered in the first quarter of last year, with our legacy businesses driving $0.50 per share of this increase. So, moving down to net income, our first quarter 2022 base earnings were $183 million compared to $101 million last year. Moving across the acquisitions and divestitures, you see a topline positive impact of $141 million, mostly driven by the Metal Packaging acquisition, but also reflecting sales removed with last year's U.S. And finally, the sales impact from foreign exchange in other was negative by $25 million, mostly associated with foreign currency translation on a stronger U.S. dollar year-over-year. Now, moving to acquisition and divestitures, you see the net addition of $49 million of operating profit from our Metal Packaging acquisition as well as the divestiture of our U.S. Lastly, you see that the operating profit change and other was unfavorable by $30 million, with the main driver being higher SG&A expenses that I mentioned before. So, shifting the cash flow on slide eight, about halfway down the slide, you see that our first quarter operating cash flow was $1 million compared with $139 million last year. Finally, we paid cash dividends of $44 million in the first quarter of this year compared to $45 million in last year's first quarter. We're raising our full year base EPS guidance to $5.25 to $5.45 per share, reflecting our first quarter earnings beat as well as our solid outlook for the second quarter. As we come out of the blocks, continue to see just great performance, as I talked to when we first announced the acquisition with the new, almost $200 million of capital spent in that business over the course of two years. So, just a little color on ways we're trying to offset pressures of inflation and other things on upwards, I'm working capital, but I think your range is as good as ours, kind of that $70 million to $80 million higher working capital year-over-year, is what we've got penciled in."
}