{
    "symbol": "SON",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 16:50:26",
    "content": " Based on our first half results and third quarter outlook, we're again raising our full year base earnings per share guidance to a range of $6.20 and $6.30. I'd say the other thing kind of, of note to your question on how we unlock this value, that's exactly what we're focused on now and we want to guide to what we control -- can control and we're -- we've got new and accelerated initiatives really to manage working capital in the future. But we've got that tailwind as that really starts kicking in into next year, synergies from the acquisition and frankly, continued improvements on the capital that the prior owners put into the metal business and that we're putting into the business today, portfolio optimization and I could keep going on. But we've got just, I don't know, 10, 20, 30, 40, 50 number 10-like projects that are in the $1 million, $5 million and $10 million type range that drive us up to that $325 million in capital spending and increased capital spending last year and the returns coming from those are really going to start kicking in next year. In terms of the guide, the real kind of drivers there and how we're thinking about it sequentially from the first quarter, second quarter and then third, as you mentioned, kind of the increasing guide for the year as we are, as Rodger said, really monitoring and participating really actively in our markets and understanding the demand drivers. I would say that, that whole two years and this year, we've been really working on getting price in a really strategic way and thinking about how to deliver value in the right way to our customers and receive the right value for what we're delivering. That's really the driver for how we think that this price/cost curve over the three year period that you're thinking about if you include the last two years, will actually just show if you get to the $250 million to $300 million, just the good work that we've done over the last couple of years."
}