{
    "symbol": "SON",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 12:44:05",
    "content": " Your line is now open. Obviously, that is a real tailwind, but I think that we are very cautious to think a lot about industrial volumes in the fourth quarter and then the first half of next year and really kind of tempering our price/cost expectation to do that. Your line is now open. Your line is now open. On some more serious question, Rob, in terms of your price/cost guidance for the year, I think in last quarter, you mentioned you expected a $250 million to $300 million benefit. Your line is now open. Your line is now open. I'm going to let Rodger handle that, but I don't want to leave that without noting that the commentary about capital investment, growth opportunities, new products, the oil and plastics and our opportunity with a 90% to 95% paper solution, all that is totally disconnected from this conversation around the $180 million, and it is really a walk of several key areas that we are focused on. And then supply management, supply chain, I think, is the biggest opportunity we see over the coming years as we really get into this integrated supply chain on our four integrated businesses and drive continued productivity on how we manage those businesses, how we manage data, giving our plants the best data on a daily basis to make the best decisions to drive productivity and serve our customers. Your line is now open. As I said earlier, we have got a tremendous funnel, we noted here for bringing new capacity on our paper can business here in the U.S. We have got investments going in multiple locations in Europe around our foundational products, but the more exciting is the can packaging type products that are 90% to 95% paper and in Europe, the funnel there is just phenomenal in terms of how many machines that we are going to have to build over the next period of time to service not only Europe, but other parts of the world. So it is an impressive looking runway to the point, I mean, we just looked at a capital review just for North America over a couple of years period that we are going to be spending somewhere around $40 million in that business from a recapitalization standpoint, productivity standpoint and a growth standpoint and that is just in one area of the world. Your line is now open. Your line is now open. Your line is now open. George, I think on the consumer volume fourth quarter, we said that we expect similar volumes in rigid paper containers globally and flexibles and then we are going to see weakness in our resin-based businesses due to the fresh fruit seasonality being down."
}