{
    "symbol": "TSM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-14 13:58:04",
    "content": " We concluded our first quarter with revenue of TWD 491.1 billion or USD 17.6 billion, which is above the high end of our guidance, mainly due to better demand from smartphone and automotive-related applications than our forecast 3 months ago and customer’s continuing need to ensure supply security with the emergency of COVID-related uncertainties. By taking such actions, we do not expect any impact to our 2022 capacity plan, and we continue to work closely with our suppliers on 2023 and beyond so that we can ramp-up our capacity to meet customers’ demand. Operator, can we move on to the next participant, please? And the increasing process complexity of leading nodes such as N3 brings even greater challenges to achieving the corporate average gross margin in 7 to 8 quarters, and partially also because our corporate profitability has increased and our new long-term gross margin target of 53% and higher. Now even considering the increasing process complexity of advanced nodes such as N3, we believe our technology leadership, manufacturing and capacity support and ability to earn our customers’ trust will enable us to earn a long-term gross margin of 53% and higher. Operator, can we move on to the next participant, please? Operator, can we move on to the next participant, please? Operator, can we move on to the next participant, please? Operator, can we move on to the next participant, please? Operator, can we move on to the next participant, please? So Mehdi’s first question is looking at the demand and also by node, he wants to know how should he expect the contribution or the mix from N5 and N7 in the second half of this year. Well, Charles, to be frank with you, our capacity planning, as we said many times, is based on the long-term market demand profile, underpinned by the industry’s megatrend of 5G and SPC and the semiconductor content enrichment in many young devices."
}