{
    "symbol": "GFS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 22:09:04",
    "content": " We will begin today's call with Tom providing a summary update on our end markets, capacity expansion, and technologies, following which Dave will provide details on our first quarter results and also provide second quarter guidance. Moving on to our home and industrial IOT end market, revenue was approximately 17% of GF's total first quarter revenue, and it grew 55% year-over-year. Next, and as expected, our compute end market decline year-over-year, and it comprised approximately 2% of our total first quarter revenue, and expect this market to be less than 5% of our total 2022 revenue. GF delivered operating profit of approximately $279 million for the quarter, which translates into 14.4% adjusted operating margin, approximately 21 percentage points better than the year ago period, and $77 million higher than the high end of our guidance range. Your line is open. And we're expecting every end market to participate in that growth year-over-year in the second quarter with the exception of personal compute, which we expect to really have drop in the first quarter of 2022 and then we expect it to grow sequentially. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. So I would say if you looked at that $4 billion, I would say it's, I would say skewed a little bit more heavily towards 22 through 65 and then of course, some capacity increases all the way down at 12 nanometer in the FinTech corridor, as well as some higher technologies that are specifically asked for from the market. Your line is open. Your line is open. Your line is open. Got it, got it. Got it, got it. As I just mentioned we have incredible visibility into 2023, really on the back of those LTAs that we've signed, I think more recently, we've seen actions in the market by some of our peers to increase prices specifically related to inflation, for example, that's something that we've started speaking to our customers about, in early Q2, and we've been working with them on passing through inflationary costs, so that they have time really to prepare to pass them on to their end customers as well. Your line is open."
}