{
    "symbol": "VFF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 12:09:16",
    "content": " With me for today’s first quarter is Village Farms' Chief Financial Officer, Steve Ruffini and joining us is President and CEO of Pure Sunfarms, Mandesh Dosanjh, and for the first time, our recently appointed Executive VP Corporate Affairs, Ann Gillin Lefever The first quarter of 2022 saw continued strong execution and performance from our Canadian businesses, which was unfortunately somewhat offset by the macro challenges facing Village Farms' Fresh, our Produce business. Quebec-based ROSE Life Sciences, which we acquired a 70% majority interest in November last year had an outstanding and to the year 2020 has continued into the first quarter of 2022 with new product rollouts throughout the first four months to meet the emerging demand for craft, locally grown product and strained variety, including 14 SKUs in Q1 of this year, ROSE has steadily gained market share in Quebec. Consolidated sales for all of Village Farms, Canadian and US cannabis and Village Farms fresh produce for the first quarter increased 34% year-over-year to $70.2 million from $52.4 million for the first quarter of 2021. Net sales from our combined Canadian and US cannabis operations grew 65% year-over-year to $28.8 million from $17.5 million, with just over half of that growth driven by the acquisition of Balance Health and the remainder driven by growth in Canadian cannabis. Canadian cannabis operations delivered another solid quarter with growth in sales of 25% year-over-year to US$21.8 million, driven largely by the addition of ROSE's branded sales and distribution management fees, as well as a year-on-year increase in non-branded sales. SG&A for the Canadian cannabis operations in Q1 was $8.8 million or 32% of sales, compared with $5.5 million or 23% in the same period last year. We have made -- we've been unable to pass on the higher freight and other input costs, Mike discussed to our big box customers due to an oversupply of Fresh Produce in the market, resulting in a negative gross margin of $4.1 million, which drove negative adjusted EBITDA of $6.2 million, compared to a negative adjusted EBITDA of $500,000 in Q1 of last year. But maybe I want to be very clear, our ability to attack different parts of the segment of the market, whether premium or not, we're definitely going to take advantage of that, and you're going to see some really exciting things come out of Pure Sunfarms and Canadian cannabis this year. It's almost like the frustrating thing is I see competitors losing $50 million a quarter or $60 million, and it's almost acceptable because they're a pure play cannabis. So I think you're going to see this ebb and flow, quarter-to-quarter, while it's sell-in, sell-through, but we believe in the trajectory of our revenue and our market share gains, and we believe on the path that we have set forth in Canadian cannabis for this year."
}