{
    "symbol": "VFF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 15:13:11",
    "content": " These are the launch of Pure Sunfarms second brand, the Original Fraser Valley Weed Company, accelerating our innovation strategy to launch more new products more often with a particular focus on new strains, supporting our brands and products with the right commercial effort, and building a solid footprint in international markets modeled on the success of Canadian cannabis business. Turning to the results, consolidated sales of all of Village Farms that includes our Canadian and U.S. Cannabis operations, our VF Fresh produce operations for the second quarter increased 18% year-over-year to $82.9 million from $70.4 million second quarter of 2021. Looking at our individual business segments, starting with cannabis, net sales from our combined Canadian and U.S. Cannabis operations grew 44% year-over-year to $35.6 million from $24.8 million with the increase roughly split between the growth in our Canadian Cannabis business and the contribution of Balanced Health under our U.S. Cannabis business segment. Total cannabis adjusted EBITDA was $2.1 million compared with $7.4 million for the second quarter of last year, with the decrease being substantially the incremental SG&A spend Pure Sunfarms for the investment in various commercial support activities like the new Fraser Valley brand and some which are still to come such as international exports, as well as the addition of Rose operations in 2022, which we didn't have in 2021. Our Canadian Cannabis operations once again generated strong year-over-year growth with net sales for Q2 of this year increasing 25% year-over-year and 38% sequentially to $38 million, which is a new quarterly record. Our Canadian Cannabis operations delivered their 15th consecutive quarter of positive adjusted EBITDA at $3.1 million, which although down from $9.1 million in Q2 of last year is driven by the incremental year-on-year SG&A expense. Given the uncertainty of inflationary pressures and their potential continued impact on Fresh produce, as well as the multiple cannabis growth initiatives before us, that will require additional investment, this morning we will announce that we filed a prospectus supplement for an aftermarket offering of up to $50 million, given the current state of the broader capital markets and with respect to the cannabis sector, more specifically, we believe the ATM mechanism in this environment is an efficient and flexible means by which to access additional capital when needed should we choose to do so. I think one of the key pieces you have to look at Raul is in that valley segment, the pure value segment, which is, index lower than Pure Sunfarms everyday premium price point, we weren't playing, and we tested over the subsequent quarters doing promotional activity on pricing, limited time available on strains to just understand our price sensitivity to the Pure Sunfarms consumer, to understand how, temporary or decreases on products would influence overall revenue growth and share gains in the Pure Sunfarms brand. So with the new initiatives, new strains, new brands, obviously with the -- we'll have obviously naturally because of the -- we're now in Quebec as Canadian Cannabis business, obviously that will be incremental to our Q3 and Q4 because we weren't in Quebec last year at this time."
}