{
    "symbol": "AROC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 16:15:27",
    "content": "  Operator: Good morning, welcome to the Archrock Second Quarter 2022 Conference Call. Yesterday, Archrock released its financial and operating results for the second quarter 2022. During the call, we will make forward-looking statements within the meaning of Section 21E of the Securities and Exchange Act of 1934 based on our current lease and expectations as well as assumptions made by and information currently available to Archrockâ\u0080\u0099s management team. In addition, our discussion today will reference certain non-GAAP financial measures, including adjusted EBITDA, gross margin, gross margin percentage, free cash flow, free cash flow after dividend, and cash available for dividend. During the second quarter, we continued to see a significant acceleration of customer activity and a strengthening of supply-demand dynamics for large midstream compression. Our focus in the quarter was converting this growing customer demand into high-return bookings, delivering profitable growth and maintaining capital discipline. Second quarter highlights include that we generated adjusted EBITDA of $99 million, reflecting solid underlying business performance that was generally in line with our internal expectations. In addition, quarterly results benefited from a net gain on the sale of assets as we continue to advance our fleet high-grading strategy. Strong customer demand and are well positioned and configured fleet of large horsepower compression equipment drove an increase in operating horsepower of 100,000 horsepower, excluding asset sales. Last, AMS revenue increased nearly 50% on a sequential basis due to a welcome resurgence in overhaul and maintenance activity by our customers after years of deferrals. More recently, uncertainties around a potential for recession have emerged, sending oil and gas prices lower, albeit to levels that continue to stimulate increased investment by producers. For gas, Europe is now facing severe natural gas shortages due to its dependence on the Russian supplies, and the global tightness weâ\u0080\u0099re seeing in oil and gas markets is largely the result of years of structural underinvestment and issue without an immediate solution. The energy industry and our business may not be entirely recession proof, but commodity demand has historically remained resilient in periods of economic weakness and current supply constraints for oil and gas are likely to persist. In particular, we remain encouraged by the growing potential for another wave of LNG projects in the middle of this decade that would result in a meaningful call on U.S. natural gas production, and therefore, our natural gas compression services. In our contract operations segment, demand for our large midstream compression accelerated across geographies, customers and horsepower categories during the second quarter. You can see the positive impacts of this demand in our results through increased horsepower growth, increased utilization and increased pricing. The 100,000 horsepower of organic horsepower growth that we delivered in the quarter was driven by several factors, including strong customer demand as seen in our bookings, and start activity as well as low levels of stock activity. Demonstrating how quickly the market has recovered and is growing, we started a total of 155,000 horsepower during the second quarter, the highest level of quarterly start activity that weâ\u0080\u0099ve seen since 2019. Similarly, equipment stop activity has fallen to historically low levels as customers take advantage of higher commodity prices, and as the market supply of available horsepower is extremely limited. Looking ahead, with year-to-date bookings up 100% compared to the first half of last year, we have good visibility into accelerating start activity over the next several quarters. Our horsepower utilization exited the quarter at 87%, up from 84% at the end of last quarter. Weâ\u0080\u0099re effectively sold out of several horsepower categories, and based on our assessment of the market today, we expect to test new highs in total fleet utilization by the end of the year. During the quarter, we continued to transform and standardize our fleet with additional noncore asset sales totaling 97,000 horsepower, creating significant long-term value for our truck. Weâ\u0080\u0099re selling horsepower at attractive multiples and redeploying the proceeds to help advance our strategic priorities and to fund our investment in new, standardized large horsepower. These strategic divestitures are accretive to our leverage, have improved our returns, and position us well to continue to reduce greenhouse gas emissions from our fleet. During the quarter, we incurred higher costs primarily due to 2 dynamics. First, the steepness of the current recovery is requiring significant make-ready and labor expense to meet higher customer demand. However, this has been a particularly difficult environment to quickly and efficiently shift into growth as weâ\u0080\u0099ve only recently emerged from a downturn, a period where our field organization was operating as leanly as possible and as labor availability across the industry is exceptionally tight. Second, U.S. inflation hit a 40-year high during the quarter and we experienced the impact of higher prices across our major cost categories of labor, parts and lube oil, though due to the pace and magnitude of this current high inflation, we experienced margin compression in the quarter, we are confident in our ability to mitigate these impacts. We expect capacity across the industry will remain limited in light of continued capital discipline and extending lead times for new large horsepower units, which has already allowed us to increase spot prices to record levels. In the coming quarters, we intend to reclaim the increasing costs weâ\u0080\u0099re currently experiencing as we raise pricing on our installed base of operating horsepower, which we expect to translate into improved financial performance in 2023. As the current upcycle unfolds, I remain confident that our investments in our customer base, our fleet, our technology and our talent will continue to pay dividends and differentiate our truck. Moving to our aftermarket services segment, second quarter performance was sharply improved. Of note, we believe industry-wide labor scarcity is driving more outsourcing of maintenance, which is typically higher margin work for our AMS segment. In addition, given the nature of our AMS business, weâ\u0080\u0099re able to pass through cost inflation to our customers more quickly to protect our margins. Turning to new ventures, the second quarter was busy for the team. Beyond ECOTEC, our internal team has been tasked with exploring potential improvements in compressor operations and design as well as evaluating potential partnerships with additional third parties with the goal of assisting our customers to achieve improvements and emission performance. These efforts to develop solutions to help our customers decarbonize further solidify our commitment to and support the role we expect natural gas will continue to play as environmentally, economically and strategically sound energy source for America and for the world. Turning to capital allocation, we intend to make high-return investments in our fleet to grow prudently and profitably with our customers, continue our dividend commitment all while maintaining a healthy balance sheet and financial flexibility. First, customer demand is robust, and we are responsibly increasing our investment in our fleet as planned so that weâ\u0080\u0099ll have equipment available in configurations desired by our customers. Weâ\u0080\u0099re doing so at high returns and believe returns on our new build investments are poised to strengthen further as utilization increases, capital discipline in the industry persists, and lead times extend. And now with a much improved investment environment, weâ\u0080\u0099ve essentially prefunded our growth investments in higher profit, large midstream compression units. In summary, weâ\u0080\u0099re seeing levels of horsepower start activity in bookings, not seen since the 2018 through 2019 phase, and we achieved solid second quarter results. Weâ\u0080\u0099re in an enviable position in the industry, with the largest fleet of high-demand large horsepower units, the highest liquidity, and the lowest leverage among public outsourced compression providers. In the short term, weâ\u0080\u0099ll be focused on navigating this reactivation phase of the up cycle with disciplined cost management, and by continuing to use price increases to gain ground against the inflation-driven cost increases weâ\u0080\u0099re experiencing. In the medium-term, we expect to see the full top line benefit of higher horsepower, a decline in reactivation costs and pricing to catch up with our cost basis. And as weâ\u0080\u0099ve done in the past, weâ\u0080\u0099ll also continue to drive efficiency improvements to enhance the profitability of our business. We believe the growing demand for energy generally and natural gas in particular, constraints in the supply of compression equipment as well as disciplined capital spending by the oil and gas sector, support well the strong and growing demand for the compression services of Archrock. With that, Iâ\u0080\u0099d like to turn the call over to Doug for a review of our second quarter performance and to provide color on our updated 2022 guidance. Compared to the first quarter, we increased our total gross margin by $2 million, largely consistent with our internal expectations. Turning to our business segments, contract operations revenue came in at $166 million in the second quarter, up $3 million or 2% compared to the first quarter. This reflects incremental costs associated with the increased revenue and operating horsepower growth that we delivered in the quarter as well as higher parts, labor and lube oil prices. In our aftermarket services segment, we reported second quarter 2022 revenue of $50 million, up $16 million from last quarter and $18 million compared to the year ago period. Growth capital expenditures in the second quarter totaled $38 million, up from $29 million last quarter as we invested in new equipment to meet customer demand. Managing our debt during this period of investment in our fleet continues to be a primary focus for Archrock, and we are committed to bringing our leverage down to our long-term target of 3.5 to 4x. Cash available for dividend for the second quarter of 2022 totaled $52 million, leading to healthy second quarter dividend coverage of 2.3x. As we reinvest in our business, our quarterly dividend will remain a fundamental pillar of our 2022 capital allocation, reflecting our confidence in Archrockâ\u0080\u0099s strong cash generation capacity. Moving on to our updated outlook, we are tightening our full year 2022 adjusted EBITDA guidance range to $330 million and $350 million. For contract operations, we are increasing our revenue expectations for the year due to a faster-than-anticipated activity recovery and our expectation that pricing will continue to move higher. As we absorb the cost of higher start activity and inflationary pressures discussed today, we anticipate a temporary and modest step down in gross margin percentage during the second half of the year. However, our gross profit in the second half of the year is still expected to be higher than the first half, and we intend to reclaim margin on a percentage basis next year as we increase pricing on our installed base of horsepower and as make-ready costs normalize in later stages of the recovery. Turning to growth CapEx, we continue to hold the line on $150 million for 2022, as we remain focused on balancing appropriate levels of investment, leverage and return of capital to shareholders. We actually started increasing pricing this year at the end of 2021, and the process where we get to reclaim pricing overall really is driven by utilization being much more in the mid-80% range, that it is full utilization. So as weâ\u0080\u0099ve been with our large horsepower and that higher level of utilization, weâ\u0080\u0099ve been increasing pricing and stepping it up, I think, issue we encountered is the steepness of this inflation curve in the immediate environment is one that we need to continue to raise pricing to compensate for. And since weâ\u0080\u0099ve been at this now throughout the year, give us 12 months, 4 quarters, plus or minus to reclaim the amount of inflation and cost increases that weâ\u0080\u0099ve seen hit our margin. We expect to test new highs, both in utilization and in the future as well as continue to drive new highs in profitability, with the upgraded fleet that we operate today, the upgraded systems weâ\u0080\u0099ve put in place as well as the extremely Iâ\u0080\u0099d say, robust and strong market we see for compression equipment ahead. The primary categories, but the market has depleted and itâ\u0080\u0099s across the market, not just at Archrock is the largest horsepower categories are what is really super tight today. And that is the only place where weâ\u0080\u0099re effectively spending capital for large, which is for large horsepower gas-driven engines. For completeness, the other area where we are investing, and it does include some smaller horsepower is an electric motor drive as the industry is focused on managing and reducing greenhouse gas emissions, we are seeing slowly upticking in developing market for more electric motor drive horsepower across horsepower classes. What I would share with you is that we have experienced this level of cyclical impact where we move through a redeployment and investment phase, and that includes spending more even while pricing is tight and tough because we havenâ\u0080\u0099t yet seen utilization tick up to give us enough pricing prerogative. So because we have experienced this in the past with such great clarity, by the way, Iâ\u0080\u0099m ambitious that, yes, over the long term, we expect to continue to drive profitability improvement in this business as we have in the past. But let me add to that a little bit of the grid -- as Bradâ\u0080\u0099s right, obviously, weâ\u0080\u0099re not ready to give guidance for next year. So to answer the question, what I would say to you is, of course, weâ\u0080\u0099d love to get back into the mid-60s and weâ\u0080\u0099d like to see that as a result of both higher price and lower costs, it will be a bit dependent on both and really what our focus on is managing the costs, of course, the very best we can and also trying to be effective in forecasting what we think those cost increases can be so that we can set that in our rates going forward. Well, let me talk first about where weâ\u0080\u0099re at in the business, and Doug will talk a little bit about the accounting on what the expectations might be for this. But on the business itself, we do expect that in 2022, weâ\u0080\u0099re going to spend the year converting this proven technology into an oil and gas application demonstrating it with our customers. But again, as we outlined, we believe weâ\u0080\u0099re going to be providing a really strategic service to our customers thatâ\u0080\u0099s ancillary to what we already do as our customers look for methane emission reduction strategies and look forward to this as -- be thinking about it more as a longer-term investment and one where weâ\u0080\u0099ll create value in a variety of different ways. Some of it is outsourced, thatâ\u0080\u0099s likely to be a growing market, but we do not see that as either of those as substantial demands or substantial markets of high demand for compression at this time. As we noted, we continue to drive strong customer activity and believe we are well positioned operationally and financially to capitalize on opportunities in our business as the demand for our services increases."
}