{
    "symbol": "ISO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 15:24:07",
    "content": " But also, it's a lab tools profile that I think is really attractive and that one, we can drive commercial productivity with a small benchtop instrument to drive land and expand, which we're already seeing and I alluded to, again, on a smaller number, but the 35% sort of repurchase in Q2. We're not going to see the impact of the mix probably until Q3 or Q4 of next year, the CodePlex product itself is, if you think about, think about it on a per sample per well basis, it's more like you're doing on an IsoSpark you're doing something like, 80 wells or 80 samples per run in triplicate. But a lot of them said, point to a couple of things, when you're immune monitoring, which is very different than our cell therapy, sort of pre-infusion product analysis, when you're immune monitoring patients, which is this, the largest area of sales for flow cytometry, are sort of new dimension of cell behavior, this functionality that you're getting for every cell phenotype is showing itself to be, predictive relative to flow cytometry. And, we'll come out with more information as we have it, that that becomes really attractive to flow that too, because a lot of them are trying to map what we do on to the traditional sort of flow, surface marker phenotyping tools, and you offer more surface marker phenotypes from let's say, immune cells, meaning you get more, you kind of getting more value, for every run, you're getting multiple cell phenotypes per run, plus all the additional cell output proteins that we offer. And the sort of European slowness and I suspect, right, that, we'll be in a position at some point in those two markets to continue what we had is growth, we had a really exciting pipeline in China, it's just tough to actualize things like people that put a budget for our system and tenders and stuff like that, when people can't actually sort of see each other. So I think the second thing is, when we look at our pipeline, and we look at what's available with the cell analysis business with full cognizance of what you just said, what we see as an opportunity to sort of continue along the lines of what John Strahley alluded to, as far as advancing the installed base, and sort of leveraging who we have the repeat purchasers that we do, and continuing. We do think of it as an incremental in some respects, like if you go to some of our, like, when we talk to some of our pharmas that use our systems and then purchase five, six, seven systems in the last couple of years and we did the with the customer what we do know is people love things that eliminate the labor constraint or labor technician training that's going on with a high turnover, biotech biopharma market right now just given -- it's not abated, right let's call it the, the importance of the cell therapy, immunotherapy market and the importance of hiring people from those companies."
}