{
    "symbol": "TDUP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 21:33:09",
    "content": "  Before we begin, Iâ\u0080\u0099d like to remind you that we will make forward-looking statements during the course of this call, including, but not limited to, statements regarding our earnings guidance for the first fiscal quarter and full year of 2023, future financial performance, market demand, growth, prospects, business strategies and plans, our ability to attract new buyers and the effects of inflation, increased interest rates, changing consumer habits and general global economic uncertainty. Excluding the $2.1 million breakage benefit, our gross margins came in at 61.9%, while our U.S. gross margins were up slightly to 71.4%, the 420-basis-point decline in our consolidated result over the same quarter last year was due to the outperformance in our lower margin European business, which is a large portion of our consolidated results for the fourth quarter. Excluding the breakage benefit, our adjusted EBITDA loss was $8 million or a negative 11.5% of revenue, an approximate 300-basis-point improvement compared to the same quarter last year as we tightly managed expenses and leveraged our investments. For the full year of 2023, we expect revenue in the range of approximately $310 million to $320 million, gross margins in the range of approximately 66% to 68% and adjusted EBITDA loss of approximately 8% to 6% of revenue and basic weighted average shares outstanding of approximately $105 million. And so now I think as we turn the page into 2023, feel like the macro environment is more stable, we feel very comfortable spending into that with the economics that weâ\u0080\u0099re seeing and so you should start to see that improve as we move through this year. They have some revenue concentration in a few key markets, where I think, itâ\u0080\u0099s like -- itâ\u0080\u0099s incrementally less competitive than it is in the U.S. And so I think the resale business in Europe, I think, as we invest more dollars in that business can have greater sort of share gains across kind of value retail."
}