{
    "symbol": "CE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 13:28:03",
    "content": " Your line is now live. But secondly with these low-energy prices that we're seeing and the ability to replace our higher-cost inventory with lower-cost inventory, that's resulting in better pricing for our European customers and so the arbitrage we expect will be closing here at the end of the first quarter and into the second quarter. Your line is now live. We've been working cross selling, we've really the team has been doing a great job working all of these things to really drive back to where we believe we should be at that $800 million EBITDA run rate by the end of 2023, obviously these things take a few quarters to get going, but we do think we'll be back at that maybe kind of historical level DuPont had of $800 million by the -- again, by the end of 2023. So in terms of getting the $700 million in EBITDA this year, you'd have to average, I don't know, $200 million or so for the next -- for the second, third and fourth quarters. So if you look at all those things and start adding up those volumes and the recovery, M&M was affected in fourth quarter and early part of first quarter with the very same factors we were, right, with the same destocking, with the same seasonality and slowdown -- and we are seeing them recover from that as well, again, in March and as we move forward into second quarter. Your line is now live. If we see that same $200 million improvement in working capital and we saw inventories move up a little bit just with the lower demand in the fourth quarter, then we would see free cash flow likely a little lower than that 1.5 billion just because of the lower earnings that we have. Your line is now live. So if you do deliver, say, 7.25 EBITDA from the M&M business this year, is it correct to interpret that we'll actually see it reported at something like 8.25 or so higher in EM EBITDA, but also, I don't know, $100 million or so higher other costs to offset that. Your line is now live. Your line is now live. But I would say for the next several years, I would consider them roughly equal, because we also have the Clear Lake project coming on this year, which is going to add another $100 million to acetyls. Your line is now live. Your line is now live. Your line is now live. Your line is now live. So that's kind of like at an $85 million range, which really aligns pretty well with the IHS outlook this year, which they're forecasting an increase of 3.6%. Your line is now live. Your line is now live. Your line is now live."
}