{
    "symbol": "CE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 14:26:03",
    "content": " I think if we look at DuPont's M&M performance, I mean, we're seeing the same numbers you are so we don't have any insight into Q2. If we look at our performance of Acetate Tow, I mean, while historically, we were really focused on delivering our customers with kind of unparalleled quality and security of supply, both of which came with longer-term contracts, we've clearly seen in this period of rapid raw material price escalation and rapid escalation of energy pricing, that this method of using fixed contracts is really unsustainable. I would characterize it, Ghansham -- I think our focus in the Acetyl Chain have done a tremendous job really flexing the chain over the last, call it, 2 years to really respond to the difference in Western Hemisphere economics versus China and to really move as much down the chain as we can. And then I think like you saw us do during COVID, with higher material pricing right now for steel and everything else, although we start to see it coming down, with trying to get a clearer view of demand in 2023, we think there's going to be some opportunity to delay some of the larger capital projects and use that time, like we did with Clear Lake, to get some efficiencies and savings in terms of construction costs and how we actually contract for the construction of those facilities. It's an interesting question and I have to see the data because I'm not -- if I'm looking, thinking on my own memory, I'd actually say within Celanese, our acetyl units are running probably more reliably than they have in their history. The 1 thing I would add though, Matthew, I think it's important, we brought this up on other calls is we are starting to see with some of the logistical challenges, we're seeing more Western Hemisphere downstream demand come back online and the demand is higher. And because of that logistical dynamic that I talked about a few minutes ago, I mean, that certainly is holding things up because it's really expensive to move product right now, even if you can get the boats out of China into Europe or the U.S.\n And then, Lori, I think you mentioned the currency headwind of about $10 million in the second quarter. Now as we move forward and if we continue to stay at this kind of $60 per million Btu we're seeing today as we move into the winter period, I do think we will see energy pricing, not necessarily the pass-through on our materials, but just energy pricing for producers of goods in Europe being negatively impacted by energy, whether it be price or even availability at a certain point in time. But the kind of levels we're talking about now, $50 million this year, maybe $50 million to $100 million next year, these kind of levels are things that we think it makes sense to do just in light of the deal and the opportunity we may have to more efficiently produce from the DuPont assets and in light of current high prices for contractors, for steel and for all of those other things, just slight delay in a bit."
}