{
    "symbol": "CE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 16:39:07",
    "content": " Please proceed with your questions. I mean, it's coming from about what we think is going to be around $500 million this year for the M&M assets in EBITDA to $800 million that looks really big. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Yes, I think that's one of the big differences we saw in third quarter, Jeff, as we saw VAM in China, which had still been running quite attractively, I'd say, kind of $1,400, $1,500, really come down to about $1,000 a ton at the - by the end of the third quarter, which is, we believe, pretty much at the cost curve in China. Yes, Jeff, I think, two times I think over the past 15 or so years where we've had to really pull back hard with a heavy focus on near-term cash, and I think that was coming out of the economic crisis, 2008 and '09, and then again in the early days of COVID in 2020, and that really focuses around cash collection and harvesting of cash, which, as I mentioned before, we feel very comfortable with as we work our way into the first part of next year. Please proceed with your questions. Please proceed with your questions. Yes, I think, we expect the annual impact this year to be about $100 million, which is not unlike the impact that we have in totality at Celanese today, and so it's a little higher weighting than what we see in our base Engineered Materials business. Please proceed with your questions. I mean, it's the growth in auto, it's the margin lift in GUR due to full utilization, it's the margin lift in LCP due to high utilization and growing 5G applications, it's getting the full value from Santoprene now that we've had the opportunity to take pricing actions and other actions to get Santoprene margins so - and getting the full value of KEPCO for the year as well as kind of double-digit growth that we've been seeing in medical. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. I mean, at the end of the day, I think the - what we've stated we're pushing towards to get to for next year just given the current conditions would suggest that somewhere in that Q3 range is probably somewhere close to that, but I think a lot - every situation is different, and it's really about making sure that we are managing the business on a daily basis to maximize earnings, to maximize cash flow and value creation. Please proceed with your questions. And in Asia I think maybe to give you an idea, Asia saw a strong industry growth, about 21% in Asia, 30% in China, and with the additional volume from KEPCO, the growth in EVs, the project pipeline, the GUR expansion, the stuff we've done on Asia localization, we were up - well, really 27% globally, a lot of that in Asia, and all of our regions were up about 20% versus last year. Please proceed with your questions."
}