{
    "symbol": "DOW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 12:16:04",
    "content": " We proactively lowered our operating rates to effectively manage working capital, implemented operational mitigation plans and cost saving measures and prioritized higher-value products where demand remained resilient, including in functional polymers and performance silicones as well as in mobility, renewable energy and pharma end markets. In the Packaging & Specialty Plastics segment, net sales were $6.1 billion, down 16% year-over-year as price gains across all regions and functional polymers were more than offset by lower polyethylene and olefin prices. Operating EBIT for the segment was $655 million compared to $1.4 billion in the year ago period, primarily due to lower integrated polyethylene margins. Sequentially, operating EBIT was down $130 million as lower raw material and energy costs were more than offset by lower polyethylene prices and operating rates. Operating EBIT for the segment was $164 million compared to $595 million in the year-ago period, driven by lower demand and increasing energy costs, particularly in Europe. And in the Performance Materials & Coatings segment, we reported net sales of $2.1 billion, down 20% year-over-year as local price gains for performance silicones and architectural coatings were more than offset by lower prices for siloxanes and acrylic monomers. And then $500 million will just be reduced spending, turnaround spend, which Howard had mentioned, $300 million, leveraging our volume on lower purchased raw materials, logistics and utilities because we do see some supply/demand imbalances and the ability to do that and just tightening the belt to this environment. I would also just say that, I mean, when you think about that earnings corridor of 6% to 12% and then moving to the middle of the decade into the $7 billion to $13 billion range with all the CapEx and OpEx investments we're making, if you just want to look at the mathematical average, right now, that's about a $9 billion normalized through the cycle."
}