{
    "symbol": "MFIC",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-04 23:41:06",
    "content": " We ended the quarter with net asset value per share of $16.07, up $0.05 or 0.3%, driven by our corporate lending portfolio, which continues to perform well as well as the accretive impact of stock buybacks. First, as a result of the stability we expect to continue to see from Merx, during the recorder, we recap the capital structure and receive $6.9 million of interest income from Merx during the September quarter, 2.1 million more than last quarter. Although these sources of income can fluctuate from quarter-to-quarter, we expect to generate approximately $3.5 million of fee and prepayment income per quarter on average. Conversely, although we earned a $2 million dividend from MC during the September quarter, we expect to earn approximately $1 million on average going forward, a level consistent with prior periods. Moving to AINV’s investment activity, new corporate lending commitments for the quarter totaled $222 million across 18 companies for an average new commitment of $12.3 million, 88% of the new commitments were leveraged lending, 5% lender finance, 5% asset based and 2% life sciences. Given the stabilization of Merx, during the quarter we recast at $4.5 million of Merx equity into debt, and as Howard mentioned, AINV received $6.9 million of interest income from Merx during the September quarter, $2.1 million more than last quarter. Total investment income was $52.9 million for the quarter, up 4.6% quarter-over-quarter, reflecting higher interest income and higher dividend income partially offset by a decline in prepayment and fee income. As Howard mentioned, fee and prepayment income can fluctuate quarter-over-quarter, but we expect to generate approximately $3.5 million of fee and prepayment income per quarter on average. We’re in the September quarter or corporate lending, portfolio had a gain of $5 million or $0.08 per share partially offset by $1.3 million or $0.02 per share on non core and legacy assets. Since the end of the quarter, AINV has purchased an additional 308,000 shares at an average price at $13.30 for a total cost of $4.1 million, leaving $14.9 million of authorized -- authorization for future purchases under the Board's current authorization."
}