{
    "symbol": "LVOX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 23:27:02",
    "content": " Our total revenue for the first quarter was $32.1 million, 15% higher than the first quarter of last year and 1% higher than last quarter and at the high end of our guidance range of $31.1 million to $32.1 million. This was supported by continued strength in our contract revenue, which was $25.2 million for the first quarter, 21% higher than the first quarter of last year, 4% higher than last quarter and above the high end of our guided range of $24.4 million to $24.9 million. Our excess usage revenue in the first quarter was $6.9 million, down 4% year-over-year and in the middle of our guided range of $6.7 million to $7.2 million. Our adjusted gross margin for the first quarter was 60.4%, an increase of 140 basis points versus last quarter and our previous guidance for this quarter, driven by cost efficiencies we are driving now that we have made the full transition to our public cloud platform on AWS. Our adjusted EBITDA for the quarter was in the middle of our guided range at a negative $8.3 million, down $1.3 million from the last quarter, driven by $1.9 million of increased operating expense offset by $600,000 of improvement in adjusted gross margin, all consistent with the construct of our previous guidance. Our CapEx for the first quarter totaled $500,000, $300,000 higher than the first quarter of last year and higher than normal due to the additional $400,000 of refurbishment expense for our office in India that, as you may recall, also impacted our fourth quarter CapEx expense. We expect second quarter total revenue to be between $33.2 million and $34.2 million, 15% to 18% growth over the second quarter of 2021. We expect contract revenue to be between $26.3 million and $26.8 million, 18% to 20% growth over the second quarter of last year and we expect excess usage revenue to be between $6.9 million and $7.4 million, 5% to 13% higher than the second quarter of last year. We expect our adjusted gross margin in the second quarter to be around 61.5% for the quarter, about 110 basis points higher than the first quarter and we continue to expect that this will trend towards the mid-60s by the fourth quarter of this year as we continue to optimize our AWS costs and scale in the public cloud infrastructure. We expect our adjusted EBITDA to be between negative $6.7 million and negative $5.7 million in the second quarter, a $2.1 million sequential improvement over last quarter based upon the midpoint of this range and we continue to expect a trend towards adjusted EBITDA breakeven by the beginning of 2024, as we laid out on the call last quarter. So to recap, we continue to expect our total revenue for the year to be between $140 million and $142 million or 17% to 19% growth over 2021."
}