{
    "symbol": "LVOX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 16:34:12",
    "content": " Our total revenue for the second quarter was $33 million, 14% higher than the second quarter of last year and 3% higher than last quarter and $200,000 below the low end of our guidance range of $33.2 million to $34.2 million. Our contract revenue was strong for the second quarter at $26.8 million which is 20% higher than the second quarter of last year, 6% higher than last quarter and at the high end of our guided range of $26.3 million to $26.8 million. However, our excess usage revenue in the second quarter was softer than we expected at $6.2 million down 5% year-over-year and down 10% from last quarter and below the low end of our guided range of $6.9 million to $7.4 million. While we saw an unexpected dip in call volumes and excess usage revenue in May and June that negatively impacted our excess usage revenue in the quarter, we have experienced broad-based strength in call volumes since the beginning of July, consistent with the directional improvements we expected to occur in the second half of the year which formed the basis of our previous revenue guidance for the year which I'll get to later in the call. Our net revenue retention as of the end of the second quarter was 108% versus 105% in the second quarter of last year and 113% last quarter, negatively impacted sequentially by the softness in excess usage revenue that I just described, as well as the effect of some of the contract resets we did earlier this year in response to the CFPB rule change in December that we talked about on our March call. Our adjusted gross margin for the second quarter was 64.2%, an increase of 380 basis points versus last quarter and 270 basis points above our guidance for the quarter driven by accelerated cost efficiencies now that we have transitioned to 100% of our customers to the public cloud. Our adjusted EBITDA for the quarter was a negative $5.6 million, a $2.8 million improvement from last quarter and better than our guided range of negative $6.7 million to negative $5.7 million, driven by $1.8 million of sequential improvement in adjusted gross margin and $1 million of sequential improvement in operating expenses, as we actively manage our cost structure to drive towards a more balanced growth model as Louis described earlier. Our CapEx for the second quarter totaled $236,000 for a total year-to-date CapEx of $772,000, reflecting the highly capital-efficient nature of our 100% public cloud product platform and helping us to manage our cash utilization for the quarter to only $3 million, resulting and a quarter-ending balance in cash and cash equivalents and marketable securities of $77 million versus $80 million at the end of last quarter. We expect third quarter total revenue to be between $35 million and $36 million, 15% to 18% growth over the third quarter of 2021. We expect contract revenue to be between $27.5 million and $28 million, 19% to 21% growth over the third quarter of last year and we expect excess usage revenue to be between $7.5 million and $8 million, 1% to 7% higher than the third quarter of last year. And just to be clear, with the investments that we've made to be 100% in the public cloud and the cost optimizations that we still have in front of us, we expect our adjusted gross margins to continue to improve throughout next year as well, albeit at a lower rate of improvement than this year, with the fourth quarter adjusted gross margin we achieved this year as the starting point for 2023. We expect our adjusted EBITDA for the third quarter to be between negative $3.6 million and negative $2.6 million, a $2.5 million sequential improvement over the second quarter, based upon the midpoint of this range and we now expect to achieve adjusted EBITDA positive results by the fourth quarter of this year, as Louis mentioned earlier, about five quarters sooner than we had previously guided. In terms of the components of revenue, we're updating our full year contract revenue to $108 million to $109 million and updating our range of excess usage revenue guidance to $28 million to $31 million, again, based upon the softness we experienced in the second quarter, although, assuming the same pathway of improvement that we built into our previous guidance and supported by the strong usage activity of our customers that we have seen since the beginning of July. And lastly, given the adjusted EBITDA trajectory we are now forecasting, coupled with our relatively small interest and CapEx burden, we expect to be free cash flow positive by the second quarter of 2023, while maintaining a minimum cash balance of at least $60 million."
}