{
    "symbol": "CTAS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-09-29 14:15:16",
    "content": " In last year's first quarter, in response to the COVID-19 pandemic, personal protective equipment or PPE sales were surging, propelling the business to grow organic revenue over 17%. It varies so much based upon geographies and industries, because the restaurant business is certainly -- they're nowhere near back to where I think they -- hopefully, will be someday and certainly not back to where they were pre-COVID, as an example, warehousing and distribution is back very, very nicely and probably at or above pre-COVID levels. So generally speaking, we feel like we're -- while it's not perfect matching of expense and benefit, we do a pretty good job and we get a little bit of benefit from just the way our business works. And we're trying to change that position in the marketplace that our customers realize that not just through our sales and service organization but also through our mass media spend, which you may have seen this past weekend where we had a significant position on -- in golf's Ryder Cup, where we're trying to get the message out about all the products and services we provide. And so when you think about the rental customers and the opportunity to continue to penetrate with even rental items, such as our restroom products and our things that we've talked about recently in the last year, like isolation gowns and hand sanitizers, we're in the very early innings. One of the nice things that we really have seen coming out of the last few quarters is our customers and our new customers, so prospects turning into customers, are really seeing the value of keeping their employees safe and healthy, and our First Aid business really allows us to provide that value to them. Gary, I might just add, as you're thinking about -- I believe you referred to the next several quarters, as I said in my opening remarks, we talked last third quarter about $45 million that we did not expect to repeat in our fourth quarter. So I'm just kind of curious how -- the thought process there, if -- it sounds like you're getting closer on some M&A, but it's not really a lot of allocation of capital is going into repurchase."
}