{
    "symbol": "CTAS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-23 13:31:05",
    "content": " Excluding the onetime gain recorded in this year’s third quarter of selling and administrative expenses, operating income margin increased 90 basis points from 18.4% to 19.3% and EPS grew 13.5% from $2.37 to $2.69. We've been able to navigate this challenging time and delivered increased operating margins and EPS by productively starting new business, penetrating existing customers with more products and services, providing excellent service while driving operational efficiencies, and obtaining incremental price increases from our customer base. As we grow via new business we achieve operating leverage, better negotiating leverage with suppliers, denser routes, and more volume on our plants. I thank our employees whom we call partners for their continued focus on our customers, our shareholders, and each other. Turning now to our business units, the uniform rental and facility services operating segment revenue for the third quarter of fiscal 2022 was $1.55 billion compared to $1.42 billion last year. Our news vertical strategies of healthcare, education, and state and local government continue to post leading revenue growth rates. Additionally, businesses are shedding non-core competencies to reduce costs and minimize the impacts of inflation. And last year's third quarter in response to the COVID-19 pandemic, sales of personal protective equipment or PPE were very high and the business grew organic revenue of 17.7%. In fact, we sold about $15 million in a new product which is COVID test kits in this year’s third quarter. On March 15th, we paid shareholders $99 million in quarterly dividends. And during the quarter and through March 22, 2022 Cintas purchased $584.2 million of Cintas common stock under our buyback program. Inclusion in the program enables us to engage directly with top management of SAP and gain access to its developers and new technologies to realize valuable outcomes for our customers, suppliers, and employees. The organic revenue growth rate adjusted for acquisitions, divestitures, and foreign currency exchange rate fluctuations was 10%. Gross margin for the third quarter of fiscal 2022 was $898.2 million, compared to $809.5 million last year. Gross margin as a percent of revenue was 45.8% for the third quarter of fiscal 2022, compared to 45.6% last year, an increase of 20 basis points. Energy expenses comprised of gasoline, natural gas, and electricity were a headwind, increasing 45 basis points from last year. Gross margin percentage by business was 46.3% for Uniform Rental and Facility Services, 44.2% for First Aid and Safety Services, 46.6% for Fire Protection Services, and 37.7% for Uniform Direct Sale. Excluding this gain, fiscal 2022 third quarter operating income, as a percentage of revenue, was 19.3%, an increase of 90 basis points from last year's third quarter. Excluding the transaction, the effective tax rate for the third quarter of fiscal 2022 was 19.6%. Net income for the third quarter was $315.4 million, compared to $258.4 million last year. Fiscal 2022 third quarter diluted EPS contained $0.28 from the gain on the equity method investment transaction, which included a related $0.07 tax rate benefit. Excluding this gain and the related tax impact, fiscal 2022 third quarter diluted EPS was $2.69 compared to $2.37 and in last year's third quarter, a 13.5% increase. And I think the results in our direct sales business, which is in large part tied to -- certainly, to a percentage tied to the hospitality area, the results are outstanding. So -- but in our other verticals, we're having very good success in each of those. And in the healthcare, specifically, we see a -- we're very much in the early innings but we have products and services that are compelling to that customer base. So as a result, we're very bullish on our strategy in that area, with our focus in that area, and I think the results are reflective. What I'll tell you is, again, we're in the early innings of cross-sell. Just to get to even a reasonable level of penetration, where we feel excited about it, there is a long, long runway to penetrating our customers with our existing products separate from what we're going to bring into the marketplace in the future, which is we're always working on new products and services. So it's certainly improving, but very much in the early innings of that -- on that subject. We -- as we noted, M&A was good in the third quarter of our -- the investment we've made in acquiring businesses. So we're ready, willing, and able to continue to move forward in that area. Hamzah, we -- as you heard Todd mention, our third quarter included an overall acquisition number of $105 million, which is certainly a step up from where we've been. So there has been some good movement this entire fiscal year, and we like the messaging that we're getting. We like the pipeline and as you can see so far this year, we've acted on many of those. Certainly, expected that inflation and input costs would be something that we would want to be talking about. But inflation is -- yes, it's certainly challenging. As I mentioned in my prepared remarks, whether it's fuel or other areas, input costs are real. You mentioned pricing, so certainly pricing is a component of our strategy, but it is -- by no means is it the only strategy to combat pricing -- or excuse me, to combat inflation. First off, I mentioned in, I think, our last call, that we have invested in routing technology that is proprietary and really fits our business well. And as long as I've been with the company, it seems like we have tried about every routing software out there, and we finally said we're going to build it ourselves. It's going to fit with SAP, and it will be -- because we have a unique routing structure, so we did that. And I'm very thankful that over the past couple of years, we've invested in that technology. We've rolled out across the organization, and we're executing on it. Now, we -- very important, right, we recognize that we only generate revenue when the truck stops. When it stops at our customers' place of business, that's when we can generate revenue. There's -- we are very conscious of any customer disruption, but we're trying to go faster with that subject. That flexibility is, meaning we can deploy one of those based upon a number of factors really gets into the footprint of the facility and the number of pieces going through. But we've pivoted on this subject as well to go faster, because of what's going on with labor costs, certainly. We now -- we've invested in technology through SAP that allows us to have a centralized dashboard and look at all of our rental processing facilities and understand how they're operating on a daily basis, a real-time basis from an efficiency and effectiveness standpoint. So in the past, we had to go physically see these facilities to understand if they're operating in the manner that we expect. But now, we have this real-time dashboard and it allows us to know how we're doing. And as a result, there's more accountability, and we're getting better. And I've got a few others, but one other I'll give you is we are -- because of the technology we have with SAP now, we're seeing a real nice impact in our ability to share our used inventory of garments across all of our locations. So what it allows us to do is to gain better use of the inventory that was in the past, dedicated solely to the individual locations customer base. And we -- and it also allows us with, nonstock sizes, to look at where the product is and get it faster to our customers. So I could go on, but hopefully, that gives you a few examples of items that -- proactive steps that we are taking to mitigate the inflation. Because, again, as I mentioned, it's real, it's challenging, but I'm highly confident that the organization will be able to manage through this as we have in the past. Certainly, George, our customers aren't being impacted by supply chain that's slowing them a bit. But -- and we care passionately about how our customers are, their business are doing, because it obviously has a dynamic impact on us. But as I mentioned earlier, the challenges that our customers are facing was staffing and labor costs. We are certainly excited about supply chain issues abating and our customers being able to go even faster, but to date, that's a bit of a headwind, but we have the tailwind of the outsourcing and the benefits we're seeing there. We -- certainly, we -- again, being on one technology platform gives us the ability to use large amounts of data to analyze. It's a customer-by-customer subject, industry by industry. But it does give us -- the technology, does give us the ability to look more strategically at our customer base to make sure we're making really good long-term decisions. We've had that in place, and we've taken that approach over the past couple of years, and we'll continue that approach and make sure that we're not just making sweeping decisions, but they're more targeted decisions that are more strategic. Maybe, I'll simply add, certainly, with all of the inflation in the news, the customers are -- it's a little bit of an easier conversation today than it might be otherwise. And so our customers have generally been receptive to that, and that results in a little bit of a higher pricing impact than in the past. And so we've talked a lot about 0% to 2% in the past, and we're a little bit above that today. But just to point out, clearly, the majority of our growth is coming from more volume growth not pricing, and it is due to the value that we're adding to customers and new business that we're selling, ads and penetrating our customer base, that's where the majority of our growth is coming from, clearly. I think sometimes, it's hard for people to understand the magnitude of the transactions in this business. One of our General Managers of our operations, just one operation, I mean, they can have 5,000 customers. And so the ability to have the technology, as Todd spoke to, and seize upon that to be able to supplement the GM's ability to analyze 5,000 customers to ensure that the pricing is where it needs to be or to see trends in the data to understand if there are customers that are kind of comparing back, reducing services over time, that's a jeopardy account. I, the General manager need to get in front of that particular customer, those are the types of advantages that the technology provides, because it is just such a luminous business and that technology and the additional eyes and that intelligence is certainly a huge competitive advantage. And maybe, if I can just ask, I'm not sure if you have quantified how big energy is as a percentage of overall expenses but also, my question is more longer-term. In our guidance side certainly, the gas price has escalated as we got into February, and we're thinking more in terms of 2.6% to 2.8% in our fourth quarter. So certainly, we're going to see a little bit of our expectation is we'll see a little bit of an increase. Just to give you a little bit of maybe, an impact of what we have already done to be more energy efficient, if you go back to the last time we saw prices at the pump at this kind of level was back in calendar 2014. And if you think about the third quarter of our calendar 2014, we were certainly a smaller company, but our total energy at that time was 3% of revenue. So at the same price in the pump, we've been able to reduce our energy by almost a third and from 3% to 2.3%. Some of it is certainly scale and growth, but as Todd has talked about, some of it is also the routing efficiency, the penetration that allows us to park the truck a little bit longer. And how do we think about it going forward, we certainly are going to continue to work at routing efficiency, penetration, but also, certainly, we've talked a little bit about getting electric vehicles on to the road and that has started. So there's a lot more to come in this type of space and we're in the early, early part of exploring that alternative fuel vehicles, but we certainly think that's a big part of our future. Ashish, in addition, I mentioned earlier about the centralized dashboard that allows us to understand how our locations are functioning, at what level of efficiency. And then, I didn't mention, but we have also, over the past couple of years, we've invested in converting all of our locations to LED lighting, which helps in our ESG journey, but it helps with the consumption of energy and helps reduce some cost. Let's just keep going on this path, I guess. Mike, just when kind of using your EPS and your revenue guidance, I'm backing into fourth quarter margin guidance, which is at the midpoint about flat year-over-year. I think that's probably right, and you can comment on that, I suppose. But you just mentioned that energy prices on a sequential basis, maybe, like 40 basis points. So you're right, at the midpoint, it's somewhat flattish against, let's call it, a 60 to 80-point energy headwind from a year ago. And at the top of that range, it's margin expansion even in this period of time. So getting back to, I think, your question of why, maybe, not more margin expansion. First of all, I would say, look, Andy, I don't know how many companies are expanding margins in this kind of environment, but we intend to. And you've seen our growth move from organically, 8.6% in total in the first quarter to 9.3% to 10%. And growth means for us, when we're growing that volumes, we are investing in things like capacity in our wash alleys and other places. And so we're going to continue to invest even in this kind of environment, because the growth is very, very good and strong. But gosh, Andy, in this kind of environment, we're looking at a 60 to 80-point -- basis point energy headwind to guide towards margin expansion, we feel pretty good about. Andy, we always have job postings, openings, we're growing. And as I mentioned earlier, we're growing our volume very attractively. So -- and the labor market is challenging, trying to get the levels that we're at. We're running at higher RPMs to get there, not speaking of when I say higher RPMs, our management team is working harder to get there. And I think that speaks in large part to our culture, where our folks are -- they get up earlier, they work harder, they work later. But yes, we're conscious of -- we're trying to add roles, and we're doing it quite successfully. It's never good enough, as you know, from a leadership standpoint, that we're focused on. And we have found that, that is -- our commitment to our customers is to handle it in that manner. And in these inflationary times, as Mike mentioned earlier, those conversations are going better than they normally have. But our approach is once a year with the customer, and we've been sticking by that, and we plan to continue to stick by that commitment to them. I just wanted to follow up on the labor environment broadly, it sounds like you're managing your own labor pretty well. Manav, certainly we are seeing a higher level, we call it a churn, through our customer base. Meaning, we see people that -- one customer and they end up at the other customer and that is at a higher level than it has been in the past. But nevertheless, we like the trend that we're seeing with our customer base and the ad stops trends that we're seeing. And just as I mentioned, it seems like it's harder for businesses right now. Everybody is having to work a little bit more at it and productivity has to be a little bit better, but we are certainly seeing more churn of our -- within our customer base than we did, historically. And Mike, maybe, just for the fourth quarter, there's some tough comps on the rental side and then the fire side as well, I believe. When we think about organic growth for the rental division, we were at 8.9%. Our expectation -- and so first of all, Manav, let me maybe step back. The guidance for us implies 6.8% to 10% growth, slightly over 10% growth. So we love the momentum of the rental business, and we think that's going to continue to perform very, very well in those upper single-digit type ranges. First Aid and Safety is going to rebound quite a bit in the fourth quarter due to great momentum, but also, a little bit of an easier comp. Our fire business, which grew organically 15.3% this quarter, we continue to expect a very good growth in that area. And then, our Uniform Direct Sale business is going to face a tougher comp. And likely, that's going to come back to something more normalized low to mid-single digits. Did I get -- I'm not sure if I heard the second part of your question, if there was one, Manav. Maybe, I'll touch on, we talked about -- I talked about the M&A and a big component of that M&A was this equity investment transaction. That is we have got into a joint venture years ago for primarily, the purposes of product innovation and particularly, within our Facility Services business. It's hard to predict what those are going to look like into the future, but they're certainly above pre-pandemic. And the value proposition is being -- is resonating certainly, more today than it did pre-pandemic. From a test kit perspective, as we've done throughout this pandemic, our goal has been to do our best to take care of our customers. And in this particular quarter with Omicron really rising, our customers were asking us for the test kit opportunities, and we were able to fulfill those. We called out about $15 million worth, that's something that we wouldn't typically expect to repeat at anything close to that level. And just a follow-up on the PPE side, just because I recall, it's a lower margin business. The First Aid and Safety business where a lot of that PP&E has been, we've seen some really nice momentum in the First Aid side of the business. As the mix tilts back to a greater amount of First Aid business, we expect those gross margins to start to get closer and closer towards those pre-pandemic levels. But the one thing I will say in the First Aid and Safety businesses are, we made a nice jump in our operating margin too. And if you think about the SG&A part of that business, we -- our salespeople are producing at very, very high levels and our SG&A in that business is well below pre-pandemic levels. And so as we continue this mix moving in the right direction, our expectation is that those overall operating margins will certainly get back to pre-pandemic levels and can improve from there. We were at, call it, in the mid-14% range pre-pandemic, and we're on our way back towards those. And I'm just curious, I guess the essence of the question is what percent of the -- you're doing on a customer by customer base, but what percent of your base would you say you have affected with price increases at this juncture and will we see a greater percentage of the growth going forward coming from the pricing side as opposed to the volume side as that kicks in on who you've already priced and who you maybe have yet to a price, just a little bit better feel on the time as how much more contribution we may see from price offsetting cost pressure going forward? How we approach it, as I mentioned, it's once a year, but it's a relatively smoothed out throughout the year. And as we've talked about in the past, some of it depends upon the condition of that customer, how their business is, that industry, that geography. But no, I think what you're seeing, as far as our volume growth and the pricing wins that we're getting, I think you'll see that be pretty consistent in the future. I don't think you'll see an outsized percentage coming from pricing next year and the coming weeks, months, or something like that, because of how we approach it. And again, we're very, very happy with the level of demand that we're seeing from our customer base. For my follow-up, I'm just curious, going back to this 1% of SAP extended membership in which you're participating. We're very proud of the relationship we have with SAP, and it goes back a number of years now. And as a result, it gets us, as I mentioned, it's -- we're in a different stratosphere. And you think about SAP's customer base and then you think about that we're being in the top 1%, it's unique air. And so as I mentioned, it does get us relationships at very high levels. So when you're in that 1%, you have the ear of those folks and allows you to impact where those items go. So as a result, we think that's an advantage for us. And we're very pleased with it and very pleased with our investment with SAP, and we're seeing real dividends from that as we -- I think we've laid out over the past few quarters. Hey Todd, where are you now in terms of opening up and getting back to normal, like kind of an apples-to-apples basis in terms of volumes with your customers. Our customers are, for the most part, they're all open. But we think there's still similar opportunity there as the economy opens up and to a larger degree, as people are back more to work to a larger degree. And we think there's also some hidden benefits that we can get from the fact that during the -- throughout the pandemic, as we've talked about, the customers see us in a different light. It's a -- it has been an entity where we've done product innovation that has created products for the rental division, particularly in Facility Services. So it's -- while it isn't a direct producer of revenue, it has created products over the years that have created revenue streams for the rental division. As I mentioned earlier, we have such a broad customer base that you name it, we have it from a contractual standpoint. We fundamentally and practically, how we've handled it is we go in and we talk to the customer once a year and explain what the adjustment -- the price adjustment is and we managed through that. And while we're at it, I'll just -- I will say, our customer retention rates are really attractive right now. I think in large part, it's our approach, Toni, that we take on this subject about the flexibility, the pricing, the reasonableness and we have good conversations that I think people understand and we can manage through it. So hospitality is obviously, as you're reading in the journal and other periodicals, it's -- bookings are way up for those folks there. And through the pandemic, us being -- having product available was a big deal. And the movement towards getting away from, in many cases, as folks looking at and saying, \"hey, we don't want a onetime disposable.” They're hard to access, not great for the environment and going to reusable has been great in health care, which we've kind of detailed out in the past. And then lastly, with the government sector, that's obviously been really consistent. We like our approach in those areas and they're all growing attractively, and we expect them to continue to grow attractively based upon our strategy there. Alright, it appears there are no further questions in the queue, I would like to hand the call back over to Mr. Paul Adler for any additional or closing remarks."
}