{
    "symbol": "CTAS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-14 13:37:04",
    "content": " Your line is open. In many ways I hope that my customers don't read the newspaper or look at â\u0080\u0093 I ever listened to the news because, yes, what you hear, they're certainly scattered approaches out there, but what I can tell you is, we like what we're seeing in our business. Your line is open. As you can see in our revenue, over the course of the year, our revenue has accelerated each quarter and that's due in part because of really good new business, but our existing customers and the penetration we're seeing at those customers has gone very well and that certainly has been a part of the contribution of the accelerating growth. And in fact, over the last three quarters within our rental division, our distance between customers has reduced 5%, which is just â\u0080\u0093 it's just finding an efficiency in our business by leveraging technology and because driving, as we've always said, when the wheels are moving, we don't generate any revenue, itâ\u0080\u0099s when weâ\u0080\u0099ll stop. Your line is open. Your line is open. Andy, I might just add, you know we certainly adjusted at the beginning of the pandemic our cost structure and we're able to pull costs out, but as you can imagine for the last, I'll call it, five quarters, our revenue growth has been really solid and accelerating, and so along the way, there have been investments that have been necessary and investments that we've wanted to make, and that means we've added growth routes back that we took out in the early days of the pandemic. Your line is open. And as you've heard Todd explain over the last four quarters or so, we've worked really hard over the last several years to improve the â\u0080\u0093 or increase the rates at higher than I'll say historical averages and that left us not flat footed in this challenging environment and it's allowed us to continue to raise, but not in an alarming rate that maybe some of our other competitors have had to do. Your line is open. Your line is open. If you look over the last 10 years, that's maybe a little bit down from where we've been, but we're going to keep investing in the business. Everybody is served, they're served in some manner, but we've invested in that business to make sure that we are positioned with the best people, the best technology that we are continuing to invest in there and the best training and we're going to really â\u0080\u0093 we like our spot there from â\u0080\u0093 the levels of service that we're providing our customers and it's getting noticed. Your line is open. Your line is open. Toni, within rental, we're seeing quite strong demand for all of our products and services and we really don't care where it starts as far as what we sell into a customer first because we have such a broad offering that we'll â\u0080\u0093 whatever they're interested in, we'll help provide and then we'll continue to provide additional offerings to them. Your line is open. And look, it's â\u0080\u0093 I wouldn't say it's an overinvestment or that we underinvested in the past, it's just simply that we are investing in the way that we appropriately need to and some of that is a little bit more labor over the course of this year where we're lapping a year fiscal 2021 that was, you know it's significantly impacted by the pandemic. Your line is open. And so it's hard to predict where we're going to be, but that 20% that we're in the guide, I think that's a reasonable place for us and what would take to move that down, it would take a more significant amount of stock options being exercised than we're expecting or it certainly could be other discrete events that happen that we're not expecting, but I think the 20% is a fairly good guide again based on what we're seeing today."
}