{
    "symbol": "EH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-22 13:04:04",
    "content": " Thank you for standing by, and welcome to the EHang Fourth Quarter 2022 and Fiscal Year 2022 Earnings Conference Call. Now I will turn over the conference to Anne Ji, EHang's Senior Director of Investor Relations. On the call today, we have Mr. Huazhi Hu, our Founder, Chairman and Chief Executive Officer; Mr. Xin Fang, Chief Operating Officer; Mr. Richard Liu, Chief Financial Officer; and Nick Yang, an Independent Director of the Board. Before we continue, please note that today's discussion will contain forward-looking statements made pursuant to the safe harbor provisions of the U.S. As such, the company's actual results may be materially different from the expectations expressed today. Also, please note that all numbers presented are in RMB and are for the fourth quarter and the fiscal year of 2022, unless stated otherwise. Against the ever-changing backdrops of macroeconomic volatilities, political uncertainties and pandemic, we remain committed to our strategies and continue to make meaningful progress during the year in our main priorities of airworthiness certification, business development and ecosystem establishment. This not only strengthens our resilience for long-term development, but also reinforce our leadership in a global urban mobility industry. In the fourth quarter of last year, the EHang 216-S type certification successfully entered the final phase of the demonstration and implication of the companies. However, due to the massive infections after China lifted COVID control policies, until this year's Chinese Dragon holiday, a relevant TC project was delayed to a certain extent. But now we have manufactured the confirming aircraft for the purpose of air witness verification at our Yunfu production facility, past the aircraft manufacturing conformity inspection and are conducting compliance tests at a flight basis in Guangzhou, Hezhou and other locations. In February this year, the CAAC Chief Engineer and officials from the Department of the Aircraft Airforce Certification, the Department of the Flight Standard, the office of Air Traffic Operations, the Central and South Regional Administration as well as the experts from the TC team, expect the 5 base in Hezhou. We worked together effectively and the joint efforts of all parties not only accelerated the compliance flight test and are in review process in the final stage, but also made plans and arrangements for the next steps, which boosts our confidence in post certification operations. We believe EHang is leading amount, the few eVTOL type certification projects that have been officially accepted by civil aviation regulators worldwide. Although the TC process for such a new innovative aircraft is full of difficulties, I'm proud of our teams award-winning efforts and groundbreaking achievements over the past few years. At the same time, we are very grateful to China Civil Aviation Regulator, the CAAC, for their full support and high attention to this innovative AV. Therefore, we believe we're particularly entering a new year of air mobility in 2023 and anticipate witnessing and  milestone in a global UAM industry. According to Morgan Stanley's forecast, China is expected to account for about 30% of the global UAM market. In recent years, Chinese central and local governments have introduced a series of supportive policies for emerging sectors related to  aviation, electric aviation, low altitude economy, urban 3-dimensional transportation, aviation tourism and so on. This has provided us with beneficial policies, a favorable market environment and a growing demand from government and enterprise customers. On the other hand, China has been a leader in the global UAV industry, and has accumulated a profound expertise in aspects of upstream and the downstream industry chain and professional pilots. The overseas market, we are committed to actively engaging in Asian market and participating in multiple air mobility projects in Europe as an aviation pioneer. We will continue collaborating with local customers, partners and governments to jointly explore a safe, intelligent, efficient and a sustainable UAM operational system. To date, the EHang 216 Series AAVs have successfully completed over 34,000 autonomous sites across 12 countries in Asia, Europe and Americas, which is the top line record in the global aviation industry. Looking ahead, we will remain dedicated to expanding our reach and bring our AAV solutions and flight experiences to more customers, partners and passengers worldwide. In December last year, we are thrilled to welcome Mr. Nick Yang, joining our Board of Directors as an Independent Director. Although he is a new member of the Board, he's also our old friends as one of the EHang's early investors who has been following the company's growth and the development of the UAM industry for many years. With over 20 years of capital market experience and entrepreneurial experience in  listed companies, I believe that Nick will bring strong support to EHang's growth in our new stage. Today, we also have Nick with us on the call, and he will be available to communicate with everyone in the Q&A session later. Since the fourth quarter of last year, our top priority remains the TC project. In preparation for post certification, sustainable long-term growth, we are capitalizing our leading first mobility advantages to explore both domestic and overseas market. The building of order demand, enhancing our partnership and cooperations, we are laying a solid foundation for commercial delivery and operational services following certification. In China, the tourism industry, which has seen heavy impact from COVID, has rapidly recovered this year after control policies were lifted. The China Tourism Academy predicts that in this year, the number of domestic tourists will reach 4.55 billion, up 8% compared to last year, and the domestic tourism revenues will reach RMB 4 trillion, about USD 508 billion, an increase of 95% compared to last year. Since last year, we have been dedicated to developing our domestic market in China against the backdrop of macro policies promoting low altitude tourism and economy, building a more than integrated transportation system and developing new smart cities. We have continued extensive and deep business cooperations and industry layout with local governments, tourism and aviation enterprises in many provinces and cities such as Guigang in Guangxi, Jishou and Changsha in Hunan, Huangshan in Anhui, Qingdao, in Shandong, Ganzhou and Jiujiang, in Jiangxi, Xi'an, in Shanxi, Shenzhen in Guangdong, et cetera. To date, we have received orders for over 100 units of the EHang 216 series AAVs in China. Additionally, with the approach of TC completion, there has been a significant growth in our customers' inquiries and the demand for new orders from all over China. For example, most recently, Xiyu tourism, a leading tourism company in Xinjiang and listed on Shenzhen Stock Exchange announced its intention to sign a cooperation framework agreement with us. It plans to establish our joint venture and operate a minimum of 120 units of EHang 216-S, where our comparable passenger-grade AAVs in 5 years for conducting low-altitude sightseeing tourism projects in key scenic locations in Xinjiang, such as the heavenly lake of Tianshan. Another example, in March this year, Xi'an Aerospace Investment Company signed their strategic partnership agreement and a indicative purchase order with us. For example, last December, Qingdao West coast a new area reached a long-term strategic partnership with us over investment and business. It has not only provided a USD 10 million investment, but will also facilitate the local government applications of our entire product portfolio, which is expected to generate project demand worth of RMB 100 million, about USD 15 million within the next 2 years. They will also provide full support to our local business operations, sales and services, production and infrastructure constructions, among other things with the goal of building Qingdao City into an outstanding world-class pilot zone for UAM demonstration and applications. In the future, we plan to adopt an integrated business strategy that both selling products and providing operational services for government and enterprise customers. We will utilize a complete set of AAV common control system platform and UAM operation system to support our 3 major businesses, which are air mobility, smart city management and aerial media. Therefore, we are able to meet our customers' demand for diversified applications in low-altitude tourism, urban transportation, aerial logistics, firefighting emergency, medical rescue, smart city management and aerial media, et cetera. In the past 2 years, under the CAAC guidance, we have been taking the lead in carrying out trial operations while conducting type certification. More than 8,200 safe operational trial flights have been completed with EH216 AAVs. During this process, we have cultivated professional and  AAV operations team, develop a digital platform for AAV operation management and services, and accumulated to reach feasible and replicable cloud operation experience. Additionally, we have been actively working on expanding cooperation across the UAM upstream and downstream industry chains as well as building the ecosystem. In overseas markets, such as Asia, last year, we actively explored market in Japan, Malaysia, Indonesia and Thailand, secured more than 200 units of preorders for EHang 216 series and established cooperations with local partners to carry out local trial flights surrounding AAV application scenarios such as low-altitude, sightseeing toruists and  mobility and logistics transportation. This February, we successfully conducted the first passenger-carrying EHang 216 demo flight in an open air space overseas in Japan. In Europe, in the fourth quarter of last year, we completed the EHang216 first flight in Spain and used AMU-LED project to successfully verify the UAM concepts of operations. In addition, we assisted the Spanish National police to completing EHang216 Maiden flights for their travel operations. As noted by Mr. Hu, 2023 is a crucial year for us. As the turning point of airworthiness certification approaches, EHang and even the entire UAM industry are about to enter into commercialization. Before I go into details, please note that all numbers presented are in RMB and for the fourth quarter and the fiscal year of 2022, unless stated otherwise. Despite numerous uncertainty and challenges in 2022, we not only moved to the final phase of type certification, but also achieved significant progress in developing business and building an AAV ecosystem for post certification growth. Meanwhile, we further enhanced our cost management, operational efficiency and the financial numbers and we are optimistic to see a turning point for the expected expansion of our commercial operations and a new era for our company and the UAM industry. In Q4, total revenues were RMB 15.7 million, an increase of 90.7% from RMB 8.2 million in Q3. The EH216 series of AAV deliveries in Q4 were 6 units, up 50% from 4 units in Q3. For the fiscal year 2022, total revenues were RMB 44.3 million compared with RMB 56.8 million in 2021. The EH216 series of AAV deliveries in 2022 were 21 units, compared with 30 units in 2021. Gross margin was 66.1% in Q4, a slight increase of 0.2 percentage points from 65.9% in Q3. Gross margin was 65.9% in 2022, representing an increase of 2.5 percentage points from 63.4% in 2021, mainly attributed to the higher average selling price of EH216 AAVs. In Q4, our adjusted operating expenses, which are operating expenses, excluding share-based compensation expenses, were RMB 73.2 million compared to RMB 59.7 million in Q3. The increase was mainly driven by the noncash item of additional proven provisions for receivables in response to the impact of COVID into customers and more expenditure on aircraft conformity for EH216-S in its verification process for type certification with reductions in travel and marketing expenses and professional service expenses, et cetera. On an annual basis, the adjusted operating expenses were RMB 242.4 million in 2022, compared with RMB 246.6 million in 2021. As a result, our adjusted operating loss in Q4 was RMB 61.3 million compared with RMB 52.9 million in Q3. For the fiscal year, adjusted net loss was RMB 206.2 million in 2022, compared with RMB 192.8 million in 2021. As of the end of Q4, we had RMB 249.3 million of cash, cash equivalents, restricted cash and short-term investments compared with RMB 208.8 million as of the end of Q3. In December, we formed a strategic partnership with Qingdao West Coast new area, one of China's national new areas in Shandong province. As Mr. Hu mentioned earlier, the TC process has completed over 90%. If you compare with the other aviaton company's progress, I think EHang is far ahead. Yes, as Mr. Hu has mentioned earlier, the TC process has completed over 90%. Most importantly, EH216-S is the only autonomous one among our eVTOL TC projects, as you know, while other ones are all piloted. For details, EHang has published the illustration about the entire TC process and a checklist of key milestones it has accomplished. So regarding to the post TC production and delivery, I think it won't take much time or concern to generate revenue soon because the company has prepared for all along by collecting more and more preorders beforehand. Firstly, on general expenses, aviation accident are costing multi-factors and determine responsibility for airport access with clients rationalize the stiction element regulatory authorities, which is the home with a complex process. And my second question is our company has secured a significant number of free order in Asia, I mean, excluding China. First of all, as discussed earlier, we currently have an order pipeline of 100-plus units per year in China. And this order pipeline has been going with increasing inquiries, discussions from more potential customers in China, especially from the . So as put in our earnings release, most of these partner orders in China are conditional upon the TC and are practical to be in 1 to 3 years after that. However, were indeed some customers in China, we are more sophisticated and understand that the TC is to be obtention and thus, do not require that before the others. In respect of your second question, those preorders in other Asian countries are usually require a local TC. So after we obtained the selection in China, you look to vibe for us to certify for the local sections with the local aviation as and we do not have to go from the given example in both Southeast Asian countries like Indonesia, we increased price for the local do a called EPC process, namely validation of type certificate with the local aviation authorities, and it is expected to be a simplified process."
}