{
    "symbol": "EZPW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-06 18:27:06",
    "content": " Before we begin, I'd like to remind everyone that this conference call as well as the presentation slides contain certain forward-looking statements regarding the Company's expected operating and financial performance for future periods. Actual results for future periods may differ materially from those expressed due to a number of risks or other factors that are discussed in our annual, quarterly and other reports filed with the Securities and Exchange Commission. Joining us on the call today are EZCorp's Chief Executive Officer, Lachie Given; and Tim Jugmans, Chief Financial Officer. Our team continues to consistently execute on the strategic plan we announced to the market at the end of fiscal 2020, evidenced by another outstanding quarter of financial results. I'd like to acknowledge and thank our team of 6,800 staff for their tireless efforts in serving our customers in such a passionate, respectful and responsible way, and for delivering another very strong quarter of results from our shareholders. On a consolidated same-store basis, it has surpassed pre-pandemic levels by 5%. Merchandise sales gross profit margin was 38% at the high end of our range, even while we were able to decrease aged general merchandise to less than 1% of total GM inventory. Adjusted EBITDA was up 100% versus the same quarter last year, and net income is 3x where it was at this time last year on a year-to-date basis. We operate 1,163 stores in the U.S. and Latin America, with strategic investments in adjacent businesses which expand our geographic footprint worldwide. Across our diverse store base, we offer two core products to our customers, we make pawn loans and we sell secondhand goods. On the lending side, our customers continue to be impacted by inflationary pressures, high gas prices and the tightening of credit availability from alternative lenders. We also expect the general demand for secondhand goods to increase as existing and new customers search for great value-for-money deals, while looking after the environment in which we all live. We believe that our team driving outstanding customer service, combined with our POS system, differentiated digital and IT platform, and strong and liquid balance sheet, make us the best choice for our customers' pawn and recycled retail needs. As mentioned, PLO is the most significant driver for revenue and earnings, and it was up 30% year-over-year, leading to a 33% increase in PSC. As a result, we saw significant improvements in revenue, earnings and expenses as a percentage of gross profit, while keeping aged inventory under 1%. What we used to call net revenue, we now call gross profit, and it was up 20% year-over-year and EBITDA was up 100%. You can see the total expenses increased year-over-year, primarily due to increases in store count and labor. However, for the past 12 months, total expenses as a percentage of gross profit decreased from 92% to 80%. Store expenses increased year-over-year with store count increasing, but decreased as a percentage of gross profit from 77% to 69%. G&A increased $2.5 million year-over-year, but decreased as a percentage of gross profit from 15% to 12%. Our commitment to investing in our people through ongoing training and development, and our focus on inclusion initiatives and cultural transformation, continue to drive improvement in our team member experience, which we believe contributes to our excellent operating and financial results. Our EZ+ loyalty system now has over 1.4 million customers enrolled, versus over 930,000 last quarter. We collected $7 million in online payments this quarter, providing our customers with convenient options for both pawn and layaway servicing. This quarter, we procured over 1.6 million pre-owned items and sold approximately 1.4 million items, ranging from consumer , cameras, household goods, tools, musical instruments and jewelry. As I've said, we continue to invest in global training and development programs, and talent review and succession planning processes, and this quarter introduced the first Career Week for all of our team members. But we're always in search of innovative and genuine ways in which we can positively impact our team members, customers and the communities in which we serve. PLO ended the period at $204.7 million, up 30% on a year-over-year basis, which is the highest in EZCorp history. PSC revenue was up 33% over last year, with growth driven by both increased same-store PLO growth and acquisitions. Merchandise sales was up 19%, with same-store sales up 14%, but as expected, margins falling back to the high end of our normal range of 38%. It was another great quarter with consolidated EBITDA of $25.1 million, up 100%. PLO rose 36%, driven by continued focus on our enhanced pawn operating model and better serving our customers' needs. PSC was up 35% year-over-year, primarily driven by same-store PLO growth. On the retail side of the business, merchandise sales were up 11%, with merchandise sales gross profit down 3% due to the expected 500 basis point drop in sales margin. U.S. Pawn EBITDA for the quarter was $32.3 million, up 56% on the prior year. As a result, PSC was up 28%, driven by higher average PLO coming from same-store PLO growth as well as additional stores. Merchandise sales was up 47%, 29% on a same-store basis. Merchandise sales gross profit was up 24% due to the increased sales, offset by margins down 600 basis points. Store expenses were up 21% year-over-year, mainly due to the 128 pawn store acquisition that occurred during June last year. Even with the increase in the same-store transactions, we have kept same-store expenses under control, only up 6%. Latin America Pawn EBITDA improved by $2.4 million or 5% primarily due to higher PSC and increased merchandise sales gross profit, offset by increased expenses. As we reported last quarter, our Board has approved a three-year $50 million share buyback program. We are now in a position to begin share repurchases and, as announced previously, we'll look to execute this program in an opportunistic and responsible way, taking into consideration general market conditions, liquidity and capital needs and the availability of attractive alternative investment opportunities. Looking forward, on a consolidated basis, we should see PLO levels continue to increase beyond these record levels as we move back to pre-COVID seasonality as well as seeing the effects of our improved business model. As we have suggested in prior quarters, we are likely to continue to see a further reduction in the sales gross margin as inventory levels increase in line with PLO and sales discounting practice continue to return to normal levels. Also, as we have seen this quarter, expense growth is likely to continue on a sequential basis as inflationary and wage pressures continue to rise. We are pleased that the execution on our strategic initiatives continues to be seen in strong, consistent financial results each quarter. We are excited to see our business reach record PLO levels and pre-COVID levels of profitability, but with superior operating model that has put us in an exciting position to scale the business from here. Our operating mantra of People, Pawn and Passion continues to resonate with our team and deliver excellent operating and financial results for our shareholders. On the PLO, you had a big increase in the outstanding amount, now past 2019 levels, some of which may still be normalization, some from inflationary pressures. So look, I think all of those factors have impacted our customers at the store level, overlaid by the fact that we think that post this stimulus world that we were living in through COVID, our customer behavior seems to be returning back to that normal seasonal -- that seasonal demand. Obviously, we're doing the best we can in this situation and trying to keep these contained as much as possible, but there is going to be that growth, which we haven't seen in prior quarters. Look, I do think it's a sustainable trend in secondhand goods retailing. I think that with more pressure on our customers given this inflationary environment and challenging macro economy, I think people are looking for a deal. And I think, as we've discussed before, the younger demographic is actually very attracted to secondhand goods, particularly in clothing, shoes, luxury handbag, because it's good for the environment. So I think that this macro environment as well as the younger demographic coming through, I think we will see sustained demand for our secondhand goods. It's just the margins here -- as Tim said in his remarks, I think the margins will be coming under pressure, because as PLO grows, so does your inventory. But the top line in sales, I think we're really well positioned for some sustained growth there. And I thank our team, our shareholders and our customers for a great quarter."
}