{
    "symbol": "TVTX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 13:11:03",
    "content": " While it is disappointing that we will not be filing for accelerated approval this year, it does not change our belief that sparsentan has the potential to become a new treatment standard for FSGS as well as IgA nephropathy, if approved. Assuming sparsentan is approved for IgA nephropathy, and we see supportive 2-year results from DUPLEX, we will be in a position to submit a supplemental NDA or sNDA in the second half of next year. As Eric mentioned earlier, the FDA has recommended that we pursue traditional approval following receipt of the 2-year eGFR data from the DUPLEX study of sparsentan in FSGS rather than pursuing accelerated approval. We expect to have those data in-house in the first half of next year, and assuming sparsentan and is approved for IgA nephropathy to be in a position to submit a sNDA in the second half of next year. Research also suggests that steroid minimization remains the key goal for nephrologists in treating their patient with IgA nephropathy and that they would use a product profile like sparsentan potentially in combination with other treatment options, if needed, to optimize the chance for their patients to reduce proteinuria and stabilize disease progression. Overall, we believe that the external feedback from patients -- nephrologists and patients and payers together with the internal strength of our recently expanded commercial team, will enable us to achieve our vision of making sparsentan foundational therapy for patients with IgA nephropathy, if approved. We at a time now between the 2 potential launches for sparsentan will allow us to be incredibly focused on the best start for IgA nephropathy and also apply these learnings and experiences from the IgA nephropathy launch to have a strong launch in FSGS in 2024, if approved. Consistent with our planning from the beginning of the year, we expect increases in SG&A from second quarter levels, as we now have the full field force staff and continue to prepare for the potential sparsentan launch in IgA nephropathy. Importantly, we believe this cash balance can support our operations into 2024, which takes into account potential further competitive pressure on Thiola, investing in sparsentan launches for both IgA nephropathy and FSGS as well as milestone payments we expect to pay related to regulatory achievements for sparsentan and pegtibatinase. While we are awaiting the results of the full 2-year eGFR data from DUPLEX, we will take the opportunity to focus even more sharply on the launch of IgA nephropathy, if approved, and applying those learnings to commercialization of FSGS in the future, if approved."
}