{
    "symbol": "ACT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 10:18:04",
    "content": " We ended the year with record insurance in-force of $248 billion, driven by rising persistency that reached 86% in the fourth quarter and new insurance written of $66 million for the full year. Net income for the full year was a record $704 million or $4.31 per diluted share, up 28% from a year ago and return on equity was 14%. Through the initiation of our regular quarterly dividend and our special cash dividend in December, we returned just over $250 million to shareholders over the course of 2022. Ever-to-date, home price appreciation, our approach to risk management and loss mitigation and the favorable resolution of long-term forbearance plans resulted in a net release of an additional $42 million of reserves in the fourth quarter, leading to a loss ratio of 8%. Against this backdrop, we will continue to execute on our cycle-tested strategy, prudently investing in our capabilities, taking the appropriate actions to align our costs and operations with the market environment, pursuing new business that appropriately balances risk and reward and ensuring we maintain the financial strength and flexibility to both support our policyholders and create value for our shareholders. GAAP net income was $144 million or $0.88 per diluted share as compared to $0.94 per diluted share in the same period last year, and $1.17 per diluted share in the third quarter of 2022. Adjusted operating income was $147 million, or $0.90 per diluted share as compared to $0.94 per diluted share in the same period last year and $1.17 per diluted share in the third quarter of 2022. Adjusted operating income for 2022 totaled $708 million, or $4.34 per diluted share, compared to $551 million, or $3.38 per diluted share in 2021. Insurance-in-Force increased 10% in 2022 and 3% sequentially to a new record of $248 billion, driven by the combination of $66 billion of new insurance written and increased persistency. Investment income in the fourth quarter was $45 million, up 14% sequentially and 27% year-over-year. As Rohit has stated, we initiated a voluntary separation program during the fourth quarter that resulted in a restructuring charge of $3 million, which is excluded from our adjusted operating income and represents a 1-percentage-point impact in quarterly expense ratio. While we are still operating in an inflationary environment, our initiatives and ongoing focus on operating efficiency and cost reduction position us to target 2023 operating expenses of $225 million, which represents a 6% annual cost reduction from 2022. During the quarter, EMICO, our primary mortgage insurance operating company, completed a distribution of $242 million to our holding company, Enact Holdings, Inc., to bolster its financial flexibility and support our ability to return capital to shareholders as planned. I think if you put those together, you can see your way to $160 million $170 million of planned capital return in 2023, and then we'll continue to evaluate that the economic landscape as well as business performance through the remainder of the year to figure out if there's incremental to that."
}