{
    "symbol": "ACT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 18:32:03",
    "content": " We grew our portfolio 10% year-over-year; initiated a quarterly dividend program; and generated strong operating and financial results, including adjusted operating income of $165 million or $1.01 per share and return on equity of 16.2%. This progress contributed to our strong insurance in force performance in the first quarter of 2022, up 10% from a year ago to record levels as we continue to write profitable new business. Net premiums earned were $234 million, down 7% year-over-year and down 1% sequentially driven by the lapse of older, higher-priced policies as compared to our new insurance written and lower single premium cancellations as persistency increased. During April, our primary mortgage insurance operating company, Enact Mortgage Insurance Corporation, or EMICO, distributed $242 million from its paid in capital to our holding company, Enact Holdings Inc. We intend to use these proceeds and additional distributions in part to fund the quarterly dividends as well as to bolster our financial flexibility at our holding company and return additional capital to shareholders. So I would say having seen some competition in the market in the origination market space in the last 4 months as interest rates have gone up by almost 200 basis points, we have not seen an impact of that coming over to the MI industry, either in terms of asking for more pricing competition on the MI price or in terms of credit policy or loan structuring. I would say when you look at our Q1 results and the general indication of where Q1 origination market is trending based on current estimates, you would see Q1 as a strong market both on the origination front as well as on the mortgage insurance side and that's kind of driven by a purchase market going down by about 12%, purchase originations in aggregate and refi market obviously going down much more than that. So absolutely, we are very happy with the results we have produced in terms of returning capital to shareholders at this point of time with our $1.23 dividend in December of last year and then initiating a quarterly dividend program with the first dividend to be paid out in May of $0.14 per share."
}