{
    "symbol": "ACT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 15:24:09",
    "content": " Insurance in-force for the quarter was a record $242 billion, driven by increased persistency which reached 82% for the third quarter and new insurance written of $15 billion. As of the end of third quarter, 99% of the mortgages in our portfolio have rated at least 50 basis points below current market rates, a slight increase from 98% at the end of the second quarter and we expect this dynamic to continue to benefit persistency going forward. Given our approach to risk management and loss mitigation, ever-to-date home price appreciation and the favorable resolution of long-term forbearance plans, we released an additional $80 million of reserves on a net basis in the third quarter, leading to a loss ratio of negative 17%. Given the continued rise in interest rates throughout the third quarter, we expect to see continued improvement in quarter-over-quarter persistency in the fourth quarter which is a positive for the embedded value of our insurance in-force portfolio, of which 87% is comprised of monthly policies. Turning to expenses; operating expenses were lower in the quarter at $58 million and the expense ratio was 25% versus $61 million and 26%, respectively, in the second quarter of 2022 and $59 million and 24%, respectively, in the third quarter of 2021. Moving to capital and liquidity; our PMIERs sufficiency remained very strong in the quarter at 174%, or approximately $2.2 billion above the published PMIERs requirements compared to 66%, or approximately $2 billion in the second quarter of 2022. After the quarter, EMICO, a primary mortgage insurance operating company completed a distribution of $242 million to our holding company and Enact Holdings, Inc. to bolster its financial flexibility and support our ability to return capital to shareholders as planned. Through a combination of our regular quarterly dividend and special dividend, Enact will return $250 million of capital to shareholders in 2022 which is consistent with our prior guidance. We will continue to write responsible new business that generates attractive risk-adjusted returns, invest to enhance Enact's competitive differentiation and pursue new growth opportunities and ensure we maintain a strong balance sheet and capital position that supports our existing policyholders."
}