{
    "symbol": "CURO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 22:31:11",
    "content": " US Direct Lending, which is comprised of our Heights Finance and First Heritage businesses operates at 523 locations in 13 states and make small mostly sub $2500 and larger $2500 to $30000 installment loans as well as insurance and other ancillary products. Since the end of last quarter gross loans receivable grew $152 million or 9%, primarily due to growth in Canada point-of-sale lending of $85 million or 16% sequentially and U.S. On the credit quality side our credit metric trends in Q2 were consistent with what many of our peers have reported overall with continuing trends towards orderly normalization, but still favorable to pre-pandemic run rates. But if we look at the year-to-date performance metrics for our continuing businesses that is, Flexiti, Canadian Direct Lending and Heights combined, Q2 of 2022 net charge-off rates improved 10 basis points and past due rates increased 100 basis points sequentially compared to Q1. And it's hard to say, I mean our forecast implies that we'll see charge-offs and that business probably be -- you consolidate US Direct Lending business certainly be somewhere in the 12%, 13% range in 2020 across 2023. So I think that clearly the fastest-growing part of the business will be the Flexiti business, which we expect to see sequentially 15% growth there in the third quarter and 25% growth in the fourth quarter because we got the seasonality -- that's a sequential number. And I think the US -- if I look at the US Direct Lending business, it's been more on the historical core of that business we called Southern Management and they do sort of the $700 to $1,200 installment loans that are eight months to 15 months in duration. And I think we've tightened more in that business, because that's a lower credit quality customer and in particular the stuff that's over -- we've also cut on the durations there and the credit offers that extend over 12 months. But I think, it's at a point where we feel like demand is good enough that we can still grow the business in a thoughtful kind of disciplined way and not -- while still being a little bit more selective on credit."
}