{
    "symbol": "CURO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 22:30:03",
    "content": " Of course, with this growth comes upfront and normal loan loss provisioning, we point out in our release and at the top chart of page four of our investor presentation that normal loss provisioning in this quarter compared to government stimulus impacted provisioning in the first quarter of 2021, produced a $28.7 million pre-tax earnings swing year-over-year, and we have included additional charge-off and provisioning detail for each of our business units. So we're certainly, but we're – I guess, we didn't address a revised outlook for Heights, so we're certainly affirming the outlook that we gave for Heights when we announced that deal and close that deal in December, so – which Roger and I think was in the $55 million to $56 million pretax, I think going to $75 million to $76 million in 2023. So – and then on the Flexiti side, we just looked at – I think we talked about that in the last call, the sales volumes have been running a little bit behind what we'd like, and that's just retail, general and Canada people spend more money on dining out and travel, et cetera, and on  and furniture, et cetera. That's going to – that delta year-over-year and the second half of the year kind of normalizes, but that the business will continue to make a little more money, I think each quarter, but it's never – like-for-like that 2022, we said a number of times 2022 will never approach 2021. John, again, just to make – I think one of the ways we look at the business now is, we take sort of direct lending like we take the Heights business, Canada Direct Lending, the Flexiti business, and then the U.S. direct lending business, but without the burden of the interest expense, that kind of sets up a  because we look at those businesses, they all have financing facilities, non-recourse financing facilities, and we deduct the interest expense of those from their pre-tax earnings from an internal work. So if you add the $75 million of interest expense on the bonds back to the U.S. segment, you can sort of see the level – that the business unit, the operations aren't profitable, they're quite profitable. But again, and you can – if you look at the – we just plot, we give you on Page 4, the very bottom right corner page of Page 4, we give you the charge-off rate by segment, and you can see that Flexiti gone, it's actually – it's gone down even from 2Q of last year, which was a pretty good quarter from a credit quality standpoint. But that's a business that is – at the end, we think if we get to a 1 billion receivables, we would be the fourth largest retail credit card originator in Canada, I know one was Canada , I can't remember any others."
}