{
    "symbol": "KTOS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 22:18:19",
    "content": " So highlights in the 2022 budget related to Kratos include, in the tactical drone area and related to Kratos' 2020 Kratos is 2022, the 2022 budgeted funding areas which are not classified and which I can discuss include approximately $160 million in aggregate funding for Skyborg, OBSS, attritables, autonomous air combat operations, prototypes, ad Air UX and very importantly, funding for a new Kratos tactical drone customer which we now expect to be under contract in the second half of this year and expect to be providing several cradles alkalies to in the future. We are also excited that all of the services, and in particular, the air services elements of the services are now moving towards affordable mass, including low-cost, attritable autonomous drone systems included as reflected in the 2022 budget, the 2023 budget request and the fight and Kratos with the family of affordable attritable flying today with others in development and with Kratos having several active production lines producing approximately 150 aircraft annually is positioned to immediately address this expected to be very large new market area. The 2022 budget included funding for GBSD, where Northrop is the prime, under which program we are forecasting a significant ramp-up and increase for Kratos in the second half of this year, with GBSD expected to be one of Kratos' largest and fastest-growing future programs. The 2022 budget includes funding for Kratos' Rocket Systems business, including for our new ZUS affordable launch system and related to Kratos' new Aranas hypersonic vehicles which are progressing toward initial flight. As I mentioned, in addition to the 22 DoD budget being approved, the initial 23 budget request was released which included substantial or increased funding for hypersonics, tactical drones, GBSD and strategic deterrence, missile defense, space and satellite systems, microwave electronics and C5ISR are all, of course, core Kratos business areas. However, once integrated with Kratos and based on certain funding in the '22 budget that was just approved and what is expected to be included in the final 23 budget and the incredible U.S. national security focus on hypersonics, strategic deterrence and space-related systems, we expect 20 to 23 over 2022 and future year-over-year revenue and EBITDA growth trajectory to be strong with expanding margins for SRE. Kratos' space satellite and cyber business, our company's largest, continues to see customer acceptance for our first-to-market virtual software-based open space satellite C2 and TT&C ground system, including OneWeb which Kratos is now under contract with to deliver an advanced spectrum monitoring system to monitor, analyze and review spectrum to support high quality of service for one web fleet of low earth orbit satellites. The space and satellite industry end market continues to experience significant growth and expansion which growth is expected to continue for the long term, and we believe Kratos' industry-leading ground infrastructure systems products, software and technology uniquely positions Kratos to participate and rapidly grow in this area. And these 4 new programs, 2 of which we have received, including OneWeb and 2 which we have been informed by the customer that we have won and that we expect to receive in Q2, we believe is just the beginning of an incredible disruptive technology growth trajectory for this business and significant value creation for Kratos' stakeholders. Similar to other Kratos businesses, the recapitalization of strategic weapon systems to address peer threats and the need for jet drones, new improved longer range and more powerful cruise missiles and powered munitions also including extended range, our well-funded priority areas, including in the '22 budget and the 23 request. Kratos' engines which are running today are designed in on several new missile and drone and powered munition systems, and we are working to be designed in on several other systems and programs, and we continue to progress from development and test quantities to expected future serial production. Also, I am able to announce today that KTT is a key member of the Rolls-Royce team for the recapitalization of the B-52 bomber fleet engines, a reported $2.6 billion program and that Kratos has now received its contract from Rolls-Royce which is expected to be one of KTT's largest programs and which is one of the key elements of Kratos' '22 financial forecast and Q3 to Q4 projected sequential growth as this new large program ramps for Kratos. Also, as Kratos is primarily a product company, with the vast majority of Kratos' contracts and programs being firm fixed price, our ability to pass cost increases on to the customer in the near term is limited under existing contracts or priced options which is currently impacting us, including Q1 and Q2, but we have included cost escalations into the new bids and new or unpriced options, new opportunities contracts and programs which we expect to begin mitigating this impact in Q3. With the core Kratos product and technology-focused national security business positioned in a macro growing market with significant budgetary increases expected for the foreseeable future, where Kratos' core business is generating significant revenues and EBITDA and where we are also positioned for transformative potential future growth with industry-leading products in space, satellites and drones which Kratos growth trajectory, we expect to begin in the second half of this year and to continue thereafter. Our Unmanned Systems segment reported revenues of $52.6 million in the first quarter of '22 compared to $55.9 million in the first quarter of '21, primarily reflecting the current expected production ramp and cycle on certain programs. KGS reported revenues of $143.6 million in the first quarter of '22 compared to $138.3 million in the first quarter of '21, including contribution of $14.7 million from the recently acquired COSMIC KDS and CTT entities, offset partially by the loss of an international training contract which contributed revenue of $8.3 million in the first quarter of '21 in 22 KGS revenues were unfavorably impacted by continued and increasing supply chain, COVID and related delays and disruptions which impacted current quarter revenues and favorably by approximately $14.6 million as these revenues were deferred to future periods with the most notable impacts in our commercial satellite and C5ISR businesses. Q1 '22 cash flow from operations was a use of $7.9 million, including a use for the increase of inventory balances of $15.3 million during the quarter, primarily in our satellite microwave electronics and C5ISR businesses in anticipation of the ramps in production in the second half of the year and in part to advance inventory levels in an attempt to mitigate the impact of supply chain disruptions. Additionally, our forecasted second quarter EBITDA is further impacted by our expected mix of revenues, including an increased mix of lower-margin development programs and international commercial satellite hardware programs and an expected lower volume of higher-margin software solution deliveries which are expected in the second half of '22 with an expected ramp from the third to the fourth quarter based upon contracts we have been awarded or have been informed we will be awarded. Good afternoon, Eric and Deanna. Good afternoon, Eric and Deanna."
}