{
    "symbol": "KTOS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 22:29:05",
    "content": " In the third quarter, Kratos successfully executed on what we could control then it continued in increasingly difficult operating environment, generating a 1.1 book-to-bill ratio, successfully executing a Valkyrie block to flight and receiving a recent new hypersonic system related program award MACH-TB or Multi-Service Advanced Capability Hypersonics Test Bed with our partner Dynetics both which we were able to announce today. We are currently positioned for additional upcoming milestones and significant contract awards, including another important new hypersonic related program we hope to announce by the end of this year, and the definitization of an approximate $250 million potential value microwave electronics C2 program award. Since our last report to you we have also faced challenges, including that we were recently informed that a certain Kratos satellite program relating -- related to software products expected to be delivered in 2022 to an existing under contract government customer have now been delayed to a future period. We also have now determined that as a result of the continuing incredibly tight labor market for qualified machinists, production and other skilled personnel, including those with security clearances that we will not achieve by the fiscal year-end our previous forecast net increase headcount target required to execute on our backlog and achieve our financial forecast, which I discussed on last quarters call as a key operational and execution imperative. As a result of these issues, and considering that the DoD just last week published a letter reiterating that they would not allow companies like Kratos to receive contract price adjustments, request for equitable adjustments or increases in funding for inflation and related cost growth on our existing contracts, we have reflected the financial impacts of each of these related and other items in today's third quarter financial report and our updated fiscal 2022 forecasts which Deanna will discuss in her remarks. And we remain confident in our mission of being the disruptive technology company in the national security market area, evidenced by our continued success, including having a 1.2 to 1 LTM book-to-bill ratio, as I mentioned a 1.1 to 1 Q3 book-to-bill, with multiple large new programs both received and ramping like MACH-TB, and having a record combined backlog and opportunity pipeline. Kratos' proprietary new and first to market Zeus and Erinyes affordable launch and hypersonic systems continue to progress with the initial flights with our customers planned for next year, which we anticipate will provide us with new program opportunities in addition to our current family of flight systems and vehicles. The 1000s of new satellites forecast to be placed into orbit over the coming years, including in LEO, MEO and GEO for both national security and commercial missions are expected to provide a large rapidly growing market and opportunity set for Kratos and for our proprietary first to market open space virtualized suite of C tubes, TTMC and other ground system software products. Kratos' microwave electronics business is similarly positioned for future organic growth also with expanding margins, with a focus on well funded mission-critical national security areas including missile, radar, EW, CNDR , C2 systems, several of which are in production and ramping. In addition, our operating results included a charge of approximately $3.4 million related to certain non-recoverable costs, including rate costs growth items, resulting from an inability to hire the required planned direct labor base both internally and by our subcontractors to execute on our backlog due to a continuing challenging environment in both hiring and retaining skilled manufacturing personnel, including in our seats by via charges. For example, while we have been successful in hiring over 96 new skilled staff this year in this business, unfortunately, we are down net 14 staff members since the beginning of this year, as we have lost 110 staff members in this business due to attrition from retirement, including from employee decisions made related to COVID fascination compliance and protocol related policies and staff leaving for other employment due to the incredibly competitive and tight labor market, and with significantly increasing compensation. Additionally, as we are managing supply chain related disruptions and shortages, our operating cash flow continues to be impacted by advanced inventory purchases we have made it over $27 million year-to-date, which reflect increases in inventories across our product based businesses, including unmanned systems, space and satellite microwave products and . Our fourth quarter for year 2022 financial guidance we provided today includes our current forecasted business mix, and our assumptions related to the expected continued impact on employee absenteeism, challenges related to obtaining and retaining qualified personnel, supply chain disruptions, inflation and related expected cost and price increases and other COVID related items that have impacted and are currently an expected to continue impacting the industry and Kratos. Throughout the first nine months of the year, Kratos experienced a significant increase of the continued impacts from supply chain disruption, including cost increases for materials, supplies, transportation and utilities and fulfillment delays causing increased costs and inefficiencies related to manufacturing included in our indirect manufacturing rate."
}