{
    "symbol": "KTOS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 23:13:05",
    "content": " We believe that 2023 will be a transition year for Kratos to greater revenue, profit and cash flow with significant prior year investments in technology, products and systems, transitioning from development RDT&E or LRIP to fund the programs, contracts or full rate production, which will result in increased revenue, profit and operating cash flow for the company. And Kratos's rocket systems business where we have also made significant investments, we have now received two important new hypersonic system related program awards, Mayhem and MACH TB with our partner Dynetics. Kratos's rocket systems business recently successfully integrated and launched four ballistic missile targets with our government partner, which included the successful intercept test of a medium range ballistic missile target by a standard missile 3 Block IIA fired from the JS Maya, marking the first time that a Japanese Maya-class destroyer has fired an SM-3 Block IIA. We believe this successful test is representative of Kratos's industry leading position in the rocket system missile defense and ballistic missile defense areas and of Kratos's affordable, relevant, disruptive high technology rocket systems and we expect Kratos's rocket system business to be one of our fastest growing in 2023 driven by the increased global interest in air and missile defense systems. Kratos's microwave electronics business had a record backlog at year-end including a focus on missile, air defense and radar systems and we expect this business to be Kratos's one of our fastest growing for 2023. Another growth area for Kratos is new space and related launch vehicles and propulsion systems were KTT is currently under contract on multiple DoD government and commercial space system related programs, involving Kratos's hardware and products in support of some of the most technologically advanced propulsion systems in the world. In the drone missile and powered munitions area, Kratos and KTT have made progress over the past several months, including technically delivering engines to a confidential customer for a yet to be announced UAS and receiving word from a customer regarding the future opportunity for up to 1000s of Kratos engines, which we are jointly working to address and KTT is forecast to be one of Kratos's fastest growing businesses in 2023. Kratos's space and satellite communications business, our company's largest is also forecasting significant future organic growth and is expected to generate some of Kratos's highest margins, including as related to Kratos's first to market software based OpenSpace virtualized TTMCC2  and satellite ground systems, which continue to gain market acceptance in both the national security and the commercial market areas. Kratos's target drone business is performing well with major Kratos sole source programs including the Air Force's AFSAT program featuring the Kratos's BQM-167 Target and the United States Navy SSAT program featuring Kratos's 177 target drone, wherein on both program we have recently received additional large production awards. We believe that one of the primary reason the Killers program was awarded to Kratos' sole source is that we have available now Valkyrie jet drones coming off our active production line and that the Valkyries cost and price points are known not on a hoped for PowerPoint slide, which estimated costs our competitors routinely change and increase after the fact of which we believe certain of our customers are clearly beginning to take note. It was also recently reported that a U.S government customer is working with multiple industry partners to integrate leading edge autonomy capabilities into the XQ-58A as Kratos's Valkyrie and all Kratos drones have an open system architecture, meaning a variety of autonomous and AI cores can be integrated into our system. Additionally, we are also now currently in contract negotiations with the customer, laid out to Kratos's Valkyries valued at several tens of millions of dollars, which we also expect to be completed and under contract by the third quarter of this year. It is important to emphasize that with each of these Valkyrie-related opportunities thatâ\u0080\u0099s similar to Kratos's target drone business, it is extremely important that in addition to initial Valkyrie aircraft acquisition, that the flight recovery support and other system related equipment and infrastructure is also being acquired and deployed by the customers. There has also recently been increased interest in certain other Kratos's tactical drone systems in addition to the Valkyrie, which I believe is as a result of what is occurring in the Ukraine, also included as related to affordable mass warming and drone attrition rates. So now important like keys to our strategic tactical drone strategic decision making include Kratos is the only company that has affordable relevant systems flying now, not just PowerPoints, concepts, designs and press releases, and Kratos has an active production lines for jet drone aircraft today, with Kratos having produced over 1,100 high performance unmanned jet target and tactical drone aircraft to date, representing another important differencing competitive advantage for Kratos and another key reason why Kratos customers trust us. I think we know it and they know it, and we expect to continue to drive Kratos's drone cost down significantly, including with the continued actual production of aircraft to the benefit of Kratos's customers and to the detriment of certain competition, especially when the customers compare what it actually costs our competition to produce a jet drone aircraft, not what our competitors say or indicate in their proposals. As we begin 2023 every Kratos business is expecting organic growth and we are forecasting Kratos's consolidated '23 over '22 revenue growth of approximately 10% with increased margins, reduced internally funded investments and increased cash flow. Included in operating cash flows for fiscal '22 is approximately $9 million in investments in nonrecurring engineering costs for new rocket systems, hypersonic and related products including for Kratos' Zeus and Erinyes systems, including and directly related to certain received and expected new contract awards in the hypersonic system area. Our first quarter and full year '23 financial guidance we provided today includes our current forecasted business mix, and our assumptions related to the expected continued impact of challenges related to obtaining and retaining qualified personnel, supply chain disruptions, inflation and related expected costs and price increases that are currently and expected to continue impacting both the industry and Kratos."
}