{
    "symbol": "AOS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 13:53:05",
    "content": " As a result of the destock, our third quarter sales decreased 4% year-over-year due to lower residential water heater volumes, which more than offset our 2021 inflation-related pricing actions, incremental sales from our acquisition of Giant Industries late last year as well as commercial water heater and boiler growth in North America. Our Global A. O. Smith team delivered third quarter 2022 adjusted EPS of $0.69, a 15% decrease that was driven in part by a 4% decrease in sales compared to the third quarter of 2021 as well as higher costs associated with production inefficiency and higher cost materials. North America water treatment sales grew over 4% in the third quarter, primarily due to pricing actions taken to offset higher input costs. In line with expectations, sales in China decreased 10% in local currency, compared to the third quarter of 2021, primarily due to the continued impact of COVID-19-related lockdowns. 4% declined compared with 2021 operating margin, primarily due to the headwinds I mentioned and acquisition of Giant, which has lower margins than our overall legacy water heater business. Rest of the World segment margin of 9.5% was down 70 basis points from the same period last year primarily due to the negative effects of foreign currency translation as well as higher advertising expenses to promote new products in India, partially offset by improvement in China operating margin. Cash flow from operations and free cash flow of $215 million and $164 million, respectively, during the first 9 months of 2022 decreased compared to the first 9 months of 2021 due to lower customer deposits in China, higher incentive accruals from 2021 due to record sales and earnings and greater cash outlays in 2022 for -- and greater cash outlays in 2022 for increased levels of safety stock on higher cost inventory that more than offset lower accounts receivable balances. Our sales assumptions include, after approximately 8% growth in each of the last two years, which is well above the historical average growth rate, we estimate U.S. residential water heater industry unit volumes will be down approximately 12% to 13% on last year as customers rightsize their inventories and industry demand normalizes. Due to our strong backlog and stable order rates, we maintain our full year boiler sales growth projection of 25%, driven by increased pricing in response to higher input costs, prior demand for our energy-efficient products. Then if you look at that fourth quarter, we're down -- the industry will be down probably 20% from last year, which was an all-time high from when we've been tracking it. We've got the fourth quarter up about 20% compared to third quarter, but that's down a bit to last year because last year, if you recall, we had a really robust fourth quarter. You guys have been pretty consistent over the years talking about that residential water heater volumes being a 1.5% to 2% volume growth market, '20 was up 21 was up 8%, and you're looking at down 12% or 13% this year, which would probably get you back pretty close to that trend line. And -- so overall, long term, I think heat pumps going to be a primary product for us, but it's going to take some time because they're costly and -- and there -- when you do a replacement from an emergency side of the business is a little bit difficult to do a change from a regular water heater to a heat pump."
}