{
    "symbol": "AOS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 13:58:13",
    "content": " Excluding the impact of Giant, North America Water Heater sales grew 19% in the second quarter of 2022 due to pricing actions implemented in 2021, and response to rising material and logistics. We saw quarter-over-quarter improvement in our commercial gas water heater shipments, as supply chain constraints eased in the second quarter, as well as our sales of commercial electric water heaters greater than 55 gallons as order rates normalized after the regulatory change impacted orders at the beginning of the year. Adjusted segment operating margin of 21.8% decline compared with the 2021 primarily due to higher material and logistic costs, plants in production and efficiencies and the inclusion of Giant which has lower margins than our legacy water heater business. Due our strong backlog and stable order rates, we have increased our full year boiler sales growth projection from 18% to 20% to 25% sales growth, driven by increased pricing in response to higher input costs and higher demand for our energy efficient products. But as we go forward, we believe of the 7% and 9% that we have forecasted being down almost 90% positive, it's going to be in that light service, commercial electric, we just don't see the industry rebounding from a slow start in a quarter. But it's not just the water heating side, it's also pricing that we're going to have implemented in the fourth quarter on both the boiler side of the business and water treatment side of the business. I would say just kind of within our product categories, certainly the residential products were challenged most so I would say, electric water heaters and water treatment were probably the most challenge during the quarter, commercial water heating, commercial water treatment, the commercial side that's not sold through retail, kind of offset some of that 20% down which viewed as the number for overall sales volume. And on the pricing side, and on the water treatment side, going forward, in both for the boiler side and water treatment side, kind of expect to see it come in end of third quarter and in the fourth quarter, but water treatment kind of mid-single digits to 10% price increases depending on product category, similar for the boiler products in that 8% to 12% depending upon product category. But when you think about kind of the detrimental margins, and we're really just talking about residential water heater detrimental margin, and then what Kevin mentioned, the light commercial, so you probably think of that in the 35%, detrimental margin range."
}