{
    "symbol": "AOS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 14:12:10",
    "content": " Our North America boiler sales grew 24% in the quarter, primarily driven by price increases to offset higher material and transportation costs and demand for our energy efficient products. In China, sales increased 12% in local currency compared to the first quarter of 2021, primarily viewed a favorable mix as our new product offerings continue to be well received as well as higher sales of commercial water treatment products and replacement filters. Our outlook assumes we continue to see the benefit from multiple 2021 price increases compounding to approximately 50% for water heaters and continued resiliency and demand in North America for our water heating product categories, driven by replacement demand and new construction spending. You may ask your question. You may ask your question. And we talk a lot of -- we've talked a lot in the past and we've noted in our comments, the water heater pricing, but if you take outside of water heaters in North America and think about kind of the pricing on other product categories, we've got to announce price increases, and I'll just make the range 2% to 12% out there that becomes effective as we go through the year that helps a bit on the margin side as we go kind of the back half the quarter. You may ask your question. You may ask your question. You may ask your question. You may ask your question. So water treatment, boilers, we've got range of price increases on different products and it's pretty broad range, but in that 2% to 12% price increases that we've announced beyond 2021 that are just coming into effect and will be effective in the back half of the year and it was needed for those other material costs going up. You may ask your question. You may ask your question. That kind of rolls off slightly as we go into the next quarters but as I was mentioning, other commodity costs and other costs sort of fill that gap but margins for the back half of the year, sequentially, Q3 and Q4 are a little bit stronger and that's typically where we have kind of the strength in our boiler business."
}