{
    "symbol": "EDRY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 17:14:12",
    "content": " For the second quarter of 2022, we reported total net revenues of $21 million and the net income of $10.6 million or $3.61 per diluted share. In the first second quarter of 2022, the company reported total net revenues of $21 million, representing a 48.8% increase. The total net revenues of $14.1 million during the second quarter of 2021, and that was the result on the higher charter time to operate our vessels during the second quarter of this year compared to the last year, but mainly because of the increase with the highest number of vessels we owned and operated second quarter of 2022 compared to the second quarter of last year. The company reported net income and net income attributable to common shareholders for the second quarter of this year was $10.6 million as compared to net income of $2.2 million net income attributable to common shareholders for $4.5 million for the same period the second quarter of the 2021. Interest and other financing costs including interest income and loss on debt extinguishment for the second quarter of 2022 amounted to $0.8 million compared to $0.5 million at the same period of 2021 not including of $1.7 million loss on debt extinguishment that we reported last year. Basic and diluted earnings per share attributable to common shareholders for the second quarter of 2022 were $3.66 basic $3.61 diluted calculated on about $2.9 million weighted average number of shares outstanding compared to $0.83 basic in and $0.81 diluted calculated about $2.4 million weighted average number of shares outstanding for the second quarter of 2021. For the second quarter of last year, excluding the gains the unrealized loss in this case on derivatives and the loss on debt extinguishment, the adjusted earnings attributable to common shareholders would have been $2.81 and $2.76 basic dilutive respectively. Interest and other financing costs include this interest income for the first half of 2022 amounted to $1.4 million compared to $1.1 million for the same period of 2021 non-inclusive again of the $1.7 million charged on debt extinguishment, we registered last year. Basic and diluted earnings per share attributable to common shareholders for the first half of 2022 were $7.35 basic and $7.25 diluted calculated on $2.9 million weighted average number of shares outstanding compared to $1.03 basic and $1.01 diluted over the same period of last year calculated on $2.2 million and $2.4 million weighted average number of shares outstanding respectively. On average, we owned and operated 10.79 vessels in the second quarter of this year and another expense charter equivalent rate was $23,409 per vessel per day, compared to 7.37 vessels in the same period of 2021. Our total operating expenses, including management fees, general administrative expenses, but excluding the total cost with the cost of drydocking $6,462 per vessel per day in the second quarter of this year compared to $6,467 per vessel per day for the second quarter of 2021. Thus during the second quarter of 2022, our daily cash flow breakeven rate was $11,986 per vessel per day, compared to $10,614 per vessel per day to the safety as of last year, the increase mainly due to the higher loan repayments that we did during the second quarter of 2022. On average  vessels were owned and operated during the first half of this year and another expansion rate was $24,025 per vessel per day compared to 7.19 vessels owned and operated in the same period, the first six months of 2021 and on average $18,879 per vessel per day. Our total operating expenses, again, including management fees, G&A expenses, but excluding drydocking costs were $6,584 per vessel per day in the first half of this year compared to $6,518 per vessel per day for the same period of 2021. In the first half of 2022 our daily cash flow breakeven rate was $12,393 per vessel per day compared to 10,688 per vessel per day for the same period of last year the reason again being that we said how we are -- this year."
}