{
    "symbol": "NBTB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 11:48:05",
    "content": " In an interest rate environment that is volatile and where economic and macroeconomic conditions are constantly changing, we are extremely pleased with our results for the third quarter of 2022, including earnings per share of $0.90, return on average assets at 1.3% and return on average tangible common equity landing  at 17.1%. Our third quarter earnings per share were $0.90, which was up $0.04 from the $0.86 a share reported in the third quarter of 2021, and $0.02 a share higher than the linked second quarter of 2022. These results were achieved despite a $2.5 million decline in PPP income recognition compared to the third quarter of last year or $0.05, and a $1.0 million decline in PPP income from the second quarter of 2022, or $0.02 a share. The improvement in net interest income over the two comparative quarters was the result of solid organic loan growth, incremental deployment of a portion of our liquidity into investment securities, the continuation of historically low funding costs and continued -- I'm sorry, and continued increases in the Federal Reserve's targeted Fed funds rate. We recorded a loan loss provision expense of $4.5 million in the third quarter, compared to a provision benefit of $3.3 million in the third quarter of 2021, or $0.14 per share swing. Net charge-offs in the third quarter were $1.3 million or 7 basis points of loans, compared to 11 basis points of loans in the third quarter of 2021, and 4 basis points of net charge-offs in the linked second quarter. During the quarter, we also introduced a short-term treasury product designed specifically for certain customers excess liquidity that resulted in nearly $100 million of deposits moving off the balance sheet. Net interest income increased $16.8 million as compared to the third quarter of last year and was up $6.9 million from the second quarter of 2022, reflective of higher yields on earning assets. Reported third quarter net interest margin was 3.51%, up 30 basis points from the linked second quarter and 63 basis points higher than the third quarter of 2021. Excluding securities gains and losses, our fee income was down 8% from the third quarter of 2021 to $37.3 million and lower by $4.9 million from the linked second quarter. Card services income decreased $3.4 million from the third quarter of last year and $4.1 million from the linked second quarter, driven by the bank being subject to the provisions of the Durbin Amendment to the Dodd-Frank Act beginning in the third quarter, which caps our per transaction compensatory opportunity for debit card interchange activities. Our total operating expenses were $76.7 million for the quarter, which was $3.8 million, or 5.2% above the third quarter of 2021. And that compared to I think, a $1 million of PPP income in the second quarter, and I think $2.5 million in the third quarter of '21. On the banking side of fees, what we communicated sometime in the -- at the end of the second quarter that we did make some adjustments to our overdraft nonsufficient funds programs, which we think probably cost us a $0.01 per share per quarter."
}