{
    "symbol": "NBTB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 12:02:03",
    "content": " These results were achieved despite a $3.4 million decline or $0.06 a share in PPP income recognition compared to the second quarter of last year and a $700,000 decline in PPP income from the first quarter of 2022. The improvement in net interest income over the two comparative quarters was the result of solid organic loan growth, productive incremental deployment of a portion of our excess liquidity into investment securities, increases in the Federal Reserve's targeted Fed funds rate, and the continuation of historically low funding costs. We recorded a loan loss provision expense of $4.4 million in the second quarter compared to a provision benefit of $5.2 million in the second quarter of 2021 or $0.17 per share swing, and a provision expense of $600,000 in the first quarter of 2022. Net charge-offs in the second quarter were $800,000 or 4 basis points of loans compared to 7 basis points of loans in the second quarter of 2021, and 14 basis points of net charge-offs in the linked first quarter. Net interest income increased $8.4 million as compared to the second quarter of last year, and up $7.2 million from the first quarter of 2022 reflective of higher yields on earning assets. Moving to the trends in non-interest income on Page 8, excluding security gains and losses; our fee income was up 8% from the second quarter of 2021 to $42.2 million, but lower by $600,000 from the linked first quarter. Just hoping to get a little bit of color into maybe like the longer-term trends because if I'm reading it right, relative to kind of the $73 million to $74 million guide last quarter, this will put you guys kind of toward the upper single-digits for growth in 2022 versus more low-to-mid single-digits previously. So let me start to frame that, coming out of the first quarter where our operating expense rate was closer to $72 million, a couple sort of probably optically astute discussions would be around, the first quarter we were not still fully engaged. We're managing that other $3 billion in deposits, where the customers are a little more interest rate sensitive, and in fairness, would expect to be having some discussions with some portion of that part of the deposit base about fed funds rates being up 225 basis points, I think, as of tomorrow. It's an integrated approach on the frontline, in every branch, in every commercial lending office, in the business banking sector of our businesses, and a lot of collaboration on the finance side with those folks to make sure that these customers that we've been serving for many, many years, have their needs met, but also, we continue with our long history of being very careful on how that beta moves quarter-to-quarter-to quarter. Hey, just one quick sort of nitpicky follow-up question with respect to Durbin kicking in the third quarter that ATM and debit card line has kind of bounced around a little bit over the last couple quarters is the $3.7 million reduction."
}