{
    "symbol": "CSGS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 20:16:04",
    "content": " We delivered 4.1% year-over-year revenue growth, a fantastic result, especially when factoring in the discount headwinds from two of our top three customers coming from long-term renewals that we signed in late 2021. At the end of the day, our revenue growth success is fueled by exciting ongoing market demand for CSG's industry-leading SaaS products and our impressive sales results. I will go into more details on our 2023 guidance, but we are expecting organic revenue growth above the midpoint of our long-term 2% to 6%, with a revenue range between $1.13 billion and $1.17 billion this year. On strategic revenue growth, we reported $1.09 billion of revenue during the full year 2022, resulting in 4.1% year-over-year growth. Over the medium to long term, we aspire to expand CSG's operating leverage and use our strong balance sheet to deliver non-GAAP EPS growth that meets or exceeds revenue growth exactly as we did in 2022 even with the margin pressure we faced in the first half of the year. In fiscal year 2023, we expect organic revenue growth at or above the midpoint of our long-term 2% to 6% range as evidenced by our anticipated revenue range of $1.13 billion to $1.17 billion. And when any part of our business underperforms our lofty expectations, then you see CSG's operating intensity kick into high gear just like we did mid-year as we turned our disappointing first half 15.7% adjusted operating margin into a solid full-year result of 16.6% in 2022, and we built even faster revenue growth momentum heading into an exciting challenging and growth-oriented 2023. So, what we really look for from an acquisition, and we think the market is turning in our favor with the strong balance sheet, we don't have to do a deal, which means we can stay highly disciplined and be quite selective in terms of strategic fit, paying the right price with the financial accretiveness of deals we do, but it's pretty much the same as our strategic focus; winning big and the number one technology provider of choice in telecom globally. The other thing that we want to continue to focus on, it's not loss on us when we see a competitor announce 50% of their revenue comes from two customers in the U.S., and those are big customers, and some of them are having some success on fixed wireless and that's going to continue to have some wins in the market in terms of the net broadband adds in North America. Two, up-sell and cross-sell, and what we're seeing in some of these areas like we talk about on promotion roll off with a large cable or a telecom customer, if we can help them reduce the customers that churn during a promotion-ending period or around some of the appointment notifications where there's over $100 billion dollars lost in the healthcare industry alone by missed appointments, again, that's another example of driving revenue and paying for self."
}