{
    "symbol": "CSGS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 03:28:02",
    "content": " A combination of increased labor and supply chain costs to staff and deliver some of the exciting new sales winds we announced in recent quarters were key drivers the erosion of our non-GAAP adjusted operating margin by over one percentage point coming in at 15.1% in Q2, and 15.7% for the first half, 2022. We anticipate that the timely actions we're taking to offset any inflationary headwinds will enable us to quickly capture millions of dollars in margin improvement across our business in Q3 and Q4, 2022 so we deliver at or above our target non-GAAP operating margin ranges in both quarters during the second half of the year. We believe that the winners of the future will be the companies who can most quickly adjust how they lead and grow in an inflationary business environment by embracing a scarcity mindset as a way to develop competitive advantages based on agility, creativity and innovation, and most importantly to us at CSG we believe that a disciplined growth mindset unleashed in a culture that puts our people and our customers first requires us to constantly improve how we prioritize and how we measure return on investments organically and inorganically to ensure that team CSG delivers fantastic results in both the short and longer terms. Given our lower margin in the first half of the year this means we expect to perform at or above the mid upper end of our guidance of 16.5% to 17% in both Q3 and Q4 as we start to see the benefits from our recent sales wins, customer conversions and meaningful margin improvement initiatives that began in Q2. We reported $527 million in total first half revenue, resulting in 3.6% year-over-year growth, despite giving 3% to 5% discounts to two out of our three largest customers on the backs of the good renewals we signed late last year. Since 2017 CSG has grown revenue from exciting new industry verticals like retail, government, financial services and healthcare from 7% of total 2017 CSG revenue to over 24% of total revenue at year end 2021. Fortunately for us in our investors, we believe that our softer Q2 operating margin was an anomaly that we can quickly correct with ongoing good revenue growth and a timely implementation of our meaningful margin improvement plan that we anticipate will enable us to deliver at or above the mid upper end of our prior 16.5% to 17% range. Our first half non-GAAP operating income was $77 million, or 15.7% of non-GAAP adjusted revenue as compared to $80 million or 16.8% in the same prior year period. In addition to increase expenses related to the key sales Brian highlighted earlier, we also sell pressure on our adjusted operating margin from the SAS businesses we acquired in 2021 as we integrate them and launch new products with their capability that we believe will contribute to CSG revenue growth in the quarters and years ahead. Moving on, our non-GAAP adjusted EBITDA was $106 million for the first half, or 21.7% of non-GAAP adjusted revenue as compared to $109 million or 22.9% in the same prior year period."
}