{
    "symbol": "CSGS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 12:57:08",
    "content": " The timely actions we took to prioritize every dollar towards revenue growth and customer commitments resulted in one of the most profitable quarters in recent memory with 18.3% non-GAAP adjusted operating margin, well above our revised guidance range of 16.2% to 16.7%. We expect strong CSG-like free cash flow in Q4 to range from $45 million to $60 million in the upcoming quarter, which should give all of us confidence that CSG will continue to be laser focused on strong cash generation and healthy profitable revenue growth. It is great to see that CSG grew revenue 5% sequentially quarter-over-quarter combined at our 2 largest North American cable broadband customers in Q3, a result boosted by continued subscriber migrations and additional spend on ancillary services, and we also won more business in the global telecom market. And when any part of our business underperforms our lofty expectations, then you see CSG's accountability, resiliency, agility, and operating intensity kick into high gear just like we did in Q3 to significantly improve our non-GAAP adjusted operating margin to 18.3% and non-GAAP EPS growth of 20.5% year-over-year. Our Q3 non-GAAP operating income was $47 million, or 18.3% of non-GAAP adjusted revenue, as compared to $42 million, or 16.8%, in the same prior year period. While we expect to deliver strong CSG-like Q4 free cash flow in the range of $45 million to $60 million, which is similar to our Q4 2021 free cash flow result of $48 million, the full year 2022 cash flow is expected to be between $25 million and $40 million for the full year due to some operating optimization actions and factors impacting timing. So when we talk about the CSG Xponent Ignite launch in the market, this is a customized solution for really starting out with 4 industry verticals, communication service providers, financial services, retail, healthcare life science, we're seeing fantastic market receptivity to our new market launch, and we're seeing just fantastic wins like the couple we announced in the life sciences space and like we announced with the big expansion of one of the top 3 U.S. pharmacy retailers. We're laser focused, faster growth, more discipline, driving better and better non-GAAP adjusted operating margins, delivering on strong cash flow in Q4, and building momentum so the 2023 is even better, faster growth, and better results across the board than what we're going to deliver when we finish a strong 2022."
}