{
    "symbol": "BLIN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-20 20:17:06",
    "content": " This year, Bridgeline delivered 27% top-line revenue growth, a $3.6 million increase in revenue to end of year with $16.8 million in total revenue. In the fourth quarter, we booked $1 million in new license ARR from 28 sales with $340,000 in ARR annual recurring revenue. We ended fiscal 2022 with over $2 million in net income and $196,000 in adjusted EBITDA, driven primarily by our subscription and license revenue, which comprised over 80% of our total revenue with gross margins of 75%. We ended our fiscal year with $2.9 million in cash that being after a prepayment of $1.7 million in the fourth quarter relating to a negotiated $600,000 discount to the earn-out working capital adjustment on the HawkSearch acquisition in consideration for just a six month early payment. Our total revenue for the quarter ended September 30, 2022 was $4.2 million, an increase of 3%, as compared to $4.1 million in the prior year period. Looking at each component of revenue, our subscription and license revenue, which is comprised of SaaS licenses, maintenance hosting revenue and perpetual license revenue increased 3% for the quarter ended September 30, 2022 to $3.4 million. Our services revenue was $0.8 million for the quarter ended September 30, 2022, up slightly from the $0.8 million in the prior year fourth quarter. Our cost of revenue decreased 6% or $0.1 million to $1.2 million for the quarter, compared to $1.3 million in the prior year period. As a result, our gross profit increased 7% or $0.2 million to $3 million for the quarter ended September 30, 2022, as compared to $2.8 million for the prior year period. Our subscription license gross margins were 76% for the quarter ended September 2022, as compared to 75% in the prior year period, and our services gross margins were 47% for the quarter ended September 2022, compared to 37% in the same period in 2021. Our operating expenses slightly decreased to $3.4 million for the quarter ended September 2022, from $3.4 million in the prior year period. Our net loss was $0.5 million for the quarter ended September 30, 2022, as compared to a net loss of $1.4 million in the prior year period. Moving to EBITDA, as Ari mentioned, our adjusted EBITDA for the quarter ended September 2022 was $0.1 million, compared to $0.2 million for the prior year period. And we are looking for companies that are between $3 million and $6 million in revenue that we can pick up for two times revenue or less with the right payment terms and earn-out, typically an earn-out directly proportional to retained revenue over the first two years and initial payment of 50% with 50% being the earn-out."
}