{
    "symbol": "DPRO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 03:55:03",
    "content": " And it's -- there's lots of drones or airframes you could put into that theater but there are not a lot of growing solutions that can provide the delivery of insulin or antibiotics or emergency medical equipment in a combat zone, that's the -- for humanitarian reasons, and that's the exact type of solution that's gratings traction with customers over in that region. When you sell an entire solution to a company and you're servicing long-term multiyear contracts, but you can do it because you have a strategic differentiator that's built into your sensors and into your -- there great products, they're world-class actually fit a much bigger solution for our customers that moving what we call opportunities, multiple opportunities that are coming. It would be -- it's so tempting to talk about the massive numbers -- in the organization, but we've really stuck to the discipline of making sure our capacity is in place, making sure that our infrastructure and our admin, our ERPs and all the rest of it can handle what we see coming through this pipeline, while we're still managing to introduce new product lines and continue that kind of 20% just consistent organic growth and we think it's going to pay dividends for us. If we look at our executive team, I compared it against any executive team in the industry and not that there's not a lot of great ones out there, but this is a team that's really got the experience, both in terms of the drone industry, but also the entrepreneurial industry, the engineering space, the legal space and it's really, really gelling -- ... Some of the work that we've done over the Ukraine in the last quarter has been tremendous in terms of our winching technology, our AI in order to hover and drop -- in some cases, that's not necessarily as it relates to consumer goods, but certainly in the theater that, that is, that's really important for making sure that we get humanitarian packages and such right into the exact spots and areas that we want to. We just saw news this week of another big VC-backed $100 million, maybe $75 million investment, just -- business, people don't recognize that they get -- it's all glory and exciting, and it's just such a big opportunity, but it is incredibly particular and -- but so much more than just building an airframe."
}