{
    "symbol": "DPRO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-27 23:45:08",
    "content": " And so -- and the timing of this really comes from the fact that weâ\u0080\u0099ve been in the business for so long, weâ\u0080\u0099ve got such a strong bench that can do this type of work and so weâ\u0080\u0099re well positioned for this area of the market, which is where the market is growing, not just because of regulation, but because of also the additional utility that weâ\u0080\u0099ve seen and expertise that weâ\u0080\u0099ve seen come out of Ukraine. As I mentioned earlier, the Draganfly has been accepting a growing roster on our wait list of applicants and orders in order to take the Commander 3XL in Q4 and thatâ\u0080\u0099s, obviously, when weâ\u0080\u0099ll have our new plant fully up to speed and starting to ramp, and weâ\u0080\u0099re really excited about the visibility that weâ\u0080\u0099ve got on revenue going forward in that regard. And so there are many channels to potentially sell product into the Ukraine, but itâ\u0080\u0099s a very complex sale when youâ\u0080\u0099re actually going through the proper channels and so itâ\u0080\u0099s been a long, arduous track, but man, itâ\u0080\u0099s really start, it -- well, itâ\u0080\u0099s paid off already, but itâ\u0080\u0099s really starting to pay off and we see it as a massive credibility and sales generation piece for us for decades and decades to come. That loss ended this year includes a non-cash change comprised of a change in fair value of derivative liability of $5.5 million and expense for an impairment of note receivable of $309,000, a write-down of inventory of $1.9 million and expense for goodwill and intangibles of $6.4 million and what otherwise have been a comprehensive loss of $24 million versus last yearâ\u0080\u0099s $19.1 million, excluding non-cash items from last year as well. Again, weâ\u0080\u0099re not taking a next quarter view on this, like, okay, how do we get in a bunch of cheap drones and sell it to somebody who kind of authorized and knows Bobâ\u0080\u0099s uncles, friends, brother type, like these are -- weâ\u0080\u0099re really taking the time to make sure that weâ\u0080\u0099re built into the regulations that we have the right clearances, that -- those types of things. So, again, weâ\u0080\u0099re in a really privileged position where weâ\u0080\u0099ve got such an experienced bench, probably, the stretch for us to go from building drones -- to building sensors that we use on the drones, that we have used on drones for years and years, probably, isnâ\u0080\u0099t as big of a stretch for maybe some other drone companies."
}