{
    "symbol": "DPRO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 22:23:11",
    "content": " Today’s call will follow the same format as previous ones, which means it will start with our CEO and now our President, Cameron Chell discussing first quarter operational highlights; from there CFO, Paul Sun will jump in and discuss the financials as were reported earlier today. While we’ll try to address them all, I apologize in advance, if time doesn’t allow us to do so. I’ve already talked to so many of you, but remember, you’re always welcome to reach out to me anytime, investor.relations@draganfly.com. In fact, certainly within the industry, we’re known as the oldest commercial drone manufacturer in the world. And in fact even recently this week, I got a -- some pictures and the text from a shareholder who was in North Carolina, at a police museum, and they actually had old Draganfly drone controllers in the police museum as the first drones that were used in public safety and public service. And I think what’s really important to note there is that in our 24-year history, we’ve only had two employees that have left, and one of them retired and one of them was stolen by Google a number of years ago. And so, that -- the combination of the expertise that we are able to bring to the table, not just from an engineering perspective, but from an industry and a relationship perspective is something that’s really propelling us forward in the market today, as it opens up. Basically, we have 24 patents, because we’re 24 years old. But it’s a bit more of a cultural thing for us, when we put our engineers’ names on the patents that they sort of deliberately shouldn’t  be there. So, we really rely on that as a credibility piece with our customers, and demonstration piece for our culture, but it’s really all the other hundreds of pieces of IP that we keep as trading secrets that really help us have a competitive advantage with our customers. We are really strong in new product development, and we’ll talk a bit about that on today’s call. So, we’re not a shop that’s building things necessarily on spec. But if we don’t see customer demand really pushing in that direction, if we don’t see our relationships on a regulatory basis pushing in that direction, we won’t invest in technology just because we think it’s cool. The underlying premise of the drone industry today, as opposed to the last 20 years that we’ve been in it is that it is finely scaling. But the reality is, none of them are in the drone business or even in business today, because they were trying to scale into an industry that didn’t yet exist. And that guidance is now given a reference point for the commercial industry to build ROI models and have a clear direction as to how the drone industry is going to work and how commercial drones will work within the infrastructure, within our society and within the airspace. Literally within weeks of that announcement coming out from the FAA a couple of years ago, I went from spending my days dialing for dollars quite basically, grinding it out for customers to really being overwhelmed with the inbound orders. It’s taken us about a year and maybe a year and a half to tool up, to build our capacity to meet that customer demand, which is why we did the public offering that we did. And with our rich history of 24 years of service, to the public safety and to our military contracting community, we have those credentials, and that’s another reason that we are starting to see scale. A lot of the new drone startups or even if they’re not startups, but companies that have been around for 4 or 5, 6 years, they’re just -- they are still building hardware and all credit to them. And they’re still figuring out how to get those clearances and build those relationships, and they are doing a fine job of it. And it’s great business, it’s high margin, it’s low volume. It helps us to attract the best talent in the industry, and it’s one of the reasons that we have been able to keep our talent for so long. We get to work on really incredible projects, blood delivery on the battlefield or counter drone technology, autonomous and AI type of technologies that have -- we’ve been now working with for, in some cases a decade, which are now only starting to become prevalent in the commercial market. And when we deliver terabytes of data, whether it’s a LiDAR data, mapping data, environmental data, whatever the case is to customers, more and more, they are asking us to house that data. And I would suggest that in coming years in some industries, we’ll be one of the largest data repositories for those particular industries in the world. In terms of our product and services, as I mentioned before, we’ve got fixed wing, we’ve got medical response drones, our whole DFR drones, the first responder aspect of our business is growing immensely right now. In terms of flight services, we’re very specialized in mining, agriculture, forestry and power lines, or long form infrastructure, which could be powerlines or pipelines for example. So, we can provide information back to these companies that other flight service organizations can’t. And so, we’re able to build and do things with drones that simply a lot of other companies just can’t. At this point, what I’d like to do before we get on to talk about some of our customer highlights from this last quarter is I’d like to turn it over to our CFO, Paul Sun to talk about our financial results. So, looking at this slide here, if you looked at the left table, that’s basically an income statement. So for the quick snapshot of Q1 2022, you’ll see that revenue for the first quarter was up 32.8% to just over $2 million, up from $1.53 million in the first quarter of 2021. First quarter revenue comprised of $1.64 million from product sales, with $406,000 coming from drone services with the balance coming from engineering services. You’ll see that gross profit increased by $301,000 or 58.5%, this quarter over the same period last year. But for some of our investors that have been with us for a while, they’ll recall that there’s an accounting treatment where a non-cash change in fair value from derivatives are included in these numbers. So, in this quarter, there’s a non-cash expense of $1.2 million from the derivative liability along with a non-cash recovery of $771,000 from receivable. Now, looking at the middle table about our balance sheet, you’ll see that total assets decreased by from $42 million to $37.59 million from the year-end, which is largely due to the deployment of cash. So here, we’ll talk about the quarter over changes between Q1 of this year in Q4 of last year. Again, that’s due to sales mix but pretty much steady. And again, you’ll know that that includes a noncash change in fair value of derivative liability of $1.23 million and that recovery of a no receivable of $771,000 versus what we saw in Q4 of $23.4 million. And with that, I’ll pass it back to you Cam. Paul, I know it’s a really challenging environment to ensure that all these numbers get in and we just had a new ERP implemented in this last quarter and a bit. But I think it’s worth mentioning is that first of all, this is organic growth. We’re up 25%, again, over Q4, which was a record quarter, which I think we’re up about 20% on that quarter as well. We’re up over 30% year-over-year, organic growth based. And certainly, I don’t see any insight in ongoing growth in this measured fashion. This is a drone, it’s very unique to Draganfly, that you’ll see the box or the payload that’s on that drone that’s a temperature managed box so that we’re able to deliver 35 pounds of things like pharmaceuticals, blood, insulin, epipen, temperature sensitive medical supplies. This particular drone has about a 20 kilometer capability, effectively about 10 kilometer end-to-end when you’re running these things. This came particularly out of the work that we were doing with Texas Emergency Medical Services over the last year for standing up a drone first responder program there, where we’ve got actual medical delivery that can get to accident sites or victims or emergency situations quicker than trucks or personnel camp. But getting these drones over into Ukraine with this credible organization isn’t just a feat of engineering and isn’t just a great product, but it’s also like the logistics and the training and such. We are going to be supplying, not just these medical response drones, what we refer to as the MRDs, but we’ll also be supplying search and rescue drones, which is a smaller drone version, primarily equipped with a thermal camera to look for heat signatures. It’s a much smaller unit, much faster unit. We’ll also be providing situational awareness drones, which are effectively a reconnaissance drone to help to provide situational awareness for search and rescue teams that are on the ground to ensure that they remain safe or there aren’t potential threats coming into their area. Since this initial 13-unit order, we’ve got another 5 orders that have come in on this. The other thing that’s really happened because of this particular customer is, the inbound inquiries around other types of drones. He’s had over 240,000 employees at Homeland Security that ultimately were responsible and reporting up to part of his executive team. So, I really am looking forward to -- glad that John’s accepted this position. As part of this, I’m taking over the not just the CEO but the President’s position of the Company, as Scott Larson, who’s been our interim President for almost two years now, will remain a lead director with the Company, will continue to work very closely with myself on a lot of the M&A and the larger business development initiatives that we have going on. We’ve done a great job in my opinion of populating our sales teams, our management infrastructure, and our capability to deliver incredible products and services to our customer who is really what we focus on. And before you scale, you’ve got to demonstrate to a highly credible customers that you can do that. And I think we’re starting to see -- not starting, not thinking. We’re not starting actually, we are definitely in the midst of seeing that scaling start to happen. So, if it wasn’t already friendly enough in terms of what the FAA was doing in the delivery market and beyond visual line of sight space now, what the world is seeing and regulators are seeing around what’s happening in Ukraine and the uses of drones and how effective they can be, we’re seeing a lot of incredible international exposure for Draganfly and inbound inquiries there. And then, finally, I think it’s really important know note the seasoned executive team that we have. When you start considering people like Paul Mullen and John Mitnik and Andy Card and Julie, it’s just -- we are hitting way over our weight class, in my opinion, in terms of the type of talent that we’ve been very fortunate to attract. So, if we think about team, I think we’re at the top of our game. If we think about traction, we’ve got demonstrated Q-over-Q and year-over-year growth as fast as our capacity will allow us to grow. And we’ve got traction -- I mean, technology, excuse me. We’ve got a demonstrated IP portfolio, we’ve got hundreds of pieces of IP, we’ve got new product that’s hitting the market that’s in front of our competitors. So, on that note, what I’d like to do, with great pleasure, is I’d like to ask Scott, who is our Lead Director, Scott Larson -- first of all, again, to thank him for his service and his leadership, his friendship and his mentorship to the Company and to myself over the last two years. So, as we’ve done in the past, a number of people have emailed in questions beforehand, some of which were worked into the presentation. We’ve had questions that have come in just during this, that some have been addressed, some haven’t. And so, we’re just kind of going to make our way through the -- through here as best as we can. A few, I’ll send back to Cam. Cam, why don’t I start off -- start this one off with you. Well, I’m not particularly concerned about it, because the same thing that we face, every single one of our competitors faces. So, some customer expectations are in line with what’s happening with inflation and what’s happening with supply chain challenges. So, where before, I would even say pre-COVID, people had an expectation that you had next day delivery and/or 3-week turnaround time, now 12 to 18 weeks isn’t out of question. Now, we’re -- to give you an example, when we had the Ukraine opportunity come into us, we turned that entire thing around in less than four weeks. So, we did some big inventory purchases, I think we’ve done what we can to make sure that we’re in a good position to be able to meet the demand. But as it relates to the entire industry, I think we’re delivering as quickly and certainly with as much passion and vigor as anybody could expect us to. So, I don’t have big concerns around it just because customer expectations are in line with what’s real. We’ve talked about growing organically, as well as going through acquisitions and kind of large partnership deals with, I don’t want to step over any disclosure lines here, but certainly, this has been something that Draganfly has mentioned previously. So, a big thing we’ve done too in the past few years, and so it’s not outside of what we do, but we look at them at a case by case basis. And, I think we’ll expect to make some prudent decisions, but it certainly is part of our strategy. So, it’s not like we have an incredibly rich currency in order to go out and make these acquisitions. But, there are a couple of real gems out there that Scott’s cranking. Some of the things we are looking at -- we’ve talked about it before, of course. So, we are really looking forward to what’s happened in that regard, as well as the other travel industry. And so, we seem to have some great inroads into corrections and into sheriff’s departments. Now, that that kind of seems to be fading, we are actually talking about the real scalable businesses out there, and that’s a pretty exciting time for us. Maybe we’ll just take a couple more questions, and they’re -- they keep coming in. If we don’t have time to get to all the questions, feel free to follow up with us afterwards. You can, of course, contact Rolly at the IR, email it in and we’ll try to make a way through as many of these we can here. Looking at the most recent filing, and Cam, I’ll send this back one to you. We are looking at what’s happening in the pipeline, what products need to be produced, what machining and tooling we have to put in place for the orders to be had or orders we expect out, and then building the capacity to meet those. So we have done a number of things, I think very creatively in order to -- in our product line, standardizing some of our base platforms, much more product stuff will be coming out in this next quarter that we’ll be talking through in order to not have to overload capacity or build two types of machining things or tool too many things overall. We’re very conscientious of cash in particular, in this market. And, we’ve got sufficient cash burn. So hopefully not have to be thinking about doing any financings in the near-term, unless it’s acquisition based. So, listen, we’re just going to keep driving revenue. And so, to the extent that that is hardware, it’s hardware that always leads to a bigger solution, that always leads to a software or a reoccurring revenue base. So, we’re very fortunate to be in a strong cash position. We’re very fortunate to have a governance organization that’s focused on, making sure that we are doing things that -- be able to generating cash and shareholder value. Cam mentioned this already, it’s easy for us to operate. And so, I would say -- and I’ll let Cam give a little more color on this as well. We’ve had inbound calls related to this coming in from Asia, Europe, and the Middle East and Africa as well. But I think the overall Draganfly strategy is to keep working on technology, keep making sure that we come up with technology that’s relevant to the market, as Cam mentioned, but then also looking for services and ways that we can scale this, not only here in North America, but globally. And I don’t know, Cam, if you want to add another comment or two on that. It is interesting to us, the international work that’s coming in where the regulations aren’t quite as onerous as they are in North America. That said, we’re really focused on being experts here in North America. But the international inbound has really been much more than I would have expected, not that we didn’t have some expectation around it. And like you said, we’ll just keep meeting demand and keep hitting numbers. Final question here, maybe, and then we’ll look to wrap it up. And it’s kind of a tricky conversation, of course, because we’re not given guidance here. So, I think the saving grace that we’ve got here is, if you look at every other drone company out there, the charts are pretty much the same. And on top of it, we’re in a pretty tough market right now, in particular, for micro caps. So, again, for us, we’re in a fortunate position, we got a strong balance sheet, we have an excellent management team, and we’re growing revenue organically. That’s what we’re going to focus on, incredible products for incredible customers and keep driving that revenue. We’ve got a solid plan, we’ve got a capacity built out, we’ve got our infrastructure in place, we’ve got our ERPs done, we’ve got -- like, we’re in a spot where we’re going to be able to produce the results. The downturn in the stock or maybe -- just I think people are just getting out or looking for other opportunities or exiting the market, or they don’t like the micro caps, whatever the case, may be, I view it as a buying opportunity. And I feel really, really confident about where this company is going to go, how we’re doing it, where the industry is going to end up. And I think that’s what we’re focused on is just we’re focused on the fundamentals, we’ve been super consistent, we’ve hit all our numbers, everything we’ve committed to doing, we’ve got done. The market may be what the market is going to be, but we’re going to be the winner at the end of the day. So, listen, it’s 45 minutes after we started. I know it’s late, particularly for folks on the East Coast. And so, I think with that last question, we’ll look to wrap this up, I just want to say thank you to everyone who joined us, for this. So, Cam, I’ll let you close it off. Well, first and foremost, to our employees, I really want to thank everybody for the commitment that you’ve done -- you’ve shown in the last quarter for the incredible growth. And to our shareholders, it’s a grind out there. So, we can’t thank you enough for your consideration and for sticking with us and being part of what I think is going to be the next multibillion dollar drone company."
}