{
    "symbol": "RVMD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 22:58:02",
    "content": " In the third quarter, Revolution Medicines continued advancing our pipeline of groundbreaking RAS(ON) inhibitors on behalf of patients with a wide range of RAS-addicted cancers which represent 30% of all human cancers. With the transition of these RAS(ON) inhibitors into early clinical development, we now have 4 compounds from our cohesive portfolio of RAS cancer-targeted therapeutics in human studies. First, we have entered the arena by advanced clinical development, the first 2 drug candidates from our highly innovative RAS(ON) inhibitor portfolio. In a Phase IIb trial, evaluating RMC-6236, our oral RAS multi-on inhibitor, investigators are dosing patients who have tumors harboring various common KRAS G12 cancer mutations which may include KRAS G12D, KRAS G12V and KRAS-G12R. In a Phase I/Ib trial of our oral KRASG12C inhibitor, RMC-6291, investigators are dosing patients who have tumors harboring the KRAS G12C cancer variant. This first wave of RAS(ON) inhibitor drug candidates, RMC-6236, 6291 and 9805 has the potential to help serve the vast majority of patients with RAS-addicted cancers. In the third quarter, our clinical collaborator, Amgen reported encouraging preliminary evidence from its Phase Ib CodeBreaK 101 clinical study, suggesting promising and durable benefit from combining RMC-4630 with Amgen's KRAS G12C inhibitor, sotorasib, particularly in second-line treatment of patients with non-small cell lung cancer who were KRASG12C inhibitor naive. We continue deploying our development resources primarily in support of our 3 most advanced RAS(ON) inhibitors, RMC-6236, 6291 and 9805 and 2 clinical-stage RAS companion inhibitors, RMC-4630 and 5552. Despite this growing clinical pipeline, we continue our strong commitment to research activities that provide critical scientific insights to support ongoing development activities and that also leverage our proven RAS innovation engine to generate exciting new mutant selective RAS(ON) inhibitors with distinct profiles. We expect to nominate our next RAS(ON) inhibitor development candidate by the end of the year which will join a planned second wave of additional RAS(ON) inhibitor drug candidates, including our KRAS G13C inhibitor, ARMC-8839. In our RAS(ON) inhibitor portfolio upcoming milestones are as follows: to provide evidence of first-in-class single-agent activity for RMC-6236 in 2023, to provide preliminary evidence of superior activity for RMC-6291 in 2023 with this clinical profile potentially indicated by tolerability safety and/or antitumor effects and to announce dosing of the first patient in a monotherapy dose escalation study of ARMC-9805 in mid-'23. In our RAS Companion inhibitor portfolio, upcoming milestones are as follows: to provide top-line data from the 463003 study of RMC-4630 plus sotorasib in the second half of '23 and to disclose additional evidence of single-agent activity for RMC-5552 in 2023. Our first wave of RAS(ON) inhibitors which includes 3 distinct and highly differentiated drug candidates has advanced significantly with patients now being dosed with RMC-6236 or 6291 and RMC-9805, continuing its progress towards the clinic. As you know, the P1 co-mutant GMOs , these lung tumors do not do so well with single-agent basis, at least the first generation RAS(ON) inhibitors. Now keep in mind, we've restricted enrollment based on genotype initially to the KRAS G12 mutations to a small number of those, essentially excluding G12C initially because those patients have available to them a G12C inhibitor, including now RMC-6291 in the clinical trial. We have the opportunity to combine with something possibly even with RMC-6236 and go chasing after patients that have progressed or failed KRAS G12C(OFF) inhibitor, we can go head-to-head with them in that second-line space or we can go head-to-head with them in any of the first-line spaces that are currently all available to us. I guess, first, in terms of the data that we've seen publicly it seems as if their comparator was really KRAS G12C(OFF) inhibitors. I think in terms of conceptually, it's not clear to us why having G12C(OFF) inhibitory activity is advantageous if you have a G12C(ON) inhibitor. So it's not clear to us and frankly, an experiments in which we combined RMC-6291 with a KRAS G12C (OFF) inhibitor, we didn't see any advantage over RMC6291."
}