{
    "symbol": "RVMD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 22:42:03",
    "content": " Revolution Medicines is advancing our pipeline of groundbreaking RAS(ON) Inhibitors and RAS Companion Inhibitors on behalf of patients with a wide range of RAS-addicted cancers, setting up an exciting and data rich year. 6236 shows high potency in cellular assays inhibiting RAS signaling typically at low nanomolar to sub-nanomolar concentrations and frequently driving deep and sustained RAS pathway suppression in RAS dependent tumor cells, and we have shown extensive preclinical evidence that 6236 induces deep and sustained regressions in diverse in vivo cancer models representing multiple tumor types and multiple RAS-mutant genotypes, especially KRASG12X mutants, a RAS inhibitor profile that is, to our knowledge, unprecedented. Consistent with study eligibility criteria, patients with a range of tumor types in which KRASG12X mutations are common have been enrolled, including major epithelial cancers, such as non-small cell lung cancer, pancreatic, colorectal and other tumors, including ovarian cancer, appendiceal and bile duct cancers. Nevertheless, the totality of data across these 12 patients reinforces our growing conviction about the potential for RMC-6236 to exhibit promising clinical anti-tumor activity in patients with advanced RAS-mutant tumors at doses that are well tolerated. The collection of data just presented is, to our knowledge, the first-ever clinical data to be presented on any inhibitor designed to target the (ON) state of RAS, any RAS-targeted therapy used to treat a patient with a tumor bearing the KRASG12D mutation or any oral RAS(ON) inhibitor used to treat a patient with lung or pancreatic cancer bearing KRASG12D or various other non-G12C mutations. While initial data from the patients described today are quite encouraging overall in terms of tolerability and anti-tumor activity in multiple tumor types with multiple RAS genotypes and the case report shows a dramatic effect in KRASG12D pancreatic cancer at a tolerated dose, we will need additional data to project response rates or durability in pancreatic, lung or other cancers and across different RAS mutations at the recommended Phase II dose and schedule. These findings are quite encouraging about the ability of a rationally designed tri-complex RAS(ON) inhibitor to be taken orally, for it to exhibit drug-like pharmacokinetics and for the tri-complex mechanism of action to drive inhibition of RAS(ON) proteins and confer promising anti-tumor benefit in patients without being accompanied by extraordinary toxicities. Of course, much more information is needed for more definitive conclusions to be drawn about each individual drug candidate, which we expect will be forthcoming over time, but we believe the information we've shared intended to represent our experience with two RAS(ON) inhibitors so far increases the probability of success for these two assets and may well read through to other assets we are developing. We expect to provide a more detailed update from this study later this year, and our aim is to bring it together with one or more RAS(ON) inhibitors to test as combination treatment in patients with tumors harboring both RAS mutations and mTORC1 pathway activation. We are highly encouraged with the progress of our rich development pipeline, particularly by the body of clinical evidence developed so far that provides initial validation of our RAS(ON) inhibitor platform and as described here, promising early evidence that RMC-6236 can be dosed in patients to induce significant anti-tumor activity without unacceptable side effects. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}