{
    "symbol": "RVMD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 21:01:02",
    "content": " RMC-6236, a bold compound that we have shown preclinically inhibits a wide range of RAS proteins that can drive cancer is the first development candidate from our broad collection of RAS(ON) Inhibitors to enter clinical development. Based on their preclinical profiles, we believe that in aggregate, this first wave of RAS(ON) Inhibitor drug candidates, RMC-6236, 6291 and 9805 has the potential to help serve the vast majority of patients with RAS-addicted cancers. Our clinical collaborator Amgen recently reported encouraging preliminary evidence from its Phase 1b CodeBreaK 101clinical study, suggesting promising and durable benefit from combining RMC-4630 with its KRASG12C inhibitor sotorasib, particularly in second-line treatment of patients with non-small cell lung cancer, who are KRASG12C inhibitor naive. In this period, we intend to concentrate our development resources on our three most advanced RAS(ON) Inhibitors, RMC-6236, 6291 and 9805 and two clinical stage RAS companion inhibitors RMC-4630 and 5552. In our RAS(ON) Inhibitor portfolio, upcoming milestones are as follows: to provide evidence of first-in-class single-agent activity for RMC-6236 in 2023, to announce dosing of the first patient in a monotherapy dose escalation study of RMC-6291 in the second half of 2022 and provide preliminary evidence of superior activity in 2023 and to announce dosing of the first patient in a monotherapy dose escalation study of RMC-9805 in mid-2023. The first wave of RAS(ON) Inhibitors, which includes three differentiated drug candidates has advanced significantly with RMC-6236 now dosing patients, RMC-6291 preparing to begin dosing patients shortly and RMC-9805, continuing progress toward the clinic. But I also think a fair point is that amongst these three initial RAS(ON) inhibitors that are going into the clinic, while they do cover the vast majority of RAS-addicted cancers in aggregate, there is also real opportunity for specialized additional, you know, inhibitors that are targeting specific mutants beyond those. You know, there's a lot going on, but we know that all eyes are on, you know, these first three RAS(ON) inhibitors, and also to see the best companion inhibitors mature. And so in essence, one's already gotten a glimpse of what things can look like on an interim basis, and it didn't seem to us and to a number of investors speaking to us that anybody would really care about another interim update and that what was really needed is a more definitive answer, does RMC-4630 provide additive value to sotorasib in second-line non-small cell lung cancer."
}