{
    "symbol": "RVMD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 04:00:03",
    "content": " First, Raton inhibitors demonstrate compelling monotherapy antitumor activity in diverse preclinical models of genetically defined RAS cancers. And third, Raton inhibitors as monotherapies reverse the immunosuppressive tumor microenvironment in RAS-driven cancer models and can unlock profound antitumor immunity when combined with immune system modulators such as PD-1 checkpoint inhibitors. Slide 14; as another example, RMC-6291 is a potent oral selective covalent inhibitor of KRAS G12C on with a differentiated preclinical profile designed to serve patients with cancers driven by the KRAS G12C mutation, including lung, colorectal and pancreatic cancers. Slide 19; as a third example, ARMC9805 is an oral selective covalent inhibitor of KRAS G12D on, the primary tumor driver for more than 50,000 new patients annually in the United States, predominantly patients with colorectal pancreatic or non-small cell lung cancer. Slide 24; lastly, in our pipeline expansion programs, we continue leveraging our RAS innovation engine to identify additional orally bioavailable tri-complex Raton inhibitors to target RAS variants driving RAS-addicted cancers that are unserved by current targeted drugs. Slide 29; I Second, RMC-6236, the exciting RAS multi ON inhibitor I described earlier, is notable within our broad Raton inhibitor portfolio because it, in particular, has the potential to be deployed as a RAS companion inhibitor as well as a primary cancer driver targeted agents. Slide 30; at the AACR meeting, we reported that RMC-6236 in combination with RMC-6291, demonstrated enhanced antitumor activity in KRASG12C non-small cell lung cancer and colorectal cancer models. First, RAS inhibitors demonstrate compelling monotherapy antitumor activity in diverse preclinical models of genetically defined rest cancers. And third, Raton inhibitors as monotherapies reverse the immunosuppressive tumor microenvironment in RAS-driven cancer models and can unlock profound antitumor immunity when combined with immune system modulators such as PD-1 checkpoint inhibitors. And maybe a related concept, obviously, is that Pharmacy 636 -- it's sort of a Rascompanion inhibitor built into our Sdirectintober has the ability not only to target the mutant driver, let's say, KRAS GD or G12D GFR, but also other companion signaling activities that can support those primary drivers. We've built on that by creating a dedicated single histotype study, the lung cancer -- non-small cell lung cancer study and used the opportunity in a dedicated study to create boundaries for several different cohorts within that, as you know, specifically to help us understand the sensitivity of those tumors with only a KRAS GLC mutation driver and not in current mutations elsewhere versus those that carry co-mutations in RAS and RAS-related signaling because we do know from the experience over the last couple of years now, something we didn't know at the beginning of all of this, which is that, at least for the KRASG12C off inhibitors, the there are some factors that can create differential sensitivity."
}