{
    "symbol": "FDUS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 17:29:03",
    "content": " For the third quarter, our portfolio delivered strong results generating a 27% increase in adjusted NII on a larger debt portfolio with higher yields and net realized gains of $40 million or $1.64 per share from monetizing a meaningful portion of our equity portfolio. Adjusted net investment income, which we define as net investment income, excluding any capital gain incentive fee, attributable to realized and unrealized gains and losses was $12.7 million, or $0.51 per share, an increase of $2.7 million, or $0.11 per share compared to last year. If we look at the portfolio today, in light of the recent period of high levels of M&A and investment activity, we have successfully built our debt portfolio on a fair value basis from $549.8 million as of December 31, 2021 to $747.3 million as of September 30, 2022, in part by redeploying proceeds from equity realizations into income producing assets. We invested $107.9 million in keeping with our proven strategy of investing in debt securities to generate recurring interest income and in equity securities to generate a margin of safety and incremental profits, $75.1 million was invested in first-lien debt, consistent with our focus on that security. Of the $107.9 million, a total of $82.3 million was invested in six new portfolio companies comprised of $10.8 million in AmeriWater, LLC leading provider of water purification systems and aftermarket parts and consumables for health care and industrial applications, consisting of $7.8 million in first lien debt, $2 million in subordinated debt and $1 million in common equity. $11.5 million in OnePath Systems LLC, a leading provider of a full suite of managed IT services, consisting of $11 million in first-lien debt and $0.5 million in common equity and $4.8 million in second-lean debt of SonicWall U.S. Holdings, Inc., a global provider of network and access security solutions. The remaining $25.6 million was comprised of add-on investments in 8 existing portfolio companies, including a $10 million subordinated debt investment in Van steel. In terms of repayments and realizations in the third quarter, we received proceeds totaling $60.2 million, of which monetization of equity investments accounted for $43 million or a little more than 70% of the total. We received a distribution on our common equity investment and realized a gain of approximately $3.2 million related to the sale of Bandon Fitness, Inc. We received payment in full of $4.5 million on our first lien debt investment in Precision Parts, we received a distribution on our common equity investment and realized a gain of approximately $9 million related to the sale of SES Investors, LLC, doing business as SES Foam. In conjunction with the transaction, we invested $10 million in subordinated debt and we received a distribution on our equity investment and realized a gain of approximately $1.4 million related to the sale of the Transonic companies. We also exited our debt and equity investment in OMC Investors LLC, doing business as Ohio Medical Corporation, received payment in full of $5.2 million on our second lien debt, includes a prepayment fee. Total investment income was $25 million for the three months ended September 30, a $3.8 million increase from Q2, primarily due to a $2.1 million increase in interest income, including PIK, a $1.1 million increase in fee income due to higher levels of investment activity and prepayment fees, and a $0.6 million increase in dividend income. The increase in interest income was driven by an increase in average debt investment balances outstanding as well as an increase in the yield on our debt investments, given increase in interest rates on variable rate loans Total expenses, including income tax provision were $12.3 million for the second quarter, $2.1 million higher than Q2, primarily driven by a $1.9 million increase in the income incentive fee. For the three months ended September 30, we recognized approximately $40 million of net realized gains primarily from the partial sale of our equity investment in Fan Steel and the sale of our equity investments in SES Foam, Bandon Fitness, PALISADE and Transonic. As of September 30, our total investment portfolio had fair value of $856.9 million, our average portfolio company investment on a cost basis was $11 million, which excludes investments in 13 portfolio companies that sold their operations and are in the process of winding down."
}