{
    "symbol": "FDUS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 19:34:06",
    "content": " Adjusted net investment income, which we define as net investment income, excluding any capital gain incentive fee attributable to realized and unrealized gains and losses, was $10.4 million, or $0.43 per share, essentially unchanged versus $10.4 million or $0.42 per share last year. In total, we invested $45.7 million in debt and equity securities, including $19.5 million in two new portfolio companies that we announced as subsequent events on the first quarter call. As a reminder, we invested $8.5 million in first lien debt and made a commitment up to $1 million of additional first lien debt in Choice Technology Solutions, LLC doing business as Choice Merchant Solutions, LLC, a leading omnichannel global payments platform. The remaining $26.2 million was primarily related to the new $15 million subordinated debt investment in energy, fundings under existing commitments, and other add-on investments in portfolio companies. For this reason, monetization of equity investments accounted for about half of the total repayments and realizations this quarter, bringing the total equity proceeds for the first half of the year to $35 million and year-to-date net realized gains to $25.1 million. In terms of sales and exits, we received payment in full of $8.8 million, including a prepayment penalty, on our first lien debt in Comply365 LLC. We made a commitment of $20 million in first lien debt of BP Thrift Buyer LLC, doing business as Unique and Eco Thrift, an owner and operator of retail thrift stores. We received a distribution on our common equity investment and realized a gain of approximately $1.9 million related to the sale of Palisade Company, LLC. We received a distribution on our common equity investment in SES Investors, LLC, doing business as SES Foam, and realized a gain of approximately $9 million. We received payment in full of $5.3 million, including a prepayment penalty on our first lien debt investment in Healthfuse, LLC. Subsequent to quarter end in total, we have received incremental proceeds from our equity investments of $40.4 million and realized net gains of approximately $38.4 million. Total investment income was 21.2 million for the three months ended June 30, a $0.6 million increase from Q1 primarily due to $2.1 million increase in interest income, including PIK, offset by a $0.6 million decrease in fee income and a $0.9 million decrease in dividend income. Excluding the accrued capital gains incentive fee, total expenses in Q2 were approximately 0.8 million higher than Q1 due to a $0.2 million increase in interest expense, a $0.4 million increase in management and income incentive fees, a $0.2 million increase in other G&A expenses, primarily related to proxy solicitation for the annual shareholders meeting, and a $0.1 million increase in taxes offset by a $0.2 million decrease in professional fees. For the three months ended June 30, we recognized approximately 18.2 million of net realized gains, primarily from sales related to our equity investments in Pinnergy, TransGo, Abaco  and CRS Texas."
}