{
    "symbol": "APPH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 22:27:09",
    "content": " We also have been making good progress on securing non-dilutive financing to support our expansion, including the recently announced $50 million USDA-backed loans and a $30 million loan for Mastronardi Produce, $15 million of which has been funded and $15 million of which remains to be funded. The third quarter net loss of $24 million was higher than the net loss in the corresponding period of the prior year of $17.3 million, largely due to the change in fair value of the private warrants last year which was partially offset by lower SG&A costs this year. Despite the investments and expansion and growth this year, we improved our third quarter adjusted EBITDA loss to $12 million from $16.5 million last year. In terms of capital expenditures, we estimate spending approximately $85 million to $95 million in remaining CapEx during the next 2 quarters for the completion of the 3 construction projects underway. Total expected CapEx spend increased by approximately $30 million due to supply chain disruptions, construction delays as well as scope modifications related to automation and configuration of equipment, food safety and office space. We also recently announced a $30 million credit facility with Mastronardi Produce backed by our Berea farm, $15 million of which has been funded and $15 million of which remains to be funded. We now expect our full year 2022 net sales outlook to be in the range of $14 million to $17 million, reflecting the supply chain-related construction delays that we've experienced at our 3 new farms affecting the timing of commercial shipments. Regarding adjusted EBITDA loss, we are also updating our outlook range for the year and now expect a loss in the range of $67 million to $72 million, reflecting the reductions in costs from the farm delays as well as the cost saving measures we have implemented in the second half of this year, including a reduction in corporate staff. Well, it's -- now we can focus on our -- the assets we have which are these 4 CEA facilities that span nearly 8 million square feet across product type and what we're going to be focused on is operational efficiency, streamlining the business."
}