{
    "symbol": "CFLT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 22:04:12",
    "content": " As data streaming use cases grow, and real-time data flows more freely across the business, it's critical that this data can easily be discovered, understood and governed in real time. But at the same time we believe there are strong expansion opportunities with our largest customers still including those with ARR of $10 million or more, particularly as we make it easier to connect and consume data throughout the platform. Confluent will be the central nervous system for Armis' data streaming platform managing data from billions of devices in real time, all while enabling them to reassign 70% of the expensive engineering talent previously focused on Kafka to projects that move the needle for the business. Inspired by our platform's extensive capabilities and an accelerated move to the cloud our customers reimagined their data architecture in 2021, leading to our first multimillion dollar deal with this customer. Additionally, customers run their operational workloads on Confluent and these workloads are directly responsible for driving the core operations of our customers' business, which reflects the mission criticality and resiliency of our data streaming platform. And as sort of another sort of take on that, if you sort of aggregate it up in your mind, what percentage of the business Confluent Cloud or overall is coming supporting like operational use cases, whether it's just-in-time inventory or a dynamic pricing, something that's driving more operational use cases versus Confluent being used for analytical decisions to support for more analytical use cases. When we, kind of, give that $2 million to $3 million of pressure for Q4 and as we did for Q3 I think that takes into account both new use cases like net new customers new use cases as well as expansion. With that said, Confluent Platform is incredibly important and it's important for the solution that we're providing customers need to be running their data and motion solution everywhere. Well, for both billings and deferred revenue, they are impacted by mix and as we have more Confluent Cloud business, specifically on billings we have a mixture kind of in practice, but usually it's monthly or quarterly billings for Confluent Cloud."
}