{
    "symbol": "BIOR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 22:16:11",
    "content": " I’ll now turn the call over to Chuck Padala, Managing Director with LifeSci Advisors, Biora Therapeutics Investor Relations firm. Good afternoon, and welcome to Biora Therapeutics first quarter 2022 corporate update and financial results conference call. Joining me on the call are Adi Mohanty, Chief Executive Officer; and Eric d’Esparbes, Chief Financial Officer. Before I turn the call over to Mr. Mohanty, I would like to remind you that today’s call will include forward-looking statements within the meaning of the federal securities laws, including, but not limited to the types of statements identified as forward-looking in our quarterly report on Form 10-Q that we will file later today and our subsequent reports filed with the SEC, which will all be available on our website in the Investors section. For a further description of the risks and uncertainties that could cause actual results to differ materially from those expressed in the forward-looking statements as well as risks related to our business, please see the company’s periodic reports filed with the SEC. With this platform, we’re aiming to maximize systemic uptake of large molecules by using liquid jet delivery to the smallest intestine via an easy to use oral capsule. In the few weeks since our last call, we’ve made significant progress on our transformation. We’ve contributed all assets related to these technologies to newly formed Enumera molecular, which intends to develop and commercialize the platform and will be funded with an initial $12.5 million Series A financing round led by Arboretum Ventures, a sophisticated healthcare investor. Paul brings over 30 years of biotech experience leading successful development programs and commercial products, while implementing novel manufacturing processes. Our lead program, PGN-600 is a proprietary liquid formulation of tofacitinib delivered in the colon using our targeted delivery technology, which is a capsule approximately the size of a fish oil pill. In conjunction with our scientific collaborators, we will present at Digestive Disease Week, DDW in San Diego later this month, data that builds upon presentations at the European Crohn’s and Colitis Organization and the Belgian Week of Gastroenterology conferences earlier this year. Our preclinical results show that successful targeted delivery with PGN-600 enables about 25 times higher concentration in colon tissue compared to the equivalent standard oral dose, while showing significantly less systemic exposure. This demonstrates the potential for PGN-600, the safely increased drug levels at the site of disease, which could dramatically improve disease management for UC patients. During the first quarter, we completed a discussion with our Clinical Advisory Board, which includes Dr. William Sandborn, Dr. Geert D’Haens, Dr. Bruce Sands and Dr. Séverine Vermeire, who are all leading experts in GI diseases and used their inputs to refine our clinical development programs. Following that response, we will be submitting an IND later this year for a Phase 1 study with PGN-600, which should keep us on track for our plan Phase 2 study next year. Given the data we’ve already generated and presented on the correlation between tissue concentration of tofacitinib and improved patient outcomes, if the clinical data generated in our Phase 1 trial confirms that we can safely achieve high tissue concentrations just as we have seen with PGN-600 in preclinical studies, we believe the likelihood of improving remission rates and subsequent studies in UC patients is high. Because of the well known therapeutic profile of tofacitinib and standard oral formulations and the ability to utilize or reference these existing data, we believe our development risks from PGN-600 are reduced. Soon after the Phase 1 trial is completed, we plan to initiate a disease interventional study, where we may learn more definitively about the benefits of solution can bring to UC patients. Our overall clinical development path may have some advantages, because we’re using molecules that have well known safety and efficacy profiles. If we’re able to demonstrate that the device functions as desired, the next step to demonstrate that the combination works should have the higher likelihood of success compared to many other therapeutics in early development. Each development stage that we successfully achieve will increase the values the current program, and really the entire platform, thus strengthening our position to assess and discuss partnership opportunities and future commercialization. Next, I’ll cover our systemic biotherapeutics platform. Our systemic therapeutics delivery solution is an oral capsule, which provides liquid jet delivery of large molecules. In order to maximize systemic uptake, we believe this platform can help improve disease management and associated patient outcomes, reduce intravenous infusion costs, help expand the market for drugs across a range of chronic use indications and help biotherapeutics, such as monoclonal become more competitive with small molecule substitutes. Our platform with the protective capsule and jet means this system has a capability to deliver a range of approved large molecules, such as proteins, peptides, and nucleic acids without complex reformulation. Since our last call, we’ve continued to make progress with device, design and manufacturing and making improvements that will increase device performance, reliability, and manufacturability. Although, we have data with several molecules on this platform, such as the monoclonal antibody adalimumab, our initial focus is on a high concentration formulation of the peptide liraglutide, a GLP-1 receptor agonist. We will be presenting preclinical data on the performance of this platform at the Controlled Release Society Annual Meeting, which will take place in July and we expect the share existing and future results at other upcoming conferences. As with our other platform, here too, we’re initially using drugs with established safety and efficacy profiles, which should result in several advantages in the regulatory pathways and development plans for this platform. For now, we plan to take one systemic therapeutic program forward to these latest stages, which we expect will show the broad applicability of the platform for use with many other existing and in development therapeutics. Although, our targeted and systemic therapeutic platforms are the primary focus of the company in the near term, we continue to incubate our other platform technologies for the future. At Digestive Disease Week in May, we will share proof-of-concept results from a clinical study, demonstrating the ability of our recoverable sampling system, our third platform technology, which uses an oral capsule to non-invasively collect and preserve a microbiome sample. We expect to generate and share upcoming conferences bioavailability data from our systemic therapeutics program, which will enable our first clinical studies to begin next year. With that, I’ll now turn the call over to Eric for a discussion of our financial results and capital market activities. As Adi mentioned earlier, we’ve now completed our company transformation into a therapeutics company with the goal of leading the oral delivery of biotherapeutics. We’re now a more focused organization with a much reduced cash burn profile with a spin-out of our single molecule detection platform, we’ve created the opportunity to generate a return on our past investment while eliminating the associated cash burn. Operating expenses, excluding stock-based compensation expenses were $18 million in a first quarter of 2021 in line with our previous guidance, as we’ve now completed a transfer of our molecular testing assets. More specifically, G&A expenses in the first quarter were $13.5 million, including $1.7 million in stock-based compensation expense. As we mentioned in our previous call, we expect G&A expenses to gradually reduce by Q4 this year, while our R&D expenses will mainly track our clinical activities workflow and expect to end the year with a monthly operating cash burn of less than $4 million. I’d like to invite you to learn more about Biora by visiting our new website at bioratherapeutics.com, where you can also view our updated corporate presentation under the Investors section. You’ll also find links on our website to the new Biora Therapeutics social media accounts, where we invite you to follow along with us on our mission to reimagine therapeutics. First on PGN-600, I understand the initial patient population you want to focus on in the clinic, our biologic experience, UC patients. But just wondering at this point, if biologic naïve patients might be of interest in the future and by extension the potential for – excuse me, potential for first line positioning. But given the preclinical data and our potential outcomes, we think absolutely there is a opportunity to move up the use of these kinds of drugs to first line. So on the systemic program, I think actually there’s a couple other really exciting interesting data points that might be coming out this month. So we’re doing a few more animal studies, I think in our talk earlier, we mentioned that we’ve gotten indication that a 10% to 15% bioavailability would be interesting. It’s also because we have these collaborators, which is great, we’re able to work with these companies that that could be potential users of this technology, who are saying, look that 10% to 15% is the interesting range in terms of being commercially viable. And if you could touch on the manufacturing improvements as well and scalability as you get to late-stage development, that’d be great. What we normally expect with a single dose, with a multiple ascending dose, but the potential doses are absolutely going to be lower than what is currently commercially on commercial label, because we know we can get more drug, so a smaller dose, typical Phase 1 study quickly moving to that disease intervention study. We’re proposing that we think we can do a pretty robust serious Phase 2 study that would be potentially placebo-controlled with the disease state and moderate, severe disease. And then as we get initial data, we might be able to have, and so I don’t want to say exactly what the design would be, but we might be able to have data that helps us evolve that trial. That’s a little more than we have shared, but hopefully very soon we will have all the details be able to give you the entire study proposal."
}