{
    "symbol": "PANW",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-17 20:48:06",
    "content": "  Clay Bilby: Good day, everyone, and welcome to Palo Alto Networks Fiscal First Quarter 2023 Earnings Conference Call. Please note that this call is being recorded today, Thursday, November 17, 2022, at 1:30 p.m. Pacific Time. With me on today's call are Nikesh Arora, our Chairman and Chief Executive Officer; and Dipak Golechha, our Chief Financial Officer. Our Chief Product Officer, Lee Klarich, will join us in the Q&A session following the prepared remarks. During the course of today's call, we will make forward-looking statements and projections regarding company's business operations and financial performance. All comparisons are on a year-over-year basis, unless specifically noted otherwise. Good afternoon, and thank you, everyone, for joining us for our earnings call. As you can see, we had a solid first quarter where we showed balanced top line growth and a demonstrable focus on profitability. Early in the quarter, we saw some customer behavior changes and have adapted our operations to align with the changing market conditions. On the top line, billings grew 27% year-over-year, while RPO grew 38%. Demonstrate progress on our transformation, we have shared how our new cloud delivered and cloud-enabled offerings are contributing to our business via our NGS ARR. In that context, this quarter, our NGS ARR hit a key milestone. As the macroeconomic environment changes, we are accelerating our efforts to drive incremental operating leverage in our business. Given that we're the largest independent cybersecurity business, we can meaningfully improve our margins over the next phase of our company's next cycle. For the second quarter in a row, we generated net income on a GAAP basis as we focus on GAAP profitability for the fiscal year. Towards that end, we continue to see large cross-platform buys and grow our millionaire customers at a steady clip. Our customers have been in a journey with us, initial deals that give them comfort with our products and help distinguish our abilities from our competition, over time, lead to customers seeing an opportunity to consolidate into one of our platforms. As they get comfortable with either Strata, Prisma or Cortex, we see them looking at further consolidation across multiple platforms from us. This strategy has allowed us to continue to transition our deal sizes with satisfied customers, and we expect this to continue. Consistent with that approach, we have had some marquee deals this quarter. A large U.S. utility signed a 7-figure deal for software firewalls, security subscription and the Prisma Cloud. The customer has hundreds of appliance-based firewalls, and chose our software firewalls because of our consistent architecture, and choose Prisma Cloud as a standardized security across 4 public clouds. A major European media company signed an 8-figure multiproduct deal, replacing several incumbent network security vendors and consolidating on Palo Alto Networks, including our full line of cloud delivered security subscriptions. We closed a 7-figure deal with a U.S. technology company, spanning all 3 platforms. The customer did not have our physical firewalls in the environment, but valued our consistency of software firewall deployment across on-premise and cloud. You can see evidence of our broader success with large customer commitments in our active millionaire customer count, where we added over 230 year-over-year in the first quarter. This quarter saw us launch software composition analysis in Prisma Cloud, SaaS security posture management and SASE, and just this week, across our next-generation firewalls. This quarter, we received leadership recognition in 2 new categories, adding cloud security posture management, or CSPM, and cloud-native application protection platform, or CNAPP, to our list. Our innovations in the appliance firewall form factor, including our Gen 4 refresh and our investments in the virtual form factor, have continued to drive our share gains. On a year-over-year basis, we have gained approximately 3 percentage points of market share in the appliance market and 7 percentage points in the VM market. Many are in the relatively early stages of executing SASE, given it involves changes to their security network architectures. Our Prisma SASE offering has gained industry recognition, and we've seen an increasing number of wins within our installed base, as well as with new customers. To put this into perspective, our firewall customer base is over 15x larger than our SASE customer base. With our core sellers now enabled and executing and driving SASE into the installed base, SASE continues to represent our largest pipeline. While we have highlighted the number of new subscriptions we offer, we have also reimagined our existing capabilities. Our advanced URL filtering and threat prevention versions leverage deep learning to block evasive, zero-day unknown attacks in real time. Yesterday, we introduced the advanced version WildFire to stop more zero-day cloud attacks as part of our PAN-OS 11.0 Nova release. Building on this, we released our SCA, or software composition analysis solution in Q1. The integration of SCA with the Prisma Cloud platform, enables developers and security teams to prioritize known vulnerabilities that impact the application life cycle proactively. Half of our Prisma Cloud customers are using 2 or more modules, and nearly 20% are using 4 or more modules. In Q1, our credit consumption grew 55% year-over-year. Building further upon our success, shifting left with IAC Security and ASC adoption, we're doubling down on investing in software supply chain security. Today, we announced our intent to acquire Cider Security, which is key to the strategy. Cider brings the ability to visualize customers' application development and deployment environment, analyze the tools, identify risks and how to remediate them. With the integration of Cider's capabilities into Prisma Cloud after the closing of the acquisition, we will further our leadership in cloud security, helping enterprises secure applications from code to cloud. Across Cortex, we are focused on driving momentum in a number of areas. In Q1, we saw strong Cortex large deal performance. We had success not only with XDR, XSOAR and Expanse on a stand-alone basis, but a number of notable examples of multiproduct deals. We continue to innovate across Cortex during Q1, delivering a new managed detection and response service built on our XDR capability and enriched by our Unit 42 world-class threat intelligence. I'm most excited about the general availability of XSIAM, our breakthrough autonomous security operations platform. Our launch event for XSIAM were oversubscribed, and we see a lot of resonance with our product and its future roadmap as customers reimagine the world of SOC management. Most recently, we've had 2 multimillion-dollar commitments from XSIAM design partners as they expanded into production deployments. At this point, the majority of our design customers have transitioned to paying customers. In fact, we are carefully managing how we onboard future XSIAM customers because we want to ensure fast customer time to value. Our interest list is north of 50 customers, who would like us to deploy XSIAM. In summary, I feel our teams did a good job in a seasonally tough quarter, where also the macroeconomic climate is fast changing. While cybersecurity is somewhat resilient, we do see some marginal signs of impact. Cybersecurity deals are getting more scrutiny, suggesting deeper and longer reviews of transformational projects. The impact is not uniform across all sectors, but those feeling the impact of interest rate increases are more likely to scrutinize their budgets than those prospering in the high interest rate environment. Technology, CPG and some parts of retail are feeling an impact, while utilities, oil and gas, defense and public sector verticals continue to be on course of their plans. Coming off Q4, Q1 tends to be a seasonally more challenging quarter, but we were able to tame some of these early trends by doubling down on execution. As we discussed last quarter, we have seen some customers delay hardware refresh plans. I continue to believe that hardware will have a long-term industry growth rate in the 5% to 8% range, and we might trend to the lower end of the range. However, coupled with an easing supply chain, I expect that near term, we'll continue to report a low double-digit growth rate for product revenue. Given the increased scrutiny and return requirements, the silver lining for Palo Alto Networks is that we are having more conversations around consolidating platforms than we've ever had before. Instead, they will continue to consolidate towards like-for-like capabilities from fewer vendors. We believe that whilst there may be short-term bumps to the pace of investment by some of the customers, these projects will continue for the medium and long term. We see cybersecurity spending as resilient, but not immune to customers adjusting for the current environment. Having said that, I continue to believe that we can overcome these macroeconomic impacts with strong and focused execution, which is what we plan to do. We're now finding it easier to recruit and hire top talent, but also seeing lower attrition rates, which necessitates fewer overall new hires. As we proceed through the year and focus internally how we respond to the external landscape, sharp execution from our teams will be paramount. Before I turn the call over to Dipak, I want to provide some perspectives on how we're thinking about the forecast. Within our revenue, we do expect slightly higher product revenue growth in the range of 10-plus percent as we are able to ship some orders that had previously been held back by the more challenging supply chain situation I mentioned earlier. We're also reflecting the strength we saw in NGS ARR during Q1, with higher NGS ARR guidance range for the year. This reflects not only the performance of our Cortex Prisma Cloud SASE and software firewalls, but also the success we have seen in advanced cloud-delivered subscriptions that I noted. On a positive note, we're focusing more and more on execution and how our teams focus on driving incremental operating leverage. Towards that end, we were able to take steps to accelerate the profitability we previously outlined at our Analyst Day, which was reflected in our Q1 operating margin and EPS performance. And as a result, we're raising our operating margin guidance for the year by 50 basis points. This, as well as higher interest income, is driving the increase to our EPS and cash flow guidance as Dipak will cover. Over the last 3 years on a compounded basis, our EPS and adjusted free cash flow have grown below our revenue growth rate as we made significant investments. We are not targeting EPS and adjusted free cash flow to both grow north of 30% at our guidance midpoint, which is ahead of our revenue growth. We believe our broad portfolio focus as an advantage as we focus on emerging areas where customers are allocating new budget dollars, while also capturing an increased portion of the customers broader cybersecurity budget as they look to consolidate spending. We will continue to invest for the long term with our commitment to fund innovation, while we also pursue near-term opportunities to drive efficiencies in our business. For Q1, revenue of $1.56 billion grew 25% and was above the high end of our guidance range. By geography, we saw growth across all theaters, with EMEA up 32%, the Americas growing 24% and JPAC growing 26%. Our next-generation security capabilities are increasingly driving our results, and our NGS ARR grew 67% and at $2.11 billion exceeded $2 billion for the first time. This includes Cortex, Prisma Cloud, Prisma SASE, software firewalls and the advanced versions of cloud-delivered subscriptions. We delivered total billings of $1.75 billion, up 27%, which was above the high end of our guidance range. Total deferred revenue in Q1 was $7.2 billion, an increase of 39%. Remaining performance obligation, or RPO, was $8.3 billion, increasing 38%, with current RPO representing about half of our RPO similar to previous quarters. I already highlighted non-GAAP gross margin of 74.3% was down 10 basis points year-over-year, with some incremental supply chain-related expenses being incurred for components and shipping. Operating margin was 20.6%, an increase of 260 basis points year-over-year. This strength in operating margin was the result of lower expenses as a percent of revenue across all 3 expense lines, R&D, sales and marketing and G&A. Our balance sheet is strong, closing Q1 with the highest cash and investable balance ever with cash equivalents and investments of $5.9 billion. We have ample flexibility to repay debt coming due, invest in the business, do tuck-in acquisitions and return capital to shareholders. We generated more than $1 billion in free cash flow for the first time in our history, with total free cash flow of $1.2 billion this quarter. This puts us well on track to hit our annual guidance, which we are raising today. This cash flow performance was largely driven by strong collections in the quarter, that we expected based on the strength of our business in Q4. As a reminder, our share repurchase program is opportunistic, and we're committed to this method of returning cash to shareholders over the medium term. As Nikesh discussed on the M&A front, we entered into a definitive agreement to purchase Cider Security for approximately $195 million in cash, excluding the value of replacement equity awards, subject to adjustments. On a year-over-year basis, we continue to manage our down as a percent of revenue, in line with our long-term plans. For the second fiscal quarter of 2023, we expect billings to be in the range of $1.94 billion to $1.99 billion, an increase of 21% to 24%. We expect revenue to be in the range of $1.63 billion to $1.66 billion, an increase of 24% to 26%. We expect non-GAAP EPSto be in the range of $0.76 to $0.78, an increase of 31% to 35%. For the fiscal year, we expect billings to be in the range of $8.95 billion to $9.1 billion, an increase of 20% to 22%. We expect NGS ARR to be in the range of $2.65 billion to $2.7 billion, an increase of 40% to 43%. We expect revenue to be in the range of $6.85 billion to $6.91 billion, an increase of 25% to 26%. We expect product revenue growth in the range of 10%, up slightly, as Nikesh outlined in his remarks. We expect fiscal '23 operating margins to be in the range of 19.5% to 20%, up 50 basis points versus the range we outlined coming into the year. We expect non-GAAP EPS to be in the range of $3.37 to $3.40, an increase of 34% to 37%. We expect adjusted free cash flow margin to be 34.5% to $35.5%, and we continue to expect to be GAAP profitable for fiscal year 2023. We expect our non-GAAP tax rate to remain at 22% for Q2 and fiscal '23, subject to the outcome of future tax legislation. For Q2 '23, we expect net interest and other income of $18 million to $20 million. We expect Q2 capital expenditures of $40 million to $45 million, and we expect fiscal year capital expenditures of $190 million, $200 million. As an additional modeling support based on our prior seasonality, we expect the quarter-over-quarter revenue and billings growth for Q3 '23 to be in line with last year. Also, we expect operating income in Q3 to be roughly flat with our Q2 levels. To wrap up, we are confident in our strategy and wouldn't trade our position with any other cybersecurity company. At the same time, we're focused on taking steps to accelerate our profitability as I guided. In fact, that accelerated growth year-over-year. Look, Saket, as I mentioned, we are seeing customers spend more time trying to understand what they're spending money on. There's more questions, the CFOs are getting involved. We noticed that early in the quarter, so we accelerated our efforts in trying to get those deals in front of those CFOs much faster than earlier in the quarter as opposed to waiting towards the end. In certain cases, customers came back and said, I'd like this now. At any point in time, our pipeline, as you would expect, is larger than what we expect to deliver in that quarter. And what we have done is, because of that behavior, we have increased scrutiny internally, we've increased efforts with our sales teams to get ahead of this and we're just increasing the activity of execution. Get work coverage, get more focus on getting deals done, get them across the line. All that is happening is that people are pushing out some of their products, means you just need to get more active with our customer base to make sure we get more business into our pipeline. Nikesh, I wanted to talk a little bit about supply chain security and Cider. I think a few months ago, there was an executive order from the Biden administration around securing software supply chains. I know it's early days in the acquisition, the acquisition is not even dry yet, but -- what do you feel about sort of the pipeline, the opportunity the Palo Alto Networks being now the largest cybersecurity vendor for the U.S. federal government? Let me comment, and then I'm going to let our birthday boy, Lee Klarich speak to this, because we've got to give him work to do. As you know, Prisma Cloud continues to go from strength-to-strength. We see very large deals in the hopper in our pipeline, and we're beginning to see more and more seriousness on cloud security from our customers. As I've always maintained, I don't believe all the cloud security products have been created. As we're talking to them, we're realizing they have some legacy, some new apps tech vendors in place, which they're deploying and they're trying to use that to take care of supply chain security. Anyone who is developing and deploying applications into public cloud, which today is basically everybody has a supply chain risk that they're dealing with. That supply chain risk can come in the form of software, in the form of open source software that they're building into their applications, which brings a certain type of supply chain risk. That is the second form of supply chain risk and sometimes referred to as CICD pipeline risk, and that is a key component of what cider will add to the broader capabilities we have with Prisma Cloud. Nikesh, I wanted to circle back on your comments about the using supply chain and expectations for hardware growth to be above long-term trend this year. And just relatedly, when we look at product gross margin, it still seems to be under pressure. But that notwithstanding, but I've always maintained the underlying hardware growth in the industry is about 5% to 8%. We've seen changed behavior, people have tried to order ahead because of supply chain constraints. What has happened in the last, I'd say, 4 to 6 months, slowly and steadily, we are seeing easing of some elements of supply chain. So you're already going to see easing in various certain amount of components, which is allowing us to ship product faster. At the same time, some, I'd say, real and perhaps some artificial supply chain constraints are being maintained in the industry. I expect them to ease over time, which should also ease up somewhat pressure on gross margin. I think the supply chain easing is happening as we speak, and we should be out of it in the 6 to 9 month time frame at the far end 12. One of the key metrics that stood out to us, I guess, was the next-gen ARR growth, particularly your net new ARR growth. So I would say, look, we feel very good about all the elements of our NGS ARR. Like just to repeat, we've got SASE, we've got Cortex. There are portions of deals we don't comment on deals like specifically, but if they have the appropriate products, then we contribute the appropriate amount of ARR on them. Yes, to your direct question, yes, the expanse deal is in the net new ARR that you've seen. And what is interesting is not only our customers are beginning to see increased engagement with GSIs, so global system integrators. So I'm not going to name any one of them, but I'd say more engagement gains across the board with the SI community as well as our direct customers. In terms of your question, are we seeing engagement from existing customers and net new customers is both there are existing customers who are stepping up and they are on a path to do their transformations, whether they're adopting the cloud. They'll do cloud transformations, they'll do network transformation, they will do soft transformations. And to be honest, we never had a portfolio until about 2.5 years would actually had those conversations. So what's beginning to happen is we are really building a new muscle as a company, where we are able to engage with CIOs and CSOs. So you've got Amit flying in one direction,  from Europe flying in the other direction. So across all of these people, we're having a lot more engagement across customers. And these are long-term plays, but the good news is we show you that a few of these always land in the quarter, so we get a large 8-figure deals in a quarter. As I said on the margin, there's scrutiny because people are saying, wait, this is a big deal, can we parse it out and adapt it to our budget. We do expect the activity to get more in that direction because you can see the Fed continuing to be on this mission to go steam growth, and we expect that's going to cause more customers to pay attention. But let's not -- now as I said in my remarks, there are some industries which are making money hand over fist, talk to oil and gas. And financials, they're making more money, believe it or not. So take that aside, we take the rest of it -- some of our budgets in place. So the conversation happens between us or our third-party vendors, they're able to go make this happen. I don't know, Dipak, if you want to comment on the deferred billing and deferred revenue comment. I would say, Fatima, I think Nikesh explained it excellently. And I would just say everything is included in our guidance, like in terms of what we think. Couple of the flip side, as we've said, we have $5.9 billion in cash. Last quarter, Nikesh, I believe that when you talked about your billings guide, you also commented that you could achieve that billings guide with no reduction in product backlog. And whether you still assume backlog, product backlog, I think, is what you said, flat into the end of the year in order to make the numbers that you've got. As I have said and as Dipak has said, because of supply chain constraints having eased a bit, we have been able to ship product to our customers much faster, which has a positive impact on attached services that we're able to ship them. But remember, our billings grew at 27%. And as we've said in the past, backlog in the overall scheme of things is not as substantial as you might think. Jonathan, that's a great question, because I'll tell you what, I was positively surprised by the reaction of customers wanting to engage in an XSIAM conversation, both directly, as well as many of the system integration partners who are there. Yet, none of them actually had a solution base presented to them for a long period of time. In 3 months, all of them say, we don't want to be a design partner, we'd like to start using the product on a commercial basis. So we accelerated our general availability of the product because we had to make sure it's available for those 9 customers, and all of them turn to customers. Now our sales teams are trying -- are aggressively trying to go out there and pitch it, and we actually have to maintain a wait list to make sure we won't need implementation resources to be able to implement. You're ripping out a data ingestion lake, you're ripping out their existing SIM, yet they have to keep running their SoC in a way that we can transform that. Four years ago, when we embarked on this journey, we decided we're going to build a cloud security business, we're going to build a Cortex business, we're going to build a SASE business. As I said, all 3 businesses are on track to be $1 billion businesses. Nikesh, you had talked last quarter about extending Prisma Access, Prisma SASE to the entire sales force and really becoming a SASE-first sales organization. Well, we said that, and we are in the midst of that transition, we have trained all of our salespeople to become SASE first. At the same time, and as I said, we've hired 550 direct salespeople in the first quarter because we want to increase the coverage. At the same time, we've been able to do that without having to create a specialist sales force on top of that. So you can see, we also said in our prepared remarks, we are accelerating our path to more profitability because we believe we are going to get those efficiencies we anticipated by making a SASE-first field force. But also doing some other things to drive more and more efficiency across the organization, not just in sales. So we feel pretty comfortable that not only will we get sales productivity, but we also believe we'll get overall productivity in the organization so we can accelerate our operating margin aspirations ahead of our 3-year plan, we'd shared about near than a quarter ago. So really strong NGS ARR quarter, guys. And perhaps, and I think it sounds like maybe because of the macro backdrop, some of the stuff you talked about, Nikesh. So John, one of the things I've said in the past in talking about product refresh, as it pertains to the new models that we release is these refreshes typically play out over a fairly long period of time. These decisions take place over 1, 2, 3-plus years of refinements. Well, it actually affected the results the last time you did it in 2017 for about 2 years. The only thing I am seeing this time - we've seen a lot of extraneous factors which have muted the outcomes for the industry, with the supply chain crisis, with the pandemic, with the Poland supply chain. Now with the Fed increasing interest rates, I'll tell you, one of the easiest decisions for our customers to make is to sweat their assets a little longer. So if you add all to the miss, that's why we went through this whole cybersecurity transformation of the company. It's Patrick on for Josh. It's Patrick on for Josh. Over the last several second quarters, the sequential billings guides have been in the 9% to 10% range. Maybe just on a topic we haven't heard today on OT cybersecurity, that's an area that we're just picking up more in our checks is seeing some more focus. Yes, we've been very focused on making sure that we make IoT capability available as part of our integrated portfolio. And there's OT environments that are still running Windows 95, Windows NT, for those who have been around for a while. But what's been happening over the last couple of years is OT networks are increasingly being digitized, specific parts of them are having to be connected to the cloud, which also means the OT and the IoT are starting to merge together a little bit more. And so as that happens, there's a greater interest in thinking about what the next generation of security for an OT environment looks like. But layer on top of that, the IoT OT security capabilities designed to secure that transformation is starting to pay dividends. I still think this is early days in transformation, but there definitely is a strong interest in these types of organizations. And as Nikesh mentioned earlier, many of these are oil and gas utilities and others that actually are seeing some of the benefits of some of the recent macro environments. Next, we've got Rob Owens of Piper Sandler with Matt Hedberg to follow up. Could you drill down a little bit in terms of Fed and what you saw in period, obviously calling out a couple of large deals. But if I rewind, the thought process was that Fed was going to get more linear and less budget flushed typical to the September quarter. We've been working the deal, which we announced for a very long time, as you can imagine. But we're beginning to see the Fed activity get stronger because we're at that point in time with this administration where they've gotten their stuff together across the various agencies, and they've actually started executing against the strategy. So we think, yes, the Fed spend will continue to stay strong and we continue to get linear as time passes, as we get through the rest of this administration's term. It's always dicey in the first year or first 1.5 years because it's a whole new set of characters, especially if you change institutions where they're still trying to figure out what they want to endorse and what they don't want to. Obviously, your pricing U.S. dollars -- but I'm wondering, in international markets, obviously, there's been a huge currency movement. I know historically, partners would absorb a lot of that price movement. So I think, look, there's always going to be the isolated instances where it comes up in discussion. But for the most part, our sales reps will try to manage that through different tools that they have available to them and then that's pretty much it. I think, Matt, that's a fair question in addition to what Dipak said. There have customers who come back and said, look, the currency has moved a lot. But at the same time, like you said, some of them get absorbed by the channel, some of them will get absorbed by the customer, some get absorbed by us. I think it's kind of interesting, all of our SASE deals, I think like-for-like are much larger than our firewalls deals even with the same customer. And they can range from 2x to 3x, and sometimes even up to 5x, depending on the comprehensiveness of the requirement and the customers' desire to deploy. We were not a player, as you know, 2.5 years ago in that space. So either the deal gets won or lost, but we're in every one of them, and they're typically large sizes. And the economics are better than the security posture is better for the customer, because imagine, if I sell 500 firewalls, it takes customers a serious amount of time to go deploy them, and every time I give a software upgrade to customers to go drive a truck and upgrade all those firewalls because they want to sandbox the upgrade, which leaves them exposed from a security perspective. And SASE, I can -- I actually -- we actually do the upgrades, and we can get the entire customer base upgrade in this matter two weeks. In some cases, we just announced  11.0, and we still have a lot of customers who have not upgraded to 10.2, right? So look, the economics of SASE are phenomenal from a deal size perspective as well as from -- they're pretty consistent from a margin perspective. So I think there's still, as I've said in the past, is an $8 billion to $10 billion SASE market out there, and that space is growing in double digits as an opportunity. And with that, we'll conclude the Q&A portion of our call, and I'll turn it back over to Nikesh for his closing remarks. I also want to thank our customers, partners and employees around the world for helping us deliver these great results in such a tough environment."
}