{
    "symbol": "ATTO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-16 13:26:03",
    "content": " As a result, we've seen an improvement of 10.3% growth year on year after record Q2, respect to finish Q4 with sales in excess of 60 million total annual value, placing us in a much better position to start 2023. And we had the main impact at Q3 compared to last year was on Brazil, where we had a lot of lingering effects in terms of volume as we mentioned that we had some volume reduction from clients that had a share of wallet with Atento, very big, In a way, when they get back, part of the volumes did not return and also the economic scenario, which is driving volumes down. So looking more details in Brazil, volumes or revenue are down by 8%, out of that 6% in which sector -- and in that 6%, we do have part that relates to the cyber-attack volumes related to the cyber that didn't return, and also some price reduction targets that we received throughout the last quarter that was below our minimum profitability that we could do. But again, as I mentioned, the expectation is that the positive free cash flow of Q4 will make us back to the range of a $100 million and that's our expectation to close the year. So, for example, when I mentioned that we feel very positive about the start of 2023 because of the sales in Q4, for us it's very important the sales we have in Q4 and Q1 because those are the sales that start producing revenue earlier in the year and have an impact throughout the year. From that perspective, all the sales that we have Q3 -- particularly Q4, are going to have the biggest impact in terms of increase of revenue during the -- in this case 2023, the next year. This year we have 20%, but we've seen 12% in Q2, 20% in Q3 and we expect already just with the sales that we have closed and weâ\u0080\u0099re closing a higher than in the 20s for Q4, which indicates that if there was a decrease year-on-year, it's clearly increasing quarter-to-quarter. So we've taken a lot of pain this year to make sure that we have a good cost structure, a good -- we accelerate efficiencies and that's the best way you can prepare for uncertainty and potentially also complicated year in the markets. And quite frankly, I think we've seen -- its always tricky with sales because whether you close a contract on January or December, it makes no difference in terms of the revenue for the year, but it makes a difference in terms of the numbers for Q4. We are using forward rates, which again, looking at the scenario for Brazil and the inflationary that probably we're going to see probably half of -- or something ranging half of last year, there may be a scenario where later this year, the interest rates go further down so benefit us 24 onwards."
}