{
    "symbol": "PESI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 21:14:09",
    "content": " And despite these challenges, please report we achieved a 20.5% increase in revenue from $19.5 million for the second quarter of '22 versus $16.1 million for the same period last year. As a result, revenue increased approximately 31% to $11.1 million in the second quarter of '22 versus the same period last year. From our continuing operations in the second quarter, as you said, was $19.5 million compared to last year's second quarter of $16.1 million, an increase of $3.4 million or 20.5%. The revenue improvement came from both our operating segments as treatment was up $687,000, primarily based on increased volume, while the Service segment increased by $2.6 million, primarily from increased project work on 2 large contracts that had not started at this time last year. However, of note, the second quarter of 2021 included a gain on the extinguishment of debt related to our -- to the company's PPP loan totaling $5.4 million, which was forgiven in June of 2021. Our adjusted EBITDA from continuing operations for the quarter, as defined in this morning's press release was a loss of $403,000 compared to a loss of $1.7 million last year. So yes, one could certainly say there's $17 million available for support for treatment of the TSCR waste at this time. And my question is, is there any chance that the government has really sort of adopting a new strategy that would, sort of, leave a steady run rate of treatment revenues, say, just either side of $10 million a quarter, that it never really ramps up, excluding Hanford, obviously, which will be a big boost of ego. I mean just the base revenues seem to run down in that $8 million, $9 million range sort of best case recently, maybe you get up to $10 million, but it's just a feeling that that thing just doesn't move. It's certainly, as we said, at $9.5 million in sales receipts last quarter, we're starting to see, as I mentioned, the last several quarters, our RFPs that we're getting for waste treatment continue to keep the same trajectory and they're going up every quarter and that we had a really good June overall in our fees and receipts. The ships decommissioning is not -- as far as the other -- I mentioned before and there's a GAO report that came out just 48 ships to be decommissioned in the next 48 months or something like -- I think there's numbers about 25% of those were nuclear -- right now, there's no -- there's limited movement on what those ships are, which ones they are and how they're going to be procured. I think, I addressed the specific number on last call, but it continues to go up and the value of those bids is going up as well and -- which has resulted in what I just mentioned, the $9.5 million receipts last quarter. As far as -- it's very, very difficult to track and define RFPs that are coming up on the waste treatment side because they're typically a very quick request for quotes that you provide and you always know what's coming until they've already generated it. And again, that's about 2 quarter's projection, so $500 million over the next 2 -- maybe 2 to 3 quarters that we expect to come out."
}