{
    "symbol": "PESI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 11:41:04",
    "content": " On the call with us this morning are Mark Duff, President and CEO; Dr. Lou Centofanti, Executive Vice President of Strategic Initiatives; and Ben Naccarato, Chief Financial Officer. The company issued a press release this morning containing third quarter 2022 financial results, which is also posted on the companyâ\u0080\u0099s website. If you have any questions after the call or would like any additional information about the company, please contact Crescendo Communications at 212-671-1020. All statements on this conference call other than a statement of historical fact are forward-looking statements that are subject to known and unknown risks, uncertainties and other factors, which could cause actual results and performance of the company to differ materially from such statements. The company makes no commitment to disclose any revisions to forward-looking statements or any facts, events or circumstances after the date hereof that bear upon forward-looking statements. Specifically, we continue to realize improvements in our performance as the pandemic impacts continue to subside, which was evidenced by our results over the last two quarters. In addition to our revenue growth, gross profits increased by 38% and gross margins increased from 14% to 17%. Turning first to our Services segment, we reached full operational status on several projects that have been delayed due to the impacts from the pandemic, which contributed to our revenue growth within our segment â\u0080\u0093 our Services segment in the third quarter of â\u0080\u009822. As we stated previously, the federal government agencies, including DoE, DoD and EPA have been slow to procure new task orders due to the pandemic. As a result, we realized an increase in procurements in September of â\u0080\u009822, which we believe will continue in the fourth quarter of â\u0080\u009822. And moreover, we are encouraged by the bidding pipeline with many of these contracts expected to be awarded over the next few quarters. Specifically, we have over $100 million in defined opportunities targeted to be released in the next few quarters that directly align with our core competencies. And this is on top of the $39 million in funded nuclear services contracts already in place, which bodes well for the balance of this year and the following year. Turning to our Treatment segment, our revenue remained stable despite delays in waste shipments from certain customers at our Florida facility due to Hurricane Ian, 15% in the third quarter of â\u0080\u009822. In addition, we are seeing improvement in all our waste receipts overall, including our new clients in both the commercial and international waste markets, which has increased 46% overall to $9.1 million. In addition, our waste treatment backlog is approximately $7.1 million. More RFPs received for bidding within the waste treatment segment, with over 80 bids requested â\u0080\u0093 excuse me, for over â\u0080\u0093 we received over 80 bid requests in the third quarter of â\u0080\u009822 alone compared to 60 in the first quarter of â\u0080\u009822 this past year. This is a result of our efforts to broaden our client base in the commercial utilities, the oil and gas industry as well as other industrial markets. Weâ\u0080\u0099re now starting to see strong demand for this system and services with receipts from several new clients, including government and commercial clients within the oil and gas industries. At the same time, we remain highly encouraged by the outlook of the Test Bed Initiative, or TBI, also known as the low level waste offsite disposal project, in support of the DoE Hanford tank disposition mission. The TBI initiative, which is based on grouting technology, will continue to be a focus of Perma-Fix moving forward as a means of saving tens of billions of dollars in taxpayer dollars as well as eliminating significant carbon emissions and reducing the schedules for Hanford cleanup actions. Grouting has been recognized as a preferred supplement to the DoE strategy which is currently based on vitrification of tank waste at Hanford through their new facility called the Direct Feed Low Activity Waste Treatment Plant, or DFLAW, which continues to experience delays in its startup. Our TBI program continues to move forward, albeit much slower than anticipated, despite continued pressure on DoE from the U.S. General Accounting Office, GAO, to make progress. As stated in the GAO report recently published, the near-term reduction of the tank waste inventory through grouting could accelerate tank closures and save the government tens of billions of dollars while reducing the risk to the environment. Moreover, the National Academy of Sciences continues to request the DoE to expedite initiatives for grouting as well. As it stands now, DoE stated in a September industry conference in D.C. that their intention is to submit the RD&D permit to the state, is currently planned within the next 6 months of this government fiscal year or by the end of our first quarter. This submittal will trigger review and approval by the state of Washington and support shipment of the 2,000 gallons as well. Also, we have seen a continued support by Congress, including a bill recently introduced by Senators Paul and Hassan in September of this year to push DoE into making progress on grouting, and specifically the off-site, low-level waste disposal program. Perma-Fix maintains these grouting capabilities today at our Perma-Fix Northwest facility, which is in Richmond, Washington right near Hanford and is permitted and outfitted to safely and compliantly treat up to 30,000 gallons per month with the ability to expand to well over 1 million gallons annually while dramatically reducing the cost compared to vitrification. In addition to the TBI initiative, our teams continue to work very hard on securing transformative opportunities and wins that could lift Perma-Fix to a new level of revenue and income. We are well positioned for several additional upcoming procurements and initiatives as well, with the U.S. Army Corp of Engineers, as well as the U.S. Navy ship decommissioning program at several other DoE sites that are going to be procured in the next few quarters. Turning back to our financials for a moment, adjusted EBITDA improved to a loss of $374,000 compared to a loss of $798,000 in Q3 of â\u0080\u009821 last year. To further enhance our competitive position in the market, we have made several adjustments to our budgets for the next year to trim general and administrative costs and to lower our overall indirect costs. Overall, weâ\u0080\u0099ve witnessed a solid year-over-year revenue growth and saw a meaningful improvement in gross margins based on current backlog and our identified opportunities over the next several quarters that we basically remain optimistic that we can achieve these growth goals and stability that weâ\u0080\u0099ve realized prior to the pandemic. And as we continue to increase revenues, we expect to benefit from the predicted cash flows within our Services segment and high incremental margins within our Treatment segment. As a result, we believe weâ\u0080\u0099re well positioned for the balance of â\u0080\u009822, and we believe we are sufficiently capitalized to execute our business strategy in order to achieve profitability and positive cash flow in â\u0080\u009823. We believe this foundation, coupled with expansion of our treatment capabilities, increased bidding opportunities and improved federal budgets, will continue to support our ambitious growth objectives. The revenue improvement came from the Services segment, with our 2 large projects finally being fully operational. At this time last year, they were just beginning to ramp up. In the Treatment segment, revenue was flat to the prior year. However, last yearâ\u0080\u0099s third quarter included a onetime request for equitable adjustment or REA, totaling $1.3 million. When you exclude that, it provides for a $1.3 million increase year-over-year in the Treatment segment as well. So we saw growth there as well, year-to-date, through September 30, revenues below prior year by $1.2 million or 2.2%. This drop in revenue comes from the Services segment, as revenue was down $1.9 million versus last year. This improvement came â\u0080\u0093 this improvement, which totals about $846,000, came from $1.4 million improvement in the Services segment, resulting from both increased revenue and increased profitability on the projects compared to last year. However, if you exclude the impact of the REA I mentioned earlier, Treatment segmentâ\u0080\u0099s gross profit improved year-over-year by about $766,000. For 9 months ended September 30, gross profit was $7.6 million compared to $5.5 million last year. As with the quarter, this increase came from the Services segment, with improved margin from projects offset slightly by lower gross profit in the Treatment segment, and again, due to the impact of the REA. As with the quarter, if you exclude the REA, Treatment segment showed an improvement of about $609,000. This increase of $581,000 relates primarily to increased payroll, travel, audit fees and stock compensation. For the 9 months ended September 30, SG&A expenses were at $11 million compared to $9.6 million in the prior year. Our net income attributable to common shareholders for the quarter was $664,000 compared to last yearâ\u0080\u0099s net income of $1.4 million. Included in this yearâ\u0080\u0099s net income is the employee retention credit Mark mentioned earlier, of $2 million. Our adjusted EBITDA from continuing operations for the quarter, as defined in this morningâ\u0080\u0099s press release, was a loss of $374,000 compared to a loss last year of $798,000. Turning to the balance sheet, our cash on the balance sheet was $1.9 million compared to $4.4 million at year-end, reflecting the current yearâ\u0080\u0099s losses, capital spending and debt maintenance. Our waste backlog at the end of September was $7.1 million, which is consistent with $7.1 million at the end of the year and $7.1 million in September of 2021. Our total debt at quarter end was $1.3 million, excluding debt issuance costs, which is primarily owed to PNC Bank. Next, Iâ\u0080\u0099ll summarize our cash flow activity for the year. Our cash used by continuing operations is $334,000. Our cash used by disc ops was $559,000. Cash used for investing of continuing operations was $922,000 and thatâ\u0080\u0099s primarily capital spending. And finally, cash used for financing was $694,000, representing our monthly payments on the term loan and capital line of $375,000 and payments related to finance lease liabilities and other debt of $297,000. Yes, what you are referring to â\u0080\u0093 well, good morning, Howard, itâ\u0080\u0099s good to hear from you. We submitted, I want to say in Q2, and we were told when we submitted that it was going to be a rapid turn on announcement and startup, it was a fully funded project and we have heard nothing from the EPA. So there is no indication plus or minus or anything about that whole procurement, but we are â\u0080\u0093 itâ\u0080\u0099s not canceled, itâ\u0080\u0099s still happening, itâ\u0080\u0099s just stuck in the procurement process, Iâ\u0080\u0099m afraid. The Enterprise, which most people have heard of, is a large aircraft carrier that they are going to have commercially decommissioned. We are meeting with team members right now in great detail and we are anticipating a draft RFP sometime in the early summer, probably a request for information maybe between now and then and then a final RFP within about a year. But as you know, we are in this business in a big way, doing one of the few current radioactive or radiologically contaminated ship decommissioning projects right now at Norfolk. So as I mentioned, I think, on a few calls ago, the Navy had announced in a report, I believe it was a GAO report actually that they have 48 ships coming out for decommissioning in the next 4 or 5 years. So I wish I had more detail for you, but I think the Navy is still working through the priorities on which ship is going to come out next. In talking to DoE and also in a recent conference I referred to a few minutes ago in September, DoE said that they are shooting to have it done by the end of the year, but they â\u0080\u0093 it maybe close. We are optimistic that based on the GAO push as well as the Natural Academy of Sciences push, and as I mentioned in the notes, recently a Congressional push with the senators drafting a bill to push it, that eventually DoE is going to make it a priority to supplement the DFLAW facility with a grouting program. And hopefully, DoE will be shipping the TBI waste and then following that quickly on an operational mode to start closing tanks. Well, for discussion purposes, letâ\u0080\u0099s assume the contract is let out the first quarter. So it depends on when you get your debrief, I think thatâ\u0080\u0099s how that works, but I am certainly not an expert on that part. So, one could assume that it would be several months before transition could be started, if there is no protest. One could assume that if itâ\u0080\u0099s awarded around the first of the year that whoever wins would start generating revenue in probably the June timeframe, maybe May, in regards to transition. However, I believe itâ\u0080\u0099s a 120-day transition, and then you are full bore after that. So, probably Q3, you would really be seeing the revenue for the winning team, if there is no protest. Let me just â\u0080\u0093 if I could, Howard, let me just expand on ITDC a little bit. I did want our investors to know that our growth plans, our infrastructure, our budgets and expectations are all â\u0080\u0093 have all been developed irrespective of that award for the tanks. While that award would obviously be extremely transformative to us, if we are not awarded that, we do have our plan set up assuming we havenâ\u0080\u0099t. So, we are hopeful that irrespective of that win, we are going to be seeing the growth that we saw prior to the pandemic. And â\u0080\u0093 but I just wanted folks to know that we are well positioned if we donâ\u0080\u0099t, to continue with that growth strategy, and we are making every effort to make that happen as well. Assuming your team loses, is there not a significant number of pieces of the business that you will get over time, even if your team loses as aâ\u0080¦\n Thatâ\u0080\u0099s exactly right, Howard. Specifically, for example, the DFLAW facility, which is â\u0080\u0093 which will be operated by this contractor. And it will generate, when itâ\u0080\u0099s full capacity, several million gallons of waste a year â\u0080\u0093 different types of waste. However, itâ\u0080\u0099s low-level wastewater, and thatâ\u0080\u0099s what we do there just off-site. So, one could speculate we would be treating that waste, and there will be other waste as well from ITDC that we anticipate to be treating and have discussed those opportunities with the incumbent contractor now. So, yes, to answer your question, we expect a significant amount of work from that operations as well as the other operations that are ongoing for the incumbent tank contractor or whoever wins the new one, irrespective of whether we are awarded or not. When you talk about â\u0080\u0093 obviously, the tank project, Hanford, is a huge opportunity for the company. But I would like to come back to that in a moment, and before that, talk about the various others scale-wise. For example, we have just submitted a bid in Italy that will be between $40 million and $50 million â\u0080\u0093 between â\u0082¬40 and â\u0082¬50 million over a 7-year period. We are waiting to hear on that, which should be announced in the next several months and will provide good solid backlog with good margins and really leverage our plants here in the U.S. as well as potentially as we mentioned before, with Westinghouse in the UK and open some markets in Europe as well, that will come directly from that. We have the Enterprise I mentioned, which I am just speculating, Ross, but that would probably be about a $100 million type of opportunity for us out of that $1 billion, and a very sustainable workload. As EIS says, they expect the Enterprise to be decommissioned from 2025 to 2029. So, basically 4 years or 5 years beginning in â\u0080\u009825, so, that process is going, and they are moving forward with that, and thatâ\u0080\u0099s just be something that will be awarded in the near-term. The other bid we put in for â\u0080\u0093 as I referred to is OSMS, thatâ\u0080\u0099s also an ongoing procurement, so we canâ\u0080\u0099t provide any details. But we are providing a significant waste management solution to that, and that would add almost as much revenue as the tank closure would. And that one is, as I mentioned, ongoing in procurement right now, but should be awarded next summer or next Q3 timeframe. So, we have about half a dozen other jobs that we are putting together right now in the $10 million to $20 million range. We are making inroads on the commercial decommissioning side as well, which is a big opening market for us, which is just beginning to start. So, I canâ\u0080\u0099t speculate on what the values might look like in the next several quarters, but a lot of other opportunities that are coming along. So, a lot of other good jobs coming that are directly aligned with radiological waste management, which there is not a lot of players involved in that, so we should win our share of those. When you are looking at things like the Enterprise or you are looking â\u0080\u0093 I mean in Hanford, you are one of two. And also, do you think the Navy â\u0080\u0093 I mean they have got a lot of ships sitting around at this stage. They have decommissioned a fair number of ships, as you mentioned before, including nuclear ships. Right now, the GAO report had defined about a dozen ships in the next 5 years, 48 months I think it was, and that was written a year ago, I think it was. The Sam Rayburn is coming, I think itâ\u0080\u0099s a sub, and there is a couple of other that they have mentioned are in the queue, but just arenâ\u0080\u0099t procured yet. But to answer your question specifically, there is two other primary firms, they have done the two other ships that have been procured that are in this space. However, firms that have done nuclear decommissioning in the past will be entering the market. There is a number of what they call ship breakers that are in this market, who do non-radiological ships for most of the time and scrap them. They have done a number of aircraft carriers in the past down in Texas, and those ship breakers have done the ships for a dollar each and made good money off the scrap. However, to answer your question specifically, there is a lot to a radiological ship in regards to how you do it, in decontamination, nuclear waste, radiological considerations, training and all kinds of other things, and facilities that might be required as well. So, to answer your question, in this total speculation, Ross, we donâ\u0080\u0099t know since we havenâ\u0080\u0099t been through â\u0080\u0093 no one has been through this big procurement like this yet, but we would anticipate three to five teams putting bids together on this. It will be â\u0080\u0093 itâ\u0080\u0099s anticipated, Ross, to be a fixed-price task, and so not everyone is going to have the stomach for a $1 billion fixed price decommissioning project. So, I am sure that will limit the folks as well, and everyone is going to want to dampen the risk overall. Typically, it doesnâ\u0080\u0099t work to be on multiple teams, particularly if you have an innovation or a skilled workforce and a project description like we do in this situation, where you are so intimately involved in the development of the bid and there is so much proprietary information relative to costing and technical approaches and that type of thing, that it is very â\u0080\u0093 I wonâ\u0080\u0099t say never, but very seldom we see someone be â\u0080\u009cnon-exclusive.â\u0080\u009d And so I would not anticipate that to be the situation. And I donâ\u0080\u0099t know if itâ\u0080\u0099s a COVID issue or a priority issue within DoD, but I think once it gets rolling, then you will start to see them moving ships out for commercial decommissioning quickly, so, yes, to answer your question. So, thatâ\u0080\u0099s why itâ\u0080\u0099s opened it up to us so much, is to have our capabilities over here thatâ\u0080\u0099s permitted. So, as reactors are coming offline, as cleanup initiatives start moving forward, that we are starting to see that grow. And this year I think we will close the books probably around $2 million in international shipments, but thatâ\u0080\u0099s going up significantly for next year, particularly if we win that other job. So, itâ\u0080\u0099s really starting to move based on where Europe is in their cleanup process, which is way, way behind the U.S., probably 20 years behind the U.S., maybe 25 years. Listening to all of this talk, I am really struck by the fact that you are talking about a lot of long-term programs, a lot of 4-year, 5-year type programs. Programs that are going to roll to be decades or longer, quite honestly, obviously, Hanford has the potential to be almost a perpetuity-type scenario. And one reason is, DoE is demonstrating â\u0080\u0093 this is just my opinion, is that they are spreading some of the wealth around as far as their awards. If you look at the awards that have been made and the players that are involved, I think DoE sees itâ\u0080\u0099s important to ensure there is a number of competitors. I think DoE wants to maintain that, and obviously DoE doesnâ\u0080\u0099t have any control over the overall market in regards to M&A and that type of thing. But as long as they keep spreading it around here and there, I think that there will be four or five big players, I mean maybe six that are well positioned to play in the market and maintain the bench that you need to have to win these big jobs. Well, we canâ\u0080\u0099t talk about that specifically, but we are always for sale. If you look at our â\u0080\u009819 and â\u0080\u009820 numbers, we grew by 50% revenue a year for 2 years, and we were looking really good for the remaining years and then COVID â\u0080\u0093 COVID had a big impact on us. We are expecting â\u0080\u009823 to look a lot better and to get back on that track, and then I think we will be more attractive. Certainly, itâ\u0080\u0099s no secret that a $100 million market cap company has a difficult time with making the EBITDA you would have relative to being larger or being private or being a bolt-on to somebody else. And it does seem â\u0080\u0093 first, anyone who knows me knows I take no comments as confirmed yeses unless otherwise denied. You guys are doing a great job, and I think we are kind of sitting here with a market that is focused, kind of itâ\u0080\u0099s staring at its toes and not looking out very far, but it strikes me as that if you look out much on the horizon at all, six months, nine months, you are going to see a totally different company than you see today. Keep up the doing, you have done a great job opening up opportunities that werenâ\u0080\u0099t there before, and it looks like pretty much you should be able to do nicely, given the setup I see. Well, we look at our last couple of quarters, Bill, and in regards to services, we have submitted â\u0080\u0093 I donâ\u0080\u0099t have the numbers in front of me â\u0080\u0093 dozens of proposals. And there is a few that we submitted that were not necessarily radiological waste, for example, just decommissioning job or demo jobs that were not squarely in our core competencies. I wanted to say, we have almost $400 million in bids that we have submitted in the last year. And I would say, itâ\u0080\u0099s probably about 100 â\u0080\u0093 I am estimating, $100 million in projects in our core competencies that have not been awarded, and thatâ\u0080\u0099s whatâ\u0080\u0099s been difficult. We havenâ\u0080\u0099t won or lost projects in Q3, and â\u0080\u0093 with the exception of those MATOCs I mentioned. Well, so possibly, there could be tremendous upside here if, in fact, these contracts are ever let. So, Ben you also alluded to cutting costs and your focus on profitability, EBITDA and all that good stuff. Well, we â\u0080\u0093 I donâ\u0080\u0099t know how much we should get into. We are going to be careful because there is a competitiveâ\u0080¦\n Well, letâ\u0080\u0099s put it this way. So, roughly for the quarter, you did â\u0080\u0093 we did $9 million in service and we did $9 million in treatment, roughly, round numbers. So, $100 million is our sweet spot. But to answer your question, in reductions of SG&A reductions, we have a very well-defined plan. Let me just say, itâ\u0080\u0099s to reduce several million dollars in SG&A costs through 2030. And that will put us in a position where even if we donâ\u0080\u0099t grow, Bill, to $100 million, that we will see our EBITDA get quickly into the positive range. Well, our goal is to make sure we are there by the end of the year, which is $25 million a quarter by the end of â\u0080\u009823. So, with that â\u0080\u0093 but again, to answer your question, it depends on the award â\u0080\u0093 to your first question, and itâ\u0080\u0099s when they are going to start awarding these bids. With $39 million in backlog, which will pretty much run through the year, then we need $20 million in awards there for revenue in â\u0080\u009822, which if we can just win our share and they make the announcements, we should be there. Well, congratulations on a movement in the right direction, and certainly all shareholders are anxious to see sustained profitability. We appreciate the continued support of our shareholders, and we look forward to further updates and developments as they unfold to the next quarter."
}