{
    "symbol": "MOH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 11:55:26",
    "content": " During our call, we will be making certain forward-looking statements, including, but not limited to, statements regarding our 2023 guidance, our projected 2024 outlook and revenue, our recent RFP awards, recent and future RFP submissions, including those in Indiana, New Mexico and Florida, our acquisitions and M&A activity, Medicaid lease terminations, our long term growth strategy and our embedded earnings power and margins. Our financial results for the fourth quarter and full year 2022, our initial 2023 revenue and earnings guidance, our growth initiatives and our strategy for sustaining profitable growth, and our outlook on premium revenue for 2024, given our new business successes in 2022. Last night, we reported fourth quarter adjusted earnings per diluted share of $4.10, representing 42% growth year-over-year. For the full year, we grew premium revenue by 15% to approximately $31 billion and grew adjusted earnings per share by 32% to $17.92. For the year, we grew membership by approximately 10% and premium revenue by 21%, driven by the inception of our Nevada Medicaid contract, recently closed acquisitions and organic growth. We expect all of these elements will combine to produce 2023 core earnings per share of at least $20.40, offset by $0.65 per share of one-time contract implementation costs, which results in our 2023 adjusted earnings per share guidance of at least $19.75. Our full year Marketplace MCR of 87.2% exceeded our long-term target range and includes approximately 120 basis points of net effective COVID, as well as approximately 130 basis points from the impact of a 2021 risk adjustment true-up recorded in the second quarter. Additional drivers of our strong fourth quarter and full year results include a 7.5% fourth quarter adjusted G&A ratio, which was in line with expected seasonal expenditures related to open enrollment and spending on community and charitable activities. Our 2023 premium revenue guidance is $32 billion, representing 4% growth from 2022 Our revenue guidance is comprised of several items, $1.2 billion for the full year impact of AgeWell and expected revenue from the My Choice Wisconsin acquisition when closed. Several offsetting items include: $600 million for the known pharmacy carve-outs, $500 million for the impact of the resumption of redeterminations beginning in April, $600 million for the lower Marketplace membership, and $300 million in 2022 pass-through revenue that we don't expect to recur in 2023. To this, we add $1.50 for the underlying organic growth plus several operating levers, including our real estate reduction strategy, the full year effect of our PBM contract and net investment income, partially offset by the negative impact of known pharmacy carve-outs. We're forecasting an 88.5% for the Medicaid business, which is right in the middle of the range, citing medical cost pressures due to any of the items like flu, COVID, RSV and then, of course, any pressure that might be experienced with an acuity shift knowing that a significant acuity shift will probably be absorbed by retroactive rate increases."
}