{
    "symbol": "MTG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 16:11:06",
    "content": " In the quarter, we earned $191 million of net income, an increase of 10% compared to the same period last year. As a result of the strength and flexibility of our capital position during the year, we not only deployed capital to support new business and grow our insurance in force, we also paid $800 million in dividends from MGIC to the holding company. We used our strong capital position to repurchase most of the remaining convertible junior debentures due in , repay MGIC's Federal Home Loan Bank advance and redeem our senior notes due in 2023, reducing our leverage ratio to approximately 12% in annual interest expense by $25 million. We also returned approximately $500 million of capital to our shareholders through a combination of repurchasing common stock and paying common stock dividends, including a 25% increase in the quarterly dividend beginning in the third quarter. Unrealized losses in the investment portfolio due to higher interest rates continue to be a headwind for book value per share, reducing book value per share by $1.39 at year-end, while unrealized gains on the investment portfolio added $0.47 per share last year. Our strong capital position entering 2022, combined with the exceptional financial results during the year, position us to reduce our debt outstanding by approximately $500 million, increased our quarterly shareholder dividend by 25%, reduced diluted shares by more than 10% and end the year with a stronger excess capital position relative to PMIERs than we started the year. So I think there could be challenges to that persistency, but not -- I don't see a lot in the -- especially in the very short term here because you're really talking about our portfolio in the back half of the year, which I said was -- is probably 10% of our overall in-force that might have some ability if rates drop down closer to 5% as an example, but not a lot of built-up equity at that point either."
}