{
    "symbol": "SFIX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-03-08 22:20:10",
    "content": " There were two factors that largely impacted gross adds: First, conversion of new visitors as for Fix and Freestyle is not where we want it to be; second, given changes in iOS 14, marketing channels that have historically been effective for us are presenting challenges and effectively targeting clients. Ultimately, we believe the efforts I’ve discussed, both around Fix and Freestyle will help drive improved new client conversions, and we will be prepared to ramp marketing spend when we get the client experience right. To your second question, one of the reasons why we’re not giving that EBITDA guidance for Q4 now is we have a reasonably healthy budget planned for marketing in Q3, as we mentioned, as improvement -- as conversion improves, we’ll spend more on marketing because it will be within the allowables that we have, and we’re also testing new marketing channels. I think both -- we mentioned in the call the higher average spending per client being up 25% year-on-year with our newer cohorts, participating in both Fix’s and Freestyle. What we’re seeing in terms of growth rate there is really a function of the new growth adds that are just lower than where we’d like them to be, given all the other part of the conversation here on both, improving the client experience, making it easier to enter both through stitchfix.com and then our new landing experience as well as efficacy of marketing channels. I think, the other side of that is just the AOVs, the average order values that we see in Freestyle are very strong and very healthy, and they’re not -- as Elizabeth mentioned, our return rates are relatively low versus normal in the industry, and that helps AOV net of returns. Given the conversion funnel improvements that we need to continue to make together with reductions in marketing spend, that really is the driver versus I think us hitting a saturation point of Fix’s. And if you don’t mind and if I’m still live, one quick follow-up question on -- one of the things that we had kind of heard all through is that you have a list of like a humongous number of people that have been Stitch Fix customers in the past that you could target with Freestyle. So Fix’s were about flat in terms of reactivations, but Freestyle was a whole new channel of being able to reactivate clients, which gives us a lot of optimism that that is an exciting way to bring clients back in. So, we see a lot of opportunity to be both differentiating on these areas of fit, discovery and relationships as well as providing great value to our clients in ways that are opening up to us through Freestyle that were harder to do via Fix’s. And while the performance-based channels have seen -- we’ve seen some challenges in those, we do feel like there are many other channels that we know will generate new actives, whether it’s in the Fix, into Fix plus Freestyle or in the Freestyle, and hopefully, into Fix and Freestyle, I mean, that’s really our goal here."
}