{
    "symbol": "SFIX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-20 21:06:04",
    "content": " Q4 net revenue declined 16% year-over-year to $482 million, driven by a 9% year-over-year decline in net active clients, which ended FY '22 at $3.8 million. And lastly, over the course of FY '22, we made improvements post the Freestyle launch to get conversion to a better place since its low point earlier in the year, and we're making further investments in the client on-boarding journey to drive conversion rates even higher. So, we're just incredibly focused this year on continuing to improve the customer experience, get on that positive net active track, which we do expect to turn the corner on net active clients sequentially over the course of -- at some point in FY '23 and just ensuring we have the stable foundation of profitability to build on beyond this year. The only thing I'd add on the active clients and RPAC, I did say in the earlier remarks that while net actives will be down for Q1, they'll be down less so than the Q3 to Q4 sequential change that we saw in FY22 and so as we get closer to adding net active clients, that will likely have the impact of bringing RPAC down simply because these newer clients aren't on our platform long enough to spend disproportionate to clients that are -- that have been here and spending on a regular cadence with us. And so our ability to immediately address if we didn't get it right through redoing their fixed experience or connecting them with a stylist, like that's actually a lot of what we're going to be focused on this year is bringing more of that stylist front and center and that active listening. So it's really a combination, I would say, of continuing to improve high-quality traffic sources, bringing back in clients that we can reactivate together with continued kind of continued gains in the conversion funnel, which we have gotten back to levels that we were at in the past, but we still see more upside by just making it more frictionless and seamless to enter. Yes, I mean, I think all of the things that we mentioned on the prepared remarks and some of what I've responded within the last few questions, just the initiatives and the progress we're making on continued improvement on onboarding, continued focus on bringing our signed up prospects reactivation, new traffic channels, inter experience. Over the course of the last eight months or so, we've been able to experiment with a couple of limited time offers where we're taking advantage of showing value to our Freestyle clients as well as testing and experimenting with inventory that's not moving as quickly. So areas of opportunity that we're very focused on -- are those signed up prospects who've already come and given their information, but not converted, increasing the penetration of those customers, we see as a big opportunity, reactivating prior clients where they know they found what they needed in the past that may be lapsed over time and bringing them back."
}