{
    "symbol": "LAD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 16:47:04",
    "content": " Over the past three years and since the launch of our 2025 plan, we have over doubled the size of our company from $12.7 billion in revenues and have nearly quadrupled EPS from $11.76 back in 2018 to $44.42 in 2022, driven by a team and a culture of high performance, a focus on customer optionality to attract and interact with customers, and investments in adjacencies to expand our profitability, we are well positioned for continued growth. During the year, 22% of our vehicles were sold to customers utilizing our omni-channel technology in our stores, Driveway and GreenCars, representing just $5 -- just shy of $5 billion in revenue. We are constructive on hitting penetration rates of 20% by 2025 as LAD moves towards achieving $50 billion in revenues, which as a reminder, should result in excess of $500 million of pre-tax income once DFC reaches a steady state portfolio and normalizes the vessel reserves. Same-store unit growth for new in the mid-to-low single digits and used in the high-single digits, as we navigate this transitory environment with supply and demand normalizing, new vehicle GPUs will continue to moderate, assuming a decline of about $200 per unit each month throughout 2023, this would average to a GPU of $3,800 and end the year a little above pre-pandemic levels. I think operationally what we have trying to anticipate is the impact in a rising rate environment, what consumers are able to absorb in F&I and just trying to be a little bit proactive and probably a little conservative on what F&I might look like in 2023 at 1,850, which is about $150 drop off of where we have seen things in the last couple of years here, really nothing to do with DFC. And we have finding solutions of how to do it more efficiently and we will continue to be able to throttle that up and down depending on what the market conditions give us and believe in the quarter that the decisions we made to some extent to cost ourselves 300,000 -- 300 basis points in SG&A were fundamentally, because of those decisions that we believe that an omni-channel solution that has the potential to get to $2 EPS and if you layer that over $50 billion in revenue, which we have on clear trajectory towards, it starts to produce quite a nice number thatâ\u0080\u0099s differentiated from others in the space."
}