{
    "symbol": "EW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 20:00:25",
    "content": " Now, turning to the quarterly results by product group, in TAVR, second quarter global sales of $907 million increased 5% on an underlying basis, despite approximately 50% growth in the year ago period. Also recall in Q2 of last year, our U.S. TAVR sales increased over 50% on a year-over-year basis, as COVID vaccines became more widely available and patients who had waited were treated. Localized hospital staffing disruptions impacted second quarter results, although this headwind was less pronounced than in the U.S. 15 years after commercialization, it's encouraging to see the resilience of the TAVR programs in Europe, despite the challenging backdrop of today's environment. Our Q2 commercial performance was tempered by lower-than-expected market growth related primarily to COVID headwinds We are now updating our full year guidance to $110 to $140 million, which represents approximately 60% underlying growth over the prior year and reflects a stronger-than-anticipated impact from foreign exchange as the vast majority of TMTT's business is in Europe. In Surgical Structural Heart, second quarter 2022 global sales of $229 million increased 2% on an underlying basis over the prior year. Selling, general and administrative expenses in the second quarter were $409 million or 29.8% of sales, primarily due to a resumption of in-person commercial activities, partially offset by the weakening of the euro and yen against the We continue to expect full year 2022 SG&A expenses as a percent of sales to be between 28% and 30%, as we continue to invest in our high-touch model for TAVR and the ongoing build-out of the TMTT commercial team. At current rates, we now expect an approximate $250 million negative impact or 4.5 percentage points to full year 2022 sales compared to 2021, of which approximately $170 million impacts the second half of the year. And with that, I'll turn it back over to Mark. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. And with that, I'll turn it back over to Mark."
}