{
    "symbol": "EW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 21:45:16",
    "content": "  Operator: Good afternoon, and welcome to the Edwards Lifesciences Third Quarter 2022 Results Conference Call. With me on today's call are Mike Mussallem, Chairman and Chief Executive Officer; and Scott Ullem, Chief Financial Officer. Also joining us for the Q&A portion of the call are Larry Wood, our global leader of TAVR; Bernard Zovighian, our global leader of TMTT; Daveen Chopra, our Global Leader of Surgical Structural Heart; and Katie Szyman, our global leader of Critical Care. Just after the close of regular trading, Edwards Lifesciences released third quarter 2022 financial results. During today's call, management will discuss those results included in the press release and accompanying financial schedules and then use the remaining time for Q&A. These statements include, but aren't limited to, financial guidance and expectations for longer-term growth opportunities, regulatory approvals, clinical trials, litigation, reimbursement, competitive matters and foreign currency fluctuations. Additionally, the statements involve risks and uncertainties that could cause actual results to differ materially. Information concerning factors that could cause these differences and important product safety information may be found in the press release our 2021 annual report on Form 10-K and Edwards' other SEC filings, all of which are available on the company's website at edwards.com. Finally, A quick reminder that when using terms constant currency, underlying and adjusted, management is referring to non-GAAP financial measures. And with that, I'd like to turn the call over to Mike Mussallem for his comments. Globally, structural heart procedures grew less than we expected in the third quarter, but that didn't slow us down, as our team accomplished numerous important milestones and made good progress on our multiple clinical trials and next-generation technologies. In August, we received European regulatory approval for PASCAL PRECISION. Shortly thereafter, in September, we received early U.S. FDA approval for PASCAL PRECISION for the treatment of patients with degenerative mitral regurgitation, which was welcome news for clinicians who appreciate this differentiated platform. And in TAVR, last month, we announced approval to begin selling the SAPIEN 3 Ultra RESILIA valve in the U.S. our industry-leading SAPIEN 3 Ultra transcatheter aortic heart valve now incorporates Edwards' breakthrough RESILIA technology. Additionally, during the third quarter, enrollment accelerated in our 2 TAVR pivotal trials, progress evaluating patients with moderate AS and Alliance for our next-generation TAVR technology, SAPIEN X4. Our broad portfolio of innovative technologies drove this growth, although it was at the lower end of our expectations, reflecting persistent U.S. hospital staffing shortages and COVID headwinds in Japan. For full year 2022, we expect total Edwards sales will be negatively impacted by foreign exchange and be at the low end of our previous range of $5.35 billion to $5.55 billion. In TAVR, third quarter global sales of $862 million increased 6% on a constant currency basis. Sales were below our expectations due primarily to the persistent U.S. hospital staffing shortages and COVID headwinds in Japan, which intensified the typical impact of summer seasonality. In the third quarter, we're pleased that well over 30,000 patients were treated with SAPIEN across our more than 2,000 global TAVR centers. In the U.S., our TAVR procedures increased in the mid-single digits versus the prior year. As expected, our third quarter U.S. TAVR procedure volumes continued to be impacted by regional U.S. staffing constraints, which were somewhat worse than we anticipated. And while staffing issues limited overall growth during the quarter, nearly half of our TAVR centers grew double digit in Q3. Outside the U.S., in the third quarter, our TAVR sales grew in the low double digits on a constant currency basis, and we estimate total procedure growth was comparable. In Q3, geographies outside of Europe and Japan grew even faster in the quarter. Long term, we see excellent opportunities for OUS growth as we believe international adoption of TAVR remains quite low. In Europe, sales were down sequentially as expected, even though we compete with a broad range of competitors, our competitive position remains stable. Scattered staffing shortages slightly exacerbated summer seasonality, and we anticipate some lingering regional impact on that. In Japan, third quarter procedure growth was impacted by a widespread seventh wave of COVID, which created a significant strain on hospital capacity and limited TAVR procedure volumes. As you might expect, procedure volumes in Q3 varied across the country as patients and the providers were incentivized to turn their focus again to the treatment of patients with COVID. In summary, we anticipate the continuation of staffing shortages and a difficult winter, COVID and flu season. This broad-based, favorable evidence, combined with the undertreatment rate and growing elderly population supports our expectation that this global TAVR opportunity will reach $10 billion by 2028, which implies a low double-digit compounded annual growth rate. Recently, we received U.S. FDA and European CE Mark approval of PASCAL PRECISION. In addition, we continue to advance enrollment of our Class IIF pivotal trial for patients with functional mitral regurgitation. Separately, we continue to treat patients with our 2 transcatheter mitral replacement therapies through the ENCIRCLE pivotal trial for SAPIEN M3 and the MISCEND study for EVOQUE Eos. As uncertainties remain around the MDR process, we now expect a CE Mark approval late in 2023, with sales contribution in 2024 when we expect to have reimbursement in place. Looking ahead to PCR London Valves conference in November, we expect numerous late-breaking data presentations across the TMTT portfolio. Adoption of the PASCAL system in Europe increased as we initiated a limited introduction of PASCAL PRECISION, and we continue to have excellent outcomes for patients as we progress on a gradual expansion into more centers in Europe. We forecast to increase the number of procedures in Q4, yet expect reported Q4 sales to be similar to Q3 as a result of FX headwinds and a spike in COVID in Germany, our largest region in Europe. In Surgical Structural Heart, third quarter global sales of $220 million increased 8% on a constant currency basis over the prior year. And although staffing shortages continue to be a concern, we're observing that cardiac surgeries are being prioritized. We continue to see strong momentum of the RESILIA portfolio globally as we bolster the overall body of evidence, including 4 abstracts recently presented at the European Association for Cardiothoracic Surgery Annual Meeting in Milan. Separately, we've decided to exit our HARPOON surgical mitral repair system and stop enrollment in the related clinical trials. Given our experience to date, we made the difficult decision to focus on developing other innovative therapies to better serve patients and continue to be the partner of choice for cardiac surgeons. In summary, we remain confident that our full year 2022 underlying sales growth will be in the mid-single-digit range for Surgical Structural Heart driven by market adoption of our newest premium technologies and surgical market growth. In Critical Care, third quarter sales of $207 million increased 3% on a constant currency basis over the prior year. Sales growth was driven by increased adoption of our broad portfolio of smart recovery products, including FloTrac and ClearSight sensors with our unique hypotension prediction index algorithm. In summary, we continue to expect mid-single-digit underlying sales growth for the full year 2022. We remain enthusiastic about our pipeline of Critical Care innovations, highlighted by smart recovery technologies designed to help clinicians make even more informed decisions for patients. As Mike mentioned, our sales of $1.32 billion in the quarter, representing growth of 6.7% on a constant currency basis, fell short of our expectations, driven by a slower-than-expected recovery of U.S. hospital staffing and COVID in Japan. GAAP EPS was $0.55, which included a net $57 million pretax charge or $0.07 per share related to the HARPOON discontinuation. We anticipate that the U.S. hospital staffing challenge is likely to persist, and we now expect total company sales at the low end of our previous range of $5.35 billion to $5.55 billion. We continue to expect Surgical Structural Heart sales of $870 million to $950 million, and Critical Care sales of $820 million to $900 million. For the fourth quarter, we're projecting sales and adjusted earnings per share to be similar to Q3. We now expect full year adjusted earnings per share of $2.40 to $2.50, up from 2021 adjusted EPS of $2.22. This improvement was driven by the expected positive impact from our foreign exchange program, which includes hedge contract gains and natural hedges that offset the negative sales impact from the weakening of the euro and yen against the dollar. At current FX rates, we continue to expect our full year 2022 adjusted gross profit margin to be approximately 80%. At current rates, FX is expected to result in an approximate 250 basis point reduction in our gross profit and operating margins in 2023. Selling, general and administrative expenses in the third quarter increased 3.5% over the prior year to $377 million or 28.6% of sales primarily due to a resumption of in-person commercial activities, partially offset by the strengthening of the dollar. The discontinuation of our surgical HARPOON program resulted in a net $0.07 per share charge consisting of a noncash impairment of intangible assets, a reduction of contingent liabilities and other related exit costs. We continue to expect our full year tax rate, excluding special items, to be at the high end of our 11% to 15% range. At current rates, we estimate a year-over-year FX impact to fourth quarter sales of more than $100 million. In total, we now expect an approximate $270 million negative impact or 5 percentage points to full year 2022 sales compared to 2021, and we expect nearly the same negative impact to full year 2023 sales. Relative to our July guidance, FX rates had a minimal impact on third quarter earnings per share. Free cash flow for the third quarter was $250 million, defined as cash flow from operating activities of $310 million, less capital spending of $60 million. So before turning the call back over to Mike, I'll finish with an update on our balance sheet and share repurchase activities. We continue to maintain a strong and flexible balance sheet with approximately $1.7 billion in cash, cash equivalents and short-term investments as of September 30. Average shares outstanding during the third quarter were $625 million, down from the prior quarter as we repurchased 1.1 million shares for $100 million. Year-to-date, through the end of Q3, we repurchased 8.4 million shares for $861 million. Well, despite ongoing procedure headwinds associated with the pandemic, we're pleased with our year-to-date performance, which includes strong progress on strategic milestones. Before we transition to Q&A, I want to remind everyone that our 2022 investor conference will take place on Thursday, December 8, at the New York Stock Exchange. In addition to our 2023 financial guidance, you'll hear more about Edwards' focused innovation strategy and our comprehensive and exciting product pipeline. With that, we're ready to take your questions. I wanted to ask one on 2023, just a framework and some things to consider and then one on tricuspid, Mike and Scott. Just starting with 2023, I think people are going to look at the second half implied growth year, call it, 7% by my math. So Larry, it's Scott. Financially, we haven't gotten into the quarter-by-quarter FX impact or growth rates. Typically, we don't give guidance, as you know, for the next year until our investor conference. But just we thought it was helpful because FX has been such an impact this year, and it will continue to fall over the next year that will help quantify what the top line impact will be, which we think is near what is going to be this year. So this year, we're at like 5% of sales and about $270 million. We think maybe it gets near to that at current rates, when we forecast for 2023, but we don't have the quarter-by-quarter breakout yet. Mike, do you want to talk about next years...\n Well, I'd just briefly just go through the portfolio. I mean, we feel like the business -- we don't talk about very much like Surgical and Critical Care are strong and are going to continue to deliver. And then TAVR, even though we're suffering right now from some staffing shortages, we think those are going to get gradually better. I mean, we're not kidding when we say we still believe that there's a $10 billion opportunity in 2028. We're highly confident in that, and I think we're on a path to achieve it. And actually, I wanted to ask about tricuspid. We're obviously excited about our pipeline, and we work very closely with regulators around the world, including the FDA. I mean, we're well aware of all the tools that are available, and we'll try and do the smartest thing and work really in a legal fashion with the regulators, but it's not clear. Maybe first, I think it would be helpful. So let me kick it off, Robbie, and then I'll turn to Larry and Daveen to supplement the answer. So actually, the TAVR procedures, we believe grew faster than the Surgical procedures, if you look at what the market did in the quarter. When you look at Edwards itself, it looks like the Surgical business was growing faster, but that's more Edwards-specific performance rather than what was going on in the underlying market. Yes, so to follow up what Mike was saying, Robbie, the growth driver of the Surgical business, as Mike had mentioned, was really about driving adoption of the Brazilian portfolio globally as well as the U.S. launch of our new mitral valve MITRIS, which provided a nice uplift. But as like I said, we also had a little bit of market growth coming from us -- maybe low single-digit market growth. As it relates to TAVR, there's more upfront work that has to happen with a TAVR patient than a surgical patient, both in terms of the imaging that has to be done, you have to do a CT for sizing. Oftentimes, you need to do angiograms to screen out for coronary disease so that you can do all of your TAVR case planning. And so when we talk about staffing issues, a staffing issue at any link in the chain can cause patients to move a little bit slower through the system and take a little longer to recover. But as Mike said, procedures grew faster than surgery. So it's -- and a lot of the growth drivers in surgery, I think, go beyond aortic procedures. I don't know how close you were to how hard it hit in Japan, but it is hard. It was probably worse towards the middle of the quarter, and it started getting better. So it's -- the wave is kind of passing now, if you will. Maybe my first one is, Mike, for you, specifically on U.S. TAVR. And perhaps the remaining half of the center, you're seeing some of these staffing challenges. I don't know that low single makes sense to me, Vijay. But nonetheless, let's just get into what's there, and I'll turn it over to Larry here in a second. But yes, indeed, we saw a great variance across the country in terms of how hospitals have been performing. But Larry, why don't you get into that a little bit. When we looked across the country, I think anywhere we go and anybody we talk to, they talk about staffing challenges. But clearly, it seems to be impacting certain areas of the country more than others. I mean, just anecdotally,  centers in Texas in the middle of the country that were growing very, very well. And so we do see big differences, but it actually -- it encourages me that as these things start to wane, the patients are there. And I think, again, anecdotally, we hear backlogs continue to grow, but I think there's still some challenges in working through these staffing issues. And then yes, we're going to continue to buy back shares. And we've done accelerated share repurchases, including earlier this year. In total this year, it's been our biggest share repurchase year ever at over $800 million. And so the only good thing about the stock price haven't been under pressure this year is it's given us a chance to go buy in shares, and we think that, that's going to be a great long-term investment. There's -- just because of the nature of the trials and the 2-year end points that we have on these trials, they're not really big contributors to those numbers. And what drives those numbers is we still have only about 1 out of 10 patients with aortic stenosis that are getting treated in the U.S. And if you look at the penetration rates, outside the U.S., they're much smaller than that. I mean, in a lot of Rest of World places, they're just really just getting started and Japan is very undertreated. So I think it's just a matter of getting through some of this COVID lag that we've had, getting some of the staffing a little bit healthier. And how should we think about, I guess, the penetration of RESILIA tissue than the SAPEIN franchise in the U.S. in 2023 or in the coming quarters and into 2023? Well, we're very fortunate that our Surgical business has built a great brand around RESILIA, and we get to follow that all of the brand work that they've been able to do. And so when you look at the Surgical side in , I think the leading heart valve in the world now, and that's largely based on the RESILIA tissue and how receptive people have been to the benefits that it brings. For SAPIEN 3 UR, that approval came a little bit earlier than we expected. We've increased our list price by about $1,500. Now people get rebates, and there's different things around the country. But I expect this is going to be a popular platform, but it's going to take us a while to get it all rolled out. So I wanted to spend a little bit of time on hospital staffing because by our due diligence, it's getting better, but not expected to get great anytime soon. So you're right, we don't expect staffing to be cured overnight. As Larry indicated, just by the fact that we have almost half of the U.S. hospitals in TAVR that were growing at double digits. And then again, there's another large swath of people that are really suffering from it. The conversations that we have with those folks in many cases say, oh, we're making progress, it's improving. I mean we do anticipate probably a tough winter, Joanne, just because of what's predicted here with COVID and the flu. But beyond that, it's tough to say. We're going to be providing guidance at the investor conference, so you can get deep on that. I think it's important to remember, I mean, the patients are out there and they need to be treated. And the physicians are still very, very motivated to get these patients treated. And I think hospitals are incentivized for doing procedures, not for not treating people. I just think as hospitals have added staff, one of the first things they try to do, as Mike mentioned, is use the new staff to replace the traveling nurses to try to help out their own P&Ls. And so that's maybe why we haven't seen as much lift from the staffing, but hospitals are working super hard on this to get this resolved. It's going to take time because you can't just create nurses from scratch quickly, but people are working really hard on getting this into a better place. And I apologize, it's hard to not focus on the U.S. growth numbers. Larry -- it is actually sort of a question for Larry, really, but I'll just , Mike. You talked about one aspect of getting patients treated, the imaging. And related to that, one of the thing I still can't quite understand and wrap my brain around is to I mean,  stenosis are very -- patients are sick. Yes, in the early days of the pandemic, I really do think it scared patients away from engaging in the system and getting treated. I think for the most part, we're in a different place now where the AS patients actually, they want to be treated. They're willing to go into the system, but they're just finding the system grinding along slowly. And they're being pushed off, and they're being postponed. Maybe Larry, you can get a little bit deeper on that. I mean, what we hear anecdotally is that backlogs are growing at hospitals, which would seem to indicate patients are still getting referred at least from what we hear from the physicians that we talk to. But as I talked about earlier, there's just a multiple set of tests and screening and imaging that patients have to do before they get their TAVR. But again, hopefully, this improves with time as staffing gets back to normalcy. Yes, we're definitely building up that team, and we're growing the team in Europe as well as the U.S. So maybe let me start with the U.S. We are obviously very pleased about having an early approval with PASCAL in the U.S. We are executing our plan, which is training and expanding our field organization. First one is looking at the U.S. TAVR growth this quarter, and I apologize for all the questions on this topic. It's quite -- it's really a mixed bag, Pito. But Larry, you want to make a few comments and \n It really is a mixed bag. So it's just really, really hard to generalize or to make broad overreaching comments. But as we said before, probably about half of our centers were growing in double digits. And then looking at the German market, its largest -- most mature market in Europe, and I know that's sort of been COVID throughout the year. So it kind of depends what we're talking about, Pito. So if you're talking about surgery or you're talking about TAVR or you're talking about the transcatheter mitral, they each have their own growth rates. We tended to see it more in the ICUs in Germany, maybe more than any other country in Europe, which tended to hurt our transcatheter mitral probably market growth a little bit more than some of the other segments. We have seen a spike in COVID wave in -- specifically in Germany, mainly in October, late September, in October. I think generally speaking, Q3 in Europe is always a little bit tougher because we have the seasonality that we typically see with holiday vacations and those sorts of things. But we certainly have seen some challenges there, but I would say the staffing issues are a little bit more scattered there than they are in the U.S. just more widespread. And then just turning to U.S. as well, the 2 PASCAL trials FMR and for TR, just if you could provide an update in terms of how you're thinking about recent progress with then in enrollment as well as kind of time lines to potential approval? So this year, we are very excited about it, even though we are at the beginning of it. We believe that the sites are going to put more focus on these 2 remaining trials, but we are continuing. And this new process is uncertain, specifically for breakthrough therapies like EVOQUE. At London Valve, you are going to see additional data with more patients, longer follow-up. So for sure, disappointed by not being able to have an approval this year. And if that's a comment on both U.S. and OUS, you expect kind of both to be down quarter-over-quarter? And so the $850 million incorporates sales from outside of the U.S. and in the U.S. And outside of the U.S., you've seen the euro and the yen just get weaker and weaker during the course of the year. We actually expect more procedures, both in the U.S. and outside the U.S. in the fourth quarter. And again, I'm going to have to ask you to hold off for the detail on the ticking and tying until we get to New York on December 8. So top line, we're expecting, as we mentioned, similar headwinds to what we've seen this year. So we go down about 250 basis points from where we expect the full year this year, which would take you to 77.5% just from a modeling perspective. So the combination of those 2 things, flowing down the P&L should get you to at least a preliminary range of what to expect earnings per share. Well, we had an inflated gross margin this year because of the impact of hedge contracts, and that will largely go away. And then you keep saying the winter months, it sounds like the early part of '23. In Japan, we said, yes, Japan, we believe, is getting better. We'd say, generally, the intelligence, and this is particularly U.S. and Europe oriented, is that we expect it to be a rugged COVID and flu season. And that -- we haven't fully experienced that yet that, that's probably more expected to come in November through January time frame. And so there is an appropriate amount of expectation, and I guess, conservatism that we are expecting continuing headwinds from respiratory illnesses, whether it's COVID or flu or something in between, we expect that that's going to continue to play a factor in the fourth quarter and into 2023. But as FX rates continue to go against you, I know that, that also pushes out the hedge impact into next year. And similarly, we're going to see some FX benefit in the first part of there will then be a headwind in 2024. It's a 250 basis point headwind to gross margin, it's nearly a 5 percentage point headwind on the top line. So as it relates to ALLIANCE and PROGRESS, we just really got those trials going this year. And we have seen an acceleration in enrollment, which is really encouraging for us to get these trials moving forward. And given the overall environment, you worry that clinical trials just really add on, and it's a little bit counterintuitive, but our trials are actually starting to enroll at accelerated rates. And Adam, your question about additional IID readouts is a good one. So far, this has really been an early readout of the Class IID, which was sufficient to get U.S. approval, but as we follow all of the patients in this trial for the full year, there will be additional data. You can expect to see additional data, more patients, more follow-up starting as early as next year. Ladies and gentlemen, that's all the time we have for questions. Well, thanks, everybody, for your continued interest in Edwards."
}