{
    "symbol": "ABMD",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-01 15:04:14",
    "content": " With us this morning are Joaquin Duato, Chief Executive Officer of Johnson & Johnson; Michael R. Minogue, Abiomed's Chairman, President and Chief Executive Officer; Ashley McEvoy, Executive Vice President and Worldwide Chairman of Medtech at Johnson & Johnson; and Joe Wolk, Chief Financial Officer of Johnson & Johnson. Johnson & Johnson's global footprint, leading capabilities, efficient education, commercial excellence and robust clinical expertise will complement Abiomed's capabilities, accelerating access and adoption of life-saving technologies for more patients around the world. by bringing Abiomed into Johnson & Johnson, our complementary cultures, patient-first mindset, strength of Abiomed's current and future portfolio and Johnson & Johnson capabilities and global scale, we will drive a recovery to be the global standard of care. This transaction will deliver significant value to our shareholders and position us to leverage the Johnson & Johnson's global scale and commercial and clinical strength to accelerate growth faster creating meaningful benefits for our patients, our employees and our customers. In terms of structure post close, Abiomed will operate as a stand-alone business within Johnson & Johnson MedTech and expand our priority platforms, which deliver more than $1 billion in annual revenue from $11 million to $12 million. They use dedicated resources, continuous virtual training and live courses to ensure all health care representatives who come in contact with Impella supported patients feel confident in using Abiomed solutions and their ability to improve outcomes Together with our market-leading electrophysiology presence, we believe that J&J MedTech will be able to establish deeper connections with both interventional cardiologists as well as heart surgeons providing a strategic platform for future growth and more opportunities to serve even more patients. The milestones consist of $17.50 per share payable if net sales for Abiomed products exceeds $3.7 billion during our first -- our first second quarter of 2027 through fiscal quarter fiscal first quarter of 2028 or if this threshold is not met during this period and has subsequently met during any rolling 4-quarter period up to the end of Johnson & Johnson fiscal first quarter of 2029, $8.75 per share."
}