{
    "symbol": "AON",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 14:02:05",
    "content": " Post-event, we obviously focused on accelerating clients' resolution but we're also stepping back with clients and taking an enterprise view of what the hurricane means for their benefit plans, leveraging our Health Solutions team and beginning new conversations around how they think about return to work, exploring how our Human Capital Solutions colleagues can apply learnings from our own smart working strategy to their workforce management. Year-to-date, we delivered 7% organic revenue growth, adjusted operating margin expansion of 80 basis points, adjusted EPS growth of 14% and generated over 2 billion in free cash flow. Commercial risk delivered 5% organic revenue growth this quarter on top of 13% in the prior year quarter, contributed 7% organic revenue growth year-to-date, driven by ongoing strong retention, new business generation and renewal highlighting the resilience of our core business as we continue to help clients protect and grow their businesses. Reinsurance delivered 7% organic revenue growth in the quarter, with 7% year-to-date, as our team continues to help clients in the current market by bringing new solutions and capabilities. Health Solutions delivered 5% organic revenue growth in Q3 on top of 16% in the prior year quarter, contributed to 8% year-to-date growth, but particularly strong growth in Human Capital Solutions. Finally, Wealth Solutions delivered 2% organic growth on top of 4% in Q3 last year and 2% year-to-date as our team continues to help clients address market volatility, talk of regulatory challenges and execute ongoing pension risk transfers. Overall, our strong performance in Q3 and year-to-date reflects the strength of our Aon United strategy and Aon Business Services platform delivered for clients across regions and solutions lines. For the first nine months of the year, we translated 7% organic revenue growth into 80 basis points of adjusted margin expansion and 14% growth in adjusted earnings per share, and generated over 2 billion in free cash flow. I would also note that flat  reported revenue growth in Q3 and 3% year-to-date includes an unfavorable impact from changes in FX of 5% for Q3 and 4% year-to-date, primarily driven by a stronger U.S. dollar versus most currencies. We delivered strong operational improvement through the first nine months of the year, with adjusted operating margins of 30%, an increase of 80 basis points driven by organic revenue growth and efficiencies from Aon Business Services, overcoming expense growth, including investment in colleagues and technology to drive long-term growth and some ongoing resumption of T&E. Please proceed with your question. Please proceed with your question. And so for us, as we think about growing margin expansion for the full year, which we are completely committed to doing, it's really about continuing to drive organic revenue growth, the portfolio mix in higher revenue growth, higher margin areas, and the productivity benefits we're getting from Aon Business Services. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}