{
    "symbol": "AON",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 13:14:05",
    "content": " This top line strength translated into an adjusted operating margin of 26.2% in the quarter, up 40 basis points from last year, and adjusted EPS growth of 15%, demonstrating the strength of our Aon United strategy and Aon Business Services platform. Commercial Risk delivered 7% organic revenue growth, driven by ongoing strong retention and renewals, highlighting the strength of our core business and strength from areas of investment like CoverWallet within digital client solutions. Finally, Wealth Solutions delivered 3% organic growth as our teams continued to deliver results in core retirement and investment solutions, with ongoing additional work to help clients address regulatory changes and impact from recent market conditions, like the opportunity for pension risk transfer. I would also note that reported revenue growth of 3% in Q2 and 4% year-to-date includes an unfavorable impact from changes in FX, primarily driven by a stronger U.S. dollar versus most currencies and fiduciary investment income of $7 million in Q2 and $9 million year-to-date. We delivered strong operational improvement through the first half of the year, with adjusted operating margins of 32.7%, an increase of 50 basis points, driven by organic revenue growth and efficiencies from our Aon Business Services platform; overcoming expense growth, which includes investment in colleagues, technology to drive long-term growth and some ongoing resumption of T&E. We've certainly seen very strong 50 basis points of margin expansion in the first half of the year, and we expect to see full year margin expansion, driven by organic revenue growth; our portfolio mix shift to higher revenue growth, higher-margin areas; and our continued productivity benefits through Aon Business Services, which I mentioned specifically in our prepared remarks. We're bringing the core capability of our firm to clients every day and that really does enhance our ability to grow in the core, but also bring new solutions and ideas to them and also solutions ideas which connect across areas, meaning we're connecting things in D&O with our people business in the ways we haven't done before. And the third, as Greg highlighted, is our investments -- and Eric highlighted, is our investment in Aon United, which allows us to bring together capability to serve clients who, in times of volatility, need us more, whether that's workforce resilience, pension derisking, supply chain, climate, a number of different areas. And we are continuing to invest organically and inorganically in areas of great growth and great margin expansion, data analytics with Tyche, digital with CoverWallet, a number of other areas across our business, where we're seeing enormous client need, supply chain, workforce resilience, climate, et cetera. So we're seeing opportunities, Meyer, whether it's installation, which positively impacts our revenue in driving up asset values, driving up employment levels, driving up corporate revenues; whether it's interest rates, which obviously positively impact, both on the revenue side in terms of fiduciary investment income; or whether it's volatility and clients needing us more on the supply chain, workforce resilience, pension derisking in times of increased volatility. And it's driven by retention, renewals, project work across the broad segment of that area, but also great growth related to the well-being and employee resilience part of health; the human capital piece with the Data Solutions growth, the advisory work really broad-based in terms of its impact we're having with clients across all of our geographies."
}