{
    "symbol": "TFC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-19 11:45:34",
    "content": " Adjusted earnings totaled $1.7 billion or $1.30 per share, up 5% sequentially as strong PPNR growth was partially offset by higher provision expense. Net interest income grew 7% to $4 billion, a new high for Truist, supported by strong loan growth and significant margin expansion resulted from higher short-term rates and well-controlled deposit costs. Adjusted EPS declined 10% year-over-year, a solid 4.4% adjusted PPNR growth, was more than offset by the $1.6 billion increase in the loan loss provision expense. For the quarter, taxable equivalent net interest income rose a very strong 7% to $4 billion, primarily due to ongoing margin expansion and strong loan growth. Fee income declined 4% compared to a year ago, primarily driven by declines in market-sensitive businesses such as investment banking, wealth and mortgage and partially offset by organic and inorganic growth in insurance. Compared to the fourth quarter of 2021, adjusted non-interest expense grew by 8% as a result of the increase in minimum wage, investments in revenue-generating businesses, technology and acquisitions, higher call center staffing to support our clients post merger and a normalizing T&E spend. The allowance increased $172 million, reflecting strong loan growth and the ALLL ratio was stable at 1.34% as the effects of a moderately slower economic outlook were offset by high quality organic loan growth and the BankDirect acquisition. For the full year 2023, we expect revenues to increase 7% to 9%, driven largely by strong net interest income growth and modestly improving fees. While economic uncertainty remains high, Truist is in a position of strength across a broad range of outcomes because of our diverse business mix, conservative credit culture, balanced approach to interest rate risk management, strong profitability profile and our strong risk-adjusted capital position and most notably, our significant performance momentum as we continue to shift from integration to executional excellence and purposeful growth. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}