{
    "symbol": "LHDX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 01:37:05",
    "content": "  Operator: Good afternoon, ladies and gentlemen, and welcome to Lucira Health Second Quarter Earnings Conference Call. Earlier today, Lucira Health released financial results for the second quarter ended June 30, 2022. Joining me on today's call are Erik Engelson, President and Chief Executive Officer; and Dan George, Chief Financial Officer. Before we begin, I'd like to remind you that during this conference call, the company will make forward-looking statements regarding future events. We encourage you to review the company's past and future filings with the SEC, including, without limitation, the Risk Factors section in the company's most recently filed annual report on Form 10-K and subsequently filed quarterly report on Form 10-Q, which identify the specific factors that may cause actual results or events to differ materially from those described in these forward-looking statements. These factors may include, without limitation, statements regarding product development and manufacturing, product potential, the regulatory environment, sales and marketing strategies, capital resources or operating performance. Second quarter revenues were approximately $26.1 million, a 110% increase over sales in the same period last year. Second quarter 2022 ending cash and cash equivalents was $75 million, and inventory was bolstered in advance of anticipated shipments in the fall and winter time frame. Despite the seasonality that we experienced this quarter, we are pleased with our financial performance delivered in a quarter known to be a light performer for respiratory disease testing in general. Throughout the second quarter, we exercised our manufacturing flexibility, made global regulatory strides, grew our online selling and targeting capabilities and progressed the product portfolio. As it relates to our existing COVID-19 product, we received approvals from the FDA and Health Canada to extend shelf life to 18 months. As a result, we believe we are well positioned to respond to anticipated COVID-19 test demand during the upcoming winter respiratory season in the Northern Hemisphere with on-hand inventory. In addition, we submitted a de novo 510(k) application to the FDA for clearance of our COVID-19 product, anticipating a future day when the EUA may be rescinded. In early July, we announced that the COVID-19 test received a full exemption in New Zealand for immediate commercial use. In response, we plan to focus our flexible manufacturing capacity mostly on the COVID & Flu tests. In preparation for this announcement, we built an initial launch quantity of the combo test, and we plan to ship product in Canada starting this month. The approval in Canada enables patients and health care providers to accurately diagnose Flu A, Flu B and COVID-19 on the spot in 30 minutes or less with lab quality results. Lucira's digital result capture, transmission and integration software has been upgraded so that it now works with the combo product. We believe that we have sufficient capacity to support anticipated demand, including the manufacture of the COVID & Flu product. As I alluded to previously, regarding the upcoming Canadian launch, the speed with which Lucira was able to create the COVID & Flu product speaks to the flexibility of the core Lucira technology as well as to the skill and agility of our team. Because Lucira has been refining the core technology and developing assays for nearly 10 years, we benefited from past work. Longer term, we believe that the flexibility of Lucira's technology, compared with our commercial performance over the last several quarters, demonstrates that strong financial performance can be achieved with modest volumes. For example, upon receiving a positive test result, LUCI Connect will link a patient to high-quality, low-cost providers at the patient's convenience. Not only will this provide ease and convenience to patients at home, but it will be a value-added Lucira service to our telehealth partners. We are investing in LUCI Connect, both to improve the patient's experience and also because it will be good for business. We have big plans in development to expand the functionality of LUCI Connect in the near term, and look forward to sharing more about this in coming quarters. We believe that technology applied to the needs of our customers is at the core of our mission, and that long-term growth with a digital emphasis opens the door to diverse partnership capabilities and telehealth applications. Additionally, we consider ourselves as both a molecular test manufacturer as well as a digital health care company. The share of virtual primary care settled at around 12% at the end of 2021, much higher than pre-pandemic levels. We believe that Lucira will play an increasingly important role in this paradigm shift in the control of infection and early treatment of respiratory diseases, STIs and in women's health. Accurate instrument-free molecular tests, paired with our flexible digital platform that integrates into partner systems, enables convenience and ease of use. We believe that when we look at Lucira, we are seeing stepping stones along a path into the future. More new products, expansion of the digital platform, greater market awareness of Lucira's offerings, greater DTC penetration, international expansion and decreased cost of goods are our growth drivers. As always, we recognize and thank the employees, partners and contractors, who execute Lucira's mission with their hard work and enthusiasm. Net sales for the second quarter of 2022 were $26.1 million, a 110% increase over the second quarter of 2021. Our net revenue was primarily driven by sales directly to consumers, businesses and distributors, health care providers and international customers. Gross profit and gross margin for the second quarter of 2022 were $8 million and 31%, respectively, compared to a gross loss and negative gross margin for the second quarter of 2021 of approximately $100,000 and 1%, respectively. New product development, clinical activities and validation and manufacturing activities primarily drove the increase. Selling, general and administration expenses were $18.6 million in the second quarter of 2022 compared to approximately $6.1 million in the same period in 2021. The decrease in cash was primarily related to investments made in inventory, partially offset by the closing of the first tranche of our debt financing agreement of $30 million. Your line is open. Maybe just to start, Dan, on outlook, I appreciate that you're not giving any formal guidance here. About halfway through the third quarter here, and we've got the respiratory season coming in the fourth quarter. I mean, to your point, Griffin, we're not giving guidance, but I think you can look at our third quarter as sequential growth â\u0080\u0093 top line sequential growth over Q2. And as Erik mentioned in the prepared remarks, we're looking for a strong Q4 and Q1 that coincides with the fall and winter months. And in fact, Health Canada approval marks the first time an at-home self-test for COVID & Flu has been approved by a major regulatory body. So we're very pleased with this, and have expectations that this will be important to Lucira. So just as the COVID & Flu product is here today in Canada and, hopefully, will be soon in the U.S. and elsewhere. It's going to be, we believe, very important to our business because it's going to enable a connection between a positive test result and prescription and treatment. So I would focus on that as the next step in the pipeline, and we're very excited about that. We have been continuing to work on Chlamydia and Gonorrhea and other tests in the background, and we'll have more color to share on those in the coming quarters. So I don't want to get too far ahead of ourselves here for the resources into the digital effort, and I would focus on that as the next delivery. But just as I mentioned that Bain & Company research pointed out, this transition is happening now. And particularly in the case of infectious disease, you don't want people in circulation, and you want to be able to treat â\u0080\u0093 test and treat as early as possible. And I knew that because I could test immediately on Lucira, and then I was able to get treatment following that. So I think the time is now, and Lucira is right at the right point to be able to contribute to this transition and to build a very strong business around this. Your line is open. Obviously, you guys are building up your inventory and that contributed to a significant burn in the quarter. So as I mentioned, we do believe that we have significant or enough cash capital to see us through our strategic forecast. No, I would just add, and just to underscore that the extension to 18-month shelf life is very helpful in that regard, in removing risk around that inventory. And also complements to our team on the ability to develop and execute a new product on minimal operating expense, so really well done internally. So the good news is that our manufacturing is flexible enough, and these products lend themselves to this flexibility so that we can move back and forth fairly readily. Now that we have the inventory that we have of COVID product, we will prioritize building of the combo product. There are some circumstances where one would want to just use a COVID test, and so we'll have product available for that. We â\u0080\u0093 you'll see in our 10-Q, I would say, close to 50% of our quarterly revenue came from direct-to-consumer. Your line is open. In terms of thinking about gross margin, I know you guys are kind of â\u0080\u0093 you said â\u0080\u0093 you mentioned that you're shifting manufacturing towards the combo test. Hi Rahul, I think you're going to see a really similar impact on gross margin that we've seen in the past. So I think when you think about the business, we're looking at being at gross margins north of 60%  at volume. Just thinking about the combo testing, I know you kind of â\u0080\u0093 I appreciate kind of scares the breakdown of revenues across different channels given that the combo test is available in Canada and presumably will be available in the U.S. for part, if not the majority of the season. So Rahul, it will be distributed among our four main channels, which you've named, and whereas in Canada, heavier health care/government and then DTC channels. So I think from a modeling point of view, I think you can look across the four channels in the U.S. and then a more focused government health care DTC in Canada. Thank you, Olivia, and thank you all for your time this afternoon, for your interest in Lucira Health. We are delivering the first and only fully disposable molecular Flu A, Flu B and COVID-19 multiplex test to market in Canada now and hope to do the same in the U.S., if and when approved. We look forward to leveraging our incredible technology to help drive a change in the future of health care and in so doing, to build value for our shareholders."
}