{
    "symbol": "MBUU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-10 12:08:14",
    "content": "  Operator: Good morning, and welcome to Malibu Boats Conference Call to Discuss Third Quarter Fiscal Year 2022 Results. On the call today from management are Mr. Jack Springer, Chief Executive Officer; Mr. Wayne Wilson, Chief Financial Officer; and Mr. Ritchie Anderson, Chief Operating Officer. On the call, Jack will provide commentary on the business, and I will discuss our fiscal third quarter 2022 financial results. I also want to remind everyone that management's remarks on this call may contain certain forward-looking statements, including predictions, expectations, estimates or other information that might be considered forward-looking and that actual results could differ materially from those projected on today's call. You should not place undue reliance on these forward-looking statements, which speak only as of today, and the company undertakes no obligation to update them for any new information or future events. Please also note that we will be referring to certain non-GAAP financial measures on today's call, such as adjusted EBITDA, adjusted EBITDA margin, adjusted fully distributed net income and adjusted fully distributed net income per share. We again delivered an exceptional quarter or record setting quarter, which was particularly extraordinary given the supply chain environment, the industry continues to face. During our record setting quarter, we exceeded nearly all metrics as our demand for large feature rich boats continues at a ramp up pace. While supply chain challenges persist, limiting our unit growth, we were able to navigate this difficult environment and achieve more volume than we anticipated, led by our unmatched operational prowess and manufacturing capabilities, we continue to provide the most innovative, highest quality boats to our loyal customer base. For the third fiscal quarter, we posted record net cells increasing 26% to $344 million, record adjusted EBITDA growing 40% to approximately $80 million and record net income growing 56% to nearly $55 million. Despite the headwinds in the supply chain and the persistent material pricing pressures, our margins displayed incredible strength and resilience. For the third quarter, gross margins increased 180 basis points to 28.2% while adjusted EBITDA margin increased by 230 basis points to 23.2% during the quarter. As mentioned earlier, demand for our boats remains incredibly strong across all models and brands. Last week, our largest dealer partner across all of our brands announced a very stout retail sales quarter and same-store sales were up 8% year-over-year. One of our North Carolina dealers reported that leads have been on pace with 2021, which was a record year and lead conversion to sales has occurred at a much higher than normal rate, with an even greater uptick in the month of April. Now, the 2020 number of first-time boat buyers totaling 63,000 was viewed as a COVID induced ceiling with 19,000 more first-time boat buyers versus a decade long average of about 44,004 first-time boat buyers each year. New data for calendar year 2021 remained elevated showing 12,000 or 26% more first-time boat buyers compared to the decade long annual average. Further in 2021, all first-time boat buyers, which would include new and used boat buyers surpassed 415,000 buyers for only the second time in 15 years. This represents almost 360,000 first-time used boat buyers of which a significant percentage will purchase a new boat as their next boat in the coming years. For Malibu and Axis customers continue to seek our larger, more expensive boats. For Axis, our brand-new T250 is doing very well setting a tour in pace for new orders for this newly released model. As a reminder, the T250 is the largest Axis ever built and confirms that customers want bigger boats at every turn. The new R Series in Cobalt consisting of nine new models over the last 18 months has created significant market demand and transformed the R series with the addition of stern, surf and outboard variance offered in three different links. While our product success continues to be like flapjacks flying off the griddle at an IHOP, supply chain constraints remain our biggest hurdle to ramping production. Even though, we experienced some improvement to the supply chain in the third quarter, we supported more volume out the door. The supply chain remains volatile, limiting component availability across the brand for all brands, coupled with the ongoing unavailability of outboard and sterndrive engine in parts. Our ability to produce is desired for our Pursuit, Cobalt and Maverick brands and build channel inventory. While these supply chain issues have been trying, we remain focused on controlling our destiny and executing our strategic initiatives to help combat rising costs and increase our production. As you have all seen for many years, if we can control it and manage it, MBUU performs exceptionally well. While we cannot predict when the supply chain issues will abate, rest assured we have the pieces in place to combat future bottlenecks and provide operational resiliency across the board. Weeks on hand inventory continues to be about 13 weeks lower than previous historic lows, which is consistent with what we are seeing with our brands. While we believe there will be a slide increase to channel inventories for fiscal year 2022, we will largely see supply continue to mirror demand as retail sold orders are immediately captured. Our expectations remain unchanged as we look ahead the fiscal year 2023, when we will begin to see a build in channel inventory and potentially into fiscal year 2024 before we have normalization of channel inventories. No matter which direction the tide turns, Malibu is perfectly positioned for success with a long runway to ramp up production and reach normalized channel inventories. With demand continuing to run hot in considering our prolific operational capabilities, we take advantage of every opportunity to grow our business and our margin profiles. Through our unwavering execution on our strategic priorities, our planning, hard work and commitment to quality, we will continue to push the pace as we look ahead. In this environment, riddled with the delayed timeline from the unavailability of materials and labor, it is rare that a project meets expectations to the T. I am pleased to announce that our plant two expansion, which significantly increases our production square footage at Maverick was squarely on time and we began producing our first boats out of that facility in early April. Much like pursued a couple of years ago, this will allow Maverick to produce more boats, larger boats and increase the margin profile of the MBG brand. With a quarter left in fiscal year 2022, we are in a great position to deliver a historic and record setting year. We have reached significant milestones through our cross brand vertical integration efforts, acquisition of Malibu Electronics and the Maverick plant expansion. We look forward to releasing our 2023 product lineup in the next quarterly call, which will further showcase our industry leading innovation with compelling new products and features and has always deliver the greatest value for our shareholders. In the third quarter net sales increased 26% to a record $344.3 million and unit volume increased 4.4% to a record 2,562 units. The increase in net sales was driven primarily by year-over-year price increases, a favorable model mix and increased unit volumes for our Malibu and cobalt brands. The Malibu and access brands represented approximately 56.9% of unit sales or 1,457 boats. Consolidated net sales per unit increased 20.7% to approximately $134,400 per unit, primarily driven by year-over-year price increases and a greater mix of larger boats for our Malibu and Cobalt segments. The increase in gross margin was driven by volume increases, a richer mix of product, increased ASPs and improved vertical integration efforts through our recent acquisition of Malibu Electronics. This was supported by smart strategic deployment of capital, including our continued vertical integration efforts across our brands. Last quarter’s acquisition, Malibu Electronics was a major success and helped us take greater control over our supply chain, while driving higher unit volumes despite the environment. In addition to strong operating performance, we continued to deploy capital in the quarter in the form of share repurchases. As Jack mentioned earlier, while supply chain issues and cost inflation continue to drive uncertainty, we are in a strong position to continue to maximize our production in this difficult environment and continue our momentum to close out a very successful fiscal year 2022. Based on our current operating plan, our expectations for fiscal year 2022 are as follows: We anticipate revenue to grow in the 28% to 29% range year-over-year. While we look forward to closing a successful fiscal year 2022, we also look forward to the future. Our track record of sound decisions to vertically integrate, acquire brands, position for growth, invest in new product and expand capacity where appropriate will prove to be the things that differentiate us. We believe our team and our strategy set us apart and we are positioned to have industry leading performance that will deliver value for our shareholders, partners and employees through fiscal year 2022 and beyond. With that, I’d like to open the call up for questions. I just wanted to touch on, I guess, margins for the quarter. With respect to the performance across the portfolio, I would tell you that the Malibu brand having been here for the longest, has the highest margins on a year-over-year basis. The one place where there’s a little bit of margin pressure is in Maverick, but that’s because we’ve added a bunch of costs to that business as we position it to grow even further and really fill up that plant two expansion. And it has been for some period of time and continues to increase as we continue to invest in that business, whether that be through the engine vertical integration, flooring, Malibu Electronics, et cetera. Mike, it’s really pretty predictable and formulaic, to Wayne’s point Malibu very sophisticated business. We’ve seen that even though our margin grow and grow I think two years into it, we had doubled EBITDA. I will say Pursuit had a really, really good quarter from a growth and an EBITDA margin perspective did very, very well. And then – and to Maverick, to the point about Maverick, we’re a year, less than a year and a half into it. I mean, I think if I’m doing my math correctly, it would imply that there’s a sequential step down in production in margins. What I would tell you is Q4 is setting up similar to Q3 and what we said last quarter was with our guidance for Q3 was that, hey, look, there’s some upside here. And we contrasted that to the prior year where we said, look, there’s not a lot of upside. Alternatively last quarter we said, hey, look, here’s the guide, but we’re going to do everything we can to maximize production. But the amount of uncertainty that we’re dealing, frankly has been increasing over the past three to five weeks as opposed to decreasing as we went into last quarter. Rudy, I think first of all, I would point out that the ASPs are being driven by what the customer wants. If that larger boat, it’s the boat with more features, more options on it. And as long as that’s in place, you can continue to see those ASPs grow. We have been in a scenario that for a dozen years, since 2009, we have continually seen the ASPs grow the size of the boats grow in terms of what the customer is wanting, the amount of features and innovations that are being put on the boats. It’s driven ASPs, of course, but it’s also quickened the cycle for when a personal trade in their boat and get another boat. And that’s something that we feel like that we’ve certainly mastered over time of creating that environment where a customer says, hey, I’ve got to have that newest boat because it has more features. And I would just add to that Rudy, that while we’ve taken some price to help offset the inflationary pressures, the reality is that pricing meaningfully moved at retail back in the second half of calendar 2020 when inventory tightened up. But to Jack’s point, there’s a lot of elements of mix, both on model and feature set that the consumer’s absolutely driving. Well, we’ve been benefited by the fact that we were in AmTech and really helping to run it going all the way back to last August. With the acquisition, I think we were very well staged to very quickly take on new product for both Malibu and Cobalt. And then I think over time as we start rolling it out to the other two brands, it's going to have a big impact. Just to add a little anecdote there, I would tell you in the quarter, we experienced an acute shortage of a relatively small harness from a different supplier. And having AmTech allowed us to turn around a prototype harness within 24 hours to Cobalt and within 48 hours, having production volumes delivered to the plant. Actually resulting in lower costs and just absolutely maximizing your volume, that is hard to kind of quantify in terms of a return. I guess, first question on supply chain, I want to go back to something, you mentioned earlier, Wayne, is that the uncertainty and lack of visibility has increased, I guess, over the last three to five weeks. That's no longer, I guess, the case based on today's guidance and our checks indicate that things got a little bit worse in issue wide in April from a supply chain standpoint. And I think that if as long as China can continue to remain somewhat stable, that will look a little bit better from the supply chain, but we just simply don't know that. And maybe on pricing, obviously ASPs up 21, I know a lot of that was mixed, but maybe help us understand how much of that was base price increases. So in terms of the mix, the components of mix, it gets a bit complicated just across the business units, as you mix up with respect to, Malibu and Cobalt, obviously let's use Cobalt example. And so you have a bit of tailwind there around the mix and not dissimilar on the Malibu side, the new models, a bunch of the newer models are larger in size. And so it's probably a little bit higher than 50% of that is in the form of year-over-years, price increases and the rest being a strong mix component. And I think given the inflationary pressures, I think we feel position like we can increase price to maintain margin. No, I think you captured it well, it was a blowout quarter. We tried to not only cover the costs that we had incurred to that point, but also anticipate the costs that were going to come for the rest of the year. And I think our margins demonstrated, it's been very resilient, we've been able to hold them. It will probably roll over into the pricing of the product for next year, but that's what people have been dealing with for seven months. But we think that that will cover, the remaining costs or the visibility that we see going forward. First question, Brunswick, they called out some weather impacts in the quarter. We heard it from our northern dealers and it's been, I think a colder weather environment up north and similar to a lot of other years like this, we see it go from south to north. So there was some – I think there was some impact on the retail side in the north that seems to have turned that first week of April, North Carolina. So we've seen it from a retail standpoint, I think Wayne I'll let you touch on that, but I think it's about what we would've expected. I do think that there was some weather impact in terms of the deliveries if you're looking at registration data, either in SSI or warranty registrations. But from a retail activity with our dealers, I think it's really on par with what we had expected. Well, I think it's going to be a little bit down year-over-year versus 2021 because 2021 was so robust if you recall the kind of big jump in orders for the LTM period, call it ended May or June of 2021 was incredibly high. We've talked about it in the past a little bit without the supply chain, it can easily run. In summary, we achieved an outstanding record setting quarter, despite a consistently difficult supply chain environment. Our dealer backlog remains very strong, supported by unprecedented retail demand for larger innovative boats, driving ASP growth across the board. The supply chain continues to be very unpredictable, limiting production and now we are seeing new issues emerged with the recent shutdowns in Shanghai. Like Pursuit before it, the Maverick Plant 2 expansion will deliver more volume, larger boats and improve margin profiles for the Cobia and Pathfinder brands and Maverick Boat Group as a whole. And lastly, channel inventory continues to be at historic close, setting us up for a two to three year runway to ramp up production as the supply chain improves over time."
}