{
    "symbol": "CENT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-07 02:01:05",
    "content": " Operating income grew 1% even as we made purposeful investments in strategic areas including capacity expansion and automation, consumer insights, brand building, innovation and e-commerce to drive profitable long-term growth, and finally EPS came in $0.02 above prior year. Pet segment operating income was $63 million, a decline of 12% and operating margin declined 160 basis points to 12.4% due to inflationary headwinds in commodities, freight and labor, as well as purposeful investments in our initiatives to drive long-term growth. Please proceed with your question. Sales were softer than we had planned, but we still posted strong gross margin, EBIT and operating margin metrics in a difficult environment, I think Tim touched on some of these things, but we've seen the consumer now and evolving consumer behavior, so the consumers going back to some of their pre-pandemic activities, household penetration, buy rate, both contracted versus prior year, but are still up meaningfully versus pre-pandemic levels. Please proceed with your question. Yes, Brad my build having Niko says right is if you start the gross margin line, as we said in our remarks, Niko and I that's been largely a good news story in a really tough environment and so year-to-date I think we're above 50 bps or 0.5 point in gross margin and then as Niko said, we're really, and you saw it in this quarter trying to tighten our belt on the SG&A line. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. That's obviously a big ticket right when you see a 8-10% price increase, but think back to some of the earlier analyst questions, one of the barometer around there few is market share and how you're how you're faring versus some of the competition in a number of these places and we pointed to two of our bigger businesses, grass seed and live bird."
}