{
    "symbol": "RUN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 22:00:06",
    "content": " We grew installation volumes in Sunrun's direct business sequentially had a growth rate 3x the rate of headcount additions as installation crew efficiency increased by nearly 30%, and I am tremendously proud of what our team is doing in the field each and every day for our customers. As a result of our team's strong execution, we delivered significantly improved net subscriber value in Q3 of over $13,000, exceeding guidance, even when excluding the benefit from the passage of the Inflation Reduction Act, and we are guiding to continued increases in our margins for Q4. And then I guess, just related to that, I know maybe you don't want to give the exact number, but if I back out the price increases you were articulating over the past couple of quarters, it seems like the ITC 30% adjustment added maybe $1,500 or so to the reported subscriber value this quarter. And this is all against the long-term trajectory of utility rates, which are continuing to rise and also are in so many states we sell and not just our utility rates continuing to rise, but there is so much fear that has been embedded in customers because they also feel like they don't know what's coming next, what the next increase is going to be or in some states, frankly, if they're going to have reliable power. But yes, advance rates, we did take that down from the prior range of -- down to a new range of 75% to 85% that is consistent with the 6.5% to 7.5% range for cost of capital, which we see in the current interest rate environment, which reflects longer-term borrowing costs, which I've already taken a view on in this rate hike cycle kind of where the Fed is going to end up on very short-term borrowing costs. It's like -- the power of it is so much really energy as a subscription service model, where, again, it's really such a low friction, low stress way for customers to get like the most advanced technology in their homes in an affordable rate. Yes, I think maybe just going back to when we decided to start the company, we had spent years providing feature requests to inverter battery, electrification manufacturers and hadn't really felt like the features and specifications that we really wanted that we knew would lower our cost and increased customer demand, we're really being acted upon."
}