{
    "symbol": "STC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 17:41:07",
    "content": " As disclosed in Appendix A of the press release, adjusted net income for the first quarter was $56 million, which was 8% higher compared to last year's quarter. Total Title revenues for the quarter increased $97 million or 15% compared to last year's quarter, primarily due to improved results from our agency and commercial operations. The segment's pre-tax income improved to $83 million, which was $6 million or 7% higher than last year's quarter. Title pre-tax margin for the first quarter this year was 11.4% compared to 12.2% last year, primarily due to the effect of significant lower refinancing volume and investments we are making in the segment to improve Title production and Title data. With respect to our direct operations, domestic commercial revenues improved $27 million, driven by increased transaction volume across most asset classes and a 47% higher average fee per file of $12,700 for the first quarter of 2022. Residential fee per file for the quarter -- first quarter of 2022 was $2600, which was 37% better than last year's average fee per file due to the higher purchase mix. Total international revenues improved $7 million or 20% compared to last year, primarily due to increased transaction volumes in Canadian operations. Our agency operations had another strong quarter, generating revenues of $404 million, which is 17% higher than last year. The average agency remittance rate slightly improved to 18.1%, compared to 17.1% in last year's quarter. On title losses, total title loss expense for the first quarter was comparable to last year's quarter as the effect of higher title revenues was offset by overall favorable claims experience. As a percent of title revenues, the title loss expense in the first quarter was 4% compared to 4.6% in the first quarter last year. Employee costs as a percentage of operating revenues improved to 24% from 25% last year, while other operating expenses increased to 22% from 18% last year, primarily because of the increased size of our real estate solutions operations which typically have higher other operating expenses. Lastly net cash provided by operations for the quarter was $35 million compared to $47 million from last year's quarter, primarily due to higher payment of operating liabilities outstanding at the end of December, partially offset by the higher net income in the quarter. But a lot of our expenses probably a good 60% -- 50% 60% are variable right because they're all transactional you've got bonuses premiums taxes, different things like that data as we talked about. And it doesn't seem like that's shown up in your numbers yet in 1Q 2022 with purchase volume up 4% year-over-year, but I think any color on how 2Q is trending so far would be really helpful."
}