{
    "symbol": "STC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 23:38:04",
    "content": " After adjustments primary for net unrealized gains and losses on equity securities, which is equity sell off, our adjusted net income for the second quarter was $70 million or $2.58 per diluted share, compared to $86 million or $3.17 per diluted share in last year's quarter. Total final revenues for the second quarter increased $17 million, up 2%, compared to last year's quarter primary due to better results from our agency and commercial operations which is partially offset by lower residential revenues on reduced transaction value. The title segment's pre-tax income for the second quarter was $94 million, compared to $126 million prior-year quarter. Segment's pre-tax margin for the second quarter was 12.3% compared to 16.7% in the second quarter of 2021, primary due to the effects of the fair value changes in the equity securities, lower residential volume and the investments we are making to grow revenue, improved customer service and reduce title production costs, as Fred mentioned in his opening remarks. In regard to our direct title business, domestic commercial revenues improved $13 million or 25% as a result of higher transaction volume across most asset classes and a 17% higher than average fee per file of $13,100. Total international revenues in the second quarter was $4.0 million or 8% lower compared to last year, primary lower due to lower transaction volumes in our Canadian operations. Our agency operations generated in the only follow-up quarter with revenues of $410 million, 5% higher than last year. On title losses, total title loss expense in the second quarter decreased by $7 million or 21% from last year's quarter, primary due to our overall favorable claims experience, partially offset by higher total title revenue. As a percentage of total revenues, the title loss expense in the second quarter of 2022 was 3.5% compared to 4.5% last year. Regarding our Real Estate Solutions segment, which we began to break out last quarter, pre-tax income improved by $4 million compared to last year due to the acquisitions completed towards the end of last year. Employee cost as a percentage of operating revenues for the second quarter was 25%, compared to 24% last year, while second quarter other operating expenses were higher at 19% operating revenues, compared to 17% last year due to the increased size of our real estate solutions operations, which typically have higher other operating expenses due to third-party services. Lastly, net cash provided by operations for the second quarter was $83 million, compared to $103 million in last year's quarter primarily due to lower net income in the second quarter of 2022. I mean, it was up significantly from $2,200 a quarter ago but with predominantly purchase mix now and I think we have seen some home price appreciation, but just reading headlines and see what's going on in the product prices are definitely stabilizing effect coming in a little bit on your market."
}