{
    "symbol": "STC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 12:58:04",
    "content": " The challenges associated with higher interest rate environment increased materially during the fourth quarter as interest rates topped out over just 7% and we are planning for this difficult market to continue into 2023, and are managing our business with a balance of cost discipline and investing in skills and capabilities that will best position us for the long term. In the fourth quarter, we saw an additional material increase in the purchase market, ending the year at a 46% decrease in closed orders and a 44% decrease in open orders year-over-year for December, our lowest point of the year. After adjustments primarily from net unrealized gains and losses on equity securities and office closure, severance regulatory and litigation expenses adjusted fourth quarter net income was $60 million or $0.60 per diluted share compared to $84 million or $3.05 per diluted share in the fourth quarter of 2021. After adjustments for purchase intangible, amortization and other items listed in the appendix of our press release, adjusted pretax margin for the fourth quarter was 5.9% compared to 14.4% in last year's fourth quarter. Total open and closed orders declined by 48% and 51% respectively in the fourth quarter compared to last year, primarily due to the economic environment. Similar to our direct title revenues, revenues from our agency operations decreased $133 million or 30% compared to last year's quarter. On title losses, total title loss expense in the fourth quarter decreased $12 million, or 36%, primarily driven by lower title revenues. Fourth quarter pretax income decreased to $400,000 from $5 million last year, primarily due to lower transaction volumes resulting from the economic environment. Employee cost, as a percent of operating revenues, were 30% in the fourth quarter, compared to 23% in the prior year quarter, primarily due to lower operating revenues. Excluding office closures, regulatory and litigation expenses, the other operating expense ratio was 21% in the fourth quarter 2022 compared to 23% in the prior year quarter. Lastly, net cash provided by operations for the fourth quarter decreased to $25 million, compared to $133 million last year's quarter, primarily due to the lower net income in the fourth quarter of 2022."
}