{
    "symbol": "SMG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-03 16:19:12",
    "content": " I just think that if I'm going to give you a range of like $1.5, it's like we've -- I think we changed the guidance twice already this year. But again, we're hearing from customers that they actually have had a pretty decent last 4 weeks and you're starting to see wholesale prices drift up which I think we're kind of looking at is saying, it's a decent leading indicator. I think -- I warn people, don't look at the stock price too much because when it's bad, you'll think you're the dumbest dude on the earth. And I think it's just -- it's a lot more volatile, I would say, than sort of our consumer business which ultimately still gets me to the point where I think the -- and I think I know the opportunity is there. So just, I guess, elaborating on -- a little bit on what Jim said, look, obviously running the business when you're -- when the business is going through the kind of disruption it is right now is a lot less fun than when you're kind of posting consecutive 70% growth quarters over and over. So we're optimistic; it's tough managing through this and it forces us to make some decisions I wish we didn't have to make just to run the business more efficiently but the long-term outlook for -- I think, for us is still super positive and we're really excited about the business. I'm wondering how you're thinking about kind of the consumer behavior and this year being a year where there's more kind of ability to spend time away from home, returning to travel and experiences versus kind of locked up in and around your home and buying products that support that. Jon, it's a very fair question, I think, we ask ourselves, especially in the absence of data, because it just seems like -- this feels like if we're -- instead of May 1, it's like April 1 and we're trying to call the year. I think the biggest thing is if you believe us that we're sort of 3 weeks behind, it's like trying to be in April and call the year. Now back to this issue of garden, we're seeing -- I think it's at least the same weakness in live goods that we're seeing in our business. We -- comps are like 9% our friend right now, like minus 9% is what we're comping against compared to up to May 1, like plus 35%, I think, is what we had to comp against. We believe that -- as this industry matures, that the money will be earned with branded consumer products just like what we're in today and that we believe that eventually, I don't want to use bad language with the Congress of the United States but they'll get off their ass. And it's -- as you see that develop and you'll start seeing things happen, I hope soon, coming out of RIV, I think you'll start to understand more and more what it is we're trying to build. I think -- remember, Eric, if you look at sort of what's happened in the last like 2.5 years, the business is plus 30%, a business that we were saying like was 0% to 2%. And I think our go-forward view -- I don't -- listen, to be fair, I don't know that we have really developed a point of view of whether we're going back to a low single-digit growth rate. Eric, I think it's -- we look back on it, we're trying to like blame ourselves a little bit for this. Look, I'm not going to -- I don't want to get into next year because there's a lot -- Eric, I don't want to get into next year at this point because there's a lot of planning happening for that. Now if we're overcorrecting, I think that what Mike and I will feel better about is that we've created some opportunities for some younger people to have more stuff to do that will have a more snappy decision-making culture that I think is very important in parts of our business and that we'll be looking at a really impressive young group of people who've got a lot more responsibility in the company."
}