{
    "symbol": "SMG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-01 13:16:03",
    "content": " The announcement of a third pricing action in the consumer business that will take effect in the second half of the year; an increase in our full year sales guidance for the segment; some moderation, finally, in commodity prices; continued re-strengthening of our supply chain and has us well positioned to meet the demands for the upcoming season; restructuring efforts in Hawthorne that will make the business even stronger; and plenty of activity, including two more Hawthorne acquisitions in what is the most robust M&A pipeline we've had in 25 years. But I think people thought we pretty much were out front about saying, if we can just hang on to what we got and we grew -- I think units were up like 10% last year. But my concern and what I've told the team is what I'm thinking about here is kind of the trend that we end this year on, and I'm pretty confident that we're going to end it on an upward trend, again, as we see this oversupply sold through or destroyed because it is perishable. And Chris, I want to just throw out, again, my own view, whether -- I think this is -- I would be generous, I think, in calling it an immature market where there's just -- I'm going to get rich. And so I think if you can logically look at what's going on there -- but I think if you look at the franchise of Hawthorne, I think it's just a much more diverse and strategic business for this industry than somebody who is effectively a distributor. So I would say those are the kind of key --\n Well, Chris, I think the important part of this is this big shift over to LEDs from the sort of old sort of -- I’m not going to call a metal highlight because then people will yell at me. But getting back to profitability under the current circumstances for this year, when you look at the market conditions and you layer on top, the fact that we’ve doubled our distribution center footprint, that we’ve increased head count pretty significantly just to match the scale and the growth of the category over the past few years. On the capital side, I think what we said is figure like -- or at least what we're talking internally is like $200 million a year for some years, I don't know, 3 to 5, I'd say, something like that. I’d just add to the point that when you look at our margins, there’s going to be 2 main components to make sure that we can get back to a margin rate that is kind of flat to last year. I mean I think that business -- all online sales for us, it goes in Pattie's category, which is our direct-to-consumer, I think you're getting up to like $300 million or maybe more."
}