{
    "symbol": "DBGI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-16 10:07:01",
    "content": " Net sales excluded $0.4 million in deferred revenue, which is associated with the timing of when customers' orders were placed versus when they were shipped in our men's custom business. If you take a brand like Sundry that has several hundred thousand, if not 1 million e-mail customer people on their list and to be able to drive them to their site and acquire a customer for $15 when on average, they are spending $280, both the CAC and the LTV for our business is incredibly high, and this is the power of our model right here is that we can drive down CAC, we can drive up LTV, we can cross merchandise across the brands as customers add multiple brands to a cart. Loss from operations was $2.6 million versus $7.9 million a year ago, which is a decline of $5.3 million from a year ago, which again shows the leverage we're getting on our business and that we expect to continue to get especially with our Q1 wholesale bookings coming in. As you can imagine, one of the big things that's happening in this world is, especially with the Apple iOS privacy and also with the department store shrinking in the wholesale channel, which we don't have a lot of exposure to, as you're seeing that these brands are leading to what they call platform or come together to actually really drive growth or survive. And that if we could come into a portfolio of PE or VC brands and bring this expertise and wrap all their brands up in there and then go public nine months later or a year later at $500 million in revenue, then there's a massive arb for them. But if we're not also going to get credit for building a $50 million, $90 million, $125 million revenue business over the next nine months, there's not really a reason to be in the public markets, especially if we're going to trade at $2.5 million to $3.5 million of market cap. And I think that's why we've got a lot of interest in how to platform these companies, strip out cost, both just from an OpEx perspective, but also from a marketing DTC, lowering the CAC significantly, driving LTV, which is really critical in the world we're in today."
}