{
    "symbol": "PNFP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 14:59:04",
    "content": " So, as you think about the speed and reliability of our growth, which is largely dependent on taking share as opposed to economic loan demand, this explains why we've been so successful taking share over the last 20 years, why we grew loans 20.9% on an annualized basis this quarter, why we grew core deposits 9.8% on an annualized basis this quarter, and why I believe will continue to produce outsized growth for the foreseeable future. Okay, I guess I'm just trying to think about where loan growth -- what kind of loan growth expectations you have in 2023 relative to those deposit beta expectations because it would seem with your offense guidance, if it's going to be high teens again, we might be looking for high teens growth again. I think going into next year and the -- just looking at the net interest margin if it -- historically if it responds the way it has done in the past, we're anticipating that as the Fed stops raising rates, that the left side of the balance sheets yields and rates will likely start topping off, and that the deposit lag will likely be in effect through that time. I don't think it would be unreasonable to assume that next year's growth rate might be somewhere around a 15% number, something like that. But it's been a while I think, since you've kind of entertained the thoughts of maybe doing a whole bank transaction and just wanted to see given the dislocations that some banks are going to have and some of the credit issues that I think we're going to see, is that an avenue that you could potentially open up again, as we think about the next couple of years. Catherine, your line is live. But -- again, I think we're not -- for me to say, we expect things to normalize, I just want people to understand I don't think we're going to be operating at the level of classified assets and non-performing assets that we've been at over the last handful of quarters. Catherine, your line is live."
}