{
    "symbol": "PNFP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 17:09:09",
    "content": " In addition to all the macro issues that have created very – of economic uncertainty then she also had a number of other headwinds like around the laws of PPP revenues, loan pay offs like substantial reduction in mortgage loan originations during the right movements pretty well eliminated the robust mortgage refinance market we’ve enjoyed several years just to name a few. For the first quarter and including 30 days, they incremented our loan growth by $386 million or 35% of our 1Q 2022 ELP loan growth and we expect strong participations from our new markets in the second quarter as well. The full impact that onboards the issues, the inflation, inverted yield curve, and a potential recession aren’t yet known, but our funds thus far as Harold has already mentioned is really been safe to protect our tangible book value that had a number of targeted loan portfolio reviews including our COVID impact and commercial real estate portfolios and heightened our diligence on cyber security and fraud detection. If I know mention two new specialists for equipment finance franchise lending both less than a year, you can see that like the other markets, we’ve had strong hiring and really rapid loan growth. This is a chart that’s really important to me, normally it gets relegated to the fact that we haven’t addressed it on the call for a few years, but the reason it’s important to me is because, first and foremost, we are an earnings per share focused company and our path to produce that earnings growth is through revenue per share, sustainable revenue per share through franchise creation, not expense cutting. Yes, well, I think the advantage we got here in the near term is that we anticipate a 50 basis point increase in rates from the Fed and so that’s going to take little over $2 billion in loans out from their floor and put them back on what’s in other coupon is that. And so, it’s a stable balance sheet or – and a parallel shift in the curve and all those got assumptions that go into it and it really lacks a lot of creativity and a lot of ingenuity that we are always thinking about around here to improve both the earnings content of our firm as well as what we think our growth is going to be. Hey, good morning guys. Hey, good morning guys."
}