{
    "symbol": "YMAB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 21:11:16",
    "content": " While DANYELZA's product revenue have increased quarter-to-quarter since we launched, they came in at $9.8 million in the second quarter of 2022 which corresponds to a 7% decrease from the previous quarter. However, our DANYELZA revenues came in at $9.8 million in the second quarter of 2022, a 7% decrease, as Thomas mentioned, from the previous quarter, caused by a slight decrease in new U.S. patients earlier in the second quarter, but again partially offset by the rebound in June and continued through July. Our net revenues of $10.8 million and $21.3 million for the quarter and six months ended June 30, 2022, represented a decrease of 1% and an increase of 30% respectively over $11 million and $16.3 million in the comparable periods of 2021. Net revenues in the quarter and six months ended June 30, 2022, includes $1 million worth of license revenue compared to $2 million worth of license revenue in the corresponding periods of 2021. DANYELZA's product revenues for the quarter and six months ended June 30, 2022, was $9.8 million and $20.3 million respectively, which represented increases of 9% and 42% respectively over the corresponding periods of 2021. Our DANYELZA product revenues of $10.8 million in the second quarter decreased 7% compared to the first quarter of 2022, net revenues of $10.5 million. The decline included a slight decrease in new U.S. patients earlier in the second quarter, partially offset by a rebound in June and July, while international revenues benefited from increased wealth income from partners sales offset by a decrease in volume due to the timing of partner orders. Moving to the operating expenses, our R&D expenses increased by $6.6 million and $8 million to $26.4 million and $49.3 million for the quarter and six months ended June 30, 2022, respectively. These net increases in the quarter and six months ended June 30, 2022, reflected increased outsourced manufacturing inclusive of $2.9 million of naxitamab inventory by us that were designated for clinical use during the three and six months ended June 30, 2022. SG&A expenses increased by $9.6 million and $11.1 million to $23.1 million and $36.5 million for the quarter and six months ended June 30, 2022. The increases in SG&A expenses in both periods were primarily the result of $10.7 million charge related to contractual severance related benefits for our former Chief Executive Officer, which were inclusive of $1.4 million of compensation-related accruals and $9.3 million of non-cash share-based compensation expense, and, to a lesser extent, the launch and commercialization of DANYELZA, which include employee-related costs and commercial expenses. We reported the net loss for the quarter ended June 30, 2022, of $41.1 million or $0.94 per share basic and diluted compared to a net loss of $22.9 million or $0.53 per share basic and diluted for the quarter ended June 30, 2021. Additionally, we reported a net loss for the six months ended June 30, 2022, of $69.2 million or $1.58 per share basic and diluted compared to a net income of $10.5 million or $0.25 per basic share and $0.23 per diluted share for the six-months ended June 30, 2021. The net income in the six months ended June 30, 2021, included a $62 million gain from the sale of our DANYELZA Priority Review Voucher, after sharing 40% of the net proceeds from the sale with MSK as per the license agreement. The decrease in earnings in the six months ended June 30, 2022, also reflects the unfavorable impact of the charge related to contractual severance related benefits for our former Chief Executive Officer, and increased R&D expenses, as noted above, partially offset by the favorable impact of DANYELZA's growing revenues. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}