{
    "symbol": "YMAB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 11:08:09",
    "content": " Such statements include, but are not limited to, statements about our business model and development; commercialization and product distribution plans; current and future clinical and preclinical studies, and our research and development programs; expectations related to the timing of the initiation and completion of regulatory submissions; regulatory, marketing and reimbursement approvals, including statements with respect to future development of other development programs, potential for DANYELZA territory expansion and advancement of SADA; collaborations or strategic partnerships and the potential benefits thereof; expectations related to our anticipated cash runway and the sufficiency of our cash resources; DANYELZA revenue guidance and other guidance for 2023; and our financial performance, including our estimates regarding revenues, expenses and capital expenditure requirements; and other statements that are not historical facts. First and foremost, DANYELZA sales picked up notably, and we are proud to report record net product revenues in Q4 of $16.4 million, up 31% compared to Q3 2022. Further, we received a $15 million approval milestone from SciClone Pharmaceuticals, as DANYELZA was approved in China in the fourth quarter, resulting in a net profitable quarter for the company. After the implementation of this plan, we expect that our $105.8 million in cash and cash equivalents as of December 31, 2022, when combined with anticipated DANYELZA revenues, will be sufficient to support our business operations as currently planned into the first quarter of 2026. As I mentioned, our DANYELZA net revenues for the fourth quarter increased 31% sequentially from the third quarter '22, primarily driven by an increase in new U.S. patients as we are starting to see the positive results from a successful execution on our 2022 strategic development plan. Having reported net DANYELZA revenues of $49.3 million for the full year of 2022, we are pleased to note that we landed nicely at the top of the end of our full year 2022 DANYELZA revenue guidance of $45 million to $50 million. Thank you, Thomas, and good morning, everyone. As you know, we established a partnership with SciClone Pharmaceuticals for DANYELZA expansion in Greater China, we are especially excited about the regulatory approval for marketing in China that took place in December 2022, which triggered a $15 million regulatory milestone to Y-mAbs. Thank you, Thomas, and good morning, everyone. Our net revenues of $31.5 million and $65.3 million for the fourth quarter '22, for the year ended December 31, '22, represented increases of 228% and 87%, respectively, over $9.6 million and $34.9 million in the comparable periods of 2021. Net revenues in the quarter and year ended December 31, 2022, included license revenues of $15 million and $16 million, respectively, compared to no license revenue in the quarter ended December 31, 2021, and license revenue of $2 million for the year ended December 31, 2021. During the three months and year ended December 31, 2022, we recognized license revenue for a regulatory approval milestone of $15 million from SciClone Pharmaceuticals for the conditional approval of DANYELZA in China. DANYELZA product revenues for the quarter and year ended December 31, '22, was $16.4 million and $49.3 million, respectively, which represented increases of 71% and 50% over the corresponding periods in '21. DANYELZA net product revenues of $16.4 million in the fourth quarter of '22, increased by 31% sequentially compared to the third quarter of '22 of $12.5 million. Our R&D expenses decreased by $8.9 million to $19.8 million for the quarter ended December 31, '22. Our R&D expenses decreased by $1.6 million to $91.6 million during the year ended December 31, '22, compared to the prior year. SG&A expenses decreased by $4.3 million to $10.8 million for the three months ended December 31, '22, compared to $15.1 million for the three months ended December 31, '21. The decrease in SG&A was primarily the result of a $1.8 million decrease in costs related to the commercialization of DANYELZA, primarily related to increased launch costs in the fourth quarter of '21. Our SG&A expenses increased by $6.3 million to $60.9 million for the year ended December 31, '22. This increase in SG&A was primarily attributable to a $7.8 million increase in severance and share-based compensation expense related to the termination of our former CEO in the year ended December 31, 2022. We reported a net income for the fourth quarter ended December 31, '22, of $1.2 million or $0.03 per share basic and diluted compared to a net loss of $36.9 million or $0.85 per share basic and diluted for the quarter ended December 31, 2021. Additionally, we reported a net loss for the year ended December 31, 2022, of $95.6 million or $2.19 per share basic and diluted compared to a net loss of $55.3 million or $1.28 per share basic and diluted for the year ended December 31, 2021. Net loss in the year ended December 31, 2021, was after a $62 million net gain from the sale of our DANYELZA Priority Review Voucher."
}