{
    "symbol": "BHR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 11:45:31",
    "content": " First, our luxury resort portfolio continues to outperform and help drive comparable hotel EBITDA of $40.7 million for the quarter, an increase of 23.5% versus the comparable quarter in 2019. Additionally, RevPAR for all hotels in the portfolio increased approximately 19% for the third quarter of 2022 compared to the third quarter of 2021, which also represents an increase of approximately 19% when compared to the third quarter of 2019. We continue to be encouraged with the ramp-up of our urban hotels, which generated $15.7 million of comparable hotel EBITDA in the third quarter. Adjusted EBITDAre for the quarter was $34 million, which was 19% higher than what we reported in the third quarter of 2019. I am also pleased to report that during the third quarter, we issued approximately 5 million shares of our Series E and Series M non-traded preferred stock, raising approximately $114.5 million in net proceeds. And since the end of the third quarter, we have issued an additional 1.6 million shares of our Series E and Series M non-traded preferred stock, raising approximately $36.3 million in net proceeds. The outperformance of this portfolio during the third quarter is evident when you contrast our portfolio to the market as a whole with the U.S. luxury chain scale having only increased 9%, in the upper upscale chain scale having only increased 1% over comparable 2019 RevPAR levels. Group room revenue for the full year is pacing ahead of 2019 by 2%, with the third quarter actualizing ahead of 2019 by 12%, the collective lead volume for the portfolio has improved every quarter this year compared to 2019, and we are seeing a much shorter booking window relative to 2019, which bears with it the ability for more nimble pricing strategies. Overall, during the third quarter, Mr. C has exceeded comparable 2019 RevPAR by 3% and has driven group room revenue by more than 45% relative to 2019. One of the record-breaking hotels with the Park Hyatt Beaver Creek where total revenue for the third quarter was higher than any other third quarter in the history of the hotel, finishing 5% above comparable 2021, which was the previous record year. A large component of the successful quarter was our group segment, where we had approximately 8,300 group room nights, which was a 19% increase to comparable 2019."
}