{
    "symbol": "BHR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 15:45:21",
    "content": " Good morning, and welcome to today's call to review results for Braemar Hotels & Resorts for the second quarter of 2022 and to update you on recent developments. First, our luxury resort portfolio continues to outperform and help drive comparable hotel EBITDA of $57.4 million for the quarter, an increase of 42.7% versus the comparable quarter in 2019. Second, we continue to generate strong cash flow with approximately $27 million of cash flow generated in the second quarter after CapEx and preferred dividends. Additionally, RevPAR for all hotels in the portfolio increased approximately 43% for the second quarter of 2022 compared to the second quarter of 2021. Most encouraging, our urban hotels generated $20.3 million of comparable hotel EBITDA in the second quarter compared to negative $0.1 million in the first quarter. I would also like to mention that the Ritz-Carlton brand, which includes 4 hotels in our portfolio representing over $93 million or approximately 50% of our TTM hotel EBITDA, was recently named the #1 rated luxury hotel brand for the second consecutive year by J.D. For the second quarter of 2022, we reported net income attributable to common stockholders of $10.3 million or $0.12 per diluted share. Adjusted EBITDAre for the quarter was $50.1 million, which was 53% higher than what we reported in the second quarter of 2019. As Richard mentioned, our comparable hotel EBITDA during the quarter was $57.4 million, after taking into account debt service, G&A costs, advisory fees and other corporate costs, preferred dividends and capital expenditures. I'm also pleased to report that during the second quarter, we issued approximately 1.6 million shares of our Series E and Series M non-traded preferred stock, raising approximately $37.6 million in net proceeds. We are also pleased with the recovery of our urban assets, with their second quarter hotel EBITDA having recovered 92% relative to comparable 2019."
}