{
    "symbol": "BUR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 16:20:07",
    "content": " As usual, I'm joined by Jon Molot, the Chief Investment Officer; and Ken Brause, the Chief Financial Officer. We promised to do that somewhat more briskly than we did in our annual results call, and then we'll be happy to take any of your questions. Before we jump into the meat of the slides, I'd also -- I'm also happy to report in addition to our earnings on an announcement that we also made today about a new appointment to our Board. And this is a particularly exciting appointment as Dr. Rukia Baruti, who is an experienced arbitration practitioner and the Secretary-General of the African Arbitration Association. So not only is Dr. Baruti a very experienced and knowledgeable lawyer and arbitration specialist, this represents not only another woman, but a racially diverse candidate to our Board. For example, this is already the breaking news story, the top new story on Global Arbitration Review today, which is the leading arbitration publication out there. So in terms of Burford's corporate presence, she's a great addition to the Board as a Non-executive Director. Fundamentally, we're going to talk about two key issues as we always do. The new business that we create, which ultimately sets the business up for future profitability and then the progress of that business through the pipeline, through the investment process and, ultimately, the creation of cash gains from it. On the new business side of the ledger, we were very pleased with the first half. And as a reminder, Burford-only commitments are the number that we watch the most closely because those are the commitments that will ultimately drive the largest volume of shareholder profit. We provide statistics for our overall level of activity, which includes the work that we do in some of our lower-returning funds, for example, just as a measure of what the whole business is up to. And so hitting a new record in new business, even while the legal industry is still recovering from the pandemic and figuring out how to work in a new way, made us very happy. It's also the fact that we've been able to keep up that new business at a strong pace throughout the pandemic, writing quite a lot of that new business. And part of the dynamic here, as some of you will recall, is that we tweaked our arrangement with our sovereign wealth fund partner so that now the Burford balance sheet is taking 75% of new deals instead of the prior 50%. So the other thing that we saw with great excitement, candidly, is that court activity really did start to resume during the period. Our consolidated income from doing litigation finance, our core business grew 31% period-over-period. But what that really represents for us is a sign of life in courts that in many instances have been somewhat more abound and affected by their ability to hold, especially in-person trials during the pandemic. In the text of the interim report, we gave one -- just one example of how great that  can be. In the Eastern District of New York, which is the federal court district that serves Brooklyn and other parts of New York City, except Manhattan, you're still at about a 55-month wait to get a case from filing to trial, whereas in the northern district of Florida, so the north part of Florida, that delay has really fallen sharply, you're down to not much more than a year. The other things I'd note, just on the P&L side, in addition to the activity that we saw in the first half, we've also seen some post-June 30 activity. And that -- even though none of this is in our June 30 numbers, we would expect all things remaining equal to generate more than $50 million in consolidated profit during the second half from that portfolio activity. And then we have a meaningful discussion in our interim report about some -- like many other companies, some noncash items that affected our bottom line profitability for us, a combination of noncash charges and foreign exchange, some interest rate impact, again, noncash and unrealized and some tax peculiarities. The other thing is that we have this sort of unusual split of foreign exchange where we actually had negative foreign exchange activity in the top of the P&L, so above the net income line. And then we had quite positive foreign exchange activity because of our sterling debt in the bottom part of the P&L, below net income, hitting just comprehensive income. If that bottom line stuff had been above the line, that would have added another $35 million or so to net income. So there was a fair bit of foreign exchange activity, again, all of which is noncash. And then in other developments, we've raised money $1 billion of external capital this year between a combination of the new debt offering and two new funds that we closed. So on the -- both on the fund side, we have significant financial resources there. And finally, the simple and somewhat unfortunate reality perhaps for the world at large is that economic distress tends to yield a lot of litigation, insolvency and other litigation, and we're going to, we believe, start to see the impacts of increased interest rates and the decline in government stimulus. That's been growing even during a pandemic, we've got about a five-year -- a five-year 20% CAGR there. So even though we've been able to grow the business significantly, more than doubling the portfolio in size from 2017, we have been able to do so while maintaining those consistent returns that we've been very proud to be able to deliver. That shaded area is because we did a deal towards the end of June, a fairly large law firm deal that still has a couple of closing conditions left to satisfy before we actually put the cash out the door. But it's a -- it will be that deployment, presuming that those closing conditions are satisfied soon. And then finally, I often, as you know, talk to Slide 6 and 7 together and I'm not going to spend much time on them. I would just highlight for you that when we talk about the returns that we've been able to generate and we talk about our track record and our performance of generating high and asymmetric returns, we're now doing that off of almost $2 billion of cash recoveries. And I would just emphasize that all of the numbers that we're providing here are cash-based numbers, there's no accounting for value in any of these. Thanks, Chris, and thanks to you all for spending time with us today. On Slide 8, we talk about the timing and process of YPF matters. If you're a lawyer or you have lawyers working with you, I'd encourage you to just read the brief. The substance is pretty clear if you can wade through all of them because the defendants threw in a lot, but I think it is clear. Summary judgment motions were filed in April, but both sides, that is defendants filed a motion saying that -- asking the judge to enter judgment for the defendant without holding a trial. If she grants summary judgment in full for the plaintiffs, although there will be a right to appeal, the defendants, if they do not post a bond or obtain a stay of execution will be subject to enforcement proceedings. Plaintiffs will be able to begin enforcement following the entry of a final judgment, absent one of those things. If the judge enters summary judgment for the defendants, there'll be a right to appeal and it is de novo review. If there is a trial, the parties have stipulated that the trial shall happen 115 days after the issuance of the summary judgment decision. Turning to Slide 9 to give a little more granularity on what Chris described before about the rest of our portfolio, you can see in those red bars what percentage of each vintage of our investments has resolved. And not surprisingly, the older earlier vintages have had a much larger percentage resolve and the younger vintages, the more recent ones have had a smaller percentage of their cases resolved. If you look at the black bars, this echoes what Chris talked about, the explosive growth that we enjoyed some years ago and the pace we've been able to continue to put out capital. So it stands to reason that in the coming years, we will expect resolutions from vintages that are larger and have more outstanding. And the weighted average life of our concluded portfolio by realization at least, has remained relatively steady over the past few years, but we'll talk a bit more about delay. And remember, whereas the rest of the world always wants to move forward and not have the legacy of COVID hold them back, defendants always have an incentive to delay matters. And therefore, to the extent that they can use backlogs or COVID or something as an excuse, they will use it, but courts have been much better about moving things along. And we also have mentioned in the past, sometimes the extension of timing can actually enhance our returns that our deals may be structured to increase our percentage or our multiple as time goes on. Meanwhile, the fact that there are economic challenges and disruptions that Chris alluded to, that were associated either with COVID or with the withdrawal of government subsidies in the aftermath of COVID, that does potentially lead to opportunity for us that we see because people don't chew each other when things are stable and going well and growing and deals succeed, they chew each other when something goes badly. So we're poised right now with, as I mentioned, a very large portfolio of recent vintages that we've been able to continue to put out, right, other than that blip in the first half of 2020 when the world shut down and we slowed down, we've continued to commit and deploy capital throughout the period. And with that qualitative discussion of the business, I'll then turn it over to Ken to go over the numbers. And just before I get started, I just want to make it clear that all of the figures I'm going to discuss are on a Burford-only basis unless I state otherwise. That was primarily driven by growth in net unrealized gains, which represented 71% of total capital provision income and is indicative of the increase in court activity. And asset management income rose, I'm going to provide more detail on that topic shortly. Operating expenses declined from the first half of last year, which, as you may recall, included $34 million primarily related to the conclusion of an asset recovery matter. And these all contributed to a meaningful improvement in operating income, which was $27 million compared to a small loss in the first half of last year. For one, finance cost increased primarily as a result of having a full reporting period with the debt that was issued in April of last year as well as running with temporarily higher debt balances this half, given the timing between our new issue in April of this year and the repayment of the debt that was due in this month that we repaid in May. And in what may seem like a bit of an anomaly, although we reported a pretax loss for the period, we reported income tax expense of $8 million as we maintain a full valuation allowance on the deferred tax asset that's related to disallowed interest expense for U.S. tax purposes. And while we do our best to minimize the economic impact of currency fluctuations, the strengthening U.S. dollar did have a negative impact on our bottom line as it did for many other global companies, but had a benefit in comprehensive income. $7 million that was within capital provision income that generally reflects investments in currencies other than the U.S. dollar or sterling and the rest was in other expense, which represents cross-currency transactional items. Those above the line costs, however, were more than offset by a $35 million benefit from foreign exchange translation and other comprehensive income, OCI, largely related to our sterling-denominated debt. So putting it all together, we reported a first half net loss attributable to Burford Capital Limited shareholders of $21.5 million or $0.10 per diluted share, both of which improved from last year. And despite the reported loss, tangible book value per share rose slightly from year-end to $6.48. We continue to have success as an asset manager, both in terms of capital raising and income. We closed two funds in the first half, the $360 million Burford Advantage Fund, which focuses on pre-settlement matters and the $350 million Burford Alternative Income Fund II or BAIF II, as we refer to it, which is the successor to our previous post-settlement funds. And as Chris mentioned, we also extended to the end of next year, the investment period for BOF-C, our pre-settlement strategy arrangement with our sovereign wealth fund partner. That agreement also shifted the asset allocation from an even split to one in which we now allocate 75% to our balance sheet, thereby increasing our portion of these highest returning assets. Asset management income for the period increased by 45% to $17 million, up from $12 million in the first half of last year. But since BOF is now past its investment period, our management fee rate on that fund has declined, and we recognized performance fee income of $2 million from BAIF, of which we had none in the first half of '21. So going forward, we continue to be in a position to earn management fees from BOF, BAIF II and the strategic value fund; performance fees from Partner Funds II and III, BOF and BAIF I and II and additional asset management income from BOF-C and the Burford Advantage Fund. And as we mentioned on our call in March, our models at year-end '21 indicated that performance fees could be as much as $400 million on the Burford-only basis. Total operating expenses in the first half declined from the prior year period, primarily due to the large asset recovery charge last year. Most other operating expense categories were straightforward and largely unchanged, with the only notable increase, which was a modest one at that, in case-related expenditures that were ineligible for inclusion and asset costs. We continue to actively manage our liabilities, and we maintain our long-held view that while our business should have some leverage, given the variability of our cash flows, it's prudent to maintain it at a relatively low level. We issued $360 million of senior notes that had an 8-year maturity and a coupon of 6 and 7/8% in April, just before the fixed income markets became particularly challenging. We reduced interest costs and negative carry, but did report a small loss on debt extinguishment, reflecting the modest premium paid for the redemption. All in all, that 2020 bond proved to be a very attractive one for us with an effective cost of less than 3%. And for our U.S. bond covenant, which is total debt to tangible equity, we are currently at 0.9x, also well below the incurrence test levels of between 1.5x and 2x depending upon the type of incurrence -- incurrent, sorry. Our liquidity position increased to $430 million at June 30, up from $315 million at year-end and consists of just over $300 million of cash and equivalents with the remainder in marketable securities. The increase in liquidity was predominantly due to net proceeds from the debt transactions I just mentioned, offset by deployments that were in excess of realizations in the half. And we are positioned well to continue to deploy against new opportunities, including for the large commitment we made right at the end of the period that Chris addressed. And the yield on the marketable securities portfolio is now about 3.7%, which puts us in a position to earn attractive returns on this excess liquidity. And as Jon and I have both said, we're excited to see the forward progress happening in the courts as they work to clear their pandemic backlogs and get things back to working as normal and we're excited about what lies ahead. And so with that, we are happy to take your questions, which can happen both verbally on the phone lines and also by submitting them through the chat function in the webcast. While we wait for the operator to organize the phone lines, I will then take a couple of questions that have already arrived from the webcast. To begin, this is from  who asks the court systems you use must have a huge backlog of cases and there must be some pressure to deal with these. And before I turn it to Jon for his thoughts on that, I would just say that what we are seeing is a real diversity of approaches to deal with these issues that are really all over the map. And you saw an example of this in a case that we talked about at the end of last year, where we had a case that was -- still would have needed to wait for a long time to get a trial date. And so he put quite a lot of pressure on the parties to go into mediation, which ultimately produced a settlement in the case long before it would have been up for its trial slot. I think on our end, the main thing is to make sure that our counterparty clients and law firms have a plaintiffs mindset where they are the claimant, meaning that when defendants asked for extensions and delays and postponements, you just have to very rigorously oppose those and keep things moving. And it sounds like we might be ready with the phone questions, or perhaps it's not. Are you seeing any signs of a rush to enforcement by U.S. beneficiaries of other judgments against Argentina in advance of a ruling in Petersen, which might reduce the ability to collect in the Petersen case? The answer to the second question is no, we're not seeing that at all. As to the first question, and Jon Molot can certainly might come up and fixed as well. And so what summary judgment is for, whether you're a plaintiff or a defendant is to resolve as many issues as you can as a matter of law before you need to go to trial. And so it's not surprising at all, and it has always been expected that both sides would see summary judgment. We'll see if the judge may decide that the trial is needed, but it's not a surprise at all, as Chris said, that both sides move for summary judgment. And that, while on the one hand, that might seem lovely because it means that we are also very selective and so on. One is that it obviously takes quite a lot of effort and therefore, cost to winnow through that large volume of stuff that comes in the top of the funnel. So we actually spent quite a lot of time -- even though it sounds possibly counterintuitive, we actually spent quite a lot of time trying to narrow the funnel. What we perceive of as the likely economic outcome of the case, the settlement value of the case or the realistic amount that the court is going to award in a judgment that we're going to be able to collect. And I would just add one positive thing, which is I do think the quality of our counterparty is very important. And I think that probably is a positive development, meaning today, there are companies and law firms that some years ago would have seemed like they were not going to look for our financing or need our financing that now are calling us for financing. And then a question on the agreement with the sovereign wealth fund, how Burford is now retaining 75% versus the 50% previously. Yes, it's the latter, really. And what motivated us, as you say, was with the incremental balance sheet capital that we have been able to access, it was a desire to maximize the returns on that capital for equity shareholders. The other dynamic at play with the sovereign wealth fund is that even though that's quite a large pool of capital, it was significantly committed at this point, but it -- there is a gap because of the COVID slowdown, there's a gap between commitments and deployments and therefore recoveries in that fund. And so by reducing the sharing mechanism to 25%, we basically got some more diversity into what's left of that portfolio and also extended its life a little bit. Jon, you mentioned about the weighted average life remaining kind of steady. Yes, that's right -- and that's right, and it's sort of hard because the dynamics go in both directions. On the one hand, you'd expect to see a lengthening in weighted average life's from their current level because of the pandemic. So for example, the partial resolution that I've already described in one of our large matters that happened last month, that all happened pretty quickly. And as Jon said, we don't have a forward-looking projection for it. I have two, if that's okay. But if you look at that, if you take the large matters as potentially illustrative, you're obviously going to see -- there's obviously a multiple of individual matters compared to what we call assets. But I don't know off the top of my head out of the, let's call it, 200 assets that we have in the Burford-only portfolio, I don't know how many individual claims they amount to. As to the characteristics of the cases that did have some fair value change and just for everyone's benefit, what Julian was referring to there is the fact that we had in the period, in the six-month period, 20 matters pass through a milestone that under our valuation policy triggers a change in their carrying value based on the court activity. It's not sentiment or judgment, but it's a data-driven formula that we use. The things that trigger a change, there has to be a court action in most cases. So the thing that's going to trigger a change is a case going, for example, going past summary judgment would be one meaningful change in the life of the case. So the parties filed some of the judge motions just has occurred in Petersen, the court decides them, and that decision almost always has a meaningful impact in the party's assessment of where the case is going and the party's willingness to settle and so on. We actually, in a footnote to the financials have a table that shows the individual points in cases that cause valuation changes and we show what percentage of the portfolio, what percentage of the fair value changes are represented by each of those stages. First one, if I may, is on the Petersen case and the oral arguments, that seems to have been a sort of a recent addition to the time line to the pack. And I mean, surely, if the defendant is trying to postpone everything shortly, they're going to appeal to oral arguments. There are some who will say, once I have the briefs and I've read them, I'd like to hear from the parties and I'll hold oral argument before I start writing my opinion. Other times, the court will say I want to get fairly far along with my opinion to realize where I have questions and where I've made up my mind and don't need more information, so I know what -- that I can make the oral argument useful. So it just depends -- I mean, maybe that it's not just different from court to court, it could be the same judge in two different cases, may do it differently depending on the matter. So I don't think you can read anything into that, and the timing of the oral argument doesn't necessarily reflect the pace of work by the court. Basically it's -- the only thing that is appealable is the final judgment of the court, the court issues. So the court -- a defendant could try to postpone scheduling and say, I have a conflict that day. But if a court says, I'd like you to show up in my court room on this date and the parties working together and they find a date fairly close to that, the court might say, okay, but I don't think you can say no when the court says, I want you to show up in my court and argue. Well, I mean, we've had circumstances with very minor motions in this case where there's very little notice, a few days. I think for briefing this long and dense, I think that it would -- the court would want to give the parties several weeks would be my expectation. You said in the presentation that you've seen the rate of cases picking up now, rate of court activity, I should say, picking up. So you can tell how many cases are being filed, which is actually at a comparatively low level right now. The challenge with that data, while it is instructive on one level, the challenge with those data are that they are not specific to the kinds of large dollar complex commercial litigation that we finance. In other words, courts do more small matters than they do large matters. It's not necessarily instructive, but it's a useful data point. That kind of data does not exist as easily, if at all, in U.S. state courts or in the courts of most other countries and nor does it existing arbitration proceedings. And so since we finance things all over the world in a variety of fora, there is not a clear -- there's not an easy statistical thing to look at and say, oh, look, we're seeing doubling of the throughput in 2022 compared to 2020. Anecdotally though, we obviously know that jury trials are resumed in courts and we know that jury trials were not happening previously. Can you make any -- I mean, focusing on cash proceeds and cash wins and realizations and such like. Clearly, it's been pretty slow in the first half. We showed and Jon, at our Investor Day made a long presentation and unveiled the internal projection activity that we do the internal modeling that we do. And one of the things we said then and have been clear about is while we have a pretty good track record in being able to model outcomes, we don't have that same ability to model and project duration. But on the other hand, if this business were entirely predictable as to both duration and outcome, then we wouldn't be able to generate the returns that we can, I think, is the countervailing factor. the math that you expect to deliver a $50 million profit in the second half, I'm just wondering, obviously, reasonable size. How does the $50 million fit in relation to its presence in the $2.2 billion, is the first one? I'm not sure, James, that I'm entirely following your question other than to say that it's a part of it, but I suspect you're asking something more thoughtful than that. What I'm asking is, is it greater or lesser than the expected value of that case in the expected realization number that you've provided us or a million or about $50 million is what I'd like to know. Yes, I think the way I'd sort of characterize it is, some years ago, I think we did start providing disclosure on as all the matters have gone through the process and led to a realization where in the process fair value changes happened and then what was left for realization at the conclusion. And as Chris said, we found that much more of the fair value adjustments happened because there were more significant events later in the lifecycle closer to the end, but not all of it. And actually, that was so much the case that, as Chris said, we've tried to take out some of -- as much discretion as possible and just make it pretty rote that you get by a motion dismiss, this is what happens. And that is because in keeping with our past experience when we had used numbers roughly like the ones that are now the formulaic ones, we found that things did move through the process and lead to some fair value gains along the way and left some realizations for the end that weren't captured in those fair value gains on a fairly predictable basis. We can't predict for any one matter, as Chris said, but over the portfolio, I have no reason to think those 20 matters are different from the many more that have resolved before that. So our asset management strategy is to use our third-party funds business as a way of, generally speaking, having line extensions of our core business. So we have different funds that target different levels of risk and return, and those are appealing generally to different kinds of investors as well. We've been successful in growing the private funds business, but we launched successfully two new funds, closed two new funds this half period. There is an institutional sense in the private funds business that even if you can generate high returns, you shouldn't be paying more than a traditional June '20 style set of economics and we just don't think that set of economics is very desirable in some elements in this asset class. You've seen us do that more recently with the Advantage Fund, where instead of a traditional management and performance fee arrangement, we'll do better than two and 20 economics if we can generate a return more than 12% or 13%. And so that's not only more efficient to put out more capital in one chunk with underwriting, but it also has just tended to result in better outcomes. And in terms of the question about the competitive dynamics in smaller versus larger, we have found that when there have been new entrants over the years, and I haven't really noticed an influx recently, they have started at the smaller end of the market, and they have not been institutions of Burford's caliber and have had a harder time providing a full-service solution to the large companies and leading law firms that are on lifeblood. As I said earlier, we've expanded geographically, we've expanded our range of offerings and the counterparties who are interested in our capital have expanded as well. We're going to be able to make it to every webcast question, but we -- I'll squeeze one last one in. One is -- and this is really quite important, and we get this question a lot. When you're a sovereign debt holder, you are subject to not only the whole set of terms, which usually include enforcement-related terms, in the documents that you've agreed to as part of the loan, but you're also not, generally speaking, an independent actor. If you're an independent actor, you have an immediate set of remedies available to you, and you are free to go and begin using those remedies as soon as you have an enforceable judgment. It's notable that Argentina has in the past consistently paid arbitration and judicial awards, consistently meaning ever since Argentina rejoined the capital markets. Just when you ask do we worry about it, we're -- it's, of course, something we pay attention to, but we -- as Chris said, we understand the difference between having a court judgment and being a sovereign debt holder. So after a seven-year slog, it's really quite exciting to be coming close to the finish line, the finish line being in sight now and we'll see what happens next in that case. So after a long wait, hopefully, there will be some news in that case before too long. But thank you for your support and patience while we have, in turn, endured court delays in the pandemic and we're excited that there is light at the end of the tunnel, both in YPF and in the courts in general."
}