{
    "symbol": "METC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 12:07:05",
    "content": "  Operator: Good day, and welcome to the Ramaco Resources Incorporated Third Quarter 2022 Results Conference Call. On behalf of Ramaco Resources, I'd like to welcome all of you to our third quarter 2022 earnings conference call. These statements are subject to risks, uncertainties and other factors, many of which are outside of Ramaco's control, which could cause actual results to differ materially from results discussed in the forward-looking statements. Any forward-looking statements speaks only as of the date on which it is made and except as required by law, Ramaco does not undertake any obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Lastly, I'd encourage everyone on this call to go onto our website ramacoresources.com and download today's investor presentation under the events calendar. In fact, the first three quarters of '22, we generated almost as much adjusted EBITDA as we did in the previous five years combined. Headwinds were due to the Berwind Ignition event in July, a 45% decline in seaboard coal pricing in the past few quarters and continued logistical rail and trucking challenges in shipping our coal. With that said, we are positioned for both a record fourth quarter and full year 2022. On the sales front, we are now fully sold out for 22 at an average price of $211 per ton. For 2020 to '23, we have placed roughly 1.8 million tons or about 45% of expected production. Next year, we project that over 60% of production will sell into export markets, much of that at index-based pricing. Lastly, in September, we closed on the Maben acquisition, we're beginning to bring that mine online and anticipated being a meaningful earnings contributor in 2023. As we look down the road, 2023 indeed looks to be more of a transformational year for us than even 2022. Among other reasons, we anticipate doubling production next year to roughly 4 million tons as compared to 2021 levels. On the back of these milestones, we would like to provide an initial framework on our plan 2023 shareholder return program. I would remind everyone that Q1 '22 was the first time we even paid a dividend on our stock, which we doubled before the first payment had been made. Today we are articulating a framework for the third leg of the stool, which is our future share buyback program, which we'll address next month at our Board Meeting. Accordingly in '23, we hope to commence a return to free cash flow towards share buybacks in addition to our regular cash dividends. We will continue to grow organic production from internal funds, pay-off the relatively limited debt we have and pivot to execute on new production from the reserve acquisitions we have made over the past year. At today's stock price, we regard buybacks of our stock as an attractive financial proposition. Importantly, as we return shareholder capital, we want to strike a strategic balance with long-term plans for low-cost organic production growth. The ongoing events in Ukraine created an unusual dynamic, where historic pricing between thermal and met coal inverted late this summer. Over the past few months this relationship has since largely moderated with met coal prices moving higher, and API to European thermal prices lower. Our main takeaway is it in terms of having to replace Russian coal, European utilities are covered through year-end but 2023 is a different story. Even with a drop in gas prices, given global supply constraints, we struggled to see where the replacement tons will come from. And I'd also like to point out the pricing for our main met product, U.S. high vol A has remained resilient with current netback pricing around $225 per ton. So in closing, we remain on track to have a record year in '22, this is despite a host of challenges so far, such as labor tightness, inflationary pressures, logistical rail and trucking constraints and the Berwind ignition event. We anticipate 2023 to be meaningfully more profitable than '22 with greater production in cash generation, and we also look forward to returning increasing amounts of cash to our shareholders. Now with that, I would like to turn the floor over to the rest of the team to discuss more detail on finances operations in the market. Diluted EPS was $0.60, versus just $0.16 in the third quarter of 2021. Importantly, we anticipate 2023 results to be even better due to roughly 50% volume growth with almost half of our 2023 coal already sold at very strong margins as Randy noted. Unfortunately, in the third quarter, we built another 56,000 tons of inventory, largely on the back of continued logistical issues, bringing the year-to-date inventory builds to 235,000 tons. Now turning to our full year 2022 outlook, I would like to touch on a few of the key areas in our guidance tables. First, we are lowering production guidance from 2.8 million to 3.1 million tons to 2.7 million to 2.9 million tons. We expect sales to come in roughly 200,000 tons below production, due largely to the aforementioned logistical challenges. Midpoint of production guidance is down modestly at each of our three complexes, as we have experienced a bit slower than anticipated production ramp at our new mine. However, I am pleased to report that we are now at over 700 employees compared to around just 400 employees this time last year. Second, we're increasing our cost guidance from $89 to $97 per ton to $98 to $102 per ton. The increase is the result of industry wide inflationary pressures, such as continued high sales related and raw material costs. However, we did start to see some of these pressures ease in the third quarter with overall costs down $8 per ton from the second quarter, and $98 per ton. Looking out across the landscape, I believe our third quarter costs of $93 per ton at Elk Creek were among the lowest of the peer group, which is ultimately where we expect our cost to remain on a relative basis. We continue to anticipate costs moving lower on stronger production, moderating raw material prices and the positive impact from the startup of the Berwind preparation plant. Lastly, on the 2022 guidance front, we are increasing our CapEx guidance from 105 million to 125 million to 120 million to 130 million, this $10 million increase at the midpoint is reflective of a switch from a contractor to an owner operator model in a couple of our smaller mines, as well as general inflationary pressure on things like equipment. Turning to our growth outlook, we are maintaining our medium-term target of 6.5 million tons of production. As a reminder, Slide seven details that we believe we can get to 6.5 million tons of production in 2025 at a very favorable CapEx intensity. Specifically, for a total of $95 million in gross capital, split between 2023 and 2024, we anticipate completing our full build out of 6.5 million tons of annual production. Importantly, as Randy detailed, in addition to our industry leading production growth profile, we continue to anticipate returning increasing amounts of cash to shareholders while also maintaining a conservative balance sheet. I'd now like to turn the call over to our Chief Operating Officer, Chris Blanchard. Before delving into the discussion of the operations, I want to recognize and congratulate the employees at our Elk Creek preparation plant for their continued excellence and safety performance. Now turning to some of our operational milestones, at Elk Creek we are beginning our upgrade and expansion of the Elk Creek prep plan. Ultimately, this will raise the processing and shipping capacity of the Elk Creek complex by 50% annually to approximately 3 million tons per year. This mine expansion, in addition to the continued rail challenges is what will lead to overall production being higher than sales in 2022. While numerous delays pushed the startup of the plant out of the third quarter, we expect the plant in full operation, two shifts per day later in November. We started two additional mines at the Berwind complex during the quarter, and both the Triple S surface mine and the Triad number two underground mine are fully ramped and currently producing at budgeted levels in the fourth quarter. We expect both operations to have multiple years of operation to complement the base Pocahontas #4 times, when the Berwind mine resumes operation. Now, the mine that this complex will either belt directly to the Berwind plant or the truck haul will be shortened by over two hours per round trip versus the Knox Creek plant. Depending on each mines, particular haul distance and washing recovery, the trucking savings will benefit these operations from between $15 to $30 per clean ton. Additionally, this allows us to shift a scarce resource that of coal trucks and coal truck drivers to the shorter hauls into Knox Creek. We expect to begin moving rock and clearing highwall mine in the first quarter, with production to follow shortly thereafter. With that high level review of the new operations and projects, I would like to now turn the call over to our Chief Commercial Officer, Jason Fannin for a discussion on our view of the current and forward coal markets. Even though the coal markets pulled back during Q3, met coal prices, as well as thermal coal prices remain elevated compared to historical levels. While steel production and capacity utilization have eased on the back of a slower global macroeconomic environment, met coal supply continues to lag demand even in this environment. The Australian premium low Vol spot price is now at over $320 per metric ton, while the U.S. high Vol A spot price is currently assessed at $300 per metric ton of nearly 25% from its low point during August. During much of Q3, U.S. high vol met coal pricing was strongly supported by the seaborne thermal market as Europe sought additional sources of thermal coal to replace banned Russian supply. While Europe appears to be covered in terms of coal supply for the winter, we believe Europe remains under bought for 2023 expect return to the market during early next year, driving continued supply tightness and additional pricing support in the met coal space. We are now fully sold out for 2022 and for the remainder of this year, we'll focus on meeting delivery requirements and what remains a challenging logistics environment. During Q3, we execute on our plan to diversify Ramacoâ\u0080\u0099s sales portfolio to include additional industrial and niche specialty coal consumers. Looking closer at 2023, we have locked in committed sales at 1.8 million tons, with 1.4 million tons fixed at an average price of over $200 per ton. Our committed volumes are a mix of domestic and seaborne sales to metallurgical, thermal and industrial customers. Additionally, 2023 will be our biggest year on a percentage basis in terms of seaborne sales, which will comprise at least 60% of our sales versus about 1/3rd of our sales being seaborne this year. We continue to see a protracted imbalance of coking coal supply and demand, which is supportive of a protracted period of elevated coking coal pricing levels. With that said, I would now like to return the call to the operator for the Q&A portion of the call. I think when we get to the Board level, obviously, we'll tweak it, perhaps somewhat, but where we are looking at it right now is, as I mentioned, registered a tracking stock which will be paid out in addition to our regular dividend on our Class A stock. So we've got really two dividend payments we're looking at and what we're thinking about right now is, when you would take both those two dividend payments and add them up, you'd have an X number. It's not a formula-matic X percent, because I'm not sure that we can calculate that without better understanding pricing and things of that nature. So for fixed price business, Curt, it's a good mix of sorts of domestic steel business, plus some domestic industrial and actually some export thermal business in there. And so that's about 1.4 million tons and then we've got 400,000 tons, it's indexed. Curt for us for 23 is, I highlighted is that the domestic steel businesses lower than we historically have done in the past, we just felt we could get a lot better realizations in other markets. So by the end of the year, probably be at an exit run rate of about 4.4 million, the first half will be a little bit slower while we wait on the Elk Creek preparation plant to upgrade. And presuming a lot of assumptions on the Berwind restart, over a million there and a little less than a million at Knox Creek run rate. I mean, obviously, you can back into our Q4 number and see that it's the highest production figure for the year, but certainly, below the kind of the full year number for next year, which makes sense given we're not including Berwind in there. So I would just say simplistically speaking, if you model production increases over the next X number of quarters, that's probably the right way of thinking about it. And lastly, Curt, not to belabor the point, but we've got a slide in our investment deck, I think it's slide six, which is got a pretty decent layout of where we view production over the next, let's call it 36 months, which gives you the cadence there per year. So yes, short answer is Q3 does reflect the full benefits of the royalty business as its savings as it exists today. But remember, we're ramping our Elk Creek plant from, call it 2 million tons to 3 million tons. So as we produce more coal at Elk Creek incrementally, we should see more royalty savings moving forward. Secondly, Elk Creek cash costs of $93 per ton. And then for 23, I guess, what we're going through our budgeting process right now, but certainly 23 should be below 2022 levels, even at current prices. We'll have a full year of trucking savings with Berwind plant, operational and economies scale, I mean, as I said, we've got 700 employees today versus about 400 this time last year. So, all in all, I liked the way our cadence looked in Q3, and I like where it looks heading into next year. Then another question on the commercial side, in terms of the index tons for 2023. Is that a met coal index or API 2 and then I recall, you sold some thermal coal here for the balance of the year if I remember, right. On the thermal sales for the balance of this year, they are mixed primarily they are tied to the index. The back half of this year, for 23, those export steel, customer sales are tied to met coal pricing indices. Can you remind us what's quantum are we -- should we be thinking about for Q4, and again, just to confirm those would all still be floating with where API 2 is today. So, again, this will be kind of Randy noted in his remarks, this will kind of be, at least for the next five quarters, Q4 will be the last one where we're heavier on the domestic side, for the most part, certainly next year will be at least 60% export. And then looking at the full year sales guidance, obviously a little bit decrease there. A little bit of both on the trucking and the rail, we have had a buildup of clean tones on both railroads on the -- hauling it to our customers. But we've also had challenges moving raw coal, particularly at our Knox Creek and Berwind operations before the startup of the Berwind plant, trucking it to our Knox Creek plant to get it processed. And frankly, that there's a limited amount of coal trucks and coal truck drivers and labor is scarce. So that's been a big challenge in the third quarter, and the startup of the Berwind plant largely eliminates that exposure to that constraint. And then maybe next, just kind of looking at the Berwind mine. Again, a full year '23 production was pulled down a little bit and it was roughly 4.3 million before now we're at roughly 4 million tons. And then, in regards to idling costs that we saw $5 million in the quarter. And then, I would say the 5 million per quarter is a little bit light, I think the fourth quarter will be a little bit higher. Yes, so you're correct about next year. So if we go ahead with all the projects that we've got laid out, it's about $55 million of growth capital. I mean, I guess the way I look at maintenance capital, and all that Chris kind of touched upon and inflation is -- in a normal environment, it's about $7 or $8 a ton. But again, some years, it's much lower than that. Some years, it's higher than that. So obviously, everything that we do on maintenance CapEx is not directly linked, but it's tied to steel pricing, and there's a lag. I just want to thank everybody for joining us today and we look forward to speaking to you I guess, next year."
}