{
    "symbol": "VSCO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-25 12:30:24",
    "content": " Our international business continues to be a bright spot, with sales up nearly 30% compared to last year and we returned the business to profitability in the last two quarters. And I think I will take a big step back and kind of say, when we think about the progression of the business and the improvement and the stabilization in the operating income base over the last handful of quarters or couple of years, pre-pandemic operating income was around about $100 million. During the pandemic and now with the repositioning of the brand, there has been meaningful improvement in both the leverage and efficiency in the model through the profit improvement plan and the gross margin rate improvement around inventory management, and in more normal times, something more like last year, our base operating income was around about $900 million or ever so close to that mid-teens operating income rate very early in the revolution of our strategy and the revolution of our brand. This year, as Martin just mentioned, as we have written in some of our prepared remarks, at the midpoint, our operating income is more like $550 million or 8% or 9% again in a very difficult environment, the key headwinds there being sales and supply chain over the last 12 months. If we think about second quarter margins being down a little over 500 basis points and weâ\u0080\u0099re guiding to a similar outcome in the third quarter, I would suggest to you that from a margin standpoint, the promotionality from second quarter to third quarter, we expect to be relatively similar as we look at margin rate, promotionality might be approximately half of the gross margin rate decline with the other half being a combination of, depending on the quarter youâ\u0080\u0099re looking at, being a combination of either supply chain pressure we experienced in second quarter or in the third quarter, where supply chain kind of moderates. Martin, I am just wondering if you can take a step back and you can elaborate a little bit on sort of the big picture transformation, the progress that you see, some of the anecdotal things that you noticed in the quarter that gives you confidence, the brand is moving in the right direction, that consumers are noticing and they are starting to realize that Victoriaâ\u0080\u0099s Secret is a much different brand today than it was 3 years, 5 years ago."
}