{
    "symbol": "EML",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 15:57:04",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to The Eastern Company First Quarter Fiscal Year 2022 Earnings Call. Speaking today will be Eastern's President and CEO, Gus Vlak; and our CFO, Peter O'Hara. Please note that some of the information we'll hear during our discussion today will consist of forward-looking statements about the Company's future financial performance and business prospects, including, without limitation, statements regarding revenue, gross margin, operating expenses, other income and expense, taxes and business outlook. In addition, during today's call, we will discuss non-GAAP financial measures that we believe are useful as supplemental measures of Eastern's performance. Before Peter reviews the detailed results with you, I would like to take a few minutes to reflect on the quarter. Orders from our customers were strong, and importantly, our backlog at the end of the first quarter reached $86 million. For example, our Big 3 Precision team build new sales and project management capabilities to capitalize on the increase in new automotive launches, including several electric vehicle launches. As a result, sales of our returnable transfer packaging products grew approximately 16% in the quarter compared to the prior year. That's an increase of 12% over 2021, and ACT Research projects that 265,000 new Class 8 trucks will be built in 2023. We sustained our momentum from last year through the first quarter and into the second quarter with strong sales, a healthy pipeline, and growing end markets, and solid execution by our teams. We temporarily dedicated additional capital to improve our inventory on hand, which did impact our free cash flow generation during the quarter. In addition, in the quarter, we experienced a resurgence in raw material costs for certain key commodities. And while material cost inflation impacted gross margin in the first quarter, we are working to mitigate the impact primarily through successive rounds of needed price adjustments across each of our businesses. Now, as you may know, John Sullivan is retiring after a 46-year career at Eastern and Peter O'Hara has joined us. Thank you very much, Gus, and thank you to everyone who's on the call today. It's an exciting time to join The Eastern Company, and I look forward to building relationships with our customers, shareholders and analysts. For the quarter, net sales increased 12% to $69 million from $61.8 million a year earlier. Our returnable transport packaging sales benefited from an increase in upcoming new automotive product launches, including several electric vehicle launches. The effect of volume on existing products increased net sales by 4% year-over-year, while price increases in new products contributed an additional 8 percentage points. New products included various truck mirror accessories, rotary launches, D-rings and mirror cams. As a percent of net sales, product development costs were 1.7% for the quarter compared to 1.6% in the first quarter of '21. Selling and administrative expenses increased $0.9 million or 10% year-over-year, primarily as a result of increased commissions and other selling costs, payroll-related expenses and travel costs. Notably, adjusted for one-time items, earnings per diluted share from continuing operations for the first quarter were $0.46 compared to $0.69 in the prior year. In terms of operating cash flow, the Company consumed approximately $3.6 million of cash from continuing operations during the first quarter of '22 compared to generating approximately $1.3 million in the prior year. And so as a result, both inventories and accounts payable have increased due to increased shipping time, port congestion, and selective pre-buying of raw materials to ensure availability and to mitigate the impact of likely future inflationary price increases. We're fortunate enough that most of our floating rate term debt is covered by an interest rate swap, which simply means the impact of increases in interest rates on our monthly interest payments will be relatively muted. With the current dynamics in the market for printed circuit board assembly, Argo is a really good asset and the business reported very strong sales and earnings in the first quarter. Material costs clearly have increased quite a bit over the last year, looking year-over-year. But looking sequentially, it seems like at least in some key commodities like steel, prices have been more stable or maybe even down sequentially, I guess, depending on how you look at it. These recent -- the latest price increases or cost increases to us were primarily in zinc, some of the cost for zinc, and we use quite a bit of zinc and aluminum. And when we pass through those price increases, we have more of a delayed impact based on the nature of the customers that we serve with those kinds of products. So as those commodity prices continue to increase, we started to prepare with our customers for those price increases. There is nothing structural in our business that cause us to believe that our margins would stay where they are today, but it is taking us some time to get back on track here. And the price increases would -- as soon as they take effect, also be effective for anything that's in the backlog that has not yet shipped. Over the last year, our teams have become increasingly effective at managing the supply chain pressures, volatile raw material costs, and that we've driven dramatically better throughput."
}