{
    "symbol": "VMD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 20:30:40",
    "content": "  Operator: Greetings, and welcome to the Viemed Second Quarter 2022 Earnings Conference Call. Please note that our remarks in this conference call may include forward-looking statements under the U.S. federal securities laws or forward-looking information under applicable Canadian Securities Legislation, which we collectively refer to as forward-looking statements. Such statements reflect the company's current views and intentions with respect to future results or events and are subject to certain risks and uncertainties, which could cause actual results or events to vary from those indicated in forward-looking statements. Because of these risks and uncertainties, investors should not place undue reliance on forward-looking statements. The forward-looking statements made in this conference call are made as of today, and the company undertakes no obligation to update or revise any forward-looking statements except as required by law. The second quarter financial news release, including the related financial statements are available on the SEC's website. As always, we'd like to begin by acknowledging and thanking the dedicated team of respiratory therapists, behavioral health specialists, staffing professionals and administrative support staff, who worked tirelessly to deliver the best-in-class care to our patients living within the communities we serve. As of June, our Viemed family grew to 715 employees, a 25% increase over the number of employees a year before. Our renewed unrestricted access to referral sources and partners resulted in robust growth during the second quarter, a trend that we expect to continue based on feedback from the field. Overcrowding and physical facilities, labor shortages and supply chain constraints are reinforcing the critical need for the home-based care solutions that we provide to patients. Our strong relationships with manufacturers, our well-trained labor force and our innovative approach to care and data capture is demonstrating the partners that Viemed is a premier solution to larger-scale population health programs. According to the recently released peer-reviewed medical study, when patients are placed on non-invasive ventilation, within the first week of diagnosis, total annual medicare spending was reduced by 12%, while risk of death was simultaneously reduced by 43%. During the second quarter, our sales force was provided with robust training on the pre-published results of the study in preparation for the official June 29 release. Our team is currently in the field executing on a national rollout of the new study, communicating with referral sources the need to get patients immediately on therapy after diagnosis. During the second quarter, we announced the successful appeal of the findings from the OIG report. While we have always maintained that the findings in the report were completely unsubstantiated, the success of the appeals sends a clear message to our external stakeholders that Viemed has consistently provided a true industry best standard of care. In the first half of the year, we identified a tremendous opportunity and successfully executed on a capital strategy to buy back common shares at an incredible value. During the first half of the year, most of the increases in our costs were associated with the hiring and retention of our labor force to support our significant organizational growth. Our organic expansion has helped us to create an internal promotional opportunity, many internal promotional opportunities for our existing employees to grow their careers within the organization, while simultaneously developing our people and minimizing the turnover. VieMed Healthcare Staffing has sourced approximately one-third of the new sales hires in 2022, and we are extremely proud of the growth of the incremental revenue producing staffing activities as well. While margin percentages have also been impacted by the evolution of our product mix, we are seeing the positive long-term benefits of revenue synergies based on the diversification of our portfolio. For example, the growth of the oxygen business serves as a wellspring for ventilator patients as disease states progress. Our high-touch, high-tech model creates strong relationships with patients that can evolve over the course of their care journey. While many other corporations and sectors are preparing for a possible recession by slowing investments, we believe there is significant and growing demand for the cost-effective, life-saving services that we provide. With more in our operations, financials, the buyback and the regulatory landscape, I will now turn the call over to our Chief Operating Officer, Todd Zehnder. Our core business generated net revenue of $33.1 million during the second quarter of 2022, as compared to net revenues of $26.3 million in the second quarter of '21, which equates to a 26% increase. We've once again seen solid growth in our major product lines being, Vents, PAPâ\u0080\u0099s and oxygen. Our COVID-related revenue was only $200,000 for the quarter as we have seen the need for these services go down as the country gets back to normal post the pandemic. Our margin percentages, both gross and EBITDA, are once again very healthy and are now back to being just from the core business lines. Our gross and EBITDA margins during the quarter came in at 61% and 19%, respectively. Our second quarter gross and EBITDA amounts came in at $20.4 million and $6.5 million, respectively. Importantly, our vent revenue has grown during the same time, but the product diversification is beginning to show up more and more each quarter. To put this in further context, our second quarter vent active patient growth was the highest quarterly growth since the second quarter of 2019. The impressive stat is that we have now doubled our total rental patients, which includes vents, vest, O2 and PAPs since the beginning of the pandemic. Our SG&A for the quarter totaled approximately $17.5 million, as compared to $12.9 million in the second of 2021. As we continue to grow our ancillary product lines, we should see cost efficiencies through scale, as well as the positive effects of offering a wide array of respiratory products around the country. We, like most companies, are seeing inflationary effects across the board, but have managed those as much as possible while continuing to offer superior clinical care to our growing patient count. For the quarter, we invested approximately $7 million on capital expenditures. As we have managed through the lengthy pandemic, as well as the Philips recall, we are happy that we have maintained adequate supplies to service our growing patient base. We continue to have a pristine balance sheet, where at June 30, we had a cash balance of $22 million and an overall working capital of $24 million. Our total long-term debt remains at $4.3 million, and we have continued executing on the stock buyback. As mentioned last quarter, we began our buyback efforts on the previously disclosed board-approved buyback. During the second quarter, we bought back 960,689 shares for total expenditures of approximately $5.1 million. We are pleased that we've been able to execute on our organic growth strategy, as well as our stock buyback, all while remaining an extremely low leverage company. Moving on to the ongoing OIG and CMS issue related to our NIV claims, we are continuing to work through the process of finalizing the results on these claims. Importantly, during the second quarter, we received the results from the qualified independent contractor, whereby they ruled that the patients in question actually were deemed medically necessary. There are eight patients that have been deemed ineligible for several factors and the company has filed the next level of appeal on these patients, which is going to the ALJ. While we continue to seek a resolution to this issue, the company has reduced the total exposure for this review to approximately $1.1 million. We've provided net revenue guidance in the $34.5 million to $35.5 million range, all related to our core business. With that, I'm going to turn it back over to Casey to wrap things up. Looking back to the second quarter, we really began to see some interesting trends with our hospital and physician referral source partners. Yes, there was certainly pent-up demand from patients just getting back in to see their doctors, but our hospital partners are giving us no indication that they will be receiving any kind of relief anytime soon. Unfortunately, the health systems struggle with this demand as Medicare patients tend to be more needy, making them less profitable. At Viemed, we have been developing these programs for our hospital partners, and we'll continue to pursue a new way of treating more patients in the home and greater volumes. Rather than trying to be a company who treats every disease  for all people, these technology platform companies are looking to partner with leading disease management companies, who can perform care with the human touch. In closing, our organic growth strategy is as strong as it's ever been and growing at a fast rate. While we are experiencing inflationary cost pressure, our management team is laser-focused on creating operational efficiencies that maximize our capacity to help reduce this exposure as we look to grow through this challenge. With the help of our diversification products, we have doubled our patient count since the pandemic began. Perhaps the most exciting piece to all of this is that we have yet to grow through acquisitions, and we see a major opportunity to do so in teaching our organic model to others as we bring them into the fold. With regulatory headwinds at an all-time low, the future seems extremely bright for Viemed. We thank all of you on the call who have placed your trust in our company, and we look forward to continue to add shareholder value throughout 2022 and beyond. And you guys talked about it, what's going on, what you're doing to drive organic growth. And that's just historically the way we've analyzed it and have not been as concerned about the gross amount, because revenue was always growing faster. I think we're in a period where we turned the organic engine on again, and it's always more expensive on the front-end of our growth is what we've historically seen, along with inflationary items. I mean everything from hiring new people is costing more money, retaining people is costing more money, commissions are at an all-time high, because growth is at an all-time high. And then the things like travel and fuel and all those things that are hitting us just combined to, I guess, what I'd call, somewhat of a perfect storm. We want to reverse the trend, but we're also not going to quit growing G&A, because it is the fuel for our future revenue growth. It doesn't sound like you're having difficulty finding good people out there, but comment on that, if you will, and availability of equipment. Obviously, the Phillips recall, but -- doesn't sound like you're having great difficulty getting the equipment you need to service the patients, but talk about that, if you will. The people really points back to the good work that Viemed Healthcare staffing is doing, our new division. They've gotten really good at understanding what makes a successful Viemed sales rep, respiratory therapists, clinically, so on and so forth. We expect to take less pressure off of our current internal recruiting efforts, which really follow on our regional sales managers, it frees them up to manage more people to hold more folks accountable and really get these new people up and running at a faster rate. So by -- our goal is by 2023, we'd like Viemed Healthcare staffing to take over all recruiting efforts. As you know, Brooks, you've been with us for a while, that is the driver to our organic growth strategy. The faster we find salespeople, the faster we get incremental new areas up and running, and that's why we've been able to add nine new areas here this year. As it relates to equipment, we -- it's still the same story as it was last quarter. Our strategy, whenever the Phillips recall began, was to do a patient acquisition movement throughout the country rather than going out and spending the money on buying distressed companies, we wanted to go out and really capture those patients, who were sitting on waiting list in needs. But the only thing that we struggle with is we've got a little bit of an internal process going to where we have to get machines back to Phillips, they've got to fix them and get them back up and running, get the foam out of the back of the machine then we've got to get it out back into the field. So it sounds like you've got the OIG investigation pretty much under control, if I was listening properly, $1.1 million, kind of, estimated future exposure. Can you just talk about how you think about that in terms of -- at what point do you kind of blow the whistle and call the game off and say, okay, let's meet in the middle and settle this and move our separate ways. We -- and it's truthfully, it's -- the lift at this point is pretty minimal. So basically, it's just us and a judge and anybody from the government talking about eight specific patients, which we feel very comfortable that we'll have a positive outcome. So the time that we've spent on this, the time that we have outside health spending on it is definitely at a minimal pace now. I think at the end of the day, the most positive thing for us and our industry is we now have learned from another audit that we're doing the right thing and treating the right patients. And it's just -- it's not a whole lot of work to finish it, but we are going to finish this. Weâ\u0080\u0099ve made an official announcement for those on the call that would like to brush up on their backgrounds, but the short story is that these guys together were at the lead of over $1.9 billion worth of acquisitions for LHC and handled 100 acquisitions in-house. And so this is really the beginning of a dedicated team to the M&A strategy, whereas before, we were all somewhat moonlighting on that growth strategy. Excuse me, just following along from -- we'll start off with following on from the SG&A topic. I guess according to your MD&A, had 715 full-time employees at the end of Q2 versus 662 in Q1, so that's up 8%, where G&A was up 10%. So you could see it's the majority of head count, I guess, in my opinion. It's going to continue to grow as we continue to expand, but I think you're going to see the absolute headcount slow down some. We were stressing the RTs from a patient count standpoint, so we've had to hire some drivers. We've had to hire some more back-office people because like I said, we've doubled the rental patients. So it's just taking more people to do the task in the home office as well, billing, intake, working with insurance companies, all those type of things. In other words, what do you -- can you get EBITDA margins, say, in four quarters from now back up to 22%, 23%. But the other factor to this is, as you guys know, we will get our -- I mean, the thing that will go straight to the bottom line is when we get our CPI adjustment of the first quarter of '23. We're not waiting on that to work on our margins, but the inflation base was 9.1% at the end of June. So we'll wait and see what the actual adjustment is, but we are due to have a pretty good rate increase from CMS, which translates into most of our commercial payers as well. But just without that, I would tell you that we are going to grow revenue and we're going to -- we will start to normalize G&A as a percentage. This quarter, revenue per active vent patient on an annual basis was by my calculation, $14,625, which is a record and that's up from $13,270 last year. I mean you hardly quoted, we went from 79% in the second quarter of 2021, contribution of vents is 69%. So when that -- the PAPs, oxygen and vents primarily get extra 10 percentage point that's obviously going to drive that up. So the revenue per vent patient will be driven by, A, how much we're getting reimbursed for vents; and then B, how much of these ancillary products make up of the contribution. So it could go way higher if we went to 50-50, let's say. It's going to be it will show that these other products are doing what they're supposed to do, which is entering patients into the Viemed cycle earlier in their disease state. And speaking of vents patients, you finished the quarter with 8,837. I would like to think that we can do that again this quarter and hopefully next, but we'll just have to wait and see. We would consider another vent company as well in a region that we're not in with insurance contracts that we don't have, Doug. So we don't turn our nose up to just a strictly vent company, but we're still looking for respiratory type durable medical equipment businesses that are inclusive of the majority of the products that we sell. We know that we might pick up a product line or two that we don't really manage over here at Viemed, but we certainly have the legacy DME knowledge and the teammates here in-house to kind of work through all of those processes. Doug, I mean, I know the last time I looked at it, it was still at like 45, but it could be higher right now. But yes, we're pretty close to having total lower 48 coverage right now. I'll just give you an example, like New York State is a state that we would have to have a brick-and-mortar facility with a working storefront and so on and so forth. So technically, we would call that a state that we're in. However, we're not really doing the business that we know we need to be doing in New York State. That used to be a state that we weren't in, but we might have four or five, maybe six reps, something like that in Florida right now that are really doing well. We've got a couple of people over there and a handful of patients, but by no means are we making any movements in California. Sorry, one more if I can, just Phillips came out the other day, I guess it was a week or so ago, and we gave some sort of positive outlook on fixing the recall issue. I mean, there is -- like Casey mentioned on the call, we are repairing the phone, which is a process that we just had transfer it back to Philips and that's ongoing. On the PAP side, we haven't seen new PAP shipments yet, but we're still anticipating -- I think the formal guidance they're giving us is later in the fourth quarter. So we luckily or I guess, proactively not had that issue but it will be nice to get Phillips back in the game from a PAP standpoint and have everybody contributing to the supply issues that are out there. First, you've talked about the evolving product mix. Yes, I would expect to continue to see a little bit of increased contribution from the oxygen and sleep businesses as we are seeing the benefits of our sales force around the country, distributing that. But the vent patient growth that we saw in this quarter and what we're kind of seeing coming in the third quarter, to me, is showing a stabilization of that percentage sum. I don't exactly know quarter-to-quarter where it's going to go, but I could see it trickling down a little, but I don't see it going down 10%, like it has over the last 12 months. But I think that kind of like what I was telling either Brooks or Doug earlier, I think the offset is that the G&A is going to stabilize as we've ramped up headcount for those divisions. We've always said that it was good while it lasted, but we won't be -- we want patient access and physician access could be there. If it comes from an inventory standpoint, we're clearly ready to serve and to help different facilities. I mean we've clearly -- we've laid that down, if you will, but we can stand it right back up. I would say the other piece that we're ready for is if there are hotspots and there are need for people, now that we have Viemed Healthcare Staffing up and running and effectively doing what they do, if there are COVID hotspots that need help, we could serve as a resource there. Ladies and gentlemen, we have reached the end of today's question-and-answer session."
}