{
    "symbol": "COHR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-09 12:08:11",
    "content": " We are very excited to be able to best support our customers with higher data rates, particularly hyperscalers in their build-out of AI super clusters in a market which industry analysts are projecting to grow by 20% in calendar 2022, and we continue to experience double-digit growth for at least another three to five years. Cash flow from operations in the quarter was $188 million and free cash flow was $133 million, including CapEx of $55 million and a strategic inventory build of $50 million in the quarter, $100 million for the first half of the fiscal year to support our growth beginning in the second half of fiscal year 2022. But at the end of the day, we are looking to be shipping off some of this capital relatively shortly in the back – in the middle of the year, which could technically span the last quarter of fiscal year 2022, the first quarter of 2021, and we're looking forward to being able to get those products delivered to customers. I’m fully expecting that as a result of the increase in the number of fab starts, the work that we’re doing now to shake out the overall process capability and process control, getting the sigmas tied down to where we need them to be, that we’ll have the ability, by the end of the calendar year, surely, as we head into the second half of 2023, we should be in a real good position to be entering as a launch point into the marketplace. And whereas we will have a longer-term approach to the automotive market, we will also be targeting other applications early on, as well as the automotive applications that we know will take us a little more time, but I’m fully expecting that the revenues will begin to accrue in the early part of 2023 based on our design-ins and our design wins that we’ll target in the second half of this calendar year. I think what we’ve said is as we make these investments in silicon carbide, silicon carbide-based products, which would include the substrates, in, say, over the next four, five years, is probably the business that has the most ability to change as a percentage of our revenue."
}