{
    "symbol": "RRGB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 21:45:50",
    "content": " Sales for Donatos pizza were approximately $6.2 million during the quarter itself, with a sales mix of approximately 60% dine-in, and 40% off-premises. We grew comparable restaurant revenues by 6.7% compared to 2021 in the second quarter, surpassing the casual dine-in segment in both sales and traffic as measured by Black Box Intelligence. Compared to 2019, our second quarter comparable restaurant revenues increased 4.1%, marking the second consecutive full quarter of positive comparable restaurant revenues versus pre-pandemic sales. Our ongoing focus includes effectively managing our bottom-line, dedicating free cash flow over the next several quarters to reinvest in our restaurants and infrastructure, while maintaining flexibility to pursue strategic initiatives that will generate profitable sales growth going forward, including adding Donatos to the balance of our system, ongoing investments in restaurant technology and our digital ecosystem, and new restaurant development. Second quarter total company revenue increased 6.2% to $294.1 million, up $17.1 million from a year ago, driven by increased pricing and favorable menu mix shifts, partially offset by declining category traffic. Restaurant level operating profit as a percentage of restaurant revenue was 13.6%, a decrease of 2.1 percentage points compared to 2021, primarily due to the following: Restaurant revenue increased by $16.5 million, primarily driven by increased pricing and favorable menu mix shift, partially offset by declining category traffic. General and administrative costs were $18.7 million, an increase versus the prior year of $1 million, primarily driven by increased stock-based compensation expense, merit increases, and higher manager-in-training costs partially offset by lower incentive compensation costs. During the quarter, we recognized other charges of $8.1 million, including $8.7 million related to the impairment of long-lived assets primarily related to six restaurant locations, $0.9 million related to restaurant closures, $0.1 million related to executive transition, and $0.1 million for COVID-19 related costs, partially offset by a net reduction of $1.8 million related to litigation contingencies."
}