{
    "symbol": "RRGB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-26 20:38:02",
    "content": " Our full quarter comparable restaurant revenues increased 3.9% compared to the same period in 2019, marking the first full quarter of positive comparable restaurant revenues to pre-pandemic sales. We intend to continue to effectively manage our bottom line and are dedicating free cash flow over the next several quarters to reinvesting in our restaurants and infrastructure, while maintaining flexibility to pursue strategic initiatives that will generate profitable sales growth going forward, including adding Donatos to the balance of our system, ongoing investments in restaurant technology and our digital ecosystem and new restaurant development. First quarter total company revenue increased 21.2% to $395.6 million, up $69.3 million from a year ago, driven by operating our restaurants that increased capacities in Q1 2022 and lapping prior year sales more aggressively impacted by the COVID-19 pandemic. Restaurant revenue increased by $61.9 million, primarily driven by favorable guest counts, menu mix, pricing and discounting. General and administrative costs were $25 million an increase versus the prior year of $2.8 million, primarily driven by increased stock-based compensation expense, merit increases and higher manager and training costs. During the quarter, we recognized other charges of $5.3 million, including $2.1 million related to the impairment of long-lived assets, $1.7 million related to litigation contingencies, $1 million related to restaurant closures, $0.3 million related to other financing costs associated with our new credit agreement and $0.2 million for COVID-19-related costs including purchasing personal protective equipment and COVID-19-related sick time for our restaurant team members. We are also executing strategic growth initiatives that will provide platforms for incremental profitability in the years to come, including Donatos digital menu quality and innovation, a differentiated team member value proposition and new restaurant development."
}