{
    "symbol": "IMRX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 22:50:05",
    "content": " Using humanized 3D tumor growth assays followed by select in vivo studies, we have identified NRAS-driven melanoma in KRAS-driven pancreatic cancer has two potential high priority indications that we believe are both largely unaddressed and may be broadly sensitive to IMM-1-104. The second abstract we presented at ASCO found KRAS mutant pancreatic cancer and NRAS mutant melanoma were the most broadly sensitive to IMM-1-104 in patient aligned 3D human tumor growth assays, and thus are included among the expected target indications for Immuneering Phase 1/2a clinical trial. Finally, the third abstract presented at SITC highlighted the preclinical activity of our second pipeline asset, IMM-6-415 as a single agent, as well as a combination therapy with checkpoint inhibitors in RAS-mutant colorectal cancer and non-small cell lung cancer models driven by diverse MAP kinase pathway mutation. In the past 24 hours, weâ\u0080\u0099ve released new preclinical data weâ\u0080\u0099ll be showing an AACR targeting RAS this week, which is a curative force in demonstrating the universal RAS activity of IMM-1-104 in preclinical models, and our clinical trials moving forward rapidly, because our enrollment criteria are truly universal-RAS, and soon it will be time to share data showing how that deep cyclic inhibition is playing out in humans. And, I think, one of the key takeaways from the poster is really the universal-RAS activity that weâ\u0080\u0099re seeing the fact that about 85% of the cell lines that we tested with RAS mutations in the humanized 3D tumor growth assay are really responsive to IMM-1-104. And I think all of this contributes to the really the universal-RAS activity that weâ\u0080\u0099ve seen preclinically and, frankly, supports the enrollment criteria for our clinical trial, which is truly open to patients with any mutation in KRAS, NRAS or HRAS. So, weâ\u0080\u0099ve described that across the multiple animal studies that weâ\u0080\u0099ve run each of which have shown very strong tumor growth inhibition in different models with different mutations in the RAS pathway in each of those weâ\u0080\u0099ve seen very little body weight loss and no more than 3% to 6% body weight loss, so really good tolerability. So, for example, when you look at the depth of sensitivity or response in the 3D-TGA, weâ\u0080\u0099ve generally observed in the models that weâ\u0080\u0099ve already published and disclosed on that the deeper responding models such as MIA PaCa-2, which is a KRAS-G12C pancreatic cancer model, as well as SK-MEL-2, which is a NRAS mutant melanoma model, which are highly sensitive in the 3D-TGA and actually show regressions or mid-cycle regressions in vivo."
}