{
    "symbol": "BE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 22:11:04",
    "content": " So as you think about the 2023 guidance that we put out for revenue, it's really around our core product today that we're selling on the energy server in the U.S. in Korea in other parts, where Tim has made a lot of progress on the international side. You're seeing them in the time to power area and resiliency both together, either separately or together, meaning and it is a large project that's meaningful for that customer around their ability to perform their operations today, or to bring additional operations online so they can meet their growth prospects. We don't have a lot of mix on our pricing, meaning that when we make decisions around where we want to put our units, whether it is here, or in Asia or in Europe, the decisions we're making is really where can we get the most amount of growth in the best return on margins, that tends to solve us to having very similar selling prices across across the globe. So as we look into 2023, the couple 100 basis, margin improvement that we're expecting, is really going to come from us holding our ASPs flat on after eliminating some of one time or for this year on a core basis and then taking our product cost down. Hi, thanks for taking my question. So where two or three years ago, I could have told you we shipped 188 megawatts of revenue, because we're shipping all natural gas servers globally, as you go forward, and you begin to think about deliveries of electrolyzers marine other things the power ratings with those are going to be different, micro grids, all of those things are going to get out for going forward. What we're seeing today for returns is we really work are not interested in entering a country today, that does not provide us both components of an opportunity to grow, meaning they value our product and there is a need for it, and we can sell it and get a healthy return for the shareholder in that growth. Hi, thanks for taking my question."
}