{
    "symbol": "SMSI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 18:47:09",
    "content": " Please go ahead, sir. For the fourth quarter, we posted revenue of $11.4 million compared to $14.7 million for the same quarter of 2021, a decrease of approximately 22%, as a result of the decline in CommSuite revenues, coupled with the decrease in Family Safety revenues. During the fourth quarter of 2022, Family Safety revenue decreased by $2 million or 17% compared to the fourth quarter of last year, primarily as a result of the reduction of the Safe & Found platform revenue related to the continued attrition of legacy Sprint subscribers, driven by T-Mobile's acquisition of Sprint. During the fourth quarter of 2022, CommSuite revenue was approximately $900,000, which decreased approximately $1.3 million compared to the $2.2 million in revenue produced in the fourth quarter of 2021. ViewSpot revenue was approximately $800,000 for the fourth quarter of 2022, which was essentially flat compared to the fourth quarter of 2021, and decreased approximately $200,000 compared to the third quarter of 2022. For the fourth quarter of 2022, gross profit was $8.1 million compared to $10.6 million during the same period in 2021. For the year ended December 31, 2022, gross profit was $34.3 million compared to $45.7 million during the prior year. GAAP operating expenses for the fourth quarter of 2022 were $15.2 million, an increase of approximately $700,000 or 5% compared to the fourth quarter of 2021. GAAP operating expenses for the year ended December 31, 2022, was $65.2 million, a decrease of $11.4 million or 15% compared to the prior year. Non-GAAP operating expenses for the fourth quarter of 2022 were $12 million versus $13 million in the fourth quarter of 2021, a decrease of approximately $1 million or 8%. Sequentially, non-GAAP operating expenses decreased by approximately $1.1 million or 9% from the third quarter of 2022, primarily due to decreases in personnel-related costs and in contractor costs related to the SafePath migrations. We expect first quarter 2023 non-GAAP operating expenses to decrease from the fourth quarter of 2022 by 4% to 8% due to the continued actions to reduce our cost structure, including the closure of our Prague, Czech Republic operations as of December 31, 2022. As Bill mentioned in his remarks, we are taking additional actions to significantly reduce our costs even further and anticipate that these actions will result in over $4 million of quarterly savings from our aggregate total non-GAAP operating expenses and cost of sales for the fourth quarter of $15.3 million. In other words, out of the $3.3 million in cost of sales and the $12 million in non-GAAP operating expenses reported for the fourth quarter of 2022, we will be eliminating $4 million in quarterly costs by no later than the third quarter of 2023. Circling back to the results for 2022, non-GAAP operating expenses for the year ended December 31, 2022, was $52.5 million, an increase of $4.7 million or 10% compared to 2021, primarily driven by the full year impact of the addition of the Avast business in April 2021. The GAAP net loss for 2022 was $29.3 million, a $0.53 loss per share compared to a GAAP net loss of $31 million or a $0.61 loss per share in 2021. The non-GAAP net loss for the year ended December 31, 2022, was $18.8 million or $0.34 loss per share compared to a non-GAAP net loss of approximately $2.2 million or a $0.04 loss per share in 2021. For the fourth quarter of 2022, that reconciliation includes adjustments for intangible asset amortization of $1.5 million, stock compensation expense of $1.1 million, convertible note and stock offering fees and amortization of $1.7 million and severance-related costs of approximately $600,000, partially offset by fair value adjustments of $1.2 million. For the year-to-date period, the reconciliation includes adjustments for intangible asset amortization of $6.3 million, stock compensation expense of $4.4 million, convertible note and stock offering fees and amortization of $3.1 million and severance-related costs of approximately $1.4 million, partially offset by fair value adjustments of $4.7 million. I know you're taking out $4 million of quarterly costs, part of that's in the COGS line. So the way to think about this is off of the fourth quarter, if you take our total non-GAAP expenses, so if you take the cost of sales plus our OpEx, we are going to take that fourth quarter number, and you're going to see $4 million eliminated from those total costs. Please go ahead, sir."
}