{
    "symbol": "SMSI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 18:31:13",
    "content": " 01:26 Please note that some of the information you will hear today during our discussion consist of forward-looking statements, including, without limitations, those regarding the company's future revenue and profitability, our future plans, new product development, new and expanded market opportunities, future product deployments, migrations, and/or growth by new and existing customers, operating expense, company cash reserves, and the expected impact of last year's acquisition of Avast's Family Safety Mobile Business and our business strategy, operations, and financial positions going forward. For the first quarter, we posted revenue of $12.7 million compared to $11.4 million for the same quarter last year, an increase of 12% as a result of an increase in Family Safety revenues, partially offset by a decline in CommSuite revenues. When compared to the fourth quarter of 2021, revenue was down approximately 13% driven primarily by decreases in revenues associated with CommSuite and our legacy Family Safety product lines. 06:32 During the first quarter of 2022, Family Safety revenue increased 64% to $10.4 million compared to the first quarter of last year. The primary reasons for the sequential decrease in Family Safety revenue was the continued reduction of the legacy Safe & Found platform revenue related to declining Sprint subscribers and the accelerated recognition of certain deferred revenue in the fourth quarter of 2021, due to a contract amendment executed with one of our Tier 1 carrier clients. 07:20 During the first quarter of 2022, CommSuite revenue was $1.4 million, which declined $2.7 million compared to the $4.1 million in revenue produced in the first quarter of last year. ViewSpot revenue was approximately $900,000 for the first quarter of 2022, which was essentially flat compared to the first quarter of last year and up approximately 11% compared to the fourth quarter of 2021. 11:11 GAAP operating expenses for the first quarter were $16.1 million, an increase of $3 million or 23% compared to the first quarter of last year. 11:30 Non-GAAP operating expenses for the first quarter were $13.4 million compared to $9.1 million for the first quarter of 2021, an increase of $4.3 million or 47% compared to last year. Sequentially, non-GAAP operating expenses increased by 3% from $13 million in the fourth quarter of 2021, due in part to the increase in contractor related to the SafePath migrations. 12:25 The GAAP net loss for the first quarter was $7 million, or $0.13 loss per share compared to a GAAP net loss of $3.2 million, or $0.07 loss per share in the first quarter of last year. The non-GAAP net loss for the first quarter was $4.3 million, or $0.08 loss per share compared to a non-GAAP net income of $700,000 or $0.02 diluted earnings per share in the first quarter of last year."
}